{
  "metadata": {
    "last_updated": "2026-01-22 08:58:07",
    "time_filter": "week",
    "subreddit": "agile",
    "total_items": 10,
    "total_comments": 149,
    "file_size_bytes": 227858
  },
  "items": [
    {
      "id": "1qdh744",
      "title": "After talking to hiring managers at Fortune 100 companies: Agile transformation is basically over",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1qdh744/after_talking_to_hiring_managers_at_fortune_100/",
      "author": "Maverick2k2",
      "created_utc": "2026-01-15 11:34:59",
      "score": 116,
      "num_comments": 83,
      "upvote_ratio": 0.9,
      "text": "The current state of the Agile market - based on conversations I’ve had with hiring managers at Fortune 100 companies.\n\n**Q: Do you need people to implement agile ways of working?**\n\nA: No. We’ve spent the last few years investing in our transformations. Now we just need people to focus on delivering the work.\n\n**Q: What would you like Scrum Masters to focus on?**\n\nA: Helping to put together delivery plans, facilitating the ceremonies, and making sure the work gets delivered on time.\n\n**Q: Is there scope to transform ways of working beyond team level?**\n\nA: No. We already have a framework in place and expect people to work within it. Any change can impact programme-level metrics and be disruptive.\n\n**My take:**\n\n**You can complain on principle that the role is no longer transformation-led. But if that stance doesn’t bring food to the table - and companies clearly don’t want it - what’s the point? You are just spreading misinformation and killing people’s livelihoods.**\n\n**Agile Coaches had the opportunity to coach this properly while leading transformations. Frankly, many messed it up. After all these years, if organisations still don’t understand the Scrum Master role, that failure sits with the people who were meant to teach it and ensure it was implemented correctly.**\n\n**You can’t spend a decade leading transformations, fail to translate the value in business terms, and then be surprised when leadership reverts to delivery-first roles.**",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1qdh744/after_talking_to_hiring_managers_at_fortune_100/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "nzpt83e",
          "author": "Big-Chemical-5148",
          "text": "This tracks with what I’m seeing too. A lot of big orgs feel done with Agile and now just want predictable delivery. The language changed from transformation to execution.\n\nIt doesn’t mean Agile is dead, just that the market moved on. Scrum Masters and coaches who can translate this into planning, risk management and getting work shipped are still valuable. The ones stuck in theory or ceremony for ceremony’s sake are the ones getting squeezed out.",
          "score": 22,
          "created_utc": "2026-01-15 12:25:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzptba9",
              "author": "Maverick2k2",
              "text": "Correction - Agile transformation as a role is dead.\n\nDelivering work in sprints is not.",
              "score": 17,
              "created_utc": "2026-01-15 12:26:23",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzpu0s1",
                  "author": "Hopelesz",
                  "text": "Indeed, a lot of us in larger companies took what works in agile for us and build a process around it. Each company will design a process that works for them, who in their right mind would try to 'apply' agile by the book? This never made sense.\n\nSprints on the other hand, have a good chunk of benefits to a working stream regardless of how the process is rounded up.\n\nIn my teams, the term agile coach is a joke. We have prodduct owners and delivery managers that understand how to move requirements from our stakeholders to the teams and focus on quick wins. This is what companies want. The idea of an agile coach has no value.",
                  "score": 12,
                  "created_utc": "2026-01-15 12:31:23",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzppx49",
          "author": "DingBat99999",
          "text": "My feelings:\n\n* Agile is basically dead. Oh, there will always be pools of high performing agile organizations that \"get it\". But as a large scale movement? It's dead, Jim.\n* Most organizations have successfully resisted changing to become more agile. If they're lucky, they have pockets of agility encompassing a product, or a team, but the overall impact is probably minor.\n* As you say, most agile coaches/champions failed to convince stakeholders of the benefits of changing, or, if they did, managed to carry through the changes. Whether or not that is the fault of the coaches or if they were mostly doomed from the start, I'm not equipped to judge.\n* I can't simply point to failures at the management level. If you look at the kinds of posts seen here in this sub, and others, it's tragic. Endless arguments over story points. Definitions of Ready and other \"agilified\" phase gates. Cargo cult approaches to methods. Scrum Masters who are essentially meeting schedulers. Complete lack of any sort of organizational feedback loop with actual change.\n* The rank and file of our industry largely rejected adopting agile as well.\n* We never drove the idea that software could be managed like a factory production line out of the industry and, given the current economic trends, it might actually be even more entrenched now. I'm still having arguments about basic ideas like slack in plans that I had two decades ago.\n* I'll always wonder if Beck & co had productized XP in the same way Scrum was productized. Could it have won the agile wars? Probably not. In my experience, most developers talk a good game about professionalism, but don't really want to put in the effort.",
          "score": 47,
          "created_utc": "2026-01-15 12:01:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzq5qyx",
              "author": "paul_h",
              "text": "Yup, XP is the best - thin vertical slices for the win!!",
              "score": 7,
              "created_utc": "2026-01-15 13:43:10",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzx7coe",
                  "author": "ContactExtension1069",
                  "text": "XP is great, helped us with PR nightmares.",
                  "score": 1,
                  "created_utc": "2026-01-16 14:06:34",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nzznczz",
                  "author": "luettmatten",
                  "text": "XP is part of the Agile family.",
                  "score": 1,
                  "created_utc": "2026-01-16 20:48:08",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nzrdbft",
              "author": "aefalcon",
              "text": "The sad thing is, most of the content of Extreme Programming Explained can be used within scrum.  Scrum.org's Professional Scrum developer test is at least 50% XP questions.  I just cannot get anyone to read that book.  I didn't read it until I was something like 12 years into the industry though.  However, I was given \"Mythical Man Month\" by a CTO 10 years before that.  Maybe I just need to order a pallet of XP Explained and gift it to everyone, lol.",
              "score": 4,
              "created_utc": "2026-01-15 17:11:00",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nzps5bf",
              "author": "Maverick2k2",
              "text": "It’s fine if Agile hasn’t been implemented as intended across industries.\n\nBut for people within the Agile Community to then go around bash anyone who is not actively transforming orgs is pathetic. \n\nIf Scrum Masters are not being paid to transform an org , then they can’t be held to that standard and told by people thar they are shit at their jobs.\n\nTraditional textbook Agile ways of working is also not the only only way to run an org. Many of these orgs not doing it properly are earning billions.",
              "score": 8,
              "created_utc": "2026-01-15 12:18:06",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzptb0q",
                  "author": "DingBat99999",
                  "text": "Meh.\n\nMany of these orgs earning billions were earning billions before anyone mentioned agile. The question is: Would they earn more if they were more agile? This is, of course, unanswerable.\n\nThe sign of a strong organization is how resilient they are in hard times. Earning billions alone isn't enough of a metric to warrant celebration, at least if measuring the impact of agile is the topic.\n\nBut adopting Scrum with the clear intention to reject change is.... not the smartest move. The Scrum Master IS a transformative role and always has been.\n\nAs for calling them \"shit\", I wouldn't do that for attempting to transform their organization and failing. All SMs have failed at that at one time or another. I call them \"shit\" for not developing the tools to even begin to have such a conversation.",
                  "score": 11,
                  "created_utc": "2026-01-15 12:26:20",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nzwu7o8",
              "author": "TheMagecite",
              "text": "Most places just completely butchered what agile is.  They put things like scrum on it and pretended it adhered to the good concepts.\n\nActually read the manifesto and you will realise just how wrong most places are.\n\n  \n[Manifesto for Agile Software Development](https://agilemanifesto.org/)\n\n\n\nHowever they blame agile, not their incopentance in trusting and hiring good employees.",
              "score": 2,
              "created_utc": "2026-01-16 12:53:08",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nzv9xac",
              "author": "Colt2205",
              "text": "The company I work for has daily standups with a scrum guy apparently under this particular team.  I'm not too into it as I got enough interruptions and already self manage using an excel sheet, which is basically a long term planner with estimates on completion and milestones.  I break off the smaller stuff and sub-items into one or two week estimated completion windows.",
              "score": 1,
              "created_utc": "2026-01-16 05:10:58",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nzy7n70",
              "author": "AdministrationWaste7",
              "text": "idk what people mean by agile failing.\n\na majority of orgs are implementing some form of agile methodology SOLD TO THEM by \"agile coaches\".",
              "score": 1,
              "created_utc": "2026-01-16 16:54:32",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzpw2w2",
          "author": "lakerock3021",
          "text": "Yeah, agreed with some specifications: the industry of Agile Transformation is slowing down (call it dead if you want to, idc) but Agile as an approach is becoming the current standard- hear me out:\n\nBefore Agile, software delivery was molded after manufacturing projects of the time, where start to delivery was 2-3 YEARS. Big huge investigative plan, ruminating internally to identify ALL the details, the pitfalls, exactly when who would be doing what. THEN execute the plan for 2-3 years and SEE if you could sell the product or if your users liked the new version (think Windows 95, Windows 98, Windows 2000... bulk build, release). \n\nNow, while there are still orgs who build software this way, most (granted limited sample size) are building much more Agile delivering multiple times a year, if not month. There is more receptivity to the ideas in the Agile Manifesto, there is more alignment with the Agile principles (regardless of if they are referenced).\n\nAgile mindset is a competitive advantage.\n\nIf you want to talk about frameworks of Agile (Scrum, Kanban, XP) sure these are not doing well (if even used correctly) and as you mentioned thousands of SM were \"paraded around\" to signal that a company was using Scum without going through the challenge that is a transformation (put makeup on a pig). I don't personally blame the Scrum Masters- they were dropped in a chaotic situation, but that is a rant for another time. But yes, there is a significant decrease in the opportunity for a \"Scrum transformation\" (maybe the same, just fewer orgs dressing up to \"play Scrum\" since it is no longer the fad).\n\nThere is still opportunity for organizational and department and team transformation- but as you made note of, it's not the ONLY accountability orgs are looking for from the SM or Agile Coach role. Some of that is moving to management, some orgs are asking for facilitation, delivery scheduler, and transformation. Just not enough appetite for it to be a full time role (and, c'mon look at the industry track record for \"transformation\")",
          "score": 9,
          "created_utc": "2026-01-15 12:45:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzu1zl3",
              "author": "Venthe",
              "text": "What we've seen is the ploriferation of companies that are able to leverage modern practices, like CI/CD pipelines, containerization, cloud and - for better or worse - shift left testing to adapt to the instant delivery/internet era.\n\nWhat we generally don't see is the companies \"uncovering the better ways of delivering the software\". Practices remained the same, only that the goals are now split into two weeks chunks; and the quality is down the drain.\n\nEven if it's somewhat aligned with the agile principles, I am fully convinced that this is only a coincidence - or rather - better tooling + market pressure reduced the frequency of delivery, nothing else.",
              "score": 3,
              "created_utc": "2026-01-16 00:52:51",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o039w49",
                  "author": "Maverick2k2",
                  "text": "A lot of companies accept that there might be delays , at which point, and if urgent, they get teams to work overtime. \n\nReality is a lot of orgs do not need to have perfect delivery processes, the strength of their product offerings means they will make billions anyway.",
                  "score": 1,
                  "created_utc": "2026-01-17 11:44:43",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzpvtny",
          "author": "davy_jones_locket",
          "text": "There's a lot of misconceptions about Agile transformation as a whole. \n\n\nStartups dont need transformations. They were born within Agile. \n\n\nEvery transformation I've been a part of since 2013 has been \"these are the boundaries of which we work, how can we adopt more agile ways of thinking within these boundaries?\" Sure you may have opportunities to push those boundaries, but at the end of the day, Scrum isn't the only flavor of being agile, you don't need a dedicated scrum master or product owner (I've held both roles at the same time for different teams with a completely different title within the org), and \"textbook agile\" is literally just the agile manifesto. \n\n\nIf you're trying to find a job with a title of agile coach, scrum master, product owner, etc... those days are long gone. They are folded into the responsibilities of other titles. Tech leads and engineering managers often serve as scrum masters. Engineering managers and product managers often serve as product owners. Engineering managers often serve as agile coaches. \n\n\nThis is why we said scrum master, product owners etc weren't entry level roles... Because engineering manager isn't an entry level role. Because tech lead isnt an entry level role. Sometimes product management can be. ",
          "score": 4,
          "created_utc": "2026-01-15 12:43:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzw1ypc",
              "author": "Maverick2k2",
              "text": "I agree that SM is not an entry level role. It is what it is though and a reflection of shit transformation.\n\nHere is thing though , the Agile community had their chance to do things properly when Agile transformation was the craze. We only have ourselves to blame now that the market has moved on for not guiding companies the right way.\n\nEarlier on in my career , I remember working in companies that had a legion of Enterprise Agile Coaches. What the hell were they doing?",
              "score": 2,
              "created_utc": "2026-01-16 09:03:14",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o021c3s",
                  "author": "Affectionate-Log3638",
                  "text": "My organization threw tons of people into agile roles that had zero experience in them. Primarily project managers. I think things would have been rough but gotten better if they actually had agile mindsets and were willing to learn and adapt over time. But most of them were rigid and carried ways of thinking that completely undermined agility. All of our coaches, RTEs, and most of our Scrum Masters held/hold on to out-of the-box SAFe for dear life. They kept and continue to keep stuff that clearly didn't work, and never fully fleshed out generic concepts that could work with more development.\n\nAnd then you have consultants coming in with deeper knowledge of agile, but zero understanding of our organization's structure or culture. So they have zero idea how to apply any of it in a meaningful way. We spun all of these ridiculous ARTs that make zero sense from a workflow perspective, ripping teams from their natural habit, forcing them to \"collaborate\" with teams they have zero commonality with. I've been going off on our RTE and Portfolio Manager every week (as a PO) because they keep expecting my team to deliver on stuff we literally don't have the knowledge or skillset for.\n\nMy organization has been undergoing its transformation for seven years with 20 different trains at this point across our massive organization. Every train gives the same spiel about \"things getting better as we mature\". But I have not seen a single train reach any level of maturity. There's entry level Scrum Masters everywhere that know nothing, RTEs that have no idea how to improve ARTs, and tone deaf coaches who occasionally run some half-baked educational sessions that lack substance.",
                  "score": 1,
                  "created_utc": "2026-01-17 05:07:29",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzpsghi",
          "author": "Trustadz",
          "text": "Of course change is going to be disruptive. If not then why change in the first place?\n\nIn all seriousness, agile is long from dead in my experience but I’m heavily bias to my work area. Transformations are still rolled out, lots of coaching especially on higher level management. And I think agile will shine more brighter when the current group of middle managers who “get it” will get into senior management roles.",
          "score": 3,
          "created_utc": "2026-01-15 12:20:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzpt5u6",
              "author": "Maverick2k2",
              "text": "Been following this since 2016.\n\nI am sure there are some companies might be doing it well, which I suspect are start ups. But from experience,  the companies I interview for , top tier , highly competitive companies are not. \n\nGo and have a look at the FAANGs, and ask yourself if it is all about having self-organized cross-functional teams then why are they are hiring Project and Program Managers?\n\nFrom interviewing with FAANGs, the only thing they seem to like about agile concepts are the sprint cycles.",
              "score": 3,
              "created_utc": "2026-01-15 12:25:19",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o023d4o",
              "author": "Affectionate-Log3638",
              "text": "I'm not convinced there's enough of us that \"get it\". And many of the ones that don't are ruining the young impressionable ones who could do some good with proper development.\n\nMyself and my current SM came to our current team from a team that wasn't on an ART, so we had some creative liberties. I developed some processes to automate a lot of the manual labor agile teams in our old department were doing in Jira. Myself and my Scrum Master presented those things to the RTE and Portfolio Manager (the SM's boss) on our current train. They shot them down for no reason. The next week my SM told me his boss said he was \"spending too much time with me\".\n\nI have a PO that I work hand in hand with (same boss) who is equally creative and even more experienced than me. We're super vocal in things like Inspect & Adapt, with other teams saying they appreciate what we bring, even attempting to adopt our practices.....The RTE has referred to the two of us and our boss as \"a contagion\".\n\nThe RTE and Portfolio Manager have been meeting with the two of us every month for several months now. It feels like they're trying to silence us and keep us from spreading our ideas. (Because evidently new ideas are bad.). They try to convince us the ART is doing things \"the right away\"....That being said, their knowledge and experience can't hold a candle to either one of us, let alone both of us at the same time. We absolutely thrash both of them every time we meet.\n\nI think there's are some really good people trying to make the climb that could do great things if they got to the senior level. But I'm not sure if this framework will even salvageable by time they get there.",
              "score": 2,
              "created_utc": "2026-01-17 05:22:28",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o03a9h2",
                  "author": "Maverick2k2",
                  "text": "Sorry you are going through this.\n\nPerfectly ties to my 3rd point - companies have a framework and want you to work within it. In other words, it sounds like your role is not aligned with transformation but making sure the work gets delivered while accepting how the current landscape is structured.\n\nLet me guess, you are low in the org chart?\n\nIf so , try to understand it from your manager’s , manager position - his reportee is trying to change ways of working without his involvement. How do you think that comes across? \n\nDon’t you think they think it’s their job to be setting strategy and direction for the team?",
                  "score": 1,
                  "created_utc": "2026-01-17 11:47:51",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzqij7y",
          "author": "sf-keto",
          "text": "Welcome to 2022, OP. This has been going on for 4 years already. Good luck. If I were you, I’d stop even using the word “agile.”",
          "score": 3,
          "created_utc": "2026-01-15 14:49:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzr9mlz",
          "author": "liquidpele",
          "text": "Thank god.   Agile was co-opted by micro managers and spawned whole jobs of bullshit like \"scrum master\" and \"TPO\" and \"PM but just for your team\" etc.   So of course it failed, it turned into micromanagement with useless positions that just slowed everything down and created BS work.  But the biggest reason is the degradation of engineer quality... as people hire cheaper and cheaper and outsource and the like, agile works less and less because it requires people who care and are at least somewhat independent in their jobs.",
          "score": 3,
          "created_utc": "2026-01-15 16:54:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o03b49p",
              "author": "Maverick2k2",
              "text": "At the core of it , agile is very simple . It is about incrementally and continuously work, and adapting your delivery process so that you can try to do it more efficiently.\n\nThe problem is where you have agile coaches and scrum masters who get so anal about the agile practices, that everyone else starts to wonder if they are worth investing in. The constant debates about story pointing and how it should be precisely done when the rest of the business doesn’t give a shit about it, is an example of this.",
              "score": 1,
              "created_utc": "2026-01-17 11:55:00",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzse9cp",
          "author": "PhaseMatch",
          "text": "My take - \n\n\\- **\"Agile Transformations\" will always lead to the \"limits to growth\" systems thinking archetype**;  that's because most organizational change models focus on \"quick wins\", and when you do that, the hard stuff never gets addressed\n\n\\- **the hard stuff tends to be control systems, power structures, and the overall view on work, utilisation, value and motivatio**n; those parts of (Johnson and Scholes) cultural web don't get touched, so you end up with \"what we had before with new job titles, new artifacts, and new events\" mostly  \n\n\\- **there's insufficient emphasis on professional development**; agility requires significant technical and non-technical skills to be embedded at a team level. Most \"agile training\" focusses on processes and tools, rather than the core leadership and (Extreme Programming / DevOps) skills needed\n\n\\- **there's a huge \"legacy codebase\"**; legacy in the Michael Feathers sense that we cannot make changes cheaply, easily, quickly and safely (no new defects) because of a combination of over-complexity, poor design and ineffective test automation.  \n\n\\- **the cloud is expensive***;*  agile practices are based on \"run it and see, then refactor\";  when you are on-prem with low cost hardware (or hardware that has been capitilised) that's one thing.  When you are running on a cloud where every byte and cycle costs, that's something else.  We used \"measure twice, cut once\" back in the mainframe days as well. \n\nAgility has much in common with \"lean\", and \"lean\" initiatives also tended to fail where it wasn't seen to be an exercise in continuously evolving the organisation towards better and better performance, over the long term.  \n  \nVery, few people in management roles are interested in the long term;  quick-wins to bolster the resume so they can move on in 3-5 years - or gain some short term bonus - tends to be the norm.",
          "score": 3,
          "created_utc": "2026-01-15 19:56:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzpx5qk",
          "author": "Naive-Wind6676",
          "text": "A cornerstone of Agile is continuous feedback cycles so while the 'transformation' is done, the work of transforming never does.  \n\nThe people you spoke to kind of don't get it.",
          "score": 4,
          "created_utc": "2026-01-15 12:52:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzq66sw",
              "author": "Kenny_Lush",
              "text": "In theory, once upon a time. Now the majority of folks subjected to ‘agile’ are ordered to STAND UP! and say what they did yesterday, while their fellow oarsmen glaze over at the same droning that didn’t affect them yesterday and won’t affect them tomorrow.",
              "score": 2,
              "created_utc": "2026-01-15 13:45:33",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzq7mpw",
                  "author": "Naive-Wind6676",
                  "text": "I get it and agree.  At least at the train level, I'd hope that retrospective is part of the PI process and that the organization can refine it's processes",
                  "score": 1,
                  "created_utc": "2026-01-15 13:53:19",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nzpxp0z",
              "author": "Maverick2k2",
              "text": "I get that.\n\n They may not get it, but they are the hiring managers. If you want a job at Meta, you need to give them reasons to hire you. Not argue with them and be perceived as difficult.",
              "score": 1,
              "created_utc": "2026-01-15 12:55:50",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzth52y",
                  "author": "Naive-Wind6676",
                  "text": "I really don't want a job there so...",
                  "score": 1,
                  "created_utc": "2026-01-15 23:00:36",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzpruny",
          "author": "Rich-Engineer2670",
          "text": "We tried it, though in our case it was for Fragile Transformation (fail fast, fail often).   Honestly, we gave up.  We gave up because it worked great on paper, but the benefits were always \"just around the corner\" and we learned nothing slows things down better than adding customers in who have absolutely no idea what they want, but want to bring in the date.\n\nSee Mercedes Lackey and Threes if you want the song for it.",
          "score": 2,
          "created_utc": "2026-01-15 12:15:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzpuz02",
          "author": "motorcyclesnracecars",
          "text": "Your post makes sense. I think by now, those that have transformed are deep into their transformation and now their needs have changed to Performing. Those that are \"still\" transforming, do not really want it or, they say they want it but don't want to make the changes it takes to make it successful.",
          "score": 2,
          "created_utc": "2026-01-15 12:38:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzpvvlw",
          "author": "LargeSale8354",
          "text": "What I've seen has been businesses ring fencing agile as an IT only thing. They want all the benefits of change without being the ones to change.\n\nI've seen one or two near successes.  We had a highly senior stakeholder who was everything you'd hope for and more. The product was exciting everyone who saw it and interacted with it. Honestly,  it looked like an inevitable success.  Then there was a blitzkreig of office politics where the protagonists turned into millipedes with a fetish for shooting themselves in the foot.\n\nI feel that roles such as product manager and scrum master,  whatever they were intended to be, turned into gate keepers to prevent useful communication and teamwork. \n\nBusinesses cherry picked what they wanted to hear out if the agile manifesto. This seems to be \"we don't  any form of plan or deep thought. We can make stuff up on the fly as we go along\".\n\nHonestly, I  prefer a smaller company because communication and teamwork have to exist for that company's success.  If a company has more than 6 HR people, it's probably not going to be a fan of agile",
          "score": 2,
          "created_utc": "2026-01-15 12:44:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzq68cl",
          "author": "nikosx85",
          "text": "Can’t even count how many “agile coaches” I have spoken over the years that had zero experience working in an agile team of any kind.",
          "score": 2,
          "created_utc": "2026-01-15 13:45:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzt2e1k",
          "author": "Efficient-County2382",
          "text": ">Now we just need people to focus on delivering the work.\n\nThis is what it should be all about",
          "score": 2,
          "created_utc": "2026-01-15 21:48:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzppphg",
          "author": "UKS1977",
          "text": "This is just discussing SAFe. A non-agile (and indeed Non-Agile) methodology with a 100% failure rate. \n\nGet away from SAFe and things start looking different.",
          "score": 6,
          "created_utc": "2026-01-15 12:00:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzq5g10",
              "author": "maizerage25",
              "text": "“100% failure rate”\n\n🙄",
              "score": 2,
              "created_utc": "2026-01-15 13:41:32",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nzpuj3s",
              "author": "motorcyclesnracecars",
              "text": "Where was SAFe mentioned in OP? You have beef with SAFe and just look for any opportunity to pee on it? I've been in multiple orgs that ran SAFe very successfully. Sorry you had a bad experience, but YOUR experience does not mean that's how it is for everyone.",
              "score": 1,
              "created_utc": "2026-01-15 12:34:59",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzpvmg9",
                  "author": "Maverick2k2",
                  "text": "Without realizing it , where I currently work I introduced a form of PI Planning. On a quarterly basis, we review the Roadmap and decide what initiatives to focus on delivering.\n\nSince doing that , we seem to be delivering work more strategically and the leadership team feel more at ease from having a clearer understanding of what to expect.\n\nI didn’t realize SAFe did something similar but I can now see why it is popular.",
                  "score": 2,
                  "created_utc": "2026-01-15 12:42:24",
                  "is_submitter": true,
                  "replies": []
                },
                {
                  "id": "o02e9ix",
                  "author": "Affectionate-Log3638",
                  "text": "It's how it is for 99% of the people I've seen talk about it. You're the exception, not the poster you're responding to.",
                  "score": 1,
                  "created_utc": "2026-01-17 06:52:15",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nzu2aog",
                  "author": "Venthe",
                  "text": "> I've been in multiple orgs that ran SAFe very successfully\n\nSafe is for the companies that want to claim that they are agile but they don't want to change anything. Companies that did deliver will still deliver.",
                  "score": 1,
                  "created_utc": "2026-01-16 00:54:34",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nzpr216",
              "author": "Maverick2k2",
              "text": "My original post is applicable to the majority of companies.\n\nSeems like you want to be unemployed.",
              "score": -2,
              "created_utc": "2026-01-15 12:10:11",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzq247i",
                  "author": "OTee_D",
                  "text": "Wow ...   _\"Seems like you want ro be unemployed\"_ ?\n\n\nWhy are you so passive aggressive?",
                  "score": 3,
                  "created_utc": "2026-01-15 13:22:58",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzqthqy",
          "author": "HawkeyeGK",
          "text": "Engineering director here...\n\nThe agile transformation community needs to transform themselves into a group that understands and facilitates the transformation to agentic-driven development practices or they're going to be dinosaurs. \n\nWe are on the cusp of a radically different set of practices that facilitate development in an AI-driven development org. Very few have figured out the right way to manage this, but agile principles still are the guidepost we can use to figure it out. \n\nThink about it this way...  Almost all of the practices we employ today are about managing the reality that writing the code is on the critical path. What happens when writing the code takes minutes? What is the point of the vast majority of our practices in that kind of world?  Why do I even need story pointing any more, for example? Requirements gathering, rapid iteration, feedback loops, etc. become critical in this kind of world. Out of vogue practices like RAD and XP have things and ideas we can use to build a new model, and we'll probably need to invent whole new ways of constructing software. Non-developers who feed requirements are going to have to do things very differently to keep up. They should now be a primary focus of this community.  \n\nThe near future of dev is radically changed. Agile practitioners who try to impose old methodologies on the new reality will be left behind. Skate to where the puck is going to be, not where it is or was.",
          "score": 2,
          "created_utc": "2026-01-15 15:41:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzrgwob",
              "author": "Maverick2k2",
              "text": "One of the biggest ironies in the Agile community is how fixed some mindsets have become. For a movement built on adaptability, there’s surprisingly little tolerance for change.",
              "score": 3,
              "created_utc": "2026-01-15 17:27:12",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzt7a1f",
                  "author": "HawkeyeGK",
                  "text": "I very much agree.  There is a significant percentage of agile coaches who are dogmatic about process prescription.  I think the role has attracted people who like \"process\", and those kinds of individuals tend to resist disruption.  Unfortunately for those people, I think we're going to need a Ken Schwaber or Guilherme Benchimol to define a new set of best practices before they adapt to what's happening.",
                  "score": 3,
                  "created_utc": "2026-01-15 22:11:30",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzqetyk",
          "author": "wbrd",
          "text": "The only important thing about agile is continuous feedback from the customer. As an IC, I've been in many \"transformations\" and it's just different paperwork. The real work stays the same and doesn't ever go any quicker. It's just the management doing a different dance.",
          "score": 1,
          "created_utc": "2026-01-15 14:31:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzrthzx",
          "author": "Pretty-Substance",
          "text": "The most I see these days, especially in B2B is iterative waterfall with multiple quarters of planning horizon cosplaying as agile. And that’s fine. Not for every product/customer/market agile development and things like CI/CD are useful. \n\nMostly I’m convinced that agile mostly took hold because companies believed they wouldn’t be able to hire good devs if they weren’t „offering“ an agile work environment. This seems to be supported by the fact that usually only the dev orgs work agile while the rest of the company does not. Not even speaking of sales cycles.",
          "score": 1,
          "created_utc": "2026-01-15 18:23:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzt0fwd",
          "author": "tevert",
          "text": "🌟🌟🌟 M I S S I O N  A C C O M P L I S H E D 🌟🌟🌟",
          "score": 1,
          "created_utc": "2026-01-15 21:39:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzvtiaj",
          "author": "ScrumViking",
          "text": "Everything answer given there points out that they need more help than ever because clearly they never really understood what it’s about. \n\nAt the same time I get it. Most transformations I’ve seen are carried out like project and a goal of its own. Agile is about embracing change in order to discover what works better. Perfect doesn’t exist so it’s truly a never ending journey. Most organizations treat it as simply installing work process x.0 and call it a day. \n\nIn essence, it comes down to a paradigm shift of the values and principles on how we see work and results. Changing this is slow, gradual and organic. It needs continuous nurturing because it’s too easy to fall into old patterns when things hit a rough spot. The few examples I’ve witnessed myself where I can say it was truly successful were those organizations where everyone kept curious on how to keep adjusting for better outcomes and weren’t just satisfied with what was achieved.",
          "score": 1,
          "created_utc": "2026-01-16 07:46:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzw054e",
              "author": "Maverick2k2",
              "text": "People can keep on saying that these companies need help and don’t get it.\n\nThe point is , if people want to work for them , they need to adapt to their needs and understanding of agile, not the other way round.\n\nIf you applied to Meta, got an interview, wanted the job and the hiring manager version of agile didn’t match yours, will you tell them that they don’t understand agile?\n\nEDIT\n\nI guarantee that if you go in and challenge them, you will not pass the interview.",
              "score": 1,
              "created_utc": "2026-01-16 08:46:23",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzw6u3x",
                  "author": "ScrumViking",
                  "text": "I agree, people should choose the companies they work for carefully. I’ve done so my entire professional career. It’s why I wouldn’t work for any company that would give the answers you posted. \n\nIdentifying organizations that might need help in their understanding of organizational adaptiveness and market responsiveness is a diagnostic. Organizations are free to disagree. I’m the last person to inflict help on those who don’t want it. I’m simply pointing out that if it was the  desire of these organizations to be truly adaptive every answer you posted is a red flag for the reasons I gave. They can limit themselves by their believe they ticked all the boxes and are done; time will tell whether they are adaptable enough to survive or remain significantly relevant beyond the next market disruption. \n\nI get asked by organizations that have problems in need of solving. That’s my job; I solve systemic problems by giving organizations the tools to learn how to become more effective. It typically takes a bit of time for most leadership teams to understand the impact of that ask. \n\nThere are also plenty of organizations that I end up not taking assignments for, sometimes for the reasons listed above, sometimes because I am not suited for their needs. In all cases I respectfully do not want to waste anyone’s time if there is no clear outcome I can contribute towards. \n\nIt turns out there are plenty of other organizations looking to beat the competition that are willing to look inward and figure out. I’m not in short supply of work nor worried about my ability to put food on the table.",
                  "score": 1,
                  "created_utc": "2026-01-16 09:48:55",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzz0gt6",
          "author": "bzBetty",
          "text": "They're already trying to do ai transformations, just need to use the buzzwords that excites them",
          "score": 1,
          "created_utc": "2026-01-16 19:01:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o05v9bf",
          "author": "strong_and_minded",
          "text": "I think most critics only know fake agile and have never seen the rare occasion of real agile with all it’s power and potential. \nI can understand that. But using agile is not being agile. Because to really transform you have to transform the mindset. And there is so much resistance that this cannot be done without experienced outside help. Because every time people think they got it, they still only know the tip of the iceberg. \nAnd then good Agile Coaches are as rare as gold. Sure you can do a 6 week course and get a certification. But to really grasp the essence you would need 5 years experience in truly agile teams or organizations.",
          "score": 1,
          "created_utc": "2026-01-17 19:57:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o08tvke",
          "author": "WaylundLG",
          "text": "Citation? Who are we talking to? How many? What questions? Is this just vibes? Nothing wrong with that, but if so, in the words of the Dude, \"that's just like, your opinion, man\"",
          "score": 1,
          "created_utc": "2026-01-18 05:41:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0h9zcz",
          "author": "SoulTrack",
          "text": "Now we're doing SAFe transformations... 😵‍💫😆",
          "score": 1,
          "created_utc": "2026-01-19 14:21:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ppy9b",
          "author": "vstreamsteve",
          "text": "Thanks for the ping on this, a few thoughts:\n\nI don't think scrum masters or agile coaches should have ever attempted to transform anything unless that was specifically requested by their leadership. Supply without demand is always a waste, and leads to frustration from both sides.\n\nIt may be implied by the conventional understanding of the role, but what matters is what is meant in practice and in the context of the organization.\n\nPeople also need to read the room. When you are told/shown something, you should believe it. Orgs that feel like they're done with transformation aren't going to be sold on it by an interview candidate. They're going to be sold by a leading company, McKinsey, Gartner etc. They're wrong, but you're also wrong if you think you're going to change them unless you are absolutely oozing godlike charisma.\n\nMy best advice in every scenario regardless of topic is to meet people where they are. Don't talk about things they don't care about, don't use words they don't use, and 'yes and' or 'how might we' all of the things they're focused on. You can transform organizations without a transformation mandate. You can have a positive impact, but not if you're trying to swim upstream.",
          "score": 1,
          "created_utc": "2026-01-20 18:47:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0wx3p2",
          "author": "Nick_MarketStrategy",
          "text": "I also see this in my experience as I work in a company selling an Agile project management tool. A lot of companies are done with their transformations and they may want to further increase visibility or the flow of work across the organization, but they're not willing to do any restructurings such as Agile squads, cross-functional teams and everything else that was popular a couple of years ago. I am still wondering if there are areas such as Asia or Africa for example, where Agile is still popular?",
          "score": 1,
          "created_utc": "2026-01-21 19:47:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzr15q9",
          "author": "jbigspin421",
          "text": "Stop the cap! It's hotter and more valuable.than ever, except Scrum Masters need to be more leaders alas project manager to deliver more value. Developers want to take their time doing projects without a time line. Not gonna happen.",
          "score": 1,
          "created_utc": "2026-01-15 16:16:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzrklsv",
          "author": "AmosRid",
          "text": "3 problems with scrum (and agile to a lesser extent)\n\n\n\n1. Scrum does not scale. Dependencies, coordination and cost of communication are not factored in.\n\n2. Better agile does NOT lead to higher profits, more revenue, market share, etc. because CUSTOMERS DO NOT CARE.\n\n3. There is an anti-establishment thread that developers know best and other roles in an organization need to limit participation to outside of scrum. That was never sustainable and even more so now with offshore outsourcing and AI. I get tired of developers saying we do agile wrong and point to the latest framework, which is as common as the latest JavaScript framework.\n\n\n\nProduct (Operating) Model “enhanced” by AI is probably the replacement.\n\nI have done this for 20+ years in software, marketing, manufacturing and consulting. I still have an agile role, but the % of my time being a scrum master goes down every year. If you are a scrum master then you need to have a career pivot or exit planned.",
          "score": 1,
          "created_utc": "2026-01-15 17:43:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzpumpa",
          "author": "kaimeister",
          "text": "It’s the fear of uncertainty, as described by John Cleese, that kills any agile or creative work.",
          "score": 0,
          "created_utc": "2026-01-15 12:35:41",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qflbky",
      "title": "How do you restore a standup after it becomes a status report",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1qflbky/how_do_you_restore_a_standup_after_it_becomes_a/",
      "author": "thecreator51",
      "created_utc": "2026-01-17 18:47:02",
      "score": 47,
      "num_comments": 63,
      "upvote_ratio": 0.9,
      "text": "I keep seeing the same pattern across teams. The daily standup starts as a quick sync, but slowly morphs into a round robin status report to the manager. Each person takes their turn listing what they did yesterday and will do today. Everyone else waits quietly. Real blockers are not raised in this format, and collaboration does not happen. The meeting happens every day, but its original purpose to coordinate and unblock the team is gone.\n\nWhat is tricky is that the ritual becomes non negotiable. Suggestions to shorten it, make it asynchronous, or change the structure are often rejected. There is a sense that leadership values the simple visibility of everyone checking in more than the meeting's actual output.\n\nWhat single change had the biggest impact on making a standup like this useful again?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1qflbky/how_do_you_restore_a_standup_after_it_becomes_a/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o05icev",
          "author": "fishoa",
          "text": "Somebody needs step up and say the Daily is dysfunctional. Fixing it is the easiest part: just look at the tasks on the board instead of focusing on the people. \n\nAsk: why are these tasks still on review after two days? What else is missing so that we can merge them? Why is this task still on “In Progress” after 5 days?\n\nUse your Cycle Time to measure the usual time tasks take until completion, and don’t discuss task that are too new.\n\nCongratulations, your Daily now takes 5 minutes and your developers won’t hate you.\n\nI highly recommend reading anything by Daniel Vacanti to learn more. IIRC Kanban Guide for Scrum Teams covers this, and it’s available for free.",
          "score": 37,
          "created_utc": "2026-01-17 18:55:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o05krv3",
              "author": "thecreator51",
              "text": "Agreed, as soon as the board becomes the focal point, the standup stops being performative and starts surfacing real delays. Timeboxing and ignoring brand-new work does more to change behavior than any reminder about what standups are for.",
              "score": 8,
              "created_utc": "2026-01-17 19:06:44",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o05oqhu",
              "author": "D20babin",
              "text": "Great feedback!!!\n\nI would argue that a lot of time there a genuine need for a status meeting (project or sprint or otherwise) at the managerial level (attached stakeholders and the such for the product). It's important to acknowledge that need and then explain to them that the stand up is an AWFUL MOMENT AND PLACE to have a status meeting.\n\nThat is where you can involve your PO or PM to take action on that with support from your SM.",
              "score": 5,
              "created_utc": "2026-01-17 19:25:35",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o08lvtz",
                  "author": "heathercarmen23",
                  "text": "When would you say it's appropriate to have a status meeting?  (Genuinely curious.)",
                  "score": 2,
                  "created_utc": "2026-01-18 04:44:12",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o05ijvi",
          "author": "mike34113",
          "text": "A standup becomes useful again the moment updates stop being addressed to a manager and start being directed at teammates.",
          "score": 18,
          "created_utc": "2026-01-17 18:56:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o05kx1i",
              "author": "thecreator51",
              "text": "Exactly. When updates are aimed at teammates instead of up the org chart, the standup naturally shifts from reporting to coordination. The format matters far less once that audience changes.",
              "score": 7,
              "created_utc": "2026-01-17 19:07:25",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o05oc3s",
              "author": "fixingmedaybyday",
              "text": "Yeah but managers need to feel important so that they can schedule inquisitions, I mean meetings to figure out where the problem is and who is struggling and have something to gossip about with their managers.",
              "score": 6,
              "created_utc": "2026-01-17 19:23:39",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o05q0rs",
                  "author": "thecreator51",
                  "text": "In that case the problem isn’t the standup, it's getting leadership to care about actual blockers instead of just filling time. That shift feels like an uphill battle in a lot of places.",
                  "score": 2,
                  "created_utc": "2026-01-17 19:31:41",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            },
            {
              "id": "o0bt2w6",
              "author": "rkesters",
              "text": "I'm on a fully remote team,  management considers me the tech lead (i hate that), and i function as a dev, product owner, and scrum master.  The team is new. \n\nThe way I handle stand up, is i share the jira board , I have quick filters for each team member. I go around the room (order is pseudorandom) calling on each dev and  filtering the board for them. \n\nThe meeting does feel more status than coordination. We definitely coordinate in the meeting, but it can devolve. I tend to stop TEM (solving the problem) discussions and move the conversation to after standup (allowing those not involved to drop from the call)  .\n\nI am not sure how to drive more coordination and collaboration into the meeting and into the team. \n\nWe also have a couple of members whose velocity is painfully low.  They're new to the programming language and unfamiliar with the internal company developed framework (i'm coming up to speed on it and I'm not a fan), so I've been slow on initiating the discussion (in the past the teams I've been on we'd handle it at retro) about the velocity . I have asked if stories are detailed enough and if the AC is clear and the team says yes (we've added a couple of things to ensure that). \n\nThoughts?",
              "score": 3,
              "created_utc": "2026-01-18 17:56:54",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0e0na2",
                  "author": "213737isPrime",
                  "text": "It sounds to me like you are what we used to call an engineering Manager. Also, you're doing a good job.  I think this can be a workable model. ",
                  "score": 2,
                  "created_utc": "2026-01-19 00:30:33",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o0o1gmu",
              "author": "Morrowless",
              "text": "Not necessarily. My current standup is 99% performative with zero manager attendance. The team already communicates with one another throughout the day. The only \"benefit\" of the standup is so the PO hears what's going on.",
              "score": 1,
              "created_utc": "2026-01-20 14:00:35",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o05jiqb",
          "author": "TechnicallyCreative1",
          "text": "I stop going. I've had 15m stand-ups with 10+ people where each person was given essentially a minute to raise any blockers. Some people would take 90s other would simple say nothing. It was glorious. Worked well for two full years. \n\nOne day an admin decided to pop in to 'ask some questions' immediately the format changed from a standup to a 1hr mandatory status update thing that 100% could have been covered entirely by jira. We kept asking admins to stop popping in but they felt it was the most efficient use of their time to get updates (regardless of the fact it clearly was being used for a social hour). \n\nI stopped attending altogether, started a new 'standup' with the original format explicitly not listing it on the public calendar. Sure enough admin found out and started attending that, turning it yet again into a social hour yet now we had two distinct social hours on the books every single day. Wtf. \n\nLeft for greener pastures. If admin is allowed to control or attend a standup, there really is no avoiding turning it into a roundtable status update that is going to be littered with those unnecessary friendly topics like what did you do over the weekend or how your kids are. That has no place in a standup, it's not a blocker and irrelevant to my life entirely. I certainly don't need a status update on your kids everyday.",
          "score": 6,
          "created_utc": "2026-01-17 19:00:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o05lp2f",
              "author": "thecreator51",
              "text": "That’s been my experience too. Once standup becomes a management touchpoint, the incentive shifts from coordination to performance signaling, and the format follows. At that point it’s usually easier to change the audience than to keep trying to fix the meeting.",
              "score": 3,
              "created_utc": "2026-01-17 19:11:05",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0b7k0j",
                  "author": "scataco",
                  "text": "> performance signaling\n\nLol. Reminds me of success theater.",
                  "score": 1,
                  "created_utc": "2026-01-18 16:14:45",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o06iwsc",
              "author": "Kenny_Lush",
              "text": "We all stopped going. So they made it mandatory.",
              "score": 3,
              "created_utc": "2026-01-17 21:57:48",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o05k7jt",
          "author": "byeckyalou",
          "text": "Change the format to walk the board and review how long tasks are in progress. The majority of my time is spent focusing on in progress tasks during stand up. Do the developers/QAs have what they need to complete it? If something has been in progress for what we’ve determined is “too long” we talk about why and determine a plan to get it done. \n\nIf needed, we’ll talk about next priority items. If someone is close to being done with their work, we’ll usually identify what they are going to tackle next. \n\nI had one team resist the method change pretty intensely. I made a deal with them. Try my method for 2 sprints and if they still didn’t like it or find value in it, we’d go back. They’ve been walking the board for years now. \n\nIf it continues to be a status reporting session to the manager, ask the manager to not show up for a while. If they insist on being there, that leads to a more fundamental issue. \n\nAlso if leadership continues to need to see the status, walking the board to ensure it’s up to date is a great option for them. They can look at the board any time they want to see where things are. Having leadership buy in means they don’t need daily updates but that is a much bigger fish to fry.",
          "score": 4,
          "created_utc": "2026-01-17 19:04:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0b0yt0",
              "author": "wringtonpete",
              "text": "Yeah I generally don't invite any managers to the stand up and explain that it's a meeting for the dev team. If they insist then I tell them they have to be in 'background' mode: video off and to not speak as they are just there to observe. If they have something to say they can speak to me after the  meeting",
              "score": 2,
              "created_utc": "2026-01-18 15:43:25",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o05nzer",
              "author": "thecreator51",
              "text": "Changing ingrained habits takes more than new formats, it requires shifting trust and expectations across the team and leadership. Without that, even the best methods struggle to stick long term.",
              "score": 1,
              "created_utc": "2026-01-17 19:21:58",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0bh4g2",
                  "author": "byeckyalou",
                  "text": "You’re absolutely right. It’s no easy feat. Changing the method was the way I got my teams out of “status report” mode and made stand up useful again.\n\n\nIf you need more influence, try scheduling regular one on ones with your team members. Don’t make them work specific in terms of conversation topics at first. Get to know the people on their level, then you’ll have more leverage to make bigger changes. \n\nIf the team and org is just absolutely stuck on the current stand up method, find a way to get the manager out as others have said. Reference the scrum guide. Stand up is for developers.",
                  "score": 1,
                  "created_utc": "2026-01-18 17:00:15",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o05zccl",
          "author": "ForexedOut",
          "text": "The fastest fix is removing the expectation that everyone must speak, silence is usually a sign of clarity, not disengagement.",
          "score": 4,
          "created_utc": "2026-01-17 20:17:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0asiva",
              "author": "ServeIntelligent8217",
              "text": "Sometimes teams are afraid to ask for help",
              "score": 2,
              "created_utc": "2026-01-18 15:01:03",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o073mm4",
          "author": "the_ballmer_peak",
          "text": "A status report is fine if nobody is blocked. A standup exists to find out if anyone is blocked and who has the information to assist them. That assistance should not happen in the actual standup.\n\nIf nobody is blocked and we just do a quick update, we're done in five minutes.",
          "score": 4,
          "created_utc": "2026-01-17 23:42:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o05k6p8",
          "author": "HenryWolf22",
          "text": "The biggest shift I’ve seen work is removing verbal updates as the default input to the meeting. When the current state of work is already visible before people join, the standup stops being about reciting progress and starts being about coordination. Teams that rely on a shared delivery view, where blocked items and stalled work are obvious, like in monday dev, naturally spend the time asking who needs help and what actually needs to move today.",
          "score": 2,
          "created_utc": "2026-01-17 19:03:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o05mczh",
              "author": "thecreator51",
              "text": "Yes. When progress isn’t something you have to narrate, it changes the meeting’s purpose by default and the conversation naturally shifts to what’s stuck and what needs attention now.",
              "score": 1,
              "created_utc": "2026-01-17 19:14:12",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o05v8s7",
          "author": "bleudude",
          "text": "Standups start working again when they stop optimizing for leadership visibility and focus on enabling team decisions. One effective shift is anchoring the conversation on what is not moving and why, rather than who did what. \n\nWhen work, dependencies, and blockers are already transparent in the systems teams rely on day to day, including setups built around monday dev, standups become a space to resolve friction instead of perform status updates.",
          "score": 2,
          "created_utc": "2026-01-17 19:57:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o05wfqn",
              "author": "thecreator51",
              "text": "I concur, transparency in tools sets the stage, but it’s the conversation that makes the difference.",
              "score": 1,
              "created_utc": "2026-01-17 20:03:09",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o05jhpi",
          "author": "grepzilla",
          "text": "Tell the manager to step out of the meeting.",
          "score": 1,
          "created_utc": "2026-01-17 19:00:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o05liuc",
              "author": "thecreator51",
              "text": "That’s often the fastest way to change the dynamic. Once the perceived audience changes, the behavior usually follows without touching the format at all.",
              "score": 1,
              "created_utc": "2026-01-17 19:10:16",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o05lmdl",
          "author": "FuzzeWuzze",
          "text": "Isn't this literally the job of the SM or did I take different agile training",
          "score": 1,
          "created_utc": "2026-01-17 19:10:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o05ocbm",
              "author": "thecreator51",
              "text": "In practice, the challenge is that the SM role varies widely, sometimes they can drive change, other times they’re constrained by leadership expectations or team dynamics. It’s rarely as clear-cut as training suggests.",
              "score": 2,
              "created_utc": "2026-01-17 19:23:41",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o089xqr",
                  "author": "FuzzeWuzze",
                  "text": "What is there to constrain?   The SM should be the facilitator of these meetings to keep them on track and tell management this meeting is for the team and to schedule other 1:1 if they need specifics.  If the management insists just make a new meeting and don't invite them",
                  "score": 1,
                  "created_utc": "2026-01-18 03:30:03",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o05pld4",
          "author": "caschir_",
          "text": "If nothing changes as a result of the standup, the format is broken no matter how faithfully it runs.",
          "score": 1,
          "created_utc": "2026-01-17 19:29:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o05svsw",
              "author": "thecreator51",
              "text": "Yeap, meeting only works if it drives action and clears blockers, otherwise, it’s just a ritual with no real impact.",
              "score": 1,
              "created_utc": "2026-01-17 19:45:32",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o05polh",
          "author": "adayley1",
          "text": "Give Standup Poker a try: https://agilearizona.org/archive/agileArizona2016/slides/5-5-Standup%20Poker%20-%20How%20One%20Change%20Revolutionized%20Our%20Daily%20Stand-up%20and%20Team's%20Mindset-Kalpesh%20Shah.pdf",
          "score": 1,
          "created_utc": "2026-01-17 19:30:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0er7nv",
              "author": "digitaldreadnought",
              "text": "Nice one, very practical tips in there. Thanks 👊",
              "score": 1,
              "created_utc": "2026-01-19 02:54:54",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o05rc5q",
          "author": "teink0",
          "text": "Why does the existence of one meeting stop you from having another meeting?",
          "score": 1,
          "created_utc": "2026-01-17 19:38:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o05t0v5",
              "author": "thecreator51",
              "text": "Good question. The issue isn’t having multiple meetings but whether each one adds real value. Too often, standups turn into just another checkbox rather than a place to unblock and coordinate.",
              "score": 1,
              "created_utc": "2026-01-17 19:46:14",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o06dkzw",
                  "author": "teink0",
                  "text": "If managers want a status meeting because it is valuable for managers, and not necessarily the team. It is fine to let managers have their status meeting.  Level with the team what it actually is which is the team reporting directly up to managers for the status updates managers up want. That is what the meeting is and we can say that the meeting provides zero value to the team and that can be communicated to the team transparently.\n\nWhen it comes to something productive, such as a daily scrum, if the team values it they will do it. If they don't value it, they wont. But teams tend to perpetuate value without any convincing, and stop useless meetings all the same.\n\nA publication \"The anatomy of social dynamics in escape rooms\" described different teams solving escape rooms. Escape rooms are self-managing self-leading teams, just as is in agile, and it is an example of the dynamics that managers tend to fail to imitate; \"teams tend to start the game with a high amount of group interactions. This pattern is associated with teams ‘warming up’, familiarizing themselves with the environment, and discussing together a strategy. Such a number falls abruptly after the first 5 min, reflecting division of work and individual focus.\"",
                  "score": 1,
                  "created_utc": "2026-01-17 21:31:16",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o05vlqh",
          "author": "LightPhotographer",
          "text": "Change the questions from 'what did you do' to 'what did you achieve, want to achieve and plan to achieve'. \n\nRemove the manager from the meeting for the good of the team, or join perhaps once a week. If the manager feels they 'need' to be there, then they probably want to micromanage as well. Otherwise they would not need to know who does what on Wednessday. \n\nPersonally I´d start with the manager and discuss what his/her presence does to the team: It absolves them of responsibility and it gives the manager a sense of power and control. Both are not Agile.  If the manager can live without this dopamine kick it's much better for the team: they will realize \\*they\\* have to fix their own fertilizer.",
          "score": 1,
          "created_utc": "2026-01-17 19:58:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o05x23b",
              "author": "thecreator51",
              "text": "The challenge is helping managers let go of control without feeling out of the loop. It takes building trust and finding new ways for them to stay informed without dominating the team’s space and that shift can unlock a lot more autonomy and real collaboration.",
              "score": 2,
              "created_utc": "2026-01-17 20:06:17",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o06t26t",
                  "author": "LightPhotographer",
                  "text": "Indeed. A good question is 'what are you going to do with the information?'\n\nIf the answer is 'nothing' then you don't need it. If you say 'I may be able to intervene' you're doing the wrong thing. If you say 'I may be able to use my Management Powers to make obstructions go away' I want to marry you and carry your children.",
                  "score": 1,
                  "created_utc": "2026-01-17 22:48:23",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o06iedd",
              "author": "ExitingBear",
              "text": "\"What did you achieve?\" is at best not going to be any different than \"what did you do?\" and probably going to make it worse as everyone tries to make everything sound like an achievement and keep babbling until something seems to have stuck.",
              "score": 1,
              "created_utc": "2026-01-17 21:55:13",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o06shcs",
                  "author": "LightPhotographer",
                  "text": "It's not the play of words you take it for.  \nI tell my developers that the last time someone was interested in what they *did* was when they were 4, it was their parents and they were faking it.  No one cares what you did. \n\nIf I order a meal I don't want to know that they cut the unions and heated up the oil and cleaned the kitchen. That's just sounding busy.  I want to know when I can expect my food. Even when it's a message I don't want (like 2 hours) I can at least take action on that.\n\nBusy is nothing.  \nEverybody cares what you built, made, failed, in other words, in results.",
                  "score": 1,
                  "created_utc": "2026-01-17 22:45:22",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o06091n",
          "author": "ben505",
          "text": "I mean the core element of a standup is identifying impediments, you can do that and share what you did yesterday and plan for today too lol, they just let the most important part of the standup fall off",
          "score": 1,
          "created_utc": "2026-01-17 20:22:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o063qrr",
          "author": "frankcountry",
          "text": "Rather than focusing around people (round robin,) use the board and walk it from right to left.  What would it take to close this story?  When can we get this story in users hands?  If someone says they’re going to start a new story, ask them to first check if anyone on the team could use support.  Encourage this collaboration.  Sometimes you’ll need to force it the first couple of times so they have a taste of it, after that they can make their own decision.",
          "score": 1,
          "created_utc": "2026-01-17 20:40:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o066tgl",
          "author": "pineapplepredator",
          "text": "Everyone will be so glad when you say “okay today just tell us what your blockers are and skip if you have none”",
          "score": 1,
          "created_utc": "2026-01-17 20:56:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o06inbk",
          "author": "Kenny_Lush",
          "text": "You don’t, because it’s the cornerstone of dystopian micromanagement. You really think the authorities have any desire to change “YOU, IN THE CORNER - STAND UP AND TELL ME WHAT YOU DID?” It’s what they’ve always dreamt of.",
          "score": 1,
          "created_utc": "2026-01-17 21:56:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o06n7pq",
          "author": "PhaseMatch",
          "text": "**TLDR; The surface issue isn't the underlying problem;  if you get the core practices right for your framework and do the XP stuff, managers stop wanting daily status reports.**  \n  \nIn general, the best way to do this is to \n\n\\- shift away from individuals working in silos and towards working as team  \n\\- really applying the practices/tools from the approaches you follow  \n\\- focus on the technical practices that drive agility\n\n**- if you are using Scrum, have Sprint Goals**  \nYou are delivering a business outcome, not a work package;  the Sprint Backlog can be dynamic as you learn more and adapt towards that Sprint Goal.  That includes releasing increments inside the Sprint cycle for feedback.  The Sprint Goal is part of an outcome-oriented roadmap, not just delivering backlog, and you replan every day based on what you now know.\n\n**- if you are using Kanban, focus on flow**  \nUse visual management;  the board tells the status, not the developer.  The emphasis is on \"stop starting, start finishing\" and how the team will collaborate, as a team, to focus on closing work.  That means swarming onto blockers, for example, while keeping WIP down, and managing any hand-offs or urgent items.\n\n\\- **use XP (Extreme Programming) Practices**  \nStatus-report daily scrums are usually a sign that you have individuals working on big chunks of work.  That feels like \"efficiency\", but in practice it's setting you up for longer inspect-and-rework loops or just building the wrong thing and finding out slowly. This is **exactly** what agile approaches should avoid, and why Extreme Programming (XP) was one of the original \"lightweight\" methods.  Slice small, use pairing, have an onsite customer to collaborate with and deliver outcomes. \n\nOf those, getting the XP stuff right is the bottom line in agility.  You need to  \n\n**- make change cheap, easy fast and safe (no new defects)**  \n**- get fast feedback from users on the value that change created**\n\nThis is very hard, and requires a lot of discipline and practice to get right.    \n  \nThe pay off tends to be autonomy.  \n  \nWhen it's not expensive, hard, slow and risky to fix problems, then managers fell much safer and don't need to micro-manage.  The team is safer to - it's okay for them to be wrong.  And the customer is happier.",
          "score": 1,
          "created_utc": "2026-01-17 22:18:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o06nq20",
          "author": "Bullroarer_Took",
          "text": "do you have retros? that’s where i would bring this up.\n\nbut i would also be open to people preferring it a certain way, unless you can articulate a clear problem and the benefit of change. Not following picture perfect agile\nis fine, what matters is value getting shipped to users",
          "score": 1,
          "created_utc": "2026-01-17 22:21:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o075hmp",
          "author": "DingBat99999",
          "text": "A few thoughts:\n\n* I don't have time to go into a long description of why this happens, but in my experience, it often has to do with the WIP limit on a team being too high.\n* If all developers on a team are working individually on different things, then there's no real reason to collaborate and therefore nothing much to do in a Scrum besides provide updates.\n* Drop the WIP thereby forcing the team to collaborate. You'll get a better team and work will actually be delivered faster. \n\n  \nIf you honestly feel that WIP isn't the problem, then shift the format to a \"walk the board\" where instead of polling each developer, you simply talk about each story in progress. Hurry the team through \"what was done yesterday\" and make sure more time is spent on the other two questions.",
          "score": 1,
          "created_utc": "2026-01-17 23:52:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o07hrh8",
          "author": "lunivore",
          "text": "Trying some different things. Some teams ended up \"walking the boards\" from right to left, working out what needed to happen to close things. Some teams explicitly ask \"What can the team do to help you with X?\"\n\nGenerally standups are now an opportunity to say \"Still waiting for a review on X\" or \"Does anyone know how to do Y in Z system?\" etc. - much more focused on getting help. It's not perfect, but it's a lot better. Particularly, we made it OK to say \"I'm good\" when there was nothing worth sharing and no help was needed.\n\nWe are pretty disciplined about keeping our ticket status up to date, so management don't need to ask about that in the meetings.",
          "score": 1,
          "created_utc": "2026-01-18 00:57:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o07njvr",
          "author": "RDOmega",
          "text": "Get rid of it and learn to trust the people hired.",
          "score": 1,
          "created_utc": "2026-01-18 01:27:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o07zndz",
          "author": "WaylundLG",
          "text": "I think you've answered your own question. In your description, leadership is driving the behavior (intentionally or otherwise). Leadership needs to step away for a while. Maybe permanently. If they feel like this deprives them of information, solve that another way.\n\nMost leaders don't want to be disruptive, but no one tells them when they are. If you approach them respectfully, most will want to adjust their behavior.",
          "score": 1,
          "created_utc": "2026-01-18 02:32:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o08uvo3",
          "author": "Ezl",
          "text": "The person who runs the meeting needs to *run the meeting.*",
          "score": 1,
          "created_utc": "2026-01-18 05:49:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o08xlik",
          "author": "Illustrious_Sea_17",
          "text": "Change the board to view by epic, not by assignee.  If the epics aren’t already arranged in your product owner’s priority order, make that change.  Now you can have a truly connected conversation about what we’re delivering today against our #1 priority, #2, #3 etc, and can ask more strategic questions like do we need to shift resources to higher priority work. \n\nCouple weeks (maybe even days) of that and the manager will exit - they will see you’ve got eyes on priorities and the team is self-clearing blockers, which is the whole point of standup.",
          "score": 1,
          "created_utc": "2026-01-18 06:10:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o09q6zd",
          "author": "Fr4nku5",
          "text": "Don't go round the room, go across the board from in the rightmost story (nearest to being complete).\n\nAsk \"how do we get this over the line today?\".\n\nPraise developers who have a conversation about the work.\n\nStop people talking about yesterday - calmly say this isn't a status meeting it's sharing any context for today. Don't react to yesterday, today, blocker patterns.\n\nAsk at the end \"are there any external events that might interfere with everyone's plans?\" - fire alarms in the middle of meetings, code freezes, national holidays in other countries etc. it makes sense to have it at the start, but until people understand its purpose it may derail the meeting",
          "score": 1,
          "created_utc": "2026-01-18 10:28:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0cmlg5",
          "author": "CaptianSquish",
          "text": "Things to try:\n\nWrite down questions in planning tracking where milestones should be in the sprint. Ask those at the start of the standup at the appropriate point in the sprint.  Discussion auto goes to blockers if not on track. Sounds like, ‘Hey before we start today, I wanted to check- during planning we thought we would have the api tested by mid sprint so we can x… it looks like we are still a few days out, what are your thoughts?’  If that proves to be more a more beneficial discussion then the ‘3 questions’ teams tend to pivot to the new format. \n\nOr try having the sprint goal be the only thing discussed. If folks don’t talk, then they aren’t working on the goal- which opens another conversation. \n\nAlso needs a convo with the manager though to encourage them to get ‘updates’ in a different format. And them conveying to their direct reports that the discussion on achieving the sprint goal is more important then proving you worked yesterday in a public setting.",
          "score": 1,
          "created_utc": "2026-01-18 20:15:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0o17b6",
          "author": "Morrowless",
          "text": "Any other meeting that proved useless would be cancelled.",
          "score": 1,
          "created_utc": "2026-01-20 13:59:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0r4scj",
          "author": "Shot-Body7989",
          "text": "If you are working as a scrum master, ask the manager not to attend the meeting . That is going to be a big enough change to change their mentality.",
          "score": 1,
          "created_utc": "2026-01-20 22:45:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o06ddwc",
          "author": "bownyboy",
          "text": "With some teams I worked with we changed it to 'is anything stopping you? and what do you need help with?' \n\nWe then also had a 15mins mini backlog refinement straight afterwards. \n\nBoth of these were run by the dev team after initial guidance and suggestions from me.\n\nBut more importantly I encouraged team members to have a stand-up / discussion whenever they needed it and not just at a fixed time everyday. Conversations should be organic, ongoing and exactly when needed. \n\nFor more mature teams daily stand-ups became less important. Instead it was continuous feedback, contiunous refinement and continuous improvement.",
          "score": -1,
          "created_utc": "2026-01-17 21:30:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o09tv6k",
          "author": "maclirr",
          "text": "The whole point of the standup is for the manager to get a round robin status update from the team. Why would it be anything else?\n\nAgile is a fig leaf to help the manager pretend it's an important ritual for knowledge sharing and mutual unblocking. It feels less top-down that way, and it's a good line to shut up anyone who asks awkward questions, like OP.\n\nSource: 20-year software engineering career.",
          "score": -1,
          "created_utc": "2026-01-18 11:02:13",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qfi035",
      "title": "QA roles in today's agile setup",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1qfi035/qa_roles_in_todays_agile_setup/",
      "author": "EarlOfAwesom3",
      "created_utc": "2026-01-17 16:42:37",
      "score": 12,
      "num_comments": 33,
      "upvote_ratio": 0.81,
      "text": "I went to an interview and they were astonished that we did not use dedicated QA at my last company (web dev). Well in my team we didn't. For some time we had the \"release every week\" cycle where every team contributed and there was a cut-off date once a week. One of the few remaining dedicated software tester was looking at quality. \n\nWe switched to an \"every ticket is released instantly\" method. No more feature freeze, no more waiting or testing cycles. \n\nTesting was shifted inside every small software team (approx 5-8 people). It was their shared responsibility. Shared understanding and knowledge was important, pair review and pair testing became a default. There was no dedicated tester role. You ship after your definition of done.\n\nI worked a few years with this agile setup and I do not want to go back.\n\nNow the new company would use a dedicated (and sometimes external) testing team. To me that sounds a bit old fashioned. \n\nTo teams still using (dedicated) QA roles: how is your agile setup? How do you include testers in the team and make sure they understand the requirements? If you use a dedicated QA team that is not part of the scrum/kanban team: would you consider this still agile?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1qfi035/qa_roles_in_todays_agile_setup/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o04v28a",
          "author": "DwinDolvak",
          "text": "We have a dedicated offshore  resource that does a ton of regression testing for releases.  We are operating in a shared environment with coordinated biweekly production releases to a large web property. Any one change could impact other teams’ work.",
          "score": 3,
          "created_utc": "2026-01-17 17:07:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o05u0cn",
          "author": "LightPhotographer",
          "text": "So they're saying\n\nthe development team is not responsible for their own work\n\nthey don't deliver value or even shippable software\n\nit's fine that they are interrupted by bugs from a previous sprint\n\nand they are probably in discussion about what are bugs or 'works as designed' and how to read/interpret the specs  (fun anecdote, I had two functional designers re-hired as testers going over their own specs; one says to the other 'what the hell does this mean?') \n\nLast I predict that the testers don't want to be responsible for saying the software is OK ... either they want way more testing or they want someone else to take this responsibility. \n\nIt's back to the 90's people. It's not a well-thought out software development process, it's a process that displayed flaws and they put a bandaid on it.",
          "score": 3,
          "created_utc": "2026-01-17 19:51:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o04srcd",
          "author": "pipeweedbalrog",
          "text": "QA review specifications and confirm test cases before development begins. They actively test and mark bugs as resolved before release. They are not just clicking buttons. They are in charge of finding issues within the application before our users do. They actively do that for every release. Most major bugs have been caught by QA",
          "score": 4,
          "created_utc": "2026-01-17 16:56:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o05bb81",
              "author": "konm123",
              "text": "Good QA is actually bug prevention. Meaning they really dig deep to understand what cause the bug to be written in and even get as far for them to be able to detect it during tests.",
              "score": 5,
              "created_utc": "2026-01-17 18:23:01",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o05nham",
                  "author": "Head-Bureaucrat",
                  "text": "Hard agree on this. One of the teams I help out more still has dedicated QA and it's a mixed bag. They spend part of their time executing rote test cases which hardly ever yields valuable results. The other part of the time they're working with devs during development to help with UX issues, asking questions about implementation and specs, and refining test cases based on discussions with the devs. They are constantly finding great issues when doing that.",
                  "score": 2,
                  "created_utc": "2026-01-17 19:19:34",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o072o0j",
              "author": "DingBat99999",
              "text": "What you're describing is QC, to be more correct. And it's an activity, not necessarily a separate role.\n\nNote that the OP didn't say that work wasn't being done. Just that they didn't have a separate role dedicated to it. Anyone with even basic knowledge of a product should be able to confirm test cases.",
              "score": 1,
              "created_utc": "2026-01-17 23:38:01",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o0at983",
              "author": "EarlOfAwesom3",
              "text": "So what happens if direction, specifications or tests change during development, like it does all the time? Isn't that counter-intuitive to agile in its most basic form?\n\nIf they are in charge of finding issues (whatever issue here means) they must work closely with developers and the product manager on a daily basis. \n\nTo me it doesn't work throwing software and specs over a fence and getting a bug report back. \n\nThe only way this could work is if members of the QA are actually on the agile team. And then it's questionable why those guys are not developers themselves.",
              "score": 1,
              "created_utc": "2026-01-18 15:04:53",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o05738w",
          "author": "AintNoGodsUpHere",
          "text": "It just shows how little people actually know about QAs. It's sad really.",
          "score": 4,
          "created_utc": "2026-01-17 18:03:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o04thnl",
          "author": "Emorin30",
          "text": "Moving away from QA functional testing is a huge efficiency gain with very little downside risk. Having developers who are willing and able to write automation tests (not unit tests) or a dedicated automation tester is helpful. Having an exploratory tester or a PO who is willing and able to do this, is also helpful.",
          "score": 3,
          "created_utc": "2026-01-17 16:59:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o04z86l",
              "author": "capathripa",
              "text": "That may be true in young companies or startups, but in a place with a lot of old tech and heavy dependencies between siloed teams, that's a disaster waiting to happen.",
              "score": 3,
              "created_utc": "2026-01-17 17:26:49",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o04zitm",
                  "author": "Emorin30",
                  "text": "Nope. Did it for 3 separate departments in a 100 year old insurance company. And the first one was almost 10 years ago when tech was far less mature. It's quite standard tbh and people don't realize just how little value most QA orgs are adding.",
                  "score": 2,
                  "created_utc": "2026-01-17 17:28:13",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o04uk8d",
              "author": "EarlOfAwesom3",
              "text": "Developers wrote automated unit tests, integration tests and end-2-end tests (if feasible and needed). Since the whole team is responsible for the outcome, there is an incentive to understand what the goal is and the software should do.",
              "score": 1,
              "created_utc": "2026-01-17 17:04:54",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o050p9e",
                  "author": "dastardly740",
                  "text": "Exploratory testing is looking for the things no one thought of specifying. You won't have automated tests on those things because no one thought of it. I like to say exploratory testing means checking your sanity at the door because you need to do things no sane user would do because if it was sane, someone would have thought of it and writtan automated test. A reductionist example is a button that is enabled that makes no sense to press. Exploratory testing presses that button because they can.\n\nA key point is that it is vanishingly unlikely that after all the other automated testing that exploratory testing will find a show stopper defect on any particular deployment. So, it is not a deployment gate. You do it on some cadence independent of the deployment cycle.\n\nOne other thing I find I have to teach orgs when I try to make them more agile. Deploy does not have to mean Release. We Deploy code. We Release Features. I.e. feature flags. Automated tests prevent regressions and now you can deploy code with that partially done feature or that feature that the product owner/team wants to exercise a bit in a non-prod environment to make sure it solves the business problem before making it available to everyone. It also helps prevent long-lived branches, which are often a pain in the butt.",
                  "score": 1,
                  "created_utc": "2026-01-17 17:33:46",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o04v32p",
                  "author": "Emorin30",
                  "text": "Ya sure not all devs are gonna lean into that and \"making\" people do stuff they don't like is generally a bad idea. You can have one person who has automation skills that can easily cover a team and add value without the classic trappings of the manual QA tester checking off each ticket one at a time.",
                  "score": 1,
                  "created_utc": "2026-01-17 17:07:20",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o04rcyv",
          "author": "rideoncycling",
          "text": "I'm experiencing this too. It hurts to watch and listen to it.\nI finally got the Head of Delivery to see the benefits (for him the penny dropped when he realised the time, money and hassle of not having to manage testing teams and contract testers).\n\nIt is unexceptable to me that the developers aren't responsible for the quality of their work.\n\nI will push and push for a better way but I suspect it will take years for the culture and mindset to change (they only started to automate testing last year 😭",
          "score": 1,
          "created_utc": "2026-01-17 16:50:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o06v7ht",
          "author": "PhaseMatch",
          "text": "**TLDR;  I run into this a lot;  we have dedicated testers right now.  Start where you are and improve things through  empiricism, managing up and effective retrospectives.**  \n  \nAgile concepts drew down from lean ideas, which meant you aim to \n\n\\- build quality in and prevent defects, rather than   \n\\- run expensive, slow test-and-rework loops  \n  \nMost of the Extreme Programming (XP) practices bend towards that goal of either preventing defects, or making small mistakes that are quickly found and easily addressed.  **I don't think you can really be agile without doing these things - given a lot of the authors of TMFASD were XP people**.  \n  \nThe challenge with a dedicated testing group is that \"testing\" becomes conflated with \"quality assurance\", when these are different things.  The whole XP/DevOps/Lean \"shift left\" mindset goes out of the window and you are into   \n  \n\\- stage-gate hand-offs  \n\\- increasing documentation  \n\\- increasing process controls  \n\\- less collaboration  \n\\- more blamestorming  \n  \n**So back to big batch, stage-gate and sign off delivery.  With Sprints.  Twice the meetings, half the work.**  \n  \nI'm in the middle of shifting another set of team into a more agile way of working;  it's an incremental and iterative process because you need to have \"team pull\" not \"leadership push\"\n\n\\- start with Brian Marick's agile testing quadrants  \n\\- move on to the team's process flow and see how they fit  \n\\- have a \"test and rework\" column on your board  \n\\- measure the cycle time for defects  \n\\- express that as part of the overall cycle time  \n  \nThat starts you in with baseline data where you can begin to:  \n  \n\\- tall about real quality assurance;  so build quality in, not test-at-end  \n\\- show management the cost of \"paying someone to create defects\"  \n\\- get the team into the defect prevention business  \n\\- collate defects by root causes   \n\\- start to see where XP practices could have brought in a shift left  \n\\- run experiments into using those practices  \n\\- measure the outcome\n\nIt also means good conversations with the test team manager, team lead, lead tester and principal developers, while working on coaching arcs across the board, while showing how change will save time and save money.  \n\nIt can also mean starting the shift in role from  \"tester\" to \"technical analyst\" who works end-to-end across the teams flow of work, while supporting automation and helping the devs with good TDD practices and not just happy path coding.\n\nKanban helps here - so inspecting and adapting column policies for \"done\" and creating low-friction flow, as well as getting teams into what Kanban actually is.\n\nThis online game (in teams, competing) can be an interesting way to lead that:\n\n[https://www.kanbanboardgame.com/](https://www.kanbanboardgame.com/)",
          "score": 1,
          "created_utc": "2026-01-17 22:59:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0740ft",
          "author": "DingBat99999",
          "text": "Yer gonna get downvoted for that opinion.\n\nBut not by me. \n\nI started when there was no such thing as dedicated QA, or testers of any sort. Developers were expected to deliver \"fit for use\" results and the idea that this wasn't \"natural\" never occurred to us. \n\nBut most of the things people call QA today isn't. It's quality control at best. Most testers are \"checkers\". They check that shit that was specified was implemented. The irony is that this is donkey work and a waste of most testers potential, but testers get very offended if you try to say an explicit role is unnecessary. \n\nI would much prefer quality personnel spend their time preventing defects, but that's pretty much unheard of in our industry. But if they can't do that, I'd prefer they spend their time doing exploratory testing finding things that fell through the cracks or were broken by side effects of changes or just plain unanticipated impacts. \n\nChecking is drone work that should rightly be done by automated tests.\n\nI've also found that most testers lack a well developed sense of self-preservation. They allow developers to toss shit over the wall at them and don't get angry. If I had developers giving me product that had easily found defects in it, I'd call them out. Most testers meekly take it.",
          "score": 1,
          "created_utc": "2026-01-17 23:44:45",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qi70an",
      "title": "How to prioritize backlog of bugs?",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1qi70an/how_to_prioritize_backlog_of_bugs/",
      "author": "Subject-Scholar6197",
      "created_utc": "2026-01-20 17:13:58",
      "score": 11,
      "num_comments": 32,
      "upvote_ratio": 0.92,
      "text": "I’ve been tasked with prioritizing and categorizing our 400+ backlog of bugs. I want to use two things to measure:\n\nImpact\n\nPriority\n\nTo categorize these. Any tips or suggestions on how to measure impact and subsequently assign a priority for our next sprint? I’d like to ideally spend 30-60 seconds per bug and crush through the list. Any advice would be appreciated. ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1qi70an/how_to_prioritize_backlog_of_bugs/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o0p89g1",
          "author": "FreeKiltMan",
          "text": "If they are > 90 days old, delete them. These are bugs that are either not important, or will be reported again quickly (so you know how important they really are). Anyone willing to sit on a bug for 3 months has either already churned, or it’s not really important to solve because the workaround is easy.\n\nThe remainder - what are you measuring their impact against? That’s the real question to have a good answer for before you start. If it’s conversion, rank them in severity of how they impact that. If it’s revenue retention, speak to Account Managers to figure out the churn risk of customers.\n\nI don’t recommend getting too granular. High/Med/Low impact should be enough of a prioritisation. If you find too many in one bucket, you should recalibrate your thresholds. Generally, I’d keep it 10% high, 30% medium and 60% low. Those might feel like arbitrary buckets but you cannot have 100 high impact bugs, you need to keep recalibrating your scale until only the most severe issues are considered “high”.",
          "score": 22,
          "created_utc": "2026-01-20 17:27:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0tdv40",
              "author": "GreatZoran",
              "text": "So much people are afraid of deleting backlog items but it is the way to dot it ! \nIf no one talks of a bug its a feature not a bug 😅\nAll products have bugs and lot of them are 'admitted'",
              "score": 2,
              "created_utc": "2026-01-21 07:10:17",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o0rf3xf",
              "author": "lampstool",
              "text": "To add to this, you can run a session (or multiple sessions) with a impact vs effort chart to help them visualize it a bit better. (Effort on x axis, effort on y). \nThat'll also help you bin off any tickets you think could be valuable after already purging any older bugs. \nGiven the sheer size you are dealing with, start with high impacting low effort quick wins and get them prioritized into sprints. \nThen hold a bi-weekly triaging session to continue the prioritisation over time until it's more manageable (then can probably move over to monthly)",
              "score": 1,
              "created_utc": "2026-01-20 23:40:29",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0pe85i",
          "author": "Pretty-Substance",
          "text": "I use a simple triage: \n\nCosts no money\n\nCosts the company money \n\nCosts the customer money",
          "score": 16,
          "created_utc": "2026-01-20 17:55:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0qihur",
              "author": "SuperbAd8266",
              "text": "Things related to money are always the highest priority on my team.",
              "score": 3,
              "created_utc": "2026-01-20 20:59:10",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0s912q",
                  "author": "reubendevries",
                  "text": "I mean it probably depends on how much money. How much effort, how much likely hood of it re-occurring it should be a formula based on company tolerance.",
                  "score": 2,
                  "created_utc": "2026-01-21 02:27:50",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0p9k8v",
          "author": "DingBat99999",
          "text": "A few thoughts:\n\n* People always over-complicate defect tracking. They almost always do so because they allow too many defects to accumulate and/or they have a fundamental quality problem in their development process.\n* My recommendations:\n   * The first step would be to simply delete any defect over a given age. It wasn't important to fix before so stop worrying about them.\n   * I would then simply sort the remaining defects into \"Must Fix Immediately\" and \"Not Must Fix Immediately\" buckets. Who cares about the impacts/reasons. Just make a judgement call. This is really the POs job btw.\n   * Start working on the first bucket.\n   * If the first bucket is more than one sprints work, you probably have a quality problem.",
          "score": 8,
          "created_utc": "2026-01-20 17:33:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0pkxrj",
          "author": "lypaldin",
          "text": "In my company, we use [frequency/severity](https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQpwG-j1tWk_cYiJF2B4cj5XTcaE7eYr5ssPQ&s) matrix\n\n- Is it frequent ? (Once in a while or every day, how many users impacted, etc) \n\n- Is it severe? (Impossible to make an action or just a minor turnaroundable inconvenience?)\n\nWe have an indicator in our ticketing system that helps to identify if it's red, yellow and green, and each time I create a new ticket, I just add this information",
          "score": 4,
          "created_utc": "2026-01-20 18:25:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0pr2bl",
          "author": "TomOwens",
          "text": "A lot of people are saying to delete, often based on the age of the issue. I find that an incredibly scary idea. Perhaps it's my background in regulated industries, but failure to report a known issue with a system would be a pretty serious non-compliance with regulations or contracts.\n\nHowever, they aren't wrong in that the first step should be a rapid cleanup of the known issues.\n\nAnything that doesn't have enough information to let someone knowledgeable in the system attempt to reproduce it can be closed. If there aren't good preconditions and reproduction steps, there's no need to waste anyone else's time. Without this information, not only will it be hard to reproduce in a development environment, but confirming the fix will also be difficult.\n\nAs a parallel activity, consider setting standards for new issues. Make sure that anything that is newly reported has enough information to reproduce, fix, and verify the solution. Don't accept defect reports that don't have the necessary information.\n\nYou also have another opportunity to close issues quickly. If the feature the defect was reported against no longer exists, you can close it. Features are deprecated all the time, and one problem I've seen is that when a feature is deprecated, the backlog work associated with it isn't cleaned up. Not only can reported defects be closed, but any ideas for enhancements or tech debt paydown can also be closed, since they're now irrelevant.\n\nInstead of categorizing by impact and priority, I'd start with something more objective. Can you check that each defect is associated with one or more features or architectural elements of the system? If so, do that. Then, you can prioritize defect repair with planned feature development. If you have planned work associated with a given feature, pull defects associated with that feature at the same time. Use this time to conduct a deeper analysis, close irrelevant defects, and fix those that need to be fixed. This also gives you a prioritization method, especially if you know the value of or risks associated with a particular feature. Instead of categorizing each defect, you cluster and improve an aspect of the system.",
          "score": 3,
          "created_utc": "2026-01-20 18:52:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0q5gtt",
              "author": "Fickle_Musician7832",
              "text": "Yes!  For one of our projects, the issue backlog is long/old because the dev team is ignoring them - not because they aren't important.  We are reminding them continuously that they need to fix bugs.",
              "score": 3,
              "created_utc": "2026-01-20 19:58:53",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0sdl44",
                  "author": "happycat3124",
                  "text": "Exactly. We have defects that are being complained about and critical. We just ignore the issues and have trained the customers that complaining is futile.  Some of these things cost way more in productivity than the cost to fix.  Others are control issues or financial issues that, if identified by the “right” person would be escalated to a Sr. Level and given a very very high priority. But there are decision makers that put their heads in the sand. They are making a decision that the likelihood of their careers being impacted negatively by asking for more resources to get the things done is higher then the likelihood of them getting called out as responsible for ignoring the problem.",
                  "score": 1,
                  "created_utc": "2026-01-21 02:53:47",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0putmg",
          "author": "FairEntertainment194",
          "text": "Allowing 400 bugs in backlog is far too much. I don't think they can be fixed in one sprint. You have bigger problem than just categorisation of bugs.",
          "score": 3,
          "created_utc": "2026-01-20 19:09:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0pd8tc",
          "author": "Alpheus2",
          "text": "Delete.\nFocus on reducing the rate of new bugs so the rate slows down or stops.\n\nYou can prioritise anything younger than 60days once you’ve stopped the bleeding.",
          "score": 2,
          "created_utc": "2026-01-20 17:50:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0per8a",
          "author": "phaulski",
          "text": "There used to be a free agile app/website called easybacklog and one of the things i loved most about it was the 50/90 column. This was an estimate of time it takes to complete the item. \n\n1. How much time would it have a 50% chance of being completed \n2. How much time for a 90% chance of being completed. \n\nFor instance, i might have a 50% chance of emptying the dishwasher and getting the next load in in 20 minutes, but in 45 minutes, its a 90% chance. \n\nI cant remember how the algo weighted things but it led to a WSJF list - weighted (by importance, impact, whatever) shortest job first",
          "score": 2,
          "created_utc": "2026-01-20 17:57:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0pr0a3",
          "author": "basilray",
          "text": "Something that might be worth considering, partnering with someone in customer support. They likely can tell you top contact drivers. Focus on those, because they have a two-pronged value:\n\n1. Reducing client contacts saves support dollars\n2. Gives you great ROI for the work performed to remediate over high visibility defects",
          "score": 2,
          "created_utc": "2026-01-20 18:52:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0pvjpe",
          "author": "cdevers",
          "text": "\nI know I’m in the minority opinion on this, but I am strongly opposed to just deleting bugs. \n\nThe thing to consider is that your bug database is part of your organization’s institutional memory — it should be the permanent record of the work that came up, whether or not that work ended up being carried out. \n\nMy preference is to set up a “rejected” or “won't fix” status in your bug tracker (Jira or what have you), and have this status semantically be one of the “closed” states. That way, if you make a determination that a bug isn’t worth spending time on, you can reject it now, and get it off your open backlog. \n\nThe big advantage of this approach is for later trend analysis. Right now, it might seem like that bug isn’t worth fixing — and maybe that’s the right decision! But if it turns out that you’re getting a steady trickle of reports of what amounts to the same bug, then maybe this “minor” issue is more significant than it seemed at first, and it’s worth working on after all. \n\nDeleting the bug reports is bad, because it discards this information and makes later analysis difficult or impossible. \n\nSo my approach is fairly simple — review the bugs, reject the ones that don’t seem worth working on any time soon, and focus on the remaining high-priority issues. Later though, as new reports come in, compare them to the existing closed & rejected bugs in the archive to see if they could be a match for anything that has come up before, and if so, cross-reference the reports so that you can start building up a list of instances of the same problem, as this can inform future decisions about whether or not that bug is worth reprioritizing.",
          "score": 2,
          "created_utc": "2026-01-20 19:12:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0p87g4",
          "author": "Lasdary",
          "text": "I'd add a 'complexity'. Or you'll have 80 or so low priority bugs that take 5 mins to solve but will never be addressed. Use low complexity to use up hours where nothing else would fit. And as easy tasks to solve, which tend to improve morale.\n\nPriority is up to the PO, and without knowing the business logic it's impossible to tackle. You need to weight revenue loss vs time incurred in support, or risk against failing an audit, or those bugs that the longer they exist, the harder it is to fix the erroneous data later on...",
          "score": 1,
          "created_utc": "2026-01-20 17:27:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0planp",
          "author": "PhaseMatch",
          "text": "**TLDR;  Stop the rot by getting into the defect-and-ticket prevention game;  use an LLM to cluster defects and overhaul the \"buggy\" areas that disrupt user workflows.  That might mean rewrites not bug fixes.**\n\n**First things first - stop the rot!**\n\nYou really need to get in front of \"**building quality in**\" as a team rather than running a \"test and rework\" cycle and hoping you trap every defect;  building up to 400+ defects is kind of insane.\n\nYou also need to get in front of \"ticket management\" as the defects come in;  immediate triage into this Sprint, backlog, won't fix (kill);  not every defect or request has to be addressed.\n\nThe team needs the technical skills to make change cheap, easy, fast and safe (no new defects);  you'll be battling uphill until they can.  This is what the XP (Extreme Programming) and DevOps practices are for - shift left, slice small, and defence-in-depth to trap-and-resolve defects inside your Sprint cycle.\n\nLook into **\"Continuous Testing for DevOps Professionals\"** for a bunch of essays/structures/ideas for improvement.  Raise the bar, coach into the gap.\n\nThen:\n\n\\- feed the defect list into your LLM of choice and do some cluster analysis on common themes, as they impact on user workflows, functionality groups  or value creation by the users\n\n\\- use this to prioritise in a roadmap sense;  overhaul the buggy workflows that have a lot of complaints, or the parts of the codebase that are really buggy.  Create focused Sprints where you can have an outcome from a user workflow perspective.  Don't work tactically.\n\n\\- identify code that can't be saved;  you might need to kill off complex, low use functionality that doesn't \"wash it's face\" in terms of value created Vs defects raised;  solve the users problem a better way and replace it entirely\n\n\\- do a deeper analysis on likely root causes, cluster, and identify with the team how where that specific defect should have been trapped \"upstream\" of the user and any manual tests as part of getting into the defect prevention business\n\n\\- improve",
          "score": 1,
          "created_utc": "2026-01-20 18:27:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0pruab",
          "author": "Jo0102",
          "text": "Not sure if you're using incidents or only the bug type, for me a good start would be to group them in categories: critical, high, medium low by the urgency. \n\nIf you have a bug that is blocking your customers or safety issue, it's definitely critical bug, \n\nhigh can be something that the current release relies on, \n\nmedium- something valuable but not time critical and\n\nlow- some design issues that are just annoying to see and not affecting the customers. \n\nAfter this you should pretty good idea of the backlog if you're a beginner. \n\nThis is pretty similar to MosCoW model of prioritization, but most companies use RICE model.",
          "score": 1,
          "created_utc": "2026-01-20 18:56:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0pu9ew",
          "author": "dnult",
          "text": "Really its the impact you want to define. The priority should be the top N issues with the highest impact.\n\nOne approach might be an FMEA RPN scoring system. It is based on severity of the issue, probability of an issue occurring, and how the issue is detected. The score is the product of those three scores. The goal is to identify high impact, and frequently occuring issues, with emphasis on client impact.",
          "score": 1,
          "created_utc": "2026-01-20 19:07:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0pxc33",
          "author": "KariKariKrigsmann",
          "text": "I would encourage you to look into the Cost of Delay method of prioritising bugs:\n\nhttps://www.3cs.ch/priority_cost_of_delay_and_kanban/\n\nImpact is a proxy for impact, and Cost of Delay is IMHO a better way to do it.",
          "score": 1,
          "created_utc": "2026-01-20 19:21:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0q1vaq",
          "author": "LightPhotographer",
          "text": "Putting a list of 400 items in a different order is not helping anyone. It's rearranging deckchairs on the Titanic. \n\nI suggest a few regular bug-squash-fridays with the team: Fridays spent only on fixing bugs. Make sure to celebrate.   You do not have to go through all 400 to find candidates. Just ask each developer and possibly some stakeholders for their favorite - and do these first.  When you get the hang of it it will also become easier to just select bugs instead of arguing about them.\n\nIt was a great success for us because we fixed bugs that never reached the treshold of being serious enough, yet they were in the system for months.\n\nFor the rest... triage always helps.  Does it cost money, who does it impact and how many people are we talking about, and is there a workaround?",
          "score": 1,
          "created_utc": "2026-01-20 19:42:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0q4bwm",
          "author": "Fickle_Musician7832",
          "text": "Make a policy that only bugs with complete info will be worked on and send them back to the people who submitted them to add priority and severity. If they aren't available, have the system owner/business owner do it. They have x number of days to complete that exercise or the bugs will be cancelled.",
          "score": 1,
          "created_utc": "2026-01-20 19:53:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0q97gi",
          "author": "renq_",
          "text": "Same as everything else. I prefer to think of every story as a bug. Either something not implemented or behaviour that should be changed.",
          "score": 1,
          "created_utc": "2026-01-20 20:16:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0qm2vu",
          "author": "flamedown12",
          "text": "A graph of complexity vs impact, start with low complex but has high impact in terms of solution and work from there.",
          "score": 1,
          "created_utc": "2026-01-20 21:15:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0rd4xt",
          "author": "erebus2161",
          "text": "First of all, how much authority do you have? Several people have said delete the old ones. Is that even an option?\n\n\nSecond, what's the source of the bugs? Users or QA? My QA team notices when a bug is deleted and don't report it again. And they all talk, so if someone finds a bug and someone says they wrote it up 6 months ago and it was removed, it won't get reported again.\n\n\nThird, are you required to fully prioritize this backlog? Because it is impossible to order 400 bugs. At best you can put them into a few categories.\n\n\nFinally, the only real metric is importance. And how your project determines that will be somewhat unique for your project. Bugs that completely prevent a feature from working are probably high on the list. But maybe there are features no one really uses. Or maybe there's a feature one person uses, but they're a VIP.\n\n\nI would start with just categorizing as critical or not. Until you've finished the critical ones, there's no point in putting any thought into the rest. Once the criticals are resolved you can lower the importance bar and do another batch of most important. I would generally aim for about 2 sprints worth of the most important bugs actually being ordered.\n\n\nYour two metrics of impact and priority kind of sound like the same thing. Wouldn't high impact = high priority and low impact = low priority? My team uses what's called a RICE score; reach, impact, confidence, effort; because we are required to, but it really isn't that complicated to review a bug and determine how important it is.",
          "score": 1,
          "created_utc": "2026-01-20 23:29:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ri7ii",
          "author": "funbike",
          "text": "I've been through that several times.  Your team will NOT fix all those 400 bugs, so it's a complete waste of time.\n\nDelete all of them, except anything reported in the last month.  Come up with a better way of dealing with bug reports.  Your team has fundamental issues.",
          "score": 1,
          "created_utc": "2026-01-20 23:57:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0rldjf",
          "author": "Silly_Turn_4761",
          "text": "- level 1 - causing outage of multiple customers/users with no work around\n- level 2 - causing outage of multiple customers/users with a workaround\n- level 2 - causing outage to a few customers/users with no workaround\n- level 3 - highly probable edge case \n- level 4 - Mild issue with workaround\n\n\nI've seen something similar to the above dictate priority. \n\nNow, I've also seen multiple variables dictate it, for example:\n\n-  how many users are affected\n-  is there a workaround\n- is it in a high priority module of the software \n\nIt honestly comes down to how much bandwidth the team has and what will the priority levels will be used for? If they will be used in tandem with estimates to help the team decide if it can or should be worked in the next sprint, that makes sense.\n\nIs the team planning to agree on working a set amount of bugs per sprint? For example, I've been on teams where we tried to dedicate at least 10 or 20% towards tech debt. Same for bugs. That type of decision is going to rely heavily on what the team is being pressured to deliver.",
          "score": 1,
          "created_utc": "2026-01-21 00:14:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0rnm3a",
              "author": "Silly_Turn_4761",
              "text": "Just re-read your post again, and wanted to mention a few more things.\n\nImpact typically represents how many users/customers are affected\nUrgency could be used for whether there is a workaround\n\nYou need to find out what the intended uses of the priorities and categories are first. \n\nI have been on a team where we CLOSED all tickets older than 2 years. Then anything older than a year, the customer support rep or whoever owns the ticket, reached out to the customer to confirm before closing it. You could suggest something similar. \n\nIf QA Prioritizes their test cases or test plans, which they should, that would also be a good data set to use to influence how these get prioritized. \n\nFor example, I used to work for a loan management software company. When I started I had to build a test case repository. In doing that, I always put a priority on the tests. I based the priority off of what the projected impact would be, should a defect make it to prod. Most priority 1 test cases were in the loan configuration module, and each module also had 1 or 2 high priority TC. I say all this because, I heavily researched the bugs that had been historically reported up until current. I exported them and filtered to see which ones were fixed, which ones were considered super severe and went in a hot fix, etc. \n\nYou could also ask customer service which areas of the software tend to always be buggy. \n\nHope some of this is helpful. \n\nJust make sure whatever you use to represent Defcon Level 1 importance, is limited to truly what stops business.",
              "score": 1,
              "created_utc": "2026-01-21 00:26:45",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0s8ugc",
          "author": "reubendevries",
          "text": "This is a decision process question. You should be categorizing all bugs - once you have organized your bug backlog, delete any duplicates or merge them. Then you need to talk to your SDET/QA team and determine the likely hood of the bug occurring (rate out of 10), then you need to determine the impact of the damage it costs. While business will always rate things in dollars you'll need to figure out a dollar value and rate it out of 10 (i.e $1,000,000 per hour would probably be a 10, $10 per hour would be 1) When you have those two numbers multiple them and take the top 5% to 10% and start working on them. This should be a continual process and when you have discovered a bug, change your template so that the person filling out the template can input that information for you. You should be working on bugs that are consistently hitting the 80 - 100 scale, trying to figure out quick cheap wins on the 50 - 80 scale and mainly disregarding anything that scores under 50, until it is pushed above 50.",
          "score": 1,
          "created_utc": "2026-01-21 02:26:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0sbiw7",
          "author": "easy-agile",
          "text": "The 30-60 second constraint is actually helpful here - it forces you to trust your gut instead of overthinking each decision.\n\nFor impact, ask yourself two questions per bug: How many users does this affect? How much does it block their work? That usually gets you to a high/medium/low rating faster than elaborate scoring systems. High impact = lots of users or completely blocks a key workflow. Medium = affects some users or creates workarounds. Low = edge cases or minor annoyances.\n\nFor priority, you're essentially deciding \"when should we fix this\" - next sprint, soon, or later. The combination usually shakes out naturally: high impact bugs that are quick wins go in the next sprint, high impact complex problems get scheduled, and low impact items stay in the backlog until you have cycles.\n\nOne approach that works well for big backlogs: start with a quick filtering pass. Anything that hasn't been reported again in your typical release cycle might not need immediate attention. You could also sort by how often the bug appears in support tickets or user reports - bugs that keep surfacing probably deserve prioritization even if they initially seemed minor.\n\nWith 400+ bugs, consider doing a first pass just bucketing things into critical/high/medium/low/obsolete, then spend your detailed triage time on the critical and high buckets. You'll get through the list much faster and make better decisions about what actually needs attention in your next sprint.",
          "score": 1,
          "created_utc": "2026-01-21 02:42:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0t03y8",
              "author": "Subject-Scholar6197",
              "text": "This is the best advice thank you!!!",
              "score": 1,
              "created_utc": "2026-01-21 05:18:40",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qfwj0h",
      "title": "How important do you believe 'Servant Leadership' is, and do you see it being employed/lived in your orgs?",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1qfwj0h/how_important_do_you_believe_servant_leadership/",
      "author": "Agileader",
      "created_utc": "2026-01-18 02:37:19",
      "score": 11,
      "num_comments": 28,
      "upvote_ratio": 0.82,
      "text": "",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1qfwj0h/how_important_do_you_believe_servant_leadership/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o08iaax",
          "author": "DwinDolvak",
          "text": "Servant leadership is vital to a good culture and creating loyalty within an organization. \n\nThe opposite of servant leadership— command and control — ruins cultures and creates mistrust and a finger pointing, non collaborative environment.",
          "score": 12,
          "created_utc": "2026-01-18 04:20:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0ap9l4",
              "author": "its_k1llsh0t",
              "text": "I've seen this first hand at my last job. I am a servant leader. My bosses wanted command and control. Loyalty and yes-people. Your comment about culture is spot on. Saw a lot of finger pointing and people were always looking over their shoulder because no one knew who could be the next one out the door. I left because of it.",
              "score": 4,
              "created_utc": "2026-01-18 14:43:49",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0c3s39",
                  "author": "DwinDolvak",
                  "text": "Same. I left a well known publisher who you may have bought books from at school-based book sales because of this.  CTO was a tyrant who took it personally if people disagreed with him. I left after 10 months.",
                  "score": 1,
                  "created_utc": "2026-01-18 18:45:38",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o08ij6v",
              "author": "mrhinsh",
              "text": "This.\n\nId also promote the importance of \"intent based leadership\" (see Turn this Ship Around) and negotiation (see Never Split the Difference)",
              "score": 3,
              "created_utc": "2026-01-18 04:21:59",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o09hwc5",
              "author": "mondayfig",
              "text": "Are servant leadership and command & control necessarily polar opposites though? \n\nI feel they can live side by side when balanced correctly. The past ten years I've predominantly had leadership roles in high growth tech businesses and due to the constant and rapid change, and often chaos, I found that a level of command and control is actually quite helpful. \n\nI've always felt those periods of rapid growth where everything is constant breaking not that dissimilar to being in a crisis situation, which often needs more command and control.",
              "score": 1,
              "created_utc": "2026-01-18 09:11:28",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0a2al9",
                  "author": "DwinDolvak",
                  "text": "A servant leader asks “what can I do to help you be successful?”\n\nA c&c leader just tells you to what to do and asks for status on those requests. \n\nCan someone do both? Sure. Pretty confusing though. The motivations are ultimately different for both kinds of leadership.",
                  "score": 6,
                  "created_utc": "2026-01-18 12:15:14",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o0eugrk",
                  "author": "NobodysFavorite",
                  "text": "One book I recommend that's at least 10 years old now is \"Turn Your Ship Around\", by David L. Marquet. There's a great youtube video of an illustrated talk on it here: [https://www.youtube.com/watch?v=OqmdLcyES\\_Q](https://www.youtube.com/watch?v=OqmdLcyES_Q)",
                  "score": 3,
                  "created_utc": "2026-01-19 03:12:15",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o09c9ca",
          "author": "KeepYaWhipTinted",
          "text": "Most managers who have adopted an agile way of thinking and live those values and principles have a deep belief that they exist to help people and improve the system for them so they can do their best work.\n\nBut in a world where talented software engineers have been fired to make way for people overseas who earn nothing, have little experience, and are not motivated to solve their own issues, servant leadership is worthless.",
          "score": 5,
          "created_utc": "2026-01-18 08:19:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o08ujfv",
          "author": "WaylundLG",
          "text": "Servant Leadership (proper noun) is a very old and well established theory of leadership. It is still taught in many graduate programs including MBA's and many good leaders have at least been taught it and it probably works into their approach. On the other hand, servant leadership (general term) is pretty much ubiquitous in all modern leadership approaches. Enabling your people will always radically outperform carrot/stick, expert leadership, and hierarchical directive. You see those things here and there and with inexperienced leaders, but they vanish pretty fast the further along in leadership careers you go.",
          "score": 3,
          "created_utc": "2026-01-18 05:46:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o09s68f",
              "author": "Agileader",
              "text": "So I understand that Servant Leadership is *the* approach (most effective) and that experienced, accomplished leaders will own this approach?\n\nNot exactly what I generally see in upper management, nor in 'experienced' Scrum Masters / Agile Coaches in the german industry though.\n\nAlso, could you expand a little more about 'Servant Leadership' and servant leadership?",
              "score": 2,
              "created_utc": "2026-01-18 10:46:53",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0b36ty",
                  "author": "WaylundLG",
                  "text": "Servant Leadership is a leadership approach from Robert Greenleaf (greenleaf.org) that emphasizes the servant as leader, but also growth of followers and social benefit of people less priveledged. When people discuss servant leadership in regards to scrum or agile, they usually just focus on leaders that concern themselves with the needs of the team to succeed. That's likely why the newest scrum guide dropped the term servant leadership and switched to the awkwardly vague term true leader.\n\nI wouldn't say it is THE approach. There are quite a few theories of leadership out there. The bigger problem is that most managers and business leaders never get any leadership training. I don't know about your experience and I only worked with 5 or 6 German companies, but certainly all of them I worked with were at least trying to consider what their teams needed. Of course, that was during consulting and companies who hire consultants are usually actually trying to change, so my experience is a little skewed.",
                  "score": 2,
                  "created_utc": "2026-01-18 15:54:09",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o08v6bv",
          "author": "BoBoBearDev",
          "text": "Actually there is no right or wrong. I am a servant leader, but I won't tell you this is the only way or this is the only correct way.\n\n\nBecause I have seen it. My mom is a dictator, but she really kept the company alive. The CEO is wanting to burn the company down and my mom blocked it. And under her reign, there is very little mistakes, things are smooth, no need heroics to put out the fire. Other departments are happy because customers are happy. And without her strong personality, the CEO already implemented BS changes and burn the company down with bunch of layoffs.\n\n\nAnd yes, there is another ass kisser manager would follow the directions and would frequently cause hell that affects other departments. And each time my mom left the company, the CEO did their shit and indeed burn the company down.\n\n\nAlso servant leaders often has additional traits to be vague and open ended, because they are not supposed to micromanage. But then, eveyeone just do shit in the wrong directions.\n\n\nServant leaders has as many pitfalls as dictators.",
          "score": 3,
          "created_utc": "2026-01-18 05:51:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o097huc",
          "author": "nibor",
          "text": "I believe in it, have done since learning and introduction agile 23 years ago to the department of a large corporation I worked at as Senior Software Dev \n\nI believe it has allowed me to get to and stay at CTO level about 15 years ago across a number of SME organisations where it was easier to support than when I did corporate work. \n\nI fully respect and understand to concept of HIPPO and how that can alter what I believe Servant Leadership is.  I still use the chicken and pig story to emphasis who has input to ceremonies and who does not.  That is to say I personally do to listen and responds instead of tell and request and if I see others in my team fall toward dictatorial style it is addressed in our one2ones.\n\nI find this works for the  high level strategic deliverables we have to deliver, it can be less effective when there are smaller operational or short term deliverables that come from things like a change in regulation (think GDPR or DORA requirements if you are in the EU) or external business change (recently impact of war) but in situations like that I take a Commanders Intent approach.   That is allowing the team to put their own plans together to take an order and convert it into actions. To some extent it’s a similar concept accept it’s used sparingly for more urgent fixes deliverables where I have to ask a team to change priorities. \n\nIdeally during refinement I will ask for time, express the problem and why this is pressing, seek buy-in from the team, step back and then advice and support as necessary.",
          "score": 3,
          "created_utc": "2026-01-18 07:36:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ap8wi",
          "author": "Illustrious-Jacket68",
          "text": "Absolutely critical.  But, that servant leadership also needs to be respected and not abused.  It also needs to be supported, and not taken for granted by entitlement.",
          "score": 2,
          "created_utc": "2026-01-18 14:43:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0apnmh",
              "author": "Agileader",
              "text": "Cheers, what do you mean by the second part?",
              "score": 1,
              "created_utc": "2026-01-18 14:45:54",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0asslu",
                  "author": "Illustrious-Jacket68",
                  "text": "All too often, when a leader gives the latitude and gives the support to a team, they squander that away by not also understanding the needs of that leader.  \n\n  \nWhile i appreciate the notion that the opposite of servant leadership is command and control, expecting the servant leader to be able to change the entirety of any sizable company overnight is irrational.  Awareness of the environment in which the team operates and looks to contribute and support that servant leadership that is likely taking a chance him/herself, is not being realistic.",
                  "score": 2,
                  "created_utc": "2026-01-18 15:02:27",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0apr69",
          "author": "teink0",
          "text": "It is useful if the leader is capable and dependable of serving. In the TPS a team member had an idea for a new tool to improve productivity and told the leader. The leader prototyped it, gave one to the team member, and when it was found to work made one for each team member.\n\nIf an improvement potential originates from a team member can the team rely on the servant leader to do it without breaking the flow of the rest of the team. If so the team can accelerate.",
          "score": 2,
          "created_utc": "2026-01-18 14:46:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0b4jp4",
          "author": "ExitingBear",
          "text": "The idea is good.\n\nAnyone who uses the term more than once in a quarter is suspect.",
          "score": 2,
          "created_utc": "2026-01-18 16:00:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0d6c1u",
          "author": "PhaseMatch",
          "text": "**TLDR;  I see servant leadership -as part of a generative, learning organisation - as an endpoint;  you may need to do a lot of building using other leadership approaches to get there**, **over a long cycle.**\n\nI tend to lean more towards \"situational leadership\" and \"intent based leadership\", and indeed Winston-Patterson's \"**Integrative definition of leadership**\" (2006)\n\nServant leadership is highly effective when it's supported by a wider \"learning organisation\" culture, but without that you can just leave people confused, frustrated and anxious, as Amy Edmondson touches on (**\"The Fearless Organisation**\", 2018)\n\nSo for example, if\n\n\\- there's zero investment in non-technical skills within a team  \n\\- there's zero investment in technical skills within the team  \n\\- people are measured based on their individual productivity  \n\\- short-term delivery is valued more than long-term sustainability  \n\\- the team lacks core agile technical delivery skills  \n\\- the organsiation is heavily \"Theory-X\"  \n(see **\"The Human side of the Enterprise\"** \\- **McGregor, 1960**)\n\nthen if you rock up and only hold a servant leadership stance, you'll be seen as either taking no responsibility/accountability or being vaguely passive aggressive.  You'll probably get fired at some point too.\n\nSo in a \"**situational leadership II**\" context, servant leadership works well when the organisation's maturity level has reached the stage where everything is in that  \"delegating\" phase.  That's similar in intent to Ron Westrum's ideal of \"generative\", (**\"A Typology of Organsiational Cultures\"**, **2004**)  - where the team's job is to escalate systemic issues to leadership, and leadership's job is to fix those issues. (See **\"Accelerate: The Science of Lean Software and DevOps\", Forsgren et al 2018**)\n\nOften you have to:\n\n\\- start out with the intent;  \n\\- raise the bar through the \"selling\" and \"telling\" phases;  \n\\- \"drive out fear\" (\"**Out of the Crisis!\" W Edwards Deming 1980**)  \n\\- apply individual \"coaching arcs\" to teams and leaders  \n(see **\"Extraordinarily Bad Ass Agile Coaching\" - Galen 2022**)\n\nbefore you can really settle in to that \"servant leadership\" outcome. \n\n**Without that you'll at best see teams become defensive silos with a lot of bureaucratic process control in order to feel safe.  Ask the teams how you can help and they'll lay in more processes and tools, and you will slide into stage-gate waterfall delivery.**\n\nWhen you get there, that's also when an organisation doesn't really need a dedicated Scrum Master or Agile Coach role;  you have hit the whole \"Learning Organisation\" thing (**\"The Fifth Discipline\" - Peter Senge 1990**)",
          "score": 2,
          "created_utc": "2026-01-18 21:58:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0dko91",
              "author": "Agileader",
              "text": "Thank you for this extensive reply!",
              "score": 1,
              "created_utc": "2026-01-18 23:06:52",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0dp763",
                  "author": "PhaseMatch",
                  "text": "Yeah I might be a Gen-X high-functioning autistic but that means when other people are classifying the surface ripples I'm mapping out the underwater rocks that make those intriguing patterns lol  \n  \nStill - there's a TLDR there at least.  \n  \nPeople are increasingly looking for short-form quick-fix answers.  \nThat's always going to limit your growth.  \n  \n\\- if you don't know the deeper theory, it's just dogma  \n\\- dogma becomes \"performance theatre\" very, very fast  \n  \nBeen waaaaay to much of that in agile circles (IMHO) to the point where it's turned agile into buzzword bingo while blaming others when you can't affect organizational change.  \n  \nYou want to get good?  Long form content, invest time and careful reflection FTW. \n\nSaw a lot of this stuff done really, really well back in the early 1990s before anyone talked about Scrum or XP or agile.  It was just \"how we did things round here\" - tech changes, humans don't.",
                  "score": 2,
                  "created_utc": "2026-01-18 23:29:50",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0djppz",
          "author": "quts3",
          "text": "Servant leadership is to often a cover for leaders that \"other\" their team. The leader who is helpful but not to blame if things don't work out.  To many firms let this type of management position exist and it's a tax on the project.\n\nI think it is a useful strategy if you are sure you will be the first person to have to account for the failure of a project or feature and literally everyone knows that without being told. In that case you don't need much of a strategy to not fall into the helpful observer trap that brings down team. For everyone else though it is just too easy to check out and project \"I'm just watching this shit show. Don't shoot the messenger\" vibes.\n\nI read a leadership book over Christmas out of silicon valley that argued all managers should use a percentage of their time doing the things their direct reports do to keep their technical edge.\n\nI think that can go a long way for someone that wants to be servant leader. If you spend 4 days a week as a servant leader for a project spend 1 day a week as a performer. It keeps you accountable and also helps you speak the same language as your team. Maybe makes you have a more natural connection which will help you actually be a servant leader.",
          "score": 2,
          "created_utc": "2026-01-18 23:02:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0e9c0n",
          "author": "WideFunction6166",
          "text": "Servant Leadership is a good, but very dated model.  The concept of 'Host Leadership' is much more relavant to today.",
          "score": 2,
          "created_utc": "2026-01-19 01:17:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0gfdh2",
              "author": "Agileader",
              "text": "Could you expand on that? Especially in the context of agile product development?",
              "score": 1,
              "created_utc": "2026-01-19 10:46:51",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0ghdo9",
                  "author": "WideFunction6166",
                  "text": "Especially if you are working with global teams the context of 'Servant' carries differing contexts.  The 1970ish Greenleaf concept of Servant Leadership is fine, don't get me wrong.  However not every culture and person aligns to it easily.  Interestigly every culture aligns to the concept of being a good 'Host.' What resonated with me personally about 'Host Leadership' is the notion that the Host sets up the party and gives everyone their chance to have their moment.  The responsibility for enoying that moment is the attendees.  \n\nProduct development perhaps requires everyone at the party to be flexible and go with the flow.  It's a party after all, there may be some uncomfortable moments, but there is fun to be had if you commit.  I am in no way affiliated with these guys but I think they have a better idea than sevant leadership: [https://hostleadership.com/](https://hostleadership.com/)",
                  "score": 1,
                  "created_utc": "2026-01-19 11:04:49",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0f86eu",
          "author": "the-pantologist",
          "text": "Tbh, this is just another term that litters the business landscape with more meaningless babble.  If you came up to me and asked what I thought of the most germane aspects of “servant leadership” I would slap you across your face at level 10 force.  Just use common sense and treat people right and lay off the corpo-jargon.",
          "score": 1,
          "created_utc": "2026-01-19 04:38:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0gflzm",
              "author": "Agileader",
              "text": "People use literature and concepts to reflect their work, attitude and demeanor.",
              "score": 1,
              "created_utc": "2026-01-19 10:48:58",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o096os0",
          "author": "Pretty-Substance",
          "text": "It’s a ruse used mostly to be able to appeal to employees, especially developers, in times it’s hard to find good talent. \n\nIn reality there’s constant management override and when jobs are harder to come by companies very quickly reverse to a strictly hierarchical way of operating.",
          "score": 1,
          "created_utc": "2026-01-18 07:29:02",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qh13e3",
      "title": "My first 2026 sprint retrospective",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1qh13e3/my_first_2026_sprint_retrospective/",
      "author": "yukittyred",
      "created_utc": "2026-01-19 10:52:37",
      "score": 10,
      "num_comments": 29,
      "upvote_ratio": 0.82,
      "text": "\nI’m looking for some feedback on a recent sprint retrospective I just joined. We have two teams that were recently combined, and it was a bit of a chaotic start—we actually had to use a Discord \"wheel of fortune\" just to pick someone to take notes because the team was so hesitant.\nI’ve listed the key takeaways below and would love to know if these are \"normal\" growing pains or if we are heading in a weird direction. \n\nWhat Went Well\n * Standardizing Reviews: Finally got code reviews integrated into the workflow.\n * Cross-Unit Collaboration: Our SD unit started utilizing the AI Unit group in GitLab, which is a big win for resource sharing.\n\nWhat We’re Stopping (The \"Red Flags\")\n * Massive Merge Requests: We’re implementing a hard rule: if an MR takes longer than 30 minutes to review, it’s rejected.\n * Production Cowboys: No more compiling or packaging on the production server. We're moving to a private registry for built images.\n * Estimation Issues: Stopping the use of \"distribution factors\" for man-day calculations (it’s been inaccurate) and stopping last-minute sprint backlog changes.\n * Task Management: Developers were juggling multiple user stories simultaneously; we’re moving back to a \"one person, one priority\" flow.\n\nWhat We’re Starting (The Action Plan)\n * Accountability: No more \"ghost tasks\" (work without records) or editing tasks you aren't assigned to.\n * Technical Debt & CI/CD: Cleaning devcontainers every sprint, improving pipelines incrementally, and ensuring test results are visible directly in the MR.\n * Local Dev: Pushing for local development on lightweight projects to save server resources.\n * Communication: Meeting Minutes (MoM) for reviews and reporting unresolved bugs to the Scrum Master at least 2 days before the review.\n\nMy questions : is there anything or weird thing in our sprint retrospective? \n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1qh13e3/my_first_2026_sprint_retrospective/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o0gipkb",
          "author": "sweepers-zn",
          "text": "Looks solid! I’m curious how you arrived at the conclusions. Did someone say “this is what we’re doing/not doing from now on” or was it a more collaborative process?\n\nYour outcomes look mostly like changes in behavior rather than specific actions. How are you planning to track they were implemented?",
          "score": 7,
          "created_utc": "2026-01-19 11:16:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0gj3v1",
              "author": "yukittyred",
              "text": "All of this decision is made by our unit head, basically the guy who manages us.\n\nHe just listen and then tell us what to write on it. \n\nThere's alot of problems hidden actually but we just pretend it's nice.",
              "score": 4,
              "created_utc": "2026-01-19 11:20:05",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0h1n5f",
                  "author": "HydrolyticEnzyme",
                  "text": "That sounds like the team doesn’t own any of those actions/improvements if the decisions were all made by the manager.  What did members of the team want to do?  Did they have their own ideas?\n\nSomeone coming up with a ‘good enough’ idea themselves will have more engagement than being told the ‘perfect’ idea from someone else. \n\nIf the team is used to the manager/someone outside the team coming up with ideas, that can build the habit of just waiting to be told what to do. ",
                  "score": 4,
                  "created_utc": "2026-01-19 13:34:59",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o0h5032",
                  "author": "sweepers-zn",
                  "text": "Okay so what looks like a nice retrospective outcome is actually a prescription from the manager. A red flag but not necessarily a problem.\n\nIt appears that the prescription solves some pains that the team identified themselves, is that right?\n\nDo the team members respect the manager? Do they agree with the solutions? Will they follow the guidelines? What are you doing yourself to ensure the guidelines will be followed? Are you planning to review how successful you were in following them in the next retro?",
                  "score": 2,
                  "created_utc": "2026-01-19 13:54:15",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o0m8f1j",
                  "author": "PhaseMatch",
                  "text": "\"manager tells team what to do\"  will tend to drive a couple of things\n\n\\- people do what they are told while they are being watched  \n\\- people don't do anything they are not explicitly told to do \n\nIn the short term for inexperienced teams \"telling\" works, but the coaching arc you have for that manager might want to take them through \"Selling\" and \"Telling\" and onto \"coaching\" and \"delegating\", if they really want to drive high performance.",
                  "score": 1,
                  "created_utc": "2026-01-20 05:22:28",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0glxus",
          "author": "app1310",
          "text": "This reads very normal for a team that’s just been merged....early uncertainty followed by tighter working agreements is a common pattern.  \nOne thing to keep an eye on is review time rules - speed is important, but clarity and shared understanding matter just as much....Overall the focus on single-priority work, clear ownership and better communication feels like healthy stabilization rather than a red flag.",
          "score": 2,
          "created_utc": "2026-01-19 11:44:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0gn7uk",
          "author": "Dsan_Dk",
          "text": "I would say this looks great, my ambition is to get my teams close to these topics atleast.\n\nMy experience is that when we have this many actions to start, teams often get critical that to much is in focus, and the result is often that none of it is truly tried and implemented in the following sprint. \n\nSo I am trying to become better at having the team reflect deeper towards what is the MOST limiting, so they focus on 1 thing to change or try in the comming sprint - the rest is fairly talked about, and if they want, they can do those aswell but we won't follow up necessarily.",
          "score": 2,
          "created_utc": "2026-01-19 11:54:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0gox2k",
          "author": "LazyJogi",
          "text": "IMO, there are too many action items, and they don’t look very concrete. Maybe you discussed this during the retrospective, but based on the text alone, they don’t seem actionable enough.",
          "score": 1,
          "created_utc": "2026-01-19 12:08:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0gpe3k",
          "author": "Kenny_Lush",
          "text": "“Accountability: No more \"ghost tasks\" (work without records) or editing tasks you aren't assigned to.” \n\nThis is where “agile” always loses me. Maybe it’s ADHD, but if I’m not free to roam the range I’d lose my mind.",
          "score": 1,
          "created_utc": "2026-01-19 12:11:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0jffkz",
          "author": "Sweaty_Ear5457",
          "text": "yeah the weirdest part is that your unit head is basically dictating the whole thing and the team is pretending it's fine. a real retro needs the team to actually drive it, not just take orders. maybe try a different approach where everyone can throw cards onto a canvas anonymously or collaboratively, then group them into zones by theme and draw arrows between related problems. that way the hidden stuff actually has a chance to surface. i use instaboard for this kind of team mapping - the infinite canvas lets you see everything at once instead of just listing things in linear format.",
          "score": 1,
          "created_utc": "2026-01-19 20:17:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0juz3w",
              "author": "yukittyred",
              "text": "Oh I try this before but they told me it is a waste of time so we don't use anymore.",
              "score": 1,
              "created_utc": "2026-01-19 21:31:46",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0kqbty",
          "author": "ScrumViking",
          "text": "While I applaud your team’s eagerness to improve things, chances are that none of these items will really be implemented within the next few sprints. \n\nOften it’s better to really focus on one or two items that will help the team, create a plan of implementation, determine how to measure its outcome throughout the sprint. \n\nIf you are interested in reading a bit about how to organize retrospective, that can lead to meaningful, positive change, I can really recommend the book from Esther Derby called “Agile Retrospectives”.",
          "score": 1,
          "created_utc": "2026-01-20 00:13:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0kzb5w",
          "author": "WideFunction6166",
          "text": "Some of these look like working agreements rather than actions.  Are working agreements written down?  It might do to gather a list of working agreements and review them at the beginning of each Retro.  Suggest turning 2-3 of these into stories and making the rest working agreements to be chewed over in future retros.  This looks like a team that should discuss kanban practices.",
          "score": 1,
          "created_utc": "2026-01-20 01:01:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0l9aor",
              "author": "yukittyred",
              "text": "I did ask why don't use kanban, but our supervisor say its scrum and nothing is wrong.\n\nWorking agreement is our business process which was written down and force to follow.\n\nOur user story have to accept all those things from business process.",
              "score": 1,
              "created_utc": "2026-01-20 01:56:20",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0nhjzv",
                  "author": "WideFunction6166",
                  "text": "Since it is your first retro, get into the flow.  Ultimatly the decision on how the work is processed belongs to the team.  As you get to know the supervisor some coaching may be needed.  The Distribution Factors idea screams Kanban to me.  Take your time.  Come to know all the people.  The heart of agile isnt scrum or kanban it is an empowered team",
                  "score": 1,
                  "created_utc": "2026-01-20 11:54:25",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0m64a0",
          "author": "Mr_Matt_Ski_",
          "text": "Was your retro in person or remote? Having to use a tool to pick a note taker kind of feels like no one wants to be the one speaking up. I’d recommend allowing anonymous feedback next time, I find that can make a huge difference in newer or combined teams where everyone’s not yes super comfortable. If you’re doing them remote, check out Kollabe. It’s pretty easy to add anonymous feedback",
          "score": 1,
          "created_utc": "2026-01-20 05:06:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0n55dc",
              "author": "yukittyred",
              "text": "We doing physical only",
              "score": 1,
              "created_utc": "2026-01-20 10:08:12",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0m9k8h",
          "author": "PhaseMatch",
          "text": "Not clear to me \n\n\\- how you are measuring performance  \n\\- how you are measuring your experiments\n\nWithout something to measure you will be left with dogma; did our additional processes make things better?\n\nIf the processes are imposed top down and don't tie back to any measure, then expect them to start to erode over time, which will lead you back round in a circular loop or adding more processes...",
          "score": 1,
          "created_utc": "2026-01-20 05:30:45",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qit3zb",
      "title": "Agile Transformed how my department works, but not getting recognised. How did you handle this?",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1qit3zb/agile_transformed_how_my_department_works_but_not/",
      "author": "Maverick2k2",
      "created_utc": "2026-01-21 09:08:38",
      "score": 6,
      "num_comments": 36,
      "upvote_ratio": 1.0,
      "text": "In my current role, I’ve fundamentally transformed how my department operates.\n\nWe went from:\n\n\t•\tLittle to no visibility over the pipeline of work\n\n\t•\tFrequent escalations and firefighting\n\n\t•\tPoor relationships with cross-team dependencies\n\nTo:\n\n\t•\tFull visibility of delivery and priorities\n\n\t•\tFewer escalations and more predictable outcomes\n\n\t•\tStronger, more strategic cross-team relationships\n\nThe work is respected and people openly say things run much more smoothly now. I’m seen as someone who “keeps things running” and unblocks problems.\n\nThe issue is recognition.\n\nWhen it comes to showcasing impact, leadership tends to spotlight my peers’ initiatives instead. Their work gets presented upward, raising their profiles, while my transformation work stays largely in the background - even though it underpins a lot of what others are delivering.\n\nI’m not being treated badly, and I am respected, but it feels like I’ve become invisible in terms of progression. I’m starting to think about leaving, but before I do:\n\nFor those who’ve been in a similar position - how did you handle it?\n\n\t•\tDid you manage to reframe your impact and get recognition internally?\n\n\t•\tDid you deliberately change how you worked to be more visible?\n\n\t•\tOr did you eventually leave, and was that the right call?\n\nWould really appreciate hearing how others navigated this.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1qit3zb/agile_transformed_how_my_department_works_but_not/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o0tr344",
          "author": "mmmleftoverPie",
          "text": "Do you have before and after metrics with respect to initiatives being delivered?\n\nEg 10 initiatives per quarter pre-transfornation, 15 initiatives per quarter after.\n\nOr x% initiatives delivered on time compared to y% delivered on time before.\n\nThat can help you.\n\nOtherwise can you measure/identify the reduction in fires that need putting out.\n\nAre you org's engagement scores rising?\n\nIs sick leave down?\n\nIt's a rich tapestry.",
          "score": 5,
          "created_utc": "2026-01-21 09:14:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0trak8",
              "author": "Maverick2k2",
              "text": "Yes , I track throughput and lead time. There has been an improvement with both. \n\nLeadership acknowledges this , but that’s it.",
              "score": 1,
              "created_utc": "2026-01-21 09:16:21",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0trefq",
                  "author": "mmmleftoverPie",
                  "text": "What recognition are you looking for?",
                  "score": 2,
                  "created_utc": "2026-01-21 09:17:26",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o0tsiwv",
                  "author": "LogicRaven_",
                  "text": "What are some differences between your peer’s initiatives and yours? \n\nBoth in terms of topic, deliveries and how the results are presented.",
                  "score": 2,
                  "created_utc": "2026-01-21 09:28:22",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o0x5vlr",
                  "author": "TMan-X",
                  "text": "Throughput and lead time doesn’t equal value. Figure out how to measure that in your setting.",
                  "score": 1,
                  "created_utc": "2026-01-21 20:27:54",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0u3t3l",
          "author": "flamehorns",
          "text": "Invisible is good. The old days of fetishizing agile are long gone. You can drive the recognition. You can thank management and all team members for their support. You are a servant leader, you know you did well, your ego doesn't need masturbating, you are above that. Stay invisible, keep serving quietly from the background, and praise the others and masturbate their egos generously.",
          "score": 3,
          "created_utc": "2026-01-21 11:11:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0u9nts",
              "author": "Maverick2k2",
              "text": "It just really comes down to being paid what you are deserved. The work I’m doing is hard. Driving change without any authority.\n\nOn that note, I am well on my way with solving systemic organizational problems and I’m being paid a lot less that my manager. \n\nDoesn’t make sense.\n\nI am also coaching other departments on how to structure their work and building a reputation as an Agile expert.",
              "score": 1,
              "created_utc": "2026-01-21 11:57:43",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0unsy8",
                  "author": "flamehorns",
                  "text": "Oh it’s about money. In most companies I worked at, you can negotiate for a raise at least once per year, and you bring all this as an argument why you should earn more. Usually, in the companies I know, you don’t always get the raise, depends how well the company overall is doing. \n\nBut that’s just a quiet chat with the line manager. Good luck and I hope you get paid what you deserve.",
                  "score": 1,
                  "created_utc": "2026-01-21 13:30:08",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0vzc92",
          "author": "agile_pm",
          "text": "You solved a problem and moved things from dysfunction to competence.  You did what you're paid to do.  \n\nEven though what you accomplished is genuinely valuable, it's not strategic in the way that leadership defines strategy.  The issue isn't recognition; it's that you are not positioning your work in terms of outcomes.  Operational excellence is not the same as enterprise movement.  Delivery, predictability, and stronger relationships are table stakes.\n\nWhat can the organization do now that it couldn't before?  Which strategic problems were solved or opportunities were realized?  You're winning an operational game while trying to be promoted into a strategic game.  I don't know if it's too late to capitalize on past success, but going forward be sure to reframe your success in terms of strategic outcomes, not just operational efficiency.\n\nI'm not saying you should leave, but I was in a similar situation and was not promoted until after I left and proved myself at the next employer, where I was intentionally and visibly more strategic.",
          "score": 2,
          "created_utc": "2026-01-21 17:18:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0x5ns3",
          "author": "TMan-X",
          "text": "You say the issue isn’t about recognition. Clearly though it is or you wouldn’t be posting about it. You also stated “I’ve fundamentally transformed how my department operates”.\n\n News flash, it isn’t about you.\n\nAs a good Scrum Master you should be highlighting how the TEAM transformed and more importantly how that resulted in better outcomes and value for their stakeholders.\n\nIf a scrum master does their job right, they put themselves out of a job. You either build on your success and go help another team in your organization, you move into a different role, or you go work somewhere else.",
          "score": 2,
          "created_utc": "2026-01-21 20:26:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0tvvfy",
          "author": "ScrumViking",
          "text": "One of the core conflicts is that impact of successful transformation is delayed and hard to correlate. This is where setting objectives and visualizing progress towards them can really help give it the attention it deserves. Leading with Obeya is a good method to create insight into translating strategic objectives towards results, couple them with initiatives and impediments.",
          "score": 2,
          "created_utc": "2026-01-21 10:00:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0u32yg",
          "author": "corny_horse",
          "text": "The obvious omission in our entire post is how that translates to $.  If you just took the three info points from your first two, you could achieve the same points by tanking the team productivity, too. Less stuff done = more visibility and fewer escalations, and more time to be \"strategic.\"  \n\nWould that be good for the company and/or team? Probably no to both.\n\nYou need to translate that into how you are achieving results and how that helps the team ship code to customers who pay you money.",
          "score": 1,
          "created_utc": "2026-01-21 11:05:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0uaexx",
              "author": "Maverick2k2",
              "text": "That is the problem, it doesn’t cleanly translate to dollars . At the same time, I’ve got the department to the point where they have more clarity in terms of how the work is planned and delivered. Previously nobody had any idea of what was going on. I’m sure that should account for something?",
              "score": 1,
              "created_utc": "2026-01-21 12:03:17",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0ucyob",
                  "author": "jesus_chen",
                  "text": "It does account for something: your firm values it at $55k per year. \n\nIf I were you, I’d get the firm to pay for every Scrum cert under the sun including product roles because what you aspire to be, based on your feedback in this thread, is a Product Owner. Get the certs, put your jead down and work on tour resume (with How you transformed a loose engineering org into a product machine) and once the market turns back up (2027?), go for a new org with a ton pf experience on your CV.",
                  "score": 2,
                  "created_utc": "2026-01-21 12:21:46",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o0uh2zt",
                  "author": "corny_horse",
                  "text": "Your department doesn't do anything that produces value?  It should be glaringly obvious how your department produces value, even if you're a cost center.  In the case of the former, it's the amount of profit, if you're a cost center its the amount of labor hours you've saved.  \n\nFor example: How expensive was an escalation before the work?  How frequently did they happen?  If you had one incident a month and it required 50 engineering hours to fix, and now there are .33 incidents per month and they take 1 hour to fix... back of the napkin math - which is sometimes just as good as management is concerned would reveal you want from ~$1.2m in firefighting to $5-10k annually.",
                  "score": 1,
                  "created_utc": "2026-01-21 12:49:26",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0v81x5",
          "author": "Triabolical_",
          "text": "You need statistics and - shudder - a dashboard. \n\nOne of the inherent problems with software is that trans work on different things and nobody knows how long they should take, and managers often look at activity as a sign of improvement and innovation. \n\nCalm and competent teams get ignored. \n\nI led one team where we had a lot of control over process and we did really, really well. Calmly. \n\nI ended up with very high ratings in employee satisfaction - in the high eighties versus the mid seventies. \n\nAnd... I got marked down on my review because I wasn't working my employees hard enough. And my peers were unhappy because they made me look bad. \n\nSo figure out the stats that make you look good but beware of your peers because they will fight back, even if they are your friends.",
          "score": 1,
          "created_utc": "2026-01-21 15:14:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0vzskb",
          "author": "Budget_Pin5828",
          "text": "Demonstrating Value and Impact \n\n* What are you tracking today?  I think I saw in the comments below you are tracking lead time and throughput. \n* How are tracking value and input?  How are you translating that into actual dollars?  Either cost avoidance or roi?\n* What leading indicators are you tracking?\n*  What I am seeing and typically see alot are metrics, but not metrics tied to value.  Cycle time and lead time went down, so what?  Translate that into dollars. Did we make more money because we delivered early?  If defects are down, are there fewer customer complaints or has customer retention or activation improved?\n* While the metrics you are capturing are ok, they don't speak to the overall value or impact to the bottom line, or to the overall product/customer lifecycle.  \n\nRecognition and promotion  \n\n* The market is flooded with Scrum Masters and Agile Coaches.  \n* So if you're looking to exit your company, it's ultra competitive out there.  You'd be competing with SMs that have your success story 5 times over\n* Further, these SMs and Agile Coaches have already figured out how to tie their process metrics to actual dollars.  \n* Things that appear to be missing (based on your post) that would help make the case for a promotion:\n   * Tying process metrics to value and impact\n   * Metrics translations to actual dollars\n   * Customer and Stakeholder Sentiment\n   * Product and Customer Metrics\n* These will help you build a broader empirical narrative for making your case for promotion. its hard to argue with empirical data with tangible impact.",
          "score": 1,
          "created_utc": "2026-01-21 17:20:28",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qgcq2r",
      "title": "First SM role, need advice",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1qgcq2r/first_sm_role_need_advice/",
      "author": "throwawayyqweqwe",
      "created_utc": "2026-01-18 16:17:11",
      "score": 4,
      "num_comments": 8,
      "upvote_ratio": 0.75,
      "text": "Hello everyone, I work as a Junior Consultant and I took the PSM test a few months ago (I passed). Although I know it by theory, I never had any chance to apply it/be in a scrum team. Now I have been assigned to a project where I will be a scrum master and I have no idea how to start, or establish a process. I’m really stressed out looking things up online, asking around. Can you guys give me some advice? Real life scenarios, how you drive the stand ups, how you schedule the ceremonies, who should I reach out to. Anything really will help. Thank you so much.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1qgcq2r/first_sm_role_need_advice/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o0bajve",
          "author": "Fr4nku5",
          "text": "If you work at a consultancy, you might be better off asking people in the consultancy.\n\n\nSome of the larger consultancies have their own spin on scrum. For them they might want you to record minutes or ensure everyone is doing lots of work... or they might want you compiling reports on your team...\n\n\nI suspect it'll be more like that, because you've been given a job and little support in the way of documentation or a mentor.\n\n\nI hope I've got the wrong end of the stick, but acting on advice from this community might contradict you consultancy's practices and reflect poorly on you. ",
          "score": 5,
          "created_utc": "2026-01-18 16:28:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0bq1wi",
              "author": "Kenny_Lush",
              "text": "I suspect you are right. In “weaponized agile” the role is “summarize and report on the daily status call.”",
              "score": 5,
              "created_utc": "2026-01-18 17:42:49",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0brbeo",
          "author": "Bernhard-Welzel",
          "text": "I had the Scrum Master role in 20+ Organisations so far. It was always different and there is no pattern.\n\nYour #1 priority should be to understand what is expected of you. Ask your manager: \"How can you tell i did a great job?\" - \"how will you evaluate my performance?\"  \n  \nFrom way to much experience, i fear what is expected of you is to be the manager of a feature factory: Make sure the team delivers stuff, make sure they play nice with each other and don´t start any drama. In short: manage the throughput of the team and make sure what is promised gets delivered. At the core, it is the \"make sure\" part that you need to figure out. \n\nFor the rest: ask an LLM for advice - it will give you all the details you need. \n\nThe Scrum Master role that the trainings or scrum guide talks about needs something that you might not have: senior management buy-in and support. To be effective as a SM, you have to be part of an ongoing transformation of the organisation that is fully aligned with the business goals and C-Level.  \n  \nOtherwise, you just burn out or get kicked out very, very quickly.",
          "score": 4,
          "created_utc": "2026-01-18 17:48:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0qpfcg",
              "author": "Wiszcz",
              "text": "It was always different and there is no pattern. - exactly",
              "score": 1,
              "created_utc": "2026-01-20 21:31:06",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0gdl1k",
          "author": "MagnusLink",
          "text": "Hey! Exciting with a new role and new experiences. Understandably scary, too. \n\nIf you go in with the right mindset, you will be fine. Before you make many changes or force strict Scrum rules on people, observe and listen.\n\nYour approach will depend on the team’s past experience and how they work now. It also matters if this is a new team.\n\nSet up 1-on-1s with people inside and outside the team. Ask what works and what does not work. Ask how open they are to change and what you should focus on first. This does not mean they are right or that you must do what they say. It will, however, give you very useful input for your next steps.\n\nTo answer your specific questions:\n\n1. For stand-ups, try to keep them short. If they already do daily stand-ups, keep the format until you know what works in their context. Check if one person runs the meeting, if there are too many people, and if it is a status report instead of a focus on blockers and teamwork.\n\n2. I prefer shorter iterations, (1-2 weeks). I plan ceremonies in the middle of the week, not Monday or Friday. I also plan prep meetings with the team or with a few people before the main ceremonies.\n\n3. Meet everyone on the team in 1-on-1s. Also meet key people outside the team. You can ask the team who those people are.\n\nGood luck!",
          "score": 2,
          "created_utc": "2026-01-19 10:30:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0lfyi5",
          "author": "No-Literature-6695",
          "text": "Find games and questions to help the team get to know each other and build trust. \nHelp the team learn the signs of anti-agile patterns: stories stuck in-process, stories piling up in testing, all or most stories getting done in the last 1-2 days of the sprint, pushing ‘almost done’ stories to the next sprint, instead of the the backlog for re-prioritization. Role or domain specialization within the team (yes, this slows things down.)\n\nGently guide the team into find their own solutions to these anti-patterns. \n\nYou should have monthly confidential one-on-ones with each member of the team. They may not feel safe enough to be honest, especially, if they’re offshore, but you can often discern clues of problems with team dynamics. Speaking of off-shore, their culture may be very hierarchical. You want to encourage, incentivize, and praise speaking up, pointing out problems, and speaking truth to power (i.e. you, the product owner, the BSA/tech PO, and anyone else with scary onshore role or culture power.",
          "score": 1,
          "created_utc": "2026-01-20 02:32:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0o69zj",
          "author": "bookninja717",
          "text": "Also ask the team. \n\nA consultant almost always starts with: \"How is this working for you?\" \n\nIn my first job, I asked the team what they needed, and I got a very different answer than I expected.",
          "score": 1,
          "created_utc": "2026-01-20 14:26:28",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qipgu6",
      "title": "Free retrospective formats that actually surface real issues",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1qipgu6/free_retrospective_formats_that_actually_surface/",
      "author": "easy-agile",
      "created_utc": "2026-01-21 05:35:20",
      "score": 4,
      "num_comments": 19,
      "upvote_ratio": 0.6,
      "text": "Hey r/agile \\- I work at Easy Agile and we've been collecting retro formats from teams for a while now. We built a free tool (Easy Agile Review) but honestly the formats themselves are useful regardless of what you use to run them.\n\nSome that consistently work well:\n\n* **Sailboat retro** \\- what's pushing you forward, what's holding you back, what risks are ahead\n* **4Ls** \\- Liked, Learned, Lacked, Longed For (good for reflecting on learning)\n* **Mad, Sad, Glad** \\- helps surface emotional blockers that \"start/stop/continue\" misses\n\nThe ones that tend to fall flat:\n\n* Start/Stop/Continue when it becomes too routine\n* \"Roses and thorns\" when teams aren't psychologically safe yet\n\nWhat formats have actually helped your team have honest conversations vs just going through the motions? Always looking to understand what works in practice.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1qipgu6/free_retrospective_formats_that_actually_surface/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o0u6s7x",
          "author": "Sky_Linx",
          "text": "Honestly, I've come back to plain plus/delta more times than I can count. The fancy formats are fun to try but they often get in the way.\n\nThe main thing I've noticed is that simpler formats mean people actually think about what they want to say, rather than spending half the time wondering \"wait, is this a 'Lacked' or a 'Longed For'?\" With two columns with obvious and straightforward meaning, there's nowhere to hide and nothing to overthink.\n\nThe other benefit is everything in the \"needs improvement\" column is already pointing at action. You don't have to decode metaphors about anchors and winds to figure out what to work on next.\n\nI also think elaborate formats can feel a bit performative after a while - the novelty wears off and then you're stuck with something complicated that's also stale. Plus/delta just... keeps working.\n\nNot saying the other formats are bad - sailboat can be great for a change of pace - but for week-in-week-out retros, simple wins.",
          "score": 4,
          "created_utc": "2026-01-21 11:35:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0uuvc7",
          "author": "CassiusBotdorf",
          "text": "In all seriousness, all of the retrospective templates are just variations of mad sad glad. Personally, and maybe that's really just me, I see little value different templates add to the process. The process is the thing that adds value.",
          "score": 8,
          "created_utc": "2026-01-21 14:08:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0uxwve",
              "author": "Sky_Linx",
              "text": "Agreed! At the end of the day every format boils down to \"what's working, what isn't, and how do we feel about it\". The wrapper is just packaging.\n\nThe value comes from the conversation and what you do with it afterwards - not from whether you're using a sailboat or 4Ls or starfish or whatever the flavour of the month is. IMO a well-facilitated plus/delta beats a poorly-run elaborate format every time.\n\nIf anything, I think the obsession with finding the \"right\" template can be a distraction from the harder work of actually creating space for honest feedback and then following through on it.",
              "score": 3,
              "created_utc": "2026-01-21 14:24:32",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0tj5ec",
          "author": "ya_rk",
          "text": "It's not a format but a meta-structure for retrospdctives in general that I like to keep in mind:\n\nORID - Objective, Reflective, Interpretation, Decision",
          "score": 2,
          "created_utc": "2026-01-21 07:58:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0u7vsr",
              "author": "Sky_Linx",
              "text": "Yeah this is a good distinction. ORID works as a mental model for the facilitator - making sure the conversation moves from facts to feelings to meaning to action, rather than jumping straight to solutions before the problem is properly understood.\n\nI think the key is it stays invisible to participants. If you're explicitly walking the team through \"okay now we're in the Interpretive phase\" it gets a bit workshop-y. But as a guide for how to steer the discussion, it's solid.\n\nAnd it works with any format - you could run a simple plus/delta while using ORID to shape how you facilitate it.",
              "score": 3,
              "created_utc": "2026-01-21 11:44:29",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0v4u20",
          "author": "clem82",
          "text": "I can get in a room without a format and surface real issue\n\n\nThe visual tool is just a tool, the person is how you uncover issues",
          "score": 2,
          "created_utc": "2026-01-21 14:59:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0y45zf",
              "author": "easy-agile",
              "text": "100% agree. I've seen facilitators with zero tools still run amazing retros just by asking good questions and actually listening. The format is scaffolding at best.\n\nThat said, for newer facilitators or teams that struggle with participation, having a structured format can be a helpful crutch until they build that muscle. But yeah, the person matters way more than the pretty template",
              "score": 1,
              "created_utc": "2026-01-21 23:09:43",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0y4jsj",
                  "author": "clem82",
                  "text": "I agree, but I think it comes down to the person.  \n\nIf the person is good with people, they should not force use the tool and think about how to uncover the information. The right SM/facilitator it will come natural to it.  Where the struggle comes in is if they're forcing it",
                  "score": 1,
                  "created_utc": "2026-01-21 23:11:43",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0thm8v",
          "author": "vcuriouskitty",
          "text": "I hardly follow those formats and I create my own template.\nFor example, today’s retro I used these:\n\n1. Rate the last sprint\n2. Chef’s kiss (what went well)\n3. Oof moments (what went wrong)\n4. Superstars last sprint (kudos/shoutout)\n5. Action items\n\nIt changes every sprint. I was a part of their team as a QA before so I know they don’t like the classic template of sprint retro and they feel more comfortable speaking up when the theme is creative.",
          "score": 1,
          "created_utc": "2026-01-21 07:44:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0u7kcg",
              "author": "Sky_Linx",
              "text": "One downside of changing formats every sprint - you lose the ability to compare retros over time and spot recurring themes. Also adds friction for quieter folks who have to re-learn the format each time instead of just knowing where their thoughts go.\n\nConsistency has its own value, especially if your retro tool has analytics features. Being able to track recurring topics, sentiment trends, and patterns across sprints gives you a much better picture of team health than any single retro can. Hard to do that when you're switching formats constantly - you end up with apples-to-oranges data.\n\nThe best format is probably one that becomes invisible so people focus on the content, not the structure.",
              "score": 0,
              "created_utc": "2026-01-21 11:42:02",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0uhlfk",
                  "author": "vcuriouskitty",
                  "text": "Well, what matters the most is it works for us. The theme changes, but the point of the sprint retrospective remains. Everyone is on the same page, and we’re still able to address the actions items. Our team members are vocal too so 🤷🏽‍♀️ it has always been like this even before I was the SM. If it works, then I ain’t gonna break it. We don’t see any downside.\n\nAt the end of the day, you gotta find what template or format that will make your team feel comfortable to express their opinion and at the same time without compromising the purpose of the retro. It just so happens my team likes creativity.",
                  "score": 1,
                  "created_utc": "2026-01-21 12:52:41",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0vozij",
          "author": "deadmuthafuckinpan",
          "text": "The most useful tool I've found is what I call a Feelings Map because I don't know what it's really called. Basically you plot out the timeline of the project on the x axis with a few key milestones or events identified, then you ask everyone to draw a line indicating how they felt along the way with the y axis going from Fantastic at the top to Scared/Awful/Gonna Lose My Job at the bottom. \n\nThen you, the facilitator, looks for insights or key overlapping sentiments and uses those as discussion points for the group, recording those insights, actions, or learnings along the way. \n\nThis works great at a whiteboard. I've never seen this implemented digitally. ",
          "score": 1,
          "created_utc": "2026-01-21 16:31:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0y4c86",
              "author": "easy-agile",
              "text": "Thank you for sharing. I have never heard of it called Feelings Map but the concept makes sense. Emotional trajectory over time surfaces patterns that point-in-time formats miss.\n\nHave you found this works better for longer retrospectives (end of project/quarter) vs sprint retros? Seems like it needs more time to map and discuss than a standard 2-week sprint retro would allow",
              "score": 1,
              "created_utc": "2026-01-21 23:10:37",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0y5c8a",
                  "author": "deadmuthafuckinpan",
                  "text": "For sure, it's not useful for a sprint retro. But for an end-project retro, or if you're coming in mid-project to turn things around, it can be super valuable. ",
                  "score": 2,
                  "created_utc": "2026-01-21 23:15:55",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0wgvob",
          "author": "Sporknight",
          "text": "When you've been doing retros with the same team every two weeks for two+ years, it can be good to mix up formats!  Keeps things fresh for the team.  \n\nHaving said that, I'll sometimes do a picture/gif retrospective - either offer \\~4 different pictures, and ask people which one represents the past sprint for them the most, or ask folks to find and share a picture or gif of how they felt.  For the former approach, it's interesting to see what different elements people pick out that resonate with them.  For the latter, it can be a little silly and a fun icebreaker, but may not get the deepest, most meaningful results.  However, it can give folks a chance to vent a bit and get some things off their chest (hopefully with a laugh!), paving the way to a more robust conversation where you dig out action items and process improvements.",
          "score": 1,
          "created_utc": "2026-01-21 18:35:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0y4k3n",
              "author": "easy-agile",
              "text": "The gif/picture approach is great for breaking up monotony. Sometimes teams just need permission to be silly for a few minutes before they can get real.\n\nCurious though when you do the picture selection approach, do you intentionally pick images that surface different aspects (technical, team dynamics, external factors)? Or just choose randomly and see what resonates?",
              "score": 1,
              "created_utc": "2026-01-21 23:11:46",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0y7x4c",
                  "author": "Sporknight",
                  "text": "I tend to pick based on a theme, like springtime, travel, or sports, and then have different pictures based on a vibe, like stressed/chaotic, busy but productive, or sunshine and rainbows.  Folks will often pick out something unexpected from a picture that resonated with them, which makes it interesting.",
                  "score": 2,
                  "created_utc": "2026-01-21 23:29:44",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0zyr9a",
          "author": "gemneye73",
          "text": "I usually run a retro by using a Lean Coffee. Theme being focused on what worked well, what didn’t, etc. \nAnd then while discussing, we can do a little bit of the 5 whys. Works pretty well and teams love it because we managed to talk through a few items and get to a decent root cause.",
          "score": 1,
          "created_utc": "2026-01-22 05:42:23",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qdghj6",
      "title": "My first sprint in 2026",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1qdghj6/my_first_sprint_in_2026/",
      "author": "yukittyred",
      "created_utc": "2026-01-15 10:53:56",
      "score": 2,
      "num_comments": 14,
      "upvote_ratio": 0.63,
      "text": "Over the past two weeks, I’ve been reflecting on why our Scrum process feels broken, and I want to share our current situation to get an outside perspective. Officially, we use Agile Scrum, and on paper the process looks reasonable. User stories appear to be sprint-sized, and we still run sprint planning and other ceremonies. However, the way management interprets and enforces the process fundamentally contradicts how Scrum is supposed to work.\n\nOne major issue is how user stories are treated during delivery. Management does not accept that a user story should be completed collectively by the whole Scrum team within a sprint. Instead, stories are evaluated and approved based on individual man-days. Effort is calculated per person, not as a team commitment. This turns user stories into time-accounting units rather than sprint-level goals, and it removes the idea of shared ownership and collaboration.\n\nAt a higher level, epics are still considered the entire project, while milestones are treated as phase-based breakdowns, similar to waterfall. Each milestone contains only a few user stories, but those stories bundle many features and dependencies. Although these stories look like sprint-sized items, they actually represent a large amount of work spread across multiple people and a long duration, justified through man-day calculations rather than sprint capacity.\n\nSprint planning becomes mostly ceremonial. The scope and effort expectations are effectively decided upfront through man-day assumptions, leaving little room for the team to challenge feasibility or break work down meaningfully. No one really speaks up during planning, not because the issues aren’t obvious, but because the delivery model is already fixed outside the Scrum framework. Planning becomes alignment with pre-approved numbers instead of a collaborative discussion about what can realistically be delivered in one sprint.\n\nThe Product Owner role is also heavily constrained. The PO is not fully allowed to write or refine user stories independently. Acceptance criteria and Definition of Done are decided centrally (mainly by the unit head), which turns user stories into rigid contracts instead of flexible, value-driven items. This prevents proper backlog refinement and removes the PO’s ability to negotiate scope or adapt stories based on feedback and sprint learnings.\n\nOrganizationally, there is a strong control dynamic. The section head prefers to centralize decisions and processes, which limits the unit head’s autonomy and ability to support the team properly. As a result, the unit head enforces rigid and often unrealistic business processes that don’t actually help delivery. This creates a lack of trust in the team’s ability to self-organize and deliver outcomes, reinforcing the reliance on man-day calculations instead of empirical progress.\n\nOverall, the core problem is not that our user stories are obviously too big on paper, but that Scrum is being overlaid on top of a waterfall, control-driven mindset. User stories are treated as individual cost units, not as sprint-level team commitments. Leadership does not appear to trust the team to deliver collectively, and key roles are not allowed to function as intended. Because of this, the process looks Agile on the surface, but behaves very differently in practice.\n\nI’m sharing this to understand whether others have experienced similar “Agile in name only” setups, and how they’ve handled working within—or escaping—this kind of system.\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1qdghj6/my_first_sprint_in_2026/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "nzpluvw",
          "author": "ya_rk",
          "text": "It's not that your Srum process is broken, you're not doing Scrum. Sure, you're using some Scrum terminology and structures, but a guy wearing a bear costume isn't a bear. Your org is a traditional waterfall org that's wearing a Scrum costume.\n\nThere might be cultural elements at play. Broadly speaking, some types of businesses (and some cultures) have a certain way of doing things that make it harder to actually adopt agile. You might be facing a company culture or even a regional culture that favor hierarchy, centralized decision making and emphasis on risk control, making true agility practically impossible to adopt broadly.",
          "score": 9,
          "created_utc": "2026-01-15 11:29:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzpmawo",
          "author": "Fr4nku5",
          "text": "I've worked in sprints since 2003, at about 20 blue chip companies.\n\nHere is as much generalisation about Scrum as I can confidently say:\n\n\"Most places do it differently, some industries find it harder than others. The best deviations from the norm are made with full awareness of the organisational impediments necessitating the change\"",
          "score": 5,
          "created_utc": "2026-01-15 11:33:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzqfh5l",
          "author": "dnult",
          "text": "Lots going on here and some of it sounds normal - like using day-points (or man days as you call it) for estimates. That makes estimation easier and aligns well with capacity of each team member. Are you also considering risks and dependencies in your estimation process? Just be sure your point scale makes sense. A 1 and a 2 point story should be equivalent to a single 3 point story.  Similarly, a 3 and a 5 point story should be equivalent to a single 8 point story. Try having the PO establish objectives instead of defining user stories - like, \"complete development of X\" or \"Y deployment complete\". Then have the team flesh out those objectives with user stories. Use those retrospectives to fine tune the process and continuously improve.",
          "score": 2,
          "created_utc": "2026-01-15 14:34:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzpo1n9",
          "author": "DingBat99999",
          "text": "A few thoughts:\n\n* The core problem is not that you're stories are too big.\n* The core problem is that you're trying to wedge a collaborative, bottom up, empirical, feedback based process into a command and control, top down, predictive, wish based culture.\n* What was the original driver that led to using Scrum? Management can hardly have understood Scrum and still signed off on its usage.\n* To me, there feels like are a few ways you could find yourself in this situation:\n   * Scrum was a grass roots movement\n   * Significant portions of management are not communicating with each other. Someone launched Scrum without getting buy in from the rest of the management tier.\n* If you have an agile coach or champion, they either do not know their job, or they do and they've realized this is a boondoggle and are simply cashing their checks.\n* My recommendation:\n   * For the sake of the people in the teams, stop doing Scrum.\n   * Have a \"come to Jesus\" meeting. Review why Scrum is even being attempted. Are those goals reasonable and achievable?\n   * Explain the obvious conflicts between the intent of Scrum and the current environment.\n   * Either get some buy in for an actual Scrum trial or discard Scrum altogether.\n   * If you don't have a champion for Scrum that can talk to management, get one.\n\nScrum is probably the most demanding agile method, when it comes to up front organizational change. Management likely made the assumption that the change was for the line workers, not for them. If management has no intention of changing, then Scrum is doomed and you're just wasting time, money, and sanity.",
          "score": 1,
          "created_utc": "2026-01-15 11:47:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzpo1w1",
          "author": "psgrue",
          "text": "“Agile doesn’t work” claims every organization that says they’re doing Agile but aren’t. We had a fundamental contract problem. A lot of government contracts were created with annual deliverable goals. The offshore developer contracts billed by the hour. The structure in between was supposed to be Scaled Agile. \n\nThose were three completely different measurement units of input, throughput, and output. I had to accept that 1 point = 8 hours and break the agile terminology. I had to encourage PO/PM package development stories into MVP bundles of discrete functionality.  I had to treat a bloated release train like a solution train of four release trains in dashboard and reporting. I moved value determination to the PM issue creation instead of the PI planning then replaced the Inspect and Adapt ceremony with RCA topics pulled from Retrospectives.\n\nNone of it was scaled agile by definition but it worked really well.\n\nAgile is a framework. Breaking it where it needed to be broken and adapting it where it needed to be adapted made it work.",
          "score": 1,
          "created_utc": "2026-01-15 11:47:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzq8y1o",
              "author": "Kenny_Lush",
              "text": "Which is why there needs to be a new name for one of them. The ‘agile’ OP describes strikes me as the norm: STAND UP to micromanage today, SPRINT to micromanage two weeks, and Jira to micromanage the rest. That is literally what ‘agile’ is seemingly everywhere.",
              "score": 1,
              "created_utc": "2026-01-15 14:00:23",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzqd4me",
          "author": "WaylundLG",
          "text": "Can confirm - Agile in name only definitely happens a lot of places, but this is by far the purest form of just sticking agile words onto an unrelated process I've ever seen. Furthermore, even from a waterfall standpoint this is terrible project management. We used to do an exercise in classes called Designed to Fail where we asked students to design a process that would fail no matter what you did. This looks like it came out of that exercise. Sorry you are dealing with it.",
          "score": 1,
          "created_utc": "2026-01-15 14:22:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzr1pa9",
          "author": "Laicbeias",
          "text": "If its not working you arent doing it right. ",
          "score": 1,
          "created_utc": "2026-01-15 16:18:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nztyrqw",
          "author": "jbroshin",
          "text": "Your core problem is the leadership and it's top-down control culture. There is no escape from poor leadership - either the company fails or you leave.\n\nTL;DR - get out now!",
          "score": 1,
          "created_utc": "2026-01-16 00:35:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzz62j9",
          "author": "recycledcoder",
          "text": "A very quick heuristic: if \"Agile Scrum\" is mentioned, the rest of a post has absolutely nothing to do with agility. For context: no such thing exists.\n\n* There is agility, yes (lower case important, not \"Agile\". Ever).\n* There is Scrum, yes. \n* Scrum is one of the agility-aligned frameworks out there, yes. \n\n\"Agile Scrum\", however, is not a thing.",
          "score": 1,
          "created_utc": "2026-01-16 19:27:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0geceo",
          "author": "bleudude",
          "text": "This is Scrum wrapped around cost accounting. When stories become man day contracts, the team model breaks. Scrum only works when planning is empirical and team owned. Making flow and dependencies visible at the sprint level shifts the conversation from who burned hours to what blocked delivery. In monday dev, this tends to surface hidden waterfall assumptions fast and force the discussion leadership avoids.",
          "score": 1,
          "created_utc": "2026-01-19 10:37:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0gehdg",
          "author": "bleudude",
          "text": " .",
          "score": 1,
          "created_utc": "2026-01-19 10:38:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzpm6dc",
          "author": "UKS1977",
          "text": "Are those real peoples names in the post? I recommend changing those to some better naming convention - I.e. replace \"Bob\" with \"Managing Director\"",
          "score": 1,
          "created_utc": "2026-01-15 11:32:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzpngp4",
              "author": "yukittyred",
              "text": "Ops I go change",
              "score": 2,
              "created_utc": "2026-01-15 11:42:50",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    }
  ]
}