{
  "metadata": {
    "last_updated": "2026-01-31 16:49:57",
    "time_filter": "week",
    "subreddit": "agile",
    "total_items": 17,
    "total_comments": 259,
    "file_size_bytes": 297274
  },
  "items": [
    {
      "id": "1qrec84",
      "title": "Three engineers were shipping. Then management hired a Scrum Master.",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1qrec84/three_engineers_were_shipping_then_management/",
      "author": "agileliecom",
      "created_utc": "2026-01-30 18:52:06",
      "score": 92,
      "num_comments": 83,
      "upvote_ratio": 0.91,
      "text": "Early 2023s, small fintech startup. Deadline: 4 months to launch. Engineering team was literally 3 people. Me as architect, plus two devs. We had our shit together. Architecture designed, infrastructure running in the cloud, backend skeleton ready. \n\nDevs were building features. We were on track. Then month 2 hit and management started hiring. A bunch of managers showed up. Then they brought in a Scrum Master. First week this guy wants to implement full Agile ceremonies. \n\nDaily standups, sprint planning, retrospectives, backlog refinement. The whole package. His reasoning: \"You need process to scale.\" We had 8 weeks left. \n\nWe weren't trying to scale. We were trying to finish. I've seen this same pattern play out multiple times now. Small team shipping. Management gets uncomfortable with lack of visibility, they hire process people. Process people need to justify their existence, ceremonies get implemented and everything slows down. \n\nThe thing that kills me is the timing. We were working. Why fix what isn't broken when you're 8 weeks from deadline? I'm genuinely curious, why can't management just leave working teams alone? Is it actual concern about sustainability or is it just discomfort with not having control mechanisms in place? \n\nWhat's your experience with this?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1qrec84/three_engineers_were_shipping_then_management/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o2nkoeb",
          "author": "pzeeman",
          "text": "As a scrum master who had been parachuted into existing teams, I have a Hippocratic oath - first do no harm. I will take at least a sprint so just observe the team and see what isn’t working.\n\nCargo Cult Aglie is the worst. It’s demoralizing at best and an actual impediment.",
          "score": 127,
          "created_utc": "2026-01-30 19:00:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2novr9",
              "author": "MusicGirlsMom",
              "text": "Yep, I'm a great believer in bringing the process to the people. Meet them where they are, then figure out how it can help them get even better. Agile purists drive me nuts because the process should help the work, the process should not *be* the work.",
              "score": 19,
              "created_utc": "2026-01-30 19:18:57",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2nraxm",
                  "author": "pzeeman",
                  "text": "I think you’re describing the zealots of the agile industrial complex, who believe that only by wholly adopting a framework (that they are also selling for only $1000/hour) can you be agile. \n\nI would actually consider myself a purist in that I believe it all comes from the Agile Manifesto and Principles. How you get there is up to each team.",
                  "score": 9,
                  "created_utc": "2026-01-30 19:29:56",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o2oltb1",
                  "author": "funbike",
                  "text": "They aren't Agile purists.  They are enthusiastic Agile incompetents.\n\nAn actual Agile purist would apply the principles of the Agile Manifesto, which are not a process at all but principles to (mostly) improve improve communications.",
                  "score": 3,
                  "created_utc": "2026-01-30 21:53:39",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o2nnqgs",
              "author": "Traumfahrer",
              "text": "This.\n\nAlso SAFe and similar monstrosities is not agile at all.",
              "score": 29,
              "created_utc": "2026-01-30 19:13:45",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2o9d85",
                  "author": "nborders",
                  "text": "SAFe is attempting to “scale agile”. \n\nThe concept is sound, but I agree, SAFe is a scam. One can just just do the same agile principles in the larger programs and organizations (“Portfolio”). \n\nAgile teams in larger orgs did have trouble locking with existing business cycles and structures 10 years ago. From my view that has mostly been fixed…the industry matured.",
                  "score": 4,
                  "created_utc": "2026-01-30 20:54:52",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o2nnx61",
              "author": "agileliecom",
              "text": "Love the Hippocratic oath approach. \"First do no harm\" should be the default for any process change... the observation sprint idea is brilliant, gives you context before proposing changes. In your experience, what are the signs that tell you a team actually needs more structure vs they're already working well?",
              "score": 9,
              "created_utc": "2026-01-30 19:14:36",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2nqi6v",
                  "author": "pzeeman",
                  "text": "The delivery of value is the key. Everything else is in service of that.  From there, you figure out what’s keeping that from happening.  There’s way too many variables to point out what the exact approach may be. \n\nI believe strongly in minimum viable guardrails, so my first answer would never be to impose a huge structure or framework, but focused approaches to deal with the actual problems that are keeping the team from delivering.",
                  "score": 9,
                  "created_utc": "2026-01-30 19:26:16",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o2rm74e",
              "author": "tomatie",
              "text": "‘Cargo cult agile’ haven’t heard that before. It’s a keeper",
              "score": 3,
              "created_utc": "2026-01-31 10:07:20",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o2nrk93",
              "author": "Trustadz",
              "text": "I'm the same, most of the time I'm even monitoring longer then that. Though last time I couldn't keep to myself anymore after watching in silence while 6 people were \"reviewing\" a documentation. Meaning stupid semantic discussions in documentation only a handful of people would ever read. After watching it go on for 30 minutes (and the leaving scrum master 'facilitating' this fiasco) I couldn't help but intervene with the question \"What the f\\*\\*\\* are you guys trying to accomplish here?\"",
              "score": 2,
              "created_utc": "2026-01-30 19:31:07",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o2ormh9",
              "author": "RegisthEgregious",
              "text": "Exactly my thoughts as reading OP’s experience.",
              "score": 1,
              "created_utc": "2026-01-30 22:22:08",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o2r8it0",
              "author": "Feeling-Reveal7533",
              "text": "The hippocratic oath is good and best _you_ as the parachuted entity can do. Though be aware that the act of deciding to parachute a new entity,  even one just observing, into a working team _will_ have effects on team dynamics and change how the team operates. Doing this this a few months before deadline sounds like a bad call by management in my book.",
              "score": 1,
              "created_utc": "2026-01-31 07:57:20",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2nkw7t",
          "author": "slower-is-faster",
          "text": "Seems that management didn’t know or trust that it was working. They lacked visibility into progress and needed to do something to ensure certainty. This most likely comes down to poor communication on your behalf.",
          "score": 39,
          "created_utc": "2026-01-30 19:01:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2nmq77",
              "author": "Short_Ad_1984",
              "text": "Exactly this. On other hand, a good agile practitioner won’t swarm you with unnecessary meetings but keep things as simple as possible.",
              "score": 11,
              "created_utc": "2026-01-30 19:09:13",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o2pzibc",
              "author": "MirthMannor",
              "text": " Noticed that the summary above and the new SM missed the obvious solution to stakeholders not knowing what’s happening: the demo.",
              "score": 4,
              "created_utc": "2026-01-31 02:26:14",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2reldj",
                  "author": "IQueryVisiC",
                  "text": "right. I don't trust my progress on my side projects if I don't have a demo online for everyone to watch",
                  "score": 2,
                  "created_utc": "2026-01-31 08:54:17",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o2nqmvw",
              "author": "dastardly740",
              "text": "It is almost always about visibility. But, also comfort, everyone's job and/or reputation is on the line in one form or another. Management needs not just the visibility, but also, if they are any good, when things have gone bad, so they can help. The problem that creeps up in my experience are what I have taken to calling \"illusions of control\". These are things that can make management feel like they are on top of things when they really are not because they are still putting the same level of trust to those they delegate to, but gave them more work in order to create the illusions.",
              "score": 4,
              "created_utc": "2026-01-30 19:26:52",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2nrk3j",
                  "author": "agileliecom",
                  "text": "Illusions of control nails it. Management got their metrics and reports, but nothing actually changed about delivery or quality. Same trust level, just more overhead. The process was comfort food for them not a real tool for us.",
                  "score": 1,
                  "created_utc": "2026-01-30 19:31:06",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            },
            {
              "id": "o2nno8o",
              "author": "agileliecom",
              "text": "Fair point about communication. We did have visibility through our Kanban board and weekly syncs, but you're right that we could have been more proactive about reporting upward.\n\nThe challenge I've seen is that sometimes even with good visibility, management still feels uncomfortable without formal ceremony. Have you found ways to give that visibility without the full ceremony overhead?\n\nCurious what's worked for you?",
              "score": 2,
              "created_utc": "2026-01-30 19:13:28",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2nqgw8",
                  "author": "chucks138",
                  "text": "That's not the type of information leadership tends to need.  They tend to want the 1000 ft view not how many stories are in to do, as they have to answer to the board/investors regularly who also only care if it's getting done on time.\n\nAll my leadership updates are written so a 5th grader could get a general understanding, weekly leadership syncs are for them to ask questions in the areas they want deeper knowledge.  From there you can shift reporting (some ppl want more technical info)",
                  "score": 6,
                  "created_utc": "2026-01-30 19:26:07",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o2nthwm",
                  "author": "slower-is-faster",
                  "text": "What works is having a better relationship with management, that’s it. \n\nThey obviously lack maturity to apply this at your stage, but there was some gap they were setting a need to fill. \n\nWhat is done can be undone, I wouldn’t see this as set in stone. Start building a better relationship, then leverage that influence and incrementally move to a prices that works better for both.",
                  "score": 1,
                  "created_utc": "2026-01-30 19:40:01",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o2pt4xi",
              "author": "IGuessSomeLikeItHot",
              "text": "Ahhh yes they asked the guy to build it and deliver it on time and then blame him for not telling them that he's doing what he was told to do.  \nIt does come down to trust but if you don't trust the guy you hired to do the job then look at yourself first. Why not ask and build trust.",
              "score": 1,
              "created_utc": "2026-01-31 01:48:38",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2nnz5z",
          "author": "OTee_D",
          "text": "As much as I love a good agile team.\n\n\nBut for three people? When everything works?\n\n\nJust WHY?",
          "score": 8,
          "created_utc": "2026-01-30 19:14:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2nqlcs",
              "author": "agileliecom",
              "text": "Right? Thats what killed me. Management needed the structure for visibility, even though we were already shipping... three people don't need daily standups but management needs to feel in control.",
              "score": 2,
              "created_utc": "2026-01-30 19:26:40",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2p3cfs",
                  "author": "OTee_D",
                  "text": "And funny enough, agile is one of the worst methodologies if your goal is control and micromanagement.",
                  "score": 2,
                  "created_utc": "2026-01-30 23:23:16",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2nmocw",
          "author": "BElf1990",
          "text": "It's difficult to say without asking them, which is something you should probably do. Don't do it in a confrontational way, just state your concerns, if you have any metrics that can prove you slowed down, show those metrics. Basically say, this is making things worse, what were you hoping to achieve, maybe we can find a way to make that happen.\n\nEssentially, the three different scenarios I've witnessed personally when it came to transitioning to agile all had different reasons.\n\n1. Some form of organization was needed. The company operated in a chaotic way for 10 years or so and got really successful, secured investment to grow even more so their headcount increase was 100% yearly. They were also really bogged down by their previous poor decisions, and were constantly firefighting because of shit code. All the new projects were started agile but the legacy team stayed fucked, once the new revenue channels outperformed the old solutions, they sunseted that product and had a unitary way of working.\n\n2. Company got bought, owners enforced their own ways of working, ended up being pretty average experience, not great, not terrible.\n\n3. CEO got conned by a consultancy firm to hire some consultants to fix something that wasn't broken. 6 months later, they broke the contract because they had no idea how to do that and it was just a massive waste of time. There were like 10 devs total, so there was no need for it, we were shipping everything on time, the product was decent.",
          "score": 4,
          "created_utc": "2026-01-30 19:08:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2np4v3",
              "author": "agileliecom",
              "text": "This is really valuable perspective, thanks for breaking it down... You're right that I could have approached it differently. The direct conversation happened, but in hindsight I focused too much on \"can we wait\" rather than \"what are you trying to achieve and how can we get there without the overhead.\"\n\nYour scenario #3 hits close to home. That's essentially what this felt like - consultancy-driven change rather than solving an actual problem. We were shipping, had clear visibility, no firefighting.\n\nThe thing that makes it tricky: when you're the one questioning the change, it's easy to get labeled as \"resistant\" rather than \"concerned about timing.\" Framing it as \"let's find a way to achieve your goals\" is much smarter than \"let's not do this now.\"\n\nOn your scenario #3 - how did you guys eventually get out of it? Did leadership recognize it wasn't working, or did the consultants just run out their contract and leave?\n\nAnd on the metrics point: we didn't have formal velocity tracking (ironically, because we weren't doing sprints yet), so proving slowdown would have been anecdotal. Wish I'd had that data.",
              "score": 2,
              "created_utc": "2026-01-30 19:20:05",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2ntbcb",
                  "author": "BElf1990",
                  "text": "How did we recognize it wasn't working? There were two teams that were small enough where it was easy to gauge the rate we were going at without measurements. Obviously the consultants came in and started enforcing a bunch of redundant nonsense and the story point system they implemented rather than be used for planning was being used for measuring performance, some people caught on, started overestimating, there was some poker planning where it was hard to land on an estimation because some people wanted to juke the numbers and some didn't. However, those measurements ended up doing them in, about 2 months in, our very clever team lead at the time told the scrum master that we should retroactively add value to completed work so we can have a better sample set for our estimations, they were super hyped for it, so we wasted a bunch of time doing that, and then he used those numbers to calculate our velocity pre-consultancy which was higher than after they joined. Took the numbers to the CEO, the reception was mixed, no action was taken immediately but he didn't dismiss it out of hand, basically ended up saying we'll keep an eye on it. A few months later, the numbers didn't get better and because they had already kind of established velocity as a measurement of performance, that was used as a metric to justify them doing bad work. We moved to some sort of compromise where we did measure some things, kept ceremonies to a minimum, estimations weren't done by commitee but by the leads alone, and there was an understanding that they are used for planning purposes and nothing else. I left maybe 4 months afterwards so I didn't end up seeing how it continued afterwards.\n\nThe key part here is to not wait until shit hits the fan, do your due dilligence, let your line manager know as early as possible, if you can have some way to quantify it, non-technical people love that shit, because they usually have a monetary value associated with the work you are trying to complete so they can translate that to potential losses. After that, if they dig in, wait for shit to hit the fan, that's probably the last opportunity for them to be convinced it's a bad idea. If nothing changes, jump ship, it's not the kind of management you want to work for.",
                  "score": 1,
                  "created_utc": "2026-01-30 19:39:10",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2nv6qq",
          "author": "PhaseMatch",
          "text": "**TLDR; You had lost managements confidence and trust. So they imposed a project manger on you, and dressed it up as \"agile\".  Start finding leadership worth following**, **and get good at managing up.**\n\n**It wasn't agile, or lean.  You got zombie-Scrum - \"ceremonies\" is a dead giveaway.**  \n*=>You had some artificially imposed \"deadline\" based on management ego, not customer need*  \n*=> Your management was scared of the loss of status, lack of certainty and removed your autonomy(\\*)*\n\n**If you had started out in an lean/agile way then your approach would have been different.**  \n*=> The point where you were at was too late to change things;  it was dumb to try*\n\n**You weren't looking to control investment risk and pivot to a new market**  \n*=> that's Scrum's sweet spot;  your management had decided all of that already.*  \n*=> adding Scrum was a waste of time*\n\n**You weren't looking to continuously deliver to test the product-market fit with customers**  \n=> *that's XP's sweet spot;  your management had decided that already*  \n*=> your architecture based delivery was the best option given that mode*\n\n**You might have benefited from greater visibility of WIP and bottlenecks**  \n=> *Kanban does expose bottlenecks, facilitate forecasts and increases visibility*  \n*=> that might have helped;  first rule is \"start where you are, don't change things\" (\\*\\*)*  \n*=> facepalm*\n\n**If this is a repeating pattern you keep seeing, what can you do about it?**\n\n\\- find leadership worth following, for a start  \n\\- make work visible, so management isn't afraid all the time (\\*\\*)  \n\\- get good at \"managing up\";  it's a key skill (\\*)  \n\\- step out of the hero-villain-victim drama loop, start leading(\\*\\*\\*)\n\n**So what do high performance organizations look like?**\n\n\\- the teams job is to raise the bar, and continuously improve  \n\\- when they run into systemic issues, they escalate to management  \n\\- managements job is to address the systemic issues, so teams can deliver  \n\\- you do this in a collaborative, mutually supporting culture  \n  \n**\\* SCARF: A Brain-Based Model for Collaborating with and Influencing Others**  \n\\*\\* **Essential Kanban Condensed**  \n**\\*\\* Understanding the Drama Triangle vs. Presence (<4' video)**",
          "score": 4,
          "created_utc": "2026-01-30 19:47:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2nymy5",
              "author": "forestcall",
              "text": "I hate this but I think you’re correct.",
              "score": 1,
              "created_utc": "2026-01-30 20:03:46",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2o0cuf",
                  "author": "PhaseMatch",
                  "text": "***\"Heroic developers became victims of dastardly management, and we were powerless to stop it\"*** is a common theme, but to me it just emphasizes why technical skills alone are not enough in high performing teams.\n\nThere's a lot of comfort in always being able to blame others for failure, but as soon as you get into \"the team VS management\" then you are into power-and-status games.    \n  \nOr just repeat the same pattern.",
                  "score": 1,
                  "created_utc": "2026-01-30 20:11:54",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2nyx2t",
          "author": "forestcall",
          "text": "How recent was this? Are you guys using Opus 4.5 in your workflow?",
          "score": 2,
          "created_utc": "2026-01-30 20:05:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2siqg6",
              "author": "agileliecom",
              "text": "Early 2023s",
              "score": 1,
              "created_utc": "2026-01-31 14:16:00",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2o0om3",
          "author": "pauloliver8620",
          "text": "From my standpoint the management had an issue the work you were doing was not visible. If work is not visible and predictable they cannot make promises to the customer.\nThe scrum master should first assess the situation not come in and implement processes and ceremonies for the sake of it, as a scrum master I always do 1-1 with the team members to assess why I was brought in :), then if necessity asks for it come with problems forward to the team and let them come up with the solution’s. \nSo take your scrum master aside and tell him his role is not to implement ceremonies is to make work visible to management and help the team discover solution’s to real impediments.",
          "score": 2,
          "created_utc": "2026-01-30 20:13:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2o764i",
          "author": "InspirationalAtt",
          "text": "Scrum is the only thing non technical people understand. They can't seem to grasp anything else we do. Yet for 20 years now, and this is well documented, scrum alone fails miserably. To succeed there are incredibly important aspects to a software engineer that ensures the software is built well. \n\nThese days I distance myself from anything Agile related, as it's become a word most don't really comprehend.",
          "score": 2,
          "created_utc": "2026-01-30 20:44:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ohwh7",
          "author": "EngineerFeverDreams",
          "text": "They're parasites",
          "score": 2,
          "created_utc": "2026-01-30 21:35:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2p1273",
          "author": "skeezeeE",
          "text": "You could not effectively communicate HOW you would make the timeline.  They did  not trust whatever answers you gave them - and inflicted a scrum master on you as punishment to get the answer and feel comfortable.  Not the right answer for sure- but the reality nonetheless.",
          "score": 2,
          "created_utc": "2026-01-30 23:10:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2p7eqw",
          "author": "Prestigious-Disk3158",
          "text": "You say you’re working but if management doesn’t have visibility, they’re just supposed to trust you?",
          "score": 2,
          "created_utc": "2026-01-30 23:45:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2shrs9",
              "author": "agileliecom",
              "text": "Yeah we had Kanban board up, weekly updates... Not perfect but existed, could I have communicated better? Sure. But when the answer is add 90 hours of meetings over 8 weeks that's not fixing communication. That's just implementing Agile because that's what you know. If CTO needed better visibility there's a hundred ways to do that. Better dashboard, clearer milestones. It Takes 15 minutes. Full ceremony wasn't solving the visibility problem. It was solving the I don't know what else to do problem.",
              "score": 0,
              "created_utc": "2026-01-31 14:10:25",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2st0m5",
                  "author": "Prestigious-Disk3158",
                  "text": "Communication doesn’t mean weekly updates or a kanban board. If you don’t want a scrum master then you have to get leadership to feel comfortable in your ability to deploy. You need to be able to talk their language. Ultimately, leadership is responsible for your output so if you don’t do a good job of giving them inputs, they will find another method, hence the Scrum Master. Scrum is a way for leadership to understand the development process in chunks so that they can make strategic decisions when needed. \n\nThe “trust me bro” approach has been tried time and time again by small development teams and it has failed more times than it has succeeded. \n\nIf you’re already feeling the pressure to deploy in 8 weeks, likely the release date is too aggressive. A good SM could and should relay that to leadership, find a way for a compromise to give the development team more bandwidth. When you rush, things break. And while the sentiment of rapid release is common and likely practiced at my small organizations, taking a tactical pause and making the tough decision to delay a release is likely the better move. \n\nAs you scale, yes you will have increased overhead. That is the cost of doing business. If you don’t want leadership poking around into what you’re doing and adding unnecessary headcount, learn their language and garner trust.",
                  "score": 1,
                  "created_utc": "2026-01-31 15:12:31",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2p91k1",
          "author": "Southern_Orange3744",
          "text": "So based on your own words you couldn't communicate effectively , provide transparency , or visibility into things to give people confidence \n\nSounds like if you fix some of this they'll stop piling managers on you",
          "score": 2,
          "created_utc": "2026-01-30 23:54:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2pcs8k",
          "author": "Emorin30",
          "text": "You just hired a bad Scrum Master is all. It's shocking how many people in management-ey roles have a single playbook and zero ability to read the situation. I actually see this often with execs including CTOs. If the plays they ran at the last company don't work they just fail spectacularly and blame everyone else.",
          "score": 2,
          "created_utc": "2026-01-31 00:15:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2qa1dp",
          "author": "vr4lyf",
          "text": "Progress for the sake of Progress should be highly discouraged",
          "score": 2,
          "created_utc": "2026-01-31 03:30:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2qfds9",
          "author": "Gudakesa",
          "text": "What you’re describing is basically Extreme Programming, even if nobody ever called it that.\n\nThree people, tight deadline, everyone talking constantly, architecture changing as you learned more, code going out as soon as it worked. That is exactly what XP looks like in real life. Short feedback loops, almost no ceremony, lots of trust, and the assumption that most early decisions will be wrong and need fixing fast.\n\nThat phase is not about scaling.\nIt is about learning.\n\nXP exists for the moment when requirements are fuzzy, designs are still forming, and speed of feedback matters more than predictability.\n\nYou do not need sprints when your iteration cycle is hours.\nYou do not need backlog refinement when priorities change midweek.\nYou do not need formal standups when everyone already knows what everyone else is doing.\n\nFrom inside the team it feels efficient.\nFrom the outside it looks scary.\n\nThen management shows up and sees no charts, no velocity, no visible control points. Someone says we need process to scale.\n\nExcept you were not scaling.\nYou were trying to finish a prototype with a deadline.\n\nDropping full Scrum ceremonies into that situation does not make the team faster. It stretches the feedback loop. Work that used to flow continuously now waits for planning. Decisions that used to happen in minutes get parked until the next meeting. Momentum slowly turns into overhead.\n\nThe ironic part is that XP is not a lack of process. It is just optimized for discovery instead of reporting.\n\nScrum is great once you know what you are building and need predictability, coordination, and long term planning. XP is better when you are still figuring out what the product even is.\n\nTrying to apply delivery scale process to a discovery stage team does not create maturity. It just replaces progress with meetings.\n\nI have seen this transition work well when it happens later. Prototype fast using XP. Validate the product. Lock in the architecture. Then introduce Scrum once the work shifts from learning to delivery.\n\nBut doing it eight weeks before launch is not scaling.\nIt is hitting the brakes because leadership wants visibility.\n\nSometimes the best thing management can do is recognize that the team is already using the right process and let them keep shipping.",
          "score": 2,
          "created_utc": "2026-01-31 04:04:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2qwnt3",
          "author": "Ezl",
          "text": "I’m a process person.  Process people who do it like that (and it’s many) don’t do it right.  I agree process supports scalability but I’m a fan of processes serving people, not vice versa.  I’m also an advocate for the least possible process implemented in a way that adds value not overhead.\n\nHad I been hired in that person position the first thing I would have asked would have been “what can I do to help you all?”.   \n\nI would have used that as an opportunity to learn how the team currently functions, keep an eye out for and friction, gaps, etc. that then could inform improvement later. I would be thinking about process changes based on your existing teams, habits and needs; I never show up thinking I have a solution. And I certainly wouldn’t introduce and change or disruption while you’re trying to deliver to a deadline.\n\nAnd scrum isn’t a silver bullet. Scrum is a fine model but that doesn’t meant it’s automatically right for your team/every org.",
          "score": 2,
          "created_utc": "2026-01-31 06:11:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2r6ezx",
          "author": "foresterLV",
          "text": "8 weeks to deadline seems to be very long iterations for a team of 2-3. it sounds like by some reasons you have set maybe unreasonable estimations (too safe/pessimistic?) and management instead of trying to micromanage your deliviries decided to try to shift the team into more of incremental development approach. I would push into same direction frankly, but how its done (incrementally or all ar once) is a discussion and depends on broader context.",
          "score": 2,
          "created_utc": "2026-01-31 07:37:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2rmujh",
          "author": "jbigspin421",
          "text": "Its your organization, not the scrum master. He should have started u in kanban to let u finish, then pivot to scrum if needed. Hell your team sounds like a dream dev team high level.",
          "score": 2,
          "created_utc": "2026-01-31 10:13:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2rw129",
          "author": "astroblaccc",
          "text": "Yeah, that sucks. How big was the management team? I gotta assume it was the founders? What was the customer feedback from demos? How did the UX testing go?\n\nJust trying to understand what motivated a small start up to increase burn on run.",
          "score": 2,
          "created_utc": "2026-01-31 11:38:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2sh32y",
              "author": "agileliecom",
              "text": "Management got to 6-7 people fast. Mix of founders and people they brought from bigger banks. Customer feedback was good actually. The underbanked market needed this. Product made sense. UX testing wasn't happening yet. We were still building the backend and infra that was gonna come later.\n\nWhy the burn increase? Pretty sure investors wanted to see \"proper company structure\" before next round. You know how it is, raise money, suddenly need to look legit with processes and shit... We had 8 weeks, should've just finished first, scaled after",
              "score": 1,
              "created_utc": "2026-01-31 14:06:22",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2nm842",
          "author": "CodeToManagement",
          "text": "And today in things that never happened……\n\nAlways the same cadence in these AI rage bait posts.",
          "score": 2,
          "created_utc": "2026-01-30 19:06:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2npob2",
              "author": "agileliecom",
              "text": "Fair. I probably polished it too much trying to make it clear... It was a fintech startup, actually happened. But yeah, I get the skepticism, tons of fake stories on Reddit. What reads most AI to you?\n\nAnyway, can't give too many specifics (NDAs and all that), but fair if you don't believe it. Story's real to me, that's what matters.",
              "score": 2,
              "created_utc": "2026-01-30 19:22:30",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2nqprx",
                  "author": "CodeToManagement",
                  "text": "There’s a few things about the cadence and feel of the story. \n\nBut also this is a huge AI signal to me “We had our shit together. Architecture designed, infrastructure running in the cloud, backend skeleton ready.”\n\nIt always does this, 3 comma separated bullet points to emphasise the point.  You see it loads in AITAH posts too.  When I see that plus the rest of the story it’s AI",
                  "score": 1,
                  "created_utc": "2026-01-30 19:27:14",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2o1896",
          "author": "davearneson",
          "text": "These are things a good scrum master or agile coach would ask.\n\nAre you being blocked by anything? if so how important is it and what can we do to remove that blocker?\n\nHow long is it taking from when you decide to build a feature until you deploy it? \n\nHow long are the business people spending thinking about a feature before you get it?\n\nHow long is it taking from when you decided to build a feature until customers and users gave you feedback on it?\n\nHow do we know we are building what the founders, customers and users want?\n\nIs anyone meeting with customers and users multiple times a week to understand what they need (not to sell to them but to determine their requirements). \n\nIs anyone prioritsing the customer requirements to decide which are worth building in this release?",
          "score": 1,
          "created_utc": "2026-01-30 20:16:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2oikky",
          "author": "olddev-jobhunt",
          "text": "Yup, this is f'ing stupid.\n\nAgile came as a response to excessive processes. The point of retros is to look back and see if the practices you've added have helped or hindered, and *then to change them*. There is a time and a place for this level of process - but it should always come as a response to real, actual, observable problems.\n\n> A bunch of managers showed up.\n\nThis... just... this. _Why?_ Somewhat flippantly, _why?!_\n\nBut seriously: Why?! The why matters a lot here. Why does a team of three engineers need multiple managers? The answer is probably something like \"to prepare to lead engineering or business development in a different vertical / market segment / whatever.\" So maybe they're looking for a defined way to talk to the implementation team.\n\nAnd that can be valuable and an important part of scaling a startup. But still - it needs to match the scale of the rest of the efforts. Rather than this process, the answer might well be something like \"and hire _one_ product person to work with those managers on scope and priorities, and have the team work only with that new person.\"",
          "score": 1,
          "created_utc": "2026-01-30 21:38:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ojl13",
          "author": "Bowmolo",
          "text": "Mgmt. should have spent 50% more for someone who actually first observes for a couple of weeks before doing any intervention.\n\nMost likely they hired a cheap junior. Their fault. You suffer.",
          "score": 1,
          "created_utc": "2026-01-30 21:43:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2si27l",
              "author": "agileliecom",
              "text": "Yeah that would've made all the difference. SM that shows up and observes for a sprint or two before changing anything? Gold.  This guy had a playbook and wanted to implement it day one. No context, no observation, just this is how we do Agile... Don't even think he was cheap or junior. Pretty sure he was experienced. That was the problem, he knew The Right Way and wasn't interested in our specific situation.",
              "score": 1,
              "created_utc": "2026-01-31 14:12:06",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2t54ab",
                  "author": "Bowmolo",
                  "text": "The truly experienced ones typically don't have playbook. They don't need it. \n\nThey even decide their proposal for the framework/methodology to use after observing the team and their nature of work.\n\nAnd I really mean 'proposal'. I've never seen a team not following mine, because I can justify (or even defend) my proposal based on my observations.\nYet it's ultimately their decision. The only thing I enforce is that a decision is made in reasonable time.\n\nBut well, just my way of doing things.",
                  "score": 1,
                  "created_utc": "2026-01-31 16:11:55",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2om8h3",
          "author": "Spiritual_Quiet_8327",
          "text": "Yeah, they should have waited the 8 weeks until you delivered the product.  But then, it would not have been a bad thing to implement process if they thought they would be quickly enlarging the team soon after.",
          "score": 1,
          "created_utc": "2026-01-30 21:55:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2pxe9z",
          "author": "Professional-Ad6844",
          "text": "In order to bring predictability into development a process is needed else things can spiral pretty fast especially when bugs start coming in. Often in the early stages process looks like an overhead until it’s not when you start appreciating the predictability it has brought into delivery and quality",
          "score": 1,
          "created_utc": "2026-01-31 02:13:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2swcdw",
          "author": "Expert-Reaction-7472",
          "text": "what a weird advertisement for your book. \n\nyou seem kinda bitter. \n\nIf things were working, they wouldnt have hired someone to fix it.",
          "score": 1,
          "created_utc": "2026-01-31 15:29:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2syaw7",
          "author": "Additional_War3230",
          "text": "The more I work in « agile » environments, the less I understand how someone moving the philosophy could want to become scrum master… That’s the biggest red flags of all to me.",
          "score": 1,
          "created_utc": "2026-01-31 15:39:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2t4k7n",
          "author": "No-Age-1044",
          "text": "Agile is, in my experience, the best way to destroy a team.",
          "score": 1,
          "created_utc": "2026-01-31 16:09:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2nkilz",
          "author": "Emotional_Atyachar07",
          "text": "Agile is sh*t. Its another way of wasting time. All the ceremonies are totally Useless.",
          "score": -5,
          "created_utc": "2026-01-30 18:59:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2nniq8",
              "author": "Traumfahrer",
              "text": "Agile != ceremonies",
              "score": 6,
              "created_utc": "2026-01-30 19:12:47",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o2nm0zx",
              "author": "notandxorry",
              "text": "And what should be used instead? waterfall?",
              "score": 3,
              "created_utc": "2026-01-30 19:06:03",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2nofyi",
                  "author": "agileliecom",
                  "text": "Not waterfall, what I've seen work for small teams with tight deadlines:\n\n\\- Lightweight Kanban (visible work, simple flow)  \n\\- Async updates when there's something worth sharing  \n\\- Weekly optional sync (30 min, only if useful)  \n\\- Strong documentation culture  \n\\- Direct communication when blocked\n\nBasically, enough structure to coordinate, not so much that it becomes overhead... the key is matching process to context. 3 engineers with 8 weeks ≠ 30 engineers on ongoing product.",
                  "score": 1,
                  "created_utc": "2026-01-30 19:16:58",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            },
            {
              "id": "o2no540",
              "author": "agileliecom",
              "text": "I wouldn't say all ceremonies are useless just badly timed or cargo-culted ones, retrospectives can be valuable if action items actually get implemented. Standups work for some teams, the issue is when they're imposed without regard to context...",
              "score": 2,
              "created_utc": "2026-01-30 19:15:36",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o2nm2sp",
              "author": "Competitive_Smoke948",
              "text": "FRAGILE....NOT Agile and DevOOPS not Devops",
              "score": 1,
              "created_utc": "2026-01-30 19:06:17",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qnz9ty",
      "title": "Sprint planning feels like theatre",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1qnz9ty/sprint_planning_feels_like_theatre/",
      "author": "easy-agile",
      "created_utc": "2026-01-27 01:09:01",
      "score": 70,
      "num_comments": 82,
      "upvote_ratio": 0.93,
      "text": "We spend 2 hours planning. Story points agreed. Dependencies mapped.\n\nThree days in, a \"quick question from sales\" becomes a 3-day spike. By Friday, half our planned work rolls over and we've pulled in random stuff that wasn't even in the backlog.\n\nNext sprint? Same 2-hour ceremony like it actually matters.\n\nAt what point is this just planning theatre? Or do some teams actually make the plan stick?\n\n*(Work at a Jira app company, see this constantly - but feels more like a process issue than a tool issue)*",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1qnz9ty/sprint_planning_feels_like_theatre/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o1xvciv",
          "author": "Brickdaddy74",
          "text": "Sounds like you have a bad PO that doesn’t protect the team.\n\nAlso, if your sprint planning takes longer than 30 minutes your team has other problems. I generally have 15-20 minute sprint plannings for a team of 5-6 devs. Seems there are problems in defining your tickets, features, or the discussions that happen at refinement",
          "score": 29,
          "created_utc": "2026-01-27 02:09:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1ye05p",
              "author": "mhyquel",
              "text": "I just got out of a course where the instructor told us that sprint planning can be up to 8 hours for a 4 week sprint. \n\nThat's 4 hours for a 2 week sprint. \n\nIt boggled my mind.  We have a refined backlog of tickets prioritized and story pointed.  We know our velocity, and how many days away this sprint.\n\nSo we take the top 35 story points from the backlog, put them in a new Sprint and go. \n\nIt's like 15 minutes.",
              "score": 13,
              "created_utc": "2026-01-27 03:54:52",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1yg54e",
                  "author": "Brickdaddy74",
                  "text": "Yeah that instructor is probably one of those people who he himself went through a course and became an instructor with no real world experience or never worked on a functional team.\n\nIf sprint planning takes that long for any team, here are a few guesses of mine:\n-you are estimating at sprint planning instead of refinement\n-your PO sucks at getting worked described properly and the tickets are confusing\n-you didnt actually have the designs, or something close to final designs at refinement\n-you don’t have your teams aligned around products but by skills, and this will kill your whole org\n-your devs are potheads who can’t remember what video game they played last night much less what you talked about at refinement\n\nThere may be other sources of the distinction too 😂. Hit me with an upvote if your devs are potheads",
                  "score": 10,
                  "created_utc": "2026-01-27 04:08:01",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1zelrz",
                  "author": "Kaivosukeltaja",
                  "text": ">So we take the top 35 story points from the backlog, put them in a new Sprint and go. \n\nThis approach works great if your goal as a team is just to crunch out stories as much as possible. But what happens if you get customer feedback that completely opposes your plan, such as a crucial functionality that is missing from what you just delivered?\n\nThe idea with sprints is to introduce checkpoints where we get feedback and react to it by changing our plans accordingly. If you're not getting actual customer feedback or using it as evidence to update your plans, you're kind of missing the point of it.",
                  "score": 6,
                  "created_utc": "2026-01-27 08:34:35",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1yyeis",
                  "author": "kneeonball",
                  "text": "Up to is the key word there, and it depends on the complexity of the product and work involved, figuring out how to split it up, etc.\n\nIt’s mainly there to signal if you’re going over this, you’re doing something majorly wrong. \n\nFor many teams, they’ll never take this long. But to 4 hours to plan somewhere between 240 and 800ish hours of time spent for the team (80 hours x 3 - 10 team members) isn’t even that unreasonable when you think about it. \n\nIt won’t come out to exactly that but using rough numbers to illustrate the point. If you have a complex environment it could be reasonable. Depends on how much you want to plan out up front in the sprint vs plan as you go along.",
                  "score": 4,
                  "created_utc": "2026-01-27 06:14:55",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o235tn8",
                  "author": "Z-Z-Z-Z-2",
                  "text": "Looks like someone doesn’t understand what time boxing is and that Scrum doesn’t prescribe what you do for a 2-week sprint over a month-long sprint. It is just said for shorter sprints the events are usually shorter. Seems like sensible guidance to me.",
                  "score": 1,
                  "created_utc": "2026-01-27 20:50:32",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o1yrozg",
              "author": "evergreen-spacecat",
              "text": "The bad part of the PO is not even protecting the team but rather they should be aware of input from important stakeholders ahead of time. If customer requirements are this volatile, which they can be if sales is trying to land a very big client, then PO should be aware and on daily calls with the sales team to plan ahead.",
              "score": 5,
              "created_utc": "2026-01-27 05:24:21",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o1zbcuy",
              "author": "Pretty-Substance",
              "text": "It depends if the PO is actually invested with the power to say no. In most companies I’ve worked at this wasn’t the case",
              "score": 3,
              "created_utc": "2026-01-27 08:04:36",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o20exea",
                  "author": "Brickdaddy74",
                  "text": "I take a different approach…if it’s the right thing to do then I do it. I trust people will see the motivations and I will explain it to them, trust and respect grows, and empowerment is a mutual agreement.\n\nIf you let people walk all over you they will never trust or respect you.",
                  "score": 1,
                  "created_utc": "2026-01-27 13:22:51",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o247rpm",
                  "author": "Interesting-Ad5589",
                  "text": "Absolutely right. It's all about the sales staff having too much power",
                  "score": 1,
                  "created_utc": "2026-01-27 23:49:34",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o213s2q",
              "author": "Pandas1104",
              "text": "Sounds like they are doing refinement and sprint planning at the same time. \n\nWould agree with a bad PO, whatever outside teams want should have a process for getting to the team and not interfere with the current planning",
              "score": 2,
              "created_utc": "2026-01-27 15:27:17",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1xnjfa",
          "author": "HRH_QueenAnneChonk",
          "text": "What’s the retro like?  That’s the most critical component imho.\n\nIf I were on the team, I’d say - this unplanned ‘churn’ from Steve is a seems to be a new pattern, so let’s plan for it - and clearly document which other stories in the backlog would be pulled in if Steve leaves us alone for a cycle.",
          "score": 29,
          "created_utc": "2026-01-27 01:27:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1xp8h8",
              "author": "easy-agile",
              "text": "Yes! Retro is where you either solve this or just commiserate about it again.\n\n'Planning for Steve' and tracking what you sacrifice is exactly right. Best teams I've seen actually budget for disruption capacity upfront - like forecasting for hurricanes. Feels pessimistic, but way more honest than pretending 40 points means 40 points.",
              "score": 8,
              "created_utc": "2026-01-27 01:36:38",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1xolm3",
          "author": "Fast_Language_2059",
          "text": "Most development methodologies are theater. Everyone just shoves their existing patterns and workflows into whatever, including agile. And it never works since the methodologies require buy in from everyone, not just at the developer IC level.\n\n\nThe places where agile works well tend to do well with any method of organizing and prioritizing work, because they already have their functional patterns and workflows.",
          "score": 17,
          "created_utc": "2026-01-27 01:33:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2481ml",
              "author": "Interesting-Ad5589",
              "text": "Absolutely. If sales and marketing are not held to account then this pattern will just go on",
              "score": 1,
              "created_utc": "2026-01-27 23:50:58",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1xlho1",
          "author": "Timely-Ad-3439",
          "text": "Switch to Kanban?",
          "score": 7,
          "created_utc": "2026-01-27 01:16:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1xmls1",
              "author": "easy-agile",
              "text": "Kanban works great if your work is genuinely unpredictable flow. But if the real problem is Steve from Sales creating 3-day spikes with his \"quick questions,\" that guy has a Kanban board login too.\n\nSprint boundaries at least let you gesture sadly at your commitments before getting overruled. With Kanban, you're just constantly explaining why your WIP limits matter to people who think WIP stands for \"Work In Progress, But Actually Do Mine First.\"",
              "score": 2,
              "created_utc": "2026-01-27 01:22:12",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1xqp6q",
                  "author": "mriforgot",
                  "text": "Sounds like your team has a problem with pulling in stories at a moment's notice, which does tend to fit a Kanban model. Or you all need the ability to tell Steve from Sales that you will look at it later.",
                  "score": 11,
                  "created_utc": "2026-01-27 01:44:37",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1xuz49",
                  "author": "anotherleftistbot",
                  "text": "That's a management/team lead problem. \n\nWhoever is responsible for protecting your team productivity is failing. That can happen in any \"methodology.\"",
                  "score": 6,
                  "created_utc": "2026-01-27 02:07:57",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1y4r65",
                  "author": "FreshLiterature",
                  "text": "Overruled by who?\n\nSales shouldn't have the authority to overrule you.\n\nI commented elsewhere, but I'll repeat it here - you need to show and tell cost of delay for your team. It sounds like there is a pretty clear perception that delaying the work your team is doing is \"free\". You need to disabuse them of that perception.",
                  "score": 4,
                  "created_utc": "2026-01-27 03:01:25",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1ze8j9",
                  "author": "Trustadz",
                  "text": "Honestly, this sounds like the issue is outside of the team. The PO and you should manage Steve that his quick questions don't warrent the utmost attention from the team. The questions should pass the PO (whom should know the answers most likely) and if they are new features the PO is the one responsible for adding them to the backlog.",
                  "score": 3,
                  "created_utc": "2026-01-27 08:31:06",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o2neytg",
              "author": "MarkInMinnesota",
              "text": "The situation OP described is one of the reasons my team switched to Kanban. It's better to work on delivering value vs wasting time on useless sprint meetings and ceremonies.",
              "score": 1,
              "created_utc": "2026-01-30 18:35:09",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1xy682",
          "author": "the_ballmer_peak",
          "text": "\"Quick question from sales\" can become a three day spike in your next sprint unless product decides it's so important that something from the current sprint can be removed.",
          "score": 3,
          "created_utc": "2026-01-27 02:25:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o216usr",
              "author": "Pandas1104",
              "text": "This trade off is key",
              "score": 1,
              "created_utc": "2026-01-27 15:41:15",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1xtev2",
          "author": "No_Thought_4145",
          "text": "Lotsa ways to be agile; you should talk with your team to figure out how they want to work.\n\nMAYBE the team needs to allow for regular shifts in direction mid-sprint for good reasons. If that's the case, then accept that the sprint is not locked-in once started, and be sure that the team and stakeholders understand how abrupt change messes with productivity.\n\nMy recent experience has had me processing a lot of my own negativite feelings because my teammates have not be following MY expectations for the team's process eg. bringing in surprise tickets mid-sprint, being pulled away from planned tickets to support another team, etc. I'm now realizing that the team has never truly bought-in-to such strict ticket/scope management, nor does team leadership expect that. So if I am unhappy, it's because my expecations don't match reality.\n\nI have been on teams (at a different company) where sprint scope WAS treated as sacred, with technical leadership being on the same page and supporting the plan. To make that work you do need the general culture who is willing to \"play within the rules\" - which is easier said than done.",
          "score": 3,
          "created_utc": "2026-01-27 01:59:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1xvcl1",
              "author": "easy-agile",
              "text": "This is painfully accurate. Misaligned expectations between \"how I want to work\" and \"what the org actually supports\" is the silent killer of most agile implementations.\n\nYou can't enforce sacred sprint scope without cultural buy-in up the chain. Otherwise you're just documenting your disappointment in 2-week increments.\n\nThe self-awareness to say \"my expectations don't match reality\" is huge. Now you get to choose: make peace with chaos or find a less chaotic home. Both beat fighting a battle nobody else signed up for.",
              "score": 4,
              "created_utc": "2026-01-27 02:09:58",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1xw573",
                  "author": "No_Thought_4145",
                  "text": "Validation ❤️\n\n> documenting your disappointment in 2-week increments\n\n🤣🤣🤣",
                  "score": 1,
                  "created_utc": "2026-01-27 02:14:17",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1ze8if",
                  "author": "LightPhotographer",
                  "text": "But is it bad? \n\nWhat about the work you are doing? \n\nAre you perhaps working at a large project, chopped up into two week intervals, and not delivering value every two weeks?  If you're not delivering actual value into the hands of someone who cares... then yes, you are going through the motions. \n\nImagine you're in a restaurant. Steve's 'quick question' would mean that this lady has to wait 30 minutes longer. That's a real cost. So Steve gets a polite 'no'. \n\nDo you have that? Or are you delivering a large project to which Steves' question makes no difference?",
                  "score": 1,
                  "created_utc": "2026-01-27 08:31:06",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o215bar",
          "author": "Few_Cauliflower2069",
          "text": "It's your fault for not sticking to the plan. Just tell them off or tell them they have to wait for next sprint. If management doesn't like that, they will have to make you stop doing sprints altogether",
          "score": 2,
          "created_utc": "2026-01-27 15:34:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1xllov",
          "author": "watdawg44",
          "text": "It’s always been theater. The whole thing",
          "score": 4,
          "created_utc": "2026-01-27 01:16:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1xto0i",
          "author": "ExtraordinaryKaylee",
          "text": "Edit: I had a good thing about my solution using stretch goals to account for this.   But OP is not actually asking a question, just fishing.",
          "score": 1,
          "created_utc": "2026-01-27 02:00:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1xu3ik",
          "author": "mrhinsh",
          "text": "That’s the system telling you something, and it’s being ignored.\n\nIf interruptions regularly consume multiple days, planning to full capacity is a false assumption. Sprint Planning is optimising for a reality that does not exist, so the plan predictably collapses. Until planning reflects the actual operating conditions, the ceremony will continue to look serious while producing no signal worth trusting.\n\nThe Sprint Goal already covers this. It is the only commitment in the Sprint. Make the Sprint Goal smaller, then create a concrete implementation plan for the first 24 hours only, and adapt it each day.\n\nThat rolling 24-hour plan can change at any time as new information arrives. The Sprint Goal remains achievable because it represents a small, intentional subset of the Sprint. You deliberately leave slack in capacity for the known unknowns. If you get most of the way through the Sprint, you can always pull more work from the Product Backlog.\n\nThis is how Scrum is intentionally designed to adapt; we learn more by doing.",
          "score": 1,
          "created_utc": "2026-01-27 02:03:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1xvqc3",
              "author": "easy-agile",
              "text": "This is 100% correct and also describes a level of discipline that approximately 3% of teams actually maintain past week 2.\n\n\"Rolling 24-hour planning that adapts daily\" is theoretically perfect and practically... well, it requires everyone to show up to daily standup actually caring about replanning, which is a heroic assumption in most orgs.\n\nThe Sprint Goal approach is smart though. Committing to less and leaving slack is way healthier than the \"plan 40 points, deliver 22, repeat forever\" cycle. The hard part is convincing stakeholders that \"we're planning for less on purpose\" isn't the team being lazy, it's the team being honest about Steve from Sales.\n\nYou're describing Scrum as designed. Most of us are living Scrum as implemented, which is... different.",
              "score": 2,
              "created_utc": "2026-01-27 02:12:02",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1xywkv",
                  "author": "mrhinsh",
                  "text": "The signals are there.\n\nYou appear to understand the problem, yet you frame inaction as “realism” and continue to accept the consequences of not acting.",
                  "score": 2,
                  "created_utc": "2026-01-27 02:29:29",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1xwxq6",
          "author": "YAMMYYELLOW",
          "text": "What the fuck are any of your Product people doing to help your developers?\n\nProtect your team, people",
          "score": 1,
          "created_utc": "2026-01-27 02:18:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1xxk94",
              "author": "easy-agile",
              "text": "The real question.\n\nProduct is supposed to be the bouncer at the club, not the guy holding the door open while Steve from Sales and his seven friends push their way to the front of the line yelling 'we're on the list!'",
              "score": 2,
              "created_utc": "2026-01-27 02:22:01",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1xyjbp",
          "author": "trophycloset33",
          "text": "How are you differentiating planned from unplanned work in your tracking tool? How about committed vs uncommitted objectives?",
          "score": 1,
          "created_utc": "2026-01-27 02:27:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1y4xeu",
              "author": "easy-agile",
              "text": "In theory: we have a 'unplanned work' tag and track it.\n\nIn reality: Steve's thing shows up as a comment on a random ticket, becomes a Slack thread, someone creates a subtask, it balloons into three stories across two epics, and by the time anyone thinks to tag it properly, the sprint's over and we're in retro going 'where did the time go?'\n\nGreat suggestion. Feel like making the unplanned work visible is half the battle. The other half is getting people to actually use the tags before everything's on fire.",
              "score": 2,
              "created_utc": "2026-01-27 03:02:23",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1y5tnn",
                  "author": "trophycloset33",
                  "text": "I’d start by bringing up that people are t following the team procedures in the next retro. See what yall can do to get back to the documented procedures.\n\nIt’s hard to judge procedures when they are never followed. Try and next retro, reassess how they went.\n\nYou shouldn’t be adding anything do or changing much of anything at this point.",
                  "score": 1,
                  "created_utc": "2026-01-27 03:07:20",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1y2jvh",
          "author": "young_horhey",
          "text": "Who is allowing the ‘quick question’ from sales to be higher priority than the existing sprint work? No one is pushing back once you realise this ‘quick question’ is taking multiple days?",
          "score": 1,
          "created_utc": "2026-01-27 02:49:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1y4j29",
              "author": "easy-agile",
              "text": "Everyone and no one. It's a beautiful organisational tragedy.\n\nSales says it's urgent. Product doesn't want to be the bad guy. Leadership says \"be flexible.\" The team pushes back and gets told they're \"not being collaborative.\" \n\nBy day 3, everyone's neck-deep in Steve's \"quick question\" and pointing fingers at each other about how we got here. Tale as old as time.",
              "score": 1,
              "created_utc": "2026-01-27 03:00:11",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1yyts5",
                  "author": "rayfrankenstein",
                  "text": "Does management take accountability for sprint carryover due to Steve’s quick question? Or are you still held to that deadline with consequences for spring carryover?",
                  "score": 1,
                  "created_utc": "2026-01-27 06:18:19",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1y48cm",
          "author": "FreshLiterature",
          "text": "When I say that organizations have to be on board with Scrum in order for it work this is what I mean.\n\nFirst, you shouldn't be bumping planned work for a spike.\n\nSpikes are research for future planned work when you aren't sure how to proceed.\n\nSecond, there should be some venue you can go to to make it clear you keep having to bump planned work because you aren't empower to tell sales no.\n\nEvery single time sales interrupts your team work there is a cost - ie, Cost of Delay.\n\nYou can pick something and calculate the cost of delaying that item and you SHOULD do that when you're assessing whether or not bumping a planned work item makes sense.\n\nBarring that, you should pick a high priority item from the past that was delayed for many sprints and do a retroactive cost of delay on that.\n\nTake that, run a theoretical cost of delay on your next sprint, bring it to leadership.\n\nIf there is regular work that requires your team to spend time every sprint then you need to prioritize building tools to offload whatever that work is.",
          "score": 1,
          "created_utc": "2026-01-27 02:58:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1y9kal",
          "author": "UnreasonableEconomy",
          "text": "> At what point is this just planning theatre\n\nIf your discussions fixate on cost but ignore value it's probably roleplay.\n\n> By Friday, half our planned work rolls over \n\nThat in and of itself isn't that big of an issue, IMO. Sprints can be ambitious.\n\n> random stuff that wasn't even in the backlog.\n\nThat sort of defeats the purpose of a sprint altogether though.\n\n---\n\nIf you want to get fired, ask your PO/SM:\n\n\"What is the purpose of a sprint? Why do we do sprints?\"",
          "score": 1,
          "created_utc": "2026-01-27 03:28:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1yed9g",
          "author": "dastardly740",
          "text": "So, you are counting uncompleted stories in your velocity? Or, counting the unplanned stories in your velocity? One thing to try is counting partial stories as 0 points. Because from your description your velocity is not 40 points or whatever you are planning, it is far less.\n\nIn addition, I have found a lot of these problems management worries about, like getting done what you say you will each iteration, are mitigated by smaller stories. First, larger stories are more likely to not finish. A larger story started later in the iteration is less likely to finish. When unplanned work comes in to screw up your planning you are more likely to be able to move out whole stories, thus reducing WIP.\n\nOne other thing to consider. Make sure all the issues are painfully visible. Generally, various Agile processes make it harder to hide problems, but management loves their illusions of control that tend to hide what is really going on and therefore giving them little real control. So, make sure that while sucking it up and dealing with all these issues that they are painfully visible to everyone.",
          "score": 1,
          "created_utc": "2026-01-27 03:57:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1yefrp",
          "author": "oneThing617",
          "text": "So many issues here. A few ideas come to mind. First thing first is to identify the root cause of the problems:\n\n-Why is spring planning taking so long?\n-Why isn’t there a good notion of the sprint plan in place before starting?\n-Why is the churn rate so high?\n-Why is the team or PO consistently allowing sprint goal/scope changes? Are these truly necessary immediate needs that can’t be brought in the next sprint?\n\nSorry to say, but these issues existing and not being addressed seems to be mostly a leadership and coaching deficiency of the Scrum Master or whatever agile lead role.\n\nAfter identifying root causes, I would ask the team for suggestions for changes to the ways of working. If there’s hesitancy, offer suggestions to consider yourself. You can always frame changes as an “experiment” to test for a few sprints. Some options that come to mind without knowing the true causes:\n\n-Try setting strict boundaries on sprint changes/churn, not allowing any changes except for emergency P1 level responses.\n\n-If the team truly needs to be available for drop-in issues, try reducing commitment and allocating a % of capacity for drop-in work.\n\n-Try Retroing your retro - bring to the team how the purpose of the retro is continuous improvement, and that the way it’s going isn’t fulfilling that goal. Ask for suggestions for changes (notice how I often go to asking the team, even if you steer them toward the best practices you already know, help them come to the idea themselves for quicker buy-in)\n\n-Consider using metrics for more objective insights. Measure average velocity, completion against commitment rates, churn rates, sprint volatility, etc. Having data to point to objectively helps frame the conversation, especially with analytical problem solvers like software engineers. It also shows it’s not your thoughts or opinions, but is empirical. Identify one or two deficiencies and devise tactical plans to focus on improvements.\n\nLastly, if agile ways of working are not encouraged by leadership, particularly in the business/product domain, coaching is needed. Assuming you have some type of Agile Delivery Manager or Agile PMO or something you report into, share the challenges you face with the community of practice and agile leaders so they’re aware of the misalignments. If there’s no space for coaching, feedback, improvements, or even working through these challenges with those not aligned and causing the problems, then thats a toxic environment and you should probably look for a new job.",
          "score": 1,
          "created_utc": "2026-01-27 03:57:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1yqbya",
          "author": "evergreen-spacecat",
          "text": "What about your PO takes a meeting with Steve a week before sprint planning. Any relevant work from Steve can be prioritized and broken down way ahead of sprint planning. This crap suggests the PO is not very close to stake holders.",
          "score": 1,
          "created_utc": "2026-01-27 05:14:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1yv7kb",
          "author": "Bowmolo",
          "text": "Seems like there is more demand variability than your process - primarily its cadence - can handle.\n\nTwo options:\n- If this variability is beneficial, hence justified, change your approach to managing it.\n- Else: educate people that their behavior leads to instability, lack of learning, and ultimately to less delivery and predictability.",
          "score": 1,
          "created_utc": "2026-01-27 05:50:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1z3z7c",
          "author": "Illustrious_Sea_17",
          "text": "Where is your product owner when Steve from Sales has a quick question that takes the whole team off plan?  And how was the retro after that sprint - did everyone think it was a disaster or was it just sort of a shrug and move on?\n\nIf your spidey sense is telling you that disruptions like this could become a regular occurrence, give everyone on the team a blank 3 point card in the next sprint so you can accept the next late ask, but also use the planning theater to force a prioritization discussion with your product owner.  If you use all those blank cards in the sprint, there’s a bad pattern developing that needs to be escalated.",
          "score": 1,
          "created_utc": "2026-01-27 07:00:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1z53t2",
          "author": "James-the-greatest",
          "text": "Tell the sales team to fuck off.\n\nThis is an education issue. The product owner and scrum master need to do their jobs. Educate the rest of the business.\n\nOr you just do Kanban and not worry about sprints",
          "score": 1,
          "created_utc": "2026-01-27 07:09:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1z8bgo",
          "author": "Kempeth",
          "text": "* Why are you accepting massive work items when you have tiny 1 week iterations? Why can't they be kicked down the road for 2 more days and picked up then?\n* Why are you planning your sprints like you won't be doing that when you know you will?\n\nThere are lots of things that can be said about what you should or should not be doing but none of that matters while you're all in denial about the process you actually have.\n\nOnly then can you strategize for change. Make the consequences of this behavior visible and attach a cost that is relevant to those with the power to change it.",
          "score": 1,
          "created_utc": "2026-01-27 07:37:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1zbhb6",
          "author": "Pretty-Substance",
          "text": "The first question I would ask is: why do we plan? What’s the actual purpose of planning? \n\nOr was it just sth that the teams were told to do for what reason?",
          "score": 1,
          "created_utc": "2026-01-27 08:05:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o20jsez",
          "author": "Budget_Pin5828",
          "text": "How do teams make the plan stick?\n\n\n1. Discipline \n2. A good PO\n3. A good SM\n4. Data driven decision making\n\n\nThere's a lot to unpack with your post. As there are tons of reason why the sprint changes. Some valid, some poor execution and decision-making. Its hard to diagnose your particular issue. \nRecurring pattern is a signal that something is amiss. But I cant tell based on the info provided.\n\n\nLet me ask this... what has been the impact to the team, the product, and the business when the sprint goes sideways? Is the sprint goal still achieved?",
          "score": 1,
          "created_utc": "2026-01-27 13:48:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o20krfj",
          "author": "Morrowless",
          "text": "Say no to anything not planned for the sprint. Put it in the backlog to be prioritized.\n\n  \nMuch of it does feel like theater. If that's what the company want to pay me for then I'm ok with it.",
          "score": 1,
          "created_utc": "2026-01-27 13:53:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o20n8oo",
          "author": "TMan-X",
          "text": "Your PO (and team) need to learn the word “No”. Or better “No, not now”. Also consider doing shorter sprints.",
          "score": 1,
          "created_utc": "2026-01-27 14:06:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o20xvgp",
          "author": "wringtonpete",
          "text": "Yeah that's messed up.\n\nSprint Planning should take no more than 30 minutes, though the scrum master needs to ensure everything is prepped beforehand. Specifically, make sure with the help of the PO that you have enough high priority stories refined, sized and ready to start. You can even do a quick run through with the PO a day or two before to make sure you're ready.\n\nWrt interference from outside, like Sales, what I found useful was to tell them you're mid sprint but are happy to discuss the details and fit it into the next sprint, but that's ultimately your PO's call. Crucially, tell them that if you are forced to put it into the sprint then the sprint will be cancelled to replan a new one, and, as per standing instructions, you will have to let senior management know.",
          "score": 1,
          "created_utc": "2026-01-27 14:59:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o21yfu0",
          "author": "Interesting-Invstr45",
          "text": "TLDR not all responses read.\n\nAre you able to track if and how Steve’s comment added to quality or $ value as part of DoD?\n\nIs your organization startup mode or mature? Is there a sale/quota pressure across the various silos?\n\nDo you have scrum of scrums or a one on one with Steve about why this behavior? Is Steve a one man sales org or is there actual sales organization with other than Steve in there?\n\nDo you want to solve this or this is interview prep for next role? If you want to solve this what’s your next top 3 steps from this posts comments / discussions?\n\nGood luck 🍀 to us all",
          "score": 1,
          "created_utc": "2026-01-27 17:41:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o22fgxw",
          "author": "liquidpele",
          "text": "It's almost like trying to fit real-world work into 2 week buckets that are micromanaged by non-technical people just isn't a good system!",
          "score": 1,
          "created_utc": "2026-01-27 18:53:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2476j7",
          "author": "Interesting-Ad5589",
          "text": "It's the usual thing , sales team say something..everyone jumps and the plans just turn to crap.\n\nHave seen it over and over in waterfall , agile and no planning companies and projects. If everyone just believes it's blindly about sales and instant revenue you are stuck. The sales people get the praise and the poor staff trying to deliver something get the brickbats.. Forgive my bitterness. It's nothing to do with agile and all about blindly giving the sales staff too much power.",
          "score": 1,
          "created_utc": "2026-01-27 23:46:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o264a28",
          "author": "Perfect_Goose8537",
          "text": "Question since I have a similar problem:\nI am a lead of a DevOps/Cloud engineering team and we have several customer projects who usually want stuff at the same time. Plus there is always unpredicted immediate stuff coming up, CVEs that needs to be fixed ASAP and other critical topics. We end up having a lot of in progress topics, and some span over such a long time that you lose track.\nWe tried with sprints and scrum but in the end the customer always gets what he wants so there is no way with sticking to the plan. \nI just switched to Kanban but to be honest, I dont think it will be a lot better.\nAnd I am unsure in how I could plan stuff since there are also some small side projects coming in.\n\nAny other experiences in managing DevOps teams with a high amount of unpredicted work coming in all the time?",
          "score": 1,
          "created_utc": "2026-01-28 06:24:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o26z3rs",
          "author": "Typhon_Vex",
          "text": "For me it has become the only meaningfull and crucial ritual\n\nWe try to do neorve it and protect ourselves \n\nI started forcing PO’s to come\nOh you didn’t come and force your issue ? Well better luck in two weeks ",
          "score": 1,
          "created_utc": "2026-01-28 10:55:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o277p9l",
          "author": "_Masbed",
          "text": "Figure out if the PO care more about predictability or lead time. If lead time is more important (as it sounds like), just switch to Kanban instead. If predictability is important, you have enough data to prove that you will never get or improve on that with Scrum unless you stick to your sprint plan. The PO need to own shielding the team by saying \"my team is busy, we can start on this in 2 weeks time\". Note that suddenly imposing \"slowness\" in the process like that is a cultural shift that usually requires some kind of buy in from a PM or CPO or something like that, so it's important to anchor in why. \"We need to adhere to this to get the predictability we need to be able to plan this cross team effort and deliver our most important project on time. If we fail to plan, other teams delivery is impacted which puts the entire project at risk.\" Unless you can be clear about why, no one will care. And if they actually care more about quickly responding to change, maybe Scrum isn't the thing you need (or you need to find a better cycle time that balances the needs better).",
          "score": 1,
          "created_utc": "2026-01-28 12:03:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o278gyn",
          "author": "Sindarsky",
          "text": "That's because you guys do it not for accomplishing a goal to deliver but to do the ceremony. Your mindset is process over delivery.\n\nThat's why I am doing my own methodology tbh. Current methodologies are just ceremonies trying to say WE are AGILE, we do scrum",
          "score": 1,
          "created_utc": "2026-01-28 12:09:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o27h01z",
          "author": "serpix",
          "text": "I was assigned a task on Friday and ive not had 30 minutes to get on it and it is now Wednesday, the day is almost over. It is all theater.",
          "score": 1,
          "created_utc": "2026-01-28 13:04:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2mv1mm",
          "author": "Ok-Ranger8426",
          "text": "Why are you working in \"sprints\"? Do you only do releases every 2-3 weeks?",
          "score": 1,
          "created_utc": "2026-01-30 17:07:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1yb6ma",
          "author": "agileliecom",
          "text": "**25 years building software, Head of IT Architecture at a bank. What you're describing has a name: it's called Risk Management Theater.**\n\nThe 2-hour planning ceremony isn't about planning. It's about creating the *appearance* of predictability for stakeholders who are uncomfortable with the inherent uncertainty of software development.\n\nHere's the uncomfortable truth: **the plan was never supposed to survive contact with reality.** Everyone in that room knows it. But the ritual continues because:\n\n1. **It gives management something to point at.** When the VP asks \"what's the team working on?\", there's a Jira board with story points. Doesn't matter if it's fiction by Wednesday.\n2. **It distributes blame.** When things slip, it's because of \"unplanned work\" or \"scope creep\" - not because estimates are fundamentally unreliable for complex knowledge work.\n3. **It feels productive.** Two hours of structured discussion with sticky notes and story points *feels* like work. Meanwhile, the actual work gets interrupted by \"quick questions from sales.\"\n\nThe pattern you're seeing - plan → interrupt → rollover → repeat - isn't a bug. It's the system working exactly as designed. The ceremony exists to manage organizational anxiety, not to optimize delivery.\n\n**Teams that \"make the plan stick\" usually do one of three things:**\n\n1. They have enough slack built in that interruptions don't derail them (rare, because slack looks like \"inefficiency\" to people who measure utilization)\n2. They have a PM/manager who actively shields them from \"quick questions\" (also rare, because that person gets labeled as \"not collaborative\")\n3. They pad estimates so aggressively that they always \"finish early\" (common, but nobody admits it)\n\n**What actually works:** Stop pretending you can predict 2 weeks out. Use a pull-based system. Work on the highest priority thing until it's done. When priorities change, acknowledge it explicitly instead of pretending it's an exception.\n\nBut that requires leadership to admit they don't have control. And the whole point of the theater is to avoid that admission.\n\nYou work at a Jira company - you've probably seen the dashboards people build. Burndown charts, velocity trends, cycle time reports. Ask yourself: how often does any of that data actually change a decision? Or does it just make everyone feel like there's a process?",
          "score": 0,
          "created_utc": "2026-01-27 03:38:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o22s2bh",
              "author": "Vegetable-Ad-7184",
              "text": "Preach !",
              "score": 1,
              "created_utc": "2026-01-27 19:48:28",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o1yfcba",
              "author": "morksinaanab",
              "text": "Hello AI",
              "score": 1,
              "created_utc": "2026-01-27 04:03:03",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2992x6",
                  "author": "agileliecom",
                  "text": "If an argument sounds artificial, maybe its because we’ve normalized nonsense for too long!",
                  "score": 1,
                  "created_utc": "2026-01-28 18:04:15",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qo5h8r",
      "title": "Im So miserable as an agile coach, dont know what to do😵‍💫",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1qo5h8r/im_so_miserable_as_an_agile_coach_dont_know_what/",
      "author": "Specific_Crab3601",
      "created_utc": "2026-01-27 05:50:52",
      "score": 53,
      "num_comments": 51,
      "upvote_ratio": 0.92,
      "text": "Honestly being AC was my dream job: i looove systemic thinking, I love systems design, coaching (willingful) people, diagnose problems, finding root causes, improve, remove blockers, facilitate etc. I was just amazing...on paper.\n\nIn reality, for 5 years Im doing politics, finding ways to tell stuff in a polite way to people who I find dumb🙈teaching super basics to people who think their dictatorship is better than psychological safety. \"Selling\" my stuff to people who were forced to have an AC by people who dont understand what an AC does. Being expected to fix disfunction with a magic wand and then watching disappointment when i say I need commitment and sponsorship for a change.\n\nEven more! im my new company i discovered that the \"success\" is measured by outputs, numbers of workshops, my agile Boss doesnt understand metrics, people dont understand Product, human-centricity, evidence based management. They just produce confluences with rules and processes. My Boss is reluctant for me to talk to anyone above certain level and I have to fight her to even exercise my ideas.\n\nI feel incompetent when I am unable to change an unchangeable things. I feel a good coach can fix anything. I know it is not true and its in my head but i still feel it.\n\nAnd in the same time idk what else to do. Consulting? PMing? Management? it is all less ideal than AC on paper. But maybe it is better IRL? does anyone have any advice, Im honestly so tired...",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1qo5h8r/im_so_miserable_as_an_agile_coach_dont_know_what/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o1yvqgf",
          "author": "AhamBrahmassmmi",
          "text": "You are not alone.. M in the same boat.. Highly frustrated now.",
          "score": 24,
          "created_utc": "2026-01-27 05:54:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1yz8hv",
          "author": "NobodysFavorite",
          "text": "Disappointment or delight comes from the gap between expectation and reality.\n\nThis is the real life of agile coaching. Unpicking messy toxic environments where your presence is simultaneously inspiring and threatening, desired and reviled. You have to navigate that mess mastering the microinteractions.\nTrailblazers get burned but the first followers achieve enormous change and get praised for it. (Hint: it wasn't possible without the trailblazers going first).\n\nOne piece of advice I got was when your client insists asking you for the wrong thing, you give it to them in such a way that they realise what the right thing was all along. \nWhen they have that epiphany that you were leading them to, be magnanimous and you'll find them easier to work with afterward. \n\nAnd don't try to change too much too quickly. Overreach will get you ejected. The evolutionary change model is really good here and I highly recommend it.",
          "score": 34,
          "created_utc": "2026-01-27 06:21:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1z0v0g",
              "author": "fixingmedaybyday",
              "text": "This is one of the most honest takes I’ve read from an agile insider.",
              "score": 7,
              "created_utc": "2026-01-27 06:34:41",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o1z2grw",
              "author": "Specific_Crab3601",
              "text": "This is true but also very sad, it sounds toxic af as a job",
              "score": 3,
              "created_utc": "2026-01-27 06:47:47",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1z4csx",
                  "author": "NobodysFavorite",
                  "text": "When you get a real buzz moment, it's like a drug giving you a work high that completely outweighs any of the toxic stuff. It'll draw you back again and again.",
                  "score": 3,
                  "created_utc": "2026-01-27 07:03:21",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1zl682",
                  "author": "Maverick2k2",
                  "text": "Extremely well paid role too. Which is why people do it.",
                  "score": 1,
                  "created_utc": "2026-01-27 09:36:03",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o27dyoj",
              "author": "AgileEvolves",
              "text": "well said!",
              "score": 2,
              "created_utc": "2026-01-28 12:46:10",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o205wjy",
          "author": "DingBat99999",
          "text": "Long time agile coach here, recently retired.\n\nIf I had to point to one thing where I think agile failed, it's in grossly underestimating the North American/western managerial need for a sense of control. Many managers are find an ideal agile environment chaotic and are very willing to forego any potential improvements to retain that sense of control. Command and control is a helluva drug.\n\nI mean, Beck et al were idealists. And they could largely control their own environment. What we needed to do was remember that Deming had to go to Japan to get his ideas heard.",
          "score": 11,
          "created_utc": "2026-01-27 12:27:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1z5can",
          "author": "ScrumViking",
          "text": "What the ask when they hired you? How did they describe your assignment? Do they really want help or just “more efficiency”. \n\nI’ll never ‘inflict’ help on those who never asked for it, even if you really think they need it. It’s a path of disillusion and misery that rarely leads to any satisfying result. It does end up with annoyed clients and burned out coaches.\n\nI’ve been a consultant for nearly a decade now and I’ve found that the intake before even doing the job is most critical for defining success. It pays to understand and set expectations and define what success looks like. It provides a framework for measuring success as well. This is key because with what we do it’s hard to correlate actions and improvements to results.",
          "score": 10,
          "created_utc": "2026-01-27 07:11:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o215f9y",
              "author": "notantisocial",
              "text": "The intake for that job being the most important criteria of success, could not have said that better. Definitely need to work on that myself. Sometimes we feel like we don’t have a lot of options or leads.",
              "score": 4,
              "created_utc": "2026-01-27 15:34:51",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o25zleh",
                  "author": "ScrumViking",
                  "text": "It helps if you realize that these interviews are a two way street.  It is vital you learn as much of the organization you might join as it is for them to understand the person they might hire. Be curious and ask questions.",
                  "score": 2,
                  "created_utc": "2026-01-28 05:48:48",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o200eun",
          "author": "zero-qro",
          "text": "What I'm about to tell you may break your spirit, but that's the truth for most cases.\n\nNow some may come and say that their experience is different, but I'm not talking about anecdotes, which are valid and I respect that. I'm talking about market and industry trends and behaviors.\n\nAgile Coach, as a role, is a dead end.\n\nIt is a delusion that in the best-case scenario is just a fever dream for a perfect world where people have common sense and environments are completely devoid of politics and personal agendas. In the worst-case scenario, it's just a money-grab scheme.\n\nAnd I'm no bitter developer/manager who was hurt by a bad scrum master. I speak from experience. I was once a believer. I lived through the Agile hype for more than 20 years. I started in 2008, through XP, then Scrum, then all the Scaling mania. I worked in startups, mid-size companies, and big corps, and in most of them Agile Coaching didn't work or would never work.\n\nDon't get me wrong. I still think and work through the Manifesto values and principles, but the so-called 'Agile Coach' role is trying to achieve something that is unreachable through a group of individuals.\n\nLet's start with the Coach stance, which over the years was more and more co-opted by the 'Life Coach' style. Agile Coaches became corporate therapists, without having any qualification for that, and soon the field was invaded with a lot of wishy-washy-hugging-tree practices that simply don't apply to software development delivery. I value individual coaching, but that doesn't work for teams. Instead of becoming more like basketball/soccer/football coaches, i.e., having experience and authority on the field to provide guidance, agile coaches became more like 'Tony Robbins' figures, with very generic and toothless approaches that maybe make you feel good but don't have any influence on real software development.\n\nThings like 'influence without authority' or 'facilitate without intervening or being opinionated' are just BS.\n\nAdd to the mix that Agile was originally intended for software development teams, not entire companies or any other field.\n\nNot that the principles, values, and some techniques can't be applied at different levels and fields, but calling it Agile is a stretch.\n\nWhen context gets bigger, complexity increases exponentially, and expecting that one professional, or a department of said professionals, can change the entire system is insanity.\n\nBig corps are the way they are because they evolved to be that way. There's no training, workshop, or coaching session that will change years of politics and psychological conditioning.\n\nThis is system thinking 101: the system works exactly the way it is designed to work.\n\nI've seen rare changes in those environments during my career, but that happened when you had actual real leadership that was worried about quality, time to market, and customer focus.\n\nYou alone, or your department, will never succeed in this mission because you were not created for this.\n\nUnfortunately, nowadays being an Agile Coach is being set up for failure.\n\nReality hit me hard like this a few years ago. Then I shifted my career back to being a tech lead, or Technical Product Manager, sometimes Delivery Lead.\n\nReassess your skills and check where you would fit in the software development cycle. Maybe go back to coding. Maybe focus on becoming a Product Manager, Program Manager, or Delivery Lead.\n\nTry to go back to something tangible, where you can feel accountable for and apply what you know, other than 'Agile mindset'.\n\nSorry for the sour honesty, but that's the message I would like to have received a decade ago.\n\nBest of luck",
          "score": 10,
          "created_utc": "2026-01-27 11:47:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o20dz2e",
              "author": "his_rotundity_",
              "text": "At this point, if I get an Agile Coach role, I know it has less than an 18-month shelf life. I fully expect to be out of a job within that timeframe (informed by multiple layoffs). So I milk it for what it's worth, deliver value where I can, and constantly remain in the market during that period.",
              "score": 4,
              "created_utc": "2026-01-27 13:17:30",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o20kdc5",
              "author": "Specific_Crab3601",
              "text": "I think you are right",
              "score": 2,
              "created_utc": "2026-01-27 13:51:52",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1yyakj",
          "author": "Kaivosukeltaja",
          "text": "Sounds awfully familiar. That's basically what got me to say \"screw this\" after 8 years of being a full time SM/AC and go back to writing code. \n\nIn my view, the problem boils down to too many layers of middle management. They want to have goals that are easy to achieve reliably, such as story points delivered. They don't care about actual business outcomes because they're unpredictable - and it's not their money on the line.",
          "score": 7,
          "created_utc": "2026-01-27 06:14:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1zlefk",
              "author": "Maverick2k2",
              "text": "Experienced that.\n\nThe agile community is partially to blame too.\n\nTo influence you need to first be likeable. If the org hasn’t asked you for changes and you forcefully push for it, you will without a doubt become frustrated and disliked. It also means doing what you are told.\n\nWhenever anyone posts a situation where they are frustrated , the agile community blames them and worse still, tells them they are shit if they can’t influence or following orders.",
              "score": 6,
              "created_utc": "2026-01-27 09:38:10",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o27eaux",
                  "author": "AgileEvolves",
                  "text": "Tact and diplomacy. Well said!",
                  "score": 3,
                  "created_utc": "2026-01-28 12:48:18",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o20nsc1",
          "author": "Anxious-Narwhal7901",
          "text": "Most of these companies want to say they're agile but they don't really believe in what agile brings to the table. It requires a mindset shift they're not willing to make.\n\nIt also asks those who crave power to release some of that power, which many of that nature are reluctant to do 🥲\n\nLoved all my agile coaches in the past. I was lucky to be in an environment where they were respected and listened to.\n\nSorry to hear it wasn't the case for you so far.\n\nThere are definitely places out there where you'll be loved and valued though ❤️",
          "score": 4,
          "created_utc": "2026-01-27 14:09:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o23qzqe",
              "author": "Colt2205",
              "text": "There's also cases where someone doesn't mind giving up power but because of the project and skill set gap it isn't possible to do it.  I'm in one of those positions where the external factors influencing the development change rather frequently and the tech stack is completely different from the rest of the team.",
              "score": 2,
              "created_utc": "2026-01-27 22:25:51",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o20zfj6",
          "author": "Consistent_Voice_732",
          "text": "Loving Agile in theory and hating Agile in practice is more common than we admit. Coaching without sponsorship isn't coaching it's emotional labor with a scrum vocabulary. Still figuring out what to do with that truth",
          "score": 4,
          "created_utc": "2026-01-27 15:07:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o22wogg",
          "author": "Hexpnthr",
          "text": "Don’t underestimate the power of culture. Agile works better in some cultures and worse in other. If you are in the US or a culture that is highly hierarchical, you are fighting against the current.",
          "score": 4,
          "created_utc": "2026-01-27 20:08:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1z1kra",
          "author": "similkameenjp",
          "text": "I agree with the comment that you can't change everything too quickly. Some issues have to simmer for a bit. Agile coaching taught me patience for the big issues. \n\nAll that said i moved from agile coaching to delivery management. I use the same skills but work with product owners to achieve business outcomes. I am waaay happier now as I can focus on business outcomes instead of changing everything.\nOnce teams deliver more business outcomes it builds momentum for change.",
          "score": 3,
          "created_utc": "2026-01-27 06:40:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1zdl4l",
          "author": "theholewizard",
          "text": "Very relatable. This is why I stopped doing it. I still believe strongly in the potential of human collaboration and learning organizations, but my actual experience in the world of tech startups is a series of toxic territorial senior engineers and hapless impatient management who don't see how they're enabling the bullshit, stifling everyone's potential, and creating an environment of learned helplessness. It happens with such regularity in these settings that I would be inclined to think it's just me if I didn't have such deeply rewarding collaborative experiences in other areas of my life. \n\nI switched to product management and data analysis. It may not be the most exciting job in the world, but every day that I don't have to coach around some fragile middle aged man's dysregulated emotions is a good day.",
          "score": 3,
          "created_utc": "2026-01-27 08:25:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o20ajmv",
          "author": "attractiveblonde",
          "text": "I was a project manager before my organization changed to scaled agile. Not only do I dislike my role, like you; I absolutely despise SAFe. Talk about a mess on both fronts.",
          "score": 3,
          "created_utc": "2026-01-27 12:57:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o20f76m",
          "author": "Affectionate-Log3638",
          "text": "Not an AC, but I can relate.\n\nI started as an SM on one of the very first release trains in our org, seven years ago. It being terrible from the start hasn't stopped them from rolling out two dozen more trains, that have basically ruined our organization. (Our org is slow as molasses and as inflexible as they come. Morale across the entire org is down. People are publicly criticizing SVP level leaders in town hall meetings now, which is wild stuff.)\n\nI recently joined a train as a PO where myself and the PO I work closely with have far more experience than everyone else. Including the RTE and Portfolio Manager. We're very vocal about what needs to change and offer solutions other teams get excited about.....The RTE labeled us a \"contagion\". I've tried to take my SM under my wing, with us even presenting ideas to the RTE and Portfolio Manager (his boss)....The Portfolio Manager told him to stop spending time with me.\n\nMyself and the PO end up in meetings with these two every month, where they try to get in our way. They want to \"take everything offline\" to avoid us sharing ideas for improvement with others.",
          "score": 3,
          "created_utc": "2026-01-27 13:24:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2155yh",
          "author": "notantisocial",
          "text": "This is something I struggle with too. I took a break from coaching. It was really tired of politics. Sometimes you can only help someone so much and then there’s no more room to grow.",
          "score": 3,
          "created_utc": "2026-01-27 15:33:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o23o3z8",
          "author": "Colt2205",
          "text": ">Being expected to fix disfunction with a magic wand and then watching disappointment when i say I need commitment and sponsorship for a change.\n\nOh man do I feel this in my soul as a software engineer and not even as an agile coach.  But wait, we don't need sponsorship to go work on what is currently the most important priority task until an hour later another request comes in that is also the top priority task!",
          "score": 3,
          "created_utc": "2026-01-27 22:12:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o25pr4y",
              "author": "Specific_Crab3601",
              "text": "Haha yes the top of priority is a very wide place😂",
              "score": 2,
              "created_utc": "2026-01-28 04:41:18",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2bx83r",
          "author": "Outrageous-Ad9248",
          "text": "Former AC, now working as a software implementation consultant. Able to effect change and serve as a peer leader on my team, work with professional executives who are excited about solutions, and generally never have to argue about priorities and budgets. I miss watching dev teams in action and effective retros but otherwise I am so much happier and feel I am taken more seriously as a professional.",
          "score": 3,
          "created_utc": "2026-01-29 01:35:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1z5r93",
          "author": "Purple_Tie_3775",
          "text": "It’s easy to get suckered by what used to work well as an AC. All there’s left is old legacy companies that want faster delivery without compromising anything. A lot of the old memes need to be let go. There good but they weren’t everything. \n\nWhat you need is to start small and build momentum. It sounds like you’re adrift right now and you need to find ways that bring relief to teams, regardless how small. You need to start things and get them to shoulder before you can have a fire. \n\nLook for ways to measure and eliminate small bits of waste. Things that teams are willing to do. I have been creating a lot of tools to provide  them with data to plan faster and better. Stick with rudiments and things that can prove your effectiveness. \n\nRemember that regardless of whatever is done, collaboration and stakeholder satisfaction is the only real thing that moves the needle besides whatever lame maturity you have. Maturity is a red herring. All that matters is value is delivered and customers are happy. You need to show your teams are either creating increased business or cutting costs (or both). \n\nDon’t get caught up in the romance of making teams more realized or happier. They’re helpful but that’s not what pays the bills.",
          "score": 2,
          "created_utc": "2026-01-27 07:15:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1zkx2v",
          "author": "Maverick2k2",
          "text": "You can always go into project management.",
          "score": 2,
          "created_utc": "2026-01-27 09:33:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o218fsa",
          "author": "DaedalusandIcarus",
          "text": "Try only accepting missions with clients who have both management and the teams onboard with agile. People tend to lose their time, trying to convince one or the other about the change. But the change is being forced on them. So you're going to waste your time and breath trying to convince them of this change. During an interview, just ask them if both are ready to commit and if other coachs in the past have had issues with the organisation that doesn't want to change, it just want's to say it's doing agile.",
          "score": 2,
          "created_utc": "2026-01-27 15:48:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o228snd",
          "author": "Strutching_Claws",
          "text": "You work for a business, demonstrate how your actions impact the bottom line and people will pay attention,  otherwise you are fluff.",
          "score": 2,
          "created_utc": "2026-01-27 18:25:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o228u8c",
          "author": "Strutching_Claws",
          "text": "You work for a business, demonstrate how your actions impact the bottom line and people will pay attention,  otherwise you are fluff.",
          "score": 2,
          "created_utc": "2026-01-27 18:25:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o22y0nv",
          "author": "Turkishblokeinstraya",
          "text": "I feel you mate. Pointing out operational shortcomings with solid data, getting acknowledgement, but insufficient commitment. Old habits die hard. The appetite to hire big consultants that often lead to mass lay offs for short-term cost-reduction is still common. Operations keep bleeding money more often than not. \n\nMeanwhile, plenty of practitioners are stuck in a rut, unwilling to learn, measuring velocity, discussing definition of ready, giving no tangible benefits to employers so they consider switching back to their old ways which they never manage to change.\n\nWe need more competence. That's why I offer fluff-free mentoring to less experienced practitioners. Most people learn frameworks and can't apply them, because agility can't be shoehorned into a politically intense, process-heavy organisation. Navigating politics is a different game.",
          "score": 2,
          "created_utc": "2026-01-27 20:15:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o27huks",
          "author": "AgileEvolves",
          "text": "Software-dependent organizations, large and small, express delivery dysfunction in many ways. Most try to address it with more process or new frameworks. Agile helps with some of this, but not all of it, because much of the dysfunction isn’t at the team level. It lives in the culture.\n\nYour misery is recognizable. Many of us here have felt it, and it’s real.\n\nLife is too short to stay miserable just for a paycheck. Take the time you need to decide what comes next.\n\nThat said, in the short term, there may still be a way to contribute without burning yourself out.\n\nI’ve been in situations like this with specific teams and departments where I had to reset what “being an agile coach” meant. I had to be okay with teaching people how to hold a fork before I could teach them how to take a bite. Never mind that management was stacking ten plates in front of them.\n\nIgnore the plates. Help them with the fork.\n\nFocus on the people, not the system. When you see a small moment of understanding click during a coaching or teaching session, that light can be enough to get you through the day.\n\nHang in there, friend.",
          "score": 2,
          "created_utc": "2026-01-28 13:09:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o29a4ru",
          "author": "agileliecom",
          "text": "yeah… this is very real. I did something close to AC role before and honestly most of the time is not coaching, its just dealing with people ego and politics. lot of talking, lot of smiling, very little real change.\n\nAt some point i also felt like “if im good enough i should be able to fix this”. but some companies just dont want to be fixed. they want agile look, not agile change.\n\nMeasuring success by workshops and documents is a big red flag btw. thats not impact, thats activity.\n\nAbout feeling incompetent: i had same thing. later i realized it was more like being stuck in a system that doesnt give you any power but still blame you for results.\n\nno good advice here, just saying you are not crazy. the role sounds amazing on paper and is draining as hell in real life.",
          "score": 2,
          "created_utc": "2026-01-28 18:08:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2byr27",
          "author": "I_Wanna_Score",
          "text": "This applies to my new job, where I was told 'we want to do things differently' (my job has nothing to do with Agile, BTW). There was the first red flag. Same $hit, different place...",
          "score": 2,
          "created_utc": "2026-01-29 01:43:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2dj0hh",
          "author": "dennis_andrew131",
          "text": "I really hear you  and sadly what you’re describing isn’t unusual for Agile coaches stuck in environments that haven’t truly bought into Agile principles. The frustration you’re feeling comes from a few real dynamics we see a lot:\n\n1) Coaches are often brought in as magic fixers  \nOrganizations want the output (better metrics, faster delivery) but haven’t actually committed to the mindset shift Agile requires. Coaching without sponsorship, shared metrics, or leadership engagement leaves you doing political survival more than transformational work.\n\n2) Resistance to change is a real structural problem  \nEven teams with good intentions can dig in heels or adapt Agile superficially (ceremonies without mindset), which leaves coaches constantly “selling” basics instead of advancing real improvement.\n\n3) Role ambiguity and lack of authority drains energy  \nYou can have all the coaching skills in the world, but if your org doesn’t give you access to influence leaders or outcomes, you’re basically an advisor with no mandate. That’s corrosive to motivation.\n\nHere’s the part that might help clarify next steps: being a good coach doesn’t mean you’re competent at changing every environment , it means you know how to diagnose where the real blockers are (leadership, culture, metrics), and whether the org has the will to remove them. If not, that’s not personal failure , it’s a mismatch between the role and the context.\n\nA few practical ideas:\n\n* Try identifying which level the biggest blocker sits at  team, leadership, culture, or system  and be explicit about that with your boss or stakeholders.\n* If leadership sponsorship is weak, ask for clear goals and measurable coaching outcomes upfront. Without them, you’re coaching in the dark.\n* Consider whether an Agile coaching collective or community inside the company could share practices and influence, instead of you working solo.\n\nAnd one last thought: What you want to do (systems thinking + coaching + improvement) does exist, but often it lives in roles where you have some combination of authority, influence, and partnership with leadership , consulting, product ops, or even product leadership can be rewarding pivots if the pure coaching path doesn’t give you the impact you want.",
          "score": 2,
          "created_utc": "2026-01-29 08:04:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2fx7cb",
          "author": "ahlamaay",
          "text": "It is extremely tough to be an agile coach in todays environment. Most managers want a sense of control and to plan far ahead, tbh I have done best when I have been adaptable and dropped some of the textbook Agile methodology and formed a hybrid approach of sorts. It isn't ideal but helps me keep my sanity.",
          "score": 2,
          "created_utc": "2026-01-29 17:04:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2fofid",
          "author": "stealthagents",
          "text": "It sounds like you're in a tough spot where the day-to-day reality doesn’t match the dream job you envisioned. Focusing on what you truly enjoy can help relieve some of the frustration. Sometimes, the right support system makes all the difference. At Stealth Agents, we pair professionals with skilled executive assistants who are adept in managing operations and systems, which could help you focus more on what you love—like systems design and coaching—without getting bogged down by the politics and basics.",
          "score": 1,
          "created_utc": "2026-01-29 16:25:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1z4ho8",
          "author": "Rojeitor",
          "text": "You probably don't know how to code shit, never built a long lasting high performance high reliability system, and you're trying to tell the people who KNOW how to do this but rainbows and butterflies",
          "score": -9,
          "created_utc": "2026-01-27 07:04:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1zbavg",
              "author": "theholewizard",
              "text": "I simply can't imagine how a team with you on it might have been dysfunctional",
              "score": 6,
              "created_utc": "2026-01-27 08:04:05",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o1z65eb",
              "author": "eigenwijzemustang",
              "text": "Somebody has had some bad experiences. Enlighten us. What happened?",
              "score": 4,
              "created_utc": "2026-01-27 07:18:23",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1zebul",
                  "author": "Annual-Ad6647",
                  "text": "There’s always one in every team, they don’t like how things are but even worse than that would be change. Fixed mindset people can be so destructive to a team.",
                  "score": 3,
                  "created_utc": "2026-01-27 08:32:00",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o1zeksr",
              "author": "Specific_Crab3601",
              "text": "Ahhhhh that's why🤩",
              "score": 3,
              "created_utc": "2026-01-27 08:34:19",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o1zsjwq",
              "author": "psgrue",
              "text": "An agile coach doesn’t do the estimation for you. They ask you to decide how long it takes you.",
              "score": 1,
              "created_utc": "2026-01-27 10:42:41",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qpofn1",
      "title": "My CEO wants to implement full sprint ceremonies for a team of 5. We're already shipping faster than ever. I'm losing my mind",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1qpofn1/my_ceo_wants_to_implement_full_sprint_ceremonies/",
      "author": "rdizzy1234",
      "created_utc": "2026-01-28 21:22:13",
      "score": 44,
      "num_comments": 69,
      "upvote_ratio": 0.84,
      "text": "I need to vent a little bit here.\n\nI'm a PM at a 10-person startup. 4 engineers, me, and 5 sales people. That's the whole company. We are TINY.\n\nMy CEO has decided we need to get on \"proper sprints.\" He wants quarterly planning, pre-grooming, grooming, daily standups, retros, AND a mid-sprint check-in. For FIVE people on my team.\n\nThe real issue is that we are crushing it right now. Like, genuinely moving faster than any team I've ever been on. I use Telos to listen to customer calls, turn those into requirements and mockups, hand them to the engineers, they throw it into Cursor, and stuff gets shipped. Constantly. There is no bottleneck. There is no communication problem. We literally just talk to each other because there's five of us.\n\nI tried to explain this. But I'm 99% sure this is about looking good for investors. \"We run proper two-week sprints with quarterly planning\" sounds better in a board meeting than \"we just build stuff really fast.\"\n\nSo now I'm looking at potentially adding like 6 hours of meetings per week to a team that is literally 5 people. For what? So we can have a retro where the same 5 people who talk every day can talk about how the sprint went?\n\nI'm not against process when you need it. I've worked at bigger companies where \"real\" Agile made sense because coordination was actually hard. But we don't have a coordination problem. We have a CEO who wants to play startup theater.\n\nHas anyone successfully pushed back on a situation like this? Please lmk if so\n\n\n\nEdit: I don't normally share tools. But I've had multiple people ask what our setup is to move so fast. Like I said, my team uses [cursor](https://cursor.com/home) development and I use [telos](https://www.telos-ai.org) for management",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1qpofn1/my_ceo_wants_to_implement_full_sprint_ceremonies/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o2ajp90",
          "author": "NeatEmergency725",
          "text": "There's no reason you have to fill a time box. Open up your jira or equivalent, create the retro document, fill out some bullets of things you did well or not in the last two weeks, and save it. If you're already on the same page should take ten minutes. \n\n\nSame thing with grooming and sprint planning. If you have enough work planned, tickets assigned to people, just formally documenting that on a board sounds like a relatively minor ask. \n\n\nJust making sure each ritual has an objective, then when the objective is done the meeting ends. \n\n\nStand up is literally supposed to be done standing up. Each of the five members flags their blockers. No blockers? Stand up is thirty seconds long. \n\n\nThis is genuinely how agile is supposed to work, you're not being cute or cheeky by doing this. And your boss can honestly take the two week sprints claim to the investors. ",
          "score": 68,
          "created_utc": "2026-01-28 21:28:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2alypo",
              "author": "tevert",
              "text": "> Stand up is literally supposed to be done standing up. Each of the five members flags their blockers. No blockers? Stand up is thirty seconds long. \n> \n\nI'll soapbox a little and say that standup is for a daily plan, not for blockers. Blockers should be raised immediately, not saved for tomorrow morning. But your point is still good; a high functioning team can and should rip through standup in 2m if they stay true to the objective of the ceremony",
              "score": 24,
              "created_utc": "2026-01-28 21:38:34",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2ariow",
                  "author": "Abject-Kitchen3198",
                  "text": "No reason to stop communicating outside of the daily or changing anything in your way of working. Just try to get whatever value you can from it. Even if it's just stretching your legs to the standup place.",
                  "score": 8,
                  "created_utc": "2026-01-28 22:02:41",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o2akf2y",
              "author": "rdizzy1234",
              "text": "To clarify this real issue here is that we'e blocking off time on the calendar to do all of these things. If my boss just told me to \"create a retro document\" then I would have no problem doing that. He just genuinely wants up to spend an hour after every sprint discussing every feature that was shipped and what the \"learnings\" were",
              "score": 4,
              "created_utc": "2026-01-28 21:31:44",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2aqx6r",
                  "author": "lunivore",
                  "text": "Capture them in real-time. Put a \"Start, Stop, Keep doing\" board up and get everyone to contribute to it as things arise. It provides a better journal than trying to remember what happened two weeks previously.\n\nNow you already spent 1/2 hour on identifying the issues, and you can shrink the meeting.\n\nBonus: most teams who track issues as they arise get into the habit of addressing them as they arise too, and then the only ones left are the ones that you actually need your CEO's help with.\n\nOr you get to spend the retro celebrating what you did well and working out how to amplify it and spread it to other teams or make sure it keeps happening, which is the side of the retro that gets forgotten the most.",
                  "score": 11,
                  "created_utc": "2026-01-28 22:00:04",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o2cdbfl",
                  "author": "Jboyes",
                  "text": "Just do the retro off-site. A few rounds of drinks does wonders for a team.",
                  "score": 4,
                  "created_utc": "2026-01-29 03:03:12",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o2bufjp",
                  "author": "DallasActual",
                  "text": "Becoming good at doing retrospectives will pay more dividends to the team happiness than anything else you can do. Maybe give it a try before you decide.",
                  "score": 2,
                  "created_utc": "2026-01-29 01:19:49",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o2at01t",
                  "author": "ride_whenever",
                  "text": "If he wants theatre, have you considered tickets to the opera? \n\n\nI think you need to dive into the need behind this request, then point out the cost of these meetings - x% of development time, y% lost velocity, $z cost of those meetings",
                  "score": 1,
                  "created_utc": "2026-01-28 22:09:00",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2alf2u",
          "author": "squigfried",
          "text": "Use the term \"high performing team\" when referring to your engineering gang. Perhaps that's a buzzword that would satisfy your CEO.\n\nSprinkle some DORA metrics in there as well to prove how fast stuff moves through your pipeline and how few issues you have vs. the amount you deploy.\n\nPut some industry buzzword stamp on what you're doing and your CEO might get behind your way of phrasing your success?",
          "score": 10,
          "created_utc": "2026-01-28 21:36:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2apyag",
          "author": "skarfacegc",
          "text": "Not diving into the specifics of \"now\" as others have largely covered it.  Is your company growing?  What works for 5 folks won't necessarily work for 10, and it /can/ be better to have some of the growing pains dealt with before you start scaling.  Having some of the ceremonies established can pay off when there are multiple teams that need to coordinate. I really liked NeatEmergency725's take.",
          "score": 8,
          "created_utc": "2026-01-28 21:55:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2awc87",
          "author": "Mozarts-Gh0st",
          "text": "Love the product drop, Telos. C’mon! 👎🏻",
          "score": 4,
          "created_utc": "2026-01-28 22:24:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2ff1hz",
              "author": "Kenny_Lush",
              "text": "Well done!!! His history is basically a Telos ad.",
              "score": 1,
              "created_utc": "2026-01-29 15:43:31",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2awwto",
          "author": "tehdlp",
          "text": "I like scrum and agile, it helps guide teams when they aren't high performing or self aware. \n\n\nYou don't sound like you need it. For a 10 person company, bluntly tell the CEO it's going to slow down your high performers and frustrate them. Then ask how that will help keep the company moving in the successful direction it has.",
          "score": 3,
          "created_utc": "2026-01-28 22:26:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2d4yu2",
          "author": "evergreen-spacecat",
          "text": "Pace is not everything. Scrum isn’t even about maxing pace. Perhaps the boss wants you to stop and plan ahead with the team once in a while. It is not always a good idea to push fast if you run in the wrong direction.",
          "score": 3,
          "created_utc": "2026-01-29 06:05:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2apog7",
          "author": "trophycloset33",
          "text": "YOU are crushing it. \n\nYOU are not a process. YOU are not a growth strategy. YOU cannot do 5 jobs. \n\nAccept that this in your best interest.",
          "score": 5,
          "created_utc": "2026-01-28 21:54:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2b69f9",
          "author": "liquidpele",
          "text": "You say sure, but these are the trade offs for that.    Then let them decide with that information.   Usually they'll make the sane decision... if they don't even with the data and ability to ask more questions... then it's a sign that the startup is probably going to implode.",
          "score": 2,
          "created_utc": "2026-01-28 23:12:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2be8lt",
          "author": "mirageofstars",
          "text": "The thing with your team is you're reactive and ad-hoc.   \n  \nIf the CEO instead has things he wants to ship a quarter or two from now, that requires planning and tracking. However, that also lowers velocity (as you noted). If there isn't enough work to fill the next two quarters then there's no point in planning the next two quarters.\n\nMaybe talk with the CEO and figure out a compromise. Push back on the mid-sprint checkin, keep the stories lightweight, and do the standups over chat. Also get him to understand that output will go down.",
          "score": 2,
          "created_utc": "2026-01-28 23:54:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2c8gxd",
          "author": "agileliecom",
          "text": "yeah, I’ve seen this movie before... when a tiny team is shipping fast and suddenly leadership wants “proper sprints”, it’s usually not about helping the team. it’s about making the work look predictable and respectable from outside.\n\nwhat you describe sounds a lot like risk management theater. adding ceremonies so leadership / investors feel in control, even if the team already has zero coordination issues.\n\nprocess makes sense when communication breaks down. with 5 people who talk all day, adding 6h of meetings is just slowing things down so it looks more “serious”.\n\npushing back is hard because this is rarely a delivery discussion, it’s a perception one. the question is not “does this help us ship?”, it’s “what story do we want to tell in a board meeting”.",
          "score": 2,
          "created_utc": "2026-01-29 02:36:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2asom6",
          "author": "mrhinsh",
          "text": "This doesn’t sound like a coordination problem or a delivery problem. By your own description, you already have fast feedback, zero handoffs, and constant communication. That’s why you’re shipping so quickly.\n\nWhat your CEO is asking for isn’t really about “proper sprints”. It’s about making the work *look* legible and orderly from the outside. Two-week sprints, quarterly planning, extra check-ins, those are governance signals, not delivery improvements.\n\nThe risk is that you replace a system that’s currently learning in real time with startup theatre. Six extra hours of meetings for five people doesn’t create better outcomes when you’re already talking continuously. It just formalises conversations you’re already having and turns learning into reporting.\n\nCeremonies only earn their keep when they solve a real problem, usually decision latency, missing context, or misalignment at scale. You’ve explicitly said you don’t have those problems right now. Adding process in the absence of a constraint usually slows things down, even if it “looks right” in a board deck.\n\nIf this is about investors, the real question isn’t “are we running Scrum properly?”, it’s “how do we show evidence that we’re learning fast and delivering value?”. That can be done without bolting a heavyweight process onto a five-person team that’s already working.\n\nPushing back doesn’t mean being anti-process. It means asking which specific problem these ceremonies are meant to solve, and what evidence you expect to see improve.\n\nThat usually comes down to visibility questions like:\n\n* Can the CEO see what’s been delivered each Sprint?\n* Can stakeholders see it?\n* Is it actually in production?\n* Is there a clear way to show how what’s being delivered ties back to the overall business objectives?\n\nIf those answers are already “yes”, more ceremonies won’t fix anything. If they’re “no”, fix *that* instead of adding meetings.",
          "score": 4,
          "created_utc": "2026-01-28 22:07:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2blo6z",
          "author": "Brickdaddy74",
          "text": "Company is too small to do sprints. You want speed and you should do kanban.",
          "score": 2,
          "created_utc": "2026-01-29 00:32:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2bmcpr",
              "author": "theproductref",
              "text": "Interestingly I just published an article 12 hours ago about when to do scrum and when to do kanban. https://medium.com/the-product-ref/kanban-or-scrum-ed0703cab4f6",
              "score": 1,
              "created_utc": "2026-01-29 00:36:17",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2amag2",
          "author": "tevert",
          "text": "Are y'all tracking any kind of velocity number right now? Even if it's just \"features/month\", it might be fun to humor Mr. CEO for a couple sprints and then point to the chart that shows the exact expense of this decision.",
          "score": 2,
          "created_utc": "2026-01-28 21:39:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2azaw2",
          "author": "dastardly740",
          "text": "Don't be 90% sure it os abput investors. Be 100% sure. Have a heart to heart and in some ways treat him like a customer. His asks are a solution to some problem he is having. In a non-confrontational and supportive way, find out the underlying problem. The CEO and investors are stakeholders whose  needs should be satisfied much like customer stakeholders. Take the approach that you are trying to solve his problem with a minimum impact to the team's ability to deliver.\n\nI wouldn't be surprised if most of the problem is a visibility problem. Shipping faster than ever could mean he has less visibility into what is really happening, which makes it difficult for him to explain to investors how well things are going. And, shipping fast without industry standard practices makes investors who know a thing or 2 jumpy because they have seen a lot of shiny on the outside, rotten on the inside software get delivered fast that looks great right up until the rot accumulates enough that the whole thing comes crashing down. So, they are probably asking questions he can't answer, and this is his solution.\n\nOf course, the ceremonies don't really help that, but they create the illusions of control that make everyone feel better. \n\nSo, find out the real issues, and more than likely, there are common solutions that you can use to solve those while maintaining team effectiveness. Preferably, try not to invent it yourself because someone has dealt with the same problem and saying we are using this solution from (insert name here) is an easier sell.",
          "score": 2,
          "created_utc": "2026-01-28 22:38:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2bh8qx",
          "author": "FreshLiterature",
          "text": "Well, for one:\n\nA Scrum team should be between 3-9 people (or is it 8 now?), so your team size is about right.\n\nSecond, you're actually right. Scrum ceremonies are there if you need them. If you don't need them then don't use them.\n\nYou SHOULD have some kind of 3-6-12 month roadmap where 3 months is your 'delivery' window - the stuff you are 80% certain will be done.\n\n6 months are strategic bets that might get done.\n\n12 months out you're looking at more 'nice to have'. \n\nI don't know what your product is, but if you aren't a straight services company you should have a roadmap for your actual product. Being 100% reactive to customer calls is a really bad way to build a product.\n\nDaily standups are a good idea because it's how you get ahead of problems.\n\nChunking work into 2 week sprints is fine, but so is Kanban which is how your team is operating right now but you aren't using it.\n\nYou should have some kind of regular meetings to discuss the product. There is zero chance you have zero technical debt. If you go into your backlog and there is ZERO tech debt sitting there that's a red flag and you should probably stop work to check all of your systems.",
          "score": 2,
          "created_utc": "2026-01-29 00:09:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2cfe68",
              "author": "rousseuree",
              "text": "This - I’ve run scrum on a team of 3 engineers and it worked great. It’s guidelines for everyone on the team to independently follow, gives you quantitative metrics, helps project timelines based on velocity. Use Agile as a suggestion instead of a bible. Go with Kanban if that’s the style you need.",
              "score": 1,
              "created_utc": "2026-01-29 03:15:05",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2aphvm",
          "author": "m0strils",
          "text": "I also have a high performing team and we did not use the ceremonies.  Im in a safe org thriving despite safe.   I have people tell me the stand up needs to be 15 minutes. We will talk for an hour while we solution and ensure alignment. We recently switched to Kanban maybe you can investigate that.  Unless its helping the team dont do ceremonies just to do them. I think you will get some good information here and it sounds like you are on the right path.  Resist the process people doing process just because.   And pity them because they don't know any better",
          "score": 1,
          "created_utc": "2026-01-28 21:53:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ar7zn",
          "author": "clem82",
          "text": "Sounds like there isn’t even a problem they are trying to solve for",
          "score": 1,
          "created_utc": "2026-01-28 22:01:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2at9m5",
          "author": "Wndrunner",
          "text": "Look up kanban and kanban metrics. There’s fewer ceremonies and you can provide concrete metrics that can satisfy investors and the ceo.",
          "score": 1,
          "created_utc": "2026-01-28 22:10:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2azzep",
          "author": "LightPhotographer",
          "text": "Scrum is feedback loops and learning.\n\nFor example. If a team hates doing refinements (grooming) I always tell them \"you are going to have the discussion about what the customer wants anyway\".  \nSame goes for planning what you do.\n\nScrum just gives you a structure for doing it but if you guys work better doing it on the fly ... you do you!  Scrum just says that those conversations are essential, but if you have them outside a planned meeting... who cares?\n\nIf you want, take either the time or a chatbot to get what every meeting (ritual) is supposed to bring/deliver for your team. If you're doing as well as you say you do, you guys have found a form to do all of these.\n\n\"People and interaction over processes and tools\"  it sounds like your boss wants to force a process without recognizing that it is already happening. Your team has self-organized to do their own process and it works.  Your boss is putting a process before the actual people and their interaction.",
          "score": 1,
          "created_utc": "2026-01-28 22:41:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2b1s86",
          "author": "Budget_Pin5828",
          "text": "1. Have you asked for the business case or the benefit hypothesis for mandating scrum? If you know understand the goal, you might be able to counter offer, negotiate, or talk them out of it. It sounds like you assumed it was about speed. It could also be about value or visibility or quality. I doubt its the investors or the board. Those people tend to either not know or not care about Agile or Scrum or Sprints\n2. When he passed down the mandate did you articulate risk and impact? Or did you walk him through current state process. Your post reads like the latter. If you can articulate risk and impact in dollars, that has punch. Did you present current state data and ask for feedback on which they are looking for improvement?\n3. Experimentation is an Agile like theme. So embrace the Agile experiment. Then use the data (empiriciscm) to demonstrate if agile is or isnt working. \n4. The ceremony cadence is meant to replace other meetings. So before adding the cadence to calendars, do a calendar scrub and remove any duplicates or can be tangentially derived for a scrum event. For example, status report meetings could go away. ",
          "score": 1,
          "created_utc": "2026-01-28 22:50:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2b6115",
          "author": "Pressondude",
          "text": "Im confused why this needs to take 6 hours. And fwiw you shouldn’t assume your CEO is clueless or that this is being done to appease other similarly clueless people. You should consider that the concern might be that there isn’t a process right now. How is this well oiled system going to scale? Is there some sort of plan for the future of the product? What is the plan? How is your current work actually tracked/planned now, kanban? \n\nEither way, figure out what your ceo needs from you, the same way you wouldn’t let a customer dictate the solution don’t let the ceo dictate the solution, figure out the value they need and then work backwards from that.",
          "score": 1,
          "created_utc": "2026-01-28 23:11:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2bevng",
              "author": "mirageofstars",
              "text": "Yep. My thoughts on this (based on OP's description) is that they are a rapid triage team, but if you asked them what they're shipping in Q2 and Q3, the answer would be a shrug. That's not a bad thing, but I suspect the CEO's needs have changed. Ceremonies don't have to take long.",
              "score": 2,
              "created_utc": "2026-01-28 23:57:37",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2cxmgd",
                  "author": "Pressondude",
                  "text": "That’s what I’m thinking, that OP isn’t adequately communicating either what was done or what is planned. I don’t doubt OP is shipping value but the ceo needs to be able to tell a story. I worry from the tone OP doesn’t think that’s very important.",
                  "score": 1,
                  "created_utc": "2026-01-29 05:10:40",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2bd667",
          "author": "99ProllemsBishAint1",
          "text": "For high performing teams I'm big on \"give the teams what they're asking for and get the f out of their way\" but there really is value in at least minimal ceremonies and artifacts. A lot of times the benefit is more visibility into what's going on from the CEO's level and more confidence that poor behavior or bad habits aren't being tolerated in the name of quick delivery. You can't scale well if you have that.\n\nThe minimal version of what he's asking for is pretty inexpensive when you have high performing, well communicating teams. If he really does insist on things like painfully long retros, have him join and he'll see expensive resources with nothing more to say after 10 minutes. Or quantify the throughput impact of the ceremonies and explain the cost of context switching on quality and velocity.",
          "score": 1,
          "created_utc": "2026-01-28 23:48:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2bemck",
          "author": "zero-qro",
          "text": "Your CEO most likely have no idea of what he/she are talking about. Can you just rename some activities that you already do using Scrum terms?\nLike, discussing a feature with engineers, when you explain what this is about, call it 'grooming'. When you order the next item to be developed, call it 'Planning' and so on...\nThese people only want to feel in control without having any knowledge of what they are 'controlling'.\nIt's like dealing with a baby who wants milk, but it's no really hungry. Give him/her a pacifier.",
          "score": 1,
          "created_utc": "2026-01-28 23:56:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2bf3em",
              "author": "zero-qro",
              "text": "After reading some of the replies, it seems people are trying to teach you how to do this stuff...\nGuys, the OP isn't looking for guidance of how to run a retro or a planning session.\nThe OP clearly doesn't need it, you are missing the point here.",
              "score": 1,
              "created_utc": "2026-01-28 23:58:43",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2bihrv",
          "author": "Triabolical_",
          "text": "Here's what I would do...\n\nCome up with some statistics that measure what I want to measure - things like \"time spend coding\", \"time spent in meeting\" - and document them for the last few cycles. \n\nThen do \\*exactly\\* what your CEO is asking for - and maybe ask your team to back off a little bit - and collect the statistics for the next few cycles.\n\nSurprise ! Spending 15% on overhead slows you down. \n\nI might also do a little to come up with a more rigorous backlog, since you have multiple customers. That is a good thing in general when you have multiple customers and will give the CEO better talking points on what you are working on. That's a totally reasonable ask.",
          "score": 1,
          "created_utc": "2026-01-29 00:16:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2bs5hm",
          "author": "Longjumping_Hawk_951",
          "text": "It's not called grooming anymore btw. But honestly, outside of the \"pre-refienment\" which isn't real because you can have infinite amount of refinement sessions in a sprint (time alotted), it's not that much overhead to do sprint ceremonies. ",
          "score": 1,
          "created_utc": "2026-01-29 01:07:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2bu2rz",
          "author": "DallasActual",
          "text": "I tend to doubt that investors care about agile process hygiene, so perhaps there's another reason. Asking what benefit the CEO wants from the \"upgraded process\" might reveal a need you can meet in another way.\n\nYou're an engineer; you should be used to solutions masquerading as requirements. Find out what's really wanted and see how the team can deliver it.\n\nIt probably has to do with roadmap vision and mid- to long-term timelines to convince investors of the big, bright future.",
          "score": 1,
          "created_utc": "2026-01-29 01:17:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2c521y",
          "author": "WaylundLG",
          "text": "I would definitely push back. You're a small company, so I hope it's easy to have a conversation. Maybe something like \"we're running really smooth and fast. I want to understand what we want to do and what we're looking to improve so we don't mess up what's going well and not get the benefit because we just did what we thought you were asking for\". \n\nAlso, most of those things aren't scrum. Sprint planning, review, retro, daily scrum, that's it. Refinement is an activity that it sounds like you already do. If he wants to look good for investors, that's a pretty legitimate need for a startup, but you can meet that with some documentation pretty easily.",
          "score": 1,
          "created_utc": "2026-01-29 02:18:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2chl1t",
          "author": "teink0",
          "text": "\"Following a rigid set of rules limits your performance to that of a novice\" - Andy Hunt, creator of Agile. \n\nYou can level with both the team and superiors that the outcome of Scrum is half the work in twice the time. \n\nYou can also get their honest opinion. Do you want our organization to go the way of Skype, who prescribed solutions looking for a problem such as Scrum? Or would you rather go the way of Whatsapp, who used no prescribed process and actually solved real problems.",
          "score": 1,
          "created_utc": "2026-01-29 03:27:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2cqgtb",
          "author": "sirseatbelt",
          "text": "Start doing proper configuration management and development processes when you are small, and when you are big they will be habits and not radical culture shifts. And then when the cyber team calls you up and asks how you do CM you will have an answer.",
          "score": 1,
          "created_utc": "2026-01-29 04:22:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2cw9d8",
          "author": "negotiationtable",
          "text": "Have you asked him what problem he is trying to solve?",
          "score": 1,
          "created_utc": "2026-01-29 05:01:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2cy1tm",
          "author": "Scannerguy3000",
          "text": "Those things you listed, that’s not Scrum. Tell him it would be a great place to start, for everyone to sit down together and read the Scrum Guide. It takes 20 minutes.",
          "score": 1,
          "created_utc": "2026-01-29 05:13:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2cz8wt",
          "author": "TheSauce___",
          "text": "Maybe talk him down to Kanban? Sounds like it would align with your existing workflow, add the structure and visibility the CEO is looking for, while also being minimally disruptive.",
          "score": 1,
          "created_utc": "2026-01-29 05:22:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2d9pad",
          "author": "Fishferbrains",
          "text": "As proud as you are of the team 'crushing it' and 'shipping stuff fast,' there's some further situational awareness necessary. \n\nIf investors start appearing, the interest could be from the investors themselves or from the CEO positioning **himself (by his involvement) and the team** in the best possible light. \n\nTo help him, I'd begin with questions to explore his primary needs/focus within the process\n\n* Is it related to the product **vision** and progress within the roadmap?\n* Is showing the delivery of customer/competitive **value** a concern? \n* Is there a concern about gaining market traction, attracting new customers, and improving usage? \n* Does it involve capturing moments during a retrospective to identify areas for improvement?  Would it be worthwhile to share the continuous improvement mindset that got the team optimized?  \n* Would everyone be able to answer my favorite question: \"What and how does the team celebrate success?\"\n\nYour description of \"listening on customer calls, turning mock-ups and requirements to engineers, and shipping stuff\" is both impressive and could raise concerns such as:\n\n* How big is the problem being solved? What challenges does the product team face in realizing the vision?\n* Why does it appear as if the team is focused on stabilizing/servicing a small group of captured customers? Is the team postponing major categories of effort such as infrastructure, compliance, monetization, etc.\n* Does a small team indicate that the product market is a small gap or is it a major area for growth, acquisition, or opportunity?\n* How would an investment scale the product to compete further and grow?",
          "score": 1,
          "created_utc": "2026-01-29 06:43:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2dhp9r",
          "author": "nikosx85",
          "text": "As it usually happens with agile transformations in the age of AI, 1 step forward 100 steps backward.",
          "score": 1,
          "created_utc": "2026-01-29 07:52:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2diaia",
          "author": "Feroc",
          "text": "Ask your CEO for the problem, not for the solution.\n\nEven CEOs usually don't be like \"Everything works great, please change something!\" Shipping fast is one thing, shipping the right thing something else.",
          "score": 1,
          "created_utc": "2026-01-29 07:57:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2dkouh",
          "author": "brain1127",
          "text": "First of all, your boss wants you to run Scrum. Second, why? Third, do you have equity in the company?",
          "score": 1,
          "created_utc": "2026-01-29 08:19:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2e8n0j",
          "author": "cliffberg",
          "text": "Inform the CEO that Scrum is NOT based on any research, or any theory that is recognized by people who study team performance; and it was created by this guy: [https://www.frequencyfoundation.com/about-us/](https://www.frequencyfoundation.com/about-us/)\n\nIt only became popular because they offered easy certifications shortly after the Agile Manifesto was published, and claimed (falsely) that \"Scrum is Agile\".\n\n[https://cliffberg.medium.com/scrum-was-unethical-from-the-start-96eedd0679ca](https://cliffberg.medium.com/scrum-was-unethical-from-the-start-96eedd0679ca)",
          "score": 1,
          "created_utc": "2026-01-29 11:51:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ekwem",
          "author": "alias4007",
          "text": "Do you have any sense of what \"business value\" the CEO is trying to add?",
          "score": 1,
          "created_utc": "2026-01-29 13:12:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2gm1rk",
          "author": "Tricky_Present7464",
          "text": "Nice ad.\n\n  \nThat's a great strategy. Start a conversation about shipping fast, and then edit the post to add your app into it. ",
          "score": 1,
          "created_utc": "2026-01-29 18:55:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2gvfy5",
          "author": "gralstin",
          "text": "Your CEO does not need ceremonies, he needs metrics. I suggest you give him your “idea to production time frame” and he will be pleased. \n\nIf he perhaps gets stuck on processes, just tell him that you are working “pure agile and close to the customers”. \n\n Best of luck!",
          "score": 1,
          "created_utc": "2026-01-29 19:40:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2idvpk",
          "author": "run_bike_run",
          "text": "Hey, u/rdizzy1234 \\- you say you don't normally share tools, so how come you have a link in seemingly every post to what you recently described as \"your own product\"?",
          "score": 1,
          "created_utc": "2026-01-30 00:10:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2kfm9p",
          "author": "peterg73",
          "text": "Great. What if you’re moving fast in the wrong direction?",
          "score": 1,
          "created_utc": "2026-01-30 08:02:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2alji6",
          "author": "diseasealert",
          "text": "My guess is that your CEO wants to show investors that the company has a plan and that you are able to execute that plan. Investors often tie their investment to milestones. They are so far removed from operations that this is all they care about. This might be addressed with an initial roadmapping exercise and some maintenance thereafter. If you are doing any prioritization work with the CEO now, this should dovetail with that.",
          "score": 1,
          "created_utc": "2026-01-28 21:36:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2aq6j3",
          "author": "robhanz",
          "text": "I love all of these mandatory scrum things that weren’t in scrum when it was developed. \n\nGuess the consultants gotta get paid.",
          "score": 1,
          "created_utc": "2026-01-28 21:56:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2avrw9",
              "author": "teddytoosmooth",
              "text": "I always laugh at refinement being labeled a scrum event. It’s not. Backlog refinement is continuous. Dedicated time is helpful but far from a requirement. ",
              "score": 3,
              "created_utc": "2026-01-28 22:21:33",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2f9cp5",
                  "author": "robhanz",
                  "text": "One of the interesting things I find is that agile wants you to *think*, a lot.  And some people try to push that out of the process.",
                  "score": 1,
                  "created_utc": "2026-01-29 15:17:51",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o2hs5qw",
                  "author": "basilray",
                  "text": "The number of times people talk about refinement like it's a scheduled event that happens behind closed doors hurts my brain.\n\nThen again, I'm in a weird spot where I'm half-time program leader and half-time PM/PO. I rely on my devs to write a lot of stories and I use JIRA automations to help track them. Refinement often is me adding the details my dev team can't be bothered with to stories for historical record while they crush work.",
                  "score": 1,
                  "created_utc": "2026-01-29 22:16:34",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2eyt31",
          "author": "Consistent_Voice_732",
          "text": "Agile ceremonies are supposed to reduce friction. If they're adding hours of meetings to a team that's already shipping fast, that's not maturity- that's cargo cult agile",
          "score": 1,
          "created_utc": "2026-01-29 14:26:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2fva37",
              "author": "rdizzy1234",
              "text": "Exactly what I'm saying",
              "score": 2,
              "created_utc": "2026-01-29 16:55:43",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2aogkb",
          "author": "PhaseMatch",
          "text": "Sounds like he only has a woolly idea of what Scrum is for and how it helps him to manage business risk.\n\nWhich is fine, and also an opportunity if you want to take it.\n\nSprints are release stage gates.  They are when you look at \n\n- the product so far\n- what you learned about the market\n- what you measure im terms of value\n\nand decide if you should\n\n- keep following your business roadmap\n- pivot towards a new market\n- dirch the product and work on something else\n\nSo it provides strategic control over the o gping investment risk.\n\nWhich might be what the CEO needs...",
          "score": 0,
          "created_utc": "2026-01-28 21:49:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2bu264",
              "author": "808Adder",
              "text": "Sprints are not release stage gates. The team should deliver one or more increments during the sprint. There is no reason to synchronise releaes with the sprint, it should be continuous delivery.",
              "score": 2,
              "created_utc": "2026-01-29 01:17:43",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2bx647",
                  "author": "PhaseMatch",
                  "text": "Quite so.\n\nBut the Sprint serves as your control on investment risk and business strategy.\n\nYou invest one Sprint at a time, and then see what you now know about the product and market.\n\nScrum tells you very little about flow of work (Kamban) or \"build quality in\" (XP), you generally need to add those things in too.\n\nBut if the OP is right and this is what investors want to see - as key stakeholders - to manage their business risk, it might be a good idea.\n\nEspecially if you are not profitable and reliant on investors money to stay in business and get paid.",
                  "score": 2,
                  "created_utc": "2026-01-29 01:35:03",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2ayli1",
          "author": "paul_h",
          "text": "How many planned releases do you do a year for the 5-person-team app or service? 4, 12, 52, 104, 270, more? Don't count unplanned bug-fix-releases that follow planned releases in that count. \n\nI ask cos I've observed lots of agile teams over 23 years. In 2000-2005 if a team is planning a weekly release, they were likely doing eXtreme Programming (XP), By 2005 Scrum was winning over XP and we saw often saw two-week intervals between planned releases. Add ten teams and some scrum teams were doing three weeks between planned releases.  Team that gravitated toward shorter release cadences would talk of Kanban more so than XP. Safe was a huge thing. More than ten years back SAFe and Less would often (not always) observe 2-week sprints within 4 to 6 week releases and be able to have 20-60 teammates subdivided across tiers/services/apps.\n\nYour boss might be used to one of those longer realities from their past, and simply want to re-implement it. Not saying its right, I miss my XP team of 2003/4.",
          "score": 0,
          "created_utc": "2026-01-28 22:34:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ce0aj",
          "author": "Affectionate-Log3638",
          "text": "Hate to be that guy, but this isn't agile. Quarterly planning, mid-sprint check-ins. It's waterfall in (a terrible) disguise.",
          "score": 0,
          "created_utc": "2026-01-29 03:07:09",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qq30ev",
      "title": "Any backlog management tools you guys can recommend me? Im lost…",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1qq30ev/any_backlog_management_tools_you_guys_can/",
      "author": "SalamanderFew1357",
      "created_utc": "2026-01-29 08:25:10",
      "score": 12,
      "num_comments": 14,
      "upvote_ratio": 0.83,
      "text": "we are a team of 8 devs and we keep reinventing the wheel for standard tasks. every time someone starts work on a new api endpoint or a database migration, we have to manually create the same 5–7 subtasks write code, write tests, update swagger, update internal wiki, run security scan, etc. and then remember who to assign the documentation bits to.\n\nim looking for a backlog management tool that can:  \nlet me create a library of templates for these common work item types  \nwhen i create a new item and select api endpoint, it auto generates all the subtasks with pre filled checklists or descriptions  \ncrucially, auto assign those subtasks based on role. the update swagger subtask should go to our rotating api doc person, and the security scan subtask should go to our devops lead  \nright now we use trello with a ton of manual copying, and its error prone. we need something more structured but not as heavyweight as full blown jira with a ton of setup.  \nwhat tools are you using to solve this does anything handle the dynamic role based assignment well, or is that still a pipe dream?\n\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1qq30ev/any_backlog_management_tools_you_guys_can/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o2dqiu6",
          "author": "Devlonir",
          "text": "Non agile teams have tons of waterfalling tasks that people love to hand over and nobody wants to own. This is what you describe.   \n  \nAnd your asked for solution is: automate the waterfall.  \nYou don't need a better tool, you need better processes to make your team take ownership.\n\nThe most mature teams have 1 task: Deliver change. The ones responsible take ownership over all needed for it. Subtasks only get added for blockers or issues that arise that need input.\n\nWhen your team is not multi disciplinary enough transition can be done by reducing sub tasks to only those entirely necessary, but that create clear ownership of whole blocks of the process needed for delivery. For example: Dev, Test, Doc, Deliver.   \nAnd then only add tasks for specific blockers or issues that arise somewhere in the change. So do not split the Dev down to specific tasks. This is the start of waterfalling.\n\nTransition will never happen when you try and smoothen out the waterfall and just focus on better facilitating the handovers. Transition happens when the team realises they own the solution together.",
          "score": 11,
          "created_utc": "2026-01-29 09:14:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2gfr0i",
              "author": "PhaseMatch",
              "text": "**\"And your asked for solution is: automate the waterfall.\"**\n\nBullseye;  was trying to find the phrasing but you are spot on.",
              "score": 2,
              "created_utc": "2026-01-29 18:27:34",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2do3ix",
          "author": "flamehorns",
          "text": "You don’t need templates or a whole bunch of auto generated subtasks you just need a definition of done I think.\n\nThe subtasks should be minimal and just for the story specific non-standard tasks ie maybe based loosely on acceptance criteria? \n\nYou still need a tool, and I agree you need something better than trello but lighter than jira. But I don’t really have a concrete recommendation. The other tools I have used are heavy like jira.\n\nJira would work, but I wouldn’t do much set up, I would just use it out of the box and keep things simple.",
          "score": 8,
          "created_utc": "2026-01-29 08:51:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2em4nb",
          "author": "shortstraw4_2",
          "text": "My team uses trello boards in Kanban. You can create columns for workflow (backlog, in progress, peer review, published ect) and cards can be templated to quickly generate tickets, user stories etc. I don't know the cost but I think there's a free version.\n\nIf your in the Microsoft ecosystem I've seen folks use planner in a similar way...",
          "score": 5,
          "created_utc": "2026-01-29 13:19:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2dzkjz",
          "author": "WideFunction6166",
          "text": "Create a project in chatgpt or your favorite LLM.  Include a template file.  Generate stories there using the template as a guide. Store the output specs in a word doc or whatever yu like and put a link for the word doc in the trello item.  These steps seem prety well defined.  A task board might hep clear up who is assigned to what",
          "score": 3,
          "created_utc": "2026-01-29 10:37:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2fiw5l",
          "author": "No_Wave_3579",
          "text": "Trello",
          "score": 3,
          "created_utc": "2026-01-29 16:00:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2hjbqv",
              "author": "analyteprojects",
              "text": "I agree, for simplicity and lowest cost, I'd probably start with Trello.",
              "score": 1,
              "created_utc": "2026-01-29 21:34:19",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2er0my",
          "author": "bulbishNYC",
          "text": "Don’t create any subtasks. Everything under one ticket. Let developers coordinate effort themselves. You are doing way too much paperwork. Who is responsible? The team. Then at retro: Team, why swagger was not done for this ticket, why unit tests missing for this one? Simple. They do not need to be babysat, they are capable highly paid adults.",
          "score": 3,
          "created_utc": "2026-01-29 13:45:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2dt8sr",
          "author": "Any_Side_4037",
          "text": "We set up templates with predefined subtasks and role assignments, and it cut manual work massively, makes creating new items almost automatic and keeps nothing slipping through the cracks.",
          "score": 2,
          "created_utc": "2026-01-29 09:40:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2e5pim",
          "author": "frankcountry",
          "text": "Creating all those tasks is so 2000.  \n\nYou don’t mention how long it takes your team to complete all those.  Can more than one team member work on a story at a time?   If it’s only a few days then leverage the definition of done.\n\nYou can also jig the columns of your scrum board to account for those tasks.  **But not one to one.**  Visualize, together with the team, the lifecycle of a piece of work, at each step what are the outcomes you’re looking to achieve, what can be bundled?  ",
          "score": 2,
          "created_utc": "2026-01-29 11:28:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2hpzys",
          "author": "easy-agile",
          "text": "This sounds like a process standardisation problem more than a backlog tool issue. The teams I work with who solve this well usually tackle it in two stages.  \n  \nFirst, they build their templates and checklists directly in whatever tool they're already using for work tracking (Jira, Azure DevOps, Linear or whatever else they use). There you can create issue templates with predefined subtasks and assignees. The key is making these templates specific enough to be useful but flexible enough that people actually use them instead of working around them.  \n  \nSecond, and this is the bigger win, they may automate the routine stuff. Instead of manual subtasks for \"run security scan\" or \"update swagger\" they build that into their CI/CD pipeline. The documentation updates and wiki changes become part of their definition of done that gets checked automatically or prompted during code review.  \n  \nThe backlog tool becomes less important when you're not manually tracking repetitive process steps. Teams get much better velocity and consistency when they focus on automating the predictable bits rather than just tracking them better.",
          "score": 1,
          "created_utc": "2026-01-29 22:06:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2n9znm",
          "author": "Hillaoi_Clinton",
          "text": "Jira cloud automation has the ability to auto generate sub-tasks. You can set it to be based on a component of the story or a manual trigger based on issue type.",
          "score": 1,
          "created_utc": "2026-01-30 18:13:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2eckwn",
          "author": "vanMyst",
          "text": "Hey there!\n\nStraight up want to give you props for seeing a problem your team is having and solving systematically to make the whole team better and improve and speed up the flow of value y’all deliver. 👏🏾💨👏🏾💨👏🏾\n\nThere’s also some good thought happening here around what could be Definition of Done versus individual tasks for a User Story. However, you’ll still need to solve for making the work visible at some point, and if you all aren’t located in the same office, that tool needs to be digital.\n\nPart of my checkered past is solving for work management solutions - specifically agile, scaled agile, asynchronous and autonomous team collaboration (“ride a horse 🐴, save a meeting 📆…”). I’m not selling you anything - I’m just passionate about this space). The trick is to not over-engineer and solve for every possible use case, but to start simple, cost effective, and consider scalability.\n\nCouple questions:\n1. Do you guys have a budget for tools or do we need to work with free and/or tools you already have?\n2. Do you have dependencies on other teams that track their work in different tools?\n3. If so, what tools are those?\n4. If no, would they be open to tracking their work that you’re dependent on in your solution?\n\nWe’ll start there. That will give us just enough information to pick a path.\n\nFeel free to DM but I’m happy to work with you on this. I happen to have some free time on my hands and I enjoy creating solutions that support agile teams… as well as helping fellow agile trench-mates : iron sharpens iron 😁\n\nCheers!\nMysti",
          "score": 1,
          "created_utc": "2026-01-29 12:18:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2dto7u",
          "author": "Difficult_Knee_1758",
          "text": "once we got templates with auto subtasks and assignments going it made life so much easier.",
          "score": 0,
          "created_utc": "2026-01-29 09:44:15",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qo9zs1",
      "title": "how do teams surface production issues back into the backlog?",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1qo9zs1/how_do_teams_surface_production_issues_back_into/",
      "author": "SalamanderFew1357",
      "created_utc": "2026-01-27 10:13:51",
      "score": 11,
      "num_comments": 12,
      "upvote_ratio": 0.93,
      "text": "alerts fire, incidents happen, but getting that info back into planned work is messy. how are you handling this with proper backlog management?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1qo9zs1/how_do_teams_surface_production_issues_back_into/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o1zqlog",
          "author": "negotiationtable",
          "text": "It would be interesting to know why it seems to be messy - what specifically is happening and what mess is created as a result",
          "score": 5,
          "created_utc": "2026-01-27 10:25:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1zqrno",
          "author": "Any_Side_4037",
          "text": "Production issues are only useful if they make it back into planning. Some teams automate the process in monday dev so incidents become backlog items with ownership and priority, keeping the backlog aligned with reality instead of just plans.",
          "score": 2,
          "created_utc": "2026-01-27 10:26:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o201mud",
          "author": "ninjaluvr",
          "text": "Product Owner and Product Manager weigh the priority of upcoming features and decide. If you've exhausted your error budget, your error budget policy should dictate prioritization of reliability fixes.",
          "score": 2,
          "created_utc": "2026-01-27 11:56:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o205mf4",
          "author": "percomis",
          "text": "I would handle it like technical debt, priority based on impact/likelyhood of the incident. If you do sprints, carve out space for technical debt in each.",
          "score": 1,
          "created_utc": "2026-01-27 12:25:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o20m1xn",
          "author": "Pyroechidna1",
          "text": "It’s messy for me because our dev teams are laid out in a way that makes it impossible to tell who owns a given bug",
          "score": 1,
          "created_utc": "2026-01-27 14:00:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o20pzuo",
              "author": "Fragrant_Contact_100",
              "text": "How’s your communication?  What type of cross functional discourse do you have?",
              "score": 1,
              "created_utc": "2026-01-27 14:20:47",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o2115v4",
              "author": "WaylundLG",
              "text": "It seems like you have the answer to your problem. One of the biggest challenges I see with teams trying to become more agile is that they assume things are fixed that aren't,  like team design.",
              "score": 1,
              "created_utc": "2026-01-27 15:15:15",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2139fz",
          "author": "dgmib",
          "text": "This smells more like a symptom of a deeper problem.",
          "score": 1,
          "created_utc": "2026-01-27 15:24:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o23wy4p",
          "author": "easy-agile",
          "text": "We see teams faceplant into this constantly. Production issues show up like uninvited guests and trash your sprint because there's no process beyond panic and guilt.\n\nTeams that handle it well have one secret: just because something's broken doesn't mean it gets to cut the line.\n\nWhen alerts fire, someone (RIP to whoever's on \"interrupt handler\" duty this week) creates tickets but doesn't automatically yeet them into the current sprint. Instead, they go through actual prioritisation: either at the next refinement or through a quick \"is this genuinely burn-it-all-down urgent?\" chat.\n\nWhat works: A dedicated swim lane/label for production issues - visible but contained. Team eyeballs the impact and decides if it needs to blow up the sprint right now or can wait.\n\nWhat makes everyone cry: Production issues getting lobbed straight into the sprint with zero discussion about what they're displacing. It's like adding passengers to an already-full bus and acting shocked when it breaks down",
          "score": 1,
          "created_utc": "2026-01-27 22:54:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o27wpu1",
          "author": "3sc2002",
          "text": "Plan for the \"unplanned\".  If your team does \"40\" points a week, set aside \"8\" points for unplanned work.  Have regular stories \"planned\" for those \"8\" points, but as a \"stretch goal\".  This way if any unplanned work comes up, you have space for it.  If no unplanned work comes up, you will hit your \"stretch goal\".  \n\nMake sure to communicate this far and wide, as it puts your sprints under a different lens.\n\nQuotes as your numbers may vary.",
          "score": 1,
          "created_utc": "2026-01-28 14:28:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o29k1n2",
          "author": "Internal-Alfalfa-829",
          "text": "In the moment, add the story/bug to the Sprint and go. (Have the PO) figure out which pre-existing item on the Sprint backlog is deprioritized in its favor.\n\nThis is an expected thing that will always happen. Therefore, it's part of the plan from the outset.\n\nGoing forward, you can pre-allocate a defined percentage of capacity for production issues (\"support\" story or plan x percent below available velocity/capacity on purpose). If the buffer remains unused near the end of the sprint, pull another Ready item from the Backlog.\n\nThat's pretty much all there is to it.",
          "score": 1,
          "created_utc": "2026-01-28 18:50:57",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qod0wj",
      "title": "How accurate are AI meeting summaries compared to what actually happened",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1qod0wj/how_accurate_are_ai_meeting_summaries_compared_to/",
      "author": "Fancy_Bodybuilder697",
      "created_utc": "2026-01-27 12:53:21",
      "score": 9,
      "num_comments": 21,
      "upvote_ratio": 0.74,
      "text": "I rely on my ai meeting summaries pretty heavily at this point. Like, I trust them enough that I often don't even review the full transcript anymore.\n\nBut every once in a while I'll read one and think wait... that's not really what we decided.\n\nThe factual stuff is usually spot on. Names, dates, specific numbers that got mentioned. All captured correctly.\n\nBut the nuance gets lost sometimes. Like the summary might say \"team agreed to move forward with option A\" when really the actual conversation was more like \"team is leaning toward option A but wants to think about it more before committing.\" That difference matters a lot.\n\nStarted doing a quick skim of summaries right after calls to catch these. Takes maybe 2 minutes and I've caught a few things that would've caused confusion later if I'd just sent the summary without looking.\n\nHow much do you trust your ai summaries? Do you actually verify them or just assume they're close enough and move on?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1qod0wj/how_accurate_are_ai_meeting_summaries_compared_to/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o20ha63",
          "author": "Fragrant_Contact_100",
          "text": "As a BA/PM I use AI to summarize so many of my meetings.  Not a single summary goes out unedited by me.\n\nKinda feel like it falls into the old 80/20 rule.  80% of it is spot on, the other 20% could be anything from misidentified nuance to outright conjecture that needs to be removed.\n\nSaves me hours each week of converting notes to summaries.",
          "score": 9,
          "created_utc": "2026-01-27 13:35:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o20oe2h",
              "author": "omgFWTbear",
              "text": "It’s the old “the junior tried real hard but at the end of the day, a senior should make sure some nuance isn’t lost.”\n\nI had a gig where the transcription AI absolutely murdered initialisms, and our org was rife with cross functional teams / input, so virtually every third sentence had two initialisms.\n\nFortunately that *tended* to be a CTRL+H exercise, but every now and then someone’s preference for how to “word” an initialism would mix things up.",
              "score": 5,
              "created_utc": "2026-01-27 14:12:40",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o20i4rl",
          "author": "Budget_Pin5828",
          "text": "I still take notes manually alongside my AI.  And I use my AI to summarize. AI cant pick up things like the look on someone's face when they said something. It cant pick up 'subtext' or 'subtleties'. It cant pick up if someone is behaving differently or unusual. \n\n\nNothing produced by AI leaves my hands without a thorough review by a human.",
          "score": 5,
          "created_utc": "2026-01-27 13:40:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o20uhwo",
          "author": "blackcompy",
          "text": "Somewhat accurate, but not very. It's basically like a motivated intern - great at typing things, not great on contextual understanding or nuance. It's fine for general meetings and tracking information for later, but I wouldn't base a customer contract on it.",
          "score": 4,
          "created_utc": "2026-01-27 14:43:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o20hf7u",
          "author": "Kenny_Lush",
          "text": "No one listens in the meeting - they certainly aren’t going back to read about it. The “meeting notes” are digital garbage from the instant of creation. How is accuracy an issue? We use it for that very reason - so no one has to take notes that no one cares about.",
          "score": 4,
          "created_utc": "2026-01-27 13:36:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o20qilz",
              "author": "AlanOix",
              "text": "Honestly this. My hot take is that most meetings can be summarized by one sentence, and If people cannot remember what was said, then it was not that important to begin with.  \n\nIf it is important but so complex that no one can remember all the details, then AI should not be involved, because if it is not clear in your head, AI might lead you to \"remember\" inaccuracies.\n\nIf you want to have a list of actionables at the end of the meeting, just take 5 minutes at the end to make sure everyone knows what they should do.",
              "score": 3,
              "created_utc": "2026-01-27 14:23:25",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o20v2vl",
                  "author": "Kenny_Lush",
                  "text": "Exactly. Our dailies are mandated from above, so we use the time to bullshit and maybe raise those one-line issues and questions. The ai transcript goes to the facilitators garbage folder.",
                  "score": 2,
                  "created_utc": "2026-01-27 14:46:02",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o22cfn9",
              "author": "BoBoBearDev",
              "text": "My meeting summary is, the same shit we have been doing for every single sprint planning. Or today's standup meeting shows everyone is on track, okayyy. Or, today's UX meeting, the conclusion is, wait for UX team to update the markup.",
              "score": 3,
              "created_utc": "2026-01-27 18:40:28",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o22dhor",
                  "author": "Kenny_Lush",
                  "text": "Lol. My favorite is when someone goes down a list of tickets and the invariable response to each is “no update.”",
                  "score": 3,
                  "created_utc": "2026-01-27 18:44:54",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o20ns4z",
              "author": "omgFWTbear",
              "text": "On the one hand, it’s intensely rare that I find anyone cares about the notes, wholesale.\n\nOn the other, \n\n(1) when we do, it’s usually the whole thing as a root cause analysis on when where and who began a disaster\n\n(2) more commonly, someone refers to the notes because they forgot *something* often enough.\n\nSo in the old days, whole meetings dedicated to which verb accurately captures the real feeling … clearly a waste based on the return. But, a 2 minute skim to make sure the notes reflect the gist, a value.",
              "score": 1,
              "created_utc": "2026-01-27 14:09:34",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o20pkmw",
                  "author": "Kenny_Lush",
                  "text": "Ah, true - it is a smoking gun when someone deserves a beating. \n\nI’ve always been siloed, so any consensus is a matter of indifference.",
                  "score": 1,
                  "created_utc": "2026-01-27 14:18:40",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o268a2y",
              "author": "Cultural-Ambition211",
              "text": "Most likely, but only until you have a meeting where you desperately need to know if you were told X rather than Y so you can cover your own arse.\n\nIn those situations you need an accurate representation of what happened. AI summaries have taken me from having next to no notes for most meetings to comprehensive notes for all.",
              "score": 1,
              "created_utc": "2026-01-28 06:56:51",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o20c5lc",
          "author": "sweepers-zn",
          "text": "Good for details of the conversation and rationale for decisions. Actual decisions and actions I would write down myself and have attendees agree on the wording during the meeting.",
          "score": 1,
          "created_utc": "2026-01-27 13:07:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o20qb06",
          "author": "SmartPessimist_PM",
          "text": "I am going to answer your question by telling you something you already know but probably need to hear again. \n\nThe only statement AI gets 100% correct every time is the disclaimer that says:\n\nAI can make mistakes. 🤷🏻‍♂️",
          "score": 1,
          "created_utc": "2026-01-27 14:22:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o211bnd",
          "author": "mondayfig",
          "text": "You are accountable for what you share so reviewing and editing/fixing is part of using AI responsibly. My main experience has been with Teams and Microsoft 365 Copilot and I found that the summaries that are generated by default are of poor quality. Explicitly prompting it with clear instructions often yields much better summaries and list of actions. Still, it does contain mistakes from time to time.",
          "score": 1,
          "created_utc": "2026-01-27 15:15:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2127o9",
          "author": "WaylundLG",
          "text": "My experience is the same - it's really good except when it totally makes stuff up. Quick editing catches and fixes it though. I like that it usually cites the transcript with Gemini so I can go and read it if I need to.\n\nI'm also seeing comments on how theybare useless because the meeting wasn't useful and, while that is sometimes true, I think it's also irrelevant. If you are holding useless meetings, fix your meetings. If all the value of a meeting was in that meeting and you'll never need it again, don't worry about the notes for that one. And for the love of God, stop assuming that since you don't go back and read notes, then no one else does. Some people find it valuable.",
          "score": 1,
          "created_utc": "2026-01-27 15:20:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2133n4",
          "author": "DwinDolvak",
          "text": "I think 80-90%  . they definitely need some human validation/editing (I primarily use Gemini)",
          "score": 1,
          "created_utc": "2026-01-27 15:24:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o22dwir",
          "author": "widowmakerau",
          "text": "More accurate than my note taking, that is for sure.",
          "score": 1,
          "created_utc": "2026-01-27 18:46:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o25ypgk",
          "author": "HyperionsDad",
          "text": "I hate the summaries from Copilot, but I’ll use the meeting transcript to go back and capture notes. \n\nThe basic live transcript on Teams is shit, but the Copilot version cleans it up fairly well.",
          "score": 1,
          "created_utc": "2026-01-28 05:42:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o20a42p",
          "author": "Latter-Giraffe-5858",
          "text": "fellow actually lets you edit the summary if something's wrong or missing context. saved me a few times when the ai missed some nuance. not sure if other tools have that",
          "score": 0,
          "created_utc": "2026-01-27 12:54:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o20a5v2",
          "author": "Select-Print-9506",
          "text": "switched to fellow partly because of this. the summaries capture more of the \"we're leaning toward\" vs \"we decided\" distinction than what i was using before. still worth a quick review but less cleanup needed",
          "score": 0,
          "created_utc": "2026-01-27 12:54:54",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qq50pq",
      "title": "bug tracking separate tool or part of your main workflow?",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1qq50pq/bug_tracking_separate_tool_or_part_of_your_main/",
      "author": "Timely-Dinner5772",
      "created_utc": "2026-01-29 10:27:11",
      "score": 9,
      "num_comments": 15,
      "upvote_ratio": 0.84,
      "text": "do bugs live alongside features, or do you keep them isolated, what works better long term for defect tracking tools. suggest subreddit for this",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1qq50pq/bug_tracking_separate_tool_or_part_of_your_main/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o2e16fr",
          "author": "Any_Side_4037",
          "text": "Separate tools look cleaner at first but the moment someone forgets to update a status everything starts to fall apart.",
          "score": 4,
          "created_utc": "2026-01-29 10:51:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2e5xox",
          "author": "LightPhotographer",
          "text": "Bugs are work just like features: The software does A but I want it to to B.\n\nHere is the problem with bugs: Analysis is 98% of the work. Once you found what causes it, fixing it takes almost no time.  Before analysis you can say nothing about the amount of work .  \nDevelopers get unhappy if you press them to just call out a number - that discussion might take up more time than simply fixing it.\n\nWhat worked best for us:\n\nWe had a 'sergeant of the day' (or week) who would answer questions and analyze bugs.  He wasn't considered part of the build-capacity.  If he found a bug was easy he'd fix it - no hassle, no extra administration, no meetings, no overhead. Just fix&done. If it was harder we´d have to bring it up to the PO because it might impact the sprint... but at least we had some input on it.  \nBecause this person wasn't expected to contribute in userstories this never interrupted our flow.\n\nApart from how hard it was going to be to fix we would also get info on: How many people are affected, how big of a percentage of the userbase is that, are these internal users (helpdesk) or paying customers, and is there a workaround - these questions help the PO decide whether to plan it in a next sprint, drop everything and fix it now, or perhaps not fix it at all.\n\nIf that analysis is not enough, make a timeboxed story (spike) to analyze further until you know enough. \n\n**Tools:**\n\nOnce they get fixed by the guy-of-the-day you don't need a tool.  \nWhen they get planned in the next sprint, it's just work. No need for a separate tool.",
          "score": 3,
          "created_utc": "2026-01-29 11:30:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2ebq6t",
              "author": "urfv",
              "text": "same! we just used a different name. but essentially it’s like separate duty where we use kanban",
              "score": 1,
              "created_utc": "2026-01-29 12:13:02",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2evnvr",
          "author": "DingBat99999",
          "text": "Work is work is work.\n\nFeature/defect are artificial categories of work. In the end, the customer just wants the product to address their problem. \n\nThe category \"defect\" is really only valuable so you can determine if you have a quality problem or not.\n\nPriority is all that really matters.",
          "score": 2,
          "created_utc": "2026-01-29 14:10:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2eykkw",
          "author": "According_Leopard_80",
          "text": "On my teams we fixed bugs first, by the dev who caused the bug, no exceptions. The speed-up of having no technical debt ever was huge.  [https://middleraster.github.io/ABA/TheMetricForSoftwareDevelopment.html](https://middleraster.github.io/ABA/TheMetricForSoftwareDevelopment.html)",
          "score": 2,
          "created_utc": "2026-01-29 14:25:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2g1h41",
          "author": "PhaseMatch",
          "text": "It's all work.  Use a single backlog.\n\n\\- when you discover a bug in test, that work item/story isn't \"done\"  \n\\- when you get a reported defect, triage (now, next sprint, backlog)  \n\\- have strong criteria for \"now\" (based on risk/consequences of not fixing it)\n\nWhen it comes to forecasting, statistically model your \"defect rate\" and use that as a buffer.  \nIf you are continually improving quality (\"shift left\"), this will be an over-estimate.  \nThat's okay.  Under promise and over deliver is better than the reverse.",
          "score": 2,
          "created_utc": "2026-01-29 17:23:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2eactm",
          "author": "Internal-Alfalfa-829",
          "text": "Same heads do the work, using the same capacity -> Same tool and workflows",
          "score": 1,
          "created_utc": "2026-01-29 12:03:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ehg4u",
          "author": "Brickdaddy74",
          "text": "Features go into a roadmap, separate tool like JPD. \nFeatures get broken down into epics and user stories that go into a sprint backlog, like Jira. \n\nBugs go into the sprint backlog with user stories and other ticket types that are individual work items.\n\nTherefore, separate tools",
          "score": 1,
          "created_utc": "2026-01-29 12:51:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2ekac7",
              "author": "Lasdary",
              "text": "by your comment, it's not separate tools. They both end up in Jira as sprint backlog",
              "score": 2,
              "created_utc": "2026-01-29 13:08:44",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2el1kj",
                  "author": "Brickdaddy74",
                  "text": "JPD is Jira Product Discovery, which is the higher level Product or Opportunity backlog that the roadmap is built from. JPD is similar to roadmunk or prod plan. \n\nJira software is not a roadmapping tool it is an execution tool for your sprint backlog",
                  "score": 1,
                  "created_utc": "2026-01-29 13:13:11",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2ian8e",
          "author": "ScrumViking",
          "text": "One artifact to track your work is transparency. More than one is the polar opposite.",
          "score": 1,
          "created_utc": "2026-01-29 23:52:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2k5z4n",
          "author": "SlightReflection4351",
          "text": "seperate tool",
          "score": 1,
          "created_utc": "2026-01-30 06:41:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2mjwik",
          "author": "Bach4Ants",
          "text": "One team, one product, one backlog. If the bug is in the way of your product's success, you fix the bug. People can also knock off bugs if they're blocked on something else.",
          "score": 1,
          "created_utc": "2026-01-30 16:17:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2e5zlm",
          "author": "frankcountry",
          "text": "Stop what you’re doing, fix the big, continue what you’re doing.  Slow down to speed up, you shouldn’t be amassing a collection of bugs unless you have some fundamental quality problems.",
          "score": 1,
          "created_utc": "2026-01-29 11:30:49",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qoalzn",
      "title": "best way to handle production alerts in task tracking",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1qoalzn/best_way_to_handle_production_alerts_in_task/",
      "author": "Infamous-Coat961",
      "created_utc": "2026-01-27 10:49:42",
      "score": 9,
      "num_comments": 9,
      "upvote_ratio": 0.91,
      "text": "alerts and monitoring tools generate a lot of noise, and translating those into actionable tasks is messy. sometimes a critical incident gets lost in the backlog because the system isnt integrated with dev tracking tools.  \ndoes anyone have a setup where production alerts automatically create backlog items, assign owners, and track resolution and how do you prevent overloading devs while keeping visibility for PMs and ops? ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1qoalzn/best_way_to_handle_production_alerts_in_task/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o1zv1ws",
          "author": "Upset-Addendum6880",
          "text": "key is separating noise from critical incidents. otherwise devs just ignore alerts.",
          "score": 6,
          "created_utc": "2026-01-27 11:04:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1zuixg",
          "author": "Effective_Guest_4835",
          "text": "we automatically create tickets from alerts and tag by severity keeps critical issues from getting lost.",
          "score": 2,
          "created_utc": "2026-01-27 10:59:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2034xs",
          "author": "Canenald",
          "text": "Looks like it's time to re-examine the fundamentals. It sounds like PMs and ops care about the alerts and devs don't. Why?\n\nWhy is there noise? What can you do to reduce it?\n\nWhat is the goal of the devs? How is their performance measured? If they only care about delivering code, they'll never care about production alerts.\n\nHow was the tooling that generates alerts and backlog items picked and set up? Did the devs do it or was it imposed on them because there's a lack of trust?\n\nThe preferred flow here would be:\n\n* Tell devs that the reliability of their software is important, that there is a problem with how it performs in production, and that they need to deal with it (or you will, and they won't like it)\n* Your place here is to make suggestions if you have experience with these things, not to prescribe a solution.\n* Work together to hypothesise a solution to the problem, scope it out, and make sure it's prioritised correctly. You may be surprised. The solution might end up being something else entirely, or you might decide reliability is not important after all if it takes time away from feature factory churn\n* Iterate. The first attempt is always far from perfect. Noise is normal when a team first adopts monitoring software. Work on removing problems that are causing noise, even if those problems are not defects that affect users directly, because noise hides the real defects and erodes our trust in the monitoring solution.",
          "score": 2,
          "created_utc": "2026-01-27 12:07:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1zvgx2",
          "author": "SalamanderFew1357",
          "text": "Auto linking handles traceability, but commit messages still convey intent. In monday dev, links between commits, PRs, and issues are automatic, letting teams focus on meaningful messages instead of strict conventions",
          "score": 1,
          "created_utc": "2026-01-27 11:07:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o201w1i",
          "author": "Kri77777",
          "text": "I would dig deeper here. Why does it create noise? How can we reduce the noise and isolate to the actionable? Are there certain thresholds we can measure, summaries or dashboards we can create, groupings we can do, etc.?\n\n\nIt might be worth it to take one or more stories to implement those reductions. The product is not just the end user interface, but the entire system including monitoring and operating standards.\n\n\nWith that noise reduction, then you can focus on the actionable. Obviously, best solution would be to keep taking those as stories to automate to further reduce new/future issues. But yes, if you can reduce that noise, there are a lot of ways to have it added to a tracker. You don't mention what you are using, but as a team you could do some basic research, or again, take a story or so to research and/or implement such a system.\n\n\nBut hopefully, your Product Owner is reviewing these findings and deciding the best course of action - aka, is the reduction in productivity really much of a drain that tradeoffs can be made? Great topic for retrospective.",
          "score": 1,
          "created_utc": "2026-01-27 11:58:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2k90je",
          "author": "Difficult_Knee_1758",
          "text": "Seperate the noise",
          "score": 1,
          "created_utc": "2026-01-30 07:05:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2l6ngu",
          "author": "Any_Side_4037",
          "text": "We ended up routing alerts into a single queue that auto creates tasks with owners and priorities. Devs only see what matters, and PMs get full visibility without drowning in noise.",
          "score": 1,
          "created_utc": "2026-01-30 11:58:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2mjb6o",
          "author": "nicolaskidev",
          "text": "alerts noise is brutal - devs tune it out quick. switched to alertsdown for uptime monitoring cuz it only pings on real downtime no bullshit false positives, then zap em straight to jira tickets with auto-assigned owners. still gotta tune severity tho or ya overload everyone",
          "score": 1,
          "created_utc": "2026-01-30 16:15:06",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qr2vvc",
      "title": "Debugging code is easier than debugging our process",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1qr2vvc/debugging_code_is_easier_than_debugging_our/",
      "author": "SalamanderFew1357",
      "created_utc": "2026-01-30 11:26:43",
      "score": 8,
      "num_comments": 8,
      "upvote_ratio": 0.9,
      "text": "Our bug triage process is manual, repetitive and breaks every two weeks. How can I automate even half this mess.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1qr2vvc/debugging_code_is_easier_than_debugging_our/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o2lxs2o",
          "author": "DingBat99999",
          "text": "If you're going to invest effort into this, why not invest it in not producing so many defects?",
          "score": 8,
          "created_utc": "2026-01-30 14:35:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2oe58c",
              "author": "konm123",
              "text": "This guy does QA.",
              "score": 1,
              "created_utc": "2026-01-30 21:17:26",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2llwdm",
          "author": "Putrid-Diet614",
          "text": "Start small and automate the repetitive parts first, like logging, assigning, or labeling bugs. Even partial automation can save a ton of time and reduce those “break every two weeks” headaches.",
          "score": 2,
          "created_utc": "2026-01-30 13:34:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2mkm09",
          "author": "WaylundLG",
          "text": "What's breaking?",
          "score": 1,
          "created_utc": "2026-01-30 16:20:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2n5b60",
          "author": "PhaseMatch",
          "text": "How come you have so many escaped defects that it creates such a headache?\n\n\\- triage is usually \"do now, do later, not doing\"  \n\\- the PO should be doing that as the defects come in  \n\\- defects are just work; they go in the backlog same as everything else  \n\\- if you have a lot of defects, use Kanban not Scrum  \n\\- if it's \"do now\", team swarms on the defect  \n\\- if the defect rate is overwhelming the PO, you have a quality problem  \n\\- part of Kanban is Kaizen, continuous improvement\n\nTo be agile, change needs to be cheap, easy, fast and safe (no new defects).  \nThat means you aim to build quality in, not run inspect-and-rework loops.\n\nScrum says nothing about quality, technical practices or how to do this.  \nXP (Extreme Programming) does.\n\nSlicing work small seems less efficient, but prevents defects.  \nTDD feels slow, but if you write the tests first, you'll get better code.  \nPairing seems wasteful, but you are continually reviewing the code.  \nContinuous integration seems slow, but you find integration defects as they happen.  \nRed-green-refactor seems slow, but it's keeping the system maintainable.  \nA good system metaphor seems like gold plating, but makes defects easier to find.\n\nIf your PO has prioritised delivery over quality, then they are finding out the hard way what the \"limits to growth\" systems thinking archetype means.  If you take quick wins, eventually the big stuff you ignored is the limit.",
          "score": 1,
          "created_utc": "2026-01-30 17:53:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2l5rk0",
          "author": "Any_Side_4037",
          "text": "Man, the code isn’t the problem it’s the process automating even small parts of triage can save a ton of headaches.",
          "score": 0,
          "created_utc": "2026-01-30 11:51:38",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qmutuk",
      "title": "Visualizations of agile transformation journey",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1qmutuk/visualizations_of_agile_transformation_journey/",
      "author": "Specific_Crab3601",
      "created_utc": "2026-01-25 20:44:21",
      "score": 6,
      "num_comments": 14,
      "upvote_ratio": 0.69,
      "text": "another question from me today 🥹 \n\nHow do you guys visualize progress. do you have some storytelling ideas for management? or portfolio style things? \n\ni know for some metrics I can show graphs but i am thinking about some kind of systemic change picture that is easy to understand. idk How can i do it. just write a narrative???🤔",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1qmutuk/visualizations_of_agile_transformation_journey/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o1p9inv",
          "author": "Strenue",
          "text": "I love doing a timeline retro to tell the story over time.",
          "score": 3,
          "created_utc": "2026-01-25 21:59:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1pcysv",
              "author": "lexpectopatronum",
              "text": "We do this in our sprint review meeting. There's basically a timeline and our roadmap and a little star that says \"we are here!\" \n\nIt checks a waterfall-PMO box and lets us keep doing what we do without being bothered. It's actually been really helpful visually for leadership. \n\nI ALSO added a \"how we were agile\" slide for monthly leadership that gives a short narrative of a few examples of behaviors from the team that demonstrate the agile principles. It's been VERY effective for getting \"what's the point of agile\" across to reluctant senior leaders. \n\nNot quite what you asked for but has been huge for telling the story for my team.",
              "score": 7,
              "created_utc": "2026-01-25 22:14:06",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o1qnfcy",
              "author": "SoCaFroal",
              "text": "Can you tell me more about this? How does a timeline retro work?",
              "score": 2,
              "created_utc": "2026-01-26 01:57:32",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1pga6a",
          "author": "uaySwiss",
          "text": "What helped me the most in previous jobs: Releases per day (usually it starts with releases per month). Then you combine it with NPS or other user happiness indicators which are comparable over time. Ah and ensure the quality (uptime and bugs) don't drop.\n\nWhy releases? If you can ship more and still struggle, it should be easier to navigate. If you are not able to ship multiple times a day, you should first work on that. It usually is one or multiple of:\n- people with bad mindset\n- bad tech stack / architecture\n- toxic culture\n- bad error culture\n- ...",
          "score": 4,
          "created_utc": "2026-01-25 22:28:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1p96km",
          "author": "jake_morrison",
          "text": "One way is to make the work itself visible, i.e., a Kanban board. Then you can see the number of items in the backlog and the work in progress. You can see how big the items are. You can see what is waiting on other people, either for client approvals or on other teams.\n\nThen you get into DevOps transformation, and all the downstream processes needed to deploy to production and operate. You have the feedback loops from prod back to dev and product. Then you have the work to optimize process steps and handoffs. See Accelerate and The DevOps Handbook.\n\nVisualize the value chain and show what the bottlenecks are.",
          "score": 2,
          "created_utc": "2026-01-25 21:57:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ra9wc",
          "author": "Consistent_Serve9",
          "text": "A metric i recently discovered (forgot the name); Compare the number of tickets created in the backlog during the sprint vs the numbers of tickets closed during the sprint. That tells you if your backlog is growing exponentially and if your tech debt might be.overwhelming.",
          "score": 2,
          "created_utc": "2026-01-26 03:59:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1sgwyu",
              "author": "kiraka67",
              "text": "Backlog health",
              "score": 1,
              "created_utc": "2026-01-26 09:28:45",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1pegex",
          "author": "Strenue",
          "text": "I use it to tell the story - not review by review, but certainly when something big happens, like the product gets its first customer - so longer time spans.",
          "score": 1,
          "created_utc": "2026-01-25 22:20:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1r86id",
          "author": "mrhinsh",
          "text": "This usually turns into a self-congratulatory exercise.\n\nIf you’re looking for a “systemic change picture” to show management, it’s often because the actual outcomes haven’t moved.\n\nThe only story that matters is outcomes:\n\n* Are you delivering more frequently?\n* Is quality improving, fewer incidents, faster recovery?\n* Are customers actually happier or using the product differently?\n* Are you learning faster from real usage?\n\nIf those numbers have moved, the story tells itself. A simple before/after trend is enough.\n\nIf they haven’t moved, no narrative or visualisation will fix that. It just becomes a “look how agile we are” deck.\n\nAgile doesn’t need storytelling about the journey. It needs evidence that the system now produces better results.\n\nStart with outcomes. If you need a picture to explain it, something is probably wrong.",
          "score": 1,
          "created_utc": "2026-01-26 03:46:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1rd25o",
              "author": "Specific_Crab3601",
              "text": "I dont think i agree... We have an AC for 6 months and there was a change - they came into a nightmarish place with no rules and clarified a lot - made a lot of issues transparent. I see that people are not as scared to speak up, the issues are being discussed now. But we didnt manager to fix them yet since it is all interconnected and a lot of issues are upper mgmt above our influence (so far). So if youd Ask me- i see a big difference, but mgmt is not seeing it yet",
              "score": 1,
              "created_utc": "2026-01-26 04:16:35",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1r9qap",
          "author": "rayfrankenstein",
          "text": "Working software is the primary measure of progress.",
          "score": 1,
          "created_utc": "2026-01-26 03:56:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1rd6m9",
              "author": "Specific_Crab3601",
              "text": "🙄",
              "score": 1,
              "created_utc": "2026-01-26 04:17:21",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1vi0ce",
          "author": "PhaseMatch",
          "text": "**Agility is a means to an end, not an end in and of itself.**\n\n\\- what can the business do now, that it couldn't do 3, 6 and 9 months ago?  \n\\- how has that impacted on the bottom line (costs, revenues)? \n\nSo for example, if you have successfully coached the organisation  \n  \n\\- away from measuring \" producivity\" and toward measuring \"value created\"  \n => what impact has that had on costs, revenues and user growth?\n\n\\- to have a better culture and invest in professional development  \n=> how has that impacted on staff retention and recruitment over that time?\n\n\\- to communicate more effectively and use the cadence events as intended  \n=>how has that reduced the number of non-cadence meetings/events needed?\n\n\\- towards \"building quality in\" and not \"inspect and rework\"  \n=> how has that reduced the time/cost and revenues\n\n\\- towards greater team autonomy and away from top-down decisions  \n=> how has that impacted the ability to flow work faster\n\n  \nYou should be able to give a time line and directly tie in the organizational change you have intentionally created   to' real-word business impacts, and so give a data-driven narrative tying your core coaching arcs to the outcomes you were aiming at.\n\nEven if your coaching arcs have been more ad-hoc and what comes across your bow, then a timeline comprising the \"wins\" you have had and the core (lean) business impact (the why?) is the way to go.",
          "score": 1,
          "created_utc": "2026-01-26 19:20:02",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qs1rvf",
      "title": "Is “Agile Delivery Lead” just a rebranded Scrum Master or actually a different role?",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1qs1rvf/is_agile_delivery_lead_just_a_rebranded_scrum/",
      "author": "TutorAway1181",
      "created_utc": "2026-01-31 13:01:45",
      "score": 6,
      "num_comments": 15,
      "upvote_ratio": 0.87,
      "text": "Over the past few months I have started noticing a new title popping up more often in job posts and org charts: **Agile Delivery Lead**.\n\nAt first I assumed it was just another name for Scrum Master. But the more I read the descriptions, the more confusing it got.\n\nSome companies describe it like a classic Scrum Master (facilitating ceremonies, removing blockers, coaching teams). Others make it sound closer to a Project Manager (timelines, stakeholder updates, delivery tracking). And a few even mix in things like value measurement and business outcomes.\n\nSo now I’m wondering what this role actually is supposed to be.\n\nOn one team I spoke with, their Delivery Lead basically handled cross-team coordination and stakeholder management while the Scrum Master focused only on team health. On another, it sounded almost identical to a PM with an Agile label. Feels like every company defines it differently.\n\nPart of me thinks this might just be title inflation. But part of me also wonders if it’s becoming a natural “next step” role as teams scale beyond just Scrum Masters and POs.\n\nCurious how it works in your org.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1qs1rvf/is_agile_delivery_lead_just_a_rebranded_scrum/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o2sas90",
          "author": "AttentionMotivation",
          "text": "I'm an Agile delivery lead - no one actually knows or defines what I do. I manage Scrum masters and focus on rebranding them as they previously reported to engineering leads who had zero idea how to coach / mentor. So we’re a delivery organization with zero delivery identity. \n\nPOs overwhelmed and under skilled, SMs not building delivery systems with their teams and being the friend not th change agent, developers just saying yes to everything. Super unhappy customers, etc. it’s a long tail job but I’m building an organizational wide delivery excellence plan and slowly guiding behaviors across all roles to match that of a high performing org instead of just… existing and hopefully making outcomes happen. \n\nBlends agile coaching, program management, and chief of staff. ",
          "score": 11,
          "created_utc": "2026-01-31 13:28:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2sg3ts",
              "author": "AhamBrahmassmmi",
              "text": "+1 on this, I am also trying to stir in the same direction with the Agile roles. I feel this adds more value to the organization in different areas.",
              "score": 2,
              "created_utc": "2026-01-31 14:00:30",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2saezj",
          "author": "CleverNameThing",
          "text": "A job title doesn't tell you much.  My company uses the title Delivery Lead to mean different things depending on which team you are on.  I'm trying to get it standardized a bit.  We're a mess.",
          "score": 4,
          "created_utc": "2026-01-31 13:26:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2sepyw",
          "author": "OkStatement4809",
          "text": "That’s why they were renaming RTEs at my old place. Big Banking",
          "score": 3,
          "created_utc": "2026-01-31 13:52:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2sbhp4",
          "author": "99ProllemsBishAint1",
          "text": "So far it's just what they've rebranded Scrum Masters to at my work.",
          "score": 2,
          "created_utc": "2026-01-31 13:32:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2sf1fx",
          "author": "vanMyst",
          "text": "Here’s my understanding: it’s a team of teams function that has more accountability metrics to deliver against business roadmaps and grow team skills, and scope of concern spans from intake mechanism all the way to customer use.\n\nIn essence, you care about the pipeline and the “how” requests get into the teams and the stakeholder management that goes into knowing the business’s priorities over time horizons, resource management, employee development (if you have direct reports), agile execution and improvement, managing dependency,  risk, and escalation for the portfolio you own, radiating status, getting the product out the door, deployed, and owning “day 1” use experience (deployment was successful)”… wash, rinse, repeat 😁\n\nThe value to the business is having a specific person that owns the whole shebang in a formalized, repeatable capacity outside of program management (ensures no gaps in handoff or finger-pointing). You’ll still interface with program, but at the end of the day, you own the entire outcome.",
          "score": 2,
          "created_utc": "2026-01-31 13:54:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2slum8",
          "author": "flundstrom2",
          "text": "Scrum is only one of several kind of agile methodologies, with scrum master and product owners having defines roles. Companies not working according to Scrum, scrum@scale, SAFe or Kanban, need to have their own processes. Thus, the title is just something they need in order to frame the job description. Technically, a Waste Manager could just as well be a Janitor as a Chief Lean Officer. It's just a title.",
          "score": 2,
          "created_utc": "2026-01-31 14:33:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2s8pzg",
          "author": "Naive-Wind6676",
          "text": "In my experience , delivery lead functions more at the program level working across teams",
          "score": 2,
          "created_utc": "2026-01-31 13:15:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2say50",
          "author": "eyeteadude",
          "text": "In my experience agile delivery lead can mean many things. Often in large organizations it seems like it is used to describe someone who is a BA or PO manager with extra responsibilities where development is being done in a scrummerfall environment.",
          "score": 1,
          "created_utc": "2026-01-31 13:29:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2sh67b",
          "author": "projectthirty3",
          "text": "If you can use lead and manager interchangeably, then Emily Webber's blog post is a pretty good place to help with a definition \n\nhttps://emilywebber.co.uk/what-is-an-agile-delivery-manager/",
          "score": 1,
          "created_utc": "2026-01-31 14:06:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2siy84",
          "author": "Bernhard-Welzel",
          "text": "You are right, the name of the role is meaningless. Lots of organisations re-define existing terms and it is - ultimately - all the same: you run a feature factory, you need floor managers who make sure the workers are producing output. Whenever \"Agile\" is added to a title, you can be almost certain nothing is Agile in the organisation.\n\nI call it \"the great tragedy in software\" - insane amount of time and money is wasted every month just because value generation does not matter to middle management and senior leadership. If you find a company who actually cares about value and customer satisfaction, it is as rare as a unicorn.",
          "score": 1,
          "created_utc": "2026-01-31 14:17:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2sr6cj",
          "author": "neiwoc",
          "text": "Where I work it’s just a rebranded project manager. I seem to be responsible for much the same stuff I was as a PM. That said, I don’t think we’re implementing Agile terribly well…",
          "score": 1,
          "created_utc": "2026-01-31 15:02:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2srioz",
          "author": "Strutching_Claws",
          "text": "Where I am they essentially act as project/programme managers. They don't operate inside individual teams, they coordinate initiatives that require coordination across the business.",
          "score": 1,
          "created_utc": "2026-01-31 15:04:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2t7bnp",
          "author": "Bowmolo",
          "text": "Yeah, your observation about that role in the market matches mine.\n\nNevertheless, I think the pendulum swung too far into classic project management.\n\nTo me, it should be more like a Scrum Master should have been - therefore I always favored the Kanban proposals for the roles.\n\nThere, it's the one who's responsible and accountable for what happens after the commitment point (roughly: engineers start implementing).\n\nAnd yes, metrics play a role here for continuous improvement. As well as for timelines: but in a 'stable flow' and probabilistic forecasting sense. Not in Gantt charts and milestones one.",
          "score": 1,
          "created_utc": "2026-01-31 16:22:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2sh83p",
          "author": "sf-keto",
          "text": "ADL is a project manager who gets to boss the devs around & hold them to a Gantt chart. They hold daily status meetings to keep the devs “on the road map” & are accountable for making a certain date. \n\nThey may hold Scrumbut events, but always in the managerial & taskmaster mode. \n\nSprint planning is telling the devs what they have to do now, how much time they have to do it, and how it has to be done. \n\nReviews are showing the code to stakeholders & joining in as the stakeholders criticize devs. \n\nRetrospectives focus on how behind the devs are & telling them what they have to do to catch up. \n\nUgly work, poor results.",
          "score": 0,
          "created_utc": "2026-01-31 14:07:13",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qs6eu0",
      "title": "Have you used User Story Mapping before?",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1qs6eu0/have_you_used_user_story_mapping_before/",
      "author": "sadfacejackson",
      "created_utc": "2026-01-31 16:13:03",
      "score": 4,
      "num_comments": 3,
      "upvote_ratio": 0.83,
      "text": "Hi folks, I'm looking for feedback from agile practitioners on a free-to-use tool I built. \n\nTLDR: I discovered User Story Mapping last year. I then went online to find software to try it with, but there wasn't anything free, so I built my own: [https://www.storymaps.io/](https://www.storymaps.io/) \\- it's free and open-source - no sales pitch. I'm pretty new to the subject myself, so I'm wondering if people in the same fields would find a tool like this useful. Also, if it's not useful or something is wrong or you think it sucks because of a, b and c... I'm all ears! \n\nI really see value in the technique, so I wanted to build a free tool to let people experiment with it and use it in their own day-to-day work as I do myself. \n\n  \nThanks in advance! \n\n  \n,",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1qs6eu0/have_you_used_user_story_mapping_before/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o2t6udv",
          "author": "samwheat90",
          "text": "Awesome. I’ll check this out!",
          "score": 1,
          "created_utc": "2026-01-31 16:20:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2t704m",
              "author": "sadfacejackson",
              "text": "Thank you! really appreciate it",
              "score": 1,
              "created_utc": "2026-01-31 16:20:56",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2tarf3",
          "author": "99ProllemsBishAint1",
          "text": "I'm interested but I'd like to get a quick understanding of what user story mapping is. The Learn User Story Mapping link just goes to a board. The video linked is almost 2 hours long. Where can I get a 2-3 minute overview?",
          "score": 1,
          "created_utc": "2026-01-31 16:38:50",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qqums9",
      "title": "Does work feel heavier when feedback disappears?",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1qqums9/does_work_feel_heavier_when_feedback_disappears/",
      "author": "AgileEvolves",
      "created_utc": "2026-01-30 03:45:55",
      "score": 3,
      "num_comments": 3,
      "upvote_ratio": 0.81,
      "text": "I’m noticing that when feedback becomes delayed, partial, or ambiguous, people seem to compensate with more meetings, documentation, and process.\n\nThe work feels heavier, even when output hasn’t increased.\n\nCurious how others experience this. Does this resonate?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1qqums9/does_work_feel_heavier_when_feedback_disappears/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o2jsya7",
          "author": "PhaseMatch",
          "text": "When you don\"t get fast feedback from real users on the value you have created..\n\n.. agile approaches are not reducing your business risk.",
          "score": 2,
          "created_utc": "2026-01-30 05:03:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2kbn26",
          "author": "Fr4nku5",
          "text": "I think of it like a plane - when you've got genuine movement, it provides lift and enables control. \n\nFeedback is basically our perception of genuine movement - whether the marketing of a newstart-up or increasing quality on a legacy tool..",
          "score": 1,
          "created_utc": "2026-01-30 07:27:59",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qr9b4m",
      "title": "slack task assignment finally works with proper acknowledgment and tracking",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1qr9b4m/slack_task_assignment_finally_works_with_proper/",
      "author": "Sea_Weather5428",
      "created_utc": "2026-01-30 15:56:38",
      "score": 3,
      "num_comments": 0,
      "upvote_ratio": 0.72,
      "text": "biggest problem with slack task assignment used to be people claiming they \"didn't see it\" or \"thought someone else was doing it.\" no accountability, no confirmation, just hopes and prayers.\n\nstarted using chaser in slack a few months ago and it solved this. when you assign a task in slack, person has to acknowledge it. if they don't acknowledge within 24 hours, they get reminded. if deadline is approaching, automatic reminders. if they miss deadline, everyone sees it.\n\nsounds harsh but it's actually made the team way less stressed. people aren't wondering if others saw their requests, and nobody can accidentally drop something and only find out when it's too late.\n\nremote team of 10 across different time zones and this level of clarity has been game changing. especially for async work where you can't just tap someone's shoulder to confirm they saw something.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1qr9b4m/slack_task_assignment_finally_works_with_proper/",
      "domain": "self.agile",
      "is_self": true,
      "comments": []
    },
    {
      "id": "1qrj3a7",
      "title": "Can Average Bug Age (ABA) Be Gamed?",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1qrj3a7/can_average_bug_age_aba_be_gamed/",
      "author": "According_Leopard_80",
      "created_utc": "2026-01-30 21:45:44",
      "score": 2,
      "num_comments": 26,
      "upvote_ratio": 0.58,
      "text": "My favorite metric for dev teams is average bug age (ABA), that is, [average age of ***open*** bugs](https://middleraster.github.io/ABA/TheMetricForSoftwareDevelopment.html). With a proper bug-handling policy, it's hard to drive that number down to something close to 0 (and keep it there) without lots of good things happening.\n\nRecently I've heard people assert (without proof) that all metrics are gameable, though lead and cycle times are harder to game.  That's probably true, but I recently started thinking about the mathematics of Little's Law in relation to ABA. Here are my thoughts: [Is the ABA Metric Gameable?](https://middleraster.github.io/mathmusings/ABA/IsABAGameable.html) My conclusion: I *think* it's hard or even impossible to game in a way that's not easily detectable.\n\nMy challenge/ask of you:  if you can think of a way to game the ABA metric, one that I haven't already covered in my posts, please let me know, and if we're really lucky, maybe I'll be able to think of a mitigation.\n\nP.S.:  Before we get started, ***please*** note the difference between [throughput and cycle time](https://middleraster.github.io/Kanban/KanbanThoughts.html): they are orthogonal. (I even wrote a [simulator](https://middleraster.github.io/Kanban/KanbanSimulator.html) to show the difference:  you can easily change cycle time, yet throughput stays the same).",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1qrj3a7/can_average_bug_age_aba_be_gamed/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o2olhey",
          "author": "Possible-Ebb9889",
          "text": "1. Discover a bug\n2. Don't tell anyone or put in jira ticket\n3. Spend a week working on it\n4. Create the ticket when Im done and checking the code in\n\nABA for this ticket is zero and it shadow sucked up dev time for a week",
          "score": 21,
          "created_utc": "2026-01-30 21:52:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2oms62",
              "author": "funbike",
              "text": "Yep.  Even worse devs would be incented to pocket bugs; keep then secret and horde them.   Then they could later manipulate like you said later at a fast but believable rate.\n\nThe end result would be worse product but a good metric.",
              "score": 7,
              "created_utc": "2026-01-30 21:58:17",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o2onyou",
              "author": "angryweasel1",
              "text": "This is actually awesome behavior. A bug was found, and the developer stopped to fix it before doing more work. Mission accomplished.",
              "score": 2,
              "created_utc": "2026-01-30 22:04:00",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2ox9uz",
                  "author": "rwilcox",
                  "text": "While it shows initiative, it shows a lack of transparency and introduces a non prioritized element into the current release. _Was_ it the most important thing to do next? Maybe, maybe not.\n\nMaybe it’s the developer going cowboy a bit, but it could be a sign of a hectic culture (he who screams the loudest gets their thing done). I don’t want to encourage the latter.\n\nMaybe it _was_ the thing at the top of the queue or the culture is not so “command and control” that is often what default scrum implementations are (yes, yes, I know the Scrum book says it’s anti that in theory). But, if that was the case I’d still probably pull that developer aside and say, “that worked once, and it worked here, but it’s not a good habit…”",
                  "score": 4,
                  "created_utc": "2026-01-30 22:50:49",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o2omsfg",
              "author": "According_Leopard_80",
              "text": "No, ABA measures the average bug age of the remaining OPEN bugs, not this one. The ABA of those bugs got worse while you were working on this invisible bug.",
              "score": -2,
              "created_utc": "2026-01-30 21:58:20",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2pyeln",
                  "author": "Possible-Ebb9889",
                  "text": "what if I didn't have any other bugs? Just some big feature",
                  "score": 1,
                  "created_utc": "2026-01-31 02:19:40",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2on9eo",
          "author": "LightPhotographer",
          "text": "Absolutely.\n\nYou can tell that a help desk is being pressured by metrics like this when they start closing tickets as fast as possible (for example: when they need more info) and open new tickets to continue the work.\n\nThere is a strong incentive to close bugs as fast as possible even when they are not fixed. Example, we had a customer who had problems printing invoices.  It was only that single customer.   \nPerhaps we could find time in 3 months to fix it.  But now your metric comes along.  \n want to close this bug and your metric gives a strong incentive to do so.",
          "score": 14,
          "created_utc": "2026-01-30 22:00:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2onkkb",
          "author": "Z-Z-Z-Z-2",
          "text": "Will simply create the bug as a pbi or another ticket type that you are not tracking in your metric.",
          "score": 7,
          "created_utc": "2026-01-30 22:02:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2opnwn",
              "author": "PandaMagnus",
              "text": "I've seen this when management started tracking... I think it was total defects. Every single bug turned into an argument and justification for why it was *really* a story because the original ask was unclear, or didn't mention some weirdly specific thing, or etc. It even got to the point where certain devs would look at code and say things like \"well, clearly this code is working as intended, so this isn't a bug.\"",
              "score": 4,
              "created_utc": "2026-01-30 22:12:22",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2ordru",
                  "author": "Benathan23",
                  "text": "If you are going to penalize bugs then developers tend to be more picky about it.  I would also agree with developers that the definition of a bug shouldn't be \"It doesn't work the way I expect, but it does work to the spec/AC that requested it.\"",
                  "score": 4,
                  "created_utc": "2026-01-30 22:20:54",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2onlp4",
          "author": "Cheeseburger2137",
          "text": "I feel like “The right way is to have every developer fix his own bugs first before he’s allowed to write anything else” is just out of touch. There are bugs that are really not a big deal and investing time in fixing them leads to a lost opportunity cost of not doing something that brings value to business.\n\nYou drive ABA down more by closing a year-old bug that no one cares about while ignoring a business critical one which was just discovered.",
          "score": 6,
          "created_utc": "2026-01-30 22:02:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2orbz9",
              "author": "dastardly740",
              "text": "I agree. My first thought was that it is less about gaming the metric and more about the old adage \"Unfortunately, you get what you measure.\"\n\nThere are a lot of metrics that can be good early warning indicators that something has gone wrong with the team, and there needs to be some investigation about what has actually gone wrong. Turning that same metric into a KPI can also drive bad behavior in chasing that metric.\n\nI think your example is a good example of how this metric can be a good signal, but chasing it can go bad. ABA is increasing. If it is treated as a signal, an investigation determines that it is because low priority bugs are accumulating and now the team can decide on the best approach to deal with that situation. Treating it as a KPI that drives performance reviews and compensation, and now the team just fixes all bugs ASAP regardless of what other work gets set to the side. The metric isn't being gamed, but it is driving undesirable behavior.",
              "score": 3,
              "created_utc": "2026-01-30 22:20:39",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2oo1qr",
          "author": "sf-keto",
          "text": "Or you know OP you guys could just do TDD & stop torturing the devs with nonsense vanity metrics & showing lack of trust by worrying semi-publicly about how they’re “gaming” this nonsense. \n\nRead 5 Dysfunctions of a Team. Also, Frictionless. Best wishes.",
          "score": 5,
          "created_utc": "2026-01-30 22:04:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ono2m",
          "author": "slower-is-faster",
          "text": "Typical dev conversations go like this:\n\n\n“Hey, you reckon I should fix this properly or just do a quick hack?”\n\n\n“How long will the proper fix take?”\n\n\n“Couple hours”\n\n\n“Nah just hack it”\n\n\nSo, do you want to incentivise all the shit “quick fixes” and end up with an unmaintainable mess, or do you want high quality fixes that take more time?",
          "score": 4,
          "created_utc": "2026-01-30 22:02:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2oyn16",
          "author": "Internal-Alfalfa-829",
          "text": "Every metric will be gamed if it's used as a weapon against the team. Go to McDonalds and order stuff to take out. Notice how the employees mark your order as ready several minutes before you get it. -> That is a direct response to undue KPI pressure.\n\nUpdating tickets too early or too late is the easiest thing in the world. Nobody notices that *reliably*. Your behavior matters, not which numbers you pick to monitor. There may be too much antagonism in the current state of things if it leads to this kind of question.\n\nBefore asking about gaming metrics, we should ask about how to not weaponize them. Then the team doesn't get pushed into gaming them in the first place. Transparency cannot be demanded or tricked into, it must be earned. The priority is on learning how to build trust and cooperation.",
          "score": 3,
          "created_utc": "2026-01-30 22:57:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ontbc",
          "author": "D20babin",
          "text": "Let me be clear with you. Any and all metrics gathered for performance measurement or not can and will be gamed. \n\nIt human nature, no one want to look bad.",
          "score": 2,
          "created_utc": "2026-01-30 22:03:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2opgm5",
          "author": "MyRealFakeID",
          "text": "It will 100% be gamed. Either by closing the bug prematurely, delaying creating bug, or you're back to the \" is it an enhancement vs bug\" drama that kills productively. \n\nAll for a metric that is useless.  So what if you have bugs - supposed to work on a low impact bug that's been open for 6 months instead of new, value-add work? It's dumb.",
          "score": 2,
          "created_utc": "2026-01-30 22:11:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2oqzl3",
          "author": "melchetts-mustache",
          "text": "ABA measure how long the average open bug has been open…. So on the last day of the month I open a whole bunch of new bugs - “get coffee tomorrow morning”, “run weekly check reports” are now a bug tickets, they have a low age so they bring down the average.",
          "score": 2,
          "created_utc": "2026-01-30 22:18:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2oskqt",
          "author": "Benathan23",
          "text": "One question you really need to think about with the ABA metric is \"Do the people being judged by it have agency to do something about it?\" If the developers are judged by it, but the business prioritizes the sprint, then you have an unfair metric.    \n  \nIf the metric is just informational, ask yourself: what does an average age of 1 day vs 1 week vs 1 year tell you? Those really old non-impactful bugs don't get closed.  Are you really going to re-prioritize old, non-impactful bugs to be worked on over newer, more critical bugs/value-add work?",
          "score": 2,
          "created_utc": "2026-01-30 22:26:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2p3ijh",
          "author": "hobbes244",
          "text": "The easiest way to game it is to declare that the oldest bugs won't be fixed. However, that's a good thing, because the oldest bugs in your system will probably never be fixed at all. In the book [Lean from the Trenches](https://pragprog.com/titles/hklean/lean-from-the-trenches/), Kniberg talks about a team that had a list of 30 bugs. If someone found a new bug, the choice was to fix it immediately (if it was something small) or bump one of the 30 bugs. If a bug keeps cropping up, then it probably deserves to bump one of the 30 bugs.\n\nIt's terribly easy to just add a bug to the giant list of bugs without realizing the overhead of doing so. That oldest bug will be triaged again and again and again. There's no shame in acknowledging that some bugs just won't be fixed. It's not quite so easy to explain to someone that their bug won't ever rise to the top of the queue.",
          "score": 2,
          "created_utc": "2026-01-30 23:24:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2per8d",
          "author": "Emorin30",
          "text": "I don't have a way to game the metric, but I think it's a temporary metric at best and a bad metric at worst.\n\nNot all bugs should be fixed and they certainly shouldn't be falsely prioritized due to a metric like this one.\n\nAll tickets...bugs, stories, and tasks should be prioritized on their own merit...the value they add vs the cost to build and maintain.\n\nI could see this metric having some value if you're way behind on bugs but that's it, very temporary.",
          "score": 2,
          "created_utc": "2026-01-31 00:26:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2or6jo",
          "author": "WideFunction6166",
          "text": "Yes, if want no bugs, open no bugs",
          "score": 1,
          "created_utc": "2026-01-30 22:19:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ozq5q",
          "author": "Budget_Pin5828",
          "text": "General guideline: if it can be measured, it can also be gamed.",
          "score": 1,
          "created_utc": "2026-01-30 23:03:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2pd4op",
          "author": "Bowmolo",
          "text": "(If ABA approaches threshold) Create 1+ simple to fix bugs. Jump immediately on it once one emerges. Solve & deploy in minutes (because you know beforehand). Wait for ABA to approach threshold. Repeat.",
          "score": 1,
          "created_utc": "2026-01-31 00:17:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2q0teu",
          "author": "goobersmooch",
          "text": "“You get what you measure” \n\nEvery metric can be gamed but profit. ",
          "score": 1,
          "created_utc": "2026-01-31 02:34:03",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qmm7xi",
      "title": "Measuring Agile Coaches impact",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1qmm7xi/measuring_agile_coaches_impact/",
      "author": "Specific_Crab3601",
      "created_utc": "2026-01-25 15:34:30",
      "score": 2,
      "num_comments": 37,
      "upvote_ratio": 0.56,
      "text": "How do you guys measured an AC impact? hard to justify the money that is spent on them so id like to understand How others do it.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1qmm7xi/measuring_agile_coaches_impact/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o1n1ypc",
          "author": "mrhinsh",
          "text": "Agile Coaches don’t improve teams directly.\n\nThey improve the **system** teams operate in.  \nIf these metrics don’t move, either the coaching isn’t landing, or the system isn’t actually being changed.\n\nIf you want to measure an Agile Coach’s impact, measure **what the system produces**, not what the coach does.\n\nThese measures don’t exist to assign credit or isolate cause. Outcomes are always influenced by multiple factors. What matters is whether the **conditions for better outcomes** now exist. An Agile Coach’s contribution is indirect by design: they make improvement possible by changing how the system works. Whether improvement is realised depends on whether the organisation acts on what is exposed.\n\nYou could start with:\n\n- **Time to Market (EBM)**  \n  How long it takes for an idea or hypothesis to reach users.  \n  **Why:** Exposes decision latency, batching, hand-offs, and approval drag. These only change when the system changes.\n\n- **Lead Time for Changes (DORA)**  \n  Time from code committed to code running in production.  \n  **Why:** Reveals delivery pipeline friction, testing debt, and organisational bottlenecks that sit beyond any single team.\n\n- **Deployment Frequency (DORA)**  \n  How often the organisation successfully deploys to production.  \n  **Why:** A strong proxy for flow, technical health, and organisational trust, none of which can be improved in isolation.\n\n- **Unrealised Value (EBM)**  \n  Known opportunities that exist but are not yet delivering value.  \n  **Why:** Shows whether the organisation is learning and adapting, or simply executing what it already decided.\n\nYou can also use **Columinity** for team-level metrics that avoid measuring individuals and instead surface stability, interaction patterns, and continuity over time.\n\nIf these measures improve, it does not prove a single cause.  \nIf they do not improve, it does show the system has not changed.\n\nStay away from BS metrics like:\n\n- Velocity  \n- Utilisation  \n- Story points completed  \n- Tasks  \n- Original estimates vs actuals  \n\nThese describe activity. They do not explain results, and they do not change the system.\n\nIf you want to go deeper, read:\n\n- Scrum.org – Evidence-Based Management (EBM)  \n- DevOps Research and Assessment – DORA Metrics  \n- Columinity – Team stability, interaction, and system signals  \n\nFlow metrics would also help a lot.",
          "score": 18,
          "created_utc": "2026-01-25 16:17:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1njjd5",
              "author": "Specific_Crab3601",
              "text": "Columinity is interesting, never heard this word in my entire life😅 How do you work with it?\n\nAs for the rest - I understand and agree that delivery health and overall organisation health is important and measurable, but as you know nowadays everyone is getting laid off and ACs are usually the first to go. My bosses are asking \"How do you know the AC is valuable, that they are the ones driving the change and not team members actually got their shit together\" - and as I know it is ACs, i can see it, you know that numbers are the only thing that are interesting. Was doing the storytelling - behavioral changes, teams cooperation patterns, even Lean waste - none of this is showing the leadership How much is it the work of AC. Devs complete jira stories and they see it getting deployed and driving money, AC even if they show output in Jira doesnt translate to $$$$$$",
              "score": 1,
              "created_utc": "2026-01-25 17:32:51",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1py5pk",
                  "author": "mrhinsh",
                  "text": "I think this argument is kind of irrelevant to how this actually works in real organisations.\n\nIt assumes you can isolate one person and draw a straight line from their work to revenue. That’s not how complex systems work, and it’s not how we measure any other leadership or system role.\n\nDevelopers produce features. Those features can be tied to money.\nAgile Coaches don’t produce features. They work on the conditions that allow teams to produce features reliably.\n\nAsking “how do you know it was the Agile Coach and not the team getting their shit together” misses the point. Teams don’t just magically improve inside the same constraints. When lead time drops, coordination improves, waste goes down, and delivery becomes more predictable, that only happens because something in the system changed.\n\nThat change doesn’t show up as a Jira ticket that maps to dollars. And expecting it to is a category error. We don’t ask architects, managers, finance, or legal to justify themselves in story points either.\n\nSaying “leadership only cares about numbers” also doesn’t really help the case. Numbers show outcomes, not who gets credit. No serious organisation tries to attribute revenue to a single role. They look at whether results improved after deliberate changes to how the organisation works.\n\nIf leadership is asking for a clean $$$ attribution, they’re not actually asking how to measure impact. They’re looking for justification during layoffs. No metric will satisfy that, because the decision isn’t about evidence.\n\nThe only honest question is:\nDid the system produce better outcomes after the coaching started?\n\nIf yes, the coaching mattered.\nIf no, it didn’t, or leadership refused to change.\n\nEverything else is just BS.\n\n---\n\nhttps://columinity.com/",
                  "score": 3,
                  "created_utc": "2026-01-25 23:51:29",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o1n2mee",
              "author": "Extreme_Dragonfly802",
              "text": "+1 to Columninity",
              "score": 1,
              "created_utc": "2026-01-25 16:19:59",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1muqov",
          "author": "CleverNameThing",
          "text": "Results.  Is your product better?  Is delivery fasters?  Are you producing it cheaper?",
          "score": 5,
          "created_utc": "2026-01-25 15:45:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1mwndf",
              "author": "Specific_Crab3601",
              "text": "True but this can be a results of many things, not just the AC",
              "score": 2,
              "created_utc": "2026-01-25 15:54:04",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1n2lqi",
                  "author": "CleverNameThing",
                  "text": "But that is the only question that matters.  Part of the definition of agile means accepting that the best measure of progress is working software, not some simple metric.  The other question I face, and this may not apply to you, is that my agile coach gets ignored.  The operational decisions (e.g., should we be time-boxed or flow-based) are decided by other managers.  How can I hold the AC responsible when they aren't making the decisions that affect agility?  Again, that may not be your issue.  Hopefully you have empowered Scrum Masters (not \"schedule\" masters) who report to qualified Agile Coaches.",
                  "score": 1,
                  "created_utc": "2026-01-25 16:19:55",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1mx3p5",
          "author": "Ouch259",
          "text": "In the old days it was teaching agile methods.  Nowadays it satisfying leadership’s excessive reporting needs without adding work to the team.\n\nIf i can get leadership to show for demos and keep them from asking for burn down charts or story point reporting I consider myself a success.",
          "score": 8,
          "created_utc": "2026-01-25 15:56:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1n67ss",
              "author": "Specific_Crab3601",
              "text": "But are the burndown charts and storypoints needed by the leadership? Why",
              "score": 2,
              "created_utc": "2026-01-25 16:35:27",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1n6rk3",
                  "author": "Ouch259",
                  "text": "They are not needed!",
                  "score": 2,
                  "created_utc": "2026-01-25 16:37:48",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1pgejo",
                  "author": "Euphoric-Usual-5169",
                  "text": "They love simple numbers. That’s why they want them. ",
                  "score": 1,
                  "created_utc": "2026-01-25 22:29:23",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1rlozh",
          "author": "WaylundLG",
          "text": "As someone who had a business selling coaching services, I tried to measure my effectiveness and my employee's effectiveness a lot of ways. What I eventually found worked best was to just commit to results. \n\nOnce we understood the context a bit, we'd talk with teams, managers, leadership and ask them to describe a workplace that was better for everyone. Sometimes it was less stress at release time. Sometimes it was informed and engaged stakeholders, other times it was productivity. Then, if we thought we could help, we'd say \" We think we can help you make X change for Y group in Z months. Here is what you will need to do in order for that to happen. Does that sound valuable to you? When do you want to start.\" Then we would.",
          "score": 3,
          "created_utc": "2026-01-26 05:12:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1mt51d",
          "author": "YAMMYYELLOW",
          "text": "What’s your starting point as a team/org?",
          "score": 2,
          "created_utc": "2026-01-25 15:38:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1mwqbn",
              "author": "Specific_Crab3601",
              "text": "In what way",
              "score": 1,
              "created_utc": "2026-01-25 15:54:26",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1n9v08",
                  "author": "YAMMYYELLOW",
                  "text": "Tell us literally anything about where you’re at as a team or company to understand what the agile coach is walking into",
                  "score": 1,
                  "created_utc": "2026-01-25 16:51:13",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1neejl",
          "author": "DingBat99999",
          "text": "It's important to remember that Deming did NOT say \"If you can't measure it, you can't measure it\". \n\nWhat he actually said was: \"\n\n>It is wrong to suppose that if you can’t measure it, you can’t manage it – a costly myth.”\n\n  \nThere's nothing wrong with asking people: \"Is this coach adding value?\". If they say yes, that can be good enough.",
          "score": 2,
          "created_utc": "2026-01-25 17:10:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1njahp",
              "author": "Specific_Crab3601",
              "text": "It is not for the mgmt😭",
              "score": 2,
              "created_utc": "2026-01-25 17:31:46",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1n7zcd",
          "author": "Specific_Crab3601",
          "text": "Columinity is interesting, never heard this word in my entire life😅 How do you work with it?\n\nAs for the rest - I understand and agree that delivery health and overall organisation health is important and measurable, but as you know nowadays everyone is getting laid off and ACs are usually the first to go. My bosses are asking \"How do you know the AC is valuable, that they are the ones driving the change and not team members actually got their shit together\" - and as I know it is ACs, i can see it, you know that numbers are the only thing that are interesting. Was doing the storytelling - behavioral changes, teams cooperation patterns, even Lean waste - none of this is showing the leadership How much is it the work of AC. Devs complete jira stories and they see it getting deployed and driving money, AC even if they show output in Jira doesnt translate to $$$$$$",
          "score": 1,
          "created_utc": "2026-01-25 16:43:06",
          "is_submitter": true,
          "replies": [
            {
              "id": "o1njx0x",
              "author": "sf-keto",
              "text": "Columinity is a giant checklist of generic questions you can re-arrange & present as a survey to the business & teams. \n\nIt can be anonymous or by team. This way the business knows who to fire when they complain or criticize in the survey. \n\nLook Barry Overeem is a great guy & means well. His big client is Lego & they love his “you want metrics, I’ll create metrics with all kinds of assessments! You can track all kinds of charts with data going up & down in a dashboard!” \n\nThe issue is that these kinds of assessments create vanity metrics. Useless.  They say nothing meaningful about the state of the culture, the product, the team, revenue, or the customer satisfaction.\n\nThe only metrics you need are SPACE, DORA, DevEx, Pirate, Ops, customer satisfaction, and EBITDA. You can add the Scrum Evidence-Based Metrics as frosting. \n\nIf an Agile coach or coaching staff is adding value, SPACE, DORA, DevEx & EBITDA will improve rapidly.",
              "score": 1,
              "created_utc": "2026-01-25 17:34:32",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1oam01",
                  "author": "Specific_Crab3601",
                  "text": "Idk idk, they would probably for a timeboxed transformation project where everything is centrally orchestrated and the change is fast... I would expect a slower change over long time if there is a lot of issues and the resistance is high... And during a slower change mgmt can challenge indirect metrics as not related to AC. No?",
                  "score": 1,
                  "created_utc": "2026-01-25 19:25:52",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1ng7uc",
          "author": "Competitive_Ring82",
          "text": "It really depends on what I've thrown them into. If liquid, look at total displacement. If solid, look at deformation - both to the surface, and the coach.",
          "score": 1,
          "created_utc": "2026-01-25 17:18:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1vp05n",
          "author": "PhaseMatch",
          "text": "Agility is not an end in and of itself\n\n\\- avoid using data that reinforces the \"software and IT is an ivory tower\"  \n\\- focus on data that impacts the bottom line of the business\n\nGrowing and sustain a deep, meaningful collaboration between \"the business\" and \"the team(s)\", and indeed \"the users\" if that is a different group is key to using agility to \"move the dial\" on the overall business.   \n  \nWhile there is a lot of data you will use to help guide improvements, you need to \n\n\\- worry less about tactical and operational stuff within the teams and departments  \n\\- focus more on how this contributes to the overall business strategy and KPIs",
          "score": 1,
          "created_utc": "2026-01-26 19:50:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1xbeuy",
          "author": "DaLeprechaunDon",
          "text": "AC here. It’s shifted a lot in the 10 years I’ve been doing it. Many people here are saying the right things. Used to be reaching the “book”, following strict ceremony guidelines, R&R, etc. \n\nNow it’s more of coaching other roles to find better ways to operate within the system. Are there improvements the system should do? If they do then what will improve? Can we be consistent and predictable? We are often in higher level meetings and a bridge between the team and their managers and other leadership roles. Manager dogging somebody? AC should step up. Product team keeps forcing unclear and unplanned work last minute? AC should step up. \n\nThe golden moment is when you don’t need to do any of this anymore and then hopefully you can move up or move on.",
          "score": 1,
          "created_utc": "2026-01-27 00:23:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1p5gkv",
          "author": "Complete-Cricket-351",
          "text": "TBH I suspect your bosses are correct I've never seen agile coaches achieve much apart from politics and I've seen them in half a dozen orgs.",
          "score": 0,
          "created_utc": "2026-01-25 21:40:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ngxkp",
          "author": "rashguir",
          "text": "4 keys (DORA) is my goto metric to measure improvment in a team or an organisation",
          "score": 0,
          "created_utc": "2026-01-25 17:21:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1oar6k",
              "author": "Specific_Crab3601",
              "text": "That was my first idea too but mgmt said its not directly showing the impact of AC",
              "score": 1,
              "created_utc": "2026-01-25 19:26:31",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1nlbig",
          "author": "ya_rk",
          "text": "It's not only delivery, it's also sensing and responding to product realities. Do priorities ever change, and when they do, how quickly can the product group respond to the change? Delivering rapidly is important, but it's insufficient when its very easy to deliver the wrong thing. For teams, the ability to completely change the topic of work from sprint to sprint is one measure. If they always need time to wind down previous work and ramp up new work, that's a problem. For the PO, If  they are busy with defining work for the team rather than evaluating the product signals and metrics and responding accordingly with priority changes, that's another problem. If the PO is changing direction every sprint (the other extreme of not changing at all) that's also a problem.",
          "score": 0,
          "created_utc": "2026-01-25 17:40:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1wgzf8",
          "author": "forestcall",
          "text": "Nahhhhh - Everything is different. I think the way teams work is completely changed. Ai is making it so a Customer Support manager or even a hourly temp worker can log into a company Kanban Dev Tool like \"Auto Claude\" and make changes and a Worktree is created and then the dev team can check the work. Now Project Owners can create mockups to get their idea across unlike any time before. Agile and SCRUM needs to be completely reimagined. In my mind to disagree means you are not aware of whats going on in the AI coding space. u/mrhinsh for example is partly correct but the ideas are completely outdated. I can build extremely complex Rust features that would have taken 6 months with a team of 9 in less than 5 days by myself.",
          "score": 0,
          "created_utc": "2026-01-26 21:54:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1xd80q",
              "author": "mrhinsh",
              "text": "AI absolutely accelerates execution.\n\nIt does not change decision rights, funding models, governance, risk tolerance, or the speed at which value reaches users. Those are system properties.\n\nAgile coaching exists to change those properties, not to make individuals type faster. That is why its impact shows up in system outcomes, not personal productivity anecdotes.",
              "score": 1,
              "created_utc": "2026-01-27 00:32:45",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1p50d9",
          "author": "EngineerFeverDreams",
          "text": "Easy. They are parasites. So, everything they do, double the cost.",
          "score": -2,
          "created_utc": "2026-01-25 21:39:00",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}