{
  "metadata": {
    "last_updated": "2026-03-01 16:49:58",
    "time_filter": "week",
    "subreddit": "agile",
    "total_items": 8,
    "total_comments": 150,
    "file_size_bytes": 210282
  },
  "items": [
    {
      "id": "1rfljjg",
      "title": "I’m coming to terms with the fact I am not cut out to be a Product Owner.",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1rfljjg/im_coming_to_terms_with_the_fact_i_am_not_cut_out/",
      "author": "Apprehensive_Dot3064",
      "created_utc": "2026-02-26 20:33:51",
      "score": 53,
      "num_comments": 143,
      "upvote_ratio": 0.88,
      "text": "Hey everyone, I’ve been wrestling with this for a while and wanted to come get an outside perspective.  Three years ago, I made a massive career gamble: I transitioned from a domain-expert role to Product.  When I made this transition, I had never so much as written a line of code, and I had no familiarity with software development / IT concepts.\n\nWhen I became a product owner, I thought my mandate was clear: write requirements, define a roadmap, and work closely with technical execution to ensure that we built a product that has value for the end user.\n\nI’ve had this problem:\n\n1. My requirements are never specific enough.  I have tried everything.  I started with long paragraphs, and bulleted AC, but there were always omissions.  I didn’t realize that I needed to identify every tool tip, pixel width, backend relationship, dependency, and detail of the story.  I’ve tried building Figma mockups & vibe coding interactive AI prototypes, but the devs say it is not helpful if I don’t define the front end component to be used, define the backend architecture, etc.\n\n2. Failed to technically mentor the devs.  I’ve learned a lot about database design, but I still don’t know enough.  For example, in my stories I haven’t recommended property audit logging, and I sometimes don’t identify every foreign key required.  I try to highlight in UI where to get relevant fields, but if the UI does not name something the same as the database, the devs can’t find it.\n\n3. I’ve failed at estimating work.  The devs regularly tell me features will be done at the end of the day, but then they aren’t.  I ask them to show me what they have, and they pull up code.  I’ve clarified that definition of done means that the feature must be merged (not sitting in local), acceptance criteria must be followed, you cannot break existing core functionality when you merge it in… but these high level rules are not enough. \n\n4. I fail to prioritize appropriately.  I have a clear vision of what the product needs to do from a user perspective, but I poorly direct the devs on backend order.  I try my best to tell them the order that tables must be made, code must be written, what environments to merge to and when…but I make mistakes.\n\nA few of the above are my mistakes.  Software development is hard, and directing it is no joke!  At this point, the senior devs and engineering manager have escalated to leadership that I ak failing to direct development correctly, and the stress is eating me alive.  I haven’t taken a vacation in years, and don’t remember the last time I had a weekend off.\n\nThis whole product owner thing is no joke.  I think it’s time for me to hang my hat, and go back to being a domain contributor.  Props to the people here who make it work.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1rfljjg/im_coming_to_terms_with_the_fact_i_am_not_cut_out/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o7kwkia",
          "author": "tarvispickles",
          "text": "Idk this might be controversial but it kind of sounds like your dev team sucks.",
          "score": 145,
          "created_utc": "2026-02-26 20:41:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7kxizx",
              "author": "Fluid-Scar-6020",
              "text": "Exactly my thougths. My devs would reject stories if I were to start designing databases or API structure. These devs just suck ass",
              "score": 53,
              "created_utc": "2026-02-26 20:45:45",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o7kybo3",
              "author": "Apprehensive_Dot3064",
              "text": "I’m new to this line of work.  Sorry if this is a broad question, but: what should the devs / EM be doing differently?\n\nThe organization’s philosophy is that I own dev quality, career advancement, timelines, etc.\n\nI felt that the EM should be doing some of this and escalated it to management.  They said I was a “low accountability individual”, and that “product problem solvers” like me figure out how to improve dev velocity & quality.",
              "score": 7,
              "created_utc": "2026-02-26 20:49:31",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7kzyby",
                  "author": "NoYOLOBro0013",
                  "text": "Not a product job. You’re correct that is definitely an EM responsibility.",
                  "score": 29,
                  "created_utc": "2026-02-26 20:57:15",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7l069v",
                  "author": "Fluid-Scar-6020",
                  "text": "Dude, being in product in short and in essence means figuring out user painpoints, and fixing them in principle. \n\nFor example:\nThe platform we're building has 200 products, and the users have no way to search for a specific one. Your job is to figure out that a) this is a problem and b) how to solve it. By implementing a search feature, a filtering feature, a messenger pigeon if that would solve it. You figure out how the solution should work, and direct the designer and the devs to figure out the technicalities. \n\nIdeally, you should have no idea what the code does as long as the solution to the problem is implemented and the users don't have the problem anymore. That's what you focus on. Everything else should ideally be offloaded onto the devs.",
                  "score": 14,
                  "created_utc": "2026-02-26 20:58:18",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7l2vl8",
                  "author": "tevert",
                  "text": "Sounds like your actual job is being an engineering manager, not a product owner.",
                  "score": 5,
                  "created_utc": "2026-02-26 21:11:00",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7ln9dn",
                  "author": "Pretty-Substance",
                  "text": "Haha classic. Let me tell you and I have 10+ years of PO experience: your manager know jack shit about the role and they’ve sent you into battle but have not given you a sword. You can only loose. Get out of there, it will kill you. \n\nThe mandate you described was accurate, everything else in the paragraphs below: not you job, period. It’s the teams job but they managed to delegate it to you. You’ve lost",
                  "score": 3,
                  "created_utc": "2026-02-26 22:50:45",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7loixo",
                  "author": "daddywookie",
                  "text": "There should be a strong triad of people. Product, Development, Design. Those three disciplines should be working together to find the best performance of the team, often alongside some kind of Producer/Project Manager, defined by the velocity of value delivered.\n\nUltimately, the PO is accountable for the value of what is delivered. In some ways your leadership is right, that can be described as falling on a top level PO. That level of PO also has full budget and strategy authority and earns far more than what you are on (think Product Director or CPO).\n\nYou might just be straight out of luck with leadership that wants to offload but not pay the price. You can try and ask for the authority required to kick the devs into line, but I don’t think that’s the game being played.",
                  "score": 1,
                  "created_utc": "2026-02-26 22:57:23",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o7lugla",
              "author": "kristentx",
              "text": "Yes.  During refinement, the entire team should be contributing, discussing, clarifying, and estimating.  If something isn't the way they like it, they have the responsibility to speak up.  The team can be persnickety about how they want to see things, but they need to give you feedback.  \n\n\n\nYour job is to define the what, your team is supposed to be defining the how, including the architectural and deeply technical stuff that needs to be figured out.\n\n\n\nOne thing I have found helpful, is having what I call a pre-refinement, with myself, the PM (if available), the DEV lead, and QA engineer.  I create the stories for what is needed from a business perspective, and if more technical info is needed, we talk about it and add those details. \n\n\n\nI have worked with a lot of teams over the years, and they each want stories done a different way.  A lot of this sounds like the team is wanting a BUR, where everything is spelled out for them, rather than following the agile process.",
              "score": 2,
              "created_utc": "2026-02-26 23:29:31",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o7lunux",
              "author": "Fugowee",
              "text": "Sounds like it to me too.\nA PO shouldn't be speccing *how* the work is done; just what is the product to be built.  The fine line reqs could be brought out collaboratively in the promise to have to have the conversation.\n\nMaybe technical POs do that....still shouldn't need to spoon feed.  Maybe a lack of trust is the issue.  Otherwise, maybe laziness or rejection of working collaboratively.",
              "score": 2,
              "created_utc": "2026-02-26 23:30:37",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o7npocr",
              "author": "fluffy-8656",
              "text": "I would suggest finding a new job! You might find you enjoy the product owner or PM role more if you are not surrounded by people who take no technical responsibility.",
              "score": 1,
              "created_utc": "2026-02-27 06:28:25",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7kx82x",
          "author": "99ProllemsBishAint1",
          "text": "You need a more clear line between what you're responsible for (the what and the relative priority) and the engineering teams are responsible for (the how including sequencing of the technical pieces). Sounds like you're getting blamed for failures because you don't know the boundaries of your role. I'm sure you have things to improve on but your biggest problem is demarcation of responsibilities. Your senior leadership shouldn't be letting this happen but you need to get informed as well.",
          "score": 100,
          "created_utc": "2026-02-26 20:44:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7kyp1a",
              "author": "Apprehensive_Dot3064",
              "text": "I’ve done a lot of research, and tried to establish a RACI chart.  I’ve also going to senior devs, directly to the EM, and to the VP of technology.\n\nThey all say that this is my problem to solve, and I am a low accountability individual for trying to split responsibilities.  They said that “the buck stops with product”.\n\nThey said I have two choices:\n\n1. Fire the dev team, and use Claude Code to build it myself\n2. Fix all of the above issues myself, without involving them.",
              "score": 9,
              "created_utc": "2026-02-26 20:51:16",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7l2ial",
                  "author": "cardboard-kansio",
                  "text": "Honestly it doesn't sound like your developers are participating, helping, or in any way being particularly active. Depending on your domain, option 1 is likely to be the better option. \n\nRun for the hills, friend.",
                  "score": 37,
                  "created_utc": "2026-02-26 21:09:17",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7l4bwl",
                  "author": "pinks85",
                  "text": "Sorry to say, but sounds like your org needed a scapegoat role and decided to call it \"Product owner\".\nFrom reading your other comments here, it seems to me that everyone BUT you is the low accountability individual.\nI guess in your situation, Claude code would be the logical choice out of the two you were given. You already do everything except writing code...",
                  "score": 51,
                  "created_utc": "2026-02-26 21:17:49",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7l9kpt",
                  "author": "Drevicar",
                  "text": "CTO of a SWE company here. This isn’t a healthy response, and the expectations and job descriptions placed on you aren’t realistic. Yes, the PO owns all the responsibilities and blame, but that means you need to delegate to your team and trust but verify their outcomes. Doesn’t mean you need to inspect the outputs, but find a way to hold the accountable for their own work such that once it gets back to you, you can safely take ownership of it. This is a team responsibility model. What it sounds like your VP is describing is a principle engineer turned engineering manager turned product owner. Which means you should be making a TON of money to have that kind of responsibility. I wouldn’t ask that much of anyone making less than $500k USD for perspective, maybe a bit more.",
                  "score": 15,
                  "created_utc": "2026-02-26 21:42:44",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7l3cql",
                  "author": "99ProllemsBishAint1",
                  "text": "They sound very toxic. If firing the dev is a real option I'd truly consider it if I were you, but the problem sounds like it's with leadership. They've got severe toxicity in their org and they need to root it out, but they're just blaming you. It's very short sighted of them when they have a PO that truly wants to improve.",
                  "score": 6,
                  "created_utc": "2026-02-26 21:13:14",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7l74ox",
                  "author": "bedel99",
                  "text": "fire the dev team, fail at using claude code, then get fired yourself. You are going to get fired anyway. Burn the place to the ground. \n\nClaude is great at deleting all the your repos and force pushing, i bet there is no proper backup. LET IT BURN! \n\n",
                  "score": 5,
                  "created_utc": "2026-02-26 21:31:02",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7m3os7",
                  "author": "justdoitscrum",
                  "text": "wtf is an em",
                  "score": 2,
                  "created_utc": "2026-02-27 00:20:40",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7p81f3",
                  "author": "ratczar",
                  "text": "This is an insane thing to say and either your mgmt is grossly incompetent or you're not telling the whole story. ",
                  "score": 2,
                  "created_utc": "2026-02-27 13:49:57",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7o9ftj",
                  "author": "hptelefonen5",
                  "text": "It don't get the Claude Code thing.\n\nShouldn't they just fire the team if Claude Code and you can do the job? That would cut cost by 80% or something.\n",
                  "score": 1,
                  "created_utc": "2026-02-27 09:27:13",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7kye24",
          "author": "404_scramps_notfound",
          "text": "As a product owner you are not responsible for owning or defining technical implementation details (including database/backend architecture). Unless you’re specifically a technical PO AND engineering manager/system architect, these are things that should be owned by the dev team. \n\nAdditionally, you don’t need to know every last detail for each work item when you first present them to the team: this is what refinement is for! It’s a conversation with the team to ensure a shared understanding of the work. This includes fleshing out any missed requirements/acceptance criteria. What is the handoff like between you and your team? Are you just sending them work items with the expectation that they should take it and run with it as is?",
          "score": 30,
          "created_utc": "2026-02-26 20:49:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7kzt1n",
              "author": "Apprehensive_Dot3064",
              "text": "I’ll walk through my handoff process:\n\n1. I write all tickets\n2. I meet individually with each developer, present he stories as written.  And ask for feedback.  They never have feedback, and never have questions.\n3. I host sprint grooming & refining meetings to wider stakeholders.  I’ve asked the devs to present their stories before, but they won’t do it.  So I present, and ask the group for any questions.  There are never questions.\n4. IF it turns out anything was unspecified, devs block the work item and stop work.  They do not tell me or their manager when blocked.  I follow up with them all each at least twice daily, and that’s when I find out if they are blocked.\n5. I play 20 questions to find out why blocked .\n\n“Wha is confusing about the story?”.  \n\n“Databse”.  \n\n“What about the databases”. \n\n“Missing fields, unclear data type”.  \n\n“Which fields are missing? What data type is missing?” \n\n“Typical best practice stuff”. \n\n6. Milestones slip, and we don’t deliver.  Devs report that, yet again, the PO was unclear and that is the reason.  EM agrees.  I get screamed at.",
              "score": 2,
              "created_utc": "2026-02-26 20:56:33",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7l69r7",
                  "author": "Rezistik",
                  "text": "Why is sprint grooming and refinement open to wider stakeholders?\n\nIn every agile system I’ve worked in:\n\nPM gathers requirements including meeting with stakeholders\n\nPm creates tickets with requirements \n\nDesign if ui is involved and there’s a dedicated ui team if not this is skipped\n\nPm presents tickets to devs as a group. Devs are expected to ask questions until the story meets ready for pointing criteria and sometimes pointing is done at the same time sometimes it’s a different one\n\nPm sorts tickets based on priority. Team reflects and agrees on how much velocity is available to the team and chooses tickets/points up to the budget for the sprint. \n\nDevs do the work until it meets definition of done or ready to qa \n\nQa if that’s a dedicated step takes it \n\nOff to prod or customers or pm review the last step is more fluid and flexible in my experience \n\nThen a retro at the end of sprint where maybe demos are done and we reflect on work patterns over the past sprint to identify any velocity risks or issues\n\nYou need to turn it on your devs and fire your engineering manager if they don’t have time to manage engineering. If they aren’t asking questions and that leads to them not being able to complete the work they should feel embarrassed not you.",
                  "score": 6,
                  "created_utc": "2026-02-26 21:26:59",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7l5vwi",
                  "author": "RA_wan",
                  "text": "As a product owner of 2 teams I dont do anything of the stuff you describe.\nYou are way to much into the details. The team must answer these questions not you. Also you need a scrummaster to organize the scrum rituals and the way of working around it better.\n\n\nI suggest the following steps:\n- Let your stakeholders create userstory written in the form of: I want the product to do X. This will bring me Y. I want to see this test scenario. \n\n- I do read each story before assigning them to check if I understand why they want it. By doing this you have some indication of the business value.\n\n- Next step is to select the storys you want to refine. Refinement is done by the team itself before the userstory are added to a sprint. Your team should spend the majority of their time working on sprint times but there should be time left to spend on refinement to prepare the next sprint. \n\n- A userstory can only be planned in a sprint if refinement is done and the solution is clear. For example, 1 team member does refinement and estimation. Then presents it to the rest of the team to make sure the solution fits.\n\nBy stepping out of the refinement proces and giving the responsibility back to the team you can focus on what your supposed to be doing: talking to your stakeholders about new and upcoming wishes and backlog priotization.",
                  "score": 3,
                  "created_utc": "2026-02-26 21:25:10",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7l7d3j",
                  "author": "404_scramps_notfound",
                  "text": "Are they not calling out in standup that they’re blocked? This sounds like an incredibly dysfunctional team. And if the EM is behind it, it sounds like it’s bigger than just the team. I don’t think you’re the issue here. Personally, I would run.",
                  "score": 2,
                  "created_utc": "2026-02-26 21:32:09",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7lazwv",
                  "author": "ExitingBear",
                  "text": "As someone above said - it sounds like your dev team sucks.  That is not normal for a PO position.\n\nI'm not saying you *are* cut out to be a PO; but I'm not sure that anyone is cut out to be a PO where you work if that's typical.  Your devs are actively, intentionally breaking process.",
                  "score": 1,
                  "created_utc": "2026-02-26 21:49:36",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7kzuss",
          "author": "cardboard-kansio",
          "text": "> I am not cut out to be a Product Owner.\n\nOkay, let's explore that.\n\n> the devs say it is not helpful if I don’t define the front end component to be used, define the backend architecture, etc.\n\nYour job is to define the problem and the value to the end user: the WHAT and the WHY. Their job is to define the HOW. In other words, to develop. Architecture, languages, components, these are the job of the team.\n\n> Failed to technically mentor the devs\n\nSee above. If you are not a senior developer, an architect, or some similar technical role, then you should not be mentoring the devs.\n\n> I’ve failed at estimating work.  The devs regularly tell me features will be done at the end of the day, but then they aren’t.\n\nThe developers are responsible for their own estimates. They are also responsible for flagging any risks or blockers, and for making a bigger estimate if there is risk or uncertainty. You are not responsible for their estimates because you are not a developer. \n\nThere is a failing here, however. You should ideally be retrospecting regularly with your team on why the estimated were not accurate. No blame, just learning. Did the team make assumptions? Were there new tools or technologies in use? Were dependencies not properly mapped out?\n\n> I try my best to tell them the order that tables must be made, code must be written, what environments to merge to and when…but I make mistakes.\n\nSee #1.\n\n> Software development is hard, and directing it is no joke!\n\nWait, are you a senior developer? Or engineering manager? I thought you said product owner earlier. You are not supposed to be directing the software development, you are supposed to be directing the product vision and value generation.\n\n> I haven’t taken a vacation in years, and don’t remember the last time I had a weekend off.\n\nWhat the fuck dude. This whole thing is either an absurd troll or you're incredibly naive, and letting a toxic organisation railroad you into burnout. This is not a product problem.\n\nFor context, the whole PO role derives from Scrum. The guiding document - the Scrum Guide - is pretty short, only a few sides of A4, but clarifies pretty well the roles of the development team and the PO. You should read it. Not all organisations do Scrum (and many just apply all the lingo and labels and ceremonies without actually following anything it says), but it is pretty foundational for understanding the roles and responsibilities. https://scrumguides.org/scrum-guide.html",
          "score": 12,
          "created_utc": "2026-02-26 20:56:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7mrhv4",
              "author": "jennybath",
              "text": "Please please read this. I’m a Senior PM, accountable for 5-6 Product Owners. None of of PMs are accountable for what you think you’re failing at- this is a system failure (if you’re using agile or scrum - this is solved through refinement, team estimation, etc) and a dev failure (you are accountable for outcomes, prioritization and “the what” (the problem to solve, hypothesized solution) and end user feedback.",
              "score": 3,
              "created_utc": "2026-02-27 02:36:43",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o7nz34j",
              "author": "Leinad_ix",
              "text": "In scrum these team dysfunctions would be solved by scrum master",
              "score": 2,
              "created_utc": "2026-02-27 07:49:43",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7nzs5m",
                  "author": "cardboard-kansio",
                  "text": "No, they would be solved by the team being self-motivated and proactive. The Scrum Master isn't a manager, nor a team secretary. Please actually read the Scrum Guide before talking about Scrum.\n\n> The Scrum Master is accountable for establishing Scrum as defined in the Scrum Guide. They do this by helping everyone understand Scrum theory and practice, both within the Scrum Team and the organization.\n\n> The Scrum Master is accountable for the Scrum Team’s effectiveness. They do this by enabling the Scrum Team to improve its practices, within the Scrum framework.",
                  "score": 1,
                  "created_utc": "2026-02-27 07:55:58",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o7l0rrz",
              "author": "Apprehensive_Dot3064",
              "text": "We do retrospectives every sprint, but it’s me monologuing.  They have never left retro comments, or meaningfully participated. \n\nI agree that this doesn’t seem right, but all attempts to escalate and correct the issue lead to leadership saying it is my problem to solve.",
              "score": 1,
              "created_utc": "2026-02-26 21:01:06",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7l1w8u",
                  "author": "cardboard-kansio",
                  "text": ">We do retrospectives every sprint, but it’s me monologuing.  They have never left retro comments, or meaningfully participated. \n\nWell then you're not really doing a retrospective, are you? \n\nHonestly, there are places where this process works great. You are not at one of those places. Start polishing your CV and looking for a new job - it doesn't sound like this is a great place to be, even if you change from the PO role.",
                  "score": 10,
                  "created_utc": "2026-02-26 21:06:25",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7l82x8",
                  "author": "Rezistik",
                  "text": "I’d solve it by wiping out the worst of the team and hiring someone with work ethic. \n\nMake it beyond uncomfortable for them to not speak. \n\nWhat I would do as an engineering manager sitting through silent refinements is directly ask a team member “hey personName how would you implement this? What dependencies are there?”\n\nThen ask someone else for their thoughts or move on depending \n\n\nI’d generally only pick on people who I knew wouldn’t be like hurt to be called on. I try to avoid anyone who is like clearly uncomfortable in groups. It does mean sometimes people feel uncomfortable for being called out but it has to happen. Silent refinements are recipes for missing deadlines and stress. \n\nFor some reason your devs feel no stress and you feel it all so it’s time to fix that.",
                  "score": 4,
                  "created_utc": "2026-02-26 21:35:35",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7mdgoa",
                  "author": "Smgt90",
                  "text": "I think you should look for another job. This sounds like a deep organizational issue that is not going to improve.",
                  "score": 2,
                  "created_utc": "2026-02-27 01:15:28",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7kyi2a",
          "author": "Uncle_Daddy_Chiliman",
          "text": "It's not product's responsibility to have a working knowledge of technical details. If you are providing actionable user stories, figma mockups and as a team defining the acceptance criteria then you're halfway there. Work with your manager on what should be prioritized. Work with your technical lead to estimate how long a feature will take to complete. Update the appropriate stakeholders on what they need. Don't be afraid to ask stakeholders for help or assign a dev to do so. \n\nMaybe you just need to get on udemy or take a class and get certified for PO level one to get a better gist on the basics of agile.",
          "score": 6,
          "created_utc": "2026-02-26 20:50:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7l0f4u",
              "author": "Apprehensive_Dot3064",
              "text": "I write user stories, but the devs say that they aren’t actionable.  For instance, I:\n\n1. Don’t list dependencies for them to check for always\n2. Don’t list out important features to not break with changes\n3. Migration plan \n4. Haven’t highlighted the sections of code to change\n5. Defined flows.  For example, I wrote a story to create an Undo button.  The button was added, but non functional on testing.  Dev said i was ambiguous because I hadn’t written out examples & migration paths to revert system to prior state, and if read as a “front end story”.",
              "score": 2,
              "created_utc": "2026-02-26 20:59:27",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7l3ool",
                  "author": "nospacebar14",
                  "text": "Is the dev team outsourced and/or contractors? Because it sounds like your management is cheaping out and getting what they pay for.\n\n\n\"Don't list important features not to break with changes\" part of my job as an engineer is to not break any features with changes!",
                  "score": 8,
                  "created_utc": "2026-02-26 21:14:46",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7l6l7s",
                  "author": "Internal-Alfalfa-829",
                  "text": "And indeed you should not be doing ANY of these things. This is all the developer's role. Are the actually REAL developers, or just code monkeys? Developing INCLUDES coming up with the way of solving the task and achieving the desired outcomes, managing dependencies and pitfalls and so on. Your job is only a well-defined \"what\" and \"how do we know that it was achieved\" (acceptance criteria).",
                  "score": 2,
                  "created_utc": "2026-02-26 21:28:29",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7l6svg",
                  "author": "Rezistik",
                  "text": "Devs should own technical dependencies while scrum master or product owner should handle organizational dependencies. \n\nYour devs genuinely sound lazy and dumb like the undo story is unreal. My pms have sometimes barely been technical enough to understand my explanations and I would never expect them to open github",
                  "score": 1,
                  "created_utc": "2026-02-26 21:29:30",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7pwvnz",
                  "author": "jqueefip",
                  "text": "1. Not your problem.\n2. Not sure exactly what this means, but maybe your problem.\n3. Not your problem.\n4. Not your problem.\n5. Yes, your problem.",
                  "score": 1,
                  "created_utc": "2026-02-27 15:56:37",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7l257y",
          "author": "perica66",
          "text": "This sounds like rage bait / troll post.\nObviously 90% of mentioned stuff is not a responsibility of a product person.\nOrder of table implementation, hahaha. Even a role like architect shouldn't tell devs the order of component implementation. \n\nAnd insisting on a Product Owner role name, I find it to provoke Product Managers among us.\n\nIf you are not a troll, than quit that job, if not yesterday, than today!",
          "score": 4,
          "created_utc": "2026-02-26 21:07:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7leto7",
              "author": "daxel",
              "text": "I can’t believe OP is serious and how anybody can take OP‘s post or comments seriously. To me this is so obviously written in a complete anti-way of doing things that it I cannot believe it to be true. You would have to be really smart/deliberate to do everything that wrong.",
              "score": 2,
              "created_utc": "2026-02-26 22:08:11",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7qqulk",
                  "author": "Uncle_Daddy_Chiliman",
                  "text": "I came to a similar conclusion after I replied yesterday. Got to be a troll!",
                  "score": 1,
                  "created_utc": "2026-02-27 18:18:13",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o7lnv8c",
              "author": "pinotberry",
              "text": "Each post I read from OP my jaw gets further and further to the ground and my finger closer and closer to hitting reply. But there is so much wrong here that I doubt a comment could be remotely helpful. So thank you for sparing me the mental energy.",
              "score": 1,
              "created_utc": "2026-02-26 22:53:56",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7nonjp",
          "author": "greftek",
          "text": "I don’t think your problem is that you are a bad product owner. I think you don’t understand the separation of accountability between you and the devs:\n\n1. A product owner should not supply requirements but describe desired outcomes (with several criteria important for its success) they don’t need to be exhaustive but enjoy for developers to start building a solution that can be  validated quickly. Ideally that validation is done by actual users that benefit from the feature. \n\n2. Is not your role to mentor your developers technically. Your developers should help each other with that. You can mentor your developers on things that will make decentralized decision making during development possible. If a skillset is insufficient available in order to realize working, valuable increments of your product you need to collaborate with the developers on how best to fill that gap. \n\n3. Whenever anything is estimated this should be done by the people doing the work, not the product owner. Estimates _might_ help with planning and forecasting but in reality it’s messy and never accurate. Try to focus more on setting goals for a sprint this allows your developers a level of flexibility that will allow to deliver valuable outcomes rather than a fixed scope of planned work. At the end of the day it’s about the outcome. \n\n4. Your product backlog should describe end user outcomes.  It’s for the developers to figure out how to achieve vertical sliced functionality. It’s not your task to direct your team in their work; they should know that better than you do in the first place. \n\nYour sole purpose is to maximize value in product delivery by guiding developers what (functional) problem/ability should be tackled first. Your focus is on understanding customers and the market in relation to the product you’re trying to create, then convey that understanding to your developers so they can be creative problem solvers, rather than following your technically flawed instructions.",
          "score": 5,
          "created_utc": "2026-02-27 06:20:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7lkmjb",
          "author": "Shferitz",
          "text": "Honestly it sounds like your devs aren’t cut out for their job.",
          "score": 3,
          "created_utc": "2026-02-26 22:37:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7oj1eo",
          "author": "lat_v",
          "text": "\\>and I sometimes don’t identify every foreign key required. I try to highlight in UI where to get relevant fields, but if the UI does not name something the same as the database, the devs can’t find it.\n\n  \numm sounds live a dev problem. do they want you to be a product engineer?",
          "score": 3,
          "created_utc": "2026-02-27 10:56:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7kzyv0",
          "author": "GreatZoran",
          "text": "Hi sad to see that but i think you totally misunderstood PO role.\n\nYou are the functional expert who rule the product and establish clear priority.\n\nYou don't code and so don't estimate.\n\nStories acceptance criteria and priority are what you own. BUT you getting them ready is a team work with.... tadaaa  .... refinements \n\nA good story is INVEST (look online the acronym)\n\nLook like you miss completely the role content.\n\n Remember one thing Agile is Lean manufacturing  applied to development.\n\nPO is one element but not everything rely on him. It's team work and good sense overall your common goal is to find as a team an organisation that is effective to deliver what is needed with correct level of quality with a predictable flow",
          "score": 2,
          "created_utc": "2026-02-26 20:57:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7l187s",
              "author": "Apprehensive_Dot3064",
              "text": "I agree; but if I delegate it to devs, they do not do it and blame me.  The org backs them.\n\nIf I do not do all of this, the product will fail and I’ll be accountable.",
              "score": 1,
              "created_utc": "2026-02-26 21:03:15",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7l2vyj",
                  "author": "GreatZoran",
                  "text": "I think they feel not responsible of the product and hide behind process.\n\nGet clear on priority (like pick 5 story only) and the value on each one. You want those only and there won't be any other topic for next sprint planning.\n\nThey can challenge you on functional stuff or edge cases. Of they start asking you for implementation this is their realm and you don't give a shit. \nYou are here for functional validation to validate it work as intended in the AC\n\nGood luck get them on-board on their responsabilities\n\nYou need a scrum master to do his job if you have one.\n\nYou can also build a responsability matrix to explain them the role. You are all implicated on your product success not only the PO",
                  "score": 1,
                  "created_utc": "2026-02-26 21:11:03",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7l1ceq",
          "author": "Abouttheroute",
          "text": "Seems you try to be a product manager, but the team expects a tech lead. Every step you describe screams failing dev org to me.\n\nTo shine some light: I’m a product manager myself, for the UI we have designers, and a good design system where everything fits. My tech leads do estimates code level ordering, and technical design. My responsibility is mapping business objectives to solutions, align all stakeholders, and prioritize between initiatives. Tech leads, designers, and engineers are my virtual team and I interact with them daily. I give my input on architecture and challenge them on solutions, but the moment I try to tell them what keys or code  to use I think they will spend the rest of the day roflmao-ing.",
          "score": 2,
          "created_utc": "2026-02-26 21:03:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7l1zfo",
          "author": "ya_rk",
          "text": "maybe you're not cut out to be the role your comapny expects you to be. it's not a PO role (doesn't matter that they call it that), it sounds more a team lead for bunch of inexperienced/entitled devs. A PO role is not technical oriented, it's business and customer oriented: Your concerns are what impact your product is making with your customers and how it is affecting the business.\n\nIt has nothing to do with anything you describe.\n\nSo, maybe you are cut out to be a PO! Because so far you haven't experienced it at all yet.",
          "score": 2,
          "created_utc": "2026-02-26 21:06:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7l37i8",
          "author": "_nanoNexus_",
          "text": "A lot of the issues you've mentioned are not attributed to your role as a Product Owner but I hope you're seeing that this stems largely from the behaviour and attitude of your team towards the work and towards you.\n\nOwnership of the software development process rests heavily on engineering teams. So it begs the question, what kind of partnership/support does your EM provide to you? As far as facilitation of the ceremonies go, where does your scrum master fit in all that?\n\nOne of the core tenets of agile is empowerment, it seems that your team is nowhere near that. They feel empowered enough to not work on stories that they deem incomplete but not enough to take ownership of some of the technical issues that they face and pushes accountability towards whoever it is that's up the chain.\n\nAnd quick reminder as well. Don't beat yourself up so much. You have to start setting clear boundaries of what you really own: that is product vision and strategy.",
          "score": 2,
          "created_utc": "2026-02-26 21:12:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7l63kk",
          "author": "Internal-Alfalfa-829",
          "text": "Where is your Scrum Master? It's part of their responsibilities to help you overcome this.",
          "score": 2,
          "created_utc": "2026-02-26 21:26:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7lbxtr",
              "author": "Apprehensive_Dot3064",
              "text": "No scrum master has been hired, there’s no budget for the role",
              "score": 1,
              "created_utc": "2026-02-26 21:54:08",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7lgq7x",
                  "author": "Internal-Alfalfa-829",
                  "text": "I'd argue that the damage caused by this situation eats up a lot more budget than 60-70k EUR (Central Europe, US is likely higher) for a Scrum Master would. But companies love wasting a lot of money just to avoid spending a little bit of it.\n\nIn that case I recommend you take a few hundred bucks and get yourself trained up as a Scrum Master. Online course from [Scrum.org](http://Scrum.org) is pretty ok and not too hard to get the cert while you're at it. Or you buy a full 2-day training for a weekend, which is about 1.5k EUR/USD. Either way, stick to a training provider that is approved by Scrum. org or the Scrum Alliance, if you don't buy from them directly. Don't get a knockoff of unknow quality from a random on Udemy. The one I had almost caused me to fail when I would have had more correct answers without him - he injected too much of his own opinion.\n\nThis will give you a good new perspective and some tools and mindsets. Whether you get them to open up or not, you will be increasing your own value no matter what. Especially in case this turns into you looking for a different company.",
                  "score": 1,
                  "created_utc": "2026-02-26 22:17:40",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7ldbmg",
          "author": "Pyroechidna1",
          "text": "OP, may I ask what country you are in?",
          "score": 2,
          "created_utc": "2026-02-26 22:00:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7lig2k",
          "author": "rigatoni-man",
          "text": "Seems like the expectations on you don't really match what I'd expect.  Particularly mentoring devs and defining the tiniest of details.\n\nMy responsibilities often have gray area, but usually when the team spirit is good we don't focus on the fuzzy boundaries and all do our part to make the best product we can.",
          "score": 2,
          "created_utc": "2026-02-26 22:26:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ocdpl",
          "author": "1tonsoprano",
          "text": "Do you not have a tech lead or an architect with you? some of the parts that you are saying is their job not the product owners job.....please talk to your manager.....i get the mockups and user story part but this part \" pixel width, backend relationship, dependency,\", this part \" audit logging, and I sometimes don’t identify every foreign key required\"\n\n\"estimating work\" - traditionally this is done by the whole team by going over each user story individually\n\n  \n\" the order that tables must be made, code must be written, what environments to merge to and when\" literlly the job of the technical lead and not your job",
          "score": 2,
          "created_utc": "2026-02-27 09:55:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7sh21l",
          "author": "richownsyou",
          "text": "Am I shocked by what I’ve read. I really don’t think it’s a you problem. Your org and dev team sucks\n\n\nEdit : I think I’ve been rage baited and trolled lol",
          "score": 2,
          "created_utc": "2026-02-27 23:34:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ujxn7",
          "author": "Bowmolo",
          "text": "The trouble is: You are telling people what to do. You should be giving them a problem to solve.\n\nA POs job towards the team is to give a good description of a (business-)problem worth solving and why it's worth solving. \nThe Engineers job is to figure out how to solve it.\n\nIMPORTANT: If they are incapable of doing that, you have a engineering problem, not a Product Management problem.\n\nA POs job towards stakeholders is to come up with a reasonable outlook of business problems you'll be solving so the product advances.\n\nYou are not acting like a PO, you are acting like a Development Manager or Lead Developer. And for that, you may lack expertise. \n\nThe next trouble is: Good engineers will flee from the team or never join it in the first place, if you don't give the team problems to solve. A good engineer doesn't want someone else giving her/him directives on how to solve problems. They don't want to argue with a PO about what's essentially their domain.\n\nEngage with the senior devs and the engineering manager and negotiate about that, making it clear what your job as PO is and what their job as engineer is.\n\nAgain: If the senior devs don't welcome this perspective, they are not senioric. They are - if your description was correct - essentially asking for more detailed/correct orders on how to implement things. And that's what junioric devs do. \n\nIf they reject this perspective either escalate or get out of there.",
          "score": 2,
          "created_utc": "2026-02-28 08:20:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7l0h5j",
          "author": "Electronic_Claim_315",
          "text": "You need a Solutions Architect or a Dev team lead",
          "score": 1,
          "created_utc": "2026-02-26 20:59:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7l0orn",
          "author": "PhaseMatch",
          "text": "**TLDR;  My take would be that the first two have nothing to do with agility, and that's chewing up your time so you can't deal to the last two.  Your system of work sucks, not you.**\n\n**1) Nothing agile to see here.**  \nA team wanting detailed requirements is a huge red flag;  that's exactly the kind of \"heavyweight\" stage-gate sign-off stuff that lightweight agile methods replaced.  Your job is to bring the team business problems to solve.    \n  \nThe teams job is to work with you and relevant user-domain SMEs to uncover the real requirements needed.  \nWe do that iteratively and incrementally using working software as a probe, in close collaboration with the users. \n\nLook into things like User Story Mapping and the role of the \"onsite customer\" in XP.\n\nThe team wants to be spoon-fed to avoid any risk of blame.  That's a biiig cultural fail.\n\n**2) Nope. Nothing Agile here either.**  \nYour job is to bring them technical problems to solve, not solutions to be implemented.  \nTheir job is to collaborate with you and the users to design a potential solution (hypothesis to be tested)   \nYou then all work together iteratively and incrementally.  \n\nLinked to the first one.\n\n**3) Well, that's a maybe**  \nYou do need to be able to forecast delivery and value, but that's also part of how you collaborate with the team, and it's hard.  Mostly the issues tend not to be \"time on tools\" but the flow of work from start-to-end, which is where lean concepts come in.  Look into \"Actionable Agile Metrics for Predictability\" or the getNave plugin for Jira/ADO and so on for a different perspective.\n\n**4) And that's a maybe**  \nif you have a business-outcome based roadmap than mainly what you need to be doing is brining them problems to solve, not solutions.  And certainly not adding detail too early.  User story mapping and so on is your friend\n\n",
          "score": 1,
          "created_utc": "2026-02-26 21:00:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7l18om",
          "author": "lakerock3021",
          "text": "First: that sounds like a lot to carry, it sounds like you have been through a LOT, and I don't want to go through what you have been through. That sucks.\n\nSecond: I'll make the observation that the expectations you are failing to live up to sounds more like a technical project manager than a Product Owner. Based on this post, I don't think you have actually had a PO role because this organization isn't looking for one. I'd encourage you to try your hand at another PO role- vet the role significantly to make sure it is what you have experience with and are able to execute on.\n\nBelow I have responded to the (IMO) ridiculous expectations this org has placed on you. They are more of a criticism of the org and whoever trained you for this role. I apologize if they come off harsh, that is not my intention. Use whT is helpful, disregard what is not.\n\n*\"Didn't know I had to define every tool tip, every pixel width...\"* you don't need to define these, unless it is a requirement for the outcome you have asked for. At the same time, don't reject work because it doesn't look or feel like what you thought it should, unless it is a requirement for the outcome.\n\nIe: building a calculator- what is needed for the user to be able to add two numbers together? Does it *need* to have grey buttons? Does it *need* to have a \"led style\" screen? If these are not things necessary for a user to add two numbers together, don't make them a requirement. That is up to the devs to figure out in an effective manner. They may want some security that if they make the number inputs sliders that it won't get rejected (okay, a little silly) but if having 0-9 button inputs is a requirement *then* it needs to be in the requirements.\n\n*\"Failed to technically mentor the devs...\"* Wut? Why would they ask a Product Owner who has not dev experience to mentor the devs, no offence but I wouldn't want you giving ANY technical input, you are the Product Owner, not the Technical Team Lead, or the Dev Manager, or the technology SME. Poor sport on the company's part. To be fair I also have no technical experience and don't want me giving technical input or direction for the team.\n\n*\"I've failed at estimating work...\"* Honestly, good. Let the people doing the work estimate it. You don't need to be able to look at some code and determine how much longer it will take. If the dev commits to having it completed and they don't, have them give you an updated estimate. If that happens a lot, have a conversation with the team about the benefits and pitfalls of estimating and what the estimates are being used for (from a business standpoint)- or better yet have your SM lead that conversation in a retro (they will need your input tho). <- all this doesn't even touch on the pitfalls of estimations.\n\n*\"Fail to be able to prioritize...\"* Okay, here is the first point that feels even remotely like a legitimate expectation of a PO. Knowing what the highest value outcomes are for the product is where you need to point your focus. Talk to users, I mean like talk to a LOT of users, get feedback and input anywhere you can (from users, not from randos). What are the features and outcomes they are asking for the most? There is your answer.\n\nAs far as \"what order to build the backend in\" - you should not know that, you are not a dev. Set out the priority as an outcome or a feature and let the devs decide what needs to happen first and second. Have these conversations as part of your backlog refinements, \"here is the outcome: X, what do we need to do first to deliver that outcome?\"\n\n---\n\nI hope that this is helpful, feel free to reach out if you have more questions or are looking for clarifications. Best of luck my friend!",
          "score": 1,
          "created_utc": "2026-02-26 21:03:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7l3h2p",
          "author": "SuspiciousChip7756",
          "text": "I think you are being dragged to every possible direction. As majority of the comments saying that it's not your responsibility to give the technical requirements, it depends on the org to org. \n\nI used to do the designing, sales, EM, and Testing as well. So it's a nightmare. \n\nJust few things that can help you figure out the things  \n  \n\\- Do you have a sprints? if Yes, do you track the velocity and respect the deliveries?  \n\\- Does your VP or Leads have any understanding of PO role or PM role?  \n\\- If all the devs are getting blocked, what is it they are delivering?\n\nI don't think you can solve all of these at once. Try doing some of these  \n\\- scope yourself for the next couple of sprint, which means reduce the tickets and ticket sizes for next couple of sprints  \n\\- Once you prepare the requirements, post discussion, send a mail to each to revert back if they have any issues and estimates(put it in written)  \n\\- Give a heads up to your VP that you got the approval from your dev, again a written communication  \n\\- Once sprint starts, you prepare for next sprint\n\nmore than anything one thing I would suggest you is reduce the number of meetings with devs. \n\n  \n",
          "score": 1,
          "created_utc": "2026-02-26 21:13:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7lbne7",
              "author": "Apprehensive_Dot3064",
              "text": "1. We have sprints and track velocity.  We miss all targets and never hit deliveries.\n\n2. No\n\n3. Nothing, hence the problem.  \n\nThe problem is, if I don’t meet with devs, they simply stop working.  And then I’m blamed.",
              "score": 1,
              "created_utc": "2026-02-26 21:52:44",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7lh4ra",
          "author": "CautiousCactusCat",
          "text": "You seriously need to establish a RACI chart and get leadership support. If they remain toxic about it, GTFO.  I’m a PO and actually capable of coding and designing. I still don’t give them any technical solutions or feedback. It’s the engineering team for coming up with a technical solution to a business problem. If they’re demanding stupid things like column width and whatever, get a UI expert involved to specify. At most, I use ppt to make up some mockups. \n\nThe PO role really does suck though. It’s the person who gets caught in all the crossfires because they are the “owners” of the success and failures. I’m expected to be a project manager on top of all the PM activities.",
          "score": 1,
          "created_utc": "2026-02-26 22:19:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7lkfvn",
              "author": "Apprehensive_Dot3064",
              "text": "We have a UI expert, but…as you’d imagine, they are unresponsive, or require extreme direction.\n\nIf a dev asked the UI expert about column width, the UI expert would either come ask me or specify something like “make every column page width and do a long horizontal scroll”.",
              "score": 1,
              "created_utc": "2026-02-26 22:36:17",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7lo27o",
                  "author": "CautiousCactusCat",
                  "text": "[ Removed by Reddit ]",
                  "score": 1,
                  "created_utc": "2026-02-26 22:54:57",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7lpm8i",
          "author": "kate_the_squirrel",
          "text": "I’m not a product owner but I do supervise a team of business analysts who are responsible for system requirements and work with a dev team. We are always careful NOT to provide too much direction on technical implementation because that is the responsibility of the dev team. You are there to determine how the system functions, but they are there to build it using their technical expertise. I really feel like your organization is pushing for you to take on responsibilities outside the scope of your role, and that your devs and their management are slacking and/or lack skill and are trying to pin their performance issues on you. Frankly, I would look for other opportunities. I think you would be perfectly happy/successful as a product owner in a place where expectations are standard for the industry.",
          "score": 1,
          "created_utc": "2026-02-26 23:03:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7lrtwt",
          "author": "lunivore",
          "text": "Scrum, and the role of the Product Owner, were originally created in a time when the Product folks just didn't get to talk to the devs about what it was they wanted. At all!\n\nAnd some people worked out that if you put someone who really wants something in a room with some technical people who can make it, magic happens.\n\nThe person who really, really wants the thing - who fought for it, got it prioritized ahead of 12 other people wanting their pet project to shine, who safeguarded the budget and persuaded the board it was important - they're the Product Owner. But in a larger enterprise they're usually too busy to spend time with the team (let alone 12 of them) so someone else acts as their proxy with the teams, communicating their vision and helping the teams work out what that looks like as best they can.\n\nLet me break down what that looks like.\n\n* My requirements are never specific enough.\n\nNobody's requirements are *ever* specific enough. You are a human being with limited time, attention, memory and focus. The dev team are human beings too. Every team which has tried to focus on making requirements super-specific has ended up creating an lot of documents (or JIRA tickets) that end up in the bin. This is what the Lean / Kanban folks call \"waste\". It doesn't contribute to the end goal. It is not getting anyone closer to the work being done.\n\nYour job is not to be super-specific. It's to communicate the *intent*.\n\nEver seen the film \"Fury\"? It's about a bunch of army guys holding a crossroads with a tank. The reason they do it is because they know *why* and they know why it's important. That's what you need to do. Then you can say \"I think a tank might work, what do you think?\" and you have a conversation about how that might fall out. If you've got some really great UX people use them, but if you haven't, treat everything as an experiment. In software development, if the tank blows up, we just roll it back (this does not include things which are not safe to fail like data integrity or security, so seek out *experts* for those).\n\nI recommend reading \"Turn the Ship Around\" - it's a very small book, very easy read, wish I had read it sooner.\n\n* Failed to technically mentor the devs.\n\nNot your job. Your job is to explain the *problem* clearly, not to come up with *solutions*. There are other more senior devs for that. Focus on the problem space. Explain why it's important, provide realistic (preferably real) examples of the problem, listen to the compromises the devs ask you to make.\n\n* I’ve failed at estimating work.\n\nYeah, we've all been there. 30 years in the industry now and still not much better at it than when I started. The only thing we learn from estimating over the years is that we all suck at it. It's OK. Also, estimating depends mostly on how the solution needs to work, and...\n\n* I fail to prioritize appropriately... I poorly direct the devs on backend order.\n\nPrioritize the *problems* and the context in which the problems need to be solved. Got 15 countries to ship to in 7 different languages? Focus on the first of those. Got 6 situations in which you cannot possibly say \"yes\"? Focus on saying \"yes\" to the narrowest, safest context and add the other rules in as you go. Let the devs worry about what's back-end and what's front-end.\n\nIt could be that you're expected to be a technical analyst, and if that's your job then by all means worry about front vs backend, data integrity, security, microservices, etc. and you might well decide to go back to being a domain expert. I wouldn't blame you.\n\nBut if your job is genuinely to represent the people who fought to get the large-scale problem on the table and funded, *that's* the job of a Product Owner, and the devs should be helping you with it.\n\nI will say that I'm not a fan of Scrum (where the Product Owner role comes from), mostly because it lends itself too easily to being done really, really badly. But one thing it does do well is make the team *one team*, collaborating to solve a problem. If that's not where you are, it's not Scrum.\n\nMaybe some of the above will help you have conversations to clarify what your role really is. Wishing you luck regardless.",
          "score": 1,
          "created_utc": "2026-02-26 23:15:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7lw0kk",
          "author": "hofo",
          "text": "It sounds to me like you are doing a lot more than just product owner. PO should say what they want, the devs are supposed to estimate work, an architect is supposed to design a technical implementation that fulfills your requirements. PO isn’t supposed to do everything.",
          "score": 1,
          "created_utc": "2026-02-26 23:38:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7m3mf7",
          "author": "Forgot-pas",
          "text": "As a product owner you will need to define the ask as clearly as possible. The ask in an Epic should capture the function, the data source, the necessary integrations, the mvp, defining exact outcomes, the existing business rules. The tech team will then scope, estimate and write out the stories, acceptance criteria’s, the test cases to the last minute detail. There will be gaps but we address them as we go. Product owner doesn’t need to get into estimation (other than tee shirt sizing), and drafting technical solution but should have clarity on the outcome of the solution. \nOnce the epics are written out - you can prioritize and allocate based on the impact and size of the ask. Your knowledge about database systems will not help as the tech teams already have the expertise. They are looking for clarity in your vision to be communicated to the last detail. \nBe very clear about what your role is in the organization else it will leave you to feeling inadequate and underperforming.",
          "score": 1,
          "created_utc": "2026-02-27 00:20:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7mh8ky",
          "author": "m915",
          "text": "That’s wild, the PO I worked with was basically a scrum master who defined high level deliverables",
          "score": 1,
          "created_utc": "2026-02-27 01:37:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7mxo67",
          "author": "Any_Horror_5544",
          "text": "Devs suck, company sucks, get out of there.",
          "score": 1,
          "created_utc": "2026-02-27 03:12:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7n8ucw",
          "author": "allisonann",
          "text": "Do you have a scrum master? This sounds like a failure of Agile and not a failure of a PO. Almost everything you listed is not your responsibility. A few examples:\n\nYou're not supposed to estimate the work. The team is. A scrummaster could implement planning poker and help them normalize on an approach. \n\nPrioritizing work is one of your key responsibilities but this: \"I try my best to tell them the order that tables must be made, code must be written, what environments to merge to and when…but I make mistakes.\" Bananapants. None of this is your responsibility. You are supposed to write stories from a users perspective. One of the old models literally says to write stories like: \"As a <kind of user> I want to <action> so that <i get this value>\". Ex: As a high volume investor I want to see a list of all my investments over the last year clearly showing cost basis, sales price, and holding period so I can quickly validate capital gains. (Probably better if it just calculated that for you, but you get the jist...)\n\nThe crux of this is that you are in charge of the WHAT and WHY of feature development, the devs are in charge of the HOW. The should be estimating, they should be decomposing stories WITH you. And they should be determining the subtasks required to ship.\n\nI would literally take this post, dump it into your AI chatbot of choice and ask it to create a plan to take to leadership to improve the entire team's Agile literacy. You all are getting the fundamentals of Agile wrong, and if they care more about shipping a good product than making you a whipping boy they should pay attention. ",
          "score": 1,
          "created_utc": "2026-02-27 04:23:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7nftho",
              "author": "negotiationtable",
              "text": "> This sounds like a failure of Agile \n\nI mean, it sounds like the devs are failing at doing a decent job.  I'm not sure a scrum master can prevent the devs from being a nightmare if the current system can't do that either.",
              "score": 1,
              "created_utc": "2026-02-27 05:11:36",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7qb0yr",
                  "author": "allisonann",
                  "text": "Part of the scrummaster's role is to champion the agile processes. They should be reenforcing the roles and responsibilities of the team.",
                  "score": 1,
                  "created_utc": "2026-02-27 17:03:05",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7na6y2",
          "author": "av8navig8communic8",
          "text": "This is not you being a shitty PO… looks like you have a shitty team. All the problems you’ve described are things that a PO doesn’t do.",
          "score": 1,
          "created_utc": "2026-02-27 04:32:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7neq8c",
          "author": "lypaldin",
          "text": "I'm sorry, it seems like your developers are having a coup about you or whatever. \n\nIt won't work. They're just sabotaging everything and don't care. Fire them all and find new ones because it won't work until last of them is still here and carries this toxic culture.",
          "score": 1,
          "created_utc": "2026-02-27 05:03:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7noaun",
          "author": "hjjs",
          "text": "This is 100% not how we go about doing things where I am. It sounds like a company issue to be honest",
          "score": 1,
          "created_utc": "2026-02-27 06:17:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7obnq0",
          "author": "Murky_Cow_2555",
          "text": "Nothing you wrote says you’re not cut out to be a PO. It sounds like you’re being expected to act as an architect and tech lead on top of product. You’re responsible for the problem, outcomes and priorities, not database design, pixel widths or backend order. If devs are escalating that you’re failing to direct development, that’s likely a role clarity issue, not a competence issue.\n\nAlso, no vacation in years and constant stress will make anyone doubt themselves. This feels more like burnout and org dysfunction than proof you can’t do product.",
          "score": 1,
          "created_utc": "2026-02-27 09:48:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7om8sx",
          "author": "zero-qro",
          "text": "Why are you responsible to give techincal guidance to the dev team? This isn't a PO accountability, this is a architect/tech lead accountability.\nYou should focus on product matters, roadmaps, understand you user/customer problem, help to come up with a functional solution.\nHow this should be done is not your responsibility, it's the team's responsibility... If they are asking you this level of detail and baby sitting you are probably in an environment more like waterfall project setting and you are not a PO, you are a project manager.\nTBH, it seems that this is the way things roll there and change it without any external support will be hard.\nI hope you have the chance of working as a PO in another environment/company to experience the real day to day flow of the role.",
          "score": 1,
          "created_utc": "2026-02-27 11:23:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7p7mum",
          "author": "ratczar",
          "text": "I'm halfway to architect and if I tried to do 1, 2, or 3 for my team I'd fail. \n\n\nThose things aren't your job in most places. Maybe you're on a particularly technical product, but more likely you're having a leadership problem on the eng side. \n\n\nDon't beat yourself up too badly",
          "score": 1,
          "created_utc": "2026-02-27 13:47:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7pfqwv",
          "author": "slevenznero",
          "text": "You are getting played by your dev team, and you play a terrible game of Agile. You play many roles other then PO. The team estimates, not you. The team refine the stories, not you. The team create the solution design and architecture, not you. You prioritize at a higher story level, the team priorize their tasks to get it done.  \n  \nThey sensed your inconfort in your position, and they prey you open. You don't say no, and you take many responsabilities that do not belong to you. And if something happen to the product, THEY WILL PUSH YOU UNDER THE BUS BECAUSE OF THAT.  \n  \n 1) Your requirements should be medium level (PRD or alike is high level), you define the expected outcomes and business logic, and the team should be refining their stories to detail EVERYTHING you mention. You are not the UX/UI designer who wants their pixel-perfect mockup to become alive, so it's not your job to create mockups and AI prototypes and if you do, it should be taken as a very nice to have visual support for your eng. THEY need to define all the detaisl for the backend, dependency etc etc.   \nAn Agile team should have a PO/PM that identify problems that their core users face, and provides a LIMITING scope for the solution with acceptance criterias, and the product TEAM should create a solution. If you need to do all the research, design, UX testing, documentation, architecture, and spoon-feed your devs so they can copy and paste stuff in the code base you are doing most of the job, and they are shining a huge beacon on themselve to get fired. Because they are hired to create meaningful solutions, and using their technical expertise, create development safety nets to make sure the product is a stable as possible.\n\nI had an eng team like that once, crybabies eng that worked like depressive government employees, doing the bare minimum and nothing that is not clearly defined in their job description. They wanted everything you mentioned, for example, they wanted me to define the endpoints and methods for the API and write the detailed documentation. It took me 3 Sprints to realized they were using the fact that I had all the pressure to ship and they had none. The thing is I was creating the stories, assigning them to myself, coding them using Claude, including the test files, running the testing, and deploying them. And in 2 months, I no longer needed 2 devs in my team.\n\nAI is not pushing people out of employment, it's lazy unprofessionnal people that push themselves out of a job.\n\n2) You are not the tech lead, nor the architect, nor the CTO. Stay in the product lane.  \n3) It's the dev team's job to estimate, not yours. You have no say in that, you don't do the work: you shut up.   \n4) You prioritize tasks here, it's 100% in their dev team professionnal autonomy to do that. You prioritize Epics, Stories and defects. Not the tasks.",
          "score": 1,
          "created_utc": "2026-02-27 14:32:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7q1sum",
              "author": "Apprehensive_Dot3064",
              "text": "I think you hit the nail on the head in the first paragraph.  The problem is: the rest of the organization also does not understand agile.  They don’t even know any roles on the team besides me.\n\nIf I delegate to devs or EM, they ignore.  The org ain’t willing to intervene.  So I try to do everything.",
              "score": 1,
              "created_utc": "2026-02-27 16:19:57",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7pfwlm",
          "author": "myamitotoro",
          "text": "I agree your dev team sucks. Your dev lead should be working with the devs to create a technical design that meets your requirements—it shouldn’t be you telling them how to design it.",
          "score": 1,
          "created_utc": "2026-02-27 14:33:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7pnlyu",
          "author": "Affectionate-Log3638",
          "text": "It sounds like your org, like many (including my own), don't get agile, are butchering roles and improperly shifting accountabilities.\n\n1 - You shouldn't need to define all that. Your devs are acting like helpless children and not professional developers. They should be helping define these things with you. \n\nIn my PO role, myself and another PO share a Dev Lead who is a massive bottleneck. Teams can't function without her at the moment. What I do:\n- Always hit record or transcribe in meetings with her. She's a well of knowledge and goes on technical rants a lot. I use it to my advantage. Co-pilot turns all my meetings with her into user stories. \n- I make as many stories with as much detail as I can, on my own. (Using Co-Pilot, and sometimes my own knowledge.\n- Have a bi-weekly refinement with my Dev Lead (and sometimes one of the Seniors) to revise, and add more stories. \n- On opposite weeks, do the same thing with the entire team to familiarize them with the stories and catch any missing details or gaps in overall understanding. \n\n***The PO is the primary person accountable for refinement, but it is still a shared responsibility amongst the team.***\n\n2 - You shouldn't have to mentor developers technically. If you're mentoring, it should be in terms of business (how to present during demos, how to conduct themselves around stakeholders, how to communicate with customers, etc.) You're a bridge between the team and produce management. The Lead Developer should be mentoring and upskilling developers.\n\n3 - The PO doesn't estimate work. The dev team does. And I feel your pain on work not being done. Burned many times by telling stakeholders something would be done \"tomorrow\" only to find out we were literally weeks away from completion. In our developer's minds, they are done when they finished dev. Doesn't matter if it hasn't gone through code review, or UAT, to them it's \"done\". I had to really harp on definition of done and ask them repeatedly, \"when you say done, do you mean reviewed, validated, and in production by that date?\" I also beefed up our user story documentation with a template that calls out requirements, validation steps, etc. (Thank you Jira Automation for inserting the template in all the stories!) Eventually they started to adjust what they view as \"done\". \n\n4 - Prioritization is your responsibility, but the dev team is a part of the process. You should have a sense prioritiy to give the team. But they should also be vocal and share if they see something that should be prioritized differently.\n\nI can see how you have some opportunities from improvement, as we all do. The bigger issue here is that your dev team seems a disengaged and unmotivated. You're being used as the scapegoat. If you don't think you can turn things around quick enough, maybe start looking for work elsewhere. Being a PO for another team (or organization) might go a lot better for you. Don't let a toxic environment convince you that you're not cut out for the role itself!",
          "score": 1,
          "created_utc": "2026-02-27 15:11:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7pq6wn",
          "author": "merithynos",
          "text": "Get out. Your software developers want you to do their jobs, your engineering manager is straight up not doing the one thing they clearly own, and your executive management is clueless and lost.",
          "score": 1,
          "created_utc": "2026-02-27 15:24:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7t4xhm",
          "author": "ms_kenobi",
          "text": "I thought this too, but then i worked somewhere alongside an iteration manager and a BA and now my quadrant is strategy, performance, politics (saying no) and roadmap and theres is the how and the specifics of the what.\n\nMaybe you aren’t meant to wear so many hats?",
          "score": 1,
          "created_utc": "2026-02-28 01:57:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7tjnpc",
          "author": "massivebrains",
          "text": "As someone who was a developer then product owner now systems analyst, they're (dev team) taking advantage of you because you dont have a sw background and arent calling them out on their bullshit. Alot of the things you mentioned technically arent your responsibility as a product owner.  ",
          "score": 1,
          "created_utc": "2026-02-28 03:30:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7vro4a",
          "author": "Historical-Rip1757",
          "text": "Use AI.",
          "score": 1,
          "created_utc": "2026-02-28 14:16:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7vvp1q",
          "author": "Ok-Bath-3267",
          "text": "most of the things on this list aren't your job. get a good lead engineer to own basically all of the things in your list. the only thing that you should own is user stories - and relationships with user and business necessary to create them. you just need to define what outcome the user or business wants very well, and order those stories in priority order.\n\nthen you give these user stories to your lead dev and tell them to flesh each story out with technical sub tasks / implementation details. this includes filling in any gaps you've missed on ui designs or data fields or whatever. it's also you tech leads / tech teams job to estimate the size of each of these sub tasks. \n\nthen you negotiate with tech lead about what stories to do in what order based on what's high priority and what's technically easy to ship quickly. you have the final say of what goes into the sprint and in what order and what the scope of the ticket is. they have ownership of how it's implemented and what the estimated effort is.",
          "score": 1,
          "created_utc": "2026-02-28 14:39:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7yncsc",
          "author": "Al_Shalloway",
          "text": "The role of the product in Agile, as identified by Scrum,  is misguided at best, destructive at worst.\n\nIt's been this way from the beginning. See Mark Schwartz's Art of Business Value.\n\nPlanning poker is an anti-pattern as well - falls prey to the planning fallacy. I suggest checking out Steve Bockman's or Amplio's Team Estimation - faster and better.\n\nI use a combination of Design Thinking, Jobs to be Done, Human Centered Development and Lean product management.\n\nI tend to get banned if I tell you about easier ways to go beyond the PO role and other things - but i you want to message me I'll give you more information.  ",
          "score": 1,
          "created_utc": "2026-02-28 23:19:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7yyd8o",
          "author": "strongscience62",
          "text": "Early on in my career I got into one of these pissing matches with the engineering team. Eventually I just told them that there will be no perfect documentation that prevents them from implementing something stupid and they should instead interpret everything in good faith. Things smoothed out from there.",
          "score": 1,
          "created_utc": "2026-03-01 00:25:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o8111hj",
          "author": "ServeIntelligent8217",
          "text": "This post is one of the many reasons I feel strongly that every product manager needs to be trained in software architecture. In fact, it’s only logical for this training to be embedded into the role of PO/PM given its nature. It helps you complete the full picture and understand the SDLC intimately. It speeds up and improves your ability to estimate, break down requirements into stories, and work across various departments of business and tech.",
          "score": 1,
          "created_utc": "2026-03-01 09:39:54",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rcuzup",
      "title": "My company doesn’t believe in scaling Scrum and neither do I",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1rcuzup/my_company_doesnt_believe_in_scaling_scrum_and/",
      "author": "morsofer",
      "created_utc": "2026-02-23 21:45:32",
      "score": 30,
      "num_comments": 42,
      "upvote_ratio": 0.88,
      "text": "Some time ago I [posted ](https://www.reddit.com/r/agile/comments/1r0gtw3/10_years_of_agile_transformation_buried_in_6/)about how my company abandoned Scrum after 10 years of practicing it and is slowly falling back toward waterfall. Yesterday I had a chance to speak with my CTO and ask about the recent changes.\n\nTL;DR of what he told me.\n\nThe board has very ambitious goals for the upcoming years. We’re talking 'becoming a market leader' level ambition. To achieve that, they can't rely on small, incremental growth and instead need what he called a strategic leap on multiple levels.\n\nAccording to the CTO, each such leap requires 5-10 teams working together on a single product, and the company wants to execute several of these leaps simultaneously (for context IT alone has around 2000 employees).\n\nMy boss added that, in his opinion, Scrum simply doesn’t scale in this way. A single Product Owner wouldn’t be able to handle such project, so they felt the need to introduce several new roles - product managers, area product owners, analysts, etc. Hence the idea of 'improving' the agile model in ways that move us closer to a top-down planned waterfall.\n\nI have to admit, I somewhat understand his thinking. As an IT team leader, I don’t have great experiences with scaling Scrum and the literature seems divided on the topic.\n\nI’m curious about your experiences. Have you ever worked with multiple teams on a single product? Did you have to change the organizational structure, or were you able to split the system architecture in a way that minimized dependencies? Did adding more teams actually speed things up?\n\nLet me know what practices you would repeat and which ones ended up dragging the project down.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1rcuzup/my_company_doesnt_believe_in_scaling_scrum_and/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o710lj4",
          "author": "BoBoBearDev",
          "text": "Can you describe the difference between SAFe and the one your CTO described?",
          "score": 41,
          "created_utc": "2026-02-23 21:51:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o71n7v7",
              "author": "maizerage25",
              "text": "You invented SAFe - congrats",
              "score": 14,
              "created_utc": "2026-02-23 23:51:17",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o720ea1",
              "author": "MyLittlePoneh",
              "text": "But at the end of the day SAFe is just waterfall with extra steps isn’t it?",
              "score": 5,
              "created_utc": "2026-02-24 01:04:51",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o72d5o7",
                  "author": "BoBoBearDev",
                  "text": "Not really. I worked in waterfall before, especially when it was lead by system engineering. The design and AC phase is insane. If you tell developers to read it, they want to gouge out there eyes (at least for me). \n\n\nPeople don't know the extent of waterfall. In the waterfall culture, I once consulted with a team as outsider to propose a feature. I described the deficiency of the existing system and proposed a solution. They spent the entire year having 3 different developers refining the proposal I made, which I can actually complete the change in 2 months at latest. Let's just assume, maybe my proposal wasn't good enough, but none of their developer is able to create a new documents that pass the bar either. So, clearly it aint my problem. I don't know they finally implemented it or not, but they spent entire year to refine the proposal document for something I can do it in 2 months myself. It is that exhausting.\n\n\nSAFe basically only needs to come up with a concept of the plan. They described the problem they want to solve. They have a UX markup if there is UX. They handed down to the scrum teams. They don't spent a while damn year trying to refine a proposed capacity.\n\n\nIt can still run into lack of explicit ACs like scrum. But typically there is quite a lot of trust on the teams to do their work without so much information on everything.",
                  "score": 7,
                  "created_utc": "2026-02-24 02:18:59",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o76ka1s",
                  "author": "ninjaluvr",
                  "text": "Not at all.",
                  "score": 1,
                  "created_utc": "2026-02-24 18:32:18",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o715a6h",
              "author": "General-Belgrano",
              "text": "Bingo",
              "score": 3,
              "created_utc": "2026-02-23 22:14:31",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o713eyy",
          "author": "LightPhotographer",
          "text": "You don't need Agile if you know exactly what you are going to build.\n\nThis is a trap - because software is so versatile, the world changes quickly and users get new ideas when they see your software, you can not know what they need.  \nExample: Does anyone use more than 30% of the features of Microsoft Word?\n\nYou boss thinks he knows what he wants you to build.  \nWe (the software developers) worked with that 30 years ago, with contracts signed with blood and special Exception Procedures, only to be invoked in instances of Dire Need.  \nWhat happened:  \nNeeds were analyzed wrong, misunderstood, poorly written down in specifications that left room for interpretation... and meanwhile the world and our insights changed and we wanted to bolt on changes all the time.  \nThe signature in blood turned out to be pink ink which smelled of strawberries and evaporated when exposed to air or sunlight.\n\nAnd 30 years we said 'we know all the mistakes of the past, that won't happen to us!'\n\nYeah.  \nGood luck with that.  \nAgile wasn't invented because some people wanted new job titles. We don't do it for its own sake. We do it because software is inherently not plannable. Agile is a set of practices that have been proven to deal with it.",
          "score": 26,
          "created_utc": "2026-02-23 22:05:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o74m47x",
              "author": "Hot_Preparation1660",
              "text": "Software is about as plannable as repaving an airport tarmac or replacing a roof of a historic building.\n\nGenerally, for any significant project, estimates are usually about 20% over budget.\n\nMIT OCW has a whole course on the topic of why estimates suck:\n\nhttps://learn.mit.edu/c/topic/electrical-engineering?resource=6744\n\nSoftware estimates are not special. All estimates are terrible. \n\nWhat’s special about software is the ability to deliver incremental value and gather stakeholder feedback more frequently, the relative ease of making design changes in the middle of a project, and the simple reality that we are never building the exact same thing twice, because unlike asphalt, software can be copied.\n",
              "score": 3,
              "created_utc": "2026-02-24 12:53:08",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o74sy6e",
                  "author": "LightPhotographer",
                  "text": "No. \n\nAirport tarmac is a complicated problem: there are different components that depend on each other. But you can analyze, plan and predict them in advance.   \nSoftware is of the same order *if you know exactly what it is you will build*.  \n\nThis is where things go wrong most of the time. We *think* we know what we want to build.  \nBut the act of building it changes the world in a way we could not analyze in advance.   \nIt is a *complex* problem, meaning no amount of analysis will give you a 100% solution. That's because solving the problem changes the problem.    \nWonderful example was when the British in India put a bounty on poisonous snake, in an attempt to get rid of them. What happened: Clever Indians started breeding snakes. The attempt to solve the problem changed the problem. The British, not being stupid, abandoned the bounty. Then all the breeders ... dumped all their snakes.   Trying to solve it changed the problem.  \nIt can not be pre-analyzed, although it can be explained afterwards.\n\nComplex is not another word for complicated. It's fundamentally different and requires a different approach.\n\nThis is from the Cynefin framework.",
                  "score": 2,
                  "created_utc": "2026-02-24 13:33:43",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o7elooy",
              "author": "James-the-greatest",
              "text": "Absolutely could not disagree more. ",
              "score": 1,
              "created_utc": "2026-02-25 21:54:30",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o731p5u",
          "author": "ScrumViking",
          "text": "A product owner can’t handle it, yet a CEO can run an entire company using a vision, a mission and a strategy? All you need is a roadmap and you’ve got a perfectly good start to a scaled agile organization. \n\nIt’s not hard in theory but People make it hard in practice. Giving a clear purpose or goal and allowing professionals to do the right thing. Inherently the problem is trust, lack of direction and 120 years of Taylorism that still guides the hands of most people. \n\nAll this tells me that the company lacked the vision how to make it work or the courage to properly execute it.",
          "score": 8,
          "created_utc": "2026-02-24 04:54:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o732wyi",
          "author": "SeaworthinessPast896",
          "text": "Here's the biggest problem about asking this question.\n\n1. You have too many die hard purist Scrum/Agile folks who will die on their sword of Scrum is perfect, and you, your company, your CTO all don't know what you're doing.\n\n2. You'll have the next set of people who will agree with you and tell you that you'll be fine and waterfall is fine, and that going back in time is fine, and everything can be fine - as long as you have great people, you'll be fine.\n\n3. And finally, you'll have hybrid, Yes, you can tweak/try/plan whatever, without actually any tangible suggestions.\n\nEveryone loves to critique, but people here come from all audience and their feedback will be based on their frame of reference. Take their feedback as it is - opinions.\n\nHere's what you and your boss have to understand.\n\n70% of Waterfall projects failed. Agile didn't fair any better 66% of Agile projects fails. Most that fail belong to the \"medium and large\" size groups. Plenty of metrics on this released by multiple sources. Scrum, is part of the 66%.\n\nWhat's being sold - SAFe - stay away. Nothing good ever comes from doing it, but executives still buy this junk. Outside of wasting a ton of money, it doesn't change anything at the team level and only adds to the bureaucracy. \n\nHere's what else - everyone talks about successful implementations and transformations - they are all stories. NOT TRUE! Maybe someone did something and something was finally given credit as a success, whatever that means. I'm just sick and tired of these stories because most companies are full of dysfunction at every level.\n\nNow on to solution:\n\nFirst, CTO has a vision to add teams to the project - great, that's his vision. Now he should demonstrate the ability to deliver on this vision. He will run into the scalability issue right away. I've been a right hand man of a Sr VP of Eng on a large re-write project of 200 people in 6000 people company. Fought this battle first hand. \n\n1. I agree with someone who posted to add teams one a time. Don't just drop 10 teams in and tell them go on day 1. Won't happen. You need to start with one team, get it to perform, then after that launch other teams but transfer members from the original team so they can lead and show them how things are done.\n\n2. Process - if teams operate differently on every team, it won't work! Spotify failed in its model, though they described a good \"learning\" story. They use Scrum now ... apparently.\n\n3. You need centralized product goals and visibility so you can drive alignment. \n\n4. Architecture problem that needs to be solved and has tradeoffs: If you have all feature Teams, then you'll have no control or governance over architecture.... If you have all component Teams they will have better approach to a design but they will be siloed. No solution is perfect here, the tradeoffs are real. As number of Teams increase, you'll begin having a set of both Component Teams like Platform that will be providing architecture and services for other Teams. And you'll have Feature Teams that can build everything except touch Platform. Platform teams need to be scaled by consisting of the best people - cannot have a bottle neck there, or things will stall EVERYWHERE.\n\n5. Talent - large initiatives are done wrong - people are not asked to volunteer but are \"reassigned\" from other initiatives. Usually the people re-assigned are ones that can be released from one team. Critical, best people are always kept on other projects. What does that give you? The least productive and experienced bunch. Good luck with that too. So you need to recruit people from other areas in business - the best people. Or, you need to hire the right people. Also, don't just put a bunch of people together and call them a Team. Get them to naturally form Teams - try mob programming, hackathon events, but let them self create teams - they will be the strongest and the comradery built out will be better. Once you have 2-3 people on the team, let them recruit others for the purpose of growing their team themselves - selecting who they want to be part of the team. Natural leaders will evolve. But... this takes time.\n\n6. Inevitable tooling problem. Jira sucks and lacks visibility for a large project. Linear provides good tool but every Team is for itself. Metrics in both suck. Based on this... good luck getting there. \n\nThere's more to talk about, but I'm tired of typing, sorry :) If you'd like DM, me and we can explore more. Glad to answer any questions also.  \n",
          "score": 7,
          "created_utc": "2026-02-24 05:03:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o74in9s",
              "author": "CoolSnow01",
              "text": "This is actually a good answer",
              "score": 3,
              "created_utc": "2026-02-24 12:30:03",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o75wp49",
                  "author": "SeaworthinessPast896",
                  "text": "Thank you, I've been doing this for a very, very long time... stepped into enough doodoos along the way..",
                  "score": 1,
                  "created_utc": "2026-02-24 16:46:32",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o70zqel",
          "author": "CleverNameThing",
          "text": "I would start as lightweight as possible and just do a scrum of scrums among the 10 or so teams. And if that's not enough, set up a Nexus integration team for escalation of integration challenges that the scrum of scrums can't handle. That's about all the scaling you would probably need for 10 teams.",
          "score": 5,
          "created_utc": "2026-02-23 21:47:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o715b6x",
              "author": "rwilcox",
              "text": "This is the way. 10 teams isn’t _that_ many: yes it’s pushing Dunbar’s number but scrum of scrum’s with the scrum masters, PO, and reps from the architecture and/or Nexus dev teams should be able to handle this without going too process heavy.",
              "score": 6,
              "created_utc": "2026-02-23 22:14:40",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o71348v",
          "author": "PhaseMatch",
          "text": "Agility is mainly a lightweight way to control your business risk.  The core risks are\n\n- we build the the wrong\n- we build the wrong thing\n\nScrum really helps in the high-risk, high-reward innovative technology/product domain.  You invest one Sprint at a time, look at the benefits obtained and how the external environment has changed, and decide how to proceed (or end the programme)\n\nThis seldom scales across a mature product suite.\n\nYou don't want to havr 26 \"go, no-go\" conversations with senior managers a year, and your operating environment for products is less dynamic.\n\nSimon Wardley covers this well (Wardely Mapping) and how the constraint shifts towards a slower market feedback cycle and longer term investment.",
          "score": 4,
          "created_utc": "2026-02-23 22:03:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o717f1k",
          "author": "flundstrom2",
          "text": "My current employer is similar in size R&D-wise, and we routinely have 15-20 teams working to bring several new hardware-based IoT product to market at the same time, but in different phases of development. The teams follows the architecture, rather than use-cases, so needless to say, the collaboration and synchronization between the teams and projects and products are challenging to say the least.\n\nFor historical reason, different parts of the organization has adopted different methods; some departments work with rolling 6-month plans, some with Pi-planning. Some use Value Streams and Agile Release Trains. Some teams work scrum-ish, other kanban-ish, some do both and some teams do waterfall-ish disguised in iterations. And all the knowledge is in the walls or hidden in Confluence, preferably not version controlled or up-to-date. Even better if it's on someone's personal confluence/SharePoint page. Bonus points if said person has left the company. 🤯 \n\nDespite all of this - so far removed from any theory - we actually not only ship products in a fairly regulated field, we're even doing well, growing, being profitable, and are market leader in mist countries were active in. 😲 \n\nI guess it proves that \"if there's a will, there's a way\", rather than focusing on which method to use.\n\nPersonally, I think it also shows that it is possible to combine agile on a team-level while still being able to run predictable projects on a company level. But it can most certainly be done in a more efficient way. Since I've been in the embedded software industry for 25+ years, I've spend quite some time thinking about those challenges.",
          "score": 3,
          "created_utc": "2026-02-23 22:25:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o73nxnm",
          "author": "Noy_The_Devil",
          "text": "God I fucking hate SAFe. I'm certified as fuck and this is my job. It's complete shit.\n\nhttps://safedelusion.com/",
          "score": 4,
          "created_utc": "2026-02-24 08:00:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o714cua",
          "author": "Noblespace14",
          "text": "Many organizations choose a hybrid approach - Waterfall planning + Agile Delivery. \n\nScrum helps breakdown the large goal into bite sized deliverable which are easier to manage than waterfall in my opinion, specially, in terms of long-term tracking. I have worked on some very large projects that had multiple product owners, each managing a feature, once the overall planning was completed and the MVPs were identified.",
          "score": 3,
          "created_utc": "2026-02-23 22:09:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o71lgwu",
          "author": "ben505",
          "text": "I mean Agile is more than just Scrum. \n\nNothing about incremental growth has to mean small. A leap is just an increment lmao\n\nThis just sounds like a profound misunderstanding of agile tbh. Of course plenty of agile practitioners use multiple teams on single products, like cmon are y'all being serious right now? ",
          "score": 3,
          "created_utc": "2026-02-23 23:41:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o719k6w",
          "author": "paul_h",
          "text": "Board needs to read The Goal and The Phoenix Project. I would not stay around myself to see this mess come to its logical conclusion",
          "score": 4,
          "created_utc": "2026-02-23 22:36:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o714nz4",
          "author": "No_Flan4401",
          "text": "So more people needs more communication.\nMore communication is magnitudes harder then less communication.\n\n\nIt's hard to answer specific, when we don't have more information, but I would always try to slice the product and have teams with well established boundaries that can work independent of each other. They also need to not be booked at full capacity to allow acute work needed for other teams.\n\n\nWhat I'm hearing for your post is that the cto expect miracles and he think he gets it by adding more non technical people. He dont",
          "score": 2,
          "created_utc": "2026-02-23 22:11:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o73buja",
              "author": "devloop_alex",
              "text": "The slicing approach is the only thing I've seen actually work at that scale. Tried the \"more teams, more coordination\" route at a previous company and it turned into a full-time job just keeping teams unblocked from each other",
              "score": 1,
              "created_utc": "2026-02-24 06:13:25",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o71jcsp",
          "author": "jesus_chen",
          "text": "Your CTO is about to waste millions on SAFe implementation and be further away from the stated goal then today. Strap in for the ride!",
          "score": 2,
          "created_utc": "2026-02-23 23:29:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o73e6az",
          "author": "ya_rk",
          "text": "Yes, LeSS. I've seen it work and I've personally know other people who've seen it work. Good luck.",
          "score": 2,
          "created_utc": "2026-02-24 06:33:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o764wa4",
          "author": "Personal-Lack4170",
          "text": "Introducing more roles can help with clarity, but it can also recreate waterfall through layers of approvals and handoffs",
          "score": 2,
          "created_utc": "2026-02-24 17:23:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o77mn8l",
          "author": "derNikoDem",
          "text": "I'd say my company is in a similar position. We are about 80 developers spread over 10 teams (still growing) working on one product. Our product is a SaaS platform with multiple applications. Half of the teams focus on specific apps in the platform the other half takes care of core functionalities. \n\nIt is working but of course things could always be better. Especially improving our ownership distribution together with defining clear interfaces and making sure that work items are well coordinated between teams while managing deadlines I'd say are among the hardest to manage.",
          "score": 2,
          "created_utc": "2026-02-24 21:27:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o715bnp",
          "author": "EngineerFeverDreams",
          "text": "Your CTO is an idiot and their goals are destined to fail. He doesn't understand that he just described scrum and didn't talk about the real issues that this entire process doesn't help with. The engineers need to work with the customers.",
          "score": 1,
          "created_utc": "2026-02-23 22:14:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o71af7b",
          "author": "designtom",
          "text": "I started to rant about bounded applicability and innovation, but there’s just so much going on in your C-suite that anything you bring to the table is a drop in the ocean of dick swinging contests.\n\nYou’re going on an adventure of sorts. Good luck!",
          "score": 1,
          "created_utc": "2026-02-23 22:40:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o733r48",
          "author": "epyk_one",
          "text": "I'd recommend looking into something like FaST. It's very interesting and I've seen a flavor of this work to some extent. It does require the right culture for sure. \n\nhttps://youtu.be/SfVpi6ghNdo?si=XsP1IN92Exp4l-OW\n\nIn the end I think it's all about being ruthless about priorities. Both in defining them and sticking to them.",
          "score": 1,
          "created_utc": "2026-02-24 05:09:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o73m2ip",
          "author": "Leinad_ix",
          "text": "It sounds like the Big Leap forward from China. Future disaster.",
          "score": 1,
          "created_utc": "2026-02-24 07:43:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o73uppw",
          "author": "impossible2fix",
          "text": "When you get to 5-10 teams on one product, the bottleneck isn’t the ceremony, it’s dependencies and decision-making. If architecture isn’t modular and ownership isn’t crystal clear, adding more teams just adds more sync meetings.\n\nWhat worked for us was keeping small, empowered teams but introducing strong product alignment at a higher level: shared roadmap, clear product strategy, regular cross-team planning. Not full SAFe style heavy process but more structure than pure Scrum.\n\nGoing full top-down waterfall usually slows things down long term. But pretending 10 teams can act like 1 Scrum team is unrealistic too.",
          "score": 1,
          "created_utc": "2026-02-24 09:05:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o742zxy",
          "author": "jleme",
          "text": "That company’s in trouble. The CTO clearly doesn’t understand Scrum or Agile. And what he described definitely isn’t SAFe, which, honestly, isn’t great anyway.",
          "score": 1,
          "created_utc": "2026-02-24 10:23:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o748ot3",
          "author": "Ok-Mousse6057",
          "text": "Scrum is fractal and scales beautifully with very few/minimal adjustments. The only scaling patterns I would consider, and have used extensively myself in similar situations are: Big Room Planning (BRPs - SAFe \"borrowed\" this), Scrum of Scrums (each team sends ambassadors to a daily sync/impediment removal/planning meeting - similar to a Daily Scrum but I make it 30 mins), maybe add in Chief Product Owner (rarely needed imho), and most importantly, ensure each team is designed with true end-to-end delivery capability (ideally aligned to a value stream). This is where most failures occur. I work with orgs all over the world, and 90% of failures come down to poor team design. \n\nYour CTO has most likely never experienced real Scrum...this is an opportunity to implement a successful operating model right out of the gate...SAFe is a disaster, stay away from it. And most large scaling \"frameworks\" suffer from the same problem, which is a large \"cookie-cutter,\" complexity-inducing, agility-killing solution is the answer...it's not, and I have the scar tissue to prove it.\n\nHappy to answer any other questions or share direct client experiences and hard data.",
          "score": 1,
          "created_utc": "2026-02-24 11:14:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o74k77s",
          "author": "Hot_Preparation1660",
          "text": "There is a critical piece of context missing here. What kind of product is this? If it’s pure software, this is nonsense. Waterfall is almost a strawman in the context of a SaaS product.\n\nIf it’s hardware, this makes all the sense in the world IMO. You can’t fly by the seat of your pants when you have to manufacture physical things in the real world. Especially if it’s a regulated industry (aerospace, medical devices, etc).",
          "score": 1,
          "created_utc": "2026-02-24 12:40:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o74smux",
          "author": "DallasActual",
          "text": "He's wrong, it is possible and I have seen it done. What it requires, though, is deep thought about the flow of value and the nature of the work. This tends to require reorganizing teams in ways that may upset existing power holders.",
          "score": 1,
          "created_utc": "2026-02-24 13:31:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o74wvne",
          "author": "Kenny_Lush",
          "text": "Let me guess - they will toss all things “agile,” but hold on to daily “STAND UP!!!!” like grim death…",
          "score": 1,
          "created_utc": "2026-02-24 13:55:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7719lg",
          "author": "Negative_Site",
          "text": "Im witnessing agile turn back into waterfall due to inertia",
          "score": 1,
          "created_utc": "2026-02-24 19:48:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7hlvlw",
          "author": "Bowmolo",
          "text": "What a limited perspective.\n\nFalling back to Waterfall because a single Person cannot handle the scale is rather, hm, dumb, at least uninformed. \n\nFlight Levels, LeSS... there are many options to solve that problem.",
          "score": 1,
          "created_utc": "2026-02-26 09:50:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o713b5w",
          "author": "phoenix823",
          "text": "Adding product managers, subordinate POs, and analysts does not mean you're abandoning SCRUM. The \"agile model\" was always meant to be customized for your way of working. And if the top-down planning means picking the most important work and doing it first while working out dependencies between teams, how is that not still agile? ",
          "score": 0,
          "created_utc": "2026-02-23 22:04:41",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rhbvyc",
      "title": "Are Product Owners even necessary in highly technical industries?",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1rhbvyc/are_product_owners_even_necessary_in_highly/",
      "author": "Standard-Pen4307",
      "created_utc": "2026-02-28 19:40:54",
      "score": 15,
      "num_comments": 58,
      "upvote_ratio": 0.67,
      "text": "I’m asking because our company is currently struggling with the Product Owner role. We operate in a very tech-heavy environment, and most of our products are used by technically experienced users. In my view, the person responsible for the product within the team should also have strong technical expertise, essentially, what we really need is a Technical Manager.\n\nRight now, our Product Owners don’t seem to add much value. They struggle to write user stories because they don’t fully understand the technical requirements. They often try to avoid certain responsibilities, likely because they feel unable to handle the challenges. They can’t even confidently discuss the interfaces of our software. So I’m left wondering: what is the actual purpose of the Product Owner role in this context? Am I missing something?\n\nWe also have some older teams where developers act as technical managers for the product, and their development process runs far more smoothly than ours. It sometimes feels like companies are forcing Agile roles into existing structures simply because “everyone is doing Agile.”\n\nIn my previous companies, I’ve rarely seen a Product Owner who could effectively discuss requirements with stakeholders. The role often feels like micromanagement, creating tickets that developers can’t meaningfully work with. And I doubt that large companies like FAANG have separate Product Owner roles; I assume their technical managers naturally take on Product Owner responsibilities when working in an Agile setup.\n\nSo what’s the real value of having dedicated Product Owners who don’t have a strong development background? ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1rhbvyc/are_product_owners_even_necessary_in_highly/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o7xkqe3",
          "author": "hofo",
          "text": "I’d expect a PO to understand the product and mold it from a user and/or management point of view. I’d expect an architect or technical manager to figure out the details to fulfill the requirements of the PO. The PO doesn’t need to understand hue the sausage is made but would have on opinion on what spices they want to taste in it.",
          "score": 59,
          "created_utc": "2026-02-28 19:50:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7xnndz",
              "author": "Ok_Garden5983",
              "text": "This. I work from the business/end user/roadmap perspective but I interface with software devs/ architects to understand the HOW and the resources it would take to complete the work.",
              "score": 13,
              "created_utc": "2026-02-28 20:05:00",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7y2egx",
          "author": "davy_jones_locket",
          "text": "The PO only has to be as technical as your users. \n\n\nIf you're making software for other engineers, your PO should have an engineering background. \n\n\nIf you're making software for teachers, your PO should have a teaching background. \n\n\nIf you're making software for real estate management, your PO should have background in real estate management. \n\n\nThe PO should understand the business domain to represent the needs of the users, not the technical domain to understand technical requirements.",
          "score": 19,
          "created_utc": "2026-02-28 21:24:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7yue8h",
              "author": "Far_Archer_4234",
              "text": "In my opinion, this mentality can lead to having mocked data and sprecious functionality.  The PO needs to have some familiarity with the data model that the business uses.  If they don't, then the development team might as well just be guessing at what the nouns and verbs mean.",
              "score": 1,
              "created_utc": "2026-03-01 00:01:46",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o82l9df",
                  "author": "Competitive_Smoke948",
                  "text": "the developers should be doing what the architects tell them to do. they shouldn't be making decisions. the PO should know the users inside out & what they want. the architects should take  that information & translate it into something the developers understand & the developers should do the job. \n\nfor example... the PO would name the book & set the theme. the architects would write the book & the developers would be given crayons to colour it in. They shouldn't be deciding the theme, the target audience, the title or the words.",
                  "score": 1,
                  "created_utc": "2026-03-01 16:08:25",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7y21mc",
          "author": "anotherleftistbot",
          "text": "Technical products need technical product owners.\n\nI’ve led technical product teams with less technical product owners and helped them gain enough understanding to help prioritization but they are really only coordinating external stakeholders and prioritizing phase/high-level epic work.\n\nTechnical leads/arch/managers are refining epics and writing user stories.\n\nIdeally a very technical product would have an dangerously technical/previous engineer or CS-trained product owner.\n",
          "score": 9,
          "created_utc": "2026-02-28 21:22:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o82kp7m",
              "author": "Competitive_Smoke948",
              "text": "i would disagree. At some point, the product is going to be used by someone who isn't the developer of the product. This means that they should be, either a product specialist such as a PILOT for commercial airline software or someone who struggles to turn on a laptop for standard office software. \n\nEVERY time the pure techies are allowed to make product decisions such as what they look like or what button is where etc, the product is hated by the users or kills people",
              "score": 1,
              "created_utc": "2026-03-01 16:05:43",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7xjxc1",
          "author": "oldvetmsg",
          "text": "Our senior k8s architect is our po... the mf knows whats up",
          "score": 8,
          "created_utc": "2026-02-28 19:45:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7xpn01",
          "author": "PhaseMatch",
          "text": "**TLDR;  You are describing a common low-performance pattern around \"user stories\" that happens when organsiations want to cling to their stage-gate control-and-blame approach to business risk management.**  \n  \nYou seem to want your PO to create \"users stories\" that are requirements, which is pretty much the opposite of the intended use-case for the user-story concept, and the way to use them effectively.   \n  \nIn Extreme Programming (XP), they recognized that requirements were often wrong or misunderstood.    \nThe stage-gate sign-off approaches just meant when that happened, you knew who to blame.\n\nSo XP flipped the script round.  \n  \nThey went with the idea that you control business risk better and more cheaply by  \n\n\\- making change cheap, easy, fast and safe (no new defects)  \n\\- using working software as a way of uncovering the real requirements  \n\\- getting fast feedback from actual users on what was right, and changing what was wrong\n\nAll of the XP practices and roles work together to make this possible, and a lot of that is technical and where the team needs a high level of skill and proficiency to execute it well.  Chances are the code base needs a lot of work too.    \n  \nThe core idea is that in product discovery, we need to probe-sense-respond, and working software is a better probe than a requirements document.   \n\nA user story was a placeholder for conversation with the user, about a (business) outcome they needed.\n\nThese days that conversation takes the form of user-story mapping with at least some of the team in the room, and ideally all of them.  **Jeff Patton's stuff is good on this - take a look.**\n\nBut that's not the end of it;  the essential XP role is the \"onsite customer\", who is a user domain SME, embedded with an co-creating with the team all the time.  So you have immediate feedback not \"I'll go and ask the business\"\n\nThe best product owners I have worked with: \n\n\\- have a clear vision for the product  \n\\- have a business/product outcome-based roadmap to execute that vision  \n\\- bring their teams business problems to solve, not solutions to implement  \n\\- are a user-domain SME and can be an on-site customer in that context   \n\\- understand probe-sense-respond is needed for product discovery   \n\\- own the profit-and-loss for the product  \n\\- make decisions with the team\n\nThe worst do what you describe - act as a requirements-gathering BA, with no ownership.\n\n\n\n\n\n",
          "score": 20,
          "created_utc": "2026-02-28 20:15:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o80g8zi",
              "author": "No_Flan4401",
              "text": "This is the way! But in reality it's often far form it, in my bad experience ",
              "score": 1,
              "created_utc": "2026-03-01 06:26:16",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o7yphvy",
              "author": "ChocoMcChunky",
              "text": "Product owners are essentially tactical level and overlap with many BA role requirements but within a scrum framework. Half of the things you described are product manager responsibilities",
              "score": 1,
              "created_utc": "2026-02-28 23:32:30",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7xkvb9",
          "author": "wijsneus",
          "text": "Sounds to me like you need a highly technical person taking on the product owner role. As in, someone, who has the actual chops to know what's the next best step for the product.",
          "score": 12,
          "created_utc": "2026-02-28 19:50:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7xnoct",
          "author": "mjratchada",
          "text": "Good product owners are essential in whatever industry there is. They provide direction and clarity. Unfortunately it is an area difficult to get correct. \n\nWorked in Llife sciences whereby input from senior research officers has been crucial. Worked on an advanced homo automation org whereby electrical engineers were the product owners and added so much impetus and validation of the work being down.\n\nWorked on integration platforms whereby some of the product owners knew more about network protocols, middleware and related standards than the engineers did they also had the big benefit that they communicated were with the customers and usually understood what they wanted/\n\nUnforntunately often Product owners, are promoted BAs or Project/Programme managers. The former are typically out of their depth and scared to make a firm decision, the latter do not focus on the lifecycle of the product and its evilution but timelines of current deliverables. BAs can be guided and developed {rpject Managers are typically opposed to people with less experience but more expertise in guiding or mentoring them.",
          "score": 5,
          "created_utc": "2026-02-28 20:05:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7xkc6t",
          "author": "7thpixel",
          "text": "How do I say this without being inflammatory. PO’s are what a developer thinks product is like, which is why it was all messed up in the first place.",
          "score": 3,
          "created_utc": "2026-02-28 19:47:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7xwi2f",
          "author": "FreshLiterature",
          "text": "There are a lot of variables at play here, but strictly speaking the PO owns the direction of the product. Their job is to understand the user, user journey, and what future increments will drive the most value.\n\nThe product team own the technical execution and details.\n\nThe PO needs to understand enough about the product and development process to ask about tradeoffs and costs as those will factor into what gets prioritized for future increments.\n\nIMO becoming more technical isn't actually that hard and any PO that resists it probably isn't cut out for the job.",
          "score": 3,
          "created_utc": "2026-02-28 20:52:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7y1erk",
          "author": "m915",
          "text": "I write a sentence on my Jira with no description then design develop and ship. I don’t need or want a product owner",
          "score": 4,
          "created_utc": "2026-02-28 21:19:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7y4q5m",
              "author": "maizerage25",
              "text": "What could go wrong",
              "score": 4,
              "created_utc": "2026-02-28 21:36:44",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7ypxyr",
                  "author": "hibikir_40k",
                  "text": "You'd be surprised at how many situations out there where POs are just no good at prioritizing, identifying value or anything like that, and just end up focusing solely on the funding model of the company. If we go through X Y and Z, then we get this capital project approved, because it's an easy sell to this VP. Does it actually deliver value? Not really, because the VP also doesn't understand what is going on in their company.\n\nI once worked at a company that had \"innovation day\", every two weeks, where developers could do their own things. And what we really ended up setting up was an alternate channel to deliver things the PO would NOT approve, ever, even though they were trivially cheap, and delivered value to users immediately. \n\nYou see a lot of the same in SAFe environments too: The best a team can do to actually help can be to just sandbag, so they can run a second backlog of things that actually help, as you end up with entire product organizations that don't know the system, or the users, or anything other than process. \"Do not edit the stories!, this will mess up the cross-team tracking!\" They will tell you, even though the stories are basically unrelated to workable, team-level tasks. The plan they signed up on 8 months before is more important than the reality on the ground.",
                  "score": 2,
                  "created_utc": "2026-02-28 23:35:11",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7ye54b",
                  "author": "m915",
                  "text": "The crazy thing is I’ve been doing this for 5+ years now, I’m a lead data engineer. Small lean teams 🤷‍♂️",
                  "score": 1,
                  "created_utc": "2026-02-28 22:27:46",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7xy1xe",
          "author": "ckdx_",
          "text": "Lots of red flags in the way you’ve posed the question and the way you’ve answered the other comments. Honestly you sound bitter rather than genuine.\n\nI think it might be worth some introspection and considering what you can do to improve the situation- and yes, this means working with (not against) the PO.",
          "score": 3,
          "created_utc": "2026-02-28 21:00:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7xzf9l",
              "author": "Standard-Pen4307",
              "text": "Working with the POs is complicated again. As you can see from the other comments, we’re a large organization with clearly defined roles and responsibilities. I’m not in direct contact with our stakeholders, nor am I able to be, and it’s not part of my job description to manage that relationship. I can’t effectively work with them because I’m not included in the key meetings. The only real solution would be to involve me in those meetings, but that would essentially mean taking over responsibilities that currently belong to the POs.\nAnd regarding the “red flags”: I’ve always supported the POs as much as I could. However, I’m increasingly frustrated, and I’ve started to take some of these issues personally. That said, it doesn’t affect how I treat them professionally — I’m fully capable of separating work from personal feelings.",
              "score": 1,
              "created_utc": "2026-02-28 21:08:24",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7y5vxd",
          "author": "Triabolical_",
          "text": "I've worked in teams with product owners and teams without. If you didn't have one you need to synthesize that role and lot of developers aren't good at it and/or won't spend time on it. \n\nI can do the synthesis but I much preferred a product owner who could say \"I know four customers who are heavy users of that feature - I'll set up a meeting and we can run the changes by them'",
          "score": 3,
          "created_utc": "2026-02-28 21:42:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7yitzk",
          "author": "pm_me_your_amphibian",
          "text": "I am CPO in an extraordinarily technical company and have almost no technical understanding. Before joined they had brilliant people working on brilliant things yet fuck all got done. Now we’re delivering actual value, not wasting time on vanity projects, and we’re about to land contracts with the biggest fish in our industry as our first clients.\n\nProduct isn’t just about writing tickets, it’s about getting value to clients. I would like to understand more, sure, but my days are already full and I have literal geniuses around me to think about that stuff.",
          "score": 3,
          "created_utc": "2026-02-28 22:53:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7y64zt",
          "author": "JaapStar",
          "text": "In my company we have 2 types of product owners. Frontend / platform / COTS systems have PO's they call product leads. Our technical backend (inhouse developed) is maintained by technical product owners (like myself). Me and my counterparts in other teams have development knowlegde, are involved in the architecture, do business analysys and manage the technical backlog as well as implementing new demand, even though that is often indirecly inherited by the product leads. We are responsible for story acceptance and guide the CI/CD pipeline.  I can't speak for other teams, but my 2 teams appreciate the single point of contact for requirement gathering and gatekeeper in priority as well as the above mentioned. Also, salaries are higher than the product leads, but that seems logical given the extra responsibilities.",
          "score": 2,
          "created_utc": "2026-02-28 21:44:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ylord",
          "author": "tren_c",
          "text": "If you dont have someone accountable for key decisions about a product it will stagnate.",
          "score": 2,
          "created_utc": "2026-02-28 23:10:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7xo4dy",
          "author": "patrad",
          "text": "In healthy environments I have worked in, POs work with business to define the business value and help prioritize the backlog of the things being developed.  They don't need to understand the how.  The problem I see with your post is all right here: \"the person responsible for the product within the team\"\n\nI know their title is Product Owner . . but the TEAM is responsible for the product.  Not one person.  The PO should be adding the knowledge of the why, the value, and the priority . . the rest of the team (tech lead, archs, sr eng) can be adding the HOW",
          "score": 3,
          "created_utc": "2026-02-28 20:07:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7xovw4",
              "author": "Standard-Pen4307",
              "text": "The how is not the important part, the problem is that our customers are also Engineers and the PO‘s can not understand what those Engineers ask for. So the result is, we get Tickets with almost no Acceptance Criteria. I don‘t need someone explaining me how i should do something, i need someone of what i should achieve for the product.\nAnd the responsibility, yes we are all responsible for the product. But in bigger organizations there is the need of one person that is accountable that tasks get done, you can not split those onto 10 people, because then there is no one accountable…",
              "score": 1,
              "created_utc": "2026-02-28 20:11:32",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7yo95e",
                  "author": "MarkInMinnesota",
                  "text": "Do your POs write up features? In our org POs never write user stories, that’s what engineers are responsible for since they’re the ones breaking down the work based on info in the features and discussions with the PO.\n\nIn general POs are responsible for features, prioritization, reporting on and managing progress, and being a liaison with managers and users, not writing user stories.",
                  "score": 1,
                  "created_utc": "2026-02-28 23:25:07",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7xkyhc",
          "author": "Hopelesz",
          "text": "I think you have the answer. The PO is the ROLE, the job, the task. As long as it is done, the who changes alot based on what product you're building.",
          "score": 1,
          "created_utc": "2026-02-28 19:51:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7xlzbh",
              "author": "Standard-Pen4307",
              "text": "And how do you solve that problem without beeing inflammatory against these people? They are completely incompetent do do their job.",
              "score": 1,
              "created_utc": "2026-02-28 19:56:23",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7xs8z3",
                  "author": "widowmakerau",
                  "text": "Sounds like you are already coming at it with the wrong attitude...  you are perfect at your job? fark, i havent worked with many devs that are.",
                  "score": 2,
                  "created_utc": "2026-02-28 20:29:27",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7xucqe",
                  "author": "Hopelesz",
                  "text": "You just have the wrong PO. They PO needs to understand the product and its users. If the users have a certain degree of technical adaptation, the PO certainly needs to understand this.\n\nThe question you're asking and your personal problem with your PO should not be mixed with what PO do add to highly technical products/teams.",
                  "score": 2,
                  "created_utc": "2026-02-28 20:40:53",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7xluz8",
          "author": "DeusLatis",
          "text": "So two things seem to be going wrong.\n\nFirstly, the product owner doesn't have to be highly technical but if they aren't they need to leverage knowledge from the stake holders to ensure that the product you are building meets the customers needs and adds value.\n\nThe product owner can either _already_ understand this or can act as a proxy and not really understand it but know how to communicate information they themselves may not fully understand.\n\nBut also the product owner should also be leveraging the fact that both the \"customer\" and the developers are already highly technical and should be getting you guys together, rather than acting as a go between.\n\nIf the product owner is expected to transfer highly technical requirements from stake holder to developer so that the developer never has to speak to the customers, you are just implementing 'agile-fall' (ie waterfall inside agile)\n\nSo two things I would recommend -\n\n1) the team talks to the product owner and explains that the lack of detail and information in the tickets are really hurting velocity and they want to work with the product owner to solve this issue\n\n2) the team will attempt solve this issue initially by interacting closer with the customers, allowing the product owner to focus less on minute details and more on product goals (can the customer do X after we ship this feature). in the spirit of agile experimentation you will see how this goes and iterate based on results and feedback",
          "score": 1,
          "created_utc": "2026-02-28 19:55:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7xobfk",
              "author": "No_Illustrator2090",
              "text": "\\> Firstly, the product owner doesn't have to be highly technical  \nWell, that depends. PO needs to understand what the product does and what the users expect from it and he needs domain knowledge more than technical knowledge. But... If your product is let's say a database engine then PO needs to be highly technical as tech is the domain you're operating in. ",
              "score": 1,
              "created_utc": "2026-02-28 20:08:30",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7xp8n1",
                  "author": "Standard-Pen4307",
                  "text": "This is also my opinion and the point of discussion. If the PO‘s does not understand what an Engineer needs, he is useless in my opinion.",
                  "score": 1,
                  "created_utc": "2026-02-28 20:13:24",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            },
            {
              "id": "o7xmo75",
              "author": "Standard-Pen4307",
              "text": "We are a big structured company with predefined roles, i can not speak with the stakeholders directly. Our application is used only on Linux machines by developers and the PO‘s are technically to incompetent to understand what an RPM is, just for example. How should they understand what systemd is and what should be achieved. This thing is so messed up, i just want to quit because of the PO‘s. By the way we habe 2 PO‘s for one product 😂",
              "score": 0,
              "created_utc": "2026-02-28 19:59:57",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7xot72",
                  "author": "DeusLatis",
                  "text": "> We are a big structured company with predefined roles, i can not speak with the stakeholders directly. \n\nWell then you aren't really doing agile or scrum, so how good or bad the product owner is is kinda irrelevant. I would be kind to them, they are probably as frustrated as you are.\n\n\n",
                  "score": 3,
                  "created_utc": "2026-02-28 20:11:08",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7xmisw",
          "author": "Lloytron",
          "text": "You raised a lot of issues here. Absolutely a lot of companies put roles into place because they think they should, without understanding why.\n\nA PO should not be a micromanager and tickets should always have meaning to both business and developers. Sounds like you've met a lot of shitty POs.\n\nI'm a non technical Product Manager/PO working in technical industries.\n\nI define, with the stakeholders, what we want to be able to achieve with our products\n\nI then plan, with engineering leads, technical heads and developers, a set of user stories that define exactly what we want to achieve. I have no input whatsoever on how any of it is executed, that's down to the engineering teams and architects.\n\nIf in your case a PO with a background in tech can do all this then great, but can they really work with the stakeholders to plan out what is of most value to the business?\n\nI'm sure some can. But so many can't, and end up massively over engineering products where the majority of features have little to no value.",
          "score": 1,
          "created_utc": "2026-02-28 19:59:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7xqjsb",
              "author": "Standard-Pen4307",
              "text": "Well as i said, our product is technical and it is used by engineers. The PO‘s have zero experience in that. For example we have a Wireshark integration and our PO‘s don‘t even know what Wireshark is or does.",
              "score": 1,
              "created_utc": "2026-02-28 20:20:21",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7xs80b",
                  "author": "Lloytron",
                  "text": "Right, so your problem is not about the role as such, but the competencies of the people in those roles.\n\nI've worked across multiple domains and have often found myself not having a clue about the product. That's where onboarding and training comes in.\n\nI am not technical but even I know what Wireshark is. But if I didn't, and needed to, then if find out.\n\nA PO does not need to have technical experience but they do need to have the capacity to understand technical concepts.\n\nSo yeah sounds like you have POs with little understanding of their role.",
                  "score": 1,
                  "created_utc": "2026-02-28 20:29:19",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7yspzr",
                  "author": "Othersideofthemirror",
                  "text": "> Wireshark \n\nOk i had to google that, and my immediate thought it that a PO should be more an expert of what is being monitored, and why its being monitored and ensuring what ever it is monitoring for doesnt happen. Dont they also own the Why and not the How?",
                  "score": 1,
                  "created_utc": "2026-02-28 23:51:46",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7xnm0r",
          "author": "99ProllemsBishAint1",
          "text": "A more technical product owner would be more appropriate. It sounds like your current PO is wasting everyone's time. There's even a role called Technical Product Owner at some companies.\n\nThey should expertly speak the same language as the users of whatever you're building. They should understand what's important to users and maintain the prioritization of all the things the things you'll build for them. If the users are super technical, either in software technology or super technical business niches, the PO should be very capable in that area.",
          "score": 1,
          "created_utc": "2026-02-28 20:04:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ync7r",
          "author": "WaylundLG",
          "text": "I stepped in as PO on a product recently that I have little technical knowledge of. A lot of times the whole value I add is to say \"I need X regulation to be met and A is more important right now than B.\" Am I adding much value? I honestly don't think so, but it was a critical piece of value that no one was adding before. We went from spinning our wheels for 8 months to delivering an first release in 30 days. I'd rather have a PO that tackles those key business issues and has to rely on the team for technical knowledge than one that is technically knowledgeable and can't make those business decisions. Both is nice, but not always possible.",
          "score": 1,
          "created_utc": "2026-02-28 23:19:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ypx0r",
          "author": "Othersideofthemirror",
          "text": "I think i fit within the scope of what you are saying.\n\nI have a handful of SAAS platforms and and an inhouse interface layer, which my devs and tech BAs manage at a detailed level. Stuff involving coding is 30% of my book of work and whats on my kanban board right now.\n\nThe product isnt a platform, its a service those platforms provide.\n\nMy users are operations and whilst im concerned about their user experience the drivers are what the product does and high levels of scrutiny over its effectiveness. My key takeholders own the risk and dont use the platforms. I guess im a technical SME in terms of what my product does rather a development SME.  Part of my job is to translate complexity into something leadership understand so they can articulate their decision and mitigators to regulators. Im not coder or have detailed understanding of the workings what we do inhouse. \n\nI noticed other peer institutions have roles like mine (I sit in the business), or more traditional POs who sit in tech/IT and manage the dev teams. I kinda do a bit of both. I was recruited because i know my niche very well and slotted into a PO role despite only ever being business owner before.  The whole definition of PO has shifted a bit because when the firm moved agile into ops and second line they then started calling different things products.\n\nJust say your product is \"air traffic control safety\" and you oversee a bunch of systems that ensure air traffic control safety. You really need to be an expert in air traffic control safety, and you have tech teams (devs and BAs) to be SMEs of their systems. \n\nbut you still have to oversee all those systems within an org that uses agile and jira, so you create tickets at a high level describing we need to add a new airport to the systems, and the BAs write the tickets for the devs. You'll be spending most of your time thinking about risks, mitigators, reporting, oversight, assurance and testing.\n\nAlso of note, I have 20 years experience in my field, i use agile to manage work.  I learnt my field first, agile came second.  I might not use it in the next firm if they dont use it. Perhaps some here might be the other way round.",
          "score": 1,
          "created_utc": "2026-02-28 23:35:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7zqnrq",
          "author": "Southern_Orange3744",
          "text": "In my experience few technical prosuct managers exist. \n\nThis is super required in security and infrastructure products imo \n\nSimilarly I expect scientist sme in science products\n\nBasically you should have someone knowledgeable about the use cases for that product to be the owner",
          "score": 1,
          "created_utc": "2026-03-01 03:17:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o80agvy",
          "author": "pinxi",
          "text": "Many have already answered but here is a different way of looking at it. \n\nOne of the key relationships is between the product owner and their senior technical lead(s). This relationship must foster trust, confidence, abd respect to be functional. \n\nIn this way, the PO can articulate to the board/CEO/investors/customers/sales/design/martketing/etc the vision of the product and the roadmap for delivery. The only way they can get there is by working closely as a team across specializations. \n\nIn your case, this seems this has broken down. You mention wireshark so likely have a security/networking product that requires a decent amount of domain specific expertise. If your PO doesn’t have that expertise then you should talk to your CTO (or other management) and voice your concerns. Your PO must understand the core features of your project even if they can’t actually code it themselves.  \n\nMore than likely you have a project manager who is being called a product owner.",
          "score": 1,
          "created_utc": "2026-03-01 05:38:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o80mxhn",
          "author": "MegaromStingscream",
          "text": "My first question is what does user story mean in your organisation. I have seen it used both in the original meaning if writing a description of a change or new functionality from the point of view of the user and as a ticket type in the task management system.\n\nThe first meaning doesn't include technical requirements though it might get close to non-functional ones. The second needs to be enriched with all the other things that go between the   core user story and being ready to be implemented.\n\nI have to wonder if there is a miscommunication around this double meaning of the concept, because how I see it only the core user story is part of PO's. The second thing is possibly an organisational problem around communicating with the stakeholders. It doesn't make any sense to me to be playing broken telephone through the PO when you can just bring the development people and stakeholders together so they can ask questions from each other and find the best ways forward.",
          "score": 1,
          "created_utc": "2026-03-01 07:25:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o80tnbl",
          "author": "RevolutionarySky6143",
          "text": "PO doesn't need to be technical?  They are responsible for crafting the vision/roadmap of the product.  That shouldn't be left to a Developer or any random end user.",
          "score": 1,
          "created_utc": "2026-03-01 08:29:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o813su4",
          "author": "thlandgraf",
          "text": "Spent 20+ years building technical products and dealt with this exact tension everywhere. You need the function, not necessarily the title. The actual job isn't writing user stories — it's deciding what not to build, translating between engineering and business context (\"we need to refactor auth\" becomes \"this reduces our SOC 2 exposure\"), and protecting the team from scope creep. A technical manager can absolutely do all that, but most don't because the stakeholder management and saying-no parts are less interesting than the technical work. Your older teams running smoothly with developer-as-PM probably just have people who do those things naturally — if they leave you'll feel the gap. The real problem you're describing is POs who aren't technical enough for your domain, which is a hiring issue not a role issue.",
          "score": 1,
          "created_utc": "2026-03-01 10:06:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o814d28",
          "author": "Turkishblokeinstraya",
          "text": "The biggest challenge I usually see with technical people nominated to be POs is that they speak in terms of outputs and prescribe solutions to the rest of the team, limiting meaningful trade-offs and collective thinking.\n\nFor example, I worked with enterprise architects and the PO was a user of the system himself too, making him opinionated about the potential solutions. \n\nOutcome-centric thinking minimises the amount of work that needs to be done, whereas output-centric thinking locks in requirements such as 12000 objects to be migrated, or 137 relationship types to be moved across. \n\nWhat if we get the same outcome with 1/10th of those requirements?",
          "score": 1,
          "created_utc": "2026-03-01 10:11:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o81d4zk",
          "author": "Afraid_Abalone_9641",
          "text": "A PO can be someone tecnical as long as they maximize the value of what you're developing. I think most POs I've worked with are pretty technical, but have those extra soft skills where they can explain things they value at a higher level than most devs. ",
          "score": 1,
          "created_utc": "2026-03-01 11:34:53",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rdmfq4",
      "title": "Agile 2026",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1rdmfq4/agile_2026/",
      "author": "MCMcGreevy",
      "created_utc": "2026-02-24 17:22:50",
      "score": 10,
      "num_comments": 17,
      "upvote_ratio": 0.82,
      "text": "Agile 2026 has been announced and the page has been on the Agile Alliance site since the conference in Denver last year, but I have seen absolutely nothing about it since then. In past years, tickets would have gone on sale back in December and we'd be out of the early-bird pricing by now, but so far there is no information on tickets or hotels.\n\nDoes anyone have any insight into if the event is even happening?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1rdmfq4/agile_2026/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o7671iy",
          "author": "UKS1977",
          "text": "If it is, it will be nearly the last. PMI now own the Alliance and want to pull the AA products to align with theirs. So I expect if not this year then next it will be aligned with theirs PMI summit. \n\nIn fact checking the website - it is now a PMI summit. \n\nI know the AA signed some pretty strict contracts on locations quite far in advance, so they couldn't/haven't be able to cancel them. I do not know how close they've got to those deals running out. I *thought* last year was the last one under that contract but could be wrong. \n\nI do suspect the content will all be aligned/curated/planned by PMI and aligned (I imagine) with the new agile manifesto the PMI are launching in a couple of weeks.",
          "score": 5,
          "created_utc": "2026-02-24 17:33:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o76agcw",
              "author": "Dsan_Dk",
              "text": "Wauw, getting happier and happier that I'm not in agile alliance in anyway, from this.",
              "score": 3,
              "created_utc": "2026-02-24 17:48:52",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o76hd5y",
          "author": "Consistent_Voice_732",
          "text": "I've been budgeting for it like usual but without dates or pricing it's hard to plan curious if anyone from agile alliance can share an update",
          "score": 1,
          "created_utc": "2026-02-24 18:19:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7dxbyw",
          "author": "WideFunction6166",
          "text": "[https://agilealliance.org/event/pmi-agile-2026/](https://agilealliance.org/event/pmi-agile-2026/)",
          "score": 1,
          "created_utc": "2026-02-25 20:00:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7f7xjj",
              "author": "MCMcGreevy",
              "text": "That is the page I was referring to in my original post. There is no information about tickets or how to reserve a hotel.",
              "score": 1,
              "created_utc": "2026-02-25 23:49:20",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7fd7b6",
                  "author": "WideFunction6166",
                  "text": "Looks like they added a way to get newsletter",
                  "score": 1,
                  "created_utc": "2026-02-26 00:18:27",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7ruzdb",
          "author": "SirStoney",
          "text": "Haven't seen much by way of communications about speakers or a call for proposals either and I know a number of the previous years organising committee and spoke at the last 3.\n\nIn previous years they'd be announcing speakers around March time.\n\nOddly quiet",
          "score": 1,
          "created_utc": "2026-02-27 21:35:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o76iw8e",
          "author": "CleverNameThing",
          "text": "I'd rather see Ken Schwaber and [Scrum.org](http://Scrum.org) be the mouthpiece for agility over AA anyway (yes, I mean alcoholics anonymous, lol).",
          "score": 1,
          "created_utc": "2026-02-24 18:26:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o76sb52",
              "author": "UKS1977",
              "text": "Well Ken got kind of thrown out the Agile Alliance! He formed it but wanted to use it as a vessel to do certification, which many of the other founders (being of that homebrew and self learned ilk) disliked as a fundamental concept. So much so, this idea of \"no certification\" was baked into the DNA of the Agile Alliance.\n\nSo he founded the Scrum Alliance with Mike Cohn and Esther Derby to do certification. Mike and Esther agreed as long as it was a non-profit and not a money making scheme.\n\nKen agreed.\n\nA few  years later, Ken was \"asked to leave\" the Scrum alliance due to something irregular that no one \\*publicly\\* speaks about. Ken spun this as some noble sacrifice and him leaving due to these awful other people. I have heard it was more prosaic and base then that. \n\nAnd then he set up Scrum.org. A private business dedicated to making Ken money. Of which it has made him millions. Remember he owns the PSM test himself and receives all the revenue from it directly. \n\nI have known Ken a long time. He is a hard man to like. He made a great post about his behaviour, a few years ago - [https://kenschwaber.wordpress.com/2012/01/02/i-was-thinking/](https://kenschwaber.wordpress.com/2012/01/02/i-was-thinking/)\n\nI hundred percent respect him - and am very aligned philosophically with him - But he is no man to idolise. \n\n  \n",
              "score": 9,
              "created_utc": "2026-02-24 19:07:49",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o76w7ny",
                  "author": "CleverNameThing",
                  "text": "Interesting stuff!  Thanks for the backstory.",
                  "score": 2,
                  "created_utc": "2026-02-24 19:25:38",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o79elzk",
                  "author": "cliffberg",
                  "text": "Circa 2002 a colleague of mine took Schwaber's Scrum course. Schwaber told her that he \"knew nothing about organizations\".\n\nThe reality is that Scrum was all about making money from the start. Here is something else that one of them sells: [https://www.frequencyfoundation.com/about-us/](https://www.frequencyfoundation.com/about-us/)",
                  "score": -2,
                  "created_utc": "2026-02-25 03:08:48",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1rf7iql",
      "title": "How do you define \"agile\"",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1rf7iql/how_do_you_define_agile/",
      "author": "NoBullshitAgile",
      "created_utc": "2026-02-26 11:17:03",
      "score": 6,
      "num_comments": 44,
      "upvote_ratio": 0.63,
      "text": "Hi! \n\nAfter some interesting comments in another thread here I would like to know: How do define \"agile\"?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1rf7iql/how_do_you_define_agile/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o7hvjqb",
          "author": "rcls0053",
          "text": "By being flexible, adjustable. Accept that things will change, and you have to adjust course. It's better to get that feedback early, so you haven't spent too much effort in going the wrong way, which means we show the work early to the customer to get that feedback. Short iterations, early feedback. Then you try to continuously improve your ways of working, by reflecting on how it's gone.",
          "score": 18,
          "created_utc": "2026-02-26 11:18:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7i1xvl",
          "author": "sp3ng",
          "text": "https://agilemanifesto.org/\n\nhttps://agilemanifesto.org/principles.html",
          "score": 16,
          "created_utc": "2026-02-26 12:09:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7kifyf",
              "author": "WaylundLG",
              "text": "This is the right answer. When there is such an easy canonical answer, I don't know why everyone tries to redefine it. I think the problem is that this answer still leaves it with the reader to determine if a particular practice makes them more or less agile and people want a cut and dry answer. I sympathize with their desire to have that clarity, but it's not that kind of question and I think we do a disservice to people when we try to appease them instead of challenge them.",
              "score": 2,
              "created_utc": "2026-02-26 19:33:11",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7m4wct",
                  "author": "sp3ng",
                  "text": "Yep. The manifesto defines values and principles, it doesn't define practices. The values inform the principles, and the principles should inform your team practices. For someone looking for something \"out-of-the-box\" I would generally point to Extreme Programming for a source of practices (and additional principles aligned with the Agile Manifesto). I think the biggest mistake people make though is looking at agile as a project management \"tool\" in separation to the \"software development\" bit. This often leads to frameworks that completely omit the technical practices that are required for agility. Even Scrum could be viewed as just XP with all the technical practices removed.\n\nTest Driven Development (test first), CI/CD (trunk based), pair programming, lightweight review process, feature flagging, continuous refactoring, etc are all a requirement for effective agility. It's funny that the list of practices that predict high performance in the Accelerate research are all straight out of XP.",
                  "score": 3,
                  "created_utc": "2026-02-27 00:27:17",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7hx0ws",
          "author": "ya_rk",
          "text": "The ability to discover when a plan needs to change, and the ability to adapt quickly and cheaply.  \n  \n  \nEach ability in isolation is insufficient",
          "score": 10,
          "created_utc": "2026-02-26 11:31:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7iqx3x",
              "author": "wringtonpete",
              "text": "I like it.\n\nAs I think you're saying, it's when they feel they can make the change themselves, rather than rely on managers to 'lead' them. Otherwise they quite rightly just do the job put in front of them.",
              "score": 3,
              "created_utc": "2026-02-26 14:37:01",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7irq4t",
                  "author": "ya_rk",
                  "text": "Thanks! to be honest i was thinking from whole company perspective, but it certainly can be the case for individuals and teams as well. Though usually their ability to adapt will be constrained by limits placed on them by the org. ",
                  "score": 1,
                  "created_utc": "2026-02-26 14:41:14",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o7izx9a",
              "author": "Ezl",
              "text": "To expand, the ability to build your “planning” around the expectation of change and to intentionally build teams, competencies and processes that are able to adapt without disruption.\n\nSo it’s said, I’m not correcting you at all - just building in what you said because I agree.",
              "score": 2,
              "created_utc": "2026-02-26 15:21:30",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o7jd4u2",
              "author": "CMFETCU",
              "text": "Even more broadly applicable:\n\nThe ability to change rapidly without pain. Pain in process, pain in product, pain anywhere.",
              "score": 1,
              "created_utc": "2026-02-26 16:22:19",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7hz3kp",
          "author": "Agile_Syrup_4422",
          "text": "To me, agile isn’t standups, sprints or Jira boards. It’s the ability to change direction without melting down.\n\nIf new information comes in, customer feedback, technical constraint, market shift, and the team can adapt quickly without political drama or months of re-planning, that’s agile.\n\nIt’s short feedback loops, real ownership and delivering value in small chunks instead of betting everything on a long plan.",
          "score": 7,
          "created_utc": "2026-02-26 11:47:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7ig3ql",
              "author": "NoBullshitAgile",
              "text": "I like!",
              "score": 1,
              "created_utc": "2026-02-26 13:39:13",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7hxaqy",
          "author": "LightPhotographer",
          "text": "Being flexible above sticking to a plan. \n\n  \nA plan is important but it was written with the information you had back then.  When the situation changes and you experience uncertainty, it's logical to stick to the plan - at least that is solid!  But it was only written with the information at the time - it's not gospel, it's not a prophecy and the people back then did not know more than you know now - in fact, the opposite is true.\n\nWelcome change, don't fight it.",
          "score": 4,
          "created_utc": "2026-02-26 11:33:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7hxpha",
          "author": "ckdx_",
          "text": "My organisation defines it as whatever the most recent consultancy tells us it is.",
          "score": 6,
          "created_utc": "2026-02-26 11:36:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7hy240",
              "author": "NoBullshitAgile",
              "text": "Uff... (I know those organisations)",
              "score": 1,
              "created_utc": "2026-02-26 11:39:41",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7ih56l",
          "author": "redditreader2020",
          "text": "A great idea defined long ago. Since then totally and completely destroyed by consultancies and corporations.\n\nSo current definition: see micromanagement",
          "score": 3,
          "created_utc": "2026-02-26 13:44:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7hy7nt",
          "author": "PhaseMatch",
          "text": "A lightweight way to manage business risk, by\n\n- making change cheap, easy, fast and safe (no new defects)\n- getting fast feedback from users on the value that change created",
          "score": 2,
          "created_utc": "2026-02-26 11:40:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7i23pp",
          "author": "keithb",
          "text": "By these value judgments:\n* Individuals and interactions are more value than processes and tools, although process and tools are valuable, so build an environment where individuals get to interact and to develop themselves.\n* Working software is the primary measure of value and is more valuable than anything else, including comprehensive documentation, although there are valuable kinds of documentation.\n* Customer collaboration is more valuable than contract negotiation, and that includes _all_ change-control processes, which are pure waste, including ones implemented in Jira.\n* Responding to change is more valuable than following an existing plan, in particular, what \"working\" means for your software will and should change, so plan little and replan often.",
          "score": 2,
          "created_utc": "2026-02-26 12:10:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7imfze",
          "author": "chrisboy49",
          "text": "Its common sense, in a world where common sense is not so common and now neither is the virtue of   \nPatience so......",
          "score": 2,
          "created_utc": "2026-02-26 14:13:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7jrz7k",
          "author": "Consistent_Voice_732",
          "text": "Agile is about flexibility, collaboration and iterative progress",
          "score": 2,
          "created_utc": "2026-02-26 17:30:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7lqcwb",
          "author": "Internal-Alfalfa-829",
          "text": "I'll tell you what it's not: A free-card to randomly and repeatedly disrupt a team's work with unqualified side requests just because some event created a false sense of urgency (\"There is a small bug we haven't fixed in months but now the CEO's nephew experienced it and we have to drop everything.\")",
          "score": 2,
          "created_utc": "2026-02-26 23:07:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ib3h4",
          "author": "Puzzleheaded-Bug6244",
          "text": "Being agile means having passed several courses and performing certain rituals in a rigid schema. That is the true meaning of being agile.",
          "score": 3,
          "created_utc": "2026-02-26 13:10:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7j02vv",
              "author": "Ezl",
              "text": "🤣\n\nSadly, far too many believe this is the way.",
              "score": 1,
              "created_utc": "2026-02-26 15:22:15",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7i0dy8",
          "author": "Zerodriven",
          "text": "Adapting to change as it comes up. Simple. \n\nThe rest is just methodology and people automatically assume \"scrum\" or \"kanban\". This is just the tooling, it's all mindset and adaptation.",
          "score": 1,
          "created_utc": "2026-02-26 11:57:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7i32yj",
              "author": "NoBullshitAgile",
              "text": "Agreed - I wonder why so many got me in the other thread so wrong",
              "score": 1,
              "created_utc": "2026-02-26 12:17:23",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7ijrwp",
          "author": "SebastianSolidwork",
          "text": "The ideal / theory: What you described in the other thread.\n\nThe sadly often occurring practice: What some describe here. Micromanagement, rituals, certifications.\n\nExternal factors/forces water down the ideal until nothing is left, but phrases and lib service.",
          "score": 1,
          "created_utc": "2026-02-26 13:59:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7iu66z",
          "author": "wringtonpete",
          "text": "I'll go a little off piste and say it's a framework for software engineering based on human nature and evidence rather than spreadsheets and wishful thinking.\n\nBecause of that it needs much more thought to implement, since human relationships are more difficult to nurture than summing columns on a spreadsheet. However when done right it provides much better and more predictable outcomes.",
          "score": 1,
          "created_utc": "2026-02-26 14:53:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7j2dds",
          "author": "Triabolical_",
          "text": "I define it based on the agile manifesto.",
          "score": 1,
          "created_utc": "2026-02-26 15:32:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7k2j8d",
          "author": "PrestigiousAnt3766",
          "text": "Kanban done wrong",
          "score": 1,
          "created_utc": "2026-02-26 18:19:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7kaxf2",
          "author": "benabus",
          "text": "noodle bones",
          "score": 1,
          "created_utc": "2026-02-26 18:57:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7lgfxd",
          "author": "davearneson",
          "text": "Agile is defined by the Agile Manifesto. Its fundamentally about fast feedback loops so you can learn fast and deliver value to your customers rapidly. If you are doign this you are agile.",
          "score": 1,
          "created_utc": "2026-02-26 22:16:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7lplnt",
          "author": "nierama2019810938135",
          "text": "The important thing is how you and your team defines agile collectively.",
          "score": 1,
          "created_utc": "2026-02-26 23:03:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ost38",
          "author": "Nick_MarketStrategy",
          "text": "Actually I like to think of \"agility\", not agile. My definition is probably not what other people would think, but I think of agility as \"aligning goals with work across the organization\" and \"being flexible to respond on time when priorities suddenly shift\". I have seen in my experience how enterprises take forever just to communicate their shifting priorities to teams and by the time they start working on the new thing... priorities shift again. So, that's my view about agile/agility. Curious to hear what others think?",
          "score": 1,
          "created_utc": "2026-02-27 12:13:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7xffii",
          "author": "Nowhere-Man-Nc",
          "text": "After working with Agile alongside other approaches along the whole Cynefin continuum for almost twenty years, my view has become quite simple.\n\nAgile does not magically make development faster, cheaper, or easier. It does not manage risk better. It does not reduce effort. And it certainly does not guarantee better outcomes or quality on its own.\n\nAt its core, Agile starts with two assumptions: you cannot reliably predict if the job is complex *for you*, and you *will* make mistakes. Not that mistakes are possible. That they are *inevitable*.\n\nThe real question is not whether something will go wrong, but where it will go wrong and how quickly we will see it. When applied correctly, Agile shortens the time to detect a mistake and reduces the cost of mistakes. That is its measurable advantage I can see in a pretty much reliable manner.",
          "score": 1,
          "created_utc": "2026-02-28 19:22:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7xhdcx",
              "author": "NoBullshitAgile",
              "text": "That is a great definition and I see it completely the same. Do you mind to read my thinking model and give me feedback?",
              "score": 2,
              "created_utc": "2026-02-28 19:32:25",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7hvtik",
          "author": "potatoelover69",
          "text": "Willingness to change plans. That's it.",
          "score": 1,
          "created_utc": "2026-02-26 11:21:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7iw4wo",
              "author": "Affectionate-Log3638",
              "text": "I appreciate wanting to keep it simple, but it needs more to it than this.\n\nI would add that it's creating autonomous teams that have the flexibility to respond changes as they see fit, to deliver value.\n\nI say this because \"a willingness to change plans\" puts them solely at the mercy of leadership who will inevitably abuse this. I've seen leaders who force feed half baked plans and then demand massive changes every week and expect the teams to do it because \"agile teams are able to adapt to changes.\" The teams experience whiplash, get frustrated, and burn out. And then the leaders wonder why the teams \"aren't performing\".",
              "score": 1,
              "created_utc": "2026-02-26 15:03:17",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7hxwi7",
          "author": "NoBullshitAgile",
          "text": "Happy to read the first answers. Would you agree that agile is mainly about a learning system and try to make that learning as good / reliable / fast / secure / ... as possible? Can we describe it this way?\n\nThis system is capable of learning. We can describe it as follows. A system is capable of learning if:\n\n1. Work produces **real effects**\n2. These effects become **visible**\n3. Decisions **respond** to them\n4. Future work **arises** from them\n\nIf one of these conditions is missing, an open loop is created. This can be productive, but it is **not adaptive**.",
          "score": 0,
          "created_utc": "2026-02-26 11:38:25",
          "is_submitter": true,
          "replies": [
            {
              "id": "o7i08sp",
              "author": "ya_rk",
              "text": "Capable of learning AND changing, and the cost/speed of both do matter (so if your company can change but it requires a massive org redesign, millions in retraining, and hiring/firing, then that's not really what we're aiming for). I believe you imply it but i think it's worth making explicit.",
              "score": 1,
              "created_utc": "2026-02-26 11:56:29",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7i2zqx",
                  "author": "NoBullshitAgile",
                  "text": "Understood - and yes, thats part of \"learning\" but you are right!",
                  "score": 1,
                  "created_utc": "2026-02-26 12:16:44",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            },
            {
              "id": "o7i26rf",
              "author": "Xana707",
              "text": "Pas vraiment. L'apprentissage peut faire partie de la méthode agile (avec la méthode lean ux par exemple). Mais ca reste un modèle. Ça ne définit pas l'agilité en soi.",
              "score": 1,
              "created_utc": "2026-02-26 12:10:53",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7ip7ta",
          "author": "Kenny_Lush",
          "text": "“A dystopian micromanagement methodology characterized by the militant and degrading redefinition of benign concepts. For example: a status meeting is now a command to ‘STAND UP!’ and a project assignment is given as the order to ‘SPRINT!’”",
          "score": 0,
          "created_utc": "2026-02-26 14:28:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7kgxo9",
          "author": "BoBoBearDev",
          "text": "If you can freely make 200 commits into your own git branch without bunch of dictators telling you to pass certain rules (except password rule), that's agile for me.",
          "score": 0,
          "created_utc": "2026-02-26 19:25:58",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rh2hi7",
      "title": "The Hidden Cost of Slow Feedback Loops",
      "subreddit": "agile",
      "url": "https://revontulet.dev/p/2025-hidden-cost-slow-feedback-loops/",
      "author": "fagnerbrack",
      "created_utc": "2026-02-28 13:20:31",
      "score": 6,
      "num_comments": 4,
      "upvote_ratio": 0.8,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1rh2hi7/the_hidden_cost_of_slow_feedback_loops/",
      "domain": "revontulet.dev",
      "is_self": false,
      "comments": [
        {
          "id": "o7vifey",
          "author": "fagnerbrack",
          "text": "**Summary below:**\n\nSlow feedback loops silently drain engineering teams. Teams often lose the ability to verify changes locally and resort to deploying to staging environments, a problem that creeps in gradually — like a boiling frog — as dependencies accumulate without anyone maintaining local verifiability. The math hits hard: 8 engineers each spending 10 extra minutes per verification across 6 daily attempts equals 480 lost minutes — one full-time engineer's capacity gone. Unlike code coverage, teams rarely set targets for verification speed, so the degradation goes unnoticed until delivery grinds down. Investing constant, small effort into keeping local feedback loops fast avoids a compounding debt that eventually overtakes any short-term velocity gains from skipping that work.\n\nIf the summary seems inacurate, just downvote and I'll try to delete the comment eventually 👍\n\n[^(Click here for more info, I read all comments)](https://www.reddit.com/user/fagnerbrack/comments/195jgst/faq_are_you_a_bot/)",
          "score": 1,
          "created_utc": "2026-02-28 13:20:31",
          "is_submitter": true,
          "replies": [
            {
              "id": "o7wxvyg",
              "author": "Rruffy",
              "text": "I'm curious, what would a local feedback loop look like? Tbh we usually verify through monitoring in production.. That's not even staging environment, that's production environment.. What does verifying changes locally mean in this context? What verification activities?",
              "score": 1,
              "created_utc": "2026-02-28 17:54:35",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7x5d65",
                  "author": "nubbins4lyfe",
                  "text": "Automated tests, etc. anything in your build pipeline can be run locally to validate... You just make the call as to how much you want to validate locally.",
                  "score": 1,
                  "created_utc": "2026-02-28 18:31:25",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1rca834",
      "title": "Any Product Managers using tools like Lovable, bolt, claude or any ai tools?",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1rca834/any_product_managers_using_tools_like_lovable/",
      "author": "Busy_Cartoonist3724",
      "created_utc": "2026-02-23 06:41:00",
      "score": 4,
      "num_comments": 17,
      "upvote_ratio": 0.63,
      "text": "I work in a SaaS company, and I’ve been exploring different tools to help organize to find ai product. I’ve tried turning Epics and feature ideas into interactive workflows or small prototypes using tools like Lovable, and it’s made me wonder is this a practical way to share concepts with the team?\n\nI’d love to hear from other PMs what tools do you use to make your ideas tangible and easier for your team to act on?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1rca834/any_product_managers_using_tools_like_lovable/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o6x57od",
          "author": "squigfried",
          "text": "They're all very different. I would avoid the \"full app build\" tools like Lovable for any sort of prototyping, sticking to things that are lighter and don't result in anything that could be misconstrued as production-ready.\n\nClaude is the heavyweight but very much \"power user\" territory.\n\nThe sweet spot for prototyping are Google's tools. Nano banana for image/UI generation, Gemini Pro as a sounding board and expert consultant, and Google AI Studio for small coded interactive prototypes/apps.\n\nUsing Gemini to explore ideas and critique requirements, image generation to envisage designs or themes, and AI Studio if there's a need to explain/experiment with something more interactive.",
          "score": 7,
          "created_utc": "2026-02-23 08:25:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o731oxy",
              "author": "Busy_Cartoonist3724",
              "text": "That’s a really thoughtful breakdown especially the point about avoiding prototypes that look production ready. I can see how that can create confusion or false expectations.\n\nI like your idea of using Gemini more as a thinking partner rather than a builder. That framing actually helps a lot.\n\nBy the way, i need a small help from you I sent you a small DM would really appreciate if you could check it when you get a moment",
              "score": 1,
              "created_utc": "2026-02-24 04:54:22",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o73s4q5",
                  "author": "squigfried",
                  "text": "That \"small DM\" was trying to sell me something. I don't appreciate that, and you are an AI.\n\nLoathsome.",
                  "score": 3,
                  "created_utc": "2026-02-24 08:40:37",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6wwru6",
          "author": "Lordvonundzu",
          "text": "Never having used those tools myself yet, I think using Vibe coding \"only\" for concept presentation and getting people on board is a better and more sane and future proof approach than assuming you can now be the jack of all trades developer. \n\nStill, it kinda depends who you're pitching an idea to. Users, non-technical people, who are normally not part of the development process? Then it might be helpful. \n\nDevelopers? Let me put it this way: As PM you've always had to be able to convince Devs, what's more important is your narrative etc. Before you would have used mock-ups from UX. Devs are used to more abstract presentation of concepts, I'm not convinced it's needed there? \n\nSo overall I like the playfulness of it, but ... Idk, but as PM I myself have found AI tools more useful as thinking partner (eg die the creation of said narratives, etc.)",
          "score": 5,
          "created_utc": "2026-02-23 07:05:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6x2r0q",
              "author": "Busy_Cartoonist3724",
              "text": "Absolutely, that makes a lot of sense. Using AI as a thinking partner to refine narratives and structure concepts feels much more valuable than just generating code. It’s about enhancing your process, not replacing the collaboration or creativity that developers bring. The “playful” side is nice, but the real win is clarity and alignment across the team.",
              "score": 2,
              "created_utc": "2026-02-23 08:01:45",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6xeqqg",
          "author": "Accomplished_Buy1055",
          "text": "As I don't have an ui/ux team member, I use Google AI Studio to create mock-ups of features I want.\n\nFor example, want a toggle button to switch from lined to cards? Just save your current page in html, paste it into Google AI Studio and ask it for the feature, then you have a fully working and high fidelity mock-up to guide the development team.\n\nDefinitely useful.",
          "score": 4,
          "created_utc": "2026-02-23 10:00:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o735e4g",
              "author": "Busy_Cartoonist3724",
              "text": "That’s actually a smart way to use it especially saving the HTML and iterating directly on something real instead of starting from scratch. Makes it much easier for devs to understand intent.\n\nSounds like a very practical workflow when you don’t have a dedicated UI/UX resource.\n\nAre you also using any AI tools for code generation itself, or mainly keeping it at the mock-up and concept level?",
              "score": 2,
              "created_utc": "2026-02-24 05:21:42",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7eyg7x",
                  "author": "Accomplished_Buy1055",
                  "text": "Thanks! Indeed it does help!\n\nAnd yes! I was using GitHub Copilot to create tickets, it's pretty good as it has the codebase context and is able to help the devs with technical aspect of it. They liked it! Can make refinement a lot easier as the starting point is already there!",
                  "score": 1,
                  "created_utc": "2026-02-25 22:57:45",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6ziegn",
          "author": "Consistent_Voice_732",
          "text": "Even small interactive workflows make concepts tangible- AI tools just speed up drafting and iteration",
          "score": 2,
          "created_utc": "2026-02-23 17:36:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o73k9d8",
          "author": "zero-qro",
          "text": "Since I have a development background I've being using Google Antigravity + Claude Opus for prototyping ideas and user flows and it has been incredibly useful.\nWay easier and faster for me to convey ideas and iterate over it.",
          "score": 2,
          "created_utc": "2026-02-24 07:26:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7h7sis",
              "author": "Busy_Cartoonist3724",
              "text": "That’s awesome If you’re looking to take your prototypes further, you might want to try Brunelly. It goes beyond idea generation and prototyping turning your specs into fully structured, deployable apps while handling quality and reducing rework.",
              "score": 1,
              "created_utc": "2026-02-26 07:35:37",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7j0wk5",
          "author": "Ancient-Ad-2507",
          "text": "As a PM, I mostly use AI for deck creation. Plus AI builds native PowerPoint slides inside the app. That means no exporting or workflow changes. I use it for sprint reviews and planning decks. Everything stays editable. It saves a lot of repetitive work.",
          "score": 1,
          "created_utc": "2026-02-26 15:26:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7nkplv",
          "author": "ViRzzz",
          "text": "As a PM, I mostly use Al for deck creation. Plus Al builds native PowerPoint slides inside the app. That means no exporting or workflow changes. I use it for sprint reviews and planning decks. Everything stays editable. It saves a lot of repetitive work.",
          "score": 1,
          "created_utc": "2026-02-27 05:48:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7yp3h3",
          "author": "TheFitnessGuroo",
          "text": "I'm a founding engineer of Arkhet, a prototyping tool that uses generative AI but with a twist: we provide you with a simple drag-and-drop component canvas you can use to generate working code we deploy for you and you clients, accessible via your browser url. We just launched last December and are looking for new users. Feel free to give us a try and we are open to feedback!\nhttps://arkhet.app",
          "score": 1,
          "created_utc": "2026-02-28 23:30:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6yci9e",
          "author": "Necessary_Cable_1883",
          "text": "I replaced the user stories with vibe coded prototypes. ",
          "score": 1,
          "created_utc": "2026-02-23 14:12:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o73elrx",
              "author": "Busy_Cartoonist3724",
              "text": "do you use any tools for code generation",
              "score": 1,
              "created_utc": "2026-02-24 06:36:48",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1rdsnvo",
      "title": "Agile for Hardware Development",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1rdsnvo/agile_for_hardware_development/",
      "author": "Own_Code_5573",
      "created_utc": "2026-02-24 21:03:57",
      "score": 4,
      "num_comments": 4,
      "upvote_ratio": 0.75,
      "text": "Hi!\n\nApplying Agile to physical products is a unique challenge. Whether you are an Agile expert or simply involved in the hardware product development process, I’d love your input for my Master's research! \n\n* **The Survey (5-8 mins):** Open to *anyone* involved in hardware development! Please share your real-world insights here:   [https://response.questback.com/fhwienderwkw1/1j7btajm5a](https://response.questback.com/fhwienderwkw1/1j7btajm5a)\n* **Expert Interviews:** I’m also looking to do a few short chats specifically with Agile experts in this niche. If you'd be open to sharing your deeper experiences, please **DM me or leave a comment!**\n\nAn upvote for visibility is hugely appreciated so I can reach more people in the industry. Thank you! 🙌",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1rdsnvo/agile_for_hardware_development/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o7f9679",
          "author": "SeaworthinessPast896",
          "text": "Look up Kevin Thompson, he was a chief scientist at c prime and his niche was exactly that agile in hardware. He has a book out as well you find it on Amazon.",
          "score": 3,
          "created_utc": "2026-02-25 23:56:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7pbxao",
              "author": "Own_Code_5573",
              "text": "thanks I did not know him, I will check him out! ",
              "score": 1,
              "created_utc": "2026-02-27 14:11:29",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7h8n0w",
          "author": "IQueryVisiC",
          "text": "I thought that we are agile in software because the computer builds our stuff over night. Building is free. Of course once building has a cost, you cannot be agile anymore.",
          "score": 1,
          "created_utc": "2026-02-26 07:43:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7p5m42",
              "author": "WaylundLG",
              "text": "Short answer: nope. You are certainly correct that increased build cost and time changes calculations, but it doesn't change if you can be agile. A lot of hardware fields solved this long before agile even existed. Electrical engineers designed circuit boards on breadboards. These are a perfectly serviceable product. I had a neighbor years ago that built an entire custom lighting system in his house on them. Of course, notlw you can just 3d print a circuit board as fast as compiling your software, making the whole debate moot 😆.",
              "score": 1,
              "created_utc": "2026-02-27 13:36:26",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    }
  ]
}