{
  "metadata": {
    "last_updated": "2026-02-12 09:09:57",
    "time_filter": "week",
    "subreddit": "agile",
    "total_items": 12,
    "total_comments": 165,
    "file_size_bytes": 209528
  },
  "items": [
    {
      "id": "1r0gtw3",
      "title": "10 years of agile transformation buried in 6 months",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1r0gtw3/10_years_of_agile_transformation_buried_in_6/",
      "author": "morsofer",
      "created_utc": "2026-02-09 21:15:53",
      "score": 108,
      "num_comments": 26,
      "upvote_ratio": 0.97,
      "text": "I’ve been working at this company for 10 years, currently as a manager overseeing several IT teams. The company has its own internal IT department building internal products. When I started, we were moving from classic waterfall to Scrum. Like in any big corporation (2,000+ people in IT alone), it was slow and painful.\n\nDemos were basically walking through the backlog and accounting for every single task. Sprints had no real goal. Former analysts became Product Owners, and people with the least actual work were sent to Scrum Master trainings. Dailies were used by team leads to check if everyone was “doing something.” The organization cared about how much we delivered and how late it was - not *what* we delivered or what value it brought. A textbook “agile transformation.”\n\nBut after a few years, real change started to show. POs really dug into their domains and had deep knowledge of customers and competitors. IT invested in DevOps to speed up releases. Architecture evolved from one big monolith deployed 5 times a year into hundreds of independent microservices deployed on demand. Backlogs started to reflect actual customer needs instead of just task lists. Employee engagement scores were well above industry average in every survey. Over all of this watched a transformation department made up of Scrum Masters and change leaders.\n\nThen the board changed.\n\nThe new board introduced a new one-year strategy. This strategy had little to do with the product visions owned by individual POs and was pushed into IT through side channels. Chaos followed. Suddenly the board started blaming department directors for not delivering *their* goals. Directors started holding POs accountable for their existing roadmaps while trying to kill future increments to make room for “the strategy.” At the same time, IT directors bypassed POs entirely and pushed architectural changes under the label of “technical debt.”\n\nTeams ended up with three priorities: one from the PO, one from “the business,” and one from IT. Every delay caused fights between these three sides, finger-pointing, and accountability theater. A year passed. The board’s strategy was not delivered.\n\nSo the board decided to fire the entire transformation department (including all Scrum Masters) and introduced “improvement actions” to make sure this would never happen again.\n\nThose improvements included:\n\n* assigning an additional Project Manager to every PO to “help deliver projects on time”\n* abandoning story points in favor of estimating every task in days\n* limiting time for technical debt and bugs (!) to 10% and strictly enforcing reporting\n* hiring additional analysts to create Feature Requirement Documents for every product to “help IT estimate better and improve predictability”\n\nAll of this, of course, branded as *improving our agile way of working*.\n\nThat was 6 months ago.\n\nMore than half of the teams I know haven’t released a single change to production since then. Some teams still haven’t received FRDs for any change at all - analysts have been working on documentation for 6 months, and IT doesn’t even know what’s in it yet. I personally reviewed one of those documents (they had dependencies on my system) and saw that an FRD for a simple change was already 100 pages long.\n\nAt one point they asked me to confirm a single variable. I told them I’d look at it in a month because I was working on something else. They replied that in a month they’d already be assigned to another project and wouldn’t be able to update the document anymore.\n\nI’ve also heard Project Managers explicitly telling teams *not* to log time spent on technical debt, because we’d burn through our yearly 10% too fast and wouldn’t have any left for “more important bugs” later.\n\n10 years of transformation.  \nBuried in 6 months.\n\nI’m watching all of this from the sidelines. My department hasn’t gone through the new “transformation” yet and we’re still working the old way - just the team and the PO. We’re the last department in line for the great enlightenment. I’m going to try to use this time to prove to everyone above that the “old” system can still be efficient. Wish me luck - the last island of agility in this waterfall of despair.\n\nIn my opinion, the board threw the baby out with the bathwater. After the first year they clearly lost trust in POs and dismantled the entire system instead of trying other approaches. Not all POs were good at their job, and that’s probably the most important lesson I’m taking away from this whole story: being a PO is brutally hard and comes with real responsibility. Not everyone is cut out for it, and not everyone should take on that role. And paradoxically, over the last few months the best POs left, while the worst ones stayed - still pretending to be product owners, even though most of their decision-making power is already gone.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1r0gtw3/10_years_of_agile_transformation_buried_in_6/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o4i6412",
          "author": "ya_rk",
          "text": "Sorry to say but this is normal. New leadership asserts dominance by erasing the work of their predecessors, otherwise, what were they brought in for? When this happens, time to jump ship. You had a good run and most people don't even get that.",
          "score": 34,
          "created_utc": "2026-02-09 21:31:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ixycs",
              "author": "abacusmaxx",
              "text": "Agree, time to get out",
              "score": 5,
              "created_utc": "2026-02-09 23:57:41",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4i6h1m",
          "author": "dave-rooney-ca",
          "text": "What precipitated the change in the board? That's something that seems odd.",
          "score": 14,
          "created_utc": "2026-02-09 21:33:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4o2pnx",
              "author": "rcls0053",
              "text": "Typically if the company is purchased by another investor (been on companies that have), the board changes. Sometimes the founders and CEOs are on the board as well, but they can change as well.",
              "score": 1,
              "created_utc": "2026-02-10 19:26:44",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o4maae2",
              "author": "IQueryVisiC",
              "text": "Banks? Some anonymous investor has some strategy. The goal my be to harm the company. Some Tax scam. For example, tell me why investors pay openAI? I think they want to get rid of workers. So locally at their openAI investment it looks like loss, but for all of US it allows the rich to push financially independent employees into poverty and the poor out of the country.",
              "score": 0,
              "created_utc": "2026-02-10 14:23:10",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4ierg3",
          "author": "True_Turn_5286",
          "text": "This has been the way it always is. Leadership chooses zig. After a time, leadership decides to zag. Never figuring out that encouragement and thankfulness for work done does wonders.",
          "score": 12,
          "created_utc": "2026-02-09 22:15:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4md9la",
          "author": "agileliecom",
          "text": "This is one of the most honest posts I've read here in a while. \n\nThe part that's going to bother people is that both sides of your story prove the same thing. Agile was never the variable. Organizational power structure was.   \n\nWhen the old board gave teams space, invested in DevOps, let POs grow into their domains, things improved. Not because of Scrum. Because leadership created conditions where competent people could do good work.   \n\nWhen the new board showed up they didn't kill Agile. They killed the conditions that made it work. Then blamed the framework for failing. Then replaced it with 100-page FRDs and project managers layered on top of POs. That's just waterfall with extra steps and a body count.   \n\nThe part about PMs telling teams not to log technical debt time. That's not process improvement. That's cooking the books. Everyone in the room knows it but nobody can say it because the people who created the rule are the ones who'd have to hear it.   \n\nYour observation about the best POs leaving while the worst stayed is a pattern I've seen over and over. You strip decision-making power from a role, the people who were good at making decisions leave. The ones who were always just going through the motions don't even notice the difference.   \n\nGood luck being the last island, I mean that. But start documenting your results now., delivery frequency, incident rates, team retention. When the \"great enlightenment\" reaches your department, the only thing that might save you is numbers that make someone above pause before flipping the switch.",
          "score": 8,
          "created_utc": "2026-02-10 14:38:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ii6gj",
          "author": "wishlish",
          "text": "Agile is fragile at times",
          "score": 4,
          "created_utc": "2026-02-09 22:33:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ioqku",
          "author": "lukemedway",
          "text": "My advice, get out of there while you still have time on your side. For the love of God please don’t go down with the ship.",
          "score": 4,
          "created_utc": "2026-02-09 23:07:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4inyv2",
          "author": "ChykchaDND",
          "text": "Lol, almost a story of my life.\n\nThere are three ways this can go.\n\nEasiest one, - jump the ship and look elsewhere.\n\nSecond easiest, - swallow some pride or whatever and stop thinking seriously about your job.\n\nThe hardest, - you gather allies, you ride storms, you try to be so good, that objective results cannot be ignored. After about a year I'm still not sure if we're playing an already lost game or we can do it, but it's fun, trust me.",
          "score": 3,
          "created_utc": "2026-02-09 23:03:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4i6345",
          "author": "Kenny_Lush",
          "text": "Let me guess, they still do “STAND UP!!!” It was, and always will be, the only part of “agile” senior leadership ever cared about.",
          "score": 8,
          "created_utc": "2026-02-09 21:31:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4l6si6",
              "author": "morsofer",
              "text": "Haha, yeah, IT still does daily stand-ups. In general, IT is still trying to stick to all the Scrum ceremonies. I think no one really knows how else to work. But the business no longer shows up to demos, and retrospectives are basically just sweeping the main problems under the rug, because we have zero influence over the big changes anyway.",
              "score": 1,
              "created_utc": "2026-02-10 09:37:32",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4m9ed2",
                  "author": "Kenny_Lush",
                  "text": "Every time I see a job post that lists “agile” as a requirement, I know what they really mean. If a candidate described everything you did when things were working, they’d glaze over say, “no, not that - we do ‘stand up.’”  How did renaming a status call become a religion?",
                  "score": 1,
                  "created_utc": "2026-02-10 14:18:23",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4i7mpn",
          "author": "frankcountry",
          "text": "Shareholder value theory.  Sorry this happened to you and the teams.",
          "score": 3,
          "created_utc": "2026-02-09 21:39:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4i70gl",
          "author": "Honeychild06",
          "text": "Dang sorry to hear you are going through this. I think I might be going through something similar soon. The board changed about  9 months ago and now we are being asked for a brand new suite of kpi metrics...it is not good. The writing is on the wall, I think. Are you going to stay or apply out?",
          "score": 1,
          "created_utc": "2026-02-09 21:36:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4kx64n",
          "author": "subtrenmetroclet",
          "text": "Sounds like OTT, they are our suppliers and I work back to back with the team. It's literally what they've been through the past 6 months. ",
          "score": 1,
          "created_utc": "2026-02-10 08:03:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4q6xup",
          "author": "Lgamezp",
          "text": "This is exactly what \"scrum is bad\" people forget. There is NO ALTERNATIVE to agile but Waterfall.",
          "score": 1,
          "created_utc": "2026-02-11 02:02:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4wzstu",
          "author": "Purple_Tie_3775",
          "text": "People love to blame Agile’s failure on the bosses and CEOs but they don’t often realize that the CEO also has a boss that owns them: the board. Even the board is owned by the shareholders at times. It’s often quite a tragic mess. Convincingly the CEO isn’t enough. Other times the CEO is convincing but they don’t want to undercut their direct reports. \n\nYou can have the right leadership and stop fail. Success as a business is hard to come by. Failure is always right around the corner. And many companies love to do things the stupid way.",
          "score": 1,
          "created_utc": "2026-02-12 02:47:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4i6vf0",
          "author": "dethstrobe",
          "text": "This story feels AI generated. Name and shame?",
          "score": -6,
          "created_utc": "2026-02-09 21:35:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4imspo",
              "author": "flundstrom2",
              "text": "Problem is, the story is written using tried-and-tested storytelling. \n\nWell-known, used for more than a hundred years. Longer than that I assume, but my memories of the languages in the novels of old have faded over the years. So I can't tell for certain.\n\nBut the AIs are trained on it. Shakespeare, Hemingway, Tolkien. Coffeeboks, magazines, newspapers. Every word ever printed by man is devoured, replicated, spread.\n\nHow to differentiate between someone writing a story from a machine that does what it does best?\n\nCopying. Plagiarizing. Learning. \n\nLike a child, learning to write by reading the works of writers. \n\nNo, I'm not an AI. \n\nBut it does frustrate me, Reddit is flooded by stories - long and short - that follow the same pattern; Individual, thought out, written with care - on the surface. Beneath, there's nothing. The picture slowly appearing from the jigsaw puzzle of anonymous posts is gnawing in my mind - is Reddit, too, becoming an echo-chamber of AI-generated comments to AI-generated posts? Scraped and re-scraped by the bots until only the artificial randomness of the algorithms becomes what sets the stories apart.\n\nAn OpenClaw, Moltbook. Does the chrysalis really produce a butterfly? Or something else? \n\nNo, I'm still not a AI. But sometimes, it's fun to pretend I know how to write.",
              "score": 6,
              "created_utc": "2026-02-09 22:56:55",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4iqfwl",
                  "author": "dethstrobe",
                  "text": "Yeah, i agree. That's why I say it feels like AI. I'm not clear if this is. That's why I feel like if it had something just a bit more concrete that'd help sway my doubts.",
                  "score": 0,
                  "created_utc": "2026-02-09 23:16:16",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o4ii7ch",
              "author": "mrhinsh",
              "text": "That’s an unhelpful response to someone putting thought and effort into a well-structured story.\n\nEven if someone used spellcheck, Grammarly, or an AI editor, it doesn’t make the ideas less valid. “Name and shame” says more about the tone of the comment than the post itself.",
              "score": 8,
              "created_utc": "2026-02-09 22:33:09",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o4l76ed",
              "author": "morsofer",
              "text": "English is not my first language so I usually use chatgpt to do some editorial job in longer forms. The company is not in the US so the name would not ring any bells for you. And I am still working there so...",
              "score": 1,
              "created_utc": "2026-02-10 09:41:18",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4lt3sg",
          "author": "cliffberg",
          "text": "\"Former analysts became Product Owners, and people with the least actual work were sent to Scrum Master trainings...But after a few years, real change started to show. POs really dug into their domains and had deep knowledge of customers and competitors. IT invested in DevOps to speed up releases.\"\n\nBecause Scrum has NOTHING to do with agility. Eventually the company started to shift in things that actually matter. The would have go there sooner if, instead of introducing Scrum, leaders had simply asked teams what would enable them to go faster and built better things - and tried those approaches, learning along the way. Scrum was a false goal, a distraction, blocking true agility.\n\n\"The new board introduced a new one-year strategy. This strategy had little to do with the product visions owned by individual POs and was pushed into IT through side channels. Chaos followed.\"\n\nYes, the board stepped in an forced a top-down plan on everyone. That will quickly destroy engagement, innovation, and productivity - UNLESS the plan is about existential survival.",
          "score": 0,
          "created_utc": "2026-02-10 12:43:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4m4st9",
              "author": "morsofer",
              "text": "I agree. We live in post-scrum era. Scrum turned out to be half-agile for big corpos, not that different from SAFe.",
              "score": 2,
              "created_utc": "2026-02-10 13:53:24",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4m544o",
                  "author": "cliffberg",
                  "text": "This was agile, in a true sense - and it was in the 1980s: [https://www.linkedin.com/pulse/my-best-dev-team-experience-cliff-berg/](https://www.linkedin.com/pulse/my-best-dev-team-experience-cliff-berg/)",
                  "score": 2,
                  "created_utc": "2026-02-10 13:55:06",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1r0stjx",
      "title": "Wagile",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1r0stjx/wagile/",
      "author": "Grantor-5789",
      "created_utc": "2026-02-10 05:57:42",
      "score": 35,
      "num_comments": 39,
      "upvote_ratio": 0.89,
      "text": "At my last company Agile was real. Leadership backed it. The business understood it. Teams actually existed. Product owners owned something. It was not perfect, but it was honest and it delivered value more often than excuses.\n\nThen I came to this place that promised a big Agile transformation. What I walked into was project management with a new paint job.\n\nTwo months after I joined, new boss. Zero tech background. His boss? Zero tech background, but twenty plus years of traditional PM thinking and a deep love for dashboards that measure absolutely nothing useful. And the mindset that he’s right about everything and knows everything.\n\nNow we are “Agile” because we hold standups and shove work into ADO, which is a horrible tool, been begging for JIRA since Day 1. Leadership converts story points into days to close like math is optional and common sense is a rumor.\n\nThe newest brilliant idea is a KPI for velocity tracking. Not to help teams improve. Not to learn anything. Just to have a KPI to make it look like we’re doing something.\n\nThey also created a “demand intake process” and tried to make it Agile. It used to be a ticket queue with paperwork. Now it is a ticket queue with epics, user stories, and acceptance criteria that read like a legal contract. Same red tape, just wrapped in Scrum vocabulary.\n\nThere are no real teams. Everyone works on their own thing. Minimal collaboration. Priorities flip every couple of days. Ceremonies are status meetings with new names. Product ownership doesn’t exist, there’s no product. We are not Agile.\n\nSo I am stepping away from Agile for a while. Unless someone at the top decides to actually understand what Agile is, this will never change. They will keep measuring the wrong things, rewarding the wrong behavior, and acting shocked when nothing improves.\n\nAnyone else stuck in a similar Agile transformation?\n\nOh, and my boss uses ChatGPT to reply to every email the team sends now. Is that a new thing people are experiencing? Should I follow suite?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1r0stjx/wagile/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o4kl397",
          "author": "MartinFrankPrivat",
          "text": "If you are stuck read about zombie scrum from liberating structure...",
          "score": 15,
          "created_utc": "2026-02-10 06:14:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4l9xgv",
              "author": "Extreme_Dragonfly802",
              "text": "That book is from The Liberators (they use Liberating Structures in their facilitation though)",
              "score": 7,
              "created_utc": "2026-02-10 10:07:50",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4m9nvu",
                  "author": "MartinFrankPrivat",
                  "text": "It has been a while since I had read from them. Thank you very much for making that correct 😘",
                  "score": 6,
                  "created_utc": "2026-02-10 14:19:48",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4klca2",
          "author": "PhaseMatch",
          "text": "Two words make me shudder.\n\n\"Transformation\" and \"Ceremonies\" \n\n\\- transformations don't work; especially not agile ones  \n\\- ceremonies means they haven't looked at the Scrum Guide since before 2013\n\nYou don't need to use Scrum to be agile, but those two words in combination are usually a red flag.\n\n\n\n\n\n",
          "score": 11,
          "created_utc": "2026-02-10 06:16:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4lx9ol",
              "author": "SleepingGnomeZZZ",
              "text": "The word “ceremonies” has never been in the Scrum Guide (not even version 1 that came out in 2011)",
              "score": 5,
              "created_utc": "2026-02-10 13:10:27",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4ngihs",
                  "author": "PhaseMatch",
                  "text": "I was fact-checking before I posted and went back to the 2013 Guide lol.  \n  \nThere's an article here that points at a slide deck by Mike Cohn, and towards Crystal:  \n[https://www.scrum.org/resources/blog/fascinating-origin-term-scrum-ceremony](https://www.scrum.org/resources/blog/fascinating-origin-term-scrum-ceremony)\n\nNo disrespect to Mike or Alistair Cockburn, but  I tend to associate it with a \"processes and tools\" mindset and/or a Theory-X type censure/reward approach to management.",
                  "score": 4,
                  "created_utc": "2026-02-10 17:45:27",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o4kxfow",
              "author": "Abject-Kitchen3198",
              "text": "Also, you don't need to be agile to use Scrum.",
              "score": 1,
              "created_utc": "2026-02-10 08:05:43",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4l52d0",
          "author": "RevolutionarySky6143",
          "text": "'Now it is a ticket queue with epics, user stories, and acceptance criteria that read like a legal contract'.  That sounds like good hygiene.  As a Tester for many, many years, I need this information to be able to deduce if something has been implemented correctly (also understanding the hierarchy of functionality is handy).  Acceptance Criteria is crucial for me as tester to be able to deduce how 'well' whatever has been built.  That's not red tape, that's someone doing their job properly when they create PBI's.\n\n'Priorities flip every few days'.  Yup, that's part of having an Agile mindset.  The PO can change their mind about what the team builds every single day if they deem it necessary.  Sure, it's a pain in the arse and it's entirely inefficient, but being able to change direction is exactly what Agile teaches.  \n\nThere's also nothing wrong with velocity tracking, although it should primarily be used by Feature Teams themselves for their own reflection/planning.  Once you start to see external Stakeholders use the metrics, then be cautious.  Caveat, I have seen Finance departments use velocity to calculate the cost of Sprints in order that they fund teams appropriately.  Understanding that there is an eco system around teams is a very good thing.  You don't exist in isolation.  \n\nThere are no ceremonies mentioned in the Agile manifesto.  This sounds like you don't understand things, your points are vague.  Are you referencing Scrum here?  Agile is a set of mindset behaviour and principles, makes no reference to US points or how US's should be formulated for example.  \n\nWhen someone starts to criticise something, I always ask them to suggest something better.  Usually, they can't.  Don't be one of those people.  ",
          "score": 7,
          "created_utc": "2026-02-10 09:20:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ms6e3",
              "author": "HSSonne",
              "text": "Believe he is referring to SAFe.",
              "score": 2,
              "created_utc": "2026-02-10 15:52:59",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4n85xp",
                  "author": "RevolutionarySky6143",
                  "text": "SAFe is a gigantic framework encompassing so many other smaller processes.  Pointing to the gigantic framework as a whole, without pinpointing to which smaller part is at fault (or only referencing PI Planning, which is part of SAFe, but not just the only part of SAFe) shows you don't know what you are talking about.  ",
                  "score": 1,
                  "created_utc": "2026-02-10 17:06:50",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o4ptoaw",
                  "author": "Grantor-5789",
                  "text": "I’ve never worked in SAFe but I’ve heard not good. But who knows.",
                  "score": 1,
                  "created_utc": "2026-02-11 00:42:47",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4lj2ig",
          "author": "bedel99",
          "text": "I am experiencing every post on this subreddit was written by chatGPT",
          "score": 4,
          "created_utc": "2026-02-10 11:29:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ln4db",
              "author": "SoulTrack",
              "text": "I feel like most of reddit is written by chatgpt.  Dead internet is no longer a theory",
              "score": 4,
              "created_utc": "2026-02-10 12:01:22",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4lqz9s",
                  "author": "bedel99",
                  "text": "Thanks ChatGPT",
                  "score": 0,
                  "created_utc": "2026-02-10 12:29:12",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o4mez42",
              "author": "Disgruntled_Agilist",
              "text": "It's functionally unmoderated.",
              "score": 1,
              "created_utc": "2026-02-10 14:47:57",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o4ptuab",
              "author": "Grantor-5789",
              "text": "I used it for parts. Other parts I didn’t. Sorry. You called me out tho.",
              "score": 1,
              "created_utc": "2026-02-11 00:43:45",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4mf99y",
          "author": "Kenny_Lush",
          "text": "Haaa. Sounds like we work at the same place. Someone needs to do a documentary on how the utopian vision of “agile” devolved into “we don’t have ‘status calls,’ we have ‘stand ups’.” I’d actually love to appear in that documentary and blame the founders for being oblivious to how all of this would eventually be weaponized.",
          "score": 2,
          "created_utc": "2026-02-10 14:49:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4lqx4o",
          "author": "MavicMini_NI",
          "text": "I once had a manager ask why my scrum teams velocity was only 50pts when the other team adjacent to ours was doing 90pts per sprint. I said leave it with me and ill sort it out.\n\nWhen he ran the report a month later he was shocked to see our new velocity was 500pts. He asked how we managed such an increase and would we mind speaking in front of the entire program to motivate teams.\n\nI said sure. But the trick was, simply adding a \"0\" at the end of all of our estimates.\n\nIt finally dawned on him just how pointless is was to champion velocity as the be all and end all of performance of a team.",
          "score": 3,
          "created_utc": "2026-02-10 12:28:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4mvhrd",
              "author": "jleile02",
              "text": "i hope this is a real story\n\n",
              "score": 2,
              "created_utc": "2026-02-10 16:08:30",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o4pu519",
              "author": "Grantor-5789",
              "text": "I’m going to do this, no joke. 😂\n\nExcept they have story points tied to “days of effort”.",
              "score": 1,
              "created_utc": "2026-02-11 00:45:29",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4rucr5",
                  "author": "MavicMini_NI",
                  "text": "Its such a pointless and subjective metric too. 1 day of effort varies from engineer to engineer and you just waste far too much time coming to a consensus that is often wrong.\n\nWe have since moved away from Scrum and into XP, and when you focus on an estimation system of 1/2/3 for User Stories that is based only around Risk or Perceived Complexity, its much more beneficial as it genuinely aids planning discussions.\n\nUsing points to estimate duration just leads to so many anti-patterns and individuals gaming the system. Eventually everything becomes pointed to account for \"effort\" and you cannot identify what is actual, legitimate shippable value",
                  "score": 1,
                  "created_utc": "2026-02-11 09:44:16",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4mslnc",
          "author": "Far_Archer_4234",
          "text": "> been begging for Jira since day 1.\n\nObviously a fake post.",
          "score": 1,
          "created_utc": "2026-02-10 15:54:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4pug7b",
              "author": "Grantor-5789",
              "text": "I used Jira for 8 years. I just really like it",
              "score": 1,
              "created_utc": "2026-02-11 00:47:18",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4mt199",
          "author": "Maverick2k2",
          "text": "‘Priorities flip every single day’\n\nThat’s the whole point of delivering work within an Agile environment and its selling point.\n\nAnother way to look at it, if the team is working on something that no longer adds any value, then what is the point in delivering it?",
          "score": 1,
          "created_utc": "2026-02-10 15:57:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ptglc",
              "author": "Grantor-5789",
              "text": "Exactly. \n\nBut you have to lock down a direction eventually. \n\nIf you change priorities daily and never complete something, what’s the value delivered?",
              "score": 2,
              "created_utc": "2026-02-11 00:41:33",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o4rj3ay",
              "author": "Leinad_ix",
              "text": "You took one principle from many ones and took it to the extreme. What about \"continuous delivery of valuable software\" or \"Working software is the primary measure of progress\"?",
              "score": 1,
              "created_utc": "2026-02-11 07:57:06",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4p3nja",
          "author": "KeepYaWhipTinted",
          "text": "I stopped reading at 'ADO is a horrible tool and Jira better'",
          "score": 1,
          "created_utc": "2026-02-10 22:19:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4pt1im",
              "author": "Grantor-5789",
              "text": "Mac vs Windows. ;)",
              "score": 0,
              "created_utc": "2026-02-11 00:39:09",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4pqrgk",
          "author": "RetireYoung72",
          "text": "WAGILE is better then Waterfall, which is better then cowboy coding.\n\nI like a demand intake process. Some way to say “no” up front.",
          "score": 1,
          "created_utc": "2026-02-11 00:26:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4psymi",
              "author": "Grantor-5789",
              "text": "Imagine being in a demand intake team that hasn’t said “no” to anything.",
              "score": 1,
              "created_utc": "2026-02-11 00:38:41",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4px8js",
                  "author": "RetireYoung72",
                  "text": "“Not now” should be more common. Especially if prioritizing 1 to N",
                  "score": 2,
                  "created_utc": "2026-02-11 01:03:39",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4y92vd",
          "author": "MrOddBawl",
          "text": "Welcome to most companies from my experience. I've been in interviews before were they described their \"agile\" before and I said \"that doesn't sound much like agile to me and the guy interviewing me was the PM. Had no idea what he was doing and I wasn't going to waste my time.",
          "score": 1,
          "created_utc": "2026-02-12 08:49:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4logdm",
          "author": "RevolutionarySky6143",
          "text": "If your company employs Agile Coaches and Scrum Masters with no software engineering background, you will always be in this status quo.  No one understands the SDLC deep enough to make any lasting change, because even if you take the Scrum framework, they will never understand The Why of anything they are prescribing teams to do.  Until you've contributed to the building of something, either as a Developer/Tester/BA, you are ill equipped to be part of an Agile Transformation.  Even more so when you haven't been exposed to 'good practices'.  I'm lucky to have worked in highly regulated industries (banking) which have mandated all kind of best practices.  Many teams don't know what they are.  Defining Acceptance Criteria is one of them.  ",
          "score": 1,
          "created_utc": "2026-02-10 12:11:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4pue24",
              "author": "Grantor-5789",
              "text": "Thank you!!!! I resonate with this a lot.",
              "score": 1,
              "created_utc": "2026-02-11 00:46:57",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r0jrec",
      "title": "jira alternatives or?",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1r0jrec/jira_alternatives_or/",
      "author": "Zealousideal_Leg5615",
      "created_utc": "2026-02-09 23:05:56",
      "score": 25,
      "num_comments": 21,
      "upvote_ratio": 0.9,
      "text": "So i was thinking about going with Jira for the company I work for cause it looks great but I’m not convinced it makes sense for us right now. We are an architecture/engineering setup with long-running projects, billable hours, resource planning, QA steps, and also a lot of invoicing tied to the work so I feel like Jira feels extremely task-heavy and too focused on software projects to help us with that specifically. We don’t really need epics and sprints as much as we need visibility from proposal to delivery and without integrations if possible tbh. I’m not even sure if this is possible but a girl can dream right?? \n\nCurious what people are using that’s more vertically focused and not just another kanban board with plugins on plugins.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1r0jrec/jira_alternatives_or/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o4wrkil",
          "author": "hutazonee",
          "text": "Jira works great but you would be better off with an industry specific tool like Milient imo !",
          "score": 8,
          "created_utc": "2026-02-12 01:58:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4y6hlt",
              "author": "ZealousidealCarry390",
              "text": "Industry specific is always better",
              "score": 1,
              "created_utc": "2026-02-12 08:23:57",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4itx1e",
          "author": "LightPhotographer",
          "text": "Jira can do it all, but it becomes about the tool.  You may find it very tempting to keep multiple projects, possibly with different workflows, for the different projects. \n\nAgile is about people and interaction more than it is about processes and tools. \n\nBillable hours are horrific and a good mood-killer.   \"Jeff can you have a look at this?\"   \"No mate, I am not allowed to write hours on that\".   \nBetter is to do work in sprints - make it weekly sprints - and dedicate one sprint 100% to one single project.    That way you tell the other project/customer 'I'm not going to do this for you right now, but next week I am 100% yours and I will be turning other people away for your benefit!\" ",
          "score": 5,
          "created_utc": "2026-02-09 23:35:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4kdxb4",
          "author": "HSSonne",
          "text": "I have used jira for 4years, and I honestly would suggest you try anything else.\nIt's too complex for what it's supposed to do, and the overview for long running projects is just not good enough.",
          "score": 3,
          "created_utc": "2026-02-10 05:17:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4msc7f",
              "author": "Maverick2k2",
              "text": "Sounds like your Jira instance and project is poorly configured.\n\nI’ve used them all, and in terms of configuration JIRA can do it all.",
              "score": 1,
              "created_utc": "2026-02-10 15:53:44",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4kwxa7",
          "author": "Vasivid",
          "text": "You should check [Teamhood.com](http://Teamhood.com) it has flexibility to offer both agile process related functionalities as well as traditional project management with time and cost. ",
          "score": 3,
          "created_utc": "2026-02-10 08:00:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4o27oq",
              "author": "sentrix_l",
              "text": "This hits hard. 4 years is enough time to earn a PhD in Jira-ology, and what do you get? A tool that manages your tool management instead of your projects.\n\nThe worst part is watching teams spend more time grooming the backlog than actually building things. It's like having a really expensive, really slow assistant who constantly asks \"but what about this field? Did you update the sprint? Is this ticket in the right swimlane?\"\n\nHonestly, for long-running projects that aren't software sprints, you're better off with something that doesn't fight you every step of the way. The dream is a tool your team actually uses without needing a certification course.",
              "score": 2,
              "created_utc": "2026-02-10 19:24:25",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4j4m4f",
          "author": "No_Wave_3579",
          "text": "Take a look at Clickup & Aha!",
          "score": 2,
          "created_utc": "2026-02-10 00:35:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4k6jfs",
          "author": "sentrix_l",
          "text": "Hey! So I actually built something that might fit what you're describing. SprintFlint (sprintflint.com) was made for teams who need visibility from proposal to delivery without the Jira complexity tax.\n\nWe're focused on the \"middle ground\" — more than a kanban board, less than an enterprise monster. You can track long-running projects (not just sprints), manage billable work, and see everything from first contact to final invoice.\n\nIt's still early (we're pre-launch with a small beta group), but your use case is literally why we started building this. Would love to show you around if you're open to it.\n\nAlso: ClickUp will do everything you want but you'll spend weeks configuring it. Linear is beautiful but very dev-focused. Monday is... Monday. Depends how much config pain you're willing to tolerate vs just getting work done.",
          "score": 2,
          "created_utc": "2026-02-10 04:24:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4msibh",
              "author": "Maverick2k2",
              "text": "Monday is shit.\n\nIf you just want to do basic task tracking , then use Monday.",
              "score": 2,
              "created_utc": "2026-02-10 15:54:32",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4k9m7z",
          "author": "SigTexan89",
          "text": "ClickUp expert here. I highly recommend the platform, has a lot of flexibility for whatever you need it to do. \n\nThere’s a huge learning curve, but once you get through it you can pretty much do what you want with ClickUp in a way few other tools can while keeping it looking pretty.",
          "score": 2,
          "created_utc": "2026-02-10 04:45:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ocuba",
          "author": "vabue",
          "text": "If you need more than a team board and backlog, bit real flexibility- Fibery.io is a great tool.",
          "score": 2,
          "created_utc": "2026-02-10 20:13:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4wg0j6",
          "author": "YummyMummy14",
          "text": "Well a lot of jira alternatives won’t have specifically all the features that jira has but the thing is that, if you are not in the dev space you probably don’t need them. You said that you work with architecture and engineering projects so why not look for a tool that has features for that specifically? Millient is good one",
          "score": 2,
          "created_utc": "2026-02-12 00:48:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4krjwb",
          "author": "dennis_andrew131",
          "text": "If Jira feels heavy, you’re not alone ,plenty of teams prefer lighter, more flexible tools that still support Agile workflows:\n\n* Trello - simple boards, fast to adopt\n* Linear - fast, focused issue tracking with clean UI\n* ClickUp - highly customizable with docs/tasks in one place\n* Notion (with templates) - lightweight planning + knowledge base\n* Asana - good for team workflows without Jira complexity\n\nThe right tool is the one your team actually uses consistently, not the one with the most features.",
          "score": 1,
          "created_utc": "2026-02-10 07:10:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4lcqtv",
          "author": "Simran_Malhotra",
          "text": "Jira is powerful, but it’s very sprint and software-workflow focused, which doesn’t always fit architecture or engineering projects. ProofHub works better for long-running projects where you need to track timelines, approvals, and overall progress without forcing Agile structures. It makes it easier to see project status from start to delivery. It also uses flat pricing, so adding team members doesn’t increase the cost.",
          "score": 1,
          "created_utc": "2026-02-10 10:33:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4mb6ya",
          "author": "agileliecom",
          "text": "Honest take: Jira is built for software teams running sprints. If you're not doing sprints, you're fighting the tool instead of using it. Everything in Jira assumes a cadence of plan-build-ship-repeat. Architecture and engineering projects with long timelines, billable hours, and invoicing tied to deliverables is a completely different workflow. \n\nWhat you're describing sounds more like project-based work with financial tracking. That's closer to what tools like Teamwork, [Productive.io](http://Productive.io), or even Monday handle out of the box. They're built for agencies and professional services where the project isn't a backlog of stories — it's a scope of work with a budget attached. \n\nThe fact that you already know you don't need epics and sprints means you've already figured out the most important thing. Don't let anyone sell you a tool that forces a methodology you don't need.",
          "score": 1,
          "created_utc": "2026-02-10 14:27:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4mj57h",
          "author": "Kenny_Lush",
          "text": "Sounds like you need is Excel rather than bolting “agile” terminology onto your existing, traditional project management practices. Trust me, once you rename “status call” to “stand up” you are doomed and will rue the day.",
          "score": 1,
          "created_utc": "2026-02-10 15:09:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4mru3z",
          "author": "Mission-Syrup1287",
          "text": "Hi! I've used a lot of different project management / delivery tools. Looks like you've gotten a lot of shout outs from folks representing their own products. Maybe I can provide more objective help.  \n  \nSome questions to understand what you need more. Sometimes if you understand the work structure / visibility you need that can help point to a specific platform.  \n  \n\\- How are you wanting to track or visualize work if not via task or epics?    \n\\- Would you create a container for each project and then within that you set the project deadline and key deliverables? Do you need to visualize the work in a timeline (kinda like Gantt or roadmap-esque?)  \n\\- Sounds like you need an aspect understanding effort for deliverables and team capacity and tracking time?   \n\\- Sounds like you need to track work along steps of your workflow (including QA).   \n\\- What are the other tricky aspects that have made other solutions not work?",
          "score": 1,
          "created_utc": "2026-02-10 15:51:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4o2b9n",
          "author": "sentrix_l",
          "text": "This hits hard. 4 years is enough time to earn a PhD in Jira-ology, and what do you get? A tool that manages your tool management instead of your projects.\n\nThe worst part is watching teams spend more time grooming the backlog than actually building things. It's like having a really expensive, really slow assistant who constantly asks \"but what about this field? Did you update the sprint? Is this ticket in the right swimlane?\"\n\nHonestly, for long-running projects that aren't software sprints, you're better off with something that doesn't fight you every step of the way. The dream is a tool your team actually uses without needing a certification course.",
          "score": 1,
          "created_utc": "2026-02-10 19:24:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4sahzj",
          "author": "cliffberg",
          "text": "Streamlilne: [https://www.agile2academy.com/streamline-product-description](https://www.agile2academy.com/streamline-product-description)",
          "score": 1,
          "created_utc": "2026-02-11 12:03:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4y0cup",
          "author": "itenginerd",
          "text": "When I was at a Jira shop, we used the Tempo add in for timekeeping/resource planning and the financials. I didn't get that deep into it, but it was a great UI for time entry and stored 90% of the data in the native Jira tables. Would definitely be something I'd look at.\n\nThe thing about Jira is that it can do anything you want it to do--which is so broad that if you don't really start focused, you can get lost really easy and end up with a suboptimal config. The only real restriction is you can only have 3 levels of task (epic/issue/subtask) in a project--but a) you can add 2 more if you go cross-project with some of the Advanced Roadmap stuff, and b) you can create issue types that are whatever you want so you don't ever have to use the word epic for any reason. Call 'em phase, subphase, and task if you want.  \n\nDefinitely not a bad idea to look at other stuff, I just look at it and think \"I could make Jira work for that\".",
          "score": 1,
          "created_utc": "2026-02-12 07:24:52",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r23kke",
      "title": "Happy Anniversary to the Agile Manifesto!",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1r23kke/happy_anniversary_to_the_agile_manifesto/",
      "author": "dave-rooney-ca",
      "created_utc": "2026-02-11 17:26:17",
      "score": 25,
      "num_comments": 7,
      "upvote_ratio": 0.81,
      "text": "The original \"Values\" statements were written up and agreed to by the participants on Sunday, February 11, 2001 at Snowbird in Utah, USA. the \"Principles\" were written a few months later.\n\n[http://agilemanifesto.org/](http://agilemanifesto.org/)\n\n\"We are uncovering better ways of developing software by doing it and helping others do it.\"",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1r23kke/happy_anniversary_to_the_agile_manifesto/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o4u6oyu",
          "author": "Hour_Web_5638",
          "text": "nothing but love for the manifesto but a lot of companies use the face 2 face rule to justify RTO. update that pls to god the loss of mental capacity from being in traffic two hours per day outweighs the benefits of f2f to a video call",
          "score": 7,
          "created_utc": "2026-02-11 18:00:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4u8krh",
              "author": "dave-rooney-ca",
              "text": "I agree with you. I was an ardent proponent of co-location in the '90s and remained so until 2020. I've since admitted that working remotely can be as productive.\n\nIn-person is much better for activities where a group needs to gain a shared understanding of something. Well-run planning sessions are an example (as compared to someone projecting Jira on a screen while everyone else just watches). Training people is MUCH harder when everyone is remote, but it can be done.\n\nNow counter that with the productivity and mental health gains of not having to commute, working in a comfortable space, being able to take breaks when needed, etc., and I think the gains at least balance the drawbacks.\n\nThere are exceptions, of course, but I'm firmly in the \"get together in person when it makes sense to do to, otherwise work wherever you're most productive\" camp.\n\nAs for the Manifesto, it represents a \"point in time\" state of the industry where we were railing against the massive processes that delivered more binders of requirements and change requests than actual value. We've learned a lot since and I don't think the original needs to be updated. Just go with what we've picked up over the last quarter century.",
              "score": 4,
              "created_utc": "2026-02-11 18:09:21",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4ujqa4",
                  "author": "PhaseMatch",
                  "text": "There are very solid reasons whey f2f is more efficient and effective when it comes to communication.  \nWhile I much prefer working from home, we now waste more time in longer, less effective online meetings.\n\nIt's much harder to sustain effective team cohesion and collaboration;  there's a gradual slide back towards individuals working on \"their cards\", as well as a rise in things like \"definition of ready\" or even  \"detailed requirements\" for developers.\n\nThe personal producivity gains can be very real - especially when faced with a commute over about 40 minutes (and the evidence is clear on that as well), but that does come at a price.\n\nI much prefer wfh, but I do think it's part of the reason why companies are reverting to giving teams less decision making autonomy over their products, and consolidating more of that into management tiers.",
                  "score": 3,
                  "created_utc": "2026-02-11 19:00:49",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o4v1xyd",
              "author": "YippieKayYayMrFalcon",
              "text": "Which is crazy because they can bring every US employee at my company back into the office and everyone I work with would be in 1 of 3 other states. Not to mention half of my team which is in India. So when we’re all in the office, we’re still on video calls with at least half the rest of the team.",
              "score": 3,
              "created_utc": "2026-02-11 20:27:52",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o4v8q00",
              "author": "nix206",
              "text": "Yea, RTO is a real problem. \n\nIf F2F is a core value of the company, then it seems reasonable that they should commit to  never use off-shore people for dev, test, qa, or call center. \n\nCan’t have it both ways.",
              "score": 2,
              "created_utc": "2026-02-11 21:00:55",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4u1601",
          "author": "DwinDolvak",
          "text": "Cool! I got my CSM from Mike Beedle (RIP) which always makes me feel pretty special.",
          "score": 3,
          "created_utc": "2026-02-11 17:34:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4w9oa5",
          "author": "takethecann0lis",
          "text": "Oh wow it’s a big one too! Quarter century!!",
          "score": 1,
          "created_utc": "2026-02-12 00:11:18",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qxou5t",
      "title": "Why do so many project managers struggle with agile?",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1qxou5t/why_do_so_many_project_managers_struggle_with/",
      "author": "MirthMannor",
      "created_utc": "2026-02-06 17:59:18",
      "score": 20,
      "num_comments": 90,
      "upvote_ratio": 0.73,
      "text": "Title, essentially. It seems that many PMs really struggle with agile delivery (and, to some degree, vice versa).\n\nWhy is that?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1qxou5t/why_do_so_many_project_managers_struggle_with/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o3xw8o0",
          "author": "yokobono",
          "text": "Project Management is typically run from a control perspective. Agile is support based. Having done both, the transition was difficult. Letting go of the very thing you used to use to be successful causes cognitive dissonance. ",
          "score": 75,
          "created_utc": "2026-02-06 18:03:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o40dl9l",
              "author": "tigershark_bas",
              "text": "This and that other tenets of agile are misunderstood. They think that simply doing the various rituals is Agile without understanding the underlying purpose.",
              "score": 11,
              "created_utc": "2026-02-07 01:54:33",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o3y5bhw",
              "author": "dave-rooney-ca",
              "text": "Exactly what I was going to say",
              "score": 4,
              "created_utc": "2026-02-06 18:46:39",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o3ytq6i",
              "author": "Ezl",
              "text": "> Project Management is typically run from a control perspective\n\nThen they are doing it wrong.",
              "score": 0,
              "created_utc": "2026-02-06 20:46:35",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o419wr3",
                  "author": "CardboardJ",
                  "text": "Project management is most often done wrong then. ",
                  "score": 0,
                  "created_utc": "2026-02-07 05:33:21",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o40dpmq",
              "author": "pineapplepredator",
              "text": "Agreed too many PMs think their job is to control or to be in the middle of everything. It takes a special personality to be able to support team needs however that support is needed.",
              "score": 1,
              "created_utc": "2026-02-07 01:55:18",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o42rzl9",
                  "author": "yokobono",
                  "text": "Agreed. It requires trust, often in a control based organization where trust hasn't been developed.",
                  "score": 0,
                  "created_utc": "2026-02-07 13:31:40",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o3ygx2c",
              "author": "brickenheimer",
              "text": "👆",
              "score": 0,
              "created_utc": "2026-02-06 19:42:46",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o43rdp3",
              "author": "kexnyc",
              "text": "Perfectly stated. Bravo!",
              "score": 0,
              "created_utc": "2026-02-07 16:39:29",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3xyf3k",
          "author": "Triabolical_",
          "text": "You need to be able to operate in facilitator/servant/team member role rather than director role.\n\nIt's a very different role. ",
          "score": 22,
          "created_utc": "2026-02-06 18:14:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3xwgbn",
          "author": "theholewizard",
          "text": "Because if you embrace agile fully they don't have a job",
          "score": 41,
          "created_utc": "2026-02-06 18:04:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3y08km",
              "author": "That_Other_Tim",
              "text": "This person agiles. \n\nI want my resume to be full of all things I helped get done. And the real customers have never asked for the plan or the raci or the gannt chart. Those aren’t what is celebrated when complete. \n\nEmpty to do list? Job successful and I have worked myself out of a job. \n\nI can then fuck off and go work on an infinity number of other things to go get done.",
              "score": 19,
              "created_utc": "2026-02-06 18:22:35",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o3y88eb",
              "author": "dastardly740",
              "text": "Job security, not role security. \n\nThe need for their skills doesn't just go away, but those skills are applied differently in a different role. But, too often Agile transformations either don't do job security or don't make it explicit so you get people trying to preserve their job instead of embracing a different role.",
              "score": 6,
              "created_utc": "2026-02-06 19:00:21",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o3zjp4n",
              "author": "LightPhotographer",
              "text": "I was in a scrum course.  The structure was being explained. One guy asks 'so where is the project manager in all of this?'  \nTrainer looks at his watch. \"Eleven 'o clock, we're only 3 hours in. Not bad\".\n\n",
              "score": 5,
              "created_utc": "2026-02-06 22:58:46",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o410fd7",
                  "author": "Wrong-Pineapple39",
                  "text": "I've seen more Project Managers block agile from being successful than I can count. Because agile was built to get PMs out of the way. And they know it. It's why PMI started buying up and selling their own BA and Agile. PMI is protecting turf.\n\n\nYet most \"predictive\" projects are complete failures that do not deliver ROI or outcomes. It's a massive scam.\n\n\nConstruction project managers are the only real PMs.",
                  "score": 4,
                  "created_utc": "2026-02-07 04:22:18",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o3yiurj",
              "author": "Historical-Brick-823",
              "text": "They just get renamed as Delivery Managers",
              "score": 4,
              "created_utc": "2026-02-06 19:52:17",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o46gbi9",
                  "author": "JimmiRustle",
                  "text": "Sometimes it feels like secretary work. Guys, you told me to manage this because you're too busy... Maybe if you stopped trying to micro-manage the shit out of the project you would have more time?",
                  "score": 0,
                  "created_utc": "2026-02-08 01:25:59",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o41acz8",
              "author": "CardboardJ",
              "text": "It's almost like the first rule of agile is people over processes and then you have a position dedicated to dictating process over people.",
              "score": 3,
              "created_utc": "2026-02-07 05:36:58",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o3y3ts6",
              "author": "Tee_zee",
              "text": "Ludicrous.\n\nSo agile teams never run projects? They never have dependencies, risks to manage, stakeholders to work with and communicate too, external parties to integrate with?",
              "score": 5,
              "created_utc": "2026-02-06 18:39:34",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3y6zk5",
                  "author": "The-Wizard-of-AWS",
                  "text": "They do all these things and somehow they manage to get it done without a project manager",
                  "score": 14,
                  "created_utc": "2026-02-06 18:54:28",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o410ypu",
                  "author": "Wrong-Pineapple39",
                  "text": "Of course they do. They self manage those things.\n\n\nIT PMs are glorified admins who contribute nothing but overhead.",
                  "score": 1,
                  "created_utc": "2026-02-07 04:26:10",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3y2d38",
          "author": "TomOwens",
          "text": "There are significant differences in mindset between predictive and adaptive (or agile) methods. You adopt adaptive methods when there's uncertainty or ambiguity in the work, so there's an inherent need to accept this ambiguity and make decisions even when you don't (and won't) have the full picture. There's also usually a greater sense of shared ownership, with the project manager doing less controlling and managing and more sharing knowledge and expertise, so the team can own the work and the process. All of this requires shifting from a doing mindset to a facilitating, teaching, coaching, and sometimes partnering mindset.\n\nAgility sometimes comes with a shift to a product-centric organization, which also changes the role of a project manager. Ownership shifts to product management and long-term product goals, with project management supporting the movement toward those goals rather than serving as the primary funding and organizational structure.",
          "score": 14,
          "created_utc": "2026-02-06 18:32:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3ya3ro",
              "author": "ResponsibilityOk4298",
              "text": "I’m going to be more blunt, in a product-centric environment, you don’t need product managers and they often can’t undertake the product owner role hence a major blocker to org change is people realise their jobs/power/influence is at risk so fight hard to protect that.\n\nEdit: yes, mistakenly typed product manager aren’t needed instead of project managers. Will leave it here so the next comment keeps the flow :-)",
              "score": 1,
              "created_utc": "2026-02-06 19:09:25",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3yam2r",
                  "author": "TomOwens",
                  "text": "I'm guessing that you mean that you don't need *project* managers in a product-centric environment. I'm not convinced of that. There's immense value in having project management skills and expertise within the organization. If you can find people with those skills who aren't project managers, then you're probably right. But my experience tells me that those people are rare. Having a (very) small number of project managers who serve as experts in project management to support teams and help teach others those skills is valuable.\n\nFor clarity, I'm including a range of information under project management skills: budgeting and financial management, cost management, measurements and metrics, risk management, change management, skills management and workforce planning, knowledge management, and information management, to name a few. Project management is broad, so no one person will know it all. It all comes down to understanding what knowledge and skills you need, what you already have, and a plan for obtaining the rest.",
                  "score": 2,
                  "created_utc": "2026-02-06 19:11:54",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3y644o",
          "author": "rwilcox",
          "text": "If you’ve built your career around when it’s going to be done, someone saying “well whenever we stop” or “when someone tells us what we’re building we can tell you how long it’s going to take”…… is a mind shift",
          "score": 9,
          "created_utc": "2026-02-06 18:50:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3xzxl4",
          "author": "Ueli-Maurer-123",
          "text": "Because nobody really knows what agile is.",
          "score": 11,
          "created_utc": "2026-02-06 18:21:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3y53qi",
              "author": "Kenny_Lush",
              "text": "Well, other than the places that have weaponized it for dystopian micromanagement. “Now STAND UP!!!!!!!”",
              "score": 4,
              "created_utc": "2026-02-06 18:45:37",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3y83m0",
          "author": "selfishvery",
          "text": "I have worked with so many project managers…. I have yet to see one actually manage a project 😂\nI think the role is more like a project admin: use the right cost account, are we on budget? Do we need more people, who will pay for it? Etc… they don’t make any management level decisions, based on my experience.",
          "score": 4,
          "created_utc": "2026-02-06 18:59:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3ya2bp",
              "author": "MCMcGreevy",
              "text": "Most organizations have project coordinators and call them project managers. Actual project managers own the project and have the authority and accountability to get it done.",
              "score": 2,
              "created_utc": "2026-02-06 19:09:14",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o42uqst",
              "author": "CardboardJ",
              "text": "I had a very good pm that explained things in terms of ROI. Being 2 weeks late on this delivery is worth $40k dollars. Not dropping what you're doing to fix this bug that a customer is complaining about threatens a 200k annual contract. Context switching to fix the bug is worth more so deal with it. \n\nMost PMs just exist to power trip and take credit for the achievement of others. Some put in the legit hard work to prioritize and control a delivery by adding the right padding and knowing when it makes sense to push deadlines back without having to ask engineering.",
              "score": 1,
              "created_utc": "2026-02-07 13:48:19",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3yih5t",
          "author": "phoenix823",
          "text": "Because agile isn't project management. PM methodologies like you find in the PMBOK make sense for a lot of different projects. Agile makes sense for managing the development of a software product. You can see from the very invective in this thread that the reasons/advantages/limitations for either approach have strong opinions and often an us vs. them mentality. \n\nGo watch a command and control PM find themselves useless on an agile program with a strong PO and self-directed development team. Then go find an agile practitioner flail when herding unaligned stakeholders and a delivery organization that acts as 8 individuals instead of 1 team. ",
          "score": 4,
          "created_utc": "2026-02-06 19:50:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3yuhwb",
          "author": "teink0",
          "text": "Ken Schwaber wrote: \n\n\"We have found that the role of the project manager is counterproductive in complex, creative work. The project manager’s thinking, as represented by the project plan, constrains the creativity and intelligence of everyone else on the project to that of the plan, rather than engaging everyone’s intelligence to best solve the problems.\"",
          "score": 5,
          "created_utc": "2026-02-06 20:50:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3yuuvc",
          "author": "Ezl",
          "text": "This thread is a mess.  All these supposed “agilisits” are adhering to dogma exactly the same as those they are trying to criticize.",
          "score": 2,
          "created_utc": "2026-02-06 20:52:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3zr2xt",
          "author": "PanicSwtchd",
          "text": "A properly calibrated and running agile team needs dramatically fewer PMs to manage the development 'overhead' while also being geared towards optimizing the aspects of development that are historically hard to 'report up'.\n\nThis usually leads to many agile teams to be improperly calibrated to be focused around 'reporting up' and forecasting via story points/t-shirt sizes and a bunch of other metrics which benefit Project Managers but steer away from the development overhead reductions which would make PM's redundant...i.e. the worst of both worlds.",
          "score": 2,
          "created_utc": "2026-02-06 23:40:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o419owa",
          "author": "Charliedotau",
          "text": "because of the confluence of these factors:\n\na) often times it turns out the best \"organising mechanism\" for the work is not in fact a project but a product. Which is to say applying project management to the work - albeit with agile meetings - misses the point.\n\nb) product management is often entirely foreign to project managers.  Many project managers in my experience - I was one of them - couldn't even articulate the difference between a project and a product.  \n\nc) the incentive to embrace the struggle may not be there.  Leaving the very thing you're trained in, at the door, is a big ask.  \"It is difficult to get a man to understand something, when his salary depends on his not understanding it.\"\n\nI'll close with a few invaluable resources I've found on my own project to product journey:\n\n* [Project to Product, by Mik Kersten](https://www.goodreads.com/book/show/40679042-project-to-product)\n* A single table, from Chapter 2 of Kersten's book, (reproduced [in this article about the book](https://catapult.cx/blog/what-is-project-to-product/))identifies 7 key differences between project and product management.    \n* [Funding Projects Vs. Teams - All Things Product Podcast with Teresa Torres & Petra Wille](https://www.producttalk.org/funding-projects-vs-teams-all-things-product-podcast-with-teresa-torres-petra-wille/)\n* This [fantastic quote](https://medium.com/@johnpcutler/great-one-pagers-592ebbaf80ec) from product sage, John Cutler\n\n> *Project Managers deal in the realm of time, cost, and scope (given a predefined solution). They assume that X is valuable. Product Managers operate in the realm of opportunity, value, and viability*\n\n\n\n\n\n",
          "score": 2,
          "created_utc": "2026-02-07 05:31:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o45pnth",
          "author": "Glass_Dimension_251",
          "text": "My counterpart on another team and I have been running major projects on our tech-focused teams using an agile format for two years and it’s worked really well for preventing burnout. We recently got a manger with a strict PM background who’s tasking everyone in the ground, and without surprise, everyone is on fire and tired.",
          "score": 2,
          "created_utc": "2026-02-07 22:43:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3xzscy",
          "author": "funbike",
          "text": "I think you misunderstand what Agile is.  I think you mean to ask is why do PMs struggle with the process at your company, which is inspired by Agile principles.  Like Scrum.\n\nAgile is not a process.",
          "score": 2,
          "created_utc": "2026-02-06 18:20:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3yc2oz",
          "author": "osefpseudo123",
          "text": "Because agile is mostly bullshit?",
          "score": 2,
          "created_utc": "2026-02-06 19:18:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3yaaun",
          "author": "ugly_lemon",
          "text": "In the case of my PM, it's incompetency 🤣 Not all are like this though. Only a small amount",
          "score": 1,
          "created_utc": "2026-02-06 19:10:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3yq2un",
          "author": "denwerOk",
          "text": "In my opinion, this is due to the 'grey areas' in Agile frameworks. Scrum, for example, focuses heavily on short-term execution but often treats long-term planning as if it doesn’t exist. Since clients and accounting departments usually require fixed budgets and timelines, PMs are left to bridge that gap. It’s difficult to satisfy both the dev team and the stakeholders when the process itself doesn't provide a framework for that ambiguity.",
          "score": 1,
          "created_utc": "2026-02-06 20:28:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3yu40m",
          "author": "Aydhayeth1",
          "text": "The stakeholders think they want agile, but also want to see everything up front, in minute detail.",
          "score": 1,
          "created_utc": "2026-02-06 20:48:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3yw0eo",
          "author": "roninthe31",
          "text": "Insecurity",
          "score": 1,
          "created_utc": "2026-02-06 20:58:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3yzc03",
          "author": "RJL_86",
          "text": "Project managers have no place in an agile organisation",
          "score": 1,
          "created_utc": "2026-02-06 21:14:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3zdkvn",
          "author": "Efficient-County2382",
          "text": "One aspect of this is that PMs also have to deal with many things thare are not agile, and they are the 'translator/manager' in the middle. Executive reporting isn't agile, nor is forecasting and 2/5 year planning, legal, risk, marketing, comm, business users and lots of other areas don't work in an agile manner either.",
          "score": 1,
          "created_utc": "2026-02-06 22:26:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3zmapc",
          "author": "Internal-Alfalfa-829",
          "text": "Because Agile means no more command & control and no more \"deadlines\" which are always a fairytale anyway.",
          "score": 1,
          "created_utc": "2026-02-06 23:13:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3zo4oj",
          "author": "lukemedway",
          "text": "Project management = command and control\nAgile = empowering others and leading from behind\n\nIt’s a completely different mindset.",
          "score": 1,
          "created_utc": "2026-02-06 23:23:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3zthbu",
          "author": "pm_me_your_amphibian",
          "text": "Servant leadership is profoundly different from bossing people about.",
          "score": 1,
          "created_utc": "2026-02-06 23:54:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4083uo",
          "author": "PhaseMatch",
          "text": "When scope, time and budget can all vary in a collaborative way, there's not much to manage,  \nConversely, when they can't vary without contract renegotiation, there is.   \n  \nIt's kind of that simple;  you have quite different skills and mindsets involved when the relationships are highly collaborative and based on investing one Sprint at a time.  \n  \nAnd conversely, that approach tends not to work well when the relationship are contractual and even a bit adversarial, and the investment is much greater.  \n  \nThe things that tend to hamstring working in an agile way are  \n  \n\\- when the team can't male change cheap, easy, fast and safe (no new defects)  \n\\- when you can't get fast feedback on whether that change was valuable  \n  \nIt can take a while for teams to get really good at those things.    \n  \nFor the project manager that's a problem as their measured on the project being delivered, not the long term investment in skills or even what happens when the project ends and the software is in use.        \n",
          "score": 1,
          "created_utc": "2026-02-07 01:20:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o43mqxv",
          "author": "gormami",
          "text": "The biggest reason I see is that the process isn't Agile to begin with.  They like the trappings, and expect the magical results, but 8 times out of 10, there isn't actually a Product owner.  The Product owner should be setting the path, what features are what priority, and the PM (Or Scrum Master) should be feeding back delivery dates, resource needs, etc. after discussions with the team.  Usually, the PM gets conflicting features, deadlines, and resources from multiple people, so they have to spend their time trying to sort through it all, which means communication with the team(s) gets muddled, which means the whole thing starts to rattle itself apart, and they blame the PM rather than whomever should have been the product owner.",
          "score": 1,
          "created_utc": "2026-02-07 16:16:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o43r93o",
          "author": "kexnyc",
          "text": "That’s a good question. It’s not magic. It’s not complex. The manifesto is clear and concise. But people still treat it like it’s voodoo that’ll do everything for you. \n\nFOLKS STILL NEED TO DO THE WORK. ¯\\_(ツ)_/¯",
          "score": 1,
          "created_utc": "2026-02-07 16:38:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o456iex",
          "author": "Regal_Kiwi",
          "text": "Because agile is a cry bully.",
          "score": 1,
          "created_utc": "2026-02-07 20:59:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o46ftjd",
          "author": "JimmiRustle",
          "text": "Because I'm not allowed to. If the process isn't rigid how are they going to control the project into the ground?",
          "score": 1,
          "created_utc": "2026-02-08 01:22:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4awhne",
          "author": "OccamsRabbit",
          "text": "Because so much agile is terribly executed. \n\nA seasoned project manager will know that the stakeholders expect some specific outcome at some specific point in time.\n\nPeople who misunderstand agile think that you just keep working and make up requirements as you go.\n\nManagement who misunderstand agile think thy can get rid of project managers, and then just blame developers for not making milestones that they never agreed to or, in some cases, didn't even know about. \n\nAn agile educated project manager goes back to first principles, and doesn't cling to ceremonies just because \"that's how we do it\". The plan should be built with flexibility in it, the team should be focused on delivering something that works, the stakeholders have to be available for testing and giving feedback, team should be reactive to input, and when inevitable changes happen everyone has to get on themselves page.\n\nAs the project manager your job is to make all of that happen, and hold everyone accountable.",
          "score": 1,
          "created_utc": "2026-02-08 19:22:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4kqmvt",
          "author": "dennis_andrew131",
          "text": "Most project managers struggle with Agile not because they lack skill, but because Agile asks them to lead differently. Traditional PMs are trained to control plans and predict outcomes, but Agile thrives on adaptation, collaboration, and uncertainty. If leadership, teams, and stakeholders aren’t aligned on that shift, PMs end up fighting against the very process they’re trying to run. Agile isn’t a set of ceremonies, it’s a mindset change for everyone, and that’s hard in real organizations.",
          "score": 1,
          "created_utc": "2026-02-10 07:02:25",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r05mrh",
      "title": "Motivation for my agile friends",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1r05mrh/motivation_for_my_agile_friends/",
      "author": "WaylundLG",
      "created_utc": "2026-02-09 14:28:37",
      "score": 14,
      "num_comments": 4,
      "upvote_ratio": 0.93,
      "text": "I read an article from an organizational change consultant last week who was clearly depressed about what he viewed as a lack of impact in his work. Organizations start to make big changes and then the change fades and they lose attention and momentum. As I read it I thought of how many coaches and scrum masters I've heard tell the same story. However, I also found myself thinking \"This guy needs to be proud of the change he accomplished. Not every company wants or needs to be a B Corp. And over the weekend I thought, \"I should take my own advice.\"\n\nNot every company wants or needs to be Spotify or whatever company you read about. Sure, I worked a company that changed their industry with Scrum and another that saved their company with it, but most just got a little nicer to work at or gained a smoother deployment process, and honestly, good for them.\n\nI also look around at how software is made now vs in the 80's and 90's and wow has Agile made a big change. Anyone else remember just having architects and BAs work on a project for 6 months and then having a thousand-page long requirements doc to hand to developers and then they couldn't ask the architects anything because they were off on another project? You don't see that around much anymore. And testing - remember how we used to do testing? No unit tests, no testing before you call a feature d9ne. Just build the whole damn thing then send 18 months worth of code over to the testing department and watch the bugs come back in swarms. \n\nWe've changed and improved a lot as an industry and Agile has been a big driver of it. People can dislike Agile all they want, but I don't see any of them running back to the old ways of working. Hope that brightens a few people's day.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1r05mrh/motivation_for_my_agile_friends/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o4ft4cb",
          "author": "rcls0053",
          "text": "I'll just say waterfall didn't go anywhere, the cycle just got a lot shorter. Instead of 6 months of planning, 18 months of coding, we now use 1 week of planning, 4 weeks of coding and use sprints to measure that. I'd also say it's somewhat due to tech getting a lot better. Compared to 80s and 90s, we have supercomputers at our disposal and network speeds to match. Makes sense that the development process speeds up as well.\n\nThe problem is, organizations leadership don't want to adapt to an agile mindset. They still operate in that factory era mindset. And it does make sense because the rest of the world, starting from the shareholders, operate in that way. They want future predicions and plans and strategies for months on ahead. They can't just go and wing it, trusting that the entire org pivots if something goes wrong.",
          "score": 3,
          "created_utc": "2026-02-09 14:38:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ftuxk",
          "author": "General-Belgrano",
          "text": "The good old days:\n\nStep 1 - Marketing Requirements Document  \nStep 2 - Product Requirements Document  \nStep 3 - Architect Design Document  \nStep 4 - Functional Requirements Document  \nStep 5 - Review that all functional requirements map back to a requirement in PRD and MRD.  \nStep 6 - Code the thing, and if you are using the fancy IBM/Rational Rose tool, then make sure all code has Javadocs that include the MRD and PRD numbers in them for CMS Level 5 traceability...\n\nWe have indeed come a long way.  Thank you for the post.",
          "score": 3,
          "created_utc": "2026-02-09 14:42:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4i7xpn",
              "author": "dave-rooney-ca",
              "text": "Upvote solely for the reference to Rose 😂",
              "score": 1,
              "created_utc": "2026-02-09 21:40:57",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4mcrtc",
          "author": "agileliecom",
          "text": "Fair point and I'll give credit where it's due. Nobody sane wants to go back to 18-month waterfall cycles with thousand-page requirements docs that nobody read. That era was brutal. \n\nBut I think the honest version of this story is messier than \"Agile made things better.\" What actually killed the old way wasn't the Agile Manifesto. It was version control getting better, CI/CD becoming practical, cloud infrastructure making deployment cheap, and the internet forcing shorter feedback loops. The tooling changed the game. Agile gave it a name and a framework.   \n\nThe part that concerns me is when \"we're better than the 90s\" becomes the bar. Yeah, we are. But that's a low bar. We went from no testing to checkbox testing. From no collaboration to ceremony-driven collaboration. From waterfall to sprints that often run like mini-waterfalls anyway.   \n\nBetter than the 90s? Absolutely. As good as we could be? Not even close.   I don't think the people frustrated with Agile want to go back, they want to go forward. Past the certifications, past the theater, past the process that replaced one kind of rigidity with another. The original manifesto was about people and outcomes. What most of us live with daily is Jira workflows and sprint velocity charts.   \n\nSo yeah. Take the win. The industry is better. But let's not confuse \"better than awful\" with \"good.\"",
          "score": 2,
          "created_utc": "2026-02-10 14:36:23",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qzr6n7",
      "title": "Scrum Master: project management or people management?",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1qzr6n7/scrum_master_project_management_or_people/",
      "author": "[deleted]",
      "created_utc": "2026-02-09 01:45:17",
      "score": 13,
      "num_comments": 17,
      "upvote_ratio": 0.93,
      "text": "I’ve historically viewed the Scrum Master role as closer to project management (coordination, delivery, some HR overlap). Lately, I’m seeing it operate more as people-focused - coaching, team dynamics, conflict, and team maturity.\n\nI’ve also noticed that the strength of product management (on the business side) really affects how the Scrum Master needs to show up.\n\nCurious how others see it:\n\nProject management or people management?\n\nWhat most influences that in your org?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1qzr6n7/scrum_master_project_management_or_people/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o4cx803",
          "author": "ckdx_",
          "text": "Primarily neither. The Scrum master is accountable for establishing Scrum, which is closer to a process rather than the people or project. Admittedly they dabble in all of the above.\n\nAt least in my org, the project and people management fall to the PO. This isn’t ‘by the book’ but I hear it is done elsewhere too.",
          "score": 11,
          "created_utc": "2026-02-09 01:50:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4d1v7f",
          "author": "adayley1",
          "text": "Agile ways of working are about applying human attributes as strengths instead of weaknesses. \n\nScrum is about supporting and optimizing relationships so the people are more effective.  \n\nScrum is a product or project management framework. The Scrum Master is not a project or a people manager. They are a work relationship coach.",
          "score": 7,
          "created_utc": "2026-02-09 02:15:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4d5yiv",
          "author": "lahlahs",
          "text": "A scrum master should not be managing either the project or the people, at least not in the traditional sense of those terms. In my experience, to be the most effective, the role needs to be people-focused. The goal is to guide the team into constantly improving how they work so that they can effectively and efficiently deliver what the customer needs. The goal is NOT to manage them into succeeding. You can use an unlimited number of tools to do this, but realistically they are all ultimately about the people doing the work. Depending on the needs of the team, this may involve aspects of both project and people management, but at no time should the SM have managerial power over the team or the project. That all too often quickly becomes a conflict of interest with their role.",
          "score": 7,
          "created_utc": "2026-02-09 02:36:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4d0dx5",
          "author": "B1WR2",
          "text": "My scrum master keeps me and the team accountable to making sure 1 I have everything done 2 and the devs are able to do the work",
          "score": 3,
          "created_utc": "2026-02-09 02:07:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4dzkov",
          "author": "PhaseMatch",
          "text": "***Does your org treat Scrum as a project management approach, or an agile delivery one?***\n\nKind of boils down to that, IMHO.\n\nSo many organisations run some home-brew \"Calvinball\" version of Scrum which waters down the concept to extreme micromangement and the role to project co-ordinator it's frankly not funny.   \n  \nWhere some organisations make the role about organisational change towards empiricism and a way to help the business effectively manage innovation risk.   ",
          "score": 2,
          "created_utc": "2026-02-09 05:44:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4e34hp",
          "author": "Bernhard-Welzel",
          "text": "The job of the Scrum Master is to establish Scrum as described in the Guide:\n\n[https://scrumguides.org/](https://scrumguides.org/)\n\nREAD THE GUIDE.\n\nNothing about project management, nothing about people management.\n\nSomehow organisations invent more and more dysfunctional ways to re-define the role of a Scrum Master. \n\nAlso, what is missing from almost all Scrum Masters i know is actual product management knowledge. If anything, that should be the focus.\n\nReasoning:   \n\\#1 It is the job of the product owner to cover all project management aspects.   \n\\#2 the developers are responsible for \"Holding each other accountable as professionals.\"  \n\\#3 The people-focused work of Scrum Masters is very problematic; instead of playing the team nanny, maybe the role is to teach all team members how to handle their conflicts in a constructive way?\n\nAs most organisations are not agile and doing some broken version of a Frankenstein iterative process, it actually does not matter. There is usually no Scrum as organisations do not care for solving complex problems in iterative ways; almost all are just running very ineffective and inefficient feature factories. \n\nSo, if you ask me: the Role of the Scrum Master is in most organisations to manage a single metric: predictability of output. \n\n",
          "score": 2,
          "created_utc": "2026-02-09 06:13:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4e48my",
          "author": "cardboard-kansio",
          "text": "Funny, I've always seen it as Scrum framework management myself. [Like it literally states in the Scrum Guide](https://scrumguides.org/scrum-guide.html). Where it also mentions nothing about HR processes nor about projects. \n\nI wish it was mandatory for anybody invoking \"Scrum\" to actually read the guide first. It's like half a dozen sides of A4 and would basically reduce 90% of posts on this sub. Please stop trying to twist it into something it isn't.",
          "score": 2,
          "created_utc": "2026-02-09 06:23:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4pc8po",
          "author": "SamfromLucidSoftware",
          "text": "I’ve seen this swing based on what the org actually wants from Scrum. \n\nWhen the framework and accountabilities are misunderstood, the Scrum Master role often gets treated like a project coordinator, and expectations start to include forecasting, reporting, and governance on top of establishing Scrum. \n\nWhen product management is strong and the team is more mature, the Scrum Master can stay closer to coaching how the team works, supporting team dynamics, and helping the org move towards empiricism, without becoming the delivery router. \n\nHow the Product Owner shows up, and how leadership measures success, tends to be the biggest dependency driving which version of the role you get.",
          "score": 2,
          "created_utc": "2026-02-10 23:04:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4d4snv",
          "author": "swampex",
          "text": "People vía framework with a view of how the product is being managed. If needed, guido the productos manager",
          "score": 1,
          "created_utc": "2026-02-09 02:30:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4d9x3a",
          "author": "Scannerguy3000",
          "text": "Neither. The job is to have a complete mastery of the Scrum framework. Their job is not management. Neither the management of people or management of the process. They do have the responsibility for the outcomes of the team wherein they use the Scrum framework.",
          "score": 1,
          "created_utc": "2026-02-09 02:57:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4dcg9w",
          "author": "Extension-Orange-252",
          "text": "We renamed our scrum masters and yes, they are getting more into people instead of project management. I agree with those saying it is more like work relationship management.",
          "score": 1,
          "created_utc": "2026-02-09 03:10:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4err42",
          "author": "vcuriouskitty",
          "text": "Neither.\n\nOh I was about to answer with an explanation but OP deleted their account 💀 welp",
          "score": 1,
          "created_utc": "2026-02-09 10:07:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4jwhve",
          "author": "oneThing617",
          "text": "No managing: Product delivery and People leadership",
          "score": 1,
          "created_utc": "2026-02-10 03:18:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4szkg0",
          "author": "flundstrom2",
          "text": "Scrum master is people management; Managing the PO so s(he) don't throw in extra work mid-sprint, managing external stakeholders so they don't get used to asking team members for \"just a small thing\" instead of lining up in the POs priority queue. Nudging the team to help and teach each other instead of relying on \"that specific guy\".\n\nDelivery and cross-functional & project coordination is the responsibility of the PO.",
          "score": 1,
          "created_utc": "2026-02-11 14:34:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4e1x1y",
          "author": "LaughingLikeACrazy",
          "text": "Waste of money.",
          "score": 0,
          "created_utc": "2026-02-09 06:03:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4esp56",
          "author": "Prize_Conference9369",
          "text": "I still don't understand who's hiring scrum masters most teams are familiar with agile high level.\nMost companies are hiring projects managers who are well skilled with Scrum/Kannan and doing people management.\nIn fact we are delegating the ceremonies to the team members and the PM upskills ICs if the daily is too long or the retro is not producing action items.",
          "score": 0,
          "created_utc": "2026-02-09 10:17:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4evmcf",
              "author": "Future-Dance7629",
              "text": "I agree totally. Teams are so used to working agile they don't need another person to teach them the framework. Mature teams can run themselves.",
              "score": 0,
              "created_utc": "2026-02-09 10:45:13",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r0tcoj",
      "title": "Why ideas on digital whiteboards rarely translate into actual product designs",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1r0tcoj/why_ideas_on_digital_whiteboards_rarely_translate/",
      "author": "Careless_Passage8487",
      "created_utc": "2026-02-10 06:26:51",
      "score": 11,
      "num_comments": 11,
      "upvote_ratio": 0.82,
      "text": "We brainstorm a lot, sticky notes, mind maps, feature ideas, pain points, inspiration boards. Our digital whiteboard is packed.\n\nBut the problem is it’s a graveyard of ideas.\n\nNothing flows naturally from “thinking” into “design.” When it’s time to wireframe, I basically start over in another tool, manually rebuilding structure from scratch.\n\nSo the original thinking gets lost, decisions disappear and context fades.\n\nI want a workflow where brainstorming, organizing, mapping, wireframing, and prototyping are part of the same visual process not disconnected phases\n\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1r0tcoj/why_ideas_on_digital_whiteboards_rarely_translate/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o4kntql",
          "author": "Firm-Goose447",
          "text": "a trick i use is to treat the whiteboard as a “living map” rather than a final output. i organize ideas into clusters based on user flows, label decisions clearly, and then translate one cluster at a time into wireframes. it’s slower in the beginning, but at least you don’t lose all the original reasoning.",
          "score": 3,
          "created_utc": "2026-02-10 06:37:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4m69du",
              "author": "Deflagratio1",
              "text": "This right here. The problem is when people don't leverage the infinite space of the digital whiteboard. Yes it's not going to work well for everything, but that's when you post screenshots, use integrations, and ultimately link out to the more detailed tools. The whiteboard becomes your centralized source of truth and retains the brainstorming.",
              "score": 1,
              "created_utc": "2026-02-10 14:01:17",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4m9ml9",
          "author": "Kenny_Lush",
          "text": "Let me guess, you have a “solution” for sale?",
          "score": 3,
          "created_utc": "2026-02-10 14:19:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4kn6kc",
          "author": "Economy_Passenger296",
          "text": " what really helped was using miro as a single workspace for everything brainstorming, mapping, and early wireframes. instead of rebuilding from scratch, we could link sticky notes, mind maps, and rough screens in one visual canvas",
          "score": 5,
          "created_utc": "2026-02-10 06:32:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4mbicx",
          "author": "agileliecom",
          "text": "This isn't a tool problem. It's a decision problem. Whiteboards are great for divergent thinking. Getting everything out. But the step nobody wants to do is the convergent part — killing 80% of what's on the board and committing to the 20% that actually matters.   \n\nMost teams skip that step. So the whiteboard stays full of \"everything we thought of\" and nobody wants to be the one who says \"most of this isn't happening.\" So it just sits there. A graveyard, like you said.   The tool gap you're feeling is real but even if you had a perfect whiteboard-to-wireframe pipeline, you'd still need someone to decide what moves forward and what dies. That's the hard part. No tool solves that.   \n\nThat said, if you want less friction between thinking and building, Figjam → Figma is probably the closest thing to what you're describing. Same ecosystem, shared components, and you can drag structured elements directly from brainstorm to wireframe. Not perfect but way less context loss than switching between completely different tools.",
          "score": 2,
          "created_utc": "2026-02-10 14:29:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4kqi23",
          "author": "dennis_andrew131",
          "text": "This is real, digital whiteboards often fail not because they’re bad tools, but because they try to replace shared sensemaking with static artifacts.\n\nIn real design and discovery, the value isn’t the sticky notes, it’s the conversation, context, and negotiation that happens around them. Whiteboards capture outputs, not thought processes. Without real alignment on intent and shared mental models, the board becomes an empty container that feels like progress but doesn’t actually guide execution.\n\nWhat helps in practice:\n\n* Treat the board as a conversation starter, not the source of truth\n* Capture why decisions were made not just what was decided\n* Sync early and often with stakeholders before crystallizing ideas into tasks",
          "score": 5,
          "created_utc": "2026-02-10 07:01:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4kniwi",
          "author": "SpecialistAd7913",
          "text": " I’ve tried the same workflow in lucidchart not so happy with it, didnt handle well the prototypes and wireframing",
          "score": 1,
          "created_utc": "2026-02-10 06:35:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4l7ach",
          "author": "designtom",
          "text": "I use Multiverse Mapping for exactly what you describe.\n\nThe heart of the map is a simple behaviour tree: one person in the real world sees this then does this then sees this then does this, etc. The branches are: they don’t see this, they don’t do this, etc.\n\n(It’s a twist on a user story map with failure modes exposed.)\n\nUnderneath that tree, we stick technical ideas and to-dos. \n\nAbove the tree, we draft copy, then edit it into wireframes, then paste visual design variations, etc. so as you move up you get higher fidelity and more refined, but it’s all still connected to the core behaviour tree.\n\nI often test the raw copy before doing wireframes, test wireframes before polish, etc. — and often discover that the core behaviour tree needs updating or reordering. Depending on the scale of the change, we adjust what’s there or create a new tree.\n\nGive it a try!",
          "score": 1,
          "created_utc": "2026-02-10 09:42:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4nczjz",
          "author": "Consistent_Voice_732",
          "text": "Design starts when ambiguity narrows. Most whiteboards celebrate ambiguity but don't support the narrowing part",
          "score": 1,
          "created_utc": "2026-02-10 17:29:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4rex64",
          "author": "Agile_Syrup_4422",
          "text": "The fix isn’t another tool, it’s structure. After brainstorming, force decisions: what’s validated, what’s parked, what’s dead. Then immediately turn chosen ideas into actual tasks or specs. If it’s not owned and scheduled, it’s just decoration.",
          "score": 1,
          "created_utc": "2026-02-11 07:18:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4kq0pl",
          "author": "PhaseMatch",
          "text": "***\"I want a workflow where brainstorming, organizing, mapping, wireframing, and prototyping are part of the same visual process not disconnected phases\"***\n\nSounds like you are doing a lot of upfront analysis and design before you ever get any customer feedback, which is not the way I'd go.  Get's pretty \"heavy weight\" with a lot of sunk costs.\n\nProduct discovery is complex, so probe-sense-respond is the way to go.  And the best probe in an agile context is working, production grade software,  Not wireframes, or PoCs, or requirements, or any of that.\n\nMy go-to approaches tend to be: \n\n**- rapid lean canvas session,** so we are all on the same page on the problem being solved, why it matters, the benefits we want, how we'll measure them, key assumptions/risk and the user domain SMEs (or personas) we will be actively collaborating with when we work;  maybe 2 x 45 minute sessions, with a \"into backlog\" or \"rejected\" outcome\n\n**- user story mapping** with a couple of those SMEs, and the \"three amigo\": pattern;  record the session\n\n**- XP delivery;**  user domain SMEs embedded in and co-creating with the team, thin value slices, \"end-to-end\" skeleton first then add stuff by risk/value and get ultra fast feedback.\n\nIf the business is worried about investment risk then wrap Scrum round the outside, so you can make \"continue/stop/pivot\" decisions in a short cycle and invest one Sprint at a time, while delivering multiple increments per Sprint.\n\nWhich is all \"agile\" really ever was; make change cheap, easy fast and safe (no new defects) and get ultra-fast feedback on what is valuable. \n\nExercises like \"elephant carpaccio\" really bring this home for developers, as does the \"journey to work\" exercise in Jeff Patton's book on user story mapping\n\n[https://blog.crisp.se/2013/07/25/henrikkniberg/elephant-carpaccio-facilitation-guide](https://blog.crisp.se/2013/07/25/henrikkniberg/elephant-carpaccio-facilitation-guide) \n\n",
          "score": -1,
          "created_utc": "2026-02-10 06:56:57",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qzmppg",
      "title": "How many of you work for an organization doing scaled agile, or that formerly did scaled agile?",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1qzmppg/how_many_of_you_work_for_an_organization_doing/",
      "author": "attractiveblonde",
      "created_utc": "2026-02-08 22:19:03",
      "score": 10,
      "num_comments": 29,
      "upvote_ratio": 0.78,
      "text": "I’m working in corporate healthcare insurance, and my organization went to scaled agile a little over 2 years ago now, probably going on 3 years some time soon. As you can imagine, it seems (still) like somewhat of a cluster. My teams already have PI planning burnout, which we’re doing PI planning every 3-4ish months. \n\nMy question is what is your experience with it scaled agile, and does it get better any time soon? Or those of you whose organizations were formerly using SAFe, what is your organization using now? \n\nAny input would be great, because I’m hating life (currently a Scrum Master, formerly a Project Manager). ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1qzmppg/how_many_of_you_work_for_an_organization_doing/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o4byahx",
          "author": "BabyNuke",
          "text": "Scaled Agile is a theater production for management, and a money maker for Scaled Agile Inc. because people will pay for their training / renewal.",
          "score": 30,
          "created_utc": "2026-02-08 22:31:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4c1wpl",
          "author": "WanderingJuggler",
          "text": "One of my friends put it best. \"SAFe is a thing that consultants sell\".",
          "score": 15,
          "created_utc": "2026-02-08 22:51:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4cmfbl",
          "author": "Expensive-Clerk7878",
          "text": "SAFe is just layers of people managers with different titles.\n\n3 RTEs \n6 agile coaches\n24 scrum masters\n24 product owners\n4 person team doing the work\n\nEveryone is trying to make themselves feel like they contribute and harassing the 4 people being productive.\n\nIt does not get better, best thing to do is tune them all out and decline the endless meetings about velocity and spider charts that make no logical sense.\n\nGet your mates and try to enjoy, go for some beers after PI planning and laugh",
          "score": 13,
          "created_utc": "2026-02-09 00:49:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4bwg27",
          "author": "Efficient-County2382",
          "text": "Yes, they have dropped it now, it won't get any better",
          "score": 6,
          "created_utc": "2026-02-08 22:22:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4bwzs6",
              "author": "attractiveblonde",
              "text": "How is your org operating now?",
              "score": 3,
              "created_utc": "2026-02-08 22:25:01",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4cat9e",
                  "author": "Efficient-County2382",
                  "text": "More efficiently, overall I think it was just adding layers of ceremony that annoyed people",
                  "score": 4,
                  "created_utc": "2026-02-08 23:43:58",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4c2ai8",
          "author": "Megatwan",
          "text": "One of my clients is 1y in... About to drop them as it went from my small team delivering thing that work well planned in efficient way to my folks being kneecapped and forced to spend time teaching other teams/unskilled people what right looks like, what words mean, how things work, how to spell, etc..",
          "score": 6,
          "created_utc": "2026-02-08 22:54:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4chenr",
          "author": "ScrumViking",
          "text": "The first (and second) rule of scaling remains: don’t. That being said, in the last 10 years I’ve only worked 2 projects that had no scaled anything (nor needed to). Most of them scale(d) for the wrong reasons.",
          "score": 7,
          "created_utc": "2026-02-09 00:22:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4e3paw",
              "author": "IQueryVisiC",
              "text": "Scaling makes silos visible. Silos are the problem? But how do you make security silos go away? Surprise AWS bills prompted our org to force devs to go through a cloud silo .",
              "score": 1,
              "created_utc": "2026-02-09 06:18:29",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4czrqr",
          "author": "tintires",
          "text": "Not a fan. The only thing SaFE is predictably and reliably delivering is more certified practitioners.",
          "score": 6,
          "created_utc": "2026-02-09 02:04:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4dgll9",
          "author": "Due-Ingenuity704",
          "text": "Working in SAFe now, it's a soul crushing attempt to turn software development into a factory.  Basically a dog and pony show for insecure manangement.",
          "score": 5,
          "created_utc": "2026-02-09 03:33:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4cgt6q",
          "author": "swissmissys",
          "text": "I was in the same exact industry- same employer maybe lol?! Our area gave up on safe a few years ago because of the complaints with pi planning burnout. Went back to non scaled agile and just had everyone on the same cadence with no pi planning. Much better imo",
          "score": 4,
          "created_utc": "2026-02-09 00:18:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4e1fji",
          "author": "ya_rk",
          "text": "SAFe doesn't get better. I've workd in a SAFe environment that ended in a project scrap and mass firing. I know people who worked in other SAFe environments and talked witht hem extensively about their experience. Never heard about a good SAFe. \n\n  \nNot surprising, since other than the Scrum terminology it has nothing to do with Agile.",
          "score": 4,
          "created_utc": "2026-02-09 05:59:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ef52l",
          "author": "PhaseMatch",
          "text": "**TLDR;  I learned a lot doing SAFe, but mostly by accident and the actual transformation was a farce**\n\n90% of it is just other people's ideas about agile and lean you can get for free, in an expensive package. Access to that is good if someone else pays, and where I learned heaps.  \n  \nThe other 10% is PI Planning. \n\nIn theory there's nothing wrong with a lot of it (apart from PI Planning)  even the much-maligned ART is just the overly-loved Spotify model from 2012, with more boring names.\n\nBUT - \n\n**Big room planning is the classic \"extroverts torturing introverts\" bullshit with a lot of coercion.**  \n[https://www.reddit.com/r/AutismInWomen/comments/18hd1ml/pi\\_planning\\_is\\_a\\_very\\_special\\_sensory\\_hell/](https://www.reddit.com/r/AutismInWomen/comments/18hd1ml/pi_planning_is_a_very_special_sensory_hell/)  \n\nThey deep, quiet thinkers who can spot systemic problems are shut down, and they are exactly the people you want to have a voice in planning.  The glib, handwavy \"details don't matter' have the loudest voice.\n\nAnd is anyone after 2 days in a room really going to stand up in front of their whole ART and senior managers and call bullshit on the plan, knowing that means another day of planning?  Nope.\n\nSo feel your pain there, OP. \n\nAND -\n\n**There's always money for the \"leading SAFe\" certs for managers - which has the same impact as all classroom learning (zero) - but do the developers get XP training?  Nope.**\n\nThe ONE thing that could really shift an org is getting those XP/DevOps skills nailed down, but instead you get leaders collecting badges as CV points.  Silly.  You'd be better of hiring some good XP people and doing cheap modern leadership courses for everyone.  **(Done both.  Works great.)**\n\nPLUS - \n\n**Transformations don't work.  They really, really don't.**    \n  \nThey pick the low hanging fruit - restructure, new jobs, new events/meetings and it's out with Gant Charts, in with Scrum Boards. But - keep the power structures, control systems and narrative about utilisation, motivation, flow and work.\n\nWhen you only change half the cultural web, then you don't really get change.    \nEspecially when you don't do the difficult bits.\n\nSo mostly SAFe transformations are ugly, like you say.",
          "score": 4,
          "created_utc": "2026-02-09 08:02:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4c6zuj",
          "author": "Nodeal_reddit",
          "text": "We tried it, dropped it, shuffled around the org, and. now we’re doing it again. It won’t last.",
          "score": 3,
          "created_utc": "2026-02-08 23:21:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4c7bud",
              "author": "attractiveblonde",
              "text": "Oh, that’s so interesting that they came back to it. Ugh!",
              "score": 1,
              "created_utc": "2026-02-08 23:23:21",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4c6sfk",
          "author": "CleverNameThing",
          "text": "Try a lightweight, next-generation scaling option like Nexus or Large Scale Scrum.",
          "score": 2,
          "created_utc": "2026-02-08 23:20:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4c7i8n",
          "author": "LuckyKlobas",
          "text": "Hi. SPC of 6 years here. PI Plannings make sense if you have cross team dependencies or your business domain operates in market cycles / needs to manage deadlines. It also makes sense if you need stakeholders managed more closely and often, especially if you have multiple stakeholders fighting for priority of a single backlog. \n\nPI plannings are absolutely terrible if you plan in detail and plan individuals instead of a team (ergo not doing scrum in the first place). If you have a true scrum team, you can quickly plan stories, defined solely with \"description\", asking the team if it is a small enough vertical slice, and just breaking them into small batches. Monte carlo works great here too.  Don't spend time \"precising\" you estimates. Just make small, vertically sliced user stories.",
          "score": 4,
          "created_utc": "2026-02-08 23:24:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4cf32u",
              "author": "attractiveblonde",
              "text": "One of my teams is a product team, the other team I have is not part of a product (so we have no real PO - a team leader/manager is pseudo playing that role). My org also seems very immature with the PO role still - like they're still trying to figure out what it is, and what it means.\n\nAt PI planning, one of my teams gets so much unplanned operational work that it doesn't make sense for them to plan much \"committed/planned\" work at all. I'm talking like 70-80% of our workload is firewalls and dns requests that we have to react to. The other team also still gets unplanned work, but we are able to plan to some degree - though it seems like this particular team has lack of clear direction from leadership on what priorities are.\n\nI don't know. It just feels kind of messy to me. We are putting our own spin on SAFe, and then it just feels like we spend all this time at PI planning to never really actually go to plan. We have no product managers, just RTE's, PO's, SM's - who are struggling to feel their value, developers who feel unsure of their direciton or what they're supposed to be working on at times, etc.\n\nMaybe it's just me, but I miss the old project management world. Maybe not the part where we were purely waterfall, but the part where I felt more purpose.",
              "score": 1,
              "created_utc": "2026-02-09 00:09:05",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4efp8v",
                  "author": "PhaseMatch",
                  "text": "Go with Kanban. Ditch Scrum,  \nModel the unpanned work that you get statistically.\n\nWe did that in a SAFe shop and it worked well.  \nAnd it's in the SAFe book, so they can't say no lol\n\n\"We are putting our own spin on SAFe\"  \nCalvinball!  Yay!  ",
                  "score": 4,
                  "created_utc": "2026-02-09 08:08:10",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4c2sly",
          "author": "General-Belgrano",
          "text": "We are scaled agile and it is awesome!  It will not solve problems in your company, rather it gives you a framework to solve problems.  \n\nWe are several years into this now and I would not take another path.  We are getting better with every PI.  How can I say that? Because we have metrics from each PI going back 4 years on how many features were brought in, how many were accepted, and how many completed.  We can also see the business values assigned.  \n\nWe are now focusing on long term strategies like Epics and business cases.  The problems in most orgs are usually not engineering.  The problems are usually product team not aligning with the C suite.  ",
          "score": 2,
          "created_utc": "2026-02-08 22:56:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4e7iwe",
              "author": "konm123",
              "text": "While I am not explicitly practicing agile nor scaled agile, I am still lurking around in this sub as a systems engineer to see how things are managed across the organization. As a systems engineer, my job is to manage the risks associated with getting the interfaces correct. One kind I spend the most of my time with are external interfaces — how the product interfaces with end-users operations. Focusing on \"Epics and business cases\" is precisely that. This is where the value originates from and where all the problems with misalignment come. Never have I seen product not being built because technical staff did not know how to build it — regardless of management methods — it has always been about \"what to build\".",
              "score": 2,
              "created_utc": "2026-02-09 06:51:44",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4g7e58",
                  "author": "General-Belgrano",
                  "text": "Exactly!  The focus has shifted from \"Engineering is not delivering what we need\" to \"Product is not asking for what Leadership wants\".",
                  "score": 2,
                  "created_utc": "2026-02-09 15:51:19",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4cs8p9",
          "author": "BoBoBearDev",
          "text": "My org is using SAFe. I don't see how we can simplify it. I think we have like at least 25 agile teams. It is massive. There is just no way we can do it without some higher level management.",
          "score": 1,
          "created_utc": "2026-02-09 01:23:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4epm3p",
          "author": "vcuriouskitty",
          "text": "My project does Scaled Agile, and I’m an SM of one of our squads and initiatives. Been in SAFe for I think 3 years now. A lot of people haaaate it (understandably so) but it works well with our team. We have a release every sprint so we still get feedbacks from the stakeholders. Process is not flawless and has plenty of rooms for improvement but ultimately it doesn’t sacrifice the quality of our product. \n\nWe have:\n- 3 squads and 3 initiatives\n- 3 POs\n- 4 RMs\n- 4 SMs",
          "score": 1,
          "created_utc": "2026-02-09 09:46:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4faeop",
          "author": "acidw4sh",
          "text": "If a pop-up happened. The carefully constructed 3-month plan was immediately thrown out and never revisited again. \n\nPop-ups happened frequently. \n\nScaled agile is a waste of time and not agile. ",
          "score": 1,
          "created_utc": "2026-02-09 12:46:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4gixvt",
          "author": "MarkInMinnesota",
          "text": "In reality SAFe is for orgs that are just getting introduced to Agile practices and needs some structure to learn what works and what doesn’t. It shouldn’t be a long term practice.\n\nIn my org, after a year of using SAFe we moved on to a mix of Scrum and Kanban. I can’t overstate how much our engineers and team members hated SAFe because of all the time wasted on PI and sprint planning and other ceremonies. Also we sucked at estimating because everything we did was new, so none of the sprint or PI planning ever worked out as planned and we had a high rate of stories rolling over.\n\nOnce we moved to Kanban our productivity increased and delivery cadence doubled. For your org you really should consider moving on to something that values hands on keyboards and high priority work vs whatever SAFe is wasting your time on.",
          "score": 1,
          "created_utc": "2026-02-09 16:46:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ns8et",
          "author": "Internal-Alfalfa-829",
          "text": "Scaled Agile is agile in name only. Not much you can do about that at the corp level. Now as far as constantly making micro tweaks to help the teams at least handle it better burnout-wise: That is the core of your job now. And sometimes you appease the formal process requirements as a side gig.",
          "score": 1,
          "created_utc": "2026-02-10 18:38:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4pd2c9",
          "author": "easy-agile",
          "text": "The PI planning burnout is real. The problem usually isn't SAFe itself, it's that teams jump into the ceremonies without building the foundational practices first. Most organisations treat PI planning like a big project kickoff meeting instead of a collaborative planning session, which is exhausting for everyone involved.  \n  \nWhat typically helps is getting really disciplined about preparation work between PIs. Teams that succeed spend serious time on backlog refinement, dependency mapping, and having honest conversations about capacity before they walk into that room. The PI planning should be about alignment and commitment, not figuring out what you're actually building for the first time. When teams use Programs for the cross-team coordination between planning sessions, they tend to show up way more prepared and the actual planning becomes much more focused.  \n  \nAfter about 18 months, most organisations either figure out how to make SAFe work for them or they start scaling it back to something more manageable. The ones that stick with it usually end up customising it pretty heavily to fit their context rather than following the framework to the letter.",
          "score": 1,
          "created_utc": "2026-02-10 23:08:55",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qwjhlk",
      "title": "Agile is the right way?",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1qwjhlk/agile_is_the_right_way/",
      "author": "Famous_Blueberry_564",
      "created_utc": "2026-02-05 12:03:53",
      "score": 7,
      "num_comments": 59,
      "upvote_ratio": 0.74,
      "text": "Hey everyone,\n\nI’ve been thinking a lot about how to start a big new project the right way and wanted to throw this out here for discussion.\n\nI’m a senior software engineer working mostly with low-code platforms. In the past, I’ve been involved in several projects, smaller ones went fine, but the last two large ones (1–3 years long) went very bad. I joined both halfway through, mostly to help push them to production, so I couldn’t really influence the structure or process. Now I’ve just joined a new company that’s kicking off a major refactoring and some new features project (expected to last almost two years), and I really want to avoid the same pitfalls.\n\nI’m Italian, and honestly, i’ve always struggled with Agile. Too many rituals, too much overhead, not enough freedom. I used to think waterfall was better, but mostly because I didn’t really understand Agile deeply. So I spent time reading up on Scrum, Kanban, SAFe, XP, etc., and i’ve come to believe Agile makes more sense, especially with low code tools.\n\nBut here’s where I’m stuck: in my experience, Agile often means endless rework because requirements keep changing or were never properly analyzed at the start. Budgets are fixed here, timelines are tight, and we don’t have the luxury of endless iteration. On low-code platforms, even a small change can break multiple parts (data models, rules, UI, etc.), so frequent late changes are really costly.\n\nSo my question is: am I thinking about this wrong? Is there a way to truly apply Agile in this context, or should we invest much more upfront in detailed functional and technical analysis and get everything validated before development?\n\nWould love to hear from people who have faced similar constraints.\n\nThanks!",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1qwjhlk/agile_is_the_right_way/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o3pdeb7",
          "author": "[deleted]",
          "text": "[deleted]",
          "score": 10,
          "created_utc": "2026-02-05 12:16:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3pe62z",
              "author": "Think_Vehicle913",
              "text": "How do you manage dependencies (that you did not know about early in the cycle) that rely on old stories?  \nFor example:  \nStory A gets done (and tbf, is a mess)  \nStory B relies on Story A, but because it is a mess already, B is also a mess or it requires even more work due to technical debt\n\nSure, doing it properly would be helpful in the first place, but sometimes a future story might require stuff to change and without knowing how things should work together in the first place it quickly gets messy and exponentially more time consuming",
              "score": 3,
              "created_utc": "2026-02-05 12:21:54",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3pfnjr",
                  "author": "[deleted]",
                  "text": "[deleted]",
                  "score": 3,
                  "created_utc": "2026-02-05 12:32:17",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o3rq663",
                  "author": "PhaseMatch",
                  "text": "That's really where the XP stuff comes into play.\n\nGood user story mapping combined with actually doing the whole \"red green refactor\" and team owning quality makes all of the difference;  you sacrifice \"quick wins\" at the start for long-term sustainable delivery later.  \n\nIf that's not possible then the gradual slide back towards stage-gate delivery and upfront requirements  is inevitable;  the team needs all of that stuff written down to protect them from being held up as scapegoats, and the \"handling cost\" of the rework-and-signoff loops push you into bigger and bigger batches.  You wind up with \"Sprints as a project reporting cadence\" and half the work in twice the time.\n\nXP used to have \"user stories\" that were written on a 3x5 index card, and were a placeholder for a conversation with the \"on site customer\", an SME embedded in the team and collaborating with them daily.  The constraint of the hand-written card had a purpose - it forced small, simple user stories.\n\nAlistair Cockburn championed a lot of this stuff and his \"elephant carpaccio\" exercise is one that really gets into small slices and rapid change.   \n  \nIt's hard to break out of that cycle though.    \n  \nManagement doesn't feel safe if they think change is expensive, hard, slow and risky.   \nThat makes them control things more tightly.  \nSo they are less likely to allow devs to put the work in to make change cheap, easy, fast and safe. ",
                  "score": 3,
                  "created_utc": "2026-02-05 19:23:43",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o3pfrtk",
              "author": "IceCreamValley",
              "text": "Hello -  \nIm genuinely curious.\n\n*\" The number of requirements that have changed are very very few due to the rigor that we put in at the start of the project.\"*\n\nWhen do you do the requirements please? You said before the start of the project. Does it mean you do a requirements creation phase before implementation begin or you mean you wrote the requirements for a particular sprint, during the previous sprint?\n\nI'm assuming you running sprints like in scrum.\n\nThanks",
              "score": 3,
              "created_utc": "2026-02-05 12:33:06",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3pjz9c",
                  "author": "[deleted]",
                  "text": "[deleted]",
                  "score": 3,
                  "created_utc": "2026-02-05 13:00:43",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o3q0fyt",
              "author": "skepticCanary",
              "text": "And who pays for the extra work if and when the requirements change?",
              "score": 1,
              "created_utc": "2026-02-05 14:34:01",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3q1obx",
                  "author": "[deleted]",
                  "text": "[deleted]",
                  "score": 1,
                  "created_utc": "2026-02-05 14:40:26",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o3r8vrk",
              "author": "konm123",
              "text": "This resonates with me as one of the projects I am involved with is also hardware project. Most are however software or a mix.\n\nI like your usage of term \"flexibility\". Agile should enable you to be flexible about requirements which by nature are flexible or can not be derived reasonably. I have observed it is often used as an excuse to me flexible in laziness in figuring out what is needed and commit to that.",
              "score": 1,
              "created_utc": "2026-02-05 18:04:36",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3pg7ej",
          "author": "foofoo300",
          "text": "imagine you want to drive to spain from italy.  \nwaterfall is deciding which car, which route, when to make a pause, how fast to drive and then make a correct assumption when you will be there calculating for errors on how many traffic stops, accidents and pee breaks there will be.\n\nAgile is more like you drive, stop where you want to, make as many breaks as you like and make detours on your way, when your clients wants to go on a scenic route.  \nBut the destination and how many people, should be planned beforehand, no matter if you are doing agile or waterfall.\n\nForget about all the scrum dogma rituals, they are all crap anyway, but take away the flexibility to adapt quickly to change and ship fast, instead of planning month in advance and building a product that nobody wants or has changed in the meantime. Talk to people regularly instead of just at the beginning and at the end",
          "score": 5,
          "created_utc": "2026-02-05 12:36:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3q26l9",
              "author": "skepticCanary",
              "text": "But before trying to drive you try and do it on a skateboard ;)",
              "score": 2,
              "created_utc": "2026-02-05 14:43:03",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3twqzz",
                  "author": "davy_jones_locket",
                  "text": "I hated that analogy. Because if you're trying to make and sell a car, you're not gonna waste time with a skateboard to validate the idea",
                  "score": 2,
                  "created_utc": "2026-02-06 02:16:37",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o3pw3nu",
              "author": "frankcountry",
              "text": "This.\n\nTo paraphrase Eisenhower: plans are useless, but planning is indispensable.\n\nSet the vision, prepare end goal, the risk and such…but the bits in the middle is about setting a small goal, achieve it, reevaluate and set the next small goal.",
              "score": 1,
              "created_utc": "2026-02-05 14:10:39",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3pw50y",
          "author": "Bach4Ants",
          "text": "If you want to do these projects in an agile way, think of how you can incrementally deliver value via refactoring and new features rather than waiting years and delivering all at once.\n\nDefine your requirements in terms of outcomes (better performance, retention, etc.) and use prototyping to test your ideas before going all in on them.\n\nSwitch from a project to a product mindset and work in small batches.",
          "score": 2,
          "created_utc": "2026-02-05 14:10:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3q2z9s",
              "author": "skepticCanary",
              "text": "That only works if the customer also has an Agile mindset and is expecting small increments rather than getting their full product.",
              "score": 1,
              "created_utc": "2026-02-05 14:47:11",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3txpmo",
                  "author": "davy_jones_locket",
                  "text": "In my experience, customers love giving feedback before they get the full product. Delivering them functional features that they can interact and give feedback sooner is the entire point. ",
                  "score": 2,
                  "created_utc": "2026-02-06 02:22:19",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3se7gw",
          "author": "funbike",
          "text": ">  i’ve always struggled with Agile. Too many rituals, too much overhead, not enough freedom.  ...\n\nYou confused Agile with Scrum.  Agile is not a process, it's about behavior.  Scrum is a process, which is where your rituals came from.\n\nYou didn't mention the Agile Manifesto.  That's where it all started and many people get Agile wrong because they didn't read it, didn't try to understand it, or willfully ignore important parts of it (I'm looking at you SAFe).",
          "score": 2,
          "created_utc": "2026-02-05 21:18:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3w6smp",
              "author": "skepticCanary",
              "text": "The biggest pitfall I find is people take “We value responding to change over following a plan” to mean “Don’t plan”\n\nPlan! Failing to plan is planning to fail. But accommodate changing the plan if required. It’s not difficult!",
              "score": 1,
              "created_utc": "2026-02-06 12:55:33",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3xyrof",
                  "author": "funbike",
                  "text": "That's their fault, not Agile's.  The Agile Manifest meant to go ahead and follow a plan, but responding to change is a more important priority.  Start with a plan and be willing to change it.  All of the Agile values are written like that.  It's about prioritizing the first practice, not replacing the 2nd practice.\n\nI think we are saying the same thing, I just want to make sure.",
                  "score": 2,
                  "created_utc": "2026-02-06 18:15:43",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3prgss",
          "author": "EarlOfAwesom3",
          "text": "Agile does not prevent you from specifying or analyzing your requirements. Agility just means that - in contrast to waterfall - you can react quicker on changing requirements and direction, you include your stakeholders early and you always have shippable software. \n\nYour team can agree on what rituals to use. You could skip most of them if you decide that it's not worth it, because you should just use what you need. Its a framework, not a religion. \n\nIf analysis and requirements is a concern, I would choose an agile setup where a recurring technical refinement is done in the team where you spend more time on specifying tickets in detail together(!) before starting to work on them. A benefit of this is that the team is more aware of technical issues/potential roadblocks and that in return raises confidence in your solution and timeline. ",
          "score": 1,
          "created_utc": "2026-02-05 13:44:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3puvgv",
              "author": "DonDachi",
              "text": "Agree. Waterfall is mostly worse than agile, you dont see product untill it finished and if these was some miscalculation during the plannig (which often is a case) you can not change it early, that means that you would need to start everything all over, change more code compared what you would in case of agile and deliver late.",
              "score": 1,
              "created_utc": "2026-02-05 14:03:54",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3pxqev",
          "author": "skepticCanary",
          "text": "I’m still baffled as to how adopting Agile meant abandoning specs. This is how I love projects working:\n\n1. Write a functional spec. Get everyone including the customer to read it and sign it off.\n2. Get a dev to write a tech spec, based off the functional spec.\n3. Build and deliver it.\n\nIf the requirements change, change the spec and charge the customer.\n\nWhat’s wrong with that?",
          "score": 1,
          "created_utc": "2026-02-05 14:19:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3pzd0u",
              "author": "Famous_Blueberry_564",
              "text": "I definitely agree. I believe the problem I encountered was more related to the fault of project managers, who are often completely dominated by clients and the possibility of making them unhappy. In a calm initial phase (within the first few months of the project, when there are no pressing deadlines), they let everything slide, since they're relaxed and not thinking about the future. Then, in the final phase (with a lot of pressure and stringent deadlines), when the client is irritated by things not working, they accept every one of their dictates, for fear of starting a legal dispute.\n\nSo my question is, how do I, as a developer/tech leader, take charge of the situation and prevent this from happening? I'm wondering how I can best approach the initial, calmer part of the project, so as to build an effective analysis that doesn't trigger too many change requests in the future. In other words, how do I ensure that the work done in the initial phase is effective so as not to have a disastrous final phase.",
              "score": 2,
              "created_utc": "2026-02-05 14:28:14",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3pzz06",
                  "author": "skepticCanary",
                  "text": "It boils down to getting things written down. If you use a spec, you can have all the required contact details, all the project requirements, everything you need in one place.\n\nIf anyone says “That’s not Agile” you can reply with “I don’t care. It’s good.”\n\nIt’s great that people are questioning Agile. A lot of its practices are not based on evidence, and it has many hallmarks of a cult.",
                  "score": 1,
                  "created_utc": "2026-02-05 14:31:29",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o3q0u4f",
                  "author": "skepticCanary",
                  "text": "There’s also the issue of product managers (or “product owners”) deciding how everything should work. That’s a non-technical person making technical decisions, and that’s begging for trouble. With a spec that everyone signs off, the devs can see poor technical decisions and stop them before they’re implemented.",
                  "score": 1,
                  "created_utc": "2026-02-05 14:36:04",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o3w1ozg",
              "author": "Talidel",
              "text": "It's the wasted effort and over the top change control that causes the issues. \n\nThe reality is. \n\n1. The customer writes a requirements document, and say when they need the finished product.\n\n2. PMO writes the functional specification. Says yes to whatever dates are asked for.\n\n3a. The customer realises they've missed requirements. So add new requirements \n\n3b Developers write a technical specification based off the fuctional specification. Say the dates requested aren't possible.\n\n4a. an updated functional specification is sent to the developers\n\n4b. the technical spec says some things asked for aren't possible. So PMO goes back to the customer.\n\n4c. The customer decides they want to change some thing else. \n\n4d. the developers start building based on the current technical specification because they are already not going to make the agreed delivery date. \n\n5a. An updated functional specification is sent to the developers \n\n5b. an updated technical specification is produced invalidating some work already done. \n\n5c. A new delivery date is agreed based on the tech spec estimate from 3. \n\n5d the customer decides they want more changes based on what is possible. \n\n6a. The functional spec stops being updated, and just the tech spec is updated with new requirements \n\n6b, the developers change work already started again. \n\n6c the delivery date comes and goes and everything starts catching fire. \n\n7a requirements start being changed to reflect what is absolutely needed to get something to provide value out. \n\n7b it's discovered that the work done building it so far hasn't been on the most important parts because that wasn't established early on. \n\n7c the customer changes some requirements, the tech spec is no longer updated. \n\n8. Something goes live, with an over managed backlog of work that still needs doing on that product consisting of months worth of work. \n\n8b the delivery teams aren't given time to do that work and the next project begins.",
              "score": 2,
              "created_utc": "2026-02-06 12:21:47",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3w1x4i",
                  "author": "skepticCanary",
                  "text": "Specs are pointless if the customer can change them at any time without any consequences. Customers also need management.",
                  "score": 1,
                  "created_utc": "2026-02-06 12:23:22",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o3w2ljj",
                  "author": "skepticCanary",
                  "text": "And in your hypothetical example, can’t the same thing be said for user stories?",
                  "score": 1,
                  "created_utc": "2026-02-06 12:28:04",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3q22ny",
          "author": "No-Age-1044",
          "text": "Never, ever!",
          "score": 1,
          "created_utc": "2026-02-05 14:42:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3qvxoo",
          "author": "BoBoBearDev",
          "text": "I will use bathroom remodeling as example.\n\n\nAgile is.\n\n\n1) user wants bathroom remodeled.\n\n2) you only need a concept of a plan to start. \n\n3) user tells you, the scope, change bathtub, change tiles, change toilet, change basically everything\n\n4) you only need the layout to start the work, not everything\n\n5) user tell you the layout\n\n6) you start to remove all the old stuff\n\n7) you check mold, fix mold, check pipes, upgrade pipes, you water proof it\n\n8) now user tells you what kind of bathtub to use, you install it\n\n9) now user tell you what tiles to use, you install it.\n\nSo on and so forth.\n\nWaterfall is making every single decision upfront, all the way down in details like what type of decoration you want to put in the bathroom.\n\n\nAlso remember, agile is not a religion to follow all the ceremonies religiously. The goal of agile is just to deliver MVPs and improve later on.\n\n\nInteresting mention, Taipei 101 is actually kind of like this. They changed from 80 floors to 101 floors in the middle of the construction. Somehow you can just stack more of those boxes using existing foundation. Taipei has bridges with strong foundation and later adds a second line above it. It is upgradable post construction.\n\n\nMeaning, you want to plan your work to anticipate future changes.",
          "score": 1,
          "created_utc": "2026-02-05 17:04:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3t56gy",
              "author": "Famous_Blueberry_564",
              "text": "Your response was super clear, but I realize it differs a lot from my actual context:\n\nAt least for Italian projects, it just doesn't work that way.  \nI work with public administration, banks, insurance companies, etc., so the idea that the client at least has something usable from what we've delivered so far in Agile doesn't hold up. They would never use a prototype or partial software that doesn't cover their full workflow, either because it's senseless to abandon their current process for something incomplete (forcing them to use a bit of the old and a bit of the new), or because of regulations, GDPR, etc. For example, you can't push forward document processing without the digital signature part, which relies on a third-party service, because we couldn't integrate with that external service, which the client had only mentioned casually, but since we weren't supposed to implement it until later we didn't check exactly how the integration worked, and months later we realized it was impossible with our software.\n\nThe bathroom example fits perfectly:  \nContinuing the example, let's say the client gets to step 8 and then says they want a jacuzzi bathtub, but you explain it's impossible because the bathroom and pipes aren't set up for the tub they want (I'm making this up), and you tell them that after all the work you've already done, to install the tub you'd have to tear everything apart, redo all the pipes, etc., and it would cost three times more with an extra month of work. At that point what do you do, is it your fault for not digging deeper into what kind of tub they wanted, or theirs for not being ready for the budget increase based on their special requests?  \nItalian companies are more the second case, and that's where the penalties come in that they make you pay because you can't deliver exactly what you had agreed on with them.",
              "score": 1,
              "created_utc": "2026-02-05 23:35:47",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3tq29r",
                  "author": "BoBoBearDev",
                  "text": "That's why you need to do step4, the layout. That's where they say, hey, I want a jacuzz there. This is how I buy a home too, I look at layout. But if the layout sucks, it is unfixable. Don't like the kitchen? I can remodel it easy. As long as the layout is good, the change is manageable.\n\n\nAnyway, the workable software is misleading. You see my example, there is no useable bathroom each time you iterate.\n\n\nBtw, even the Agile guru sometimes don't know what they are talking about. Look up Zume Pizza, it was praised by one famous author and it got DOA. You need to test and collect feedback in a meaningful way, not like Zume Pizza.",
                  "score": 1,
                  "created_utc": "2026-02-06 01:36:42",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3qwidj",
          "author": "TomOwens",
          "text": "Your initial experiences with Agile - too many \"rituals\", overhead, lack of freedom - isn't Agile. And it sounds like you've learned about other frameworks and their perspectives on agility, rather than keeping with someone else's incorrect perceptions of agility.\n\nYour later experiences, such as the extensive rework isn't indicative of Agile either. Agility doesn't mean no up-front analysis and endless iteration.\n\nThe right approach is somewhere in the middle. Fixing a budget and a timeline is difficult, but it still gives you a flexible scope. The key is to do *just enough* up-front analysis and design and then quickly start building. You need to make sure you're pointed in the right direction, then iterate quickly to deliver the most value with the limited time and money you have, or fail fast and realize that your schedule and budget won't allow you to deliver sufficient value to make proceeding worthwhile.\n\nUnfortunately, there's no universal answer for how much up-front work is *just enough*. It's highly context sensitive. Some contexts are more tolerant of risks materializing than others. However, you also can't do *all* the analysis up front, since there's uncertainty about the completeness and correctness of any definition you have.",
          "score": 1,
          "created_utc": "2026-02-05 17:07:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3rmiku",
          "author": "PhaseMatch",
          "text": "**TLDR;  Agile approaches control business risk by minimizing sunk costs; they are less efficient, but you can stop a programme of work at any time and have minimal write offs.**\n\nAn \"upfront design\" project has the assumption that if you deliver to scope, on time and under budget, the business will obtain benefits that match the ROI required.  That ROI only starts to arrive after the project is completed.\n\nAgile approaches don't make that assumption.  You continually deliver, and continually measure the actual benefits obtained.  This is less efficient, but allows you to stop at any time you think the next lot of benefits are at risk, or the ROI has shifted.\n\nEffectively you are removing the whole sunk-cost fallacy.  In a conventional project when you have spent a lot and have failed to identify or manage key risks, then you are stuck with a choice to spend more (and reduce the ROI) or cancel and write off all costs.    That's often politically unacceptable, so you carry on.\n\nWith an agile approach **you can stop at any time, having obtained high value benefits, with zero sunk costs.**\n\nIn that sense agile approaches can't really fail, when well executed.\n\nWith Scrum, each Sprint offers the business a potential zero-cost off-ramp from the project.\n\nAgile approaches are less efficient at delivery than big-design-upfront, but enable much finer-grained control on risk.  That means you can drop a lot of the stage-gate-and-sign-off and formal risk management stuff which saves you time and money.\n\nThere's a couple of core requirements, however.\n\n**- change is cheap, easy, fast and safe (no new defects)**  \n**- you get fast feedback from users on the value that change created**\n\nThis is where XP and DevOps comes into play.  When it's not expensive, hard, slow or risky to make changes then the need to be 100% right first time, so detailed requirements are less important. XP took this to the extreme, with a sentence on a 3x5 index card, and a user domain SME collocated with the team and dynamically collaborating with them all the time - zero lag on feedback, and real CI/CD to an actual user they are sitting with.\n\nWith Scrum that looks like shipping multiple increments to (some) users within the Sprint and getting feedback on your progress to the Sprint Goal dynamically, so the stakeholders can choose whether to continue investing or to change direction.  Hence the idea that each Sprint is a small project in it's own right, and that the backlog is never completed, only abandoned when it doesn't offer a good ROI.\n\n**If you can't do those two things well, then you are better off with formal stage-gate project management.**",
          "score": 1,
          "created_utc": "2026-02-05 19:06:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3sevgy",
              "author": "Laicbeias",
              "text": "What i dont understand. Are you talking about software or are you talking about.. car manufacturing? Because in software you usually have a grand goal that you want to reach but you cant plan complexity till you execute it. \n\n\nThat means most of the time you need to focus on continuous expert based execution and decision making.\n\n\nIn software change is never easy fast and safe. And if you fail to deliver you fail hard no matter the method used, since its also not incremental. \n\n\nThe best software is written by experts that can execute not by people that plan it. Its like trying to plan how to write a book. If i type 10 pages a day ill have a book in 5 weeks. Which makes no sense",
              "score": 1,
              "created_utc": "2026-02-05 21:21:41",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3sphh9",
                  "author": "PhaseMatch",
                  "text": "I'm talking about business, and applying the same lean principles in the software business that W Edward Deming brough to Toyota.  Which is all agile (and lean) software development actually is. \n\nKnowledge work is not the same as manufacturing, but the wider concepts like systems thinking that Theory of Constraints still apply.\n\nWhat Deming pointed out to Toyota (among other things) was \n\n\\- test-and-rework loops are very expensive  \n\\- building quality in to the system is much cheaper  \n\\- until a thing is in use (ie sold or shipped) it has no value  \n\\- you need to continually improve your processes  \n\\- you need to do that leveraging data and controlled experiments  \n  \nHard disagree on making change cheap, easy, fast and safe though.  That's the build quality in part - you get into the defect prevention business, not the defect discovery business.   \n  \nThat was the whole point of the agile movement from about 2000 onwards, following all of the lessons learned by the dot-com bubble, as well as The Lean StartUp and all of that.  It was a developer led thing too.\n\nThe whole XP \"Planning Game\" focused on delivering an minimal end-to-end Spine, and then adding slices of value that you adapted based on feedback.  The other XP technical practices supported that rapid change, and if you found a new direction was more valuable you'd follow that.  \n  \nMy first software team came to me around 2009 or so and said they wanted to try out this agile thing;  took us about 4 or 5 years to defuse the legacy code base and big-ball of mud, even when we hired a really experienced XP guy.  Worked though.  \n\nTook a lot of painful lessons about that kind of \"big bang, big fail\" products and features on the way though.  And had to kill a few thing I really believed in as well.  Both are hard.  \n  \n\"If you build it they will come\" is essentially rubbish.  They won't.     \n  \n\"If you can't find a customer who will co-develop with you and chip in money don't do it\" is closer.\n\n",
                  "score": 1,
                  "created_utc": "2026-02-05 22:13:01",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o3t1qjj",
              "author": "Famous_Blueberry_564",
              "text": "When you talk about ROI being delivered incrementally in Agile, so you can stop if something isn't bringing value and avoid the sunk cost fallacy, which is definitely a huge issue in our field, that makes sense in theory. But at least for Italian projects, it doesn't really work that way. Clients only pay us at the end of the project, or maybe at specific milestones, not based on what we've delivered along the way. And even if they pay upfront, if we don't deliver exactly what's been agreed on, it goes to lawyers and penalties kick in.\n\nI work with public administration, banks, insurance companies, etc., so the idea that the client at least has something usable from Agile doesn't hold up. They would never use a prototype or partial software that doesn't cover their full workflow. It's just not practical to switch from their current process to something incomplete (forcing them to use a bit of the old and a bit of the new), plus there are regulations, GDPR, etc. For example, you can't push forward document processing without the digital signature part, which relies on a third-party service. We only got mentioned about that integration later on, since it wasn't supposed to be implemented until much later, so we didn't check how it actually worked. Months later we realized it was impossible with our software setup.\n\nThe \"sentence on a 3x5 index card\" approach is something we've tried in a few cases, but it was a total disaster. Unless that user domain SME has full decision-making power and basically signs off on every change with their own blood, this kind of process usually runs into complete disagreement from all the other business users who will actually use the app, leading to massive rework.\n\nSo that's my main hesitation, and maybe it's just a specific case where the methodology isn't fully adaptable, or needs serious tweaking. Could also be because of the super tight constraints of low-code platforms. Overall, my concern boils down to: if I'm building a skyscraper",
              "score": 1,
              "created_utc": "2026-02-05 23:16:35",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3td38g",
                  "author": "PhaseMatch",
                  "text": "You can make this work in a highly regulated domain and people do, but it's more complex.\n\nThe US Department of Defence's \"Authority to Operate\" is a heavyweight system with lots of sign offs, but there's some good stuff been done there.    \n  \nOne route is to have all the documentation embedded in the same repo as the code in markup language.  You then have two pipelines for deployment, one which routes the \"as built\" and change documents to the sign-off authorities, and one that deploys code.  Both have to run to deploy to production.  \n  \nBut you are spot on - that user domain SME has to have the authority to act;  actually \"Own\" the product unlike a lot of the \"backlog managers\" you get, which means they are making business decisions inside and with the team, next to the customer.\n\nThat's what I have right now - we have empowered POs from \"the business' embedded within the teams accountable for value and making those decisions.  And it's the business making the tough priority calls when they need to, based on how our money works.  It's frankly great.  The teams feel a lot less pressure and so on.\n\nBig culture shift.  Our CEO back in the mid 1990s executed on this kind of culture so we on the technical side all got business training, the the business folk.  So much doesn't need to be said when you do that, the payoff is HUGE.  \n  \nMostly the banks where I am are going all in on SAFe, with a sprinkling of team topologies and value streams.\n\nBut yeah how you do projects matters;  we're in the process of swapping to a more value-stream approach because now we don't have on-prem servers and use IAAS, PAAS, and SAAS the CAPEX-OPEX model of old is a bit broken. And how the money works really, really matters. \n\nAnd the skyscraper thing is spot on.  \n  \nIf you aren't able to work with easily extensible architecture and you are pouring foundations in concrete then you can't add a couple of extra floors later on in the process.\n\nDoes sound like you are better off with waterfall;  you can still look at things like Kanban to help you smooth the delays and kinks out of the delivery - often it's not the \"time on tools\" that matters, its the delays.   Good kanban and flow can shift delivery by \\~20% or so, and really help with triaging defects when you are in a white-water period.\n\nPart of the issue I have now (big DW swap out) is they built by architectural layers for efficiency rather than running a strangler fig pattern (to manage risk);  anything you can do to break the project down into smaller, high value components helps.  \n  \nTMFASD talked about \"a few weeks to a few months\" and that's valid. Keep each chunk under $1m and have value at the end helps;  Scrum shrinks this to a couple of weeks but that's often too small for big projects (but essential for R+D)   \n  \nDon't fast prototype though - have disposable POCs to derisk delivery technology timeboxed to a couple of days, and build everything else to production standard. \n\nNothing as horrible as a hacked together POC pushed to prod lol.\n\n\n\n",
                  "score": 1,
                  "created_utc": "2026-02-06 00:20:38",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o41xskm",
          "author": "AldronProjectLab",
          "text": "I don't think you're wrong. You're spotting the right thing.\n\nThe problem, in most cases, isn't Agile, but Agile applied ideologically and out of context. What you describe (endless rework, fluctuating requirements, ignored budgets and fixed timelines) isn't Agile working poorly: it's Agile used as an excuse for not making decisions.\nAgile doesn't mean:\n- requirements that are always open and never stabilized;\n- infinite iterations without constraints;\n- \"let's see what happens as we go\" on complex systems that are costly to modify.\nAgile works when it's clear what can and can't change, when there's a solid initial baseline (especially in data, architecture, and integrations), and when iterations serve to refine value, not rewrite the foundations.\n\nIn low-code, this is even more true: a \"small change\" is often systemic. Pretending that the cost of change is always low is simply false.\n\nThe path I see isn't Agile vs. Waterfall, but something much more pragmatic:\n- serious functional and technical analysis for everything structural (domain, data, integrations, constraints);\n- true Agile on features, flows, user experience, and business priorities;\n- a living backlog, yes, but governed, not anarchic;\n- timeboxes and budgets respected as real constraints, not as \"anti-Agile.\"\n\nIn short:\nAgile is the right path only if adapted to the real context.\nIf it becomes a religion that ignores complexity, costs, and accountability, then yes: it does more harm than Waterfall.\n\nYour final question is therefore spot on: investing better at the beginning is not anti-Agile. It is often the only way to make Agile sustainable in the medium to long term.",
          "score": 1,
          "created_utc": "2026-02-07 09:11:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o46ahhb",
          "author": "kexnyc",
          "text": "Agile is ONE way. Just like any other tool, it’s made for specific jobs. \n\nAlso, in my experience, way too many people apply the word “agile” to processes that clearly have nothing to do with it.  People take shortcuts, shoehorn in waterfall approaches, and perform their own “flavor” of agile none of which is agile, period. \n\nYour unfortunate experience with agile can almost certainly be traced back to failed processes that are blamed on agile. Agile isn’t broken. People don’t understand it, use it wrong, then blame the tool when they’re forced into expensive rework.",
          "score": 1,
          "created_utc": "2026-02-08 00:49:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o48eym6",
          "author": "happycat3124",
          "text": "I’m a customer based PO.  Been developing software as a customer business architect for 30 years. We used to start with a business problem.  We needed to make a business process more efficient.  We would identify the scope and objectives. We would identify pain points and opportunities for automation. We would visualize end state by documenting as is process flows and to be process flows. We would identify software projects as incremental deliverables to reach our end state process flow.  Then we would take a highest priority software project and determine detailed business requirements and functional requirements. We would then break these down further into story board type chunks and actionable batch functions. Like I need a process that calculates something or feeds or extracts something. Here is the data I need or here is the data I need to send and the format or here are the business rules for the calculation or here is the data I need to capture and the business rules to edit input or here is what I need displayed including derived fields and the business rules to derive etc.\n\nOften the business can’t use the product until the feed comes in, data is displayed or input, calculations are executed and outbound feed is built.  All is successfully tested ie qa in pieces, UAT in pieces and then full integration testing. Controls pass and financial integrity is ensured.  \n\nOur leadership does not understand any of the steps before build it now that we are agile.  I’m not sure they understood it before but they were not aware of that piece because when we were waterfall we just gave them the proposal to build the incremental process identified as an automation opportunity as a proposal and got permission/money to build it then told them a time frame ie 18-24 months for example.  Then we would spend 3 months of that time just defining requirements and business rules. It was really business flushing out the details. “My bathtub needs to be a jacuzzi”. \n\nNow that we are agile and they are more involved they don’t believe in investing in the analysis needed up front. They think they can skip the process analysis.  They skip to focusing on a specific business pain point and start solutioning tactically based on the existing business process and trying to automate that….\n\nexample…”I get reports and key them into excel and then do work and update excel with results.  The excel is too big and not well controlled. So I need a tool I can up load excel reports to then key additinal data I research and actions I took to manually research additional stuff or decisions I have made.  I want an access database”. They get told access is not a tool we use.  They say ok… something like access then. \n\nNow they want to hand that idea “as is” to an agile team and start creating the thing immediately. But in my role I’m supposed to write the epic and tell the team what we want if this project makes the priority list for the next Product increment in six weeks.  I won’t know until a few days before. And then the team will struggle because refinement and analysis is also not understood as necessary so those hours are not billable. I’m expected to keep this team working at capacity where capacity at 5 hours per day per Dev and QA resource cannot include analysis. \n\nIt’s slowly devolved into this situation as the leaders used to just ignore the process analysis and incremental opportunity analysis.  They were unaware of the detailed business rule identification and functional requirements identification phase. And they eliminated the technical expert design roles ie hands on design architecture people who we partnered with during that phase to share the business rules and functional with to collaborate to develop a design roadmap before the build. \n\nBusiness leaders think all that needs to happen is for them to prioritize a high level solution and them the team builds in agile increments that should result in a new tool in 3 months or less.  They are in the stage of customer maturity where they think everything is an easy to build as it is for them to say what they want. Ie just upload the spreadsheet and create a menu screen for us to type into.  We will want reports from the data.  Shouid take 3 months. It’s easy.  \n\nI’m thinking where does the data in the report come from?  Is there data you key or with you had that you don’t get sent in the report. What is the business purpose or process this supports. Can we get this data fed to us vs uploading reports. Can we match it up using keys to other systems to retrieve any missing data etc etc. im a business architect being asked to admin the team building a solution.  \n\nThis is a perfect example to me as to why agile fails all the time. If we did all the missing pieces, the build could be agile. Ie bring in data, show it, capture data via matching, show it, etc etc. that is the agile delivery and it can be done in small increments. And it can be adjusted as demoed. Etc. \n\nBut the “we don’t need requirements” and “people over process” is being used to eliminate all the investment needed to identify and break the work down.  All that  is missing. And when I say we need all that not only do people not understand why we need it to build but also don’t think we need it to maintain.  But I constantly look back at past functional requirements to remember the business rules of what is in production to answer questions and to request enhancements. \n\nHow did agile, which is a great tool for transparent software development, get implemented in such a way as to kill the rest of the process that I don’t think it was ever intended to eliminate?",
          "score": 1,
          "created_utc": "2026-02-08 10:46:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4fp2gg",
          "author": "WaylundLG",
          "text": "Two things generally create rework: gold plating (continuing to work on a feature until it's perfect instead of accepting it at the good level) and rigid architectures (where every change in requirements leads to a complete redesign). It sounds like you are pretty experienced in software development, so you are probably more familiar with how to avoid the second. The first one you tackle with strong product ownership. Have a product owner who is good at saying \"that looks good, let's more on to the next thing\". The trick is that they need to be able to say it to both the team and stakeholders.\n\nScrum, XP, and most of the other frameworks are very flexible in what work gets done, which is needed in complex product development. But that means you need to have someone who can make the tradeoff decisions on where to focus.\n\nYou may also find that doing exercises like user story mapping or even just high-level user journey sketches early on give you a big-pucture view to work with to make those tradeoff conversations clearer.",
          "score": 1,
          "created_utc": "2026-02-09 14:15:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4v60lh",
          "author": "Big_Friend587",
          "text": "What I've found makes a huge difference is having an involved (and I say involved because many arent) software or technical architect. It makes the the project SO much better. Dont get me wrong, perfect projects dont exist as we all know, but i really dont ever want a project again without an architect lol",
          "score": 1,
          "created_utc": "2026-02-11 20:47:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3rs35w",
          "author": "dave-rooney-ca",
          "text": "I've been coding since 1981, professionally since 1988. My interest in \"how\" we build software started in the mid-90s. I was among the early (and successful) adopters of XP.\n\nAll the experience I've gathered over those years has taught me that there are just two fundamental \"steps\" to successfully deliver software systems.\n\n1. Ship something\n2. Reflect\n\nI find it interesting that working with LLMs has only reinforced the idea that you will never be able to create the perfect requirements document. Therefore, build something, preferable small, get it into the hands of the intended consumers of the work, and get their feedback.\n\nReflect is intended for the people/organization to look at what they did in the first step and seek out improvements. Retrospectives are one way of doing that, but there are many more. Regardless, if you don't honestly look at how to improve you work together, then step 1 will become more difficult over time.\n\nNow, HOW you accomplish steps 1 and 2 are going to depend wildly on your circumstances, or, dare I say it, *context*! The context for a small startup trying to establish a market for its web-based application is much different from that of an established telecom company writing phone switch software that handles 911 calls.\n\nAny \"canned\" process is going to have difficulty with this, even my beloved XP! For example, I was a strong believer in co-located teams until the COVID pandemic proved that in many cases we can be nearly as productive while remote (and with lower stress due to commuting). This is why I grew to love what Lean can teach us about observation and systems thinking on top of rote application of a process.\n\nSo, all that to answer that the only right way is to try something and reflect honestly on it. Did what your tried bring value? Did it improve morale? Did it improve lead & cycle times? Did it improve quality? Based on the answers to questions like those, adjust how you work then ask the questions again when you have new data.",
          "score": 1,
          "created_utc": "2026-02-05 19:32:46",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qxd5ud",
      "title": "What usually breaks first when your workload increases communication, tracking, or decision-making?",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1qxd5ud/what_usually_breaks_first_when_your_workload/",
      "author": "Intelligent_Crew_470",
      "created_utc": "2026-02-06 09:31:19",
      "score": 3,
      "num_comments": 11,
      "upvote_ratio": 0.81,
      "text": "",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1qxd5ud/what_usually_breaks_first_when_your_workload/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o3vijeu",
          "author": "Aromatic-Proof-5251",
          "text": "My spirit is broken",
          "score": 8,
          "created_utc": "2026-02-06 09:40:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3w9opq",
              "author": "Kenny_Lush",
              "text": "Especially seeing another ad for something no one wants or needs, disguised as a post.",
              "score": 2,
              "created_utc": "2026-02-06 13:13:11",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3vpal6",
          "author": "cosmopoof",
          "text": "Nothing breaks, except for unrealistic expectations. I prioritise accordingly and never compromise on my work quality - so if I need to do something new with high priority, I get rid of something else that has less priority.",
          "score": 6,
          "created_utc": "2026-02-06 10:42:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3xiwgu",
          "author": "[deleted]",
          "text": "Tracking breaks first, which then kills decision-making.\n\nWhen I was managing multiple deals in investment banking, I hit a wall around 5-6 simultaneous transactions. Below that, I could keep it in my head. Above that, stuff started falling through cracks, missed follow-ups, couldn't answer \"what's urgent right now?\" without reconstructing everything.\n\nDecision-making suffers because you can't prioritize what you can't see. Communication stays fine because people just ping you directly. But without tracking, you're purely reactive.\n\nWhat size workload are you handling?",
          "score": 3,
          "created_utc": "2026-02-06 16:59:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3vr1sw",
          "author": "Fr4nku5",
          "text": "do you mean \"what do you notice breaking first\" ? ",
          "score": 1,
          "created_utc": "2026-02-06 10:58:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3wmckv",
          "author": "imagebiot",
          "text": "Decision making.\n\nPeople start to take the easy way or, or the not my problem route, or the “this isn’t important” route.\n\nI’ve found decisions that aren’t made under duress lead to improved long term outcomes.",
          "score": 1,
          "created_utc": "2026-02-06 14:22:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3wy95k",
          "author": "broc_ariums",
          "text": "You do capacity planning for a reason. You can only do what you can do. So if something higher priority comes in it's either in the backlog for a later sprint or, if there's time, something moves out to accommodate for it.",
          "score": 1,
          "created_utc": "2026-02-06 15:22:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o403vtt",
          "author": "PhaseMatch",
          "text": "Bit of a false dichotomy.\n\nWhen more work comes in, you prioritise, and tell people what won't get done.  \nWhen you feel overloaded, you work as a team and support each other.\n\n**The main thing is not to have a knee-jerk reaction to every notification, request, message and so on.**\n\nIf you are in a leadership role, have a personal Kanban board (MS Teams Planner is pretty good) and apply good lean principles.  Triage work, prioritise and limit WIP.  Create focus time.  \n  \nYou should also be working your teams through the selling-telling-coaching-delegating arc, and getting to the point where they can make decisions.  You remain accountable, but they are responsible. Support their decisions when you do this. \n\nIf there's \"heavy lifting\" work to do then turn off notifications, and use the \"Pomodoro Technique\" to allow for the brain's recharge cycles.  Use those breaks to self-interrupt and check for urgent work.  \n  \nGloria Mark's stuff is good on this - she does research on fragmented work, context switching and what happens when people work on multiple projects.   The TLDR is you'll get more stress, more errors and less work done.   \n\n\n\n",
          "score": 1,
          "created_utc": "2026-02-07 00:54:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o44gvug",
          "author": "3sc2002",
          "text": "Communication, then tracking.",
          "score": 1,
          "created_utc": "2026-02-07 18:45:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4a9q92",
          "author": "Firerage65",
          "text": "I don't think its about something breaking if you've built up a good process around it. It just means priority changes and you'll come back to the less important stuff later. That's my experience at least. I can't afford to have things break when things get tough or else I'd be outta work lol ",
          "score": 1,
          "created_utc": "2026-02-08 17:35:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4bbf3i",
          "author": "AldronProjectLab",
          "text": "For me, decisions almost always break down, but in a subtle way.\n\nWhen the workload increases, I continue to communicate and monitor, sometimes even too much. I keep everyone informed, I track the numbers, I participate in calls. What begins to disappear is the mental space to truly choose. Decisions become reactive, postponed, or made out of inertia, not priority.\n\nThe sign I've learned to recognize is this: when I spend more time \"keeping everything under control\" than asking myself what's no longer worth deciding or pursuing, I'm already over the edge.\n\nCommunication and monitoring can hold up under stress for a long time. The quality of decisions cannot. And it's almost always the last thing people notice.",
          "score": 1,
          "created_utc": "2026-02-08 20:36:20",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qy1ypx",
      "title": "(Meta) r/agile Troll",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1qy1ypx/meta_ragile_troll/",
      "author": "astroblaccc",
      "created_utc": "2026-02-07 02:43:10",
      "score": 3,
      "num_comments": 21,
      "upvote_ratio": 0.57,
      "text": "Please remove if inappropriate...\n\nIs it me or is there a troll in here and other places like r/scrum?\n\nNot complaining, just checking my sanity.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1qy1ypx/meta_ragile_troll/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o41z0d7",
          "author": "AlanOix",
          "text": "As a dev, I can see why other devs hate Agile and love to shit on it on reddit, because it has been twisted into pointless rituals, wasted time and a lot of unnecessary stress by a lot of companies.\n\nI have never seen a project fully apply agile principles, but I can see that the more agility we get the better it is. \n\nScrum fucking sucks and deserves every bit of hate it gets.",
          "score": 10,
          "created_utc": "2026-02-07 09:23:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o43hbs5",
              "author": "WaylundLG",
              "text": "Well, that's an articulate opinion. I don't know why everyone doesn't just put you in charge, lol",
              "score": -2,
              "created_utc": "2026-02-07 15:50:10",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o40x8xi",
          "author": "DingBat99999",
          "text": "No, the agile related subs are definitely being trolled. \n\nBut the real problem is the troll posts contain a grain of truth. ",
          "score": 7,
          "created_utc": "2026-02-07 03:59:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o41e80k",
              "author": "Fun_Apartment631",
              "text": "🤣",
              "score": 1,
              "created_utc": "2026-02-07 06:08:54",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o42baxf",
          "author": "NobodysFavorite",
          "text": "You don't have to look on reddit to come across agile trolling. You don't even have to look online.",
          "score": 4,
          "created_utc": "2026-02-07 11:23:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o424qh3",
          "author": "ocnarf",
          "text": "Difficult to answer without examples. On reddit everybody has her/his own definition of \"spam\", \"troll\" or \"bot\".",
          "score": 3,
          "created_utc": "2026-02-07 10:20:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o416ugp",
          "author": "KronktheKronk",
          "text": "This sub keeps coming across my main page despite not being subbed, and I throw my opinion in threads when I see them.\n\nI'm not much of a fan of the catechism of scrum, so I can understand if people aren't a big fan of my opinion here.",
          "score": 2,
          "created_utc": "2026-02-07 05:09:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o41ewxv",
              "author": "WaylundLG",
              "text": "You weren't the on my list of trolls. ::shrug::",
              "score": 2,
              "created_utc": "2026-02-07 06:14:50",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o41mqwq",
                  "author": "cardboard-kansio",
                  "text": "I'm wondering what counts as a \"troll\" these days. I definitely give wholehearted advice but with a sometimes sarcastic edge.",
                  "score": 1,
                  "created_utc": "2026-02-07 07:25:30",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o41ub7p",
          "author": "No-Age-1044",
          "text": "Saying Agile is a bad methodology is not trolling, it is called ‘experience’.",
          "score": 2,
          "created_utc": "2026-02-07 08:37:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o43191s",
              "author": "astroblaccc",
              "text": "Yeah, agreed. Lots of bad actors out there. That's not what I'm talking about. I find a lot of posts that seem to be written by people with zero tech experience, regurgitating formulaic scenarios which seem entirely contrived.",
              "score": 1,
              "created_utc": "2026-02-07 14:25:59",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o43jqfp",
              "author": "WaylundLG",
              "text": "Completely true. It's also wrong, but understandably so. I do wish that people with those experiences wpuld engage with a bit more curiosity, but on the other hand, people need to respond to that curiosity with a bit more humility\n\n99% of the \"agile/scrum is bad\" just has nothing to do with that topic. It's a bit like going to a crappy gym and deciding exercise is bad. I get it, that was your experience and that gym clearly sucked, but if you then decide all the info about exercise is clearly wrong and it's just a big conspiracy to open gyms, that's a bit on you.",
              "score": 1,
              "created_utc": "2026-02-07 16:01:54",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o41sc22",
          "author": "jbigspin421",
          "text": "Some lazy developer got canned and called out for not producing, so now he is trolling scrum masters who busted him. Happens after every layoff wave. They have to blame somebody.",
          "score": 2,
          "created_utc": "2026-02-07 08:18:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o42oppo",
          "author": "cliffberg",
          "text": "Is a troll someone who merely states opinions that are contrary to standard Agile narratives? Or is a troll who insults or says unsubstantiated and emotion-laden things merely to get attention?",
          "score": 1,
          "created_utc": "2026-02-07 13:10:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o42z8k9",
              "author": "astroblaccc",
              "text": "I don't know what standard agile narratives (maybe the manifesto?) are and I don't want to know. And I think trolling encompasses more than saying unsubstantiated and emotion-laden things to get attention, although I do agree with assessing that behavior as trolling.",
              "score": 3,
              "created_utc": "2026-02-07 14:14:30",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o43hjp0",
              "author": "WaylundLG",
              "text": "It's definitely the second, though there is a mix of both. The first should stick around, the second is an unfortunate side effect of the internet.",
              "score": 2,
              "created_utc": "2026-02-07 15:51:15",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o41inz2",
          "author": "takethecann0lis",
          "text": "What types of topics are you seeing as troll behavior?",
          "score": 1,
          "created_utc": "2026-02-07 06:48:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o430n98",
              "author": "astroblaccc",
              "text": "It's not related to topics so much as the formula people use to talk about \"agile and scrum\". I come across anecdotes which seem contrived by people who have never worked in tech and don't seem grounded in reality.",
              "score": 2,
              "created_utc": "2026-02-07 14:22:33",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o44f6ff",
          "author": "skepticCanary",
          "text": "I’m highly critical of Agile because my working experiences it have been terrible. I consider myself an Agile heretic. I hang out here because I want to be proven wrong.\n\nI don’t post in r/scrum though.\n\nHaving said that, I can see AI making project management obsolete.",
          "score": 0,
          "created_utc": "2026-02-07 18:36:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o46qbnp",
          "author": "Ezl",
          "text": "Can you give a specific example of what you’ve seen that you consider “trolling”? I see a surprising number people who dislike and/or don’t understand agile but I don’t consider them trolls, I just disagree with them.",
          "score": 0,
          "created_utc": "2026-02-08 02:29:03",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}