{
  "metadata": {
    "last_updated": "2026-02-27 03:04:00",
    "time_filter": "week",
    "subreddit": "agile",
    "total_items": 9,
    "total_comments": 119,
    "file_size_bytes": 175274
  },
  "items": [
    {
      "id": "1rcuzup",
      "title": "My company doesn’t believe in scaling Scrum and neither do I",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1rcuzup/my_company_doesnt_believe_in_scaling_scrum_and/",
      "author": "morsofer",
      "created_utc": "2026-02-23 21:45:32",
      "score": 33,
      "num_comments": 42,
      "upvote_ratio": 0.9,
      "text": "Some time ago I [posted ](https://www.reddit.com/r/agile/comments/1r0gtw3/10_years_of_agile_transformation_buried_in_6/)about how my company abandoned Scrum after 10 years of practicing it and is slowly falling back toward waterfall. Yesterday I had a chance to speak with my CTO and ask about the recent changes.\n\nTL;DR of what he told me.\n\nThe board has very ambitious goals for the upcoming years. We’re talking 'becoming a market leader' level ambition. To achieve that, they can't rely on small, incremental growth and instead need what he called a strategic leap on multiple levels.\n\nAccording to the CTO, each such leap requires 5-10 teams working together on a single product, and the company wants to execute several of these leaps simultaneously (for context IT alone has around 2000 employees).\n\nMy boss added that, in his opinion, Scrum simply doesn’t scale in this way. A single Product Owner wouldn’t be able to handle such project, so they felt the need to introduce several new roles - product managers, area product owners, analysts, etc. Hence the idea of 'improving' the agile model in ways that move us closer to a top-down planned waterfall.\n\nI have to admit, I somewhat understand his thinking. As an IT team leader, I don’t have great experiences with scaling Scrum and the literature seems divided on the topic.\n\nI’m curious about your experiences. Have you ever worked with multiple teams on a single product? Did you have to change the organizational structure, or were you able to split the system architecture in a way that minimized dependencies? Did adding more teams actually speed things up?\n\nLet me know what practices you would repeat and which ones ended up dragging the project down.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1rcuzup/my_company_doesnt_believe_in_scaling_scrum_and/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o710lj4",
          "author": "BoBoBearDev",
          "text": "Can you describe the difference between SAFe and the one your CTO described?",
          "score": 39,
          "created_utc": "2026-02-23 21:51:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o71n7v7",
              "author": "maizerage25",
              "text": "You invented SAFe - congrats",
              "score": 14,
              "created_utc": "2026-02-23 23:51:17",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o720ea1",
              "author": "MyLittlePoneh",
              "text": "But at the end of the day SAFe is just waterfall with extra steps isn’t it?",
              "score": 6,
              "created_utc": "2026-02-24 01:04:51",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o72d5o7",
                  "author": "BoBoBearDev",
                  "text": "Not really. I worked in waterfall before, especially when it was lead by system engineering. The design and AC phase is insane. If you tell developers to read it, they want to gouge out there eyes (at least for me). \n\n\nPeople don't know the extent of waterfall. In the waterfall culture, I once consulted with a team as outsider to propose a feature. I described the deficiency of the existing system and proposed a solution. They spent the entire year having 3 different developers refining the proposal I made, which I can actually complete the change in 2 months at latest. Let's just assume, maybe my proposal wasn't good enough, but none of their developer is able to create a new documents that pass the bar either. So, clearly it aint my problem. I don't know they finally implemented it or not, but they spent entire year to refine the proposal document for something I can do it in 2 months myself. It is that exhausting.\n\n\nSAFe basically only needs to come up with a concept of the plan. They described the problem they want to solve. They have a UX markup if there is UX. They handed down to the scrum teams. They don't spent a while damn year trying to refine a proposed capacity.\n\n\nIt can still run into lack of explicit ACs like scrum. But typically there is quite a lot of trust on the teams to do their work without so much information on everything.",
                  "score": 7,
                  "created_utc": "2026-02-24 02:18:59",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o76ka1s",
                  "author": "ninjaluvr",
                  "text": "Not at all.",
                  "score": 1,
                  "created_utc": "2026-02-24 18:32:18",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o715a6h",
              "author": "General-Belgrano",
              "text": "Bingo",
              "score": 3,
              "created_utc": "2026-02-23 22:14:31",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o713eyy",
          "author": "LightPhotographer",
          "text": "You don't need Agile if you know exactly what you are going to build.\n\nThis is a trap - because software is so versatile, the world changes quickly and users get new ideas when they see your software, you can not know what they need.  \nExample: Does anyone use more than 30% of the features of Microsoft Word?\n\nYou boss thinks he knows what he wants you to build.  \nWe (the software developers) worked with that 30 years ago, with contracts signed with blood and special Exception Procedures, only to be invoked in instances of Dire Need.  \nWhat happened:  \nNeeds were analyzed wrong, misunderstood, poorly written down in specifications that left room for interpretation... and meanwhile the world and our insights changed and we wanted to bolt on changes all the time.  \nThe signature in blood turned out to be pink ink which smelled of strawberries and evaporated when exposed to air or sunlight.\n\nAnd 30 years we said 'we know all the mistakes of the past, that won't happen to us!'\n\nYeah.  \nGood luck with that.  \nAgile wasn't invented because some people wanted new job titles. We don't do it for its own sake. We do it because software is inherently not plannable. Agile is a set of practices that have been proven to deal with it.",
          "score": 25,
          "created_utc": "2026-02-23 22:05:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o74m47x",
              "author": "Hot_Preparation1660",
              "text": "Software is about as plannable as repaving an airport tarmac or replacing a roof of a historic building.\n\nGenerally, for any significant project, estimates are usually about 20% over budget.\n\nMIT OCW has a whole course on the topic of why estimates suck:\n\nhttps://learn.mit.edu/c/topic/electrical-engineering?resource=6744\n\nSoftware estimates are not special. All estimates are terrible. \n\nWhat’s special about software is the ability to deliver incremental value and gather stakeholder feedback more frequently, the relative ease of making design changes in the middle of a project, and the simple reality that we are never building the exact same thing twice, because unlike asphalt, software can be copied.\n",
              "score": 3,
              "created_utc": "2026-02-24 12:53:08",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o74sy6e",
                  "author": "LightPhotographer",
                  "text": "No. \n\nAirport tarmac is a complicated problem: there are different components that depend on each other. But you can analyze, plan and predict them in advance.   \nSoftware is of the same order *if you know exactly what it is you will build*.  \n\nThis is where things go wrong most of the time. We *think* we know what we want to build.  \nBut the act of building it changes the world in a way we could not analyze in advance.   \nIt is a *complex* problem, meaning no amount of analysis will give you a 100% solution. That's because solving the problem changes the problem.    \nWonderful example was when the British in India put a bounty on poisonous snake, in an attempt to get rid of them. What happened: Clever Indians started breeding snakes. The attempt to solve the problem changed the problem. The British, not being stupid, abandoned the bounty. Then all the breeders ... dumped all their snakes.   Trying to solve it changed the problem.  \nIt can not be pre-analyzed, although it can be explained afterwards.\n\nComplex is not another word for complicated. It's fundamentally different and requires a different approach.\n\nThis is from the Cynefin framework.",
                  "score": 2,
                  "created_utc": "2026-02-24 13:33:43",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o7elooy",
              "author": "James-the-greatest",
              "text": "Absolutely could not disagree more. ",
              "score": 1,
              "created_utc": "2026-02-25 21:54:30",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o731p5u",
          "author": "ScrumViking",
          "text": "A product owner can’t handle it, yet a CEO can run an entire company using a vision, a mission and a strategy? All you need is a roadmap and you’ve got a perfectly good start to a scaled agile organization. \n\nIt’s not hard in theory but People make it hard in practice. Giving a clear purpose or goal and allowing professionals to do the right thing. Inherently the problem is trust, lack of direction and 120 years of Taylorism that still guides the hands of most people. \n\nAll this tells me that the company lacked the vision how to make it work or the courage to properly execute it.",
          "score": 8,
          "created_utc": "2026-02-24 04:54:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o70zqel",
          "author": "CleverNameThing",
          "text": "I would start as lightweight as possible and just do a scrum of scrums among the 10 or so teams. And if that's not enough, set up a Nexus integration team for escalation of integration challenges that the scrum of scrums can't handle. That's about all the scaling you would probably need for 10 teams.",
          "score": 5,
          "created_utc": "2026-02-23 21:47:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o715b6x",
              "author": "rwilcox",
              "text": "This is the way. 10 teams isn’t _that_ many: yes it’s pushing Dunbar’s number but scrum of scrum’s with the scrum masters, PO, and reps from the architecture and/or Nexus dev teams should be able to handle this without going too process heavy.",
              "score": 6,
              "created_utc": "2026-02-23 22:14:40",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o732wyi",
          "author": "SeaworthinessPast896",
          "text": "Here's the biggest problem about asking this question.\n\n1. You have too many die hard purist Scrum/Agile folks who will die on their sword of Scrum is perfect, and you, your company, your CTO all don't know what you're doing.\n\n2. You'll have the next set of people who will agree with you and tell you that you'll be fine and waterfall is fine, and that going back in time is fine, and everything can be fine - as long as you have great people, you'll be fine.\n\n3. And finally, you'll have hybrid, Yes, you can tweak/try/plan whatever, without actually any tangible suggestions.\n\nEveryone loves to critique, but people here come from all audience and their feedback will be based on their frame of reference. Take their feedback as it is - opinions.\n\nHere's what you and your boss have to understand.\n\n70% of Waterfall projects failed. Agile didn't fair any better 66% of Agile projects fails. Most that fail belong to the \"medium and large\" size groups. Plenty of metrics on this released by multiple sources. Scrum, is part of the 66%.\n\nWhat's being sold - SAFe - stay away. Nothing good ever comes from doing it, but executives still buy this junk. Outside of wasting a ton of money, it doesn't change anything at the team level and only adds to the bureaucracy. \n\nHere's what else - everyone talks about successful implementations and transformations - they are all stories. NOT TRUE! Maybe someone did something and something was finally given credit as a success, whatever that means. I'm just sick and tired of these stories because most companies are full of dysfunction at every level.\n\nNow on to solution:\n\nFirst, CTO has a vision to add teams to the project - great, that's his vision. Now he should demonstrate the ability to deliver on this vision. He will run into the scalability issue right away. I've been a right hand man of a Sr VP of Eng on a large re-write project of 200 people in 6000 people company. Fought this battle first hand. \n\n1. I agree with someone who posted to add teams one a time. Don't just drop 10 teams in and tell them go on day 1. Won't happen. You need to start with one team, get it to perform, then after that launch other teams but transfer members from the original team so they can lead and show them how things are done.\n\n2. Process - if teams operate differently on every team, it won't work! Spotify failed in its model, though they described a good \"learning\" story. They use Scrum now ... apparently.\n\n3. You need centralized product goals and visibility so you can drive alignment. \n\n4. Architecture problem that needs to be solved and has tradeoffs: If you have all feature Teams, then you'll have no control or governance over architecture.... If you have all component Teams they will have better approach to a design but they will be siloed. No solution is perfect here, the tradeoffs are real. As number of Teams increase, you'll begin having a set of both Component Teams like Platform that will be providing architecture and services for other Teams. And you'll have Feature Teams that can build everything except touch Platform. Platform teams need to be scaled by consisting of the best people - cannot have a bottle neck there, or things will stall EVERYWHERE.\n\n5. Talent - large initiatives are done wrong - people are not asked to volunteer but are \"reassigned\" from other initiatives. Usually the people re-assigned are ones that can be released from one team. Critical, best people are always kept on other projects. What does that give you? The least productive and experienced bunch. Good luck with that too. So you need to recruit people from other areas in business - the best people. Or, you need to hire the right people. Also, don't just put a bunch of people together and call them a Team. Get them to naturally form Teams - try mob programming, hackathon events, but let them self create teams - they will be the strongest and the comradery built out will be better. Once you have 2-3 people on the team, let them recruit others for the purpose of growing their team themselves - selecting who they want to be part of the team. Natural leaders will evolve. But... this takes time.\n\n6. Inevitable tooling problem. Jira sucks and lacks visibility for a large project. Linear provides good tool but every Team is for itself. Metrics in both suck. Based on this... good luck getting there. \n\nThere's more to talk about, but I'm tired of typing, sorry :) If you'd like DM, me and we can explore more. Glad to answer any questions also.  \n",
          "score": 6,
          "created_utc": "2026-02-24 05:03:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o74in9s",
              "author": "CoolSnow01",
              "text": "This is actually a good answer",
              "score": 2,
              "created_utc": "2026-02-24 12:30:03",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o75wp49",
                  "author": "SeaworthinessPast896",
                  "text": "Thank you, I've been doing this for a very, very long time... stepped into enough doodoos along the way..",
                  "score": 1,
                  "created_utc": "2026-02-24 16:46:32",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o71348v",
          "author": "PhaseMatch",
          "text": "Agility is mainly a lightweight way to control your business risk.  The core risks are\n\n- we build the the wrong\n- we build the wrong thing\n\nScrum really helps in the high-risk, high-reward innovative technology/product domain.  You invest one Sprint at a time, look at the benefits obtained and how the external environment has changed, and decide how to proceed (or end the programme)\n\nThis seldom scales across a mature product suite.\n\nYou don't want to havr 26 \"go, no-go\" conversations with senior managers a year, and your operating environment for products is less dynamic.\n\nSimon Wardley covers this well (Wardely Mapping) and how the constraint shifts towards a slower market feedback cycle and longer term investment.",
          "score": 4,
          "created_utc": "2026-02-23 22:03:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o717f1k",
          "author": "flundstrom2",
          "text": "My current employer is similar in size R&D-wise, and we routinely have 15-20 teams working to bring several new hardware-based IoT product to market at the same time, but in different phases of development. The teams follows the architecture, rather than use-cases, so needless to say, the collaboration and synchronization between the teams and projects and products are challenging to say the least.\n\nFor historical reason, different parts of the organization has adopted different methods; some departments work with rolling 6-month plans, some with Pi-planning. Some use Value Streams and Agile Release Trains. Some teams work scrum-ish, other kanban-ish, some do both and some teams do waterfall-ish disguised in iterations. And all the knowledge is in the walls or hidden in Confluence, preferably not version controlled or up-to-date. Even better if it's on someone's personal confluence/SharePoint page. Bonus points if said person has left the company. 🤯 \n\nDespite all of this - so far removed from any theory - we actually not only ship products in a fairly regulated field, we're even doing well, growing, being profitable, and are market leader in mist countries were active in. 😲 \n\nI guess it proves that \"if there's a will, there's a way\", rather than focusing on which method to use.\n\nPersonally, I think it also shows that it is possible to combine agile on a team-level while still being able to run predictable projects on a company level. But it can most certainly be done in a more efficient way. Since I've been in the embedded software industry for 25+ years, I've spend quite some time thinking about those challenges.",
          "score": 3,
          "created_utc": "2026-02-23 22:25:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o73nxnm",
          "author": "Noy_The_Devil",
          "text": "God I fucking hate SAFe. I'm certified as fuck and this is my job. It's complete shit.\n\nhttps://safedelusion.com/",
          "score": 4,
          "created_utc": "2026-02-24 08:00:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o714cua",
          "author": "Noblespace14",
          "text": "Many organizations choose a hybrid approach - Waterfall planning + Agile Delivery. \n\nScrum helps breakdown the large goal into bite sized deliverable which are easier to manage than waterfall in my opinion, specially, in terms of long-term tracking. I have worked on some very large projects that had multiple product owners, each managing a feature, once the overall planning was completed and the MVPs were identified.",
          "score": 3,
          "created_utc": "2026-02-23 22:09:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o71lgwu",
          "author": "ben505",
          "text": "I mean Agile is more than just Scrum. \n\nNothing about incremental growth has to mean small. A leap is just an increment lmao\n\nThis just sounds like a profound misunderstanding of agile tbh. Of course plenty of agile practitioners use multiple teams on single products, like cmon are y'all being serious right now? ",
          "score": 3,
          "created_utc": "2026-02-23 23:41:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o719k6w",
          "author": "paul_h",
          "text": "Board needs to read The Goal and The Phoenix Project. I would not stay around myself to see this mess come to its logical conclusion",
          "score": 4,
          "created_utc": "2026-02-23 22:36:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o714nz4",
          "author": "No_Flan4401",
          "text": "So more people needs more communication.\nMore communication is magnitudes harder then less communication.\n\n\nIt's hard to answer specific, when we don't have more information, but I would always try to slice the product and have teams with well established boundaries that can work independent of each other. They also need to not be booked at full capacity to allow acute work needed for other teams.\n\n\nWhat I'm hearing for your post is that the cto expect miracles and he think he gets it by adding more non technical people. He dont",
          "score": 2,
          "created_utc": "2026-02-23 22:11:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o73buja",
              "author": "devloop_alex",
              "text": "The slicing approach is the only thing I've seen actually work at that scale. Tried the \"more teams, more coordination\" route at a previous company and it turned into a full-time job just keeping teams unblocked from each other",
              "score": 1,
              "created_utc": "2026-02-24 06:13:25",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o71jcsp",
          "author": "jesus_chen",
          "text": "Your CTO is about to waste millions on SAFe implementation and be further away from the stated goal then today. Strap in for the ride!",
          "score": 2,
          "created_utc": "2026-02-23 23:29:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o73e6az",
          "author": "ya_rk",
          "text": "Yes, LeSS. I've seen it work and I've personally know other people who've seen it work. Good luck.",
          "score": 2,
          "created_utc": "2026-02-24 06:33:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o764wa4",
          "author": "Personal-Lack4170",
          "text": "Introducing more roles can help with clarity, but it can also recreate waterfall through layers of approvals and handoffs",
          "score": 2,
          "created_utc": "2026-02-24 17:23:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o77mn8l",
          "author": "derNikoDem",
          "text": "I'd say my company is in a similar position. We are about 80 developers spread over 10 teams (still growing) working on one product. Our product is a SaaS platform with multiple applications. Half of the teams focus on specific apps in the platform the other half takes care of core functionalities. \n\nIt is working but of course things could always be better. Especially improving our ownership distribution together with defining clear interfaces and making sure that work items are well coordinated between teams while managing deadlines I'd say are among the hardest to manage.",
          "score": 2,
          "created_utc": "2026-02-24 21:27:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o715bnp",
          "author": "EngineerFeverDreams",
          "text": "Your CTO is an idiot and their goals are destined to fail. He doesn't understand that he just described scrum and didn't talk about the real issues that this entire process doesn't help with. The engineers need to work with the customers.",
          "score": 2,
          "created_utc": "2026-02-23 22:14:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o71af7b",
          "author": "designtom",
          "text": "I started to rant about bounded applicability and innovation, but there’s just so much going on in your C-suite that anything you bring to the table is a drop in the ocean of dick swinging contests.\n\nYou’re going on an adventure of sorts. Good luck!",
          "score": 1,
          "created_utc": "2026-02-23 22:40:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o733r48",
          "author": "epyk_one",
          "text": "I'd recommend looking into something like FaST. It's very interesting and I've seen a flavor of this work to some extent. It does require the right culture for sure. \n\nhttps://youtu.be/SfVpi6ghNdo?si=XsP1IN92Exp4l-OW\n\nIn the end I think it's all about being ruthless about priorities. Both in defining them and sticking to them.",
          "score": 1,
          "created_utc": "2026-02-24 05:09:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o73m2ip",
          "author": "Leinad_ix",
          "text": "It sounds like the Big Leap forward from China. Future disaster.",
          "score": 1,
          "created_utc": "2026-02-24 07:43:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o73uppw",
          "author": "impossible2fix",
          "text": "When you get to 5-10 teams on one product, the bottleneck isn’t the ceremony, it’s dependencies and decision-making. If architecture isn’t modular and ownership isn’t crystal clear, adding more teams just adds more sync meetings.\n\nWhat worked for us was keeping small, empowered teams but introducing strong product alignment at a higher level: shared roadmap, clear product strategy, regular cross-team planning. Not full SAFe style heavy process but more structure than pure Scrum.\n\nGoing full top-down waterfall usually slows things down long term. But pretending 10 teams can act like 1 Scrum team is unrealistic too.",
          "score": 1,
          "created_utc": "2026-02-24 09:05:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o742zxy",
          "author": "jleme",
          "text": "That company’s in trouble. The CTO clearly doesn’t understand Scrum or Agile. And what he described definitely isn’t SAFe, which, honestly, isn’t great anyway.",
          "score": 1,
          "created_utc": "2026-02-24 10:23:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o748ot3",
          "author": "Ok-Mousse6057",
          "text": "Scrum is fractal and scales beautifully with very few/minimal adjustments. The only scaling patterns I would consider, and have used extensively myself in similar situations are: Big Room Planning (BRPs - SAFe \"borrowed\" this), Scrum of Scrums (each team sends ambassadors to a daily sync/impediment removal/planning meeting - similar to a Daily Scrum but I make it 30 mins), maybe add in Chief Product Owner (rarely needed imho), and most importantly, ensure each team is designed with true end-to-end delivery capability (ideally aligned to a value stream). This is where most failures occur. I work with orgs all over the world, and 90% of failures come down to poor team design. \n\nYour CTO has most likely never experienced real Scrum...this is an opportunity to implement a successful operating model right out of the gate...SAFe is a disaster, stay away from it. And most large scaling \"frameworks\" suffer from the same problem, which is a large \"cookie-cutter,\" complexity-inducing, agility-killing solution is the answer...it's not, and I have the scar tissue to prove it.\n\nHappy to answer any other questions or share direct client experiences and hard data.",
          "score": 1,
          "created_utc": "2026-02-24 11:14:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o74k77s",
          "author": "Hot_Preparation1660",
          "text": "There is a critical piece of context missing here. What kind of product is this? If it’s pure software, this is nonsense. Waterfall is almost a strawman in the context of a SaaS product.\n\nIf it’s hardware, this makes all the sense in the world IMO. You can’t fly by the seat of your pants when you have to manufacture physical things in the real world. Especially if it’s a regulated industry (aerospace, medical devices, etc).",
          "score": 1,
          "created_utc": "2026-02-24 12:40:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o74smux",
          "author": "DallasActual",
          "text": "He's wrong, it is possible and I have seen it done. What it requires, though, is deep thought about the flow of value and the nature of the work. This tends to require reorganizing teams in ways that may upset existing power holders.",
          "score": 1,
          "created_utc": "2026-02-24 13:31:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o74wvne",
          "author": "Kenny_Lush",
          "text": "Let me guess - they will toss all things “agile,” but hold on to daily “STAND UP!!!!” like grim death…",
          "score": 1,
          "created_utc": "2026-02-24 13:55:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7719lg",
          "author": "Negative_Site",
          "text": "Im witnessing agile turn back into waterfall due to inertia",
          "score": 1,
          "created_utc": "2026-02-24 19:48:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7hlvlw",
          "author": "Bowmolo",
          "text": "What a limited perspective.\n\nFalling back to Waterfall because a single Person cannot handle the scale is rather, hm, dumb, at least uninformed. \n\nFlight Levels, LeSS... there are many options to solve that problem.",
          "score": 1,
          "created_utc": "2026-02-26 09:50:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o713b5w",
          "author": "phoenix823",
          "text": "Adding product managers, subordinate POs, and analysts does not mean you're abandoning SCRUM. The \"agile model\" was always meant to be customized for your way of working. And if the top-down planning means picking the most important work and doing it first while working out dependencies between teams, how is that not still agile? ",
          "score": 0,
          "created_utc": "2026-02-23 22:04:41",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rfljjg",
      "title": "I’m coming to terms with the fact I am not cut out to be a Product Owner.",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1rfljjg/im_coming_to_terms_with_the_fact_i_am_not_cut_out/",
      "author": "Apprehensive_Dot3064",
      "created_utc": "2026-02-26 20:33:51",
      "score": 24,
      "num_comments": 90,
      "upvote_ratio": 0.86,
      "text": "Hey everyone, I’ve been wrestling with this for a while and wanted to come get an outside perspective.  Three years ago, I made a massive career gamble: I transitioned from a domain-expert role to Product.  When I made this transition, I had never so much as written a line of code, and I had no familiarity with software development / IT concepts.\n\nWhen I became a product owner, I thought my mandate was clear: write requirements, define a roadmap, and work closely with technical execution to ensure that we built a product that has value for the end user.\n\nI’ve had this problem:\n\n1. My requirements are never specific enough.  I have tried everything.  I started with long paragraphs, and bulleted AC, but there were always omissions.  I didn’t realize that I needed to identify every tool tip, pixel width, backend relationship, dependency, and detail of the story.  I’ve tried building Figma mockups & vibe coding interactive AI prototypes, but the devs say it is not helpful if I don’t define the front end component to be used, define the backend architecture, etc.\n\n2. Failed to technically mentor the devs.  I’ve learned a lot about database design, but I still don’t know enough.  For example, in my stories I haven’t recommended property audit logging, and I sometimes don’t identify every foreign key required.  I try to highlight in UI where to get relevant fields, but if the UI does not name something the same as the database, the devs can’t find it.\n\n3. I’ve failed at estimating work.  The devs regularly tell me features will be done at the end of the day, but then they aren’t.  I ask them to show me what they have, and they pull up code.  I’ve clarified that definition of done means that the feature must be merged (not sitting in local), acceptance criteria must be followed, you cannot break existing core functionality when you merge it in… but these high level rules are not enough. \n\n4. I fail to prioritize appropriately.  I have a clear vision of what the product needs to do from a user perspective, but I poorly direct the devs on backend order.  I try my best to tell them the order that tables must be made, code must be written, what environments to merge to and when…but I make mistakes.\n\nA few of the above are my mistakes.  Software development is hard, and directing it is no joke!  At this point, the senior devs and engineering manager have escalated to leadership that I ak failing to direct development correctly, and the stress is eating me alive.  I haven’t taken a vacation in years, and don’t remember the last time I had a weekend off.\n\nThis whole product owner thing is no joke.  I think it’s time for me to hang my hat, and go back to being a domain contributor.  Props to the people here who make it work.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1rfljjg/im_coming_to_terms_with_the_fact_i_am_not_cut_out/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o7kwkia",
          "author": "tarvispickles",
          "text": "Idk this might be controversial but it kind of sounds like your dev team sucks.",
          "score": 86,
          "created_utc": "2026-02-26 20:41:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7kxizx",
              "author": "Fluid-Scar-6020",
              "text": "Exactly my thougths. My devs would reject stories if I were to start designing databases or API structure. These devs just suck ass",
              "score": 33,
              "created_utc": "2026-02-26 20:45:45",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o7kybo3",
              "author": "Apprehensive_Dot3064",
              "text": "I’m new to this line of work.  Sorry if this is a broad question, but: what should the devs / EM be doing differently?\n\nThe organization’s philosophy is that I own dev quality, career advancement, timelines, etc.\n\nI felt that the EM should be doing some of this and escalated it to management.  They said I was a “low accountability individual”, and that “product problem solvers” like me figure out how to improve dev velocity & quality.",
              "score": 5,
              "created_utc": "2026-02-26 20:49:31",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7kzyby",
                  "author": "NoYOLOBro0013",
                  "text": "Not a product job. You’re correct that is definitely an EM responsibility.",
                  "score": 16,
                  "created_utc": "2026-02-26 20:57:15",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7l069v",
                  "author": "Fluid-Scar-6020",
                  "text": "Dude, being in product in short and in essence means figuring out user painpoints, and fixing them in principle. \n\nFor example:\nThe platform we're building has 200 products, and the users have no way to search for a specific one. Your job is to figure out that a) this is a problem and b) how to solve it. By implementing a search feature, a filtering feature, a messenger pigeon if that would solve it. You figure out how the solution should work, and direct the designer and the devs to figure out the technicalities. \n\nIdeally, you should have no idea what the code does as long as the solution to the problem is implemented and the users don't have the problem anymore. That's what you focus on. Everything else should ideally be offloaded onto the devs.",
                  "score": 8,
                  "created_utc": "2026-02-26 20:58:18",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7l2vl8",
                  "author": "tevert",
                  "text": "Sounds like your actual job is being an engineering manager, not a product owner.",
                  "score": 2,
                  "created_utc": "2026-02-26 21:11:00",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7ln9dn",
                  "author": "Pretty-Substance",
                  "text": "Haha classic. Let me tell you and I have 10+ years of PO experience: your manager know jack shit about the role and they’ve sent you into battle but have not given you a sword. You can only loose. Get out of there, it will kill you. \n\nThe mandate you described was accurate, everything else in the paragraphs below: not you job, period. It’s the teams job but they managed to delegate it to you. You’ve lost",
                  "score": 2,
                  "created_utc": "2026-02-26 22:50:45",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7loixo",
                  "author": "daddywookie",
                  "text": "There should be a strong triad of people. Product, Development, Design. Those three disciplines should be working together to find the best performance of the team, often alongside some kind of Producer/Project Manager, defined by the velocity of value delivered.\n\nUltimately, the PO is accountable for the value of what is delivered. In some ways your leadership is right, that can be described as falling on a top level PO. That level of PO also has full budget and strategy authority and earns far more than what you are on (think Product Director or CPO).\n\nYou might just be straight out of luck with leadership that wants to offload but not pay the price. You can try and ask for the authority required to kick the devs into line, but I don’t think that’s the game being played.",
                  "score": 1,
                  "created_utc": "2026-02-26 22:57:23",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o7lugla",
              "author": "kristentx",
              "text": "Yes.  During refinement, the entire team should be contributing, discussing, clarifying, and estimating.  If something isn't the way they like it, they have the responsibility to speak up.  The team can be persnickety about how they want to see things, but they need to give you feedback.  \n\n\n\nYour job is to define the what, your team is supposed to be defining the how, including the architectural and deeply technical stuff that needs to be figured out.\n\n\n\nOne thing I have found helpful, is having what I call a pre-refinement, with myself, the PM (if available), the DEV lead, and QA engineer.  I create the stories for what is needed from a business perspective, and if more technical info is needed, we talk about it and add those details. \n\n\n\nI have worked with a lot of teams over the years, and they each want stories done a different way.  A lot of this sounds like the team is wanting a BUR, where everything is spelled out for them, rather than following the agile process.",
              "score": 1,
              "created_utc": "2026-02-26 23:29:31",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o7lunux",
              "author": "Fugowee",
              "text": "Sounds like it to me too.\nA PO shouldn't be speccing *how* the work is done; just what is the product to be built.  The fine line reqs could be brought out collaboratively in the promise to have to have the conversation.\n\nMaybe technical POs do that....still shouldn't need to spoon feed.  Maybe a lack of trust is the issue.  Otherwise, maybe laziness or rejection of working collaboratively.",
              "score": 1,
              "created_utc": "2026-02-26 23:30:37",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7kx82x",
          "author": "99ProllemsBishAint1",
          "text": "You need a more clear line between what you're responsible for (the what and the relative priority) and the engineering teams are responsible for (the how including sequencing of the technical pieces). Sounds like you're getting blamed for failures because you don't know the boundaries of your role. I'm sure you have things to improve on but your biggest problem is demarcation of responsibilities. Your senior leadership shouldn't be letting this happen but you need to get informed as well.",
          "score": 50,
          "created_utc": "2026-02-26 20:44:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7kyp1a",
              "author": "Apprehensive_Dot3064",
              "text": "I’ve done a lot of research, and tried to establish a RACI chart.  I’ve also going to senior devs, directly to the EM, and to the VP of technology.\n\nThey all say that this is my problem to solve, and I am a low accountability individual for trying to split responsibilities.  They said that “the buck stops with product”.\n\nThey said I have two choices:\n\n1. Fire the dev team, and use Claude Code to build it myself\n2. Fix all of the above issues myself, without involving them.",
              "score": 4,
              "created_utc": "2026-02-26 20:51:16",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7l4bwl",
                  "author": "pinks85",
                  "text": "Sorry to say, but sounds like your org needed a scapegoat role and decided to call it \"Product owner\".\nFrom reading your other comments here, it seems to me that everyone BUT you is the low accountability individual.\nI guess in your situation, Claude code would be the logical choice out of the two you were given. You already do everything except writing code...",
                  "score": 31,
                  "created_utc": "2026-02-26 21:17:49",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7l2ial",
                  "author": "cardboard-kansio",
                  "text": "Honestly it doesn't sound like your developers are participating, helping, or in any way being particularly active. Depending on your domain, option 1 is likely to be the better option. \n\nRun for the hills, friend.",
                  "score": 18,
                  "created_utc": "2026-02-26 21:09:17",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7l9kpt",
                  "author": "Drevicar",
                  "text": "CTO of a SWE company here. This isn’t a healthy response, and the expectations and job descriptions placed on you aren’t realistic. Yes, the PO owns all the responsibilities and blame, but that means you need to delegate to your team and trust but verify their outcomes. Doesn’t mean you need to inspect the outputs, but find a way to hold the accountable for their own work such that once it gets back to you, you can safely take ownership of it. This is a team responsibility model. What it sounds like your VP is describing is a principle engineer turned engineering manager turned product owner. Which means you should be making a TON of money to have that kind of responsibility. I wouldn’t ask that much of anyone making less than $500k USD for perspective, maybe a bit more.",
                  "score": 8,
                  "created_utc": "2026-02-26 21:42:44",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7l3cql",
                  "author": "99ProllemsBishAint1",
                  "text": "They sound very toxic. If firing the dev is a real option I'd truly consider it if I were you, but the problem sounds like it's with leadership. They've got severe toxicity in their org and they need to root it out, but they're just blaming you. It's very short sighted of them when they have a PO that truly wants to improve.",
                  "score": 3,
                  "created_utc": "2026-02-26 21:13:14",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7l74ox",
                  "author": "bedel99",
                  "text": "fire the dev team, fail at using claude code, then get fired yourself. You are going to get fired anyway. Burn the place to the ground. \n\nClaude is great at deleting all the your repos and force pushing, i bet there is no proper backup. LET IT BURN! \n\n",
                  "score": 2,
                  "created_utc": "2026-02-26 21:31:02",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7m3os7",
                  "author": "justdoitscrum",
                  "text": "wtf is an em",
                  "score": 1,
                  "created_utc": "2026-02-27 00:20:40",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7kye24",
          "author": "404_scramps_notfound",
          "text": "As a product owner you are not responsible for owning or defining technical implementation details (including database/backend architecture). Unless you’re specifically a technical PO AND engineering manager/system architect, these are things that should be owned by the dev team. \n\nAdditionally, you don’t need to know every last detail for each work item when you first present them to the team: this is what refinement is for! It’s a conversation with the team to ensure a shared understanding of the work. This includes fleshing out any missed requirements/acceptance criteria. What is the handoff like between you and your team? Are you just sending them work items with the expectation that they should take it and run with it as is?",
          "score": 19,
          "created_utc": "2026-02-26 20:49:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7kzt1n",
              "author": "Apprehensive_Dot3064",
              "text": "I’ll walk through my handoff process:\n\n1. I write all tickets\n2. I meet individually with each developer, present he stories as written.  And ask for feedback.  They never have feedback, and never have questions.\n3. I host sprint grooming & refining meetings to wider stakeholders.  I’ve asked the devs to present their stories before, but they won’t do it.  So I present, and ask the group for any questions.  There are never questions.\n4. IF it turns out anything was unspecified, devs block the work item and stop work.  They do not tell me or their manager when blocked.  I follow up with them all each at least twice daily, and that’s when I find out if they are blocked.\n5. I play 20 questions to find out why blocked .\n\n“Wha is confusing about the story?”.  \n\n“Databse”.  \n\n“What about the databases”. \n\n“Missing fields, unclear data type”.  \n\n“Which fields are missing? What data type is missing?” \n\n“Typical best practice stuff”. \n\n6. Milestones slip, and we don’t deliver.  Devs report that, yet again, the PO was unclear and that is the reason.  EM agrees.  I get screamed at.",
              "score": 2,
              "created_utc": "2026-02-26 20:56:33",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7l69r7",
                  "author": "Rezistik",
                  "text": "Why is sprint grooming and refinement open to wider stakeholders?\n\nIn every agile system I’ve worked in:\n\nPM gathers requirements including meeting with stakeholders\n\nPm creates tickets with requirements \n\nDesign if ui is involved and there’s a dedicated ui team if not this is skipped\n\nPm presents tickets to devs as a group. Devs are expected to ask questions until the story meets ready for pointing criteria and sometimes pointing is done at the same time sometimes it’s a different one\n\nPm sorts tickets based on priority. Team reflects and agrees on how much velocity is available to the team and chooses tickets/points up to the budget for the sprint. \n\nDevs do the work until it meets definition of done or ready to qa \n\nQa if that’s a dedicated step takes it \n\nOff to prod or customers or pm review the last step is more fluid and flexible in my experience \n\nThen a retro at the end of sprint where maybe demos are done and we reflect on work patterns over the past sprint to identify any velocity risks or issues\n\nYou need to turn it on your devs and fire your engineering manager if they don’t have time to manage engineering. If they aren’t asking questions and that leads to them not being able to complete the work they should feel embarrassed not you.",
                  "score": 3,
                  "created_utc": "2026-02-26 21:26:59",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7l5vwi",
                  "author": "RA_wan",
                  "text": "As a product owner of 2 teams I dont do anything of the stuff you describe.\nYou are way to much into the details. The team must answer these questions not you. Also you need a scrummaster to organize the scrum rituals and the way of working around it better.\n\n\nI suggest the following steps:\n- Let your stakeholders create userstory written in the form of: I want the product to do X. This will bring me Y. I want to see this test scenario. \n\n- I do read each story before assigning them to check if I understand why they want it. By doing this you have some indication of the business value.\n\n- Next step is to select the storys you want to refine. Refinement is done by the team itself before the userstory are added to a sprint. Your team should spend the majority of their time working on sprint times but there should be time left to spend on refinement to prepare the next sprint. \n\n- A userstory can only be planned in a sprint if refinement is done and the solution is clear. For example, 1 team member does refinement and estimation. Then presents it to the rest of the team to make sure the solution fits.\n\nBy stepping out of the refinement proces and giving the responsibility back to the team you can focus on what your supposed to be doing: talking to your stakeholders about new and upcoming wishes and backlog priotization.",
                  "score": 2,
                  "created_utc": "2026-02-26 21:25:10",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7l7d3j",
                  "author": "404_scramps_notfound",
                  "text": "Are they not calling out in standup that they’re blocked? This sounds like an incredibly dysfunctional team. And if the EM is behind it, it sounds like it’s bigger than just the team. I don’t think you’re the issue here. Personally, I would run.",
                  "score": 1,
                  "created_utc": "2026-02-26 21:32:09",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7lazwv",
                  "author": "ExitingBear",
                  "text": "As someone above said - it sounds like your dev team sucks.  That is not normal for a PO position.\n\nI'm not saying you *are* cut out to be a PO; but I'm not sure that anyone is cut out to be a PO where you work if that's typical.  Your devs are actively, intentionally breaking process.",
                  "score": 1,
                  "created_utc": "2026-02-26 21:49:36",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7kzuss",
          "author": "cardboard-kansio",
          "text": "> I am not cut out to be a Product Owner.\n\nOkay, let's explore that.\n\n> the devs say it is not helpful if I don’t define the front end component to be used, define the backend architecture, etc.\n\nYour job is to define the problem and the value to the end user: the WHAT and the WHY. Their job is to define the HOW. In other words, to develop. Architecture, languages, components, these are the job of the team.\n\n> Failed to technically mentor the devs\n\nSee above. If you are not a senior developer, an architect, or some similar technical role, then you should not be mentoring the devs.\n\n> I’ve failed at estimating work.  The devs regularly tell me features will be done at the end of the day, but then they aren’t.\n\nThe developers are responsible for their own estimates. They are also responsible for flagging any risks or blockers, and for making a bigger estimate if there is risk or uncertainty. You are not responsible for their estimates because you are not a developer. \n\nThere is a failing here, however. You should ideally be retrospecting regularly with your team on why the estimated were not accurate. No blame, just learning. Did the team make assumptions? Were there new tools or technologies in use? Were dependencies not properly mapped out?\n\n> I try my best to tell them the order that tables must be made, code must be written, what environments to merge to and when…but I make mistakes.\n\nSee #1.\n\n> Software development is hard, and directing it is no joke!\n\nWait, are you a senior developer? Or engineering manager? I thought you said product owner earlier. You are not supposed to be directing the software development, you are supposed to be directing the product vision and value generation.\n\n> I haven’t taken a vacation in years, and don’t remember the last time I had a weekend off.\n\nWhat the fuck dude. This whole thing is either an absurd troll or you're incredibly naive, and letting a toxic organisation railroad you into burnout. This is not a product problem.\n\nFor context, the whole PO role derives from Scrum. The guiding document - the Scrum Guide - is pretty short, only a few sides of A4, but clarifies pretty well the roles of the development team and the PO. You should read it. Not all organisations do Scrum (and many just apply all the lingo and labels and ceremonies without actually following anything it says), but it is pretty foundational for understanding the roles and responsibilities. https://scrumguides.org/scrum-guide.html",
          "score": 9,
          "created_utc": "2026-02-26 20:56:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7l0rrz",
              "author": "Apprehensive_Dot3064",
              "text": "We do retrospectives every sprint, but it’s me monologuing.  They have never left retro comments, or meaningfully participated. \n\nI agree that this doesn’t seem right, but all attempts to escalate and correct the issue lead to leadership saying it is my problem to solve.",
              "score": 1,
              "created_utc": "2026-02-26 21:01:06",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7l1w8u",
                  "author": "cardboard-kansio",
                  "text": ">We do retrospectives every sprint, but it’s me monologuing.  They have never left retro comments, or meaningfully participated. \n\nWell then you're not really doing a retrospective, are you? \n\nHonestly, there are places where this process works great. You are not at one of those places. Start polishing your CV and looking for a new job - it doesn't sound like this is a great place to be, even if you change from the PO role.",
                  "score": 5,
                  "created_utc": "2026-02-26 21:06:25",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7l82x8",
                  "author": "Rezistik",
                  "text": "I’d solve it by wiping out the worst of the team and hiring someone with work ethic. \n\nMake it beyond uncomfortable for them to not speak. \n\nWhat I would do as an engineering manager sitting through silent refinements is directly ask a team member “hey personName how would you implement this? What dependencies are there?”\n\nThen ask someone else for their thoughts or move on depending \n\n\nI’d generally only pick on people who I knew wouldn’t be like hurt to be called on. I try to avoid anyone who is like clearly uncomfortable in groups. It does mean sometimes people feel uncomfortable for being called out but it has to happen. Silent refinements are recipes for missing deadlines and stress. \n\nFor some reason your devs feel no stress and you feel it all so it’s time to fix that.",
                  "score": 3,
                  "created_utc": "2026-02-26 21:35:35",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7mdgoa",
                  "author": "Smgt90",
                  "text": "I think you should look for another job. This sounds like a deep organizational issue that is not going to improve.",
                  "score": 1,
                  "created_utc": "2026-02-27 01:15:28",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o7mrhv4",
              "author": "jennybath",
              "text": "Please please read this. I’m a Senior PM, accountable for 5-6 Product Owners. None of of PMs are accountable for what you think you’re failing at- this is a system failure (if you’re using agile or scrum - this is solved through refinement, team estimation, etc) and a dev failure (you are accountable for outcomes, prioritization and “the what” (the problem to solve, hypothesized solution) and end user feedback.",
              "score": 1,
              "created_utc": "2026-02-27 02:36:43",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7kyi2a",
          "author": "Uncle_Daddy_Chiliman",
          "text": "It's not product's responsibility to have a working knowledge of technical details. If you are providing actionable user stories, figma mockups and as a team defining the acceptance criteria then you're halfway there. Work with your manager on what should be prioritized. Work with your technical lead to estimate how long a feature will take to complete. Update the appropriate stakeholders on what they need. Don't be afraid to ask stakeholders for help or assign a dev to do so. \n\nMaybe you just need to get on udemy or take a class and get certified for PO level one to get a better gist on the basics of agile.",
          "score": 6,
          "created_utc": "2026-02-26 20:50:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7l0f4u",
              "author": "Apprehensive_Dot3064",
              "text": "I write user stories, but the devs say that they aren’t actionable.  For instance, I:\n\n1. Don’t list dependencies for them to check for always\n2. Don’t list out important features to not break with changes\n3. Migration plan \n4. Haven’t highlighted the sections of code to change\n5. Defined flows.  For example, I wrote a story to create an Undo button.  The button was added, but non functional on testing.  Dev said i was ambiguous because I hadn’t written out examples & migration paths to revert system to prior state, and if read as a “front end story”.",
              "score": 2,
              "created_utc": "2026-02-26 20:59:27",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7l3ool",
                  "author": "nospacebar14",
                  "text": "Is the dev team outsourced and/or contractors? Because it sounds like your management is cheaping out and getting what they pay for.\n\n\n\"Don't list important features not to break with changes\" part of my job as an engineer is to not break any features with changes!",
                  "score": 7,
                  "created_utc": "2026-02-26 21:14:46",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7l6l7s",
                  "author": "Internal-Alfalfa-829",
                  "text": "And indeed you should not be doing ANY of these things. This is all the developer's role. Are the actually REAL developers, or just code monkeys? Developing INCLUDES coming up with the way of solving the task and achieving the desired outcomes, managing dependencies and pitfalls and so on. Your job is only a well-defined \"what\" and \"how do we know that it was achieved\" (acceptance criteria).",
                  "score": 2,
                  "created_utc": "2026-02-26 21:28:29",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7l6svg",
                  "author": "Rezistik",
                  "text": "Devs should own technical dependencies while scrum master or product owner should handle organizational dependencies. \n\nYour devs genuinely sound lazy and dumb like the undo story is unreal. My pms have sometimes barely been technical enough to understand my explanations and I would never expect them to open github",
                  "score": 1,
                  "created_utc": "2026-02-26 21:29:30",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7l257y",
          "author": "perica66",
          "text": "This sounds like rage bait / troll post.\nObviously 90% of mentioned stuff is not a responsibility of a product person.\nOrder of table implementation, hahaha. Even a role like architect shouldn't tell devs the order of component implementation. \n\nAnd insisting on a Product Owner role name, I find it to provoke Product Managers among us.\n\nIf you are not a troll, than quit that job, if not yesterday, than today!",
          "score": 4,
          "created_utc": "2026-02-26 21:07:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7leto7",
              "author": "daxel",
              "text": "I can’t believe OP is serious and how anybody can take OP‘s post or comments seriously. To me this is so obviously written in a complete anti-way of doing things that it I cannot believe it to be true. You would have to be really smart/deliberate to do everything that wrong.",
              "score": 2,
              "created_utc": "2026-02-26 22:08:11",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o7lnv8c",
              "author": "pinotberry",
              "text": "Each post I read from OP my jaw gets further and further to the ground and my finger closer and closer to hitting reply. But there is so much wrong here that I doubt a comment could be remotely helpful. So thank you for sparing me the mental energy.",
              "score": 1,
              "created_utc": "2026-02-26 22:53:56",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7kzyv0",
          "author": "GreatZoran",
          "text": "Hi sad to see that but i think you totally misunderstood PO role.\n\nYou are the functional expert who rule the product and establish clear priority.\n\nYou don't code and so don't estimate.\n\nStories acceptance criteria and priority are what you own. BUT you getting them ready is a team work with.... tadaaa  .... refinements \n\nA good story is INVEST (look online the acronym)\n\nLook like you miss completely the role content.\n\n Remember one thing Agile is Lean manufacturing  applied to development.\n\nPO is one element but not everything rely on him. It's team work and good sense overall your common goal is to find as a team an organisation that is effective to deliver what is needed with correct level of quality with a predictable flow",
          "score": 2,
          "created_utc": "2026-02-26 20:57:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7l187s",
              "author": "Apprehensive_Dot3064",
              "text": "I agree; but if I delegate it to devs, they do not do it and blame me.  The org backs them.\n\nIf I do not do all of this, the product will fail and I’ll be accountable.",
              "score": 1,
              "created_utc": "2026-02-26 21:03:15",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7l2vyj",
                  "author": "GreatZoran",
                  "text": "I think they feel not responsible of the product and hide behind process.\n\nGet clear on priority (like pick 5 story only) and the value on each one. You want those only and there won't be any other topic for next sprint planning.\n\nThey can challenge you on functional stuff or edge cases. Of they start asking you for implementation this is their realm and you don't give a shit. \nYou are here for functional validation to validate it work as intended in the AC\n\nGood luck get them on-board on their responsabilities\n\nYou need a scrum master to do his job if you have one.\n\nYou can also build a responsability matrix to explain them the role. You are all implicated on your product success not only the PO",
                  "score": 1,
                  "created_utc": "2026-02-26 21:11:03",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7l1zfo",
          "author": "ya_rk",
          "text": "maybe you're not cut out to be the role your comapny expects you to be. it's not a PO role (doesn't matter that they call it that), it sounds more a team lead for bunch of inexperienced/entitled devs. A PO role is not technical oriented, it's business and customer oriented: Your concerns are what impact your product is making with your customers and how it is affecting the business.\n\nIt has nothing to do with anything you describe.\n\nSo, maybe you are cut out to be a PO! Because so far you haven't experienced it at all yet.",
          "score": 2,
          "created_utc": "2026-02-26 21:06:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ldbmg",
          "author": "Pyroechidna1",
          "text": "OP, may I ask what country you are in?",
          "score": 2,
          "created_utc": "2026-02-26 22:00:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7lig2k",
          "author": "rigatoni-man",
          "text": "Seems like the expectations on you don't really match what I'd expect.  Particularly mentoring devs and defining the tiniest of details.\n\nMy responsibilities often have gray area, but usually when the team spirit is good we don't focus on the fuzzy boundaries and all do our part to make the best product we can.",
          "score": 2,
          "created_utc": "2026-02-26 22:26:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7l0h5j",
          "author": "Electronic_Claim_315",
          "text": "You need a Solutions Architect or a Dev team lead",
          "score": 1,
          "created_utc": "2026-02-26 20:59:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7l0orn",
          "author": "PhaseMatch",
          "text": "**TLDR;  My take would be that the first two have nothing to do with agility, and that's chewing up your time so you can't deal to the last two.  Your system of work sucks, not you.**\n\n**1) Nothing agile to see here.**  \nA team wanting detailed requirements is a huge red flag;  that's exactly the kind of \"heavyweight\" stage-gate sign-off stuff that lightweight agile methods replaced.  Your job is to bring the team business problems to solve.    \n  \nThe teams job is to work with you and relevant user-domain SMEs to uncover the real requirements needed.  \nWe do that iteratively and incrementally using working software as a probe, in close collaboration with the users. \n\nLook into things like User Story Mapping and the role of the \"onsite customer\" in XP.\n\nThe team wants to be spoon-fed to avoid any risk of blame.  That's a biiig cultural fail.\n\n**2) Nope. Nothing Agile here either.**  \nYour job is to bring them technical problems to solve, not solutions to be implemented.  \nTheir job is to collaborate with you and the users to design a potential solution (hypothesis to be tested)   \nYou then all work together iteratively and incrementally.  \n\nLinked to the first one.\n\n**3) Well, that's a maybe**  \nYou do need to be able to forecast delivery and value, but that's also part of how you collaborate with the team, and it's hard.  Mostly the issues tend not to be \"time on tools\" but the flow of work from start-to-end, which is where lean concepts come in.  Look into \"Actionable Agile Metrics for Predictability\" or the getNave plugin for Jira/ADO and so on for a different perspective.\n\n**4) And that's a maybe**  \nif you have a business-outcome based roadmap than mainly what you need to be doing is brining them problems to solve, not solutions.  And certainly not adding detail too early.  User story mapping and so on is your friend\n\n",
          "score": 1,
          "created_utc": "2026-02-26 21:00:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7l18om",
          "author": "lakerock3021",
          "text": "First: that sounds like a lot to carry, it sounds like you have been through a LOT, and I don't want to go through what you have been through. That sucks.\n\nSecond: I'll make the observation that the expectations you are failing to live up to sounds more like a technical project manager than a Product Owner. Based on this post, I don't think you have actually had a PO role because this organization isn't looking for one. I'd encourage you to try your hand at another PO role- vet the role significantly to make sure it is what you have experience with and are able to execute on.\n\nBelow I have responded to the (IMO) ridiculous expectations this org has placed on you. They are more of a criticism of the org and whoever trained you for this role. I apologize if they come off harsh, that is not my intention. Use whT is helpful, disregard what is not.\n\n*\"Didn't know I had to define every tool tip, every pixel width...\"* you don't need to define these, unless it is a requirement for the outcome you have asked for. At the same time, don't reject work because it doesn't look or feel like what you thought it should, unless it is a requirement for the outcome.\n\nIe: building a calculator- what is needed for the user to be able to add two numbers together? Does it *need* to have grey buttons? Does it *need* to have a \"led style\" screen? If these are not things necessary for a user to add two numbers together, don't make them a requirement. That is up to the devs to figure out in an effective manner. They may want some security that if they make the number inputs sliders that it won't get rejected (okay, a little silly) but if having 0-9 button inputs is a requirement *then* it needs to be in the requirements.\n\n*\"Failed to technically mentor the devs...\"* Wut? Why would they ask a Product Owner who has not dev experience to mentor the devs, no offence but I wouldn't want you giving ANY technical input, you are the Product Owner, not the Technical Team Lead, or the Dev Manager, or the technology SME. Poor sport on the company's part. To be fair I also have no technical experience and don't want me giving technical input or direction for the team.\n\n*\"I've failed at estimating work...\"* Honestly, good. Let the people doing the work estimate it. You don't need to be able to look at some code and determine how much longer it will take. If the dev commits to having it completed and they don't, have them give you an updated estimate. If that happens a lot, have a conversation with the team about the benefits and pitfalls of estimating and what the estimates are being used for (from a business standpoint)- or better yet have your SM lead that conversation in a retro (they will need your input tho). <- all this doesn't even touch on the pitfalls of estimations.\n\n*\"Fail to be able to prioritize...\"* Okay, here is the first point that feels even remotely like a legitimate expectation of a PO. Knowing what the highest value outcomes are for the product is where you need to point your focus. Talk to users, I mean like talk to a LOT of users, get feedback and input anywhere you can (from users, not from randos). What are the features and outcomes they are asking for the most? There is your answer.\n\nAs far as \"what order to build the backend in\" - you should not know that, you are not a dev. Set out the priority as an outcome or a feature and let the devs decide what needs to happen first and second. Have these conversations as part of your backlog refinements, \"here is the outcome: X, what do we need to do first to deliver that outcome?\"\n\n---\n\nI hope that this is helpful, feel free to reach out if you have more questions or are looking for clarifications. Best of luck my friend!",
          "score": 1,
          "created_utc": "2026-02-26 21:03:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7l1ceq",
          "author": "Abouttheroute",
          "text": "Seems you try to be a product manager, but the team expects a tech lead. Every step you describe screams failing dev org to me.\n\nTo shine some light: I’m a product manager myself, for the UI we have designers, and a good design system where everything fits. My tech leads do estimates code level ordering, and technical design. My responsibility is mapping business objectives to solutions, align all stakeholders, and prioritize between initiatives. Tech leads, designers, and engineers are my virtual team and I interact with them daily. I give my input on architecture and challenge them on solutions, but the moment I try to tell them what keys or code  to use I think they will spend the rest of the day roflmao-ing.",
          "score": 1,
          "created_utc": "2026-02-26 21:03:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7l37i8",
          "author": "_nanoNexus_",
          "text": "A lot of the issues you've mentioned are not attributed to your role as a Product Owner but I hope you're seeing that this stems largely from the behaviour and attitude of your team towards the work and towards you.\n\nOwnership of the software development process rests heavily on engineering teams. So it begs the question, what kind of partnership/support does your EM provide to you? As far as facilitation of the ceremonies go, where does your scrum master fit in all that?\n\nOne of the core tenets of agile is empowerment, it seems that your team is nowhere near that. They feel empowered enough to not work on stories that they deem incomplete but not enough to take ownership of some of the technical issues that they face and pushes accountability towards whoever it is that's up the chain.\n\nAnd quick reminder as well. Don't beat yourself up so much. You have to start setting clear boundaries of what you really own: that is product vision and strategy.",
          "score": 1,
          "created_utc": "2026-02-26 21:12:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7l3h2p",
          "author": "SuspiciousChip7756",
          "text": "I think you are being dragged to every possible direction. As majority of the comments saying that it's not your responsibility to give the technical requirements, it depends on the org to org. \n\nI used to do the designing, sales, EM, and Testing as well. So it's a nightmare. \n\nJust few things that can help you figure out the things  \n  \n\\- Do you have a sprints? if Yes, do you track the velocity and respect the deliveries?  \n\\- Does your VP or Leads have any understanding of PO role or PM role?  \n\\- If all the devs are getting blocked, what is it they are delivering?\n\nI don't think you can solve all of these at once. Try doing some of these  \n\\- scope yourself for the next couple of sprint, which means reduce the tickets and ticket sizes for next couple of sprints  \n\\- Once you prepare the requirements, post discussion, send a mail to each to revert back if they have any issues and estimates(put it in written)  \n\\- Give a heads up to your VP that you got the approval from your dev, again a written communication  \n\\- Once sprint starts, you prepare for next sprint\n\nmore than anything one thing I would suggest you is reduce the number of meetings with devs. \n\n  \n",
          "score": 1,
          "created_utc": "2026-02-26 21:13:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7lbne7",
              "author": "Apprehensive_Dot3064",
              "text": "1. We have sprints and track velocity.  We miss all targets and never hit deliveries.\n\n2. No\n\n3. Nothing, hence the problem.  \n\nThe problem is, if I don’t meet with devs, they simply stop working.  And then I’m blamed.",
              "score": 1,
              "created_utc": "2026-02-26 21:52:44",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7l63kk",
          "author": "Internal-Alfalfa-829",
          "text": "Where is your Scrum Master? It's part of their responsibilities to help you overcome this.",
          "score": 1,
          "created_utc": "2026-02-26 21:26:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7lbxtr",
              "author": "Apprehensive_Dot3064",
              "text": "No scrum master has been hired, there’s no budget for the role",
              "score": 1,
              "created_utc": "2026-02-26 21:54:08",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7lgq7x",
                  "author": "Internal-Alfalfa-829",
                  "text": "I'd argue that the damage caused by this situation eats up a lot more budget than 60-70k EUR (Central Europe, US is likely higher) for a Scrum Master would. But companies love wasting a lot of money just to avoid spending a little bit of it.\n\nIn that case I recommend you take a few hundred bucks and get yourself trained up as a Scrum Master. Online course from [Scrum.org](http://Scrum.org) is pretty ok and not too hard to get the cert while you're at it. Or you buy a full 2-day training for a weekend, which is about 1.5k EUR/USD. Either way, stick to a training provider that is approved by Scrum. org or the Scrum Alliance, if you don't buy from them directly. Don't get a knockoff of unknow quality from a random on Udemy. The one I had almost caused me to fail when I would have had more correct answers without him - he injected too much of his own opinion.\n\nThis will give you a good new perspective and some tools and mindsets. Whether you get them to open up or not, you will be increasing your own value no matter what. Especially in case this turns into you looking for a different company.",
                  "score": 1,
                  "created_utc": "2026-02-26 22:17:40",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7lh4ra",
          "author": "CautiousCactusCat",
          "text": "You seriously need to establish a RACI chart and get leadership support. If they remain toxic about it, GTFO.  I’m a PO and actually capable of coding and designing. I still don’t give them any technical solutions or feedback. It’s the engineering team for coming up with a technical solution to a business problem. If they’re demanding stupid things like column width and whatever, get a UI expert involved to specify. At most, I use ppt to make up some mockups. \n\nThe PO role really does suck though. It’s the person who gets caught in all the crossfires because they are the “owners” of the success and failures. I’m expected to be a project manager on top of all the PM activities.",
          "score": 1,
          "created_utc": "2026-02-26 22:19:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7lkfvn",
              "author": "Apprehensive_Dot3064",
              "text": "We have a UI expert, but…as you’d imagine, they are unresponsive, or require extreme direction.\n\nIf a dev asked the UI expert about column width, the UI expert would either come ask me or specify something like “make every column page width and do a long horizontal scroll”.",
              "score": 1,
              "created_utc": "2026-02-26 22:36:17",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7lo27o",
                  "author": "CautiousCactusCat",
                  "text": "[ Removed by Reddit ]",
                  "score": 1,
                  "created_utc": "2026-02-26 22:54:57",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7lkmjb",
          "author": "Shferitz",
          "text": "Honestly it sounds like your devs aren’t cut out for their job.",
          "score": 1,
          "created_utc": "2026-02-26 22:37:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7lpm8i",
          "author": "kate_the_squirrel",
          "text": "I’m not a product owner but I do supervise a team of business analysts who are responsible for system requirements and work with a dev team. We are always careful NOT to provide too much direction on technical implementation because that is the responsibility of the dev team. You are there to determine how the system functions, but they are there to build it using their technical expertise. I really feel like your organization is pushing for you to take on responsibilities outside the scope of your role, and that your devs and their management are slacking and/or lack skill and are trying to pin their performance issues on you. Frankly, I would look for other opportunities. I think you would be perfectly happy/successful as a product owner in a place where expectations are standard for the industry.",
          "score": 1,
          "created_utc": "2026-02-26 23:03:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7lrtwt",
          "author": "lunivore",
          "text": "Scrum, and the role of the Product Owner, were originally created in a time when the Product folks just didn't get to talk to the devs about what it was they wanted. At all!\n\nAnd some people worked out that if you put someone who really wants something in a room with some technical people who can make it, magic happens.\n\nThe person who really, really wants the thing - who fought for it, got it prioritized ahead of 12 other people wanting their pet project to shine, who safeguarded the budget and persuaded the board it was important - they're the Product Owner. But in a larger enterprise they're usually too busy to spend time with the team (let alone 12 of them) so someone else acts as their proxy with the teams, communicating their vision and helping the teams work out what that looks like as best they can.\n\nLet me break down what that looks like.\n\n* My requirements are never specific enough.\n\nNobody's requirements are *ever* specific enough. You are a human being with limited time, attention, memory and focus. The dev team are human beings too. Every team which has tried to focus on making requirements super-specific has ended up creating an lot of documents (or JIRA tickets) that end up in the bin. This is what the Lean / Kanban folks call \"waste\". It doesn't contribute to the end goal. It is not getting anyone closer to the work being done.\n\nYour job is not to be super-specific. It's to communicate the *intent*.\n\nEver seen the film \"Fury\"? It's about a bunch of army guys holding a crossroads with a tank. The reason they do it is because they know *why* and they know why it's important. That's what you need to do. Then you can say \"I think a tank might work, what do you think?\" and you have a conversation about how that might fall out. If you've got some really great UX people use them, but if you haven't, treat everything as an experiment. In software development, if the tank blows up, we just roll it back (this does not include things which are not safe to fail like data integrity or security, so seek out *experts* for those).\n\nI recommend reading \"Turn the Ship Around\" - it's a very small book, very easy read, wish I had read it sooner.\n\n* Failed to technically mentor the devs.\n\nNot your job. Your job is to explain the *problem* clearly, not to come up with *solutions*. There are other more senior devs for that. Focus on the problem space. Explain why it's important, provide realistic (preferably real) examples of the problem, listen to the compromises the devs ask you to make.\n\n* I’ve failed at estimating work.\n\nYeah, we've all been there. 30 years in the industry now and still not much better at it than when I started. The only thing we learn from estimating over the years is that we all suck at it. It's OK. Also, estimating depends mostly on how the solution needs to work, and...\n\n* I fail to prioritize appropriately... I poorly direct the devs on backend order.\n\nPrioritize the *problems* and the context in which the problems need to be solved. Got 15 countries to ship to in 7 different languages? Focus on the first of those. Got 6 situations in which you cannot possibly say \"yes\"? Focus on saying \"yes\" to the narrowest, safest context and add the other rules in as you go. Let the devs worry about what's back-end and what's front-end.\n\nIt could be that you're expected to be a technical analyst, and if that's your job then by all means worry about front vs backend, data integrity, security, microservices, etc. and you might well decide to go back to being a domain expert. I wouldn't blame you.\n\nBut if your job is genuinely to represent the people who fought to get the large-scale problem on the table and funded, *that's* the job of a Product Owner, and the devs should be helping you with it.\n\nI will say that I'm not a fan of Scrum (where the Product Owner role comes from), mostly because it lends itself too easily to being done really, really badly. But one thing it does do well is make the team *one team*, collaborating to solve a problem. If that's not where you are, it's not Scrum.\n\nMaybe some of the above will help you have conversations to clarify what your role really is. Wishing you luck regardless.",
          "score": 1,
          "created_utc": "2026-02-26 23:15:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7lw0kk",
          "author": "hofo",
          "text": "It sounds to me like you are doing a lot more than just product owner. PO should say what they want, the devs are supposed to estimate work, an architect is supposed to design a technical implementation that fulfills your requirements. PO isn’t supposed to do everything.",
          "score": 1,
          "created_utc": "2026-02-26 23:38:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7m3mf7",
          "author": "Forgot-pas",
          "text": "As a product owner you will need to define the ask as clearly as possible. The ask in an Epic should capture the function, the data source, the necessary integrations, the mvp, defining exact outcomes, the existing business rules. The tech time will then scope, estimate and write out the stories, acceptance criteria’s, the test cases to the last minute detail. There will be gaps but we address them as we go. Product owner doesn’t need to get into estimation (other than tee shirt sizing), and drafting technical solution but should have clarity on the outcome of the solution. \nOnce the epics are written out - you can prioritize and allocate based on the impact and size of the ask. Your knowledge about database systems will not help as the tech teams already have the expertise. They are looking for clarity in your vision to be communicated to the last detail. \nBe very clear about what your role is in the organization else it will lead you to feeling inadequate and underperforming.",
          "score": 1,
          "created_utc": "2026-02-27 00:20:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7mh8ky",
          "author": "m915",
          "text": "That’s wild, the PO I worked with was basically a scrum master who defined high level deliverables",
          "score": 1,
          "created_utc": "2026-02-27 01:37:22",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rbnmct",
      "title": "Dev who wants to transition into PO",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1rbnmct/dev_who_wants_to_transition_into_po/",
      "author": "Ok_Piano_420",
      "created_utc": "2026-02-22 14:45:49",
      "score": 9,
      "num_comments": 19,
      "upvote_ratio": 0.81,
      "text": "Hey all,\n\nI’m at a bit of a career crossroads and would really appreciate some perspective from people who’ve made a similar move.\n\nI’ve got ~10 YOE since getting my CS degree. Mostly worked as an Android dev. But also during 2020-2021 spent 2 years running my own gaming server company, which did pretty well.\n\nTechnically I’m more of a generalist / mid-level dev. But over the past couple of years I’ve realized that I create way more value (and get way more satisfaction) doing PO / Scrum Master type work than actually coding.\n\nStuff like prioritizing. Clarifying requirements. Aligning business + devs. Making tradeoffs. Shipping. Strategizing. That energizes me way more than debating architecture or watching dev colleagues overengineer stuff for tiny gains...\n\nI’m seriously considering transitioning full-time into a Product Owner role. Long-term goal would be PM / EM, maybe even CTO someday.\n\nI know that probably means taking around ~40% pay cut, starting as junior/mid PO, proving myself all over again and etc. I’m okay with that. I’d even intern for free for a bit if that's what it would take. \n\nMy issue is positioning. I’ve done PO-ish responsibilities. I’ve run a business. I understand tech and stakeholders. But I’ve never officially held the “Product Owner” title.\n\nHow do I avoid looking like “dev who’s bored of coding” and instead come across as legit PO material?\n\nIs getting something like PSPO from Scrum.org worth it?\n\nFor devs who transitioned — how did you land your first role?\n\nAny red flags I should watch for when joining a company as a PO?\n\nWould really appreciate any tips.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1rbnmct/dev_who_wants_to_transition_into_po/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o6s2og1",
          "author": "MavicMini_NI",
          "text": "For me, to be a successful PO, irrespective of your background, you need to have the correct mentality. We interview a lot of Engineers who want to transition, and if you do not have the correct mindset, its an uphill battle.\n\nYou need to understand first and foremost, what is the problem the user/customer/stakeholder is having. Do they themselves even understand what the problem is. How do you then prioritize what problem to focus on, and once thats understood, how do you agree or identify an appropriate Outcome to aim towards, and how will this be measured (KPIs etc) - this speaks to your ability to work through a Discovery and Framing session appropriately and sets the scene for what comes next.\n\nOnce these are known, you can then start to incept your backlog, and create actual user stories, NOT technical requirements\n\nToo many Devs who become a PO cannot relinquish technical control, and keep dictating to teams a singular solution based around requirements, rather than user stories. Your role is to act as the voice of the customer, and translate their problems into Stories (or Spikes). Its then up to your engineers to identify a way they feel best meets the Acceptance Criteria to deliver usable value to a user quickly, and get feedback as often as possible.",
          "score": 6,
          "created_utc": "2026-02-22 14:54:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6s8x9d",
              "author": "theproductref",
              "text": "I second the call on relinquishing technical control. It is helpful to understand enough of the technical to spot where there is a miscommunication between product and dev, but how something is built is the devs call. You’ll have to bite your tongue.\n\nI went to school to be a dev, started in test, then went into product.\n\nTo be successful in product you really need to be good at a lot of soft skills, which many devs don’t. Heck a lot of devs I know like that they can do their job without interfacing with other people.\n\nCheckout this medium article that has sample questions for a PO interview and think how you’d respond, and if this is part of the job that you are okay with doing: https://medium.com/the-product-ref/how-to-find-a-top-notch-product-owner-6a42eaa3b45a",
              "score": 2,
              "created_utc": "2026-02-22 15:25:35",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o6s4f4a",
              "author": "Ok_Piano_420",
              "text": "From my pov another important thing is that PO should understand the product flows in and out. Because I've seen multiple times PO's acting more like dreamers, coming up with very abstract use cases which led to abstract designs that seemed to have been built basically in a vacuum, not taking into account how product operates and so on. Heck devs even had to estimate spikes without any designs ready based on abstract use cases alone. In such cases us devs had to step in often and basically perform proper discovery, define AC and requirements ourselves, because our PO seemed to perform more of PM/Scrum master duties instead of u know, PO.\n\nMaybe I'm wrong, but best PO's I ever worked with would give me ready tickets to work on, with figma sketch, backend contracts and all scenarios (use cases) ready, and if I ever had a doubt or a question the required info was a quick 5min call away, instead of me as a dev having to reverse engineer business decisions or drive communication with 3 other teams myself.",
              "score": 1,
              "created_utc": "2026-02-22 15:03:00",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6s9rjd",
          "author": "agileliecom",
          "text": "Honestly you're already more qualified than half the POs I've worked with in 25 years. You've run an actual business, you understand the tech side, and the stuff you listed that energizes you is literally the job. Most POs I've seen came from business analyst roles and have never shipped anything in their lives.\n\nThe PSPO, look I'm not gonna tell you certifications are useless because they do get you past HR filters. But be real about what it is. You're paying $200 for a keyword on your resume. The actual material is a few pages. It won't teach you anything you don't already know from running a gaming server company that actually made money. That experience is worth ten times the cert.\n\nThe \"dev who's bored of coding\" thing, flip it. You're not a dev who's bored. You're a dev who realized he creates more value on the product side and has the technical background to actually understand what the team is building. That's rare. Most POs write user stories and have no idea what's technically feasible. You do. That's your entire pitch.\n\nRed flags when joining as PO: if the company already has a \"product committee\" or \"stakeholder board\" that makes all the real decisions, you're not a PO, you're a ticket writer. Ask in interviews who actually decides what gets built. If the answer is vague you have your answer.\n\nSkip the free intern thing. You ran a business, charge what you're worth.",
          "score": 2,
          "created_utc": "2026-02-22 15:29:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6s3g2w",
          "author": "Nearby-Habit5468",
          "text": "Check out forward deployed engineer and product engineer type roles, those hybrid roles lend itself well to strong dev and product skills. They are also rapidly growing roles in high demand. The future of tech is skewing towards hands on builders, especially as AI is automating so much knowledge work. \n\nOtherwise you can just change your last role title on your resume, to make it look like you already transitioned and it’s easier for recruiters and hiring managers to consider you. In this hiring environment, it’s hard for decision makers to take the risk on someone doing a career transition. So you gotta give them confidence that it’s already how you have been operating. Keep in mind it’s your resume, you can highlight your skills and title to best align with your next career goals. Don’t worry about being too literal. I had obscure job titles that are uncommon, so I put the next closest title that aligned to my target title. Don’t out right lie, but a bit of marketing goes a long way. \n\nI did something similar but I went from product to engineer, and I only got traction once I tweaked my profile accordingly.",
          "score": 1,
          "created_utc": "2026-02-22 14:58:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6s9rri",
          "author": "Forgot-pas",
          "text": "Dev transitioning into PO role can be the much needed voice of reason for PM sometimes.",
          "score": 1,
          "created_utc": "2026-02-22 15:29:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6uiel6",
          "author": "lift_spin_d",
          "text": "> 10 YOE. call myself a mid level dev.\n\nI feel your pain\n\n> get way more satisfaction doing PO / Scrum Master type work.\n\nAm there\n\n> That energizes me way more than debating architecture.\n\nYup.\n\n> I’m seriously considering transitioning full-time into a Product Owner role.\n\nYeah I got a CSM and my company expects me to act like a PO.\n\n> I know that probably means taking around ~40% pay cut.\n\nYeah... (economic) means. you gotta be able to take the hit. Emotio-personally too, I work with people smarter than me (straight up PhDs) who can't use styles in Word to save their life. I had a PhD team member just this past week ask \"what is a landing page?\"\n\n> I’d even intern for free for a bit if that's what it would take.\n\ninsert fuck all that meme.\n\n> But I’ve never officially held the “Product Owner” title.\n\nYes you have.\n\n> How do I avoid looking like “dev who’s bored of coding” and instead come across as legit PO material?\n\nFuck what people think.\n\n> For devs who transitioned — how did you land your first role?\n\nI was a hybrid who coded and managed international teams. Just put that shit on <projectManagementSoftwareName>. Current role is hybrid who manages all-local teams + 1 person in Mexico. \n\n> Any red flags I should watch for when joining a company as a PO?\n\nOhhpf. Sorry to be sarcastic but yeah, you should watch for all the red flags. Too many to list.",
          "score": 1,
          "created_utc": "2026-02-22 21:51:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o71n3e9",
          "author": "SamfromLucidSoftware",
          "text": "Get an example from your work that already looks like PO work. Put it into a one page story for your resume & interviews. Start with what the problem was, then what you decided, what shipped, what changed after etc. \n\nPSPO is optional. Only do it if you need the keyword for filters. \n\nWhen you interview, ask who owns priority & who talks to users. If it is just ticket routing with no real decisions, I would pass.",
          "score": 1,
          "created_utc": "2026-02-23 23:50:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6u441f",
          "author": "BoringChess",
          "text": "Do you really think that PO roles and Scrum are going to survive? A series of roles and a methodology all created in the 90s and early 2000s. It is 2026 and already lots of companies have software engineers writing 0 code. The processes and roles that made sense in a world where writing features and prototyping ideas was costly are all at the most risk imo. Every company is going to have to adapt or die.\n\nMy overwhelming advice is forget about changing role and focus on getting very good with agents, and quickly. Lead the change in your org. Be ahead of the pack. You may just survive and even rise to the top. This is the moment in a career that you can really move to the places you want to be, if you step up and face it head on.",
          "score": 0,
          "created_utc": "2026-02-22 20:39:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6u58x1",
              "author": "Ok_Piano_420",
              "text": "Imo it doesnt matter how the role will be called. PO, PM, SM, Delivery Manager, Lead Engineer, or even CTO for that matter (depending on the company size) will have similar responsibilites. Someone competent to bridge business and tech will always be necessary.",
              "score": 2,
              "created_utc": "2026-02-22 20:45:32",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6u66i2",
                  "author": "BoringChess",
                  "text": "Absolutely. So why would you pivot into being a PO on less money when the modern engineering role is doing the same work for…more money? With more allowance to actually not just ideate but take ideas from concept to prod with autonomy? Sounds like a huge step down to me. When pretty much all of the bad parts about software engineering just got fixed…",
                  "score": 1,
                  "created_utc": "2026-02-22 20:50:16",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6tchuw",
          "author": "EngineerFeverDreams",
          "text": "Scrum is dying rapidly. You're a fool to jump on that train now.",
          "score": -1,
          "created_utc": "2026-02-22 18:25:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6tdjt6",
              "author": "Ok_Piano_420",
              "text": "Why? There are like 100+ open job positions in my city alone.",
              "score": 2,
              "created_utc": "2026-02-22 18:30:07",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6te4rc",
                  "author": "EngineerFeverDreams",
                  "text": "Do you live in India?",
                  "score": -1,
                  "created_utc": "2026-02-22 18:32:47",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1r9r2s4",
      "title": "Tested 6 backlog management tools - my results",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1r9r2s4/tested_6_backlog_management_tools_my_results/",
      "author": "vitaminZaman",
      "created_utc": "2026-02-20 09:42:37",
      "score": 9,
      "num_comments": 14,
      "upvote_ratio": 0.91,
      "text": "Work in a mid-size product org with 3 dev squads, a growing remote workforce, and a small PM team. We did an eval between six backlog tools; \n\n* ClickUp, \n* Productboard, \n* Confluence, \n* Yodiz, \n* Trello, and \n* Jira, earlier this year.\n\nPerformance differences were minor. Honestly, the only thing that really stood out was how each option handled sprint visibility, roadmap traceability, and stakeholder-facing views. Jira won for us on depth of issue tracking and how well it fit into our existing dev toolchain.\n\nOur eval doc ballooned into a 22 page doc. How others kept their evaluations focused without going in circles.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1r9r2s4/tested_6_backlog_management_tools_my_results/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o6ehpnd",
          "author": "lucina_scott",
          "text": "We’ve been there what helped us was defining 3–5 non-negotiable criteria upfront (e.g., sprint visibility, integrations, reporting) and scoring only against those.\n\nAnything outside that list went into a “nice-to-have” bucket so the eval didn’t spiral into endless edge cases.",
          "score": 4,
          "created_utc": "2026-02-20 11:00:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6g180v",
          "author": "Firerage65",
          "text": "Peeps hate Jira but I am honestly a big fan. Its ugly but it works. What was no.2 for you out of interest?",
          "score": 2,
          "created_utc": "2026-02-20 16:20:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6ku8yx",
              "author": "ScrumViking",
              "text": "Jira deep at its core is still a ticketing system. They took over and implemented greenhopper to have visual Kanban lanes and introduce some elements you might know from scrum but it never was designed to be a tool that accelerates what agile teams do.",
              "score": 1,
              "created_utc": "2026-02-21 10:00:15",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6y1imr",
                  "author": "Firerage65",
                  "text": "yeah but it can configured into oblivion which makes it work as an agile tool as well (imho) ",
                  "score": 1,
                  "created_utc": "2026-02-23 13:07:42",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6kxmsz",
          "author": "CaptainMack90",
          "text": "Try evaluating Linear",
          "score": 1,
          "created_utc": "2026-02-21 10:33:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6kyrvx",
          "author": "bbc00per",
          "text": "Agile Tools (https://agile-tools.io) has a self-cleaning and item-limited backlog mechanics. Note: website overhaul coming soon. You can model your work around so-called Value Units. Not just a flat list of projects, but a hierarchy of products, services, projects, anything your company uses - the tool is not imposing a vocabulary. Each Value Unit has a precreated backlog and a workboard. Pull over push mentality, goal and team first model. Lot more coming. Feedback welcome. 🙏",
          "score": 1,
          "created_utc": "2026-02-21 10:44:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6tws1x",
          "author": "woodnoob76",
          "text": "It sound like we’re mixing up tools and practices. I’m an old timer agilist, I’ll match Jira and else with basic tools any day \n- Google sheet or any spreadsheet for the backlog, velocity or cumulative flow charts including roadmap projections\n- maybe Gmail or any thread based communication for keeping track of the definition and acceptance criteria on each story (remember that we make some doc and throw the story away, right? It’s volatile)\n\n\nAs for sprint visibility: who cares, have short releases (6 weeks max give or take) and use it as a baseline for evaluating progress\n-  a visual board (can even be a love page of PowerPoi) for story map management and drawing the roadmap \n- whatever comes for Kanban (trello or any kanban tool, or any drawing system like ppt, Miro, whatever)",
          "score": 1,
          "created_utc": "2026-02-22 20:02:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6xgkzg",
          "author": "Murky_Cow_2555",
          "text": "When tools perform similarly, evals spiral because you’re debating small differences.\n\nLock 4–5 weighted criteria before testing and ignore everything else. Then run short real pilots, actual usage reveals more than feature lists.\n\nSometimes teams even choose simpler setups, I’ve seen cases with tools like Teamhood, when they realize they need clarity and low overhead, not maximum configurability. The key is deciding what problem you’re actually solving.",
          "score": 1,
          "created_utc": "2026-02-23 10:17:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o741kca",
          "author": "hardikrspl",
          "text": "22 pages sounds about right 😅 backlog tools expand fast because you’re really evaluating workflow philosophy, not just features.\n\nWhat’s helped us avoid going in circles is defining 3 non negotiables before testing anything. For example: sprint visibility for engineers, roadmap clarity for leadership, and minimal admin overhead for PMs. If a tool doesn’t clearly win on at least two, it’s out. That keeps debates shorter.\n\nAlso, instead of feature scoring everything, we run one real sprint inside each shortlisted tool. Not a demo board, an actual sprint with real tickets and stakeholders looking at it. The friction shows up fast.\n\nJira often wins in dev heavy orgs because of depth, but I’ve seen lighter setups work well in PM tools like 5day when teams care more about execution clarity than heavy issue taxonomy. It really comes down to how much process weight your squads actually need versus how much they’ve just inherited.",
          "score": 1,
          "created_utc": "2026-02-24 10:10:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7k5tm5",
          "author": "SeaworthinessPast896",
          "text": "All of these suck in my opinion, and I know I use the Jira so frequently picked. If I had a choice I'd only look for the new tools coming through. You guys are small enough, you don't need anything super heavy. All these tools start easy, but then you'll drown soon - just a big mousetrap.\n\nTrello is an exception, but trello won't give you cross team visiblity. On the other hand, neither will other tools.",
          "score": 1,
          "created_utc": "2026-02-26 18:34:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6enor7",
          "author": "Bowmolo",
          "text": "Interesting perspective.\n\nI'd never consider 'backlog management' to be a thing. I actually wouldn't want to manage a backlog at all. What I would prefer to manage is a continuous, ever improving flow of (potential) value to customers (or however one likes to call beneficiaries).\n\nI find the focus on managing a inventory of (more or less valuable) ideas instead of exploration of options to be a dysfunctional mental model. \n\nBut ok, I'm not a PM. So I may be wrong.",
          "score": 1,
          "created_utc": "2026-02-20 11:49:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6fn5ws",
              "author": "theproductref",
              "text": "That is something you also manage, it’s just a higher level. Your opportunity backlog is where you have your roadmap, which is what you are describing. In order to take this idea to reality, you have to decompose that flowing value into something more concrete that can be built in a semi managed way that brings iterative value. That is your sprint backlog, which is what Jira and other tools here are for",
              "score": 1,
              "created_utc": "2026-02-20 15:14:13",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1rdmfq4",
      "title": "Agile 2026",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1rdmfq4/agile_2026/",
      "author": "MCMcGreevy",
      "created_utc": "2026-02-24 17:22:50",
      "score": 8,
      "num_comments": 16,
      "upvote_ratio": 0.76,
      "text": "Agile 2026 has been announced and the page has been on the Agile Alliance site since the conference in Denver last year, but I have seen absolutely nothing about it since then. In past years, tickets would have gone on sale back in December and we'd be out of the early-bird pricing by now, but so far there is no information on tickets or hotels.\n\nDoes anyone have any insight into if the event is even happening?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1rdmfq4/agile_2026/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o7671iy",
          "author": "UKS1977",
          "text": "If it is, it will be nearly the last. PMI now own the Alliance and want to pull the AA products to align with theirs. So I expect if not this year then next it will be aligned with theirs PMI summit. \n\nIn fact checking the website - it is now a PMI summit. \n\nI know the AA signed some pretty strict contracts on locations quite far in advance, so they couldn't/haven't be able to cancel them. I do not know how close they've got to those deals running out. I *thought* last year was the last one under that contract but could be wrong. \n\nI do suspect the content will all be aligned/curated/planned by PMI and aligned (I imagine) with the new agile manifesto the PMI are launching in a couple of weeks.",
          "score": 6,
          "created_utc": "2026-02-24 17:33:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o76agcw",
              "author": "Dsan_Dk",
              "text": "Wauw, getting happier and happier that I'm not in agile alliance in anyway, from this.",
              "score": 3,
              "created_utc": "2026-02-24 17:48:52",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o76hd5y",
          "author": "Consistent_Voice_732",
          "text": "I've been budgeting for it like usual but without dates or pricing it's hard to plan curious if anyone from agile alliance can share an update",
          "score": 1,
          "created_utc": "2026-02-24 18:19:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7dxbyw",
          "author": "WideFunction6166",
          "text": "[https://agilealliance.org/event/pmi-agile-2026/](https://agilealliance.org/event/pmi-agile-2026/)",
          "score": 1,
          "created_utc": "2026-02-25 20:00:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7f7xjj",
              "author": "MCMcGreevy",
              "text": "That is the page I was referring to in my original post. There is no information about tickets or how to reserve a hotel.",
              "score": 1,
              "created_utc": "2026-02-25 23:49:20",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7fd7b6",
                  "author": "WideFunction6166",
                  "text": "Looks like they added a way to get newsletter",
                  "score": 1,
                  "created_utc": "2026-02-26 00:18:27",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o76iw8e",
          "author": "CleverNameThing",
          "text": "I'd rather see Ken Schwaber and [Scrum.org](http://Scrum.org) be the mouthpiece for agility over AA anyway (yes, I mean alcoholics anonymous, lol).",
          "score": 1,
          "created_utc": "2026-02-24 18:26:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o76sb52",
              "author": "UKS1977",
              "text": "Well Ken got kind of thrown out the Agile Alliance! He formed it but wanted to use it as a vessel to do certification, which many of the other founders (being of that homebrew and self learned ilk) disliked as a fundamental concept. So much so, this idea of \"no certification\" was baked into the DNA of the Agile Alliance.\n\nSo he founded the Scrum Alliance with Mike Cohn and Esther Derby to do certification. Mike and Esther agreed as long as it was a non-profit and not a money making scheme.\n\nKen agreed.\n\nA few  years later, Ken was \"asked to leave\" the Scrum alliance due to something irregular that no one \\*publicly\\* speaks about. Ken spun this as some noble sacrifice and him leaving due to these awful other people. I have heard it was more prosaic and base then that. \n\nAnd then he set up Scrum.org. A private business dedicated to making Ken money. Of which it has made him millions. Remember he owns the PSM test himself and receives all the revenue from it directly. \n\nI have known Ken a long time. He is a hard man to like. He made a great post about his behaviour, a few years ago - [https://kenschwaber.wordpress.com/2012/01/02/i-was-thinking/](https://kenschwaber.wordpress.com/2012/01/02/i-was-thinking/)\n\nI hundred percent respect him - and am very aligned philosophically with him - But he is no man to idolise. \n\n  \n",
              "score": 9,
              "created_utc": "2026-02-24 19:07:49",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o76w7ny",
                  "author": "CleverNameThing",
                  "text": "Interesting stuff!  Thanks for the backstory.",
                  "score": 2,
                  "created_utc": "2026-02-24 19:25:38",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o79elzk",
                  "author": "cliffberg",
                  "text": "Circa 2002 a colleague of mine took Schwaber's Scrum course. Schwaber told her that he \"knew nothing about organizations\".\n\nThe reality is that Scrum was all about making money from the start. Here is something else that one of them sells: [https://www.frequencyfoundation.com/about-us/](https://www.frequencyfoundation.com/about-us/)",
                  "score": -2,
                  "created_utc": "2026-02-25 03:08:48",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1rca834",
      "title": "Any Product Managers using tools like Lovable, bolt, claude or any ai tools?",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1rca834/any_product_managers_using_tools_like_lovable/",
      "author": "Busy_Cartoonist3724",
      "created_utc": "2026-02-23 06:41:00",
      "score": 5,
      "num_comments": 15,
      "upvote_ratio": 0.65,
      "text": "I work in a SaaS company, and I’ve been exploring different tools to help organize to find ai product. I’ve tried turning Epics and feature ideas into interactive workflows or small prototypes using tools like Lovable, and it’s made me wonder is this a practical way to share concepts with the team?\n\nI’d love to hear from other PMs what tools do you use to make your ideas tangible and easier for your team to act on?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1rca834/any_product_managers_using_tools_like_lovable/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o6x57od",
          "author": "squigfried",
          "text": "They're all very different. I would avoid the \"full app build\" tools like Lovable for any sort of prototyping, sticking to things that are lighter and don't result in anything that could be misconstrued as production-ready.\n\nClaude is the heavyweight but very much \"power user\" territory.\n\nThe sweet spot for prototyping are Google's tools. Nano banana for image/UI generation, Gemini Pro as a sounding board and expert consultant, and Google AI Studio for small coded interactive prototypes/apps.\n\nUsing Gemini to explore ideas and critique requirements, image generation to envisage designs or themes, and AI Studio if there's a need to explain/experiment with something more interactive.",
          "score": 7,
          "created_utc": "2026-02-23 08:25:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o731oxy",
              "author": "Busy_Cartoonist3724",
              "text": "That’s a really thoughtful breakdown especially the point about avoiding prototypes that look production ready. I can see how that can create confusion or false expectations.\n\nI like your idea of using Gemini more as a thinking partner rather than a builder. That framing actually helps a lot.\n\nBy the way, i need a small help from you I sent you a small DM would really appreciate if you could check it when you get a moment",
              "score": 1,
              "created_utc": "2026-02-24 04:54:22",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o73s4q5",
                  "author": "squigfried",
                  "text": "That \"small DM\" was trying to sell me something. I don't appreciate that, and you are an AI.\n\nLoathsome.",
                  "score": 3,
                  "created_utc": "2026-02-24 08:40:37",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6wwru6",
          "author": "Lordvonundzu",
          "text": "Never having used those tools myself yet, I think using Vibe coding \"only\" for concept presentation and getting people on board is a better and more sane and future proof approach than assuming you can now be the jack of all trades developer. \n\nStill, it kinda depends who you're pitching an idea to. Users, non-technical people, who are normally not part of the development process? Then it might be helpful. \n\nDevelopers? Let me put it this way: As PM you've always had to be able to convince Devs, what's more important is your narrative etc. Before you would have used mock-ups from UX. Devs are used to more abstract presentation of concepts, I'm not convinced it's needed there? \n\nSo overall I like the playfulness of it, but ... Idk, but as PM I myself have found AI tools more useful as thinking partner (eg die the creation of said narratives, etc.)",
          "score": 5,
          "created_utc": "2026-02-23 07:05:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6x2r0q",
              "author": "Busy_Cartoonist3724",
              "text": "Absolutely, that makes a lot of sense. Using AI as a thinking partner to refine narratives and structure concepts feels much more valuable than just generating code. It’s about enhancing your process, not replacing the collaboration or creativity that developers bring. The “playful” side is nice, but the real win is clarity and alignment across the team.",
              "score": 2,
              "created_utc": "2026-02-23 08:01:45",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6xeqqg",
          "author": "Accomplished_Buy1055",
          "text": "As I don't have an ui/ux team member, I use Google AI Studio to create mock-ups of features I want.\n\nFor example, want a toggle button to switch from lined to cards? Just save your current page in html, paste it into Google AI Studio and ask it for the feature, then you have a fully working and high fidelity mock-up to guide the development team.\n\nDefinitely useful.",
          "score": 4,
          "created_utc": "2026-02-23 10:00:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o735e4g",
              "author": "Busy_Cartoonist3724",
              "text": "That’s actually a smart way to use it especially saving the HTML and iterating directly on something real instead of starting from scratch. Makes it much easier for devs to understand intent.\n\nSounds like a very practical workflow when you don’t have a dedicated UI/UX resource.\n\nAre you also using any AI tools for code generation itself, or mainly keeping it at the mock-up and concept level?",
              "score": 2,
              "created_utc": "2026-02-24 05:21:42",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7eyg7x",
                  "author": "Accomplished_Buy1055",
                  "text": "Thanks! Indeed it does help!\n\nAnd yes! I was using GitHub Copilot to create tickets, it's pretty good as it has the codebase context and is able to help the devs with technical aspect of it. They liked it! Can make refinement a lot easier as the starting point is already there!",
                  "score": 1,
                  "created_utc": "2026-02-25 22:57:45",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6ziegn",
          "author": "Consistent_Voice_732",
          "text": "Even small interactive workflows make concepts tangible- AI tools just speed up drafting and iteration",
          "score": 2,
          "created_utc": "2026-02-23 17:36:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o73k9d8",
          "author": "zero-qro",
          "text": "Since I have a development background I've being using Google Antigravity + Claude Opus for prototyping ideas and user flows and it has been incredibly useful.\nWay easier and faster for me to convey ideas and iterate over it.",
          "score": 2,
          "created_utc": "2026-02-24 07:26:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7h7sis",
              "author": "Busy_Cartoonist3724",
              "text": "That’s awesome If you’re looking to take your prototypes further, you might want to try Brunelly. It goes beyond idea generation and prototyping turning your specs into fully structured, deployable apps while handling quality and reducing rework.",
              "score": 1,
              "created_utc": "2026-02-26 07:35:37",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7j0wk5",
          "author": "Ancient-Ad-2507",
          "text": "As a PM, I mostly use AI for deck creation. Plus AI builds native PowerPoint slides inside the app. That means no exporting or workflow changes. I use it for sprint reviews and planning decks. Everything stays editable. It saves a lot of repetitive work.",
          "score": 1,
          "created_utc": "2026-02-26 15:26:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6yci9e",
          "author": "Necessary_Cable_1883",
          "text": "I replaced the user stories with vibe coded prototypes. ",
          "score": 1,
          "created_utc": "2026-02-23 14:12:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o73elrx",
              "author": "Busy_Cartoonist3724",
              "text": "do you use any tools for code generation",
              "score": 1,
              "created_utc": "2026-02-24 06:36:48",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1rf7iql",
      "title": "How do you define \"agile\"",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1rf7iql/how_do_you_define_agile/",
      "author": "NoBullshitAgile",
      "created_utc": "2026-02-26 11:17:03",
      "score": 4,
      "num_comments": 41,
      "upvote_ratio": 0.61,
      "text": "Hi! \n\nAfter some interesting comments in another thread here I would like to know: How do define \"agile\"?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1rf7iql/how_do_you_define_agile/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o7hvjqb",
          "author": "rcls0053",
          "text": "By being flexible, adjustable. Accept that things will change, and you have to adjust course. It's better to get that feedback early, so you haven't spent too much effort in going the wrong way, which means we show the work early to the customer to get that feedback. Short iterations, early feedback. Then you try to continuously improve your ways of working, by reflecting on how it's gone.",
          "score": 12,
          "created_utc": "2026-02-26 11:18:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7i1xvl",
          "author": "sp3ng",
          "text": "https://agilemanifesto.org/\n\nhttps://agilemanifesto.org/principles.html",
          "score": 12,
          "created_utc": "2026-02-26 12:09:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7kifyf",
              "author": "WaylundLG",
              "text": "This is the right answer. When there is such an easy canonical answer, I don't know why everyone tries to redefine it. I think the problem is that this answer still leaves it with the reader to determine if a particular practice makes them more or less agile and people want a cut and dry answer. I sympathize with their desire to have that clarity, but it's not that kind of question and I think we do a disservice to people when we try to appease them instead of challenge them.",
              "score": 2,
              "created_utc": "2026-02-26 19:33:11",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7m4wct",
                  "author": "sp3ng",
                  "text": "Yep. The manifesto defines values and principles, it doesn't define practices. The values inform the principles, and the principles should inform your team practices. For someone looking for something \"out-of-the-box\" I would generally point to Extreme Programming for a source of practices (and additional principles aligned with the Agile Manifesto). I think the biggest mistake people make though is looking at agile as a project management \"tool\" in separation to the \"software development\" bit. This often leads to frameworks that completely omit the technical practices that are required for agility. Even Scrum could be viewed as just XP with all the technical practices removed.\n\nTest Driven Development (test first), CI/CD (trunk based), pair programming, lightweight review process, feature flagging, continuous refactoring, etc are all a requirement for effective agility. It's funny that the list of practices that predict high performance in the Accelerate research are all straight out of XP.",
                  "score": 2,
                  "created_utc": "2026-02-27 00:27:17",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7hx0ws",
          "author": "ya_rk",
          "text": "The ability to discover when a plan needs to change, and the ability to adapt quickly and cheaply.  \n  \n  \nEach ability in isolation is insufficient",
          "score": 11,
          "created_utc": "2026-02-26 11:31:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7iqx3x",
              "author": "wringtonpete",
              "text": "I like it.\n\nAs I think you're saying, it's when they feel they can make the change themselves, rather than rely on managers to 'lead' them. Otherwise they quite rightly just do the job put in front of them.",
              "score": 3,
              "created_utc": "2026-02-26 14:37:01",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7irq4t",
                  "author": "ya_rk",
                  "text": "Thanks! to be honest i was thinking from whole company perspective, but it certainly can be the case for individuals and teams as well. Though usually their ability to adapt will be constrained by limits placed on them by the org. ",
                  "score": 1,
                  "created_utc": "2026-02-26 14:41:14",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o7izx9a",
              "author": "Ezl",
              "text": "To expand, the ability to build your “planning” around the expectation of change and to intentionally build teams, competencies and processes that are able to adapt without disruption.\n\nSo it’s said, I’m not correcting you at all - just building in what you said because I agree.",
              "score": 2,
              "created_utc": "2026-02-26 15:21:30",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o7jd4u2",
              "author": "CMFETCU",
              "text": "Even more broadly applicable:\n\nThe ability to change rapidly without pain. Pain in process, pain in product, pain anywhere.",
              "score": 1,
              "created_utc": "2026-02-26 16:22:19",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7hz3kp",
          "author": "Agile_Syrup_4422",
          "text": "To me, agile isn’t standups, sprints or Jira boards. It’s the ability to change direction without melting down.\n\nIf new information comes in, customer feedback, technical constraint, market shift, and the team can adapt quickly without political drama or months of re-planning, that’s agile.\n\nIt’s short feedback loops, real ownership and delivering value in small chunks instead of betting everything on a long plan.",
          "score": 6,
          "created_utc": "2026-02-26 11:47:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7ig3ql",
              "author": "NoBullshitAgile",
              "text": "I like!",
              "score": 1,
              "created_utc": "2026-02-26 13:39:13",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7hxaqy",
          "author": "LightPhotographer",
          "text": "Being flexible above sticking to a plan. \n\n  \nA plan is important but it was written with the information you had back then.  When the situation changes and you experience uncertainty, it's logical to stick to the plan - at least that is solid!  But it was only written with the information at the time - it's not gospel, it's not a prophecy and the people back then did not know more than you know now - in fact, the opposite is true.\n\nWelcome change, don't fight it.",
          "score": 3,
          "created_utc": "2026-02-26 11:33:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7hxpha",
          "author": "ckdx_",
          "text": "My organisation defines it as whatever the most recent consultancy tells us it is.",
          "score": 6,
          "created_utc": "2026-02-26 11:36:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7hy240",
              "author": "NoBullshitAgile",
              "text": "Uff... (I know those organisations)",
              "score": 1,
              "created_utc": "2026-02-26 11:39:41",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7hy7nt",
          "author": "PhaseMatch",
          "text": "A lightweight way to manage business risk, by\n\n- making change cheap, easy, fast and safe (no new defects)\n- getting fast feedback from users on the value that change created",
          "score": 2,
          "created_utc": "2026-02-26 11:40:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7i23pp",
          "author": "keithb",
          "text": "By these value judgments:\n* Individuals and interactions are more value than processes and tools, although process and tools are valuable, so build an environment where individuals get to interact and to develop themselves.\n* Working software is the primary measure of value and is more valuable than anything else, including comprehensive documentation, although there are valuable kinds of documentation.\n* Customer collaboration is more valuable than contract negotiation, and that includes _all_ change-control processes, which are pure waste, including ones implemented in Jira.\n* Responding to change is more valuable than following an existing plan, in particular, what \"working\" means for your software will and should change, so plan little and replan often.",
          "score": 2,
          "created_utc": "2026-02-26 12:10:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ih56l",
          "author": "redditreader2020",
          "text": "A great idea defined long ago. Since then totally and completely destroyed by consultancies and corporations.\n\nSo current definition: see micromanagement",
          "score": 2,
          "created_utc": "2026-02-26 13:44:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7imfze",
          "author": "chrisboy49",
          "text": "Its common sense, in a world where common sense is not so common and now neither is the virtue of   \nPatience so......",
          "score": 2,
          "created_utc": "2026-02-26 14:13:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ib3h4",
          "author": "Puzzleheaded-Bug6244",
          "text": "Being agile means having passed several courses and performing certain rituals in a rigid schema. That is the true meaning of being agile.",
          "score": 2,
          "created_utc": "2026-02-26 13:10:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7j02vv",
              "author": "Ezl",
              "text": "🤣\n\nSadly, far too many believe this is the way.",
              "score": 1,
              "created_utc": "2026-02-26 15:22:15",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7i0dy8",
          "author": "Zerodriven",
          "text": "Adapting to change as it comes up. Simple. \n\nThe rest is just methodology and people automatically assume \"scrum\" or \"kanban\". This is just the tooling, it's all mindset and adaptation.",
          "score": 1,
          "created_utc": "2026-02-26 11:57:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7i32yj",
              "author": "NoBullshitAgile",
              "text": "Agreed - I wonder why so many got me in the other thread so wrong",
              "score": 1,
              "created_utc": "2026-02-26 12:17:23",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7ijrwp",
          "author": "SebastianSolidwork",
          "text": "The ideal / theory: What you described in the other thread.\n\nThe sadly often occurring practice: What some describe here. Micromanagement, rituals, certifications.\n\nExternal factors/forces water down the ideal until nothing is left, but phrases and lib service.",
          "score": 1,
          "created_utc": "2026-02-26 13:59:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7iu66z",
          "author": "wringtonpete",
          "text": "I'll go a little off piste and say it's a framework for software engineering based on human nature and evidence rather than spreadsheets and wishful thinking.\n\nBecause of that it needs much more thought to implement, since human relationships are more difficult to nurture than summing columns on a spreadsheet. However when done right it provides much better and more predictable outcomes.",
          "score": 1,
          "created_utc": "2026-02-26 14:53:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7j2dds",
          "author": "Triabolical_",
          "text": "I define it based on the agile manifesto.",
          "score": 1,
          "created_utc": "2026-02-26 15:32:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7jrz7k",
          "author": "Consistent_Voice_732",
          "text": "Agile is about flexibility, collaboration and iterative progress",
          "score": 1,
          "created_utc": "2026-02-26 17:30:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7k2j8d",
          "author": "PrestigiousAnt3766",
          "text": "Kanban done wrong",
          "score": 1,
          "created_utc": "2026-02-26 18:19:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7kaxf2",
          "author": "benabus",
          "text": "noodle bones",
          "score": 1,
          "created_utc": "2026-02-26 18:57:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7kgxo9",
          "author": "BoBoBearDev",
          "text": "If you can freely make 200 commits into your own git branch without bunch of dictators telling you to pass certain rules (except password rule), that's agile for me.",
          "score": 1,
          "created_utc": "2026-02-26 19:25:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7lgfxd",
          "author": "davearneson",
          "text": "Agile is defined by the Agile Manifesto. Its fundamentally about fast feedback loops so you can learn fast and deliver value to your customers rapidly. If you are doign this you are agile.",
          "score": 1,
          "created_utc": "2026-02-26 22:16:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7lplnt",
          "author": "nierama2019810938135",
          "text": "The important thing is how you and your team defines agile collectively.",
          "score": 1,
          "created_utc": "2026-02-26 23:03:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7lqcwb",
          "author": "Internal-Alfalfa-829",
          "text": "I'll tell you what it's not: A free-card to randomly and repeatedly disrupt a team's work with unqualified side requests just because some event created a false sense of urgency (\"There is a small bug we haven't fixed in months but now the CEO's nephew experienced it and we have to drop everything.\")",
          "score": 1,
          "created_utc": "2026-02-26 23:07:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7hvtik",
          "author": "potatoelover69",
          "text": "Willingness to change plans. That's it.",
          "score": 1,
          "created_utc": "2026-02-26 11:21:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7iw4wo",
              "author": "Affectionate-Log3638",
              "text": "I appreciate wanting to keep it simple, but it needs more to it than this.\n\nI would add that it's creating autonomous teams that have the flexibility to respond changes as they see fit, to deliver value.\n\nI say this because \"a willingness to change plans\" puts them solely at the mercy of leadership who will inevitably abuse this. I've seen leaders who force feed half baked plans and then demand massive changes every week and expect the teams to do it because \"agile teams are able to adapt to changes.\" The teams experience whiplash, get frustrated, and burn out. And then the leaders wonder why the teams \"aren't performing\".",
              "score": 1,
              "created_utc": "2026-02-26 15:03:17",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7hxwi7",
          "author": "NoBullshitAgile",
          "text": "Happy to read the first answers. Would you agree that agile is mainly about a learning system and try to make that learning as good / reliable / fast / secure / ... as possible? Can we describe it this way?\n\nThis system is capable of learning. We can describe it as follows. A system is capable of learning if:\n\n1. Work produces **real effects**\n2. These effects become **visible**\n3. Decisions **respond** to them\n4. Future work **arises** from them\n\nIf one of these conditions is missing, an open loop is created. This can be productive, but it is **not adaptive**.",
          "score": 0,
          "created_utc": "2026-02-26 11:38:25",
          "is_submitter": true,
          "replies": [
            {
              "id": "o7i08sp",
              "author": "ya_rk",
              "text": "Capable of learning AND changing, and the cost/speed of both do matter (so if your company can change but it requires a massive org redesign, millions in retraining, and hiring/firing, then that's not really what we're aiming for). I believe you imply it but i think it's worth making explicit.",
              "score": 1,
              "created_utc": "2026-02-26 11:56:29",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7i2zqx",
                  "author": "NoBullshitAgile",
                  "text": "Understood - and yes, thats part of \"learning\" but you are right!",
                  "score": 1,
                  "created_utc": "2026-02-26 12:16:44",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            },
            {
              "id": "o7i26rf",
              "author": "Xana707",
              "text": "Pas vraiment. L'apprentissage peut faire partie de la méthode agile (avec la méthode lean ux par exemple). Mais ca reste un modèle. Ça ne définit pas l'agilité en soi.",
              "score": 1,
              "created_utc": "2026-02-26 12:10:53",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7ip7ta",
          "author": "Kenny_Lush",
          "text": "“A dystopian micromanagement methodology characterized by the militant and degrading redefinition of benign concepts. For example: a status meeting is now a command to ‘STAND UP!’ and a project assignment is given as the order to ‘SPRINT!’”",
          "score": 0,
          "created_utc": "2026-02-26 14:28:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7hw2lz",
          "author": "yukittyred",
          "text": "You got a goal and just do it.\nNo need sop, documentations, anything that prevents them to pursue goal.\nAnd keep it as short and simple as possible",
          "score": -2,
          "created_utc": "2026-02-26 11:23:14",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rdsnvo",
      "title": "Agile for Hardware Development",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1rdsnvo/agile_for_hardware_development/",
      "author": "Own_Code_5573",
      "created_utc": "2026-02-24 21:03:57",
      "score": 3,
      "num_comments": 2,
      "upvote_ratio": 0.71,
      "text": "Hi!\n\nApplying Agile to physical products is a unique challenge. Whether you are an Agile expert or simply involved in the hardware product development process, I’d love your input for my Master's research! \n\n* **The Survey (5-8 mins):** Open to *anyone* involved in hardware development! Please share your real-world insights here:   [https://response.questback.com/fhwienderwkw1/1j7btajm5a](https://response.questback.com/fhwienderwkw1/1j7btajm5a)\n* **Expert Interviews:** I’m also looking to do a few short chats specifically with Agile experts in this niche. If you'd be open to sharing your deeper experiences, please **DM me or leave a comment!**\n\nAn upvote for visibility is hugely appreciated so I can reach more people in the industry. Thank you! 🙌",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1rdsnvo/agile_for_hardware_development/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o7f9679",
          "author": "SeaworthinessPast896",
          "text": "Look up Kevin Thompson, he was a chief scientist at c prime and his niche was exactly that agile in hardware. He has a book out as well you find it on Amazon.",
          "score": 2,
          "created_utc": "2026-02-25 23:56:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7h8n0w",
          "author": "IQueryVisiC",
          "text": "I thought that we are agile in software because the computer builds our stuff over night. Building is free. Of course once building has a cost, you cannot be agile anymore.",
          "score": 1,
          "created_utc": "2026-02-26 07:43:24",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1ra0huz",
      "title": "Juggling an Agile Project While On Other Projects/Maintenance",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1ra0huz/juggling_an_agile_project_while_on_other/",
      "author": "CrystalBlueSkyes",
      "created_utc": "2026-02-20 16:46:30",
      "score": 2,
      "num_comments": 16,
      "upvote_ratio": 0.67,
      "text": "Here's something I'm not too familiar with.  If other people have dealt with this situation, could you share a bit of guidance?\n\nWe have a new project that we're trying to use Agile for.  It's pretty loose, using Scrum components (sprints, estimation, backlog, ect).  However, a large portion of the project is investigation and business knowledge gathering before any Dev work can begin.  The Devs on the team (me plus two others) are expected to put most of our working time on the tasks, but we have other projects and maintenance to do...and we are the only Devs.  In addition, a lot of the rest of the team (business and system analysts) are also swamped with work outside of the project.\n\nThe project is very important, but I've only worked with teams before that commit nearly 80%+ of their time to said project and are insulated from outside factors and meetings.  How do you juggle this kind of time in an Agile/Scrum framework when the external forces aren't something you can realistically control?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1ra0huz/juggling_an_agile_project_while_on_other/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o6gcct9",
          "author": "dnult",
          "text": "I'm reading between the lines here since I'm not entirely sure what question you're asking.\n\nIf you need to do research or experiment before committing to development, you capture that work as a spike user story. After the spike you may need to adjust the development story based on what you learned.\n\nThe other facet of your question seems to be related to capacity. Story points and sprints are great, but if you ignore capacity, you're likely to make promises you can't keep.\n\nStart by defining a meaningful pointing system. Day-points is the simplest pointing system I've used. A 2 and a 3 point story should take roughly the same time as a single 5 point story. Same is true for a 5 and a 3 point story being equivalent to a single 8 point story. Define your capacity as the number of available days during the sprint or increment. Carve out time for overhead (meetings, training, drive-bys), which is likely to be at least 20%. Commit to stories with the highest business value up to your capacity.",
          "score": 3,
          "created_utc": "2026-02-20 17:10:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6gnh85",
              "author": "CrystalBlueSkyes",
              "text": "Sorry if I was too broad.  I'm trying to figure out how to do good capacity planning in sprint planning and grooming when members of the team can't commit to a solid amount of time in a given sprint.  I know everyone has time off and being sick, ect.  But a lot of our pain is coming in 'Team Member X has to get pulled in on this project suddenly in the middle of our sprint and can't finish anything or commit to next sprint'.",
              "score": 1,
              "created_utc": "2026-02-20 18:02:08",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6ifnpr",
                  "author": "wbqqq",
                  "text": "It is what it is - you can’t make commitments to specific project work because the team aren’t committed to the team. \n\nSome tactics that _might_ work include dedicating particular days or half days and communicating to everyone else that the team are not available Tuesdays and Wednesdays and focus time on the project then (with a capacity of 40%), or expanding your work management to everything that the team does and because you can’t commit more than a day out, just use a kanban and backlog and focus on completing what you start and minimising WIP. \n\nNo easy answer, and someone will have the hard work of communicating “No, not today but probably next week” to everyone outside the team",
                  "score": 2,
                  "created_utc": "2026-02-20 23:17:24",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o6ihur2",
                  "author": "broc_ariums",
                  "text": "You can plan current, dedicated capacity to a sprint and assign work accordingly. If those individuals get pulled into other high priority work you can then speak to the work the started and communicated that it won't be delivered because of the shifting priorities. This is ok. You can then report out on the successes/challenges of the sprint and what impacted delivery like, shifting priorities. You can then use start using the assigned work to help prevent them from jumping from priority to priority by communicating to whoever is pulling them off by starting, \"If Team Member X is moved to this other thing, know that the work assigned to them won't get completed\". You can also communicate to stakeholders in advance, what sprint work is assigned and prioritize accordingly so there aren't surprises when you say, \"this won't get done because we're moving them to X. Is this ok?\"",
                  "score": 1,
                  "created_utc": "2026-02-20 23:30:06",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7gqd4b",
                  "author": "SeaworthinessPast896",
                  "text": "The biggest mistake here is attempting to manage priorities coming from several different sources. This doesn't work. If there's a few of you, then what you need is just one prioritized list of work you can pull from. Just one! No such thing as 20 items in the list all stated as priority high. Because when everything is \"high\" priority, then nothing is a priority.\n\nThen you need to establish rules - if you're working on something that's identified priority #1, you do not deviate unless the building is on fire. You let that run and finish and then pick up the next item. \n\nThe priority list needs to be managed by someone who helps identify which one must come next. And most importantly, the items in Priority list MUST ABSOLUTELY be ready to be worked on. What does that mean - that mean you must NEVER start something that's too vague, not clear, dependent on someone else or otherwise something that you can't get to finish.\n\nLast one, what I'm describing is absolutely agile. You don't need scrum, there's just two of you. And this avoids false promises with \"capacity allocation\". Capacity planning doesn't work, its merely a budget/project management planning technique to estimate staffing. You know you have a bottle neck on people.\n\nNow, here's what's going to happen. When you work this way, it will become very obvious that you are short staffed if the priority list keeps growing, but the output is not fast. And that's your business case to increase the team. Attempting to hide this org problem by working more hours only does the opposite, the org will not see the issue and will accept it as norm while you are quietly burning out. \n\nSo, your pain is not in agility. The moment you'll bring up agile, people will think that you can multi-task. Stop this non-sense before it even starts! And definitely you don't need strict structure for 2 people.\n\nAgain, you said its an important project.... this begs a question - if its important, why not staff it properly?\n\nFeel free to take my comment to your boss and see their reaction. :))",
                  "score": 1,
                  "created_utc": "2026-02-26 05:12:30",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6gdtzl",
          "author": "never-starting-over",
          "text": "Been there, recently. I bet this is some kind of software agency.\n\nIn order to handle more work, you need to either increase resources, increase timeline or decrease scope. Which is the company compromising on?\n\nRegardless of the choice of compromise, what I've done is create a roadmap and a general timeline for these things, so you at least have some numbers to showcase the options and how each affects the project. At that point it can be discussed with decision makers. After that, you can decide on whether to:\n\n1. Compromise on scope\n2. Compromise on timeline\n3. Compromise on resources (not always possible or a linear improvement)\n\nThese aren't even mutually exclusive, often removing some things from the scope also reduces the timeline and the required resources. I'm partial towards compromising on scope and that generally works better for who I work with, especially since timeline compromises typically also mean cost and risk increases; I've seen better results by having phased approaches.\n\nIf you have a small team and a relatively small timeline but a big scope, then the outlier seems to be that the scope is disproportionately large. Or is it? Answering that alone should give you some direction.\n\nAs for the other projects, you'll just have to assume you can't put 40 hrs/week per dev on this new project. It would also be worthwhile figuring out how many hours you *should* be putting towards these other existing projects.",
          "score": 3,
          "created_utc": "2026-02-20 17:17:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6gnhth",
              "author": "morsofer",
              "text": "Additionally, you should communicate to stakeholders as soon as possible - ideally with a clear visualization that your team can dedicate only 20% of their time to this project. That means 20% for understanding the business goal, 20% for refinement, and ultimately 20% for development.\nI would also rethink how to adapt your sprint cycle to such limited capacity. Your two-week sprints are effectively just two actual working days. Do two-week sprints really make sense in this case? Do sprints make sense at all in this setup?\nYou need to clearly answer these questions together with the people who are funding the project.",
              "score": 2,
              "created_utc": "2026-02-20 18:02:13",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o6go79i",
              "author": "CrystalBlueSkyes",
              "text": "Funny enough, it's not a software agency.  Long story short, this is a system integration project where our company is trying to do this integration as a Scrum project.",
              "score": 2,
              "created_utc": "2026-02-20 18:05:27",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6gvyih",
          "author": "kida24",
          "text": "\"Hey, I have 3 number one priorities, what do I do?\"\n\n\nYou are being setup to fail. \n\nDon't worry about estimates. Worry about what is the most important thing to get done and attack that thing. \n\nFigure out who you need to ask to prioritize your work. This is a demonstrable incompetence of the product side or management. Avoiding context switching is one of the biggest things anyone can do to make a person more productive.",
          "score": 2,
          "created_utc": "2026-02-20 18:40:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6gslwq",
          "author": "Proper-Agency-1528",
          "text": "Scrum does not support part-time Scrum team members. Instead of assigning one person to multiple projects, we can bring backlog items in from multiple product backlogs for the team. \n\nIf you have multiple projects and also ad hoc work (support, bug fixes) that need to be addressed by a team of people, create policies around classes of service and give each project its own swim lane and queue, including an ad hoc swim lane. The policy should tell people what to work on next (how to determine which item in the swim lane queues should be pulled into the workflow).",
          "score": 1,
          "created_utc": "2026-02-20 18:25:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6i09kl",
          "author": "PhaseMatch",
          "text": "**TLDR;  If you want Scrum to be effective, then the whole team needs to be 100% on that project. Effective agile delivery acts to control your business risk in a lightweight way;  what you are describing is a long way from that in terms of technical practice**.\n\nScrum requires the whole team working on one project to be effective.\n\nThere's some really solid reasons for this;  the main one is around \"context switching\"\n\n\\- a 2017 study showed you lose about 20% of the teams effectiveness when they work on 2 or more projects;  that's consistent with the data I have collected on just throughput/velocity terms over the years\n\n\\- Gloria Mark's research shows the core of the problem - you tend to get shoulder tapped on project (A) while you are working project (B); that not only interrupts \"flow\" (with a 15-25 minute recovery time), but also leads people to work longer \"to catch up\" and creates stress\n\n\\- Stress lowers our \"working memory\";  you'll get more slips, lapses and mistakes from team members, so more test-and re-work cycles slowing you down\n\n\\- that's more likely to force you towards \"deliberate violations\";  compromising on technical quality to reach a deadline or target, with the consequential \"long tail\" of defects, bugs and problems\n\n**You get into a downward spiral;  context switching kills quality and productivity, and the defects that arise creates more context switching.**\n\n**More critically perhaps, the sequence you describe has nothing to do with agility, at all.**\n\nYou are talking about upfront-requirements-and-design, feeding through to developers.  \nSo very much a stage-gate based delivery model, with analysis and sign offs, in order to control risk.\n\nThat's exactly the kind of \"heavyweight\" approach that agility is designed to disrupt;  you don't control risk through upfront design processes, you control it by\n\n**- having the technical skills in place so change is cheap, easy, fast and safe (no new defects)**  \n**- you get fast feedback on the value created by that change from real users**\n\nYou drop the upfront analysis and the \"contractual\" sign-off relationship with users, and instead have them embedded in the team, collaboratively working continuously to make sure what is built is correct.\n\n**As long as change is not expensive, hard, slow or risky, this is cheaper and faster.**\n\nMy only suggestion here would be \"The Kanban Method\" -\n\n\\- start where you are now  \n\\- make the work and dependencies visible  \n\\- get agreement to evolve how you work  \n\\- apply systems thinking and theory of constraints ideas  \n\\- ruthlessly improve to reduce cycle times  \n\\- apply \"shift left\" concepts to defect prevention (DevOps / XP)  \n\\- STOP worrying about individual utilisation of people  \n\\- START worrying about how work flows, and the delays in handoffs\n\nThe state of your code-base and the investment in technical skill development will dictate whether agile approaches will control your business risk on not - but it might be a long haul (years) to get there.",
          "score": 1,
          "created_utc": "2026-02-20 21:55:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6jpepe",
          "author": "resteele02",
          "text": "My take - projects aren't agile or not agile. Your team is either agile or not agile. If you make the transition to agile, all the work your team does is agile. \n\nA team cannot do some projects using an agile approach and others not using an agile approach. Being agile is a team decision, not a project decision. \n\nI say this from 15 years of experience as a PMO director. It's about the team, not the project.",
          "score": 1,
          "created_utc": "2026-02-21 04:00:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6x2ebq",
          "author": "bzBetty",
          "text": "Over time is your average velocity fairly stable? if yes then easy.  if no then maybe monte carlo style planning (best case we do X, worse case Y)",
          "score": 1,
          "created_utc": "2026-02-23 07:58:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o72f5fl",
          "author": "easy-agile",
          "text": "This is a really common challenge, especially in organisations that are new to agile or working with legacy systems. The tension between \"pure\" agile and practical constraints is something most teams face.  \n  \nThe investigation phase you're describing actually fits well within agile frameworks. The key is being transparent about capacity. If you're only available 60% of the time due to maintenance work, plan your sprints accordingly rather than pretending you have full capacity.  \n  \nFor the context switching between projects, successful teams often establish \"maintenance windows\" or dedicated support rotations rather than having everyone juggle both constantly. Some teams also find it helpful to have one person act as a buffer for urgent maintenance issues during sprint time, rotating this responsibility. The goal isn't to eliminate interruptions completely but to make them predictable and planned for.",
          "score": 1,
          "created_utc": "2026-02-24 02:30:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ii0tw",
          "author": "AlwaysQuestion64117",
          "text": "We must work for the same company.  We are in a similar situation.",
          "score": 1,
          "created_utc": "2026-02-26 13:49:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7j33vv",
          "author": "Interesting_Taste543",
          "text": "been in exactly this situation. what helped us was getting super visual about capacity - we map out sections for \"sprint work\", \"maintenance/other projects\", and a \"parking lot\" for unexpected stuff. we do this in instaboard so everyone can see how much capacity is actually left before committing. makes those \"we're at capacity\" conversations way easier when you can point to something visual instead of explaining in abstract terms.",
          "score": 1,
          "created_utc": "2026-02-26 15:36:28",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}