{
  "metadata": {
    "last_updated": "2026-02-23 03:09:58",
    "time_filter": "week",
    "subreddit": "agile",
    "total_items": 15,
    "total_comments": 185,
    "file_size_bytes": 256779
  },
  "items": [
    {
      "id": "1r8ys5r",
      "title": "Scrum Master roles are shrinking — where did you move next?",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1r8ys5r/scrum_master_roles_are_shrinking_where_did_you/",
      "author": "kiraka67",
      "created_utc": "2026-02-19 13:09:30",
      "score": 40,
      "num_comments": 44,
      "upvote_ratio": 0.84,
      "text": "I’ve been a Scrum Master for several years. I’m seeing fewer serious SM roles and more companies treating it as expendable or folding it into other positions.\n\nI’m past basic facilitation. Most of my work now is process design, optimisation, and system-level improvements across teams.\n\nIf you moved on from an SM role:\nWhere did you go?\nWhat translated well?\nWhat didn’t?\n\nLooking for concrete paths that worked.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1r8ys5r/scrum_master_roles_are_shrinking_where_did_you/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o692sxh",
          "author": "Sensitive_One_425",
          "text": "Go from useless SM to useless PM",
          "score": 88,
          "created_utc": "2026-02-19 15:06:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o69x9ie",
              "author": "kiraka67",
              "text": "This made me chuckle",
              "score": 11,
              "created_utc": "2026-02-19 17:34:43",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6b3a2y",
                  "author": "OtherCommission8227",
                  "text": "Yeah, they’re just labeled as PM roles, but you’re handling “portfolio level tasks”. I stumbled into one of these a few months ago",
                  "score": 5,
                  "created_utc": "2026-02-19 20:55:54",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o68lrpa",
          "author": "fxsoap",
          "text": "Hard to say where these roles are going. Seems like things are being folded back into waterfall and weird hybrid project managers.\n\n\nKind of a messy horrible setup it was before.\n\nI've seen it recently where they keep dumping these up on other roles so you'll have a development lead or product owner suddenly having this job on top of all their other duties.",
          "score": 36,
          "created_utc": "2026-02-19 13:34:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o68sn4j",
              "author": "peterdfrost",
              "text": "Same, imo the scrum master role in it's current form is becoming less common.  I'd recommend looking at expanding your skills into Product and Project Management. Within my own organization and what I'm seeing in general is that the scrum master duties are forming part of a new hybrid PM/PO/SM role.  Look at how you can leverage AI tools to streamline your admin type roles but also build out Product development processes and roadmaps.  \n  \nAs someone wiser than me said, AI may not take your job but someone who uses AI will.      ",
              "score": 16,
              "created_utc": "2026-02-19 14:12:42",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o69319z",
                  "author": "kenashe",
                  "text": "Knowing some Product, Scrum, and Project Management is a good combo. ",
                  "score": 11,
                  "created_utc": "2026-02-19 15:07:53",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o6ba1wj",
              "author": "RegisthEgregious",
              "text": "Alliance alliance struggling to stay afloat and being sold off to PMI sent a strong market signal.",
              "score": 3,
              "created_utc": "2026-02-19 21:28:28",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6civio",
                  "author": "AmosRid",
                  "text": "The fact that PMI bought them is a stronger signal. Either AA was cheap/free or PMI is trying to stay relevant. They have been sucking dust for 10+ years w/ IIBA.\n\nLook into Product Model or Product Operations. That is the next best thing and you will need your SM & SM-adjacent skills.",
                  "score": 4,
                  "created_utc": "2026-02-20 01:40:26",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o69h3dt",
          "author": "ScrumViking",
          "text": "I think there’s a difference between scrum masters that just manage a team and scrum masters that facilitate the team and the surrounding organization. \n\nI come across so many colleagues that limit themselves and as a result reduces their own relevance. I can’t even blame them, since their accountability is limited by the understanding of the organization on the role. They’re practically invisible for management. \n\nWhile sticking to the feels safe it’s also reducing your ability to make a difference for the team and the organization. If given the chance be bold and step into the limelight.",
          "score": 9,
          "created_utc": "2026-02-19 16:17:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6cj77c",
              "author": "AmosRid",
              "text": "Leadership likes to dump SMs when they cannot get headcount in another role or they offshore the entire team and they get an offshore SM (read: customer contact) baked in.",
              "score": 1,
              "created_utc": "2026-02-20 01:42:25",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6dslyi",
                  "author": "ScrumViking",
                  "text": "I’ve been in that situation once. From the sidelines (since I was external hire) I saw how that company wrecked itself from the inside. They are currently experiencing decline service quality, customer satisfaction and recently had a data leak through a hack that bled sensitive personal information of about 6 million customers old and new.",
                  "score": 2,
                  "created_utc": "2026-02-20 07:07:44",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6dqskj",
          "author": "Ciopartzelu",
          "text": "They are being folded into Delivery Manager roles - which is basically PM level roles but with less focus on paperwork and more on delivery. You get involved in monitoring feature estimates and milestones (not just per sprint goals), discussions with 3rd parties for integrations etc.\n\nIt works well and it's a natural transition I think. The world has outgrown the need for people to present dictate and enforce Agile. Everyone knowsnit, everyone does it wrong, everyone knows the pitfalls and it's rare that you need a nintechnival person to teach you how to work in scrum or what a story point is - mostly because in the last 30 years, everyone has done it one way or another",
          "score": 6,
          "created_utc": "2026-02-20 06:51:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6lwymd",
          "author": "McGILLAZ",
          "text": "I just got out of this conundrum myself and I can appreciate the frustration it causes. I saw an opportunity to utilize some of the servant leadership mentality (and proactive approach) to form an outreach position. Essentially, I saw the organization I am in rapidly moving toward Copilot/Google Gemini, etc. and made an effort to not only learn some of our organization's approach to utilizing these a.i. tools, but started networking to really get into the heart of who owns the rollout, timing of updates, etc and then relaying this information to the correct people. It slowly morphed into it's own thing and I've completely moved out of the Agile bubble and into a.i./adjacent initiatives. I know every situation is unique, but I've been involved in organizations time and time again, where if you see a gap and fill said gap, there's a strong possibility that you wind up becoming the champion or expert in that area. People start treating you as the source or direction for what happens next. Wish me luck though, because we're beginning to go through massive layoffs across the entirety of the organization.",
          "score": 3,
          "created_utc": "2026-02-21 14:55:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6o6xt0",
              "author": "The-BadDEst",
              "text": "Good idea, thanks.",
              "score": 2,
              "created_utc": "2026-02-21 21:54:49",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6990l7",
          "author": "yukittyred",
          "text": "Easy. Go back into developer.\n\nI was a developer trying to be a scrum master. But then the management hate growing and better stuff for employees. So they remove the scrum master.\n\nSo now the scrum master is only by name, but mostly is just assistants for managers.",
          "score": 8,
          "created_utc": "2026-02-19 15:38:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o68t05t",
          "author": "Any_Warthog_4200",
          "text": "General PM roles. (Gonna start a war... I am aware my role is bullshit for most of the people, just go to any programming subs here, serious shittalk about SMs..)\n\nMy company has \"Technical scrum masters\" for example as new hires.",
          "score": 8,
          "created_utc": "2026-02-19 14:14:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o699jda",
              "author": "fxsoap",
              "text": "Ah ha. \n\nFunny you say that I have 2 friends who just changed from scrum masters to Technical SMs. \n\nAnother is now called an \"agilist\" whatever that means.",
              "score": 4,
              "created_utc": "2026-02-19 15:40:38",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o69yxc7",
                  "author": "Affectionate-Log3638",
                  "text": "Come on. It should be clear as day what an Agilist does. They \"act as a change agent\" and contribute to the orgs \"agile transformation\". \n\nClear, concrete, and tangible.",
                  "score": 10,
                  "created_utc": "2026-02-19 17:42:50",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o6cjgb7",
                  "author": "AmosRid",
                  "text": "Agilist = SM + accountability",
                  "score": 1,
                  "created_utc": "2026-02-20 01:43:59",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o692no0",
          "author": "zeefer",
          "text": "Try product operations. Responsible for designing, implementing, tracking, troubleshooting productivity systems and workflows across an organization.",
          "score": 5,
          "created_utc": "2026-02-19 15:05:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6974du",
          "author": "add1114",
          "text": "Coming in with a hot take (I am a scrum master fyi) but if your company is viewing the role as expendable/not necessary, then you are not doing your job well as a scrum master. I and my fellow scrum masters have made the role of scrum master the most valuable role in our teams at our company",
          "score": 2,
          "created_utc": "2026-02-19 15:28:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o69aqpp",
              "author": "Any_Warthog_4200",
              "text": "Maybe in a small company, sure. But at the industry level, things have been shifting for years. A lot of companies are changing how they use Scrum Masters IF they even use them. A lot of companies that used to be very loud about being early adopters of agile have already moved away from it.\n\nWhat I don't like is when SMs or ACs take the high ground and say \"you must be doing your job wrong\". Yeah, could be true when agility was skyrocketing everywhere.  \nBut let's be real, we're all just numbers to a company. If you have a pure SM job, consider yourself lucky! They might keep you in a mixed SM/PM-type role, expanding your responsibilities, or decide they don't need the role anymore. That's the reality in many places today. And good luck finding a new job.\n\nEdit: I would never consider myself more important than a developer, they create real value $$$ to the company and my role is to help them do that better.\n\nAnd if we're really talking about agility, then we should be ready to adapt. The industry has changed, roles are evolving, and ignoring that reality doesn't help anyone.",
              "score": 12,
              "created_utc": "2026-02-19 15:46:29",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o69xuk8",
              "author": "kiraka67",
              "text": "Where did I imply on any of this? \nI'm talking about long term career opportunities as SM roles seems to be less and less desired and I don't think the position will be relevant in 5-10 years.",
              "score": 4,
              "created_utc": "2026-02-19 17:37:36",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o6abg1e",
              "author": "ninjaluvr",
              "text": "> I and my fellow scrum masters have made the role of scrum master the most valuable role in our teams at our company\n\nPlease elaborate.",
              "score": 3,
              "created_utc": "2026-02-19 18:41:24",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o6dcg6t",
              "author": "Affectionate-Log3638",
              "text": "I was a former SM myself and ended up elevated to team manager as a result.\n\nWhich is why it breaks my heart to say it's a bad position. I agree to an extent, that most places utilize the role wrong. But at some point you have to ask, if *everyone* is doing it wrong, maybe it's not that great of a role to begin with.\n\nAnd I do have to challenge your assertion that it's the most valuable role. The Developers are the ones doing the work. They're the heart of the team. I get sick of reading all these LinkedIn posts that are nothing but romanticized love letters to Scrum Masters. The true value of a Scrum Master is making the team valuable.",
              "score": 2,
              "created_utc": "2026-02-20 04:52:33",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o6q9u1z",
              "author": "zwermp",
              "text": "Your company ngmi",
              "score": 1,
              "created_utc": "2026-02-22 06:05:08",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o69qfig",
              "author": "KronktheKronk",
              "text": "Lol, ok buddy",
              "score": -2,
              "created_utc": "2026-02-19 17:01:49",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6ai1sz",
          "author": "shebafrost",
          "text": "Product Operations?",
          "score": 1,
          "created_utc": "2026-02-19 19:12:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6aiugd",
          "author": "Hullodurr",
          "text": "Prod ops",
          "score": 1,
          "created_utc": "2026-02-19 19:16:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6d10p3",
          "author": "brain1127",
          "text": "I’m going to become an Agent for AI",
          "score": 1,
          "created_utc": "2026-02-20 03:32:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6ffszb",
              "author": "kiraka67",
              "text": "What would that mean in practice?",
              "score": 1,
              "created_utc": "2026-02-20 14:37:25",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6fve8a",
                  "author": "brain1127",
                  "text": "You have to act like you are part of a clandestine organization where your outward appearance, demeanor, and actions show that you are mastering expertise in new technology. While internally operating with the understanding that the   Corporate environments true objectives are to do everything they can to advance profit metrics on a quarterly basis as their true north.",
                  "score": 2,
                  "created_utc": "2026-02-20 15:53:11",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6dhwob",
          "author": "Puzzleheaded-Bug6244",
          "text": "\nI have mixed feelings. I am really sad on your behalf that your job is disappearing. That is tough. On the other hand I will be celebrating the death of scrum.",
          "score": 1,
          "created_utc": "2026-02-20 05:34:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6fg08w",
              "author": "kiraka67",
              "text": "I also have mixed feelings. On one hand, I'm also quite sad. On the other hand you made me laugh...",
              "score": 2,
              "created_utc": "2026-02-20 14:38:27",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6g70sl",
          "author": "ChangeCool2026",
          "text": "You could go for a full project manager's role. I know that the scrum 'story' has been overwhelmingly negative about 'waterfall' project management being 'bureaucratic', 'slow', 'non-adaptive', etc. but the reality is and has been that:\n\n1. Scrum is great, but many scrum aspects are actually not that new. A lot of the agile principles have been applied since ages, just with different lingo and slightly different contexts (off course there was no IT back in 1900)\n\n2. Scum as a framework is rather small (limited), which has it's advantages, but it does not give you any answers on many topics. For example:  \"trust\" is important in teams, like the scrum guide tells us. But it does not tell us, how to get people to trust each other in a team. So there is loads of schools and people's science out there that you could study, just on this single Scrum 'item'.\n\nSo move on beyond the \"Scrum is the new thing and a better way of doing projects\" narrative and have a look in the broader field of project management schools. It is a lifetime of things to learn there.",
          "score": 1,
          "created_utc": "2026-02-20 16:46:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6c84q8",
          "author": "Lloytron",
          "text": "As far as I'm concerned Scrum Master was a hat anyone in the team could wear, not a dedicated role.\n\nI was surprised when I worked in companies where they had dedicated full time Scrum Masters. It's as if someone reads the Scrum Guide briefly but didn't fully get it so put some money behind it instead.\n\nI'm not surprised the role is going away. Not helpful for you of course, so look to transition into Product Owner roles",
          "score": 1,
          "created_utc": "2026-02-20 00:35:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o69zjwi",
          "author": "wbrd",
          "text": "SM should not be a discreet role. You can have project managers and program managers, but sm should be a rotating task in a team.",
          "score": -2,
          "created_utc": "2026-02-19 17:45:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6ab99r",
              "author": "ninjaluvr",
              "text": "There's not what they asked.",
              "score": 0,
              "created_utc": "2026-02-19 18:40:31",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6ar5fi",
                  "author": "wbrd",
                  "text": "I'm aware, but they should set expectations going forward that SM isn't a profession.",
                  "score": -2,
                  "created_utc": "2026-02-19 19:56:15",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o68uls0",
          "author": "Gabrieljim3630",
          "text": "Product Manager, Project Manager or Dev",
          "score": -1,
          "created_utc": "2026-02-19 14:23:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6arlnr",
          "author": "Efficient-County2382",
          "text": "I'm not surprised, there are supernumerary nipples on bulls that serve more purpose than the average scrum master in my experience. Literally no value added, and their roles could and should easily be picked up by other team members.\n\nSome have said PM, but then you'd actually have to deliver and do something",
          "score": -3,
          "created_utc": "2026-02-19 19:58:27",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r689p7",
      "title": "When everything becomes P1, agility quietly breaks",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1r689p7/when_everything_becomes_p1_agility_quietly_breaks/",
      "author": "mohan-thatguy",
      "created_utc": "2026-02-16 12:25:12",
      "score": 30,
      "num_comments": 36,
      "upvote_ratio": 0.86,
      "text": "I’ve been in many backlog refinement and sprint planning sessions that felt solid in the moment. Good discussion. Clear explanations. Everything justified. And yet, nothing really moved faster. A few weeks later, the sprint was “busy” but progress felt thin. Not because the team wasn’t capable or committed, but because focus was split across too many “important” items. Over time, a pattern became obvious: When everything is P1, real priority disappears. Teams don’t avoid prioritization because they don’t understand Agile. They avoid it because prioritization forces trade offs and trade offs are uncomfortable, especially when multiple stakeholders are involved. Every story has value. Every request feels urgent. Every delay feels risky. So instead of choosing, we keep adding. What finally changed things wasn’t another estimation technique or a better backlog tool. It was forcing one constraint into the conversation: If only one thing can come first, what actually comes first? That single question shifted the discussion: hidden disagreements surfaced early, scope conversations became clearer, commitment improved because the team knew what truly mattered. Until one thing is clearly ahead of everything else, agility doesn’t increase, execution just becomes fragmented.   \nCurious how other Agile practitioners here handle prioritization when everything arrives labeled “urgent,” especially during sprint planning and backlog refinement.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1r689p7/when_everything_becomes_p1_agility_quietly_breaks/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o5o927d",
          "author": "my_buddy_is_a_dog",
          "text": "I use the mantra when everything is a priority nothing is a priority. \n\nSounds like the PO, or whomever is prioritizing the work is not actually looking at what the return of the work is going to be. And even if everything is marked urgent, the PO still needs to prioritize which of those items is more urgent.\n\nAlso look at weighted shortest job first (wsjf) and that might help prioritize which work will return the highest ROI first.",
          "score": 7,
          "created_utc": "2026-02-16 12:38:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5oceks",
          "author": "KTGSteve",
          "text": "lol.  This is very, very true.  I’ve come into teams literally paralyzed by this.  Everyone frustrated from devs to the CTO.  Another team had gone so far as to introduce level P0, which moas items then became!\n\nThe solution is at its core - good management.  Organizational skills and process knowledge are good too.   But everyone understands that everything cannot be done all at once, everyone understands team capacity limits, everyone understands the concepts of prioritization and scheduling.   Yet, they find themselves in this situation.   Good management adds “enforcement” of these concepts and, crucially, through persuasion in addition to the logic, gets everyone on board with them.  Not just on board, but on a foundation of understanding such that everyone is happy - happy with how things are going.  That is hard.  Hard, hard, hard.  But good managers do it.\n\nTools that I’ve used:\n\n- like the question you pose - pick one thing - are excellent.   I have had stakeholders bring their top 5, then we hash it out together\n- get ALL stakeholders involved in planning, period.   Do t do it unless all are present.  This prevents the busy C-suite guy from blowing it all up later because he “wasn’t there during planning”\n- Kanban - use the limits in Jira to illustrate, not enforce, how the load is spread and when capacity is reached.  Non-techies will understand this\n- identity “bubbling under” items in the backlog.  These are the ones that come up time and again for inclusion, but never quite make it.  So while everyone agrees that it is clearly a good and important idea, after many cycles, it’s clear that it is in reality not a priority.  After a year or two, it is clear that it is not even needed, since obviously the product is doing fine without it.  The point is - it’s nearly impossible to cull the backlog because yes, all of those are, truly, “good ideas”.  But reality like this illustrates to everyone that much of the backlog is truly NOT top priority, which helps people focus\n- in every sprint and release, have must-have and nice-to-have items.  The latter is a crucial pressure-release buffer.  Stakeholders can get items “in”, but without full expectation.  The dev team gets a win by getting to those items if they can.  Win-win.  Also, as dev manager, I have quietly moved items from must to nice and subtly changed my terminology when discussing it, and no one noticed.  I was able to avoid a couple of real crunches that way, though it is underhanded.",
          "score": 7,
          "created_utc": "2026-02-16 13:01:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5or39s",
          "author": "agileliecom",
          "text": "\"When everything is P1, real priority disappears.\" That's not an Agile problem. That's a leadership problem that Agile frameworks refuse to solve.\n\nScrum puts a Product Owner in charge of the backlog. But in practice the PO doesn't have authority to tell a VP that their feature isn't priority. So everything stays P1 because saying no is a career risk. The framework assumes a power dynamic that doesn't exist in most organizations.\n\nYour constraint question is the right one. \"If only one thing can come first, what actually comes first?\" But notice what happened, the thing that fixed it wasn't a ceremony or a framework. It was a single honest question that forced people to stop hiding behind process and make an actual decision.\n\nThat's the pattern I keep seeing. Every time someone solves a real Agile problem, the solution is never more Agile. It's less process and more honesty.",
          "score": 5,
          "created_utc": "2026-02-16 14:25:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5q8y0g",
              "author": "astroblaccc",
              "text": "If you have a PO who can't tell a VP that their stuff has to wait, you don't have a PO. You have Kabuki theatre. Make the VPs the POs, they're obviously very smart and can handle PO work.",
              "score": 3,
              "created_utc": "2026-02-16 18:40:53",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5qdcr4",
                  "author": "agileliecom",
                  "text": "That's Risk Management Theater",
                  "score": 1,
                  "created_utc": "2026-02-16 19:01:09",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5pzw13",
          "author": "webby-debby-404",
          "text": "You definitely need a better PO and SM! \n\n\nThere is a reason why we're using a **prioritised** backlog. This means simply that all tickets are in one single row and in order of priority. First ticket in line has P1 (in your terms), second ticket P2, etc.  \n\n\nDisagreement of the business wrt order of tickets and thus priority are discussed and negotiated between PO and  business stakeholders **outside** the sprint **and** the team. Team must make working code and not be distracted by business BS.  \n\n\nWorking this way it also becomes clear who has to drop their work item to help a team mate who gets stuck. Anyone working on an item in a lower position on the backlog can safely drop their work and help getting the one who got stuck.  \n\n\nThat's why SMs and POs need to be tough. Shield the team and always have the priorities for next sprint cleared out with the business. ",
          "score": 2,
          "created_utc": "2026-02-16 17:59:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5oa274",
          "author": "astroblaccc",
          "text": "One weird trick is stakeholder transparency.\n\nGet all the stakeholders into an email thread, slack, meeting... Whatever. Show them all the \"Pri 1s\" and let God sort it out.",
          "score": 1,
          "created_utc": "2026-02-16 12:45:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5oo7cd",
              "author": "Kempeth",
              "text": "Only if they already have internal competition.\n\nThey can just as easily turn around and say \"yeah that's exactly what we want. Make it happen.\"",
              "score": 1,
              "created_utc": "2026-02-16 14:09:43",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5oqafs",
                  "author": "astroblaccc",
                  "text": "\"I would love to make that happen, Terry, but George's stuff is tied directly to an ask from the CISO, Bill. I understand you have a charge code and he doesn't but we have only have 5 people on the team and George said his goes first, right George?\"",
                  "score": 1,
                  "created_utc": "2026-02-16 14:20:49",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o5pnrvj",
                  "author": "flundstrom2",
                  "text": "\"Sure, which single ticket do you agree we shall deliver before the other ones\"?\n\n\"Ah, you want everything delivered at the same time? Sure, instead of delivering one ticket every week for the next 52 weeks, we will deliver nothing for the next 52 weeks, then you get 52 tickets at once\".",
                  "score": 1,
                  "created_utc": "2026-02-16 17:03:02",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5onvi3",
          "author": "Kempeth",
          "text": "Show me a methodology that doesn't break when you insist on doing everything at once.",
          "score": 1,
          "created_utc": "2026-02-16 14:07:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5oq7zs",
          "author": "Triabolical_",
          "text": "I once worked on a product with the agile teams and 15 stakeholders and similar problems. \n\nYou need a stakeholder priority group that decides what your team works on, led by somebody who can explain the reality of the situation. \n\nWe had stakeholders who were fine getting their feature in 12 months until they were told that our tracking showed that features more than six months out will never get implemented because new higher priority ones always show up",
          "score": 1,
          "created_utc": "2026-02-16 14:20:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ozb06",
          "author": "Personal-Lack4170",
          "text": "Capacity is the forcing function. When you visibly shoe trade-offs on the board, prioritization becomes unavoidable",
          "score": 1,
          "created_utc": "2026-02-16 15:07:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5p231y",
          "author": "yokobono",
          "text": "This is why rank over priority is a critical necessity at the team level.",
          "score": 1,
          "created_utc": "2026-02-16 15:21:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5pcnmo",
          "author": "TheScruminator",
          "text": "The very simple answer is we don't prioritise things. We order them instead.",
          "score": 1,
          "created_utc": "2026-02-16 16:12:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5pm6xf",
          "author": "flundstrom2",
          "text": "As PO, Ive found theres no such thing as prio 1. Everything is challengeable - much to the disappointment of the project and product managers.\n\nIve lost count on how often a PM has asked for a thing to be \"prioritized\" because \"its the most important project of the company\". It was probably the most important project for /their/ department. But its only happened that it indeed was the most important project for the company. \n\n All other times, the disappointment would be palpable as I showed the company project prio list, and their were at position 20, and that it ment their request could be met but no earlier than in 36 months time. \"Unless you can get PMs and stakeholders X, Y and Z to deprioritize their projects A, B and C.\".",
          "score": 1,
          "created_utc": "2026-02-16 16:55:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5pqv5n",
          "author": "hippydipster",
          "text": "Usually this is resolved by matching each P1 with a developer who then works on that.  Multiple P1s per individual developer if necessary.  It's great, as this way you get maximum output and none of this inefficiency of multiple people sitting around together only getting one thing done at a time.  This way, we can get all the things done at a time.\n\n/s",
          "score": 1,
          "created_utc": "2026-02-16 17:17:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ps7a3",
          "author": "WaylundLG",
          "text": "I mean, yes... this is exactly why the backlog must be ordered - that is, every item is clearly directly above and below exactly 1 other item. Nothing is the same priority as something else. You are 100% correct and that's why scrum (and many other approaches) have clear rules about this.",
          "score": 1,
          "created_utc": "2026-02-16 17:23:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5pv2g8",
          "author": "robhanz",
          "text": "Focus is about what you *don't* do.\n\nYou'll make more progress if you do fewer things.  It sounds paradoxical but it's true.\n\nImagine you had four one week tasks at home - cleaning the garage, building something, whatever.  If you work on all of them because they're all important, and give them equal time, they'd all be done after four weeks.\n\nIf you do them one at a time, the first would be done after one week, the second after two, etc.  So you'll make more progress, faster.\n\nAnd that assumes zero cost to switching context - which never happens.\n\nThe counter to this is that you may get blocked by something.  This is kinda true, *but*, having other projects to work on tends to exacerbate it by defocusing the energy you need to get *unblocked*.  Having a second project for when you're blocked on externals *can* make sense, but I'd do it sparingly.",
          "score": 1,
          "created_utc": "2026-02-16 17:37:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5zccw5",
              "author": "abidingtoday",
              "text": "Focus is about what you don’t do, that’s kind of what I learned today, in so many words.. I’m not an agile person yet (in any way lol) but I see the value in it, this is a different kind of thinking that’s difficult at first but I think will be worthwhile",
              "score": 2,
              "created_utc": "2026-02-18 02:22:57",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5q3vqf",
          "author": "ExitingBear",
          "text": "Does anyone have resources (tips, books, websites, videos, webinars, anything?) that teach how to prioritize?  It's a thing that feels like it should be obvious, but I'm seeing a lot of POs (or other people responsible for prioritization) really struggle with.  ",
          "score": 1,
          "created_utc": "2026-02-16 18:17:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5q67ez",
          "author": "LightPhotographer",
          "text": "I see this in situations where- the team does not deliver value to production fast, like weekly or perhaps sprintly. \n\n\\- the stories are always part of some bigger project which delivers value when everything is done.\n\nBecause no story actually delivers actual value, the discussion about priority is hollow.",
          "score": 1,
          "created_utc": "2026-02-16 18:28:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5qf7c7",
          "author": "PhaseMatch",
          "text": "***\"When everything on the backlog arrives as urgent\"*** \n\nThings don't \"arrive on the backlog\";  you have a considered approach to what goes into the backlog, and what does not.  Calling things \"urgent\" is dumb.  When everything is urgent - nothing is.  Priority is ranked in order.\n\nThis is the basic, core competence of the product owner/manager;  keep this AWAY from the team, so they can focus.  Only bring the team into play WHEN they need to be included in solving a problem.\n\nThat's the job.  Backlog in priority order, to maximise value.  It's aligned with your business/product strategy, and the roadmap that comes from that.  You are solving business problems with strategic impact, not bringing the team cool features to add because someone thinks it's a good idea.     \n  \n**For enhancements, I go for:**   \n  \n\\- a product/business vision  \n\\- a strategic roadmap, outcome based, from that  \n\\- a set of business problems to solve along that roadmap  \n\\- a set of feature candidates that might solve that business problem  \n\\- the backlog\n\nYou bring the team problems to solve, iteratively, not solutions to implement.    \nUse a lean business canvas for features, so that the benefits and value is clearly defined.  \nEstimate them roughly (Fibonacci in Sprints is fine), surface risks and assumptions (as spikes)  \nIdentify which users/customers you will be collaborating with as SMEs on that feature.  \nRough and ready, on a whiteboard.  2 x 45 minute sessions, with a three amigos pattern and a user ideally.  \nDoes it meat the ROI you need (benefit Vs cost, looking at Sprint burn rate)? \n\nThen work on the most valuable thing first.  \nUser story mapping, find the \"spine\" and then XP planning by identified risks/assumptions and value.  \nSlice small, fast feedback from those SMEs, ideally embedded with the team, certainly every 1-2 days.  \nAll of the XP/DevOps stuff to CI/CD to them on a short cycle, 1-2 days at most.  \nTalking with them about choices as you come across them, in real time.  \nSmall user stories, well sliced, and the right users to collaborate with.\n\nUsers/SMEs don't want to collaborate?  It's not that important.\n\n**For defects, you have:** \n\n\\- great tier1 support before it's near the team  \n\\- triage; is this NOW, next Sprint or later.  Three amigos pattern, linked across the value stream.  \n\\- hard, defined boundaries;  if there's a workaround, it's next or later.   \n\\- a buffer in your planning if you get a lot of defects  \n\\- process improvement;  how did the defect slip through?\n\n ",
          "score": 1,
          "created_utc": "2026-02-16 19:09:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5r3nc2",
          "author": "roastoxcrisps",
          "text": "I've found talking to stakeholders about \"priority\" is of little value. Instead I address \"order of delivery\". \nDessert is very important to a hungry person at the start of a meal, but rarely do they want it delivered first. Sometimes they end up not wanting it at all after the first 8 courses.",
          "score": 1,
          "created_utc": "2026-02-16 21:09:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5roy9j",
          "author": "tigershark_bas",
          "text": "Do yourself a favour and read The Phoenix Project. Then get your team and leaders to read it. The ones who really want to solve the problem",
          "score": 1,
          "created_utc": "2026-02-16 22:55:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5rrvjc",
          "author": "kexnyc",
          "text": "If I am held responsible for the backlog, then I get to prioritize. If I don’t have that, then I can’t do my job. That’s a different conversation.",
          "score": 1,
          "created_utc": "2026-02-16 23:11:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5uwfu5",
          "author": "Budget_Pin5828",
          "text": "When everything is a priority, nothing is a priority. This isnt an agile problem. This is a system  ",
          "score": 1,
          "created_utc": "2026-02-17 12:55:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5xg9jn",
          "author": "sweavo",
          "text": "Which llm did you use for this?",
          "score": 1,
          "created_utc": "2026-02-17 20:33:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ye56o",
          "author": "ChaosClarified",
          "text": "It starts with strategy. If your program or product roadmap doesn't have a direction, you won't know what to prioritize. If you have that, you'll be able to see a path to reach the goal of the strategy. If you have your path, you can lay out a couple of sprints for yourself to roughly outline what to put in each sprint and when. You'll need stories to reflect the path and you need to know your velocity to have an idea of how long to get there. Then you start actually building a sprint, one sprint planning at a time and you go from there.\n\nBut I also don't really understand your team in the sense that what's ambiguous once the sprint has started? Once it's started, everything in that sprint backlog is P1, it doesn't matter what they pick. All that matters is the value you deliver in 2 weeks time, what order they work on things until then matters absolutely zero so just go ahead and pick.",
          "score": 1,
          "created_utc": "2026-02-17 23:19:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o65pltj",
          "author": "easy-agile",
          "text": "Can definitely relate. The \"everything is urgent\" trap is one of the fastest ways to kill velocity without anyone realising what's happening.  \n  \nWhat we see work well is when teams get really honest about impact vs effort during refinement. Not just \"this is important\" but \"this is more important than X because...\" The moment you have to justify why something ranks above another specific item, the real priorities start emerging. Teams that do this well often end up with maybe 2-3 genuine high-priority items per sprint, with everything else clearly ranked below.  \n  \nThe other pattern that helps is making the cost of context switching visible. When teams track how much time gets lost to jumping between different priorities, it becomes obvious why progress feels thin even when everyone's busy. Some teams we work with literally limit work in progress at the story level, not just at the person level, which forces those uncomfortable but necessary priority conversations to happen upfront rather than mid-sprint when it's too late.",
          "score": 1,
          "created_utc": "2026-02-19 00:42:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o67gouf",
          "author": "Affectionate-Fig8866",
          "text": "The BackBuild Framework works within Agile and prevents firefighting with unknowns",
          "score": 1,
          "created_utc": "2026-02-19 07:52:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5oba50",
          "author": "RevolutionarySky6143",
          "text": "This is dead simple.  1.  You have capacity of the team.  2.  You have estimated US's.  3.  Not everything on the Product Backlog can be a P1.  You may think it is, but it isn't.  4.  It isn't the team's problem you or the PO can't prioritise.  Your post is just word soup.  Have the PO understand his/her job properly and then build a Sprint Goal.  It isn't rocket science.  ",
          "score": 0,
          "created_utc": "2026-02-16 12:53:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5oowrp",
              "author": "wbqqq",
              "text": "One key thing that was implied by the OP is also context switching amongst stakeholders is a drain also. What I generally try to do is have a theme/focus for each iteration. Normally based on the “if we can only do one thing, what is it?” question. Then, bump up the priority of other items related to the theme, even if in isolation other items outside the theme are objectively higher priority. In addition to minimising context switching on the theme, it focuses time spend with/by stakeholders/qa/designers/etc. \n\nOf course it is never easy, but that’s the art of a PO - comms and prioritization.",
              "score": 1,
              "created_utc": "2026-02-16 14:13:30",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5oh55y",
          "author": "justinpaulson",
          "text": "P0, P1… is this where my coding agent is getting this priority pattern? I wondered. I guess it’s an agile thing?\n\nWith a coding agent it’s funny because nothing really piles up in the backlog so priority is kind of a joke, it’s just all ready and firing immediately.",
          "score": 0,
          "created_utc": "2026-02-16 13:30:39",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r78298",
      "title": "What agile processes/working styles have you personally witnessed failing hard?",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1r78298/what_agile_processesworking_styles_have_you/",
      "author": "EarlOfAwesom3",
      "created_utc": "2026-02-17 14:52:23",
      "score": 27,
      "num_comments": 29,
      "upvote_ratio": 0.94,
      "text": "I'm a developer who has been witnessing and participating in all kinds of agile processes in different teams over a decade now and let me say:\n\n**almost everytime it works pretty well.** Which is amazing tbh.\n\nThe teams I've been on always found their way of making their processes work for them. Sometimes you need some little adjustments on the way, but the general acceptance and quality of agile processes was great. I took several mental notes experiencing all the different styles, collecting the \"good\" and avoiding the \"bad\"\n\nBut several years ago, one company failed so hard that it kept me scarred for life. And thats a good thing, because now I really know how bad it can get and what not to repeat.\n\nHere is a little list of traits for you. Be advidsed, this is a very anti-agility way of working:\n\n* No Scrum Master or PM. Sprint planning was a meeting were the principal dev assigned tickets.\n* No team effort to get something finished first. Everything had to be started at the same time.\n* Big tickets and big features. Your ticket -> Your responsibilty. Every Man for himself.\n* A supervising team in another timezone\n\nWhich of course lead to this behaviour:\n\n* You got 4-5 tickets assigned every sprint. If you're stuck, start the next ticket.\n* Stuck all the time, everything was in \"Doing\" because it looked good on reports for stakeholders (shit you not).\n* Dozens of context switches every day.\n* Barely got any help but also couldn't make any decisions on your own (because they later got rejected).\n* Developers should not merge code that wasn't executed (yet). The whole big feature (for all platforms) needed to be finished first.\n* Your code was reviewed by your local team. Then it was reviewed by a supervising team in another timezone, further delaying the merge.\n* Feature branches got stale and rotted 4-8 weeks (multiple sprints) before they got merged.\n\nIt failed so hard, that I already knew early on that this is fucked up beyond repair.\n\nAs a result, it never felt that we were a team or working on something together that makes actual sense. No documentation, no communication, no goals or understanding.\n\nI tried speaking up several times to make some small changes first (i.e. making tickets smaller, more refined and finish one ticket first before starting others) but was never heard. And as a developer who knows that this is not sustainable, it was the worst.\n\nBut yeah, I think some years later, experiencing hell first hand helped me appreciate every other team with a little structure, processes and dedicated roles. Whats yours?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1r78298/what_agile_processesworking_styles_have_you/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o5wftue",
          "author": "dave-rooney-ca",
          "text": "I'm a coach and developer, with stints as a manager in there as well. The behaviour you mentioned is quite common, especially in cases where people need to \"appear busy\". And you're completely correct about how ineffective and inefficient it is. Some people and organizations are so used to it that they aren't interested in changing to something different. 🤷‍♂️  \n  \nSomething I *will* say, is that I'm OK with feature branches as long as they only live for minutes to hours rather than days. Because I've worked in so many domains over my career, I totally get that not all teams can use a continuous delivery model.\n\nWith respect to reviews, though, mob programming is by far the most effective way to handle them (because they happen in real time) than any other approach I've seen. The issue there is cultural - is a group willing to try it, and I don't just mean the programmers. To be effective, mobbing needs everyone (every role) that's required to get a piece of work from start to finish. But, if you're saddled with incompatible timezones, then you pretty much have to live with git or Github flow.\n\nI've been lucky, though, to work in a few places that truly \"got it\". The first was back in 1992, long before anything resembling agile methods existed! I was part of a team of 15-20 people and we got shit done. Our management was rather visionary for the time, insisting that the team be co-located with the people who would be consuming our work. We were trusted to do the work and not pestered for updates or ongoing estimates as long as there was tangible progress. When I learned about Extreme Programming in 2000, it resonated with a lot of what we did in that team 8 years earlier.\n\nSince then I've been able to recreate some of that magic. Boiling it all down, those successes came from close collaboration, limiting WIP, insisting on high quality and reflecting deeply and honestly on how we worked.",
          "score": 6,
          "created_utc": "2026-02-17 17:43:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5wi46y",
              "author": "EarlOfAwesom3",
              "text": "Thanks for sharing. I fully agree with you success points, with \"close collaboration\" being my favorite. And I don't necessarily mean by locality but more by sharing - shared responsibility, shared understanding, shared success and shared failure. If this is established, you truly have a team and not just a bunch of lone wolfs sitting on a table. That makes a huge difference.",
              "score": 3,
              "created_utc": "2026-02-17 17:53:52",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o5yt7ho",
              "author": "Nowhere-Man-Nc",
              "text": "***insisting*** *on high quality*  \n  \nThat feels *conceptually inconsistent* in the Agile context. A good example of manipulating definitions of \"done\" and \"releasable\" that I mention in my comment. \n\nIf it is a *true Agile*, there is no such thing as high or low quality. It is either *done* or *not done*. Agile has never called for abstract high quality. It should have *just enough* quality to *be releasable*. There is no high and low. It is a yes/no question, plain and simple. Either it is done (100%) or not (0%); no other options. This is actually the key element that creates the ground for inspection, enables feedback loops, and creates enough pressure to keep work limited and completed inside the sprint. If you don't have it *done*, the whole empirical loop falls apart, and you don't have any Agile anymore, no matter how many rituals are played.   \n  \nIf we have to call for an *abstract* quality, it typically means that what we produce is not a *releasable increment*. \n\nThat's an example of *deep* and *honest* reflection regarding quality in Agile. If the team isn't ready to reflect this way, then it fails to demonstrate one of the five values, probably the critical one when it comes to improving: *courage*. \n\nIt may sound not as *comforting* as many Agile teams are used to having this conversation, and if it causes discomfort, it could be a way better signal to run a meaningful retrospective than anything else. \n\np.s. Great topic for a LinkedIn post, by the way :-) ",
              "score": 1,
              "created_utc": "2026-02-18 00:42:34",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5zq288",
                  "author": "dave-rooney-ca",
                  "text": "I beg to differ. Extreme Programming began with the position that quality was nothing but excellent. I've work on and with teams who've done XP and had no field-reported defects for years.\n\nFor those who came to agile via Scrum, your position would sound familiar. In XP it does not.",
                  "score": 1,
                  "created_utc": "2026-02-18 03:42:23",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5vpcd7",
          "author": "ya_rk",
          "text": "One interesting thing I notice is that systems are generally very resilient, they can handle a lot of changes, disruptions, and inefficiencies: People will find a way to get their work done. So it really takes something atrocious to fuck things up rapidly.\n\nI also experienced a major failure that left a massive impression on me, but it was a failure that took years to unfold, but until it fell apart it seemed to be humming along fine. The responsible traits in my opinionated order of culpability\n\n\\* Building a very big complex product and trying to deliver it all at once\n\n\\* Never talking to customers, only internal \"proxy stakeholders\" who (as it turned out), themselves never talked neither customers nor to the project's sponsors\n\n\\* Teams owning parts of the stack and treating each other as black boxes with interfaces\n\nBasically, the company got tired of sponsoring this project and paying hundreds of salaries without having anything to show for it. The proxy stakeholders kept adjusting and increasing the scope based on their current opinion without any market validation. The project was in constant integration struggles, as teams were expanding their own scope while waiting for other teams for integration, and by the time the other teams were ready, the expanded scope meant that now the other team has to wait.\n\nFrom the inside it didn't look so bad since we reported to the proxy stakeholders faithfully and transparently and we never got back a signal that something's wrong.\n\nA few days before almost everyone got fired from the project, we were sitting with one of the most senior proxy stakeholders who talked our head off for an hour about how we won't release anything without making proper compherensive printed manuals. He was going over font sizes with us like it's a mission critical fact days before everyone was getting fired.\n\nHe had (20 or so years ago) hands on experience with what the product was aiming to automate, so his focus was on the industry standards of his time, completely detached from the current reality (in a later incarnation of the product i did meet some customers and they showed me the locked cabinet where they store printed manuals that are never opened). And of course, completely detached from the financial reality of the whole enterprise, despite the fact that it was his primary responsibility.\n\nIn the end he got promoted and nearly all the engineers fired. That left a huge impression on me on the realities of organizations and how things can seem to function locally but completely be derailed globally.",
          "score": 6,
          "created_utc": "2026-02-17 15:31:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5vyx7w",
              "author": "fixingmedaybyday",
              "text": "The proxy stakeholder thing has been a huge one for me.  My bosses would schedule meetings with department leads who would rather appear decisive than be actually right.  And then would come the political power games of “so-and-so is the highest paid person in the room, so they decide.”  thing comes up.  And then next thing you know the whole thing is fk’d up and nobody is happy.",
              "score": 5,
              "created_utc": "2026-02-17 16:18:53",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5w1dk7",
                  "author": "EarlOfAwesom3",
                  "text": "Yeah they want to take the decision so bad but not the responsibility when it fails. Its the same rigged game everywhere. ",
                  "score": 3,
                  "created_utc": "2026-02-17 16:31:20",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            },
            {
              "id": "o5vwarb",
              "author": "EarlOfAwesom3",
              "text": "That's rough man. Reading that he got promoted and egineers fired sums it all up. Big corporation I guess?\n\nYour second point explains a lot, if you do not include your stakeholders (customers and sponsors) and have short and direct responses, you could end up having different realities. ",
              "score": 2,
              "created_utc": "2026-02-17 16:05:56",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o5ytsxn",
              "author": "Nowhere-Man-Nc",
              "text": "This \\^\\^\\^ comment is as agile as only a comment could be. Let's see whether it will get as many upvotes as it deserves. I could do only one, unfortunately. ",
              "score": 2,
              "created_utc": "2026-02-18 00:45:49",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5vulwe",
          "author": "Puzzleheaded-Bug6244",
          "text": "All of them.",
          "score": 7,
          "created_utc": "2026-02-17 15:57:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5vxx4h",
              "author": "fixingmedaybyday",
              "text": "Sums up all the frustration I’ve had over the years.",
              "score": 3,
              "created_utc": "2026-02-17 16:13:52",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5w2tib",
                  "author": "ConsiderationSea1347",
                  "text": "I have worked in this industry for about twenty three years - the culture right now is without a doubt the worst it has ever been and it is only getting worse. We need another agile manifesto moment like the late 90s and return to humane and trust based engineering practices. Most contemporary SE process is rooted in the idea that software engineering can be measured and orchestrated like car manufacturing where each step in an assembly line has the same inputs, outputs, and tooling. No interesting system in SE is that predictable. ",
                  "score": 9,
                  "created_utc": "2026-02-17 16:38:54",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o5vz4x5",
                  "author": "Puzzleheaded-Bug6244",
                  "text": "The most agile place, I have been was not agile by name. At all. But we sure as hell were agile by game. It is a fun place to be.",
                  "score": 2,
                  "created_utc": "2026-02-17 16:19:56",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o6e0gse",
              "author": "lisnter",
              "text": "Yep - all of them.  I'm not a fan.  About the only thing I've found useful is the smaller release cycles.  Agile's lack of architecture, documentation, analysis, design and QA just don't work.",
              "score": 1,
              "created_utc": "2026-02-20 08:20:44",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5w8qsy",
          "author": "awwaygirl",
          "text": "Offshoring the PM role, so that individual did not work the same hours as the rest of the team and was totally disconnected from the client. Real quality status reports and raid logs, let me tell ya",
          "score": 2,
          "created_utc": "2026-02-17 17:09:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5x5m6c",
          "author": "kexnyc",
          "text": "What you describe, as you probably know, is not agile. I lost count of the clients I’ve had that think “tweaking” agile to their processes was OK. So when it fails, as it always does, they blame agile. \n\nI have yet to see a project that follows Agile, Scrum or otherwise, fail because of agile. \n\nAgile is not magic. It is a process. If you follow it as proscribed, it works.",
          "score": 2,
          "created_utc": "2026-02-17 19:42:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5xdmro",
              "author": "EarlOfAwesom3",
              "text": "You are absolutely right. It wasn't. \n\nIt wasn't even software development to begin with. There was no clear goal, no requirements, no design, weak testing and the purpose of it all was really questionable. Just a bunch of developers doing stuff and hoping it fits somehow in the end. \n\nBut I have to say, agile software development is not a process. The framework offers processes that you can use, but you don't have to. Agile SE is defined by the manifesto in the way that:\n\n* People matter over processes\n* You always have runnable software to show\n* You include your stakeholders from the beginning\n* You can quickly respond to change\n\nAnd in retrospect, not a single point was fullfilled. How do 4-8 weeks of rotting branches and waiting for other devs fit into \"respond to change\"? How do you justify starting every ticket simultaneously but after 2 weeks you have nothing done? How do people matter over the process if they get ignored when they object and say \"How about we finish smth first\"? \n\nExactly. ",
              "score": 2,
              "created_utc": "2026-02-17 20:20:25",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5y5chd",
          "author": "agileliecom",
          "text": "What's interesting about your list is that almost none of those problems would have been solved by adding a Scrum Master.\n\nNo autonomy to make decisions, that's an organizational power structure, not a missing ceremony. A Scrum Master doesn't fix a supervising team in another timezone that rejects your decisions. A standup doesn't fix \"every man for himself\" when the incentives reward individual ticket assignment over collaboration.\n\nThe principal dev assigning tickets in sprint planning is command and control. But I've seen plenty of teams with a certified Scrum Master where the same dynamic plays out with different vocabulary. The PO \"prioritizes\" instead of \"assigns.\" The sprint goal is technically collaborative but everyone knows what they're working on before the meeting starts. The structure changes. The power dynamic doesn't.\n\nWhat you're describing is something I've been writing about called Risk Management Theater. Processes that perform control instead of practicing it. Everything in \"Doing\" because it looked good on reports. Code review by a supervising team in another timezone that existed to gatekeep, not collaborate. Feature branches rotting for weeks because the ceremony of approval mattered more than actually shipping.\n\nThe process wasn't failing. It was working exactly as designed. To create the appearance of oversight for stakeholders. Not to ship software.\n\nThe teams you worked on later that felt better probably weren't better because they had \"more Agile.\" They were better because someone with authority actually let the team make decisions. That's not a process improvement. That's a power structure change, no certification covers that.",
          "score": 2,
          "created_utc": "2026-02-17 22:32:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5y8dp7",
              "author": "EarlOfAwesom3",
              "text": "It's funny how accurate it is, I'll give you that. \nYeah probably the \"agility\" was more felt in other teams not _only_ because of better processes but because of the absence of authority...or let's say because of the presence of trust. And in this trust, people were empowered to decide and deliver.",
              "score": 2,
              "created_utc": "2026-02-17 22:48:20",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o636f22",
                  "author": "agileliecom",
                  "text": "his makes me think about programming in the early days before Agile, shipping real good software...",
                  "score": 1,
                  "created_utc": "2026-02-18 17:27:18",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5ynt85",
          "author": "Nowhere-Man-Nc",
          "text": "The top two Agile killers in my experience:\n\n1. Manipulating the definitions of \"done\" and \"releasable\" is a usual silent Agile killer number 1. Not done, nothing to inspect; that's where the whole empiricism crashes.\n2. Thinking that Agile gives the freedom to choose the right tool is a freedom to skip the whole process altogether because we don't want/don't know how to do it. Typically unpleasant or hard things such as risk management or expectation management are the first victims of this attitude.\n\nActually, these two are anti-Agile behaviors if you consider Agile-by-design, but are good examples of Agile-as-it-is-practiced-by-majority.\n\nIf we speak of Agile-by-design, then the weakest point is the declaration of empiricism, which may be (and by many, including some Agile influencers, is) considered that \"only practical experience matters, and we work with any problem domain as if it were an ideal blackbox\". In fact, the efficient way to experiment is the scientific method, where you have a good, well-grounded theory or at least a model that you prove or disprove by a well-designed experiment. Unfortunately, I've rarely seen an Agile team able to design a sprint as an experiment, at least at the level of DMAIC in SixSigma.",
          "score": 2,
          "created_utc": "2026-02-18 00:12:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5xz30q",
          "author": "PhaseMatch",
          "text": "The basic ones are\n\n- change is not cheap, easy, fast or safe (no new defects)\n- no fast feedback from users on whether the change was valuable\n- Theory-Y management stule\n\nWithout the core technical skills (and refactoring of a legacy code base) to do the former, its a dead duck.  \n\nWithout the last two there is no agility at all, or learning.",
          "score": 1,
          "created_utc": "2026-02-17 22:01:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o60opzz",
          "author": "Ezl",
          "text": "Any agile process where the focus is on adhering to a prescriptive methodology called *Agile ^^(tm)* without actually understanding or [being agile](https://deliveryflow.substack.com/p/agile-is-a-philosophy-not-a-methodology) at all.",
          "score": 1,
          "created_utc": "2026-02-18 08:12:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o62mx8i",
              "author": "bobthegreat88",
              "text": "That's been my experience as well. Large multi-million dollar implementations of whatever enterprise flavor of agile framework is fashionable always seems to end in disaster.",
              "score": 1,
              "created_utc": "2026-02-18 15:59:06",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o62rq03",
                  "author": "Ezl",
                  "text": "Yep.  They do “agile” in a way so oppositional to the actual agile principles that what they’re doing isn’t agile at all but then actual “Agility” still gets a bad rap for not working.",
                  "score": 1,
                  "created_utc": "2026-02-18 16:20:52",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1r8vocr",
      "title": "21 Lessons From 14 Years at Google",
      "subreddit": "agile",
      "url": "https://addyosmani.com/blog/21-lessons/",
      "author": "fagnerbrack",
      "created_utc": "2026-02-19 10:23:05",
      "score": 18,
      "num_comments": 2,
      "upvote_ratio": 0.92,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1r8vocr/21_lessons_from_14_years_at_google/",
      "domain": "addyosmani.com",
      "is_self": false,
      "comments": [
        {
          "id": "o67w6nq",
          "author": "fagnerbrack",
          "text": "**Here's the gist:**\n\nAfter 14 years at Google, the core realization is that thriving engineers aren't necessarily the best programmers — they're the ones who navigate people, politics, alignment, and ambiguity well. The post distills 21 hard-won lessons: start from user problems rather than cool technology, prioritize collective alignment over being right, ship imperfect work to learn from reality, write clear code instead of clever code, and treat novel technology choices as scarce \"innovation tokens\" best spent only where you uniquely must innovate. It emphasizes that your code won't advocate for you — people do, so make your impact legible. At scale, even bugs become dependencies users rely on, and most slow teams suffer from misalignment, not lack of effort. Writing and teaching sharpen your own understanding, glue work is vital but must stay visible and bounded, and every metric exposed to management will eventually be gamed (so pair speed metrics with quality ones). Admitting what you don't know builds psychological safety, your professional network outlasts any single job, and most performance gains come from eliminating unnecessary work rather than optimizing what remains. Process should reduce uncertainty, not create paper trails, and eventually time becomes worth more than money. The throughline: expertise compounds through deliberate practice, and a long engineering career ultimately revolves around people — the users you build for and the teammates you build with.\n\nIf the summary seems inacurate, just downvote and I'll try to delete the comment eventually 👍\n\n[^(Click here for more info, I read all comments)](https://www.reddit.com/user/fagnerbrack/comments/195jgst/faq_are_you_a_bot/)",
          "score": 14,
          "created_utc": "2026-02-19 10:23:05",
          "is_submitter": true,
          "replies": []
        },
        {
          "id": "o6hdspg",
          "author": "Heisenberg_7089",
          "text": "Following",
          "score": 1,
          "created_utc": "2026-02-20 20:04:12",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r7yej1",
      "title": "An agile planning tool that can save our distributed sprint planning?",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1r7yej1/an_agile_planning_tool_that_can_save_our/",
      "author": "Sad_Translator5417",
      "created_utc": "2026-02-18 09:24:16",
      "score": 15,
      "num_comments": 35,
      "upvote_ratio": 0.82,
      "text": "The situation: sprint planning across 3 time zones. Devs in different locations and \"not-so-connected\". Used that bc i can't call it disconnected at the moment. retrospectives. Not looking for perfection here, bc that might not fcking happen, just something that'll help us reduce the disconnect. \n\nOur ideal is collaboration in real-time, mapping user stories, estimate together and run proper retros with sticky notes and voting. What tools have helped your distributed teams actually plan together effectively?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1r7yej1/an_agile_planning_tool_that_can_save_our/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o60wyc8",
          "author": "Brave_Afternoon_5396",
          "text": "A tool to fix timezone chaos? Your issue is async culture, not software.",
          "score": 8,
          "created_utc": "2026-02-18 09:29:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o60zjel",
              "author": "Sad_Translator5417",
              "text": "A tool to improve connection",
              "score": -2,
              "created_utc": "2026-02-18 09:53:23",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o611l8u",
                  "author": "Brave_Afternoon_5396",
                  "text": "How is your async culture? ",
                  "score": 1,
                  "created_utc": "2026-02-18 10:11:52",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o611eld",
          "author": "kenwards",
          "text": "What about moving your retros to an infinite canvas?  Miro has helped us with that and i know they have a sticky note voting feature, but i haven't used it. Figma is also a good option and it maps user stories visually quite well. Bot are worth a shot ngl. ",
          "score": 3,
          "created_utc": "2026-02-18 10:10:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o612byz",
              "author": "Sad_Translator5417",
              "text": "i apprciate the insights. i'll try both and see what works for us. ",
              "score": 1,
              "created_utc": "2026-02-18 10:18:33",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6168w0",
          "author": "ginger_ink",
          "text": "Not entirely sure of rules around promotion on this sub so please delete if this goes against.\n\nOur team is not spread across timezones but we are fully remote and everyone comes from a background where we've worked with global engineering teams so have a good understanding of the value of real-time collaboration and challenges of async planning.\n\nI'm part of the team building [ludi.co](http://ludi.co), we used to be called Metro Retro.\n\nThere's a few things in our product that might help:\n\n\\- Loads of pre-made planning, refinement and retro templates so you can have some clear guard rails.\n\n\\- Private writing and anonymous modes to help encourage openness and remove bias for people who might not normally speak up.\n\n\\- Comment/discussion on sticky notes, task cards etc level to help with more context when you don't want walls of text on your board\n\n\\- Facilitators can lock board layouts so things don't get messy when they are not there.\n\n\\- Task action creation which notifies assignees and is all tracked in a very straightforward dashboard.\n\n\\- Access controls for boards/teams in your account\n\n\\- Voting, polls etc\n\nWe're a Miro alternative focused on product dev teams and agile. You can try all features free, no card required for 30 days.\n\nApologies for being a corporate shill, but I'm hoping this helps your team and current issues.\n\nOne of the other commenters made a good point though, this may be less a software issue and more an async culture issue. Either way, hope you come right.",
          "score": 3,
          "created_utc": "2026-02-18 10:52:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o61b7y8",
              "author": "Sad_Translator5417",
              "text": "I will check the tool",
              "score": 1,
              "created_utc": "2026-02-18 11:34:01",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o63i0ih",
          "author": "WideFunction6166",
          "text": "online whiteboard there are several",
          "score": 2,
          "created_utc": "2026-02-18 18:18:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o60yjug",
          "author": "sugarr_salt",
          "text": "Distributed sprint planning is hard and anyone who says otherwise hasn't done it. I'd suggest you keep retros super structured. Like actual templates, not vibes. Once everyone feels heard the disconnected feeling fades on its own.",
          "score": 1,
          "created_utc": "2026-02-18 09:44:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o60zoh7",
              "author": "Sad_Translator5417",
              "text": "Simple on paper but it can be hell when you've to do it",
              "score": 1,
              "created_utc": "2026-02-18 09:54:38",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o616neq",
          "author": "mmmleftoverPie",
          "text": "What are the timezones?    Is there no overlap at all?",
          "score": 1,
          "created_utc": "2026-02-18 10:56:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o61bbod",
              "author": "Sad_Translator5417",
              "text": "There are overlaps but not enough to do much",
              "score": 1,
              "created_utc": "2026-02-18 11:34:51",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o61iqd0",
                  "author": "Ezl",
                  "text": "How much overlap per day?",
                  "score": 2,
                  "created_utc": "2026-02-18 12:28:23",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o61pubu",
                  "author": "mmmleftoverPie",
                  "text": "If there's an opportunity to all meet at once, then maybe the problem isn't the timezone 🤔",
                  "score": 1,
                  "created_utc": "2026-02-18 13:12:59",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o618qdi",
          "author": "CutNo8666",
          "text": "Miro is good.  There's an integration app the links with JIRA and can import stickies in Miro and make stories in JIRA.  Also great for program board.",
          "score": 1,
          "created_utc": "2026-02-18 11:13:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o61bjmt",
              "author": "Sad_Translator5417",
              "text": "I'll check how the combo works",
              "score": 1,
              "created_utc": "2026-02-18 11:36:36",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o61sp4s",
          "author": "Low-Bother6318",
          "text": "u/Sad_Translator5417 Our teams are also located in different time zones. The best tool that works for us is StoriesOnBoard. We use it for visualizing our backlog on a user story map. We are an agency so we have many new projects all the time and we prefer to kick them off with story mapping sessions. I found this approach really helpful. We can map out our application focusing on real user value from start to end while gaps and risks are popping up early before we even commit to write a single line of code. Pretty useful in discovery and refinement as well. It works great to define user personas, map out their journeys and build our releases and prioritize user stories. There is even an AI in the tool that saves some time adding details to our user stories as well. StoriesOnBoard really helps us to always access up-to-date information of our projects and sync changes with Jira or Azure DevOps. Our team is a big fan of it. However, you should consider to rethink your workflow to become more efficient. A great tool is indeed comes with benefits but you also need to make sure it is aligned with your needs.  ",
          "score": 1,
          "created_utc": "2026-02-18 13:29:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o63yts1",
              "author": "BiologicalMigrant",
              "text": "You use Jira AND Azure DevOps?",
              "score": 1,
              "created_utc": "2026-02-18 19:33:38",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o67hxn9",
                  "author": "Low-Bother6318",
                  "text": "We are an agency, we don’t always get to choose and we must go with what our clients use. Some of our enterprise clients are deep in the Microsoft ecosystem and require Azure DevOps, while usually our startup clients run on Jira. We allocate our teams with the best match for each project. We are lucky to have a few core higly skilled folks who are very experienced in their own fields. Our biggest challenge was that our BAs and PMs had to context-switch between different UI/UX for planning, which killed our internal efficiency. We do all our high-level discovery, journey mapping, and release slicing in StoriesOnBoard regardless of the client's tech stack. When we are ready to build, we simply sync the map to their specific Jira or ADO instance. This allows our org to have a standardized discovery process even when the execution tools vary.",
                  "score": 1,
                  "created_utc": "2026-02-19 08:03:42",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o63yyp4",
              "author": "BiologicalMigrant",
              "text": "What kind of detail does the AI know about your users that your team doesn't?",
              "score": 1,
              "created_utc": "2026-02-18 19:34:17",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o67klkp",
                  "author": "Low-Bother6318",
                  "text": "The AI in StoriesOnBoard doesn’t have any secret knowledge rather, it acts as a powerful contextual engine fueled by the data we provide. We feed it the strategic core of our project. Everything from the product purpose and key features to target users, platform details, etc. We can customize the persona attributes, the AI has a deep understanding of who we are building for and what we aim to achieve. Basically the AI is aware of the context and understands the story map.\n\nIt serves as a discovery partner rather than a replacement for our team. By analyzing the persona details against our project scope, it identifies missing user goals, suggests journey steps we might have overlooked, and spots gaps in the overall flow. Our workflow usually involves mapping the journey ourselves first, then using the AI to uncover hidden opportunities and generate the first draft of story details, Gherkin syntax, and test cases. This drastically reduces manual labor, allowing our BAs to focus on the truly unique and complex aspects of the project while ensuring our documentation is development-ready in a fraction of the time. This approach works really great for us so far. ",
                  "score": 1,
                  "created_utc": "2026-02-19 08:29:33",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o61tzc6",
          "author": "ploume506",
          "text": "Start by creating a team work agreement; this will lay the foundation for your asynchronous collaboration. From there, keep it simple with a whiteboard (mirror, wall-mounted, etc.).",
          "score": 1,
          "created_utc": "2026-02-18 13:36:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o62badd",
          "author": "Personal-Lack4170",
          "text": "If the team feels disconnected, improving retros might have more impact than switching tools",
          "score": 1,
          "created_utc": "2026-02-18 15:05:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o62gq61",
          "author": "dontcomeback82",
          "text": "IMO if you have no overlap you have 3 teams not one.  \n\nSplit into sub teams.  Have one person attend the other teams sprint planning or sprint prep to keeps teams in sync.",
          "score": 1,
          "created_utc": "2026-02-18 15:30:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o62nvfv",
          "author": "TheSauce___",
          "text": "I don’t understand, if you want to sync just hold a meeting in everyone’s time zones. What else are you looking for?",
          "score": 1,
          "created_utc": "2026-02-18 16:03:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o647bv0",
          "author": "PhaseMatch",
          "text": "Frankly - don't.\n\nYou are going to have less effective communication no matter what you do; async working just drives silos and individuals doing \"their task\" not a whole-of-team collaboration.\n\nUnless the team is exceptionally skilled at communication, and small (<5 people) \n\nYou can use a virtual whiteboard for most things, but you'll limp along with a lot of communication gaps, people missing key ideas, \"accidental adversaries\" and hand-off lags all over the place in your workflow. \n\nA virtual whiteboard can help, but the pain will never stop;  you will slide back towards more stage-gate based delivery and bigger batches over time.  \n",
          "score": 1,
          "created_utc": "2026-02-18 20:12:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o65m3w8",
          "author": "SamfromLucidSoftware",
          "text": "Set core team hours and protect them. Aim for at least a 2-4 hour overlap where everyone is online for planning and retro. Rotate the meeting time each sprint so 1 time zone is not always stuck with a late night slot. You can also ask people to drop story notes and rough estimates 24 hours before so the live session is just closing gaps. \n\nI also don’t think a tool fixes this on its own. The bigger level is async culture and a structured retro template.",
          "score": 1,
          "created_utc": "2026-02-19 00:23:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o65mp1q",
          "author": "easy-agile",
          "text": "The three timezone challenge is brutal and it's always about finding the right mix of async and sync work.  \n  \nFor sprint planning specifically, the pattern that works best is doing the heavy lifting asynchronously first. Have your product owner refine stories ahead of time, get initial estimates through async voting (planning poker style), then use your sync time just for the conversations that actually need everyone together - the tricky estimates, dependencies, and final commitment. Tools like Miro or Mural work well for the collaborative mapping piece, and something like TeamRhythm can handle the story mapping and estimation workflow right in Jira if that's where you live.  \n  \nFor retros, the key is making sure people can contribute thoughts before the meeting so you're not sitting in awkward silence waiting for folks to think. Anonymous input helps loads when people are in different comfort zones with speaking up across timezones. The voting and grouping can happen live, but get the initial brain dump done async first.  \n  \nThe biggest thing we see teams get wrong is trying to make everything synchronous when you've got that timezone spread. Accept that some collaboration has to happen in stages, and focus your precious sync time on the decisions that actually need discussion rather than information gathering.",
          "score": 1,
          "created_utc": "2026-02-19 00:26:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6716jj",
          "author": "Individual_Mall_3928",
          "text": "I worked with remote teams and I simply shared my screen during meeting ti make sure that we are all looking at the same thing at the moment…",
          "score": 1,
          "created_utc": "2026-02-19 05:39:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o67gzck",
          "author": "TheScruminator",
          "text": "Turn cameras on by default.",
          "score": 1,
          "created_utc": "2026-02-19 07:54:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o67mnjh",
          "author": "impossible2fix",
          "text": "We had the same issue across time zones. The problem wasn’t the call, it was decisions getting lost between chats and docs.\n\nWhat worked was prepping async on a shared board, then using overlap time only to align. We use Teamhood for that, so stories, estimates, and comments stay on the same items, and people who wake up later actually see the reasoning, not just the outcome.\n\nRetros can be any whiteboard tool but linking actions back to real tasks matters more than the retro itself.",
          "score": 1,
          "created_utc": "2026-02-19 08:49:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6rxk3d",
          "author": "Queasy-Tomorrow-2543",
          "text": "I will suggest you use Miro for distributed sprint planning. Their visual boards let everyone dump user stories as stickies, rearrange for dependencies, and vote on estimates live, without timezone issues. Use retros to stick actions right on the board and then use Jira for tracking post-planning. Start with their free tier to see if you like the experience.",
          "score": 1,
          "created_utc": "2026-02-22 14:26:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o616p2v",
          "author": "word2vishnu",
          "text": "Taiga.io\n\nThank me later. .. or don’t. ",
          "score": -1,
          "created_utc": "2026-02-18 10:56:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o61bd0b",
              "author": "Sad_Translator5417",
              "text": "I'll check it out",
              "score": 1,
              "created_utc": "2026-02-18 11:35:09",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r8y1xn",
      "title": "Examples of agility \"rollback\" ?",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1r8y1xn/examples_of_agility_rollback/",
      "author": "saxolivier",
      "created_utc": "2026-02-19 12:35:02",
      "score": 9,
      "num_comments": 16,
      "upvote_ratio": 1.0,
      "text": "Hello, I was wondering whether some of you have already experienced a “rollback” of agility, or a shift toward other project management approaches.\n\nFrom my experience, frameworks are sometimes adapted or watered down, but I’ve rarely seen a true move to a different methodology once Scrum or Kanban has been implemented. The only examples I’ve encountered are projects under heavy pressure that temporarily fall into a chaotic mode before eventually returning to Scrum.\n\nI’d be very curious to hear about your personal experiences on this topic !",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1r8y1xn/examples_of_agility_rollback/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o68k621",
          "author": "ckdx_",
          "text": "I find this interesting. Why is it that (some) projects under heavy pressure fall back to a chaotic model? What is it about Scrum that is not being provided in times of need that pushes organisations away from Scrum at the most pivotal moments?",
          "score": 4,
          "created_utc": "2026-02-19 13:24:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o68m7g9",
              "author": "Kenny_Lush",
              "text": "Because the utopian vision of small change and developer-user collaboration falls apart when something goes off the rails and big changes are needed fast by someone with the power to say “damn the developers and users.” I suspect this is how “weaponized agile” became a thing: keep all of the micromanagement bits (“STAND UP!”, “SPRINT!”) but move overall control back to the people who always thought they knew best.",
              "score": 8,
              "created_utc": "2026-02-19 13:36:37",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o69adgd",
                  "author": "fixingmedaybyday",
                  "text": "That’s what happens where I’m at and it usually involves the same 4-6 developers.  However, when upper management thinks they’re underperforming, they’ll hire a new manager and at the same time keep trying new management processes with people who have never even gotten a “hello world” program written.  And then when SHTF, they pull 1-2 devs off, make them responsible for everything and push them til they’re ready to drop dead.  Regardless, the answer is almost never hire another developer.",
                  "score": 3,
                  "created_utc": "2026-02-19 15:44:41",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o68lt3a",
              "author": "saxolivier",
              "text": "Usually it's linked to poor or partial implementations of Scrum, the delivery is bad so the top management goes into \"panic mode\" and start interferering with everything until the situation calms down and there is another urgency somewhere else. My point is not that Scrum doesn't structurally works in heavy pressured environment, more that even in the cases of bad implementation, people rarely go back to V Cycle or shift to other project management methods",
              "score": 3,
              "created_utc": "2026-02-19 13:34:18",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o68nfkc",
                  "author": "ckdx_",
                  "text": "But that is my point; how has delivery under Scrum got so bad that an organisation needs to transition into a 'panic mode'? And why under these conditions does Scrum not provide the necessary reassurance?\n\nI've been through the same experience. In fact, I'm living through this presently. The truth of the matter is that we are regressing away from Scrum back to a traditional waterfall model. Our Scrum implementation - like you say - was poor. It did not provide the delivery assurances that the business needed and the project is a late and chaotic mess. We are also reverting back towards a more traditional management model, where the line manager leads the team and is accountable for delivery. I'm not suggesting this is a good thing (or a bad thing), but it is just one data point from the real world.",
                  "score": 3,
                  "created_utc": "2026-02-19 13:43:38",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6aj34u",
          "author": "PhaseMatch",
          "text": "I'm only really seeing that where people were not very agile in the first place, meaning  \n  \n\\- change wasn't cheap, easy, fast and safe (no new defects)  \n\\- they didn't get fast feedback on the value that change created  \n  \nWhere agility wasn't seen as primarily technological in nature, and/or where it was not viewed as a light weight way to manage business risk, it's being rolled back.  \n  \nIn those situations, it was largely theatre, not an effective business strategy.    \n\n",
          "score": 2,
          "created_utc": "2026-02-19 19:17:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o68p2np",
          "author": "Budget_Pin5828",
          "text": "Agile is just values and principles. So no, I dont see a rollback.\n\n\nHowever, as it relates to Agile frameworks like scrum... with the introduction and adoption of AI, I believe methods like scrum will be antiquated and go away.",
          "score": 3,
          "created_utc": "2026-02-19 13:52:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o68rc6c",
              "author": "saxolivier",
              "text": "Interesting, but what do you think will replace them ?",
              "score": 2,
              "created_utc": "2026-02-19 14:05:28",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o69455y",
                  "author": "Budget_Pin5828",
                  "text": "It's still pretty early, but I do have my hypotheses.  For context, I've been an IT Management Consultant for over 20 years.\n\nWhere AI Native talent exists, particularly on the Dev side, I could see the re-emergence of XP and an explosion of Kanban.  I'm actively dismantling Scrum right now for an AI native Dev Team because scrum was slowing them down.  Scrum as it exists today was a constraint to delivery.  Not an enabler. For example, we don't need team backlogs or pbis anymore and the ceremony cadence felt stupid and inefficient. So we decided to remove it to see what would happen.   This is an evolving experiment.  Currently, we're using hyper-sprints. I'll let you know how it shakes out.  As of now... everything is humming...",
                  "score": 1,
                  "created_utc": "2026-02-19 15:13:33",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o68v0gy",
          "author": "WaylundLG",
          "text": "I have seen that human nature is to return to what you know and are most comfortable with under stress. This _could_ be a return to other project management approaches. However, especially in the software industry, many organizations have no project management at all, so everyone regressed to what they individually feel comfortable with, which creates the feeling of chaos. I did work with a telecom that regressed back to more traditional project management, but like I said, that seems rare.",
          "score": 1,
          "created_utc": "2026-02-19 14:25:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ds942",
          "author": "ScrumViking",
          "text": "I know of one example where a smaller telco was on the track of really beating the larger competition and while their agile transformation wasn’t ideal it was on the right track. Then they did a tender for supplier which was won by an Indian company, forcing most of the agile senior folks to be pushed out (there would now be supplied by said company). For full context more than 80% of the folks in their out department were external contractors, so this lead to a massive turn over. \n\nUnfortunately, while this new supplier claimed to understand agile development principles and practices, all their new scrum masters were basically project managers or architects; Senior personnel relabeled to satisfy the customers requirements. I was one of the last scrum masters from the old group left to try and help them understand their role (and massive challenge). \n\nI kept in contact with my former product owner. He  told me that 6 months after I had gone there was little left of what we built. A full reset he called it. There were still a few people from the old org trying their best to rebuild but it never really fully recovered from the big reset. \n\nFast forward to today: the company which was once the template for small and competitive telco was sold by its mother company to venture capitalists. Scrum master roles were stripped, and their accountability shifted to the product owner, making them effective project managers. \n\nThe services provided by the telco have declined over time. Recently they were in the news regarding a hack and data leak scandal. While hacks are unavoidable in the long run, the size of the data leak and the sensitivity of the user data feels like something the old company would never have had let happen. Then again I might be biased. \n\nIt’s an immensely sad thing to see all your efforts so carelessly tossed overboard for the sake of chasing lower costs. While the two years I was there didn’t feel like a complete waste of time (I gained a lot of experience) uit sucks to see all the results of your labor being wiped out.",
          "score": 1,
          "created_utc": "2026-02-20 07:04:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6q1m00",
          "author": "Agitated-Arm5129",
          "text": "  I work for a large organization and over the last year there has been a rollback. We were full agile with teams doing scrum and kanban. New leadership came in and put in place a software development life cycle with toll gates. I believe that there is a belief that following this approach will lead to gains with AI programming, essentially putting the time in up front and defining all requirements will lead to more substantial gains with AI during development and testing. I also believe this aligns with the current philosophy of everyone can now be product or that product can be developers with the help of AI. The next year is going to be interesting to see which direction gains traction and how long it will take to correct. I’m not saying that positions won’t be eliminated but there are still reasons you need different roles, but I do think it is lining up to be a power struggle between product and engineering driven by pressure from ELT to eliminate positions and show productivity gains with AI.",
          "score": 1,
          "created_utc": "2026-02-22 04:58:15",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r9r2s4",
      "title": "Tested 6 backlog management tools - my results",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1r9r2s4/tested_6_backlog_management_tools_my_results/",
      "author": "vitaminZaman",
      "created_utc": "2026-02-20 09:42:37",
      "score": 9,
      "num_comments": 9,
      "upvote_ratio": 0.91,
      "text": "Work in a mid-size product org with 3 dev squads, a growing remote workforce, and a small PM team. We did an eval between six backlog tools; \n\n* ClickUp, \n* Productboard, \n* Confluence, \n* Yodiz, \n* Trello, and \n* Jira, earlier this year.\n\nPerformance differences were minor. Honestly, the only thing that really stood out was how each option handled sprint visibility, roadmap traceability, and stakeholder-facing views. Jira won for us on depth of issue tracking and how well it fit into our existing dev toolchain.\n\nOur eval doc ballooned into a 22 page doc. How others kept their evaluations focused without going in circles.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1r9r2s4/tested_6_backlog_management_tools_my_results/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o6ehpnd",
          "author": "lucina_scott",
          "text": "We’ve been there what helped us was defining 3–5 non-negotiable criteria upfront (e.g., sprint visibility, integrations, reporting) and scoring only against those.\n\nAnything outside that list went into a “nice-to-have” bucket so the eval didn’t spiral into endless edge cases.",
          "score": 4,
          "created_utc": "2026-02-20 11:00:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6g180v",
          "author": "Firerage65",
          "text": "Peeps hate Jira but I am honestly a big fan. Its ugly but it works. What was no.2 for you out of interest?",
          "score": 2,
          "created_utc": "2026-02-20 16:20:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6ku8yx",
              "author": "ScrumViking",
              "text": "Jira deep at its core is still a ticketing system. They took over and implemented greenhopper to have visual Kanban lanes and introduce some elements you might know from scrum but it never was designed to be a tool that accelerates what agile teams do.",
              "score": 0,
              "created_utc": "2026-02-21 10:00:15",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6kxmsz",
          "author": "CaptainMack90",
          "text": "Try evaluating Linear",
          "score": 1,
          "created_utc": "2026-02-21 10:33:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6kyrvx",
          "author": "bbc00per",
          "text": "Agile Tools (https://agile-tools.io) has a self-cleaning and item-limited backlog mechanics. Note: website overhaul coming soon. You can model your work around so-called Value Units. Not just a flat list of projects, but a hierarchy of products, services, projects, anything your company uses - the tool is not imposing a vocabulary. Each Value Unit has a precreated backlog and a workboard. Pull over push mentality, goal and team first model. Lot more coming. Feedback welcome. 🙏",
          "score": 1,
          "created_utc": "2026-02-21 10:44:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6tws1x",
          "author": "woodnoob76",
          "text": "It sound like we’re mixing up tools and practices. I’m an old timer agilist, I’ll match Jira and else with basic tools any day \n- Google sheet or any spreadsheet for the backlog, velocity or cumulative flow charts including roadmap projections\n- maybe Gmail or any thread based communication for keeping track of the definition and acceptance criteria on each story (remember that we make some doc and throw the story away, right? It’s volatile)\n\n\nAs for sprint visibility: who cares, have short releases (6 weeks max give or take) and use it as a baseline for evaluating progress\n-  a visual board (can even be a love page of PowerPoi) for story map management and drawing the roadmap \n- whatever comes for Kanban (trello or any kanban tool, or any drawing system like ppt, Miro, whatever)",
          "score": 1,
          "created_utc": "2026-02-22 20:02:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6enor7",
          "author": "Bowmolo",
          "text": "Interesting perspective.\n\nI'd never consider 'backlog management' to be a thing. I actually wouldn't want to manage a backlog at all. What I would prefer to manage is a continuous, ever improving flow of (potential) value to customers (or however one likes to call beneficiaries).\n\nI find the focus on managing a inventory of (more or less valuable) ideas instead of exploration of options to be a dysfunctional mental model. \n\nBut ok, I'm not a PM. So I may be wrong.",
          "score": 1,
          "created_utc": "2026-02-20 11:49:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6fn5ws",
              "author": "theproductref",
              "text": "That is something you also manage, it’s just a higher level. Your opportunity backlog is where you have your roadmap, which is what you are describing. In order to take this idea to reality, you have to decompose that flowing value into something more concrete that can be built in a semi managed way that brings iterative value. That is your sprint backlog, which is what Jira and other tools here are for",
              "score": 1,
              "created_utc": "2026-02-20 15:14:13",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r63tvn",
      "title": "How do you actually measure if your engineering team is improving or just... busy?",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1r63tvn/how_do_you_actually_measure_if_your_engineering/",
      "author": "scrumsdotcom",
      "created_utc": "2026-02-16 08:05:44",
      "score": 8,
      "num_comments": 37,
      "upvote_ratio": 0.79,
      "text": "Velocity? Cycle time? Story points completed? Or do you just go by gut feel?\n\nGenuinely curious how other teams track whether they're getting faster and better vs just working harder.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1r63tvn/how_do_you_actually_measure_if_your_engineering/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o5nf9a3",
          "author": "noahjacobson",
          "text": "You measure business value produced, and see if that is increasing. If you aren't able to tie business value to the work being done, how are you prioritizing the dev team work?",
          "score": 14,
          "created_utc": "2026-02-16 08:14:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5ol458",
              "author": "goobersmooch",
              "text": "Give me an example of quantitative business value delivered by individual dev teams",
              "score": 9,
              "created_utc": "2026-02-16 13:52:58",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5prov7",
                  "author": "Alpheus2",
                  "text": "Easy:\n- uptime SLAs of a service\n- MTTR\n- security / governance / audit compliance\n- monthly fixed cloud costs per tennant\n- p95 age/lead time of support requests\n- % of budget spent on KTLO/defect recovery per time period\n\nYou can be bold and assume full ownership of a revenue stream as well where appropriate. Usually in a forward- or field-deployed subteam.",
                  "score": 6,
                  "created_utc": "2026-02-16 17:21:17",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o5qhntx",
                  "author": "PhaseMatch",
                  "text": "First comes the business/product strategy  \nThen comes the outcome-based roadmap  \nThen comes the business problems to solve  \nThen comes the features candidates that might solve that problem  \nOr Sprint Goals, if you are that way inclined.\n\nEach of those is effectively a small, extensible project.  \nYou have stated, measurable benefits, and a cost, hence an ROI.\n\nBenefits generally fall into seven classes, often several of these: \n\n\\- saves time (opportunity cost)  \n\\- saves money (actual costs)  \n\\- makes money (increases revenue)  \n\\- risk reduction (internal to the org, or that a customer makes an errror)  \n\\- durability (extending a product's life cycle;  refactoring, updates)  \n\\- convenience (improved UX, faster onboarding, connectivity etc)  \n\\- prestige (brand, user growth, gamification for users etc)\n\nDrill down and you can define what \"success\" means for a given Sprint Goal or feature candidate.  \n  \nMain thing is   \n  \n\\- STOP bringing teams solutions to implement feature factory style  \n\\- START bringing them business problems to solve, that move the dial strategically\n\n",
                  "score": 6,
                  "created_utc": "2026-02-16 19:21:28",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o5prfn0",
                  "author": "weems1974",
                  "text": "Checkout or enrollment funnel time reduced or funnel completion rate increased.",
                  "score": 1,
                  "created_utc": "2026-02-16 17:20:05",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o5pn9e3",
              "author": "ConsiderationSea1347",
              "text": "There is a lot of risk looking at only business value produced if your window is small. Sometimes rapidly producing business value comes at the expense of health and longevity of systems and engineer engagement. \n\nI don’t believe that team efficiency can be measured on timescales less than a year or two (and even then it is really tricky and requires non-quantifiable context) because constantly pursuing short term gains almost always undermines long term gains. ",
              "score": 2,
              "created_utc": "2026-02-16 17:00:40",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o5t9rxg",
              "author": "abacusmaxx",
              "text": "Preach",
              "score": 1,
              "created_utc": "2026-02-17 04:38:35",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5nm5q2",
          "author": "PhaseMatch",
          "text": "Measure business value, not delivery of stuff.  \nCollaborate with the rest of business so you know what is valuable.  \nDaily.",
          "score": 6,
          "created_utc": "2026-02-16 09:20:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ork12",
          "author": "agileliecom",
          "text": "Velocity measures output. Cycle time measures speed. Neither measures whether you're building the right thing or if the code will survive production.\n\nThe teams I've seen actually improve tracked three things: how often deployments cause incidents, how long it takes to recover when something breaks, and how many times the same type of bug shows up twice. Everything else is vanity metrics dressed up as engineering metrics.\n\nStory points completed going up every sprint isn't improvement, it's inflation. Teams learn to point higher so the chart looks good. Nobody gets promoted for saying \"we shipped less but it was better.\"\n\nGut feel gets mocked but honestly a senior engineer who says \"this codebase is getting worse\" is more accurate than any dashboard I've seen. The problem is nobody puts gut feel on a slide deck.",
          "score": 5,
          "created_utc": "2026-02-16 14:27:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5twsi2",
              "author": "Interesting-Ad5589",
              "text": "Totally agree. An informed \"gut feel\" is absolutely invaluable",
              "score": 2,
              "created_utc": "2026-02-17 07:48:16",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o5puwu6",
              "author": "Interesting-Ad5589",
              "text": "Good answer",
              "score": 1,
              "created_utc": "2026-02-16 17:36:24",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5okeye",
          "author": "Nowhere-Man-Nc",
          "text": "None of your listed, these could serve as leading or lagging indicators for the metrics, but the final evaluation must be on the metrics that measure impact on the users, stakeholders, business, company.   \n  \nNo need to invent a bicycle these days: there are DORA to measure throughput and quality, and EBM to measure by four business-oriented dimensions (current value, unrealized value, time to market, ability to innovate).",
          "score": 2,
          "created_utc": "2026-02-16 13:49:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5pur5b",
          "author": "webby-debby-404",
          "text": "We do not measure the team. We measure the product.",
          "score": 2,
          "created_utc": "2026-02-16 17:35:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ngxmb",
          "author": "schmidtssss",
          "text": "How often they want to actually fight you",
          "score": 3,
          "created_utc": "2026-02-16 08:30:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5nf04s",
          "author": "GreatZoran",
          "text": "Well I believe teams reach a limit in improvements and cannot continue forever\n\nTo my windows it is reached when team is predictable and resilient toward support/change \n\nThe moment when team start removing process is already a good indicator to me. It means they embrace quality and good execution",
          "score": 3,
          "created_utc": "2026-02-16 08:12:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5ph49p",
              "author": "MartinFrankPrivat",
              "text": "I do have many years of experience as scum matter and developer - and this the the true answer. If course, other agile leaders will tell you that is not true, you can always improve. But theory and reality sometimes differ. I have been there, i have seen it, I saw others struggle, I struggled on my own. Fact is, teams reach a peak and after that is not much improvement possible.",
              "score": 3,
              "created_utc": "2026-02-16 16:32:30",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5pu7p2",
                  "author": "GreatZoran",
                  "text": "🫶\n\nIs it a fatality ? You are a team which is a predictable cost. You are predictable in delivery \n\nCompany pay and thet get it. It's fair.\n\nAgile purpose is to get a delivery stream under control.",
                  "score": 2,
                  "created_utc": "2026-02-16 17:33:06",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o5pp7ax",
              "author": "ConsiderationSea1347",
              "text": "The downvotes on this response shows how much this subreddit is the marketable Agile TM and not the agile from the original manifesto. Process and metrics are guardrails when there is a deficit of trust and organization. Process and metrics have cost and only return value on teams with dysfunction, though MOST teams have some dysfunction. The most effective teams she process and metrics and sort of just keep delivering whatever comes their way. I worked on one such team and it was the best five years of my professional life. We used a lite kanban with just enough scrum to keep leadership off our backs, every story was a zero or a one story points to simplify planning, there was no team lead or authoritarian style power structure on the team every decision was a discussion, consensus, and even if the team went a way I didn’t like I could trust my coworkers’s competence was high and intentions were good.\n\nProcess and metrics have cost. That cost only provides value if the team cannot thrive without them. Accept and embrace process when you need it but strive to shed it wherever you can. ",
              "score": 3,
              "created_utc": "2026-02-16 17:09:43",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5pvsbz",
                  "author": "GreatZoran",
                  "text": "Ahah so true. \"Let's create metric to reassure the bad product management board.\"\n\nA scrum team deliver value. How they do it is their problem. What they should embrace is the product vision (always with a positive challenge of its value)",
                  "score": 3,
                  "created_utc": "2026-02-16 17:40:34",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5of48w",
          "author": "sentrix_l",
          "text": "Measure business value and ROI. Velocity is only useful when wanting to analyse throughput between teams or team members.",
          "score": 1,
          "created_utc": "2026-02-16 13:18:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5p7hj0",
              "author": "Rruffy",
              "text": "Definitely not between teams and team members!\n\nOnly through time for predictability for the team itself.",
              "score": 2,
              "created_utc": "2026-02-16 15:47:50",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5p9xuc",
                  "author": "sentrix_l",
                  "text": "🍒 was waiting for someone to say this, thanks!\n\nI built sprintflint specifically for predicting how long sprints will actually take to complete 😄",
                  "score": 1,
                  "created_utc": "2026-02-16 15:59:21",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5ol1o7",
          "author": "dnult",
          "text": "Assign business value scores to major  work items and track the total BV delivered or percentage of committed value delivered.",
          "score": 1,
          "created_utc": "2026-02-16 13:52:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5puf3x",
          "author": "Interesting-Ad5589",
          "text": "Gut feel and measurements, neither tell the whole story alone",
          "score": 1,
          "created_utc": "2026-02-16 17:34:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5x1avo",
          "author": "TemperOfficial",
          "text": "lol just lol",
          "score": 1,
          "created_utc": "2026-02-17 19:22:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5nmjo4",
          "author": "sf-keto",
          "text": "Flow metrics, DORA metrics, SPACE & DevEx metrics for engineering process.\n\nFor business metrics, talk to portfolio about the business value or  accumulated % of expected ROI for each released feature. Also talk to Operations about feature usage based on your firm’s telemetry. \n\nYou may also chat with Finance about improvements to EBITDA from turning OpEx into CapEx more quickly from faster, high quality releases. The executives care about that quite a lot.",
          "score": 1,
          "created_utc": "2026-02-16 09:24:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5nwqng",
          "author": "Bowmolo",
          "text": "While in theory the optimum, don't start with any 'value' based stuff, if no solid, proven approach to that is already existing.\n\nAnd even if it exists, thoroughly review it, since most of them are deeply flawed and prone to gaming because attribution is hard to get right and many therefore fall back to estimating or assuming 'value'. \n\nStart with flow metrics, maybe DORA metrics, so you get insights into the engineering processes.\nTypically you'll find enough to improve there for years.",
          "score": 0,
          "created_utc": "2026-02-16 10:59:05",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r8r0uk",
      "title": "New to agile ceremonies",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1r8r0uk/new_to_agile_ceremonies/",
      "author": "Effective-Tailor-996",
      "created_utc": "2026-02-19 05:43:02",
      "score": 8,
      "num_comments": 29,
      "upvote_ratio": 0.75,
      "text": "I’m a new PO and I’m struggling with bad team retros. Devs are not engaged and I’d like to make some changes to have a more productive time as a team. Any scrum master/PO that has been able to make of team retros a more productive time for their teams? \n\nIdeas, advice, frameworks, templates… anything is welcome! ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1r8r0uk/new_to_agile_ceremonies/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o675m8n",
          "author": "daddywookie",
          "text": "The retro needs to be seen to produce actual change, otherwise it is just a talking shop. Are assigned tasks coming from the retro, are these tasks completed and life for the devs improved?",
          "score": 14,
          "created_utc": "2026-02-19 06:15:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o67hwnh",
          "author": "Bowmolo",
          "text": "First: Don't call them ceremonies. There's no prayer, nothing that's celebrated.\n\nThey are just regular events.\n\nSecond: Try to understand history. When a team has gone through countless retrospectives but they learned through experience that none of the high leverage impediments (primarily) outside the team ever changed, how can you expect them to be motivated? They have to learn that things can change for the better first. Unless that happened, they - rightfully - perceive a retro as a waste of time.\n\nAnd no tool, template or engaging facilitation can change that.",
          "score": 9,
          "created_utc": "2026-02-19 08:03:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6ebznv",
              "author": "ggk1",
              "text": "Reminds me of EOS “people don’t hate meetings. People hate bad meetings.”",
              "score": 2,
              "created_utc": "2026-02-20 10:09:21",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o68c8s0",
              "author": "Venthe",
              "text": "> First: Don't call them ceremonies. There's no prayer, nothing that's celebrated.\n\nWhile I agree, it is worth mentioning _why_ they were called ceremonies [by the practitioners] at some point:\n\nThey are important. They should never become an afterthought. Thus, \"celebration\".\n\nOf course community quickly realized that even with good intentions, the name was a bad choice :)",
              "score": 1,
              "created_utc": "2026-02-19 12:33:57",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o68m57p",
                  "author": "Strenue",
                  "text": "They were not. Ever. That was made up bs.",
                  "score": 2,
                  "created_utc": "2026-02-19 13:36:16",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o68dcrj",
                  "author": "Bowmolo",
                  "text": "Well, the term never appeared in any Version of the Scrum Guide (just in some early slide decks that predated it). Given that, one could argue that 'the community' is so immature that they even fail to adopt the official terminology.",
                  "score": 4,
                  "created_utc": "2026-02-19 12:41:32",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6753e9",
          "author": "UnreasonableEconomy",
          "text": "Do you respect your devs?",
          "score": 7,
          "created_utc": "2026-02-19 06:11:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o68mfc3",
              "author": "Strenue",
              "text": "Great question. Infantilizing through process is a terrible outcome for everyone.",
              "score": 3,
              "created_utc": "2026-02-19 13:37:54",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o675ujd",
          "author": "Dastardly00",
          "text": "If there are a lot of people in your Retro then I find Liberating Structures 1, 2, 4 , All works well for engagement. Alternatively try Lean Coffee.\n\nI'm not sure if you are running remote or in person retros but something like the Privacy feature in Miro also encourages engagement from self conscious team members.",
          "score": 4,
          "created_utc": "2026-02-19 06:17:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o68mayy",
              "author": "Strenue",
              "text": "LS but review the LS principles, please please",
              "score": 1,
              "created_utc": "2026-02-19 13:37:11",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o67obcs",
          "author": "EarlOfAwesom3",
          "text": "Productive for whom? For you or them?\n\nA lot of how developers are actually contributing or speaking up depends on culture in a retro. \n\nDoesn't matter much what steps you do in retro. First you have to make sure that there is a strong level of trust and a safe space. \n\nYou probably won't achieve that in a short time",
          "score": 3,
          "created_utc": "2026-02-19 09:06:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o67ur8d",
          "author": "Fr4nku5",
          "text": "Unless you've got the gold piping robes and mitre it's just an event.\n\nCeremonies are for ceremonial purposes, they are formal, and the pageantry is the outcome. \n\nAgile events have different purposes and outcomes, learn what the outcomes are then do whatever outlandish bizarre and jarring things you need to to get the outcome.",
          "score": 2,
          "created_utc": "2026-02-19 10:09:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o675nwv",
          "author": "MyRealFakeID",
          "text": "You doing a formal retro after every sprint? They probably aren't active because it's overkill.  Have a running/constant retro and a more formal review less often.",
          "score": 2,
          "created_utc": "2026-02-19 06:15:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o69gjb7",
              "author": "TheQuoteFromTheThing",
              "text": "This is my main issue with agile. A lot of the ideas are great, but it's seriously overkill.  We have a daily standup, followed by the \"16th\" minute to discuss open issues.  The whole thing inevitably takes at least an hour.  Then we discuss during retro how to make the meeting shorter (only discuss blockers, etc, but nothing ever changes - we just end up spending even more time in meetings like retro trying to discuss the process).\n\nEvery day we also have other meetings like refinement, JIRA board cleanup, etc.  This is in addition to all of the targeted meetings with stakeholders, vendor, and dev (oftentimes separate for all 3) to discuss specific aspects of the project.  \n\nThen the scrum master wonders what we can do to increase our velocity, which leads to even more meetings to discuss process, when all we really want is to cancel ALL of these meetings except for the one a day that truly matters so we can spend the rest of the time working. \n\nIf you're a scrum master or PM these meetings probably make a lot of sense because the meeting and planning is core to your job, but as a dev it eventually becomes an impediment, and the solution to the impediment is to add more impediments, with the promise that next time we're really going to find that critical thing that unlocks efficiency.\n\nNothing is going to unlock efficiency more than giving your employees additional time on their calendars.",
              "score": 2,
              "created_utc": "2026-02-19 16:14:33",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o69u6zz",
                  "author": "badaboom888",
                  "text": "its how they justify the job seriously.",
                  "score": 1,
                  "created_utc": "2026-02-19 17:19:54",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o67ovvj",
          "author": "Busy_Cartoonist3724",
          "text": "One thing that really helped our teams was having a system that organizes the whole workflow from requirements to backlog to user stories so retros aren’t just about pointing out problems, but reviewing actual progress and blockers. Having everything structured makes it easier to see patterns, track what was delivered vs planned, and discuss meaningful improvements. Using a tool like that can make retros more productive without it feeling like an extra chore.\n\nif you want i can suggest some product you can get help.",
          "score": 1,
          "created_utc": "2026-02-19 09:12:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o68d20h",
          "author": "rousseuree",
          "text": "I’ve had fairly good experiences with different teams and retros - there’s no one answer; “it depends.”\nWhat size is your team? Do you have a decent report with them? What’s your team culture like? Who is attending retros outside of your immediate delivery team (and can you get rid of them)? Is there a technical lead and are they providing 1:1 critical/constructive feedback with devs when things go awry, so the conversation has already been had before retro each sprint? When during your sprint are you holding retro?\n\nCandid, honest, actionable feedback and conversation is what works best. There’s a ton of retro templates out there; keep trying different ones to see what sticks. I like using Miro as a tool bc there’s ultimate flexibility for style. \n\n3 main categories are my common thread. “What worked. What didn’t work. Action items.” Let’s talk, bc that’s why we have this time booked on our calendars.",
          "score": 1,
          "created_utc": "2026-02-19 12:39:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o68frhk",
          "author": "Consistent_Voice_732",
          "text": "Switch formats every few sprints. Same structure every time= low energy, even small changes refresh participation ",
          "score": 1,
          "created_utc": "2026-02-19 12:57:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o68m0iv",
          "author": "Strenue",
          "text": "1. Stop calling them ceremonies. They’re not. \n2. Why are you worrying about how the team is doing its retros? You should be more concerned about them delivering value, and the outcomes they’re producing. You’re the PO, that’s your job.\n3. Talk to your SM.",
          "score": 1,
          "created_utc": "2026-02-19 13:35:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6cq7ol",
              "author": "z960849",
              "text": "People have a dedicated SM",
              "score": 1,
              "created_utc": "2026-02-20 02:25:20",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o69r9hn",
          "author": "KronktheKronk",
          "text": "You ever seen Ted lasso? The first thing he does is show his new team he's listening. He does that by making changes to things that bother the team, even when they put suggestions in the suggestion box that are supposed to be pithy.\n\nThe first question you should ask is why is the team disengaged, but I bet dollars to donuts it's because they've had retros for months/years and nothing ever changes.",
          "score": 1,
          "created_utc": "2026-02-19 17:05:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o69zozs",
          "author": "SamfromLucidSoftware",
          "text": "A lot of teams check out when retros don’t lead to anything. \n\nPick 1 action item. Give it an owner and a due date. Keep it visible all sprint so it doesn’t disappear. \n\nBring it up for 30 seconds in standup a couple times. Then start the next retro by checking if it happened and what changed. Once devs see 1 recurring pain go away, they usually open up a lot more.",
          "score": 1,
          "created_utc": "2026-02-19 17:46:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6g5wqk",
          "author": "analyteprojects",
          "text": "I'm surprised no one asked the question, who is at the retro? My first suspicion when people don't speak up at a retro is they are afraid to say something in front of who is attending. \n\nKeep things simple. I start by explaining it's a round table format in three rounds. Everyone gets an opportunity to speak. I ask people to focus on \"things\" not \"people\". First round is \"What went well?\" ; Second round is \"What needs improvement?\" Third round is \"What can we action?\" and in this round we pick one or two items that are incorporated immediately into the next sprint. \n\nMinutes should never identify who said what. Just capture commentary.",
          "score": 1,
          "created_utc": "2026-02-20 16:41:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6l44tl",
          "author": "cliffberg",
          "text": "It's all BS. Scrum is not based on any theory or research. It is all nonsense made up by this guy: [https://www.frequencyfoundation.com/about-us/](https://www.frequencyfoundation.com/about-us/)\n\nIf you want to find out how effective teams \\_really\\_ work, don't look to Scrum. Look to credible research, e.g. the work of Amy Edmondson of Harvard. Also, you might be interested in this examination of highly effective and agile companies: [https://www.agile2academy.com/the-evidence](https://www.agile2academy.com/the-evidence)",
          "score": 1,
          "created_utc": "2026-02-21 11:35:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6n8uzu",
          "author": "oneThing617",
          "text": "Hire a good scrum master; you’re trying to do their job without the knowledge, skill, or experience.",
          "score": 1,
          "created_utc": "2026-02-21 18:56:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6qqixu",
          "author": "Mean-One7902",
          "text": "I’d highly recommend an interactive retro. Get up a pic (I’ll link it if I can find it) of a 2d boat with an a hot, a rock, the wind, the sun. The anchor is the things that didn’t go well, what held your team back etc. the wind is what went well. The sun is the overall planning that went into it (what was useful from sprint planning). I’ve forgotten what the rock is…. Then share this into a shared lucid chart and have everyone add sticky notes in the sections and set a timer for a few minutes. It keeps everyone engaged and doesn’t drag out the session.\n\nIn regards to sprint planning, I’d highly suggest planning poker, where you play poker with Fibonacci cards and give a number based on how long said task would take. It’s a bit more complex than this but have a look online.\n\nSide recommendation, adopt vertical slicing in sprint planning. Send a msg if you want to know more about it or search it up online!",
          "score": 1,
          "created_utc": "2026-02-22 08:40:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o676xxh",
          "author": "GreatZoran",
          "text": "Are you ok with the concept of the retro ? \n\nThe team should select actionable, reasonable action that could be done by the team in autonomy.\n\nDuring the retro search for pain points then root cause then look for action \n\nRemember one thing agile is the same as lean manufacturing but applied to dev. The 5 why pareto stuff and shit work. Get your dev flow lean (= predictable with quality)",
          "score": 1,
          "created_utc": "2026-02-19 06:26:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o67cpv9",
          "author": "BoBoBearDev",
          "text": "Most of them time the retro I have encountered ended in complete failure is because of these....\n\n\n1) it is just a lip service for most managers, they don't care. \n\n\n2) the manager would rather criticize the info lacking context (like stackoverflow). They spend majority of time trying to identify the problem. Stuff like cost. They don't give a shit about the pain the problem caused. \n\n\n3) the manager ended up pressuring devs to agree that devs should do more trainings or be more patient or find ways to juggle different tasks if the computer takes a long time getting things to build and tested or other BS ideas that adds more burdens to the devs.\n\n\n4) the brainstorm session concluded with BS solutions and they called it problem resolved. \n\n\nIf you want to have successful retro\n\n\n1) Do not brainstorm the solution during retro. This is crucial. Otherwise you just ended up with useless solution and they called it solved. Comings up with solutions can take days or weeks or months. \n\n\n2) Vote on how urgent the problem should be fixed.\n\n\n3) do not expect the dev team to brainstorm the solution, it is not their job. For real, this is not their job.\n\n\n4) pray you have a passionate servant leader tech lead that would spend days or weeks or months trying to address the elephant in the room.",
          "score": 1,
          "created_utc": "2026-02-19 07:16:03",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rbnmct",
      "title": "Dev who wants to transition into PO",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1rbnmct/dev_who_wants_to_transition_into_po/",
      "author": "Ok_Piano_420",
      "created_utc": "2026-02-22 14:45:49",
      "score": 8,
      "num_comments": 19,
      "upvote_ratio": 0.9,
      "text": "Hey all,\n\nI’m at a bit of a career crossroads and would really appreciate some perspective from people who’ve made a similar move.\n\nI’ve got ~10 YOE since getting my CS degree. Mostly worked as an Android dev. But also during 2020-2021 spent 2 years running my own gaming server company, which did pretty well.\n\nTechnically I’m more of a generalist / mid-level dev. But over the past couple of years I’ve realized that I create way more value (and get way more satisfaction) doing PO / Scrum Master type work than actually coding.\n\nStuff like prioritizing. Clarifying requirements. Aligning business + devs. Making tradeoffs. Shipping. Strategizing. That energizes me way more than debating architecture or watching dev colleagues overengineer stuff for tiny gains...\n\nI’m seriously considering transitioning full-time into a Product Owner role. Long-term goal would be PM / EM, maybe even CTO someday.\n\nI know that probably means taking around ~40% pay cut, starting as junior/mid PO, proving myself all over again and etc. I’m okay with that. I’d even intern for free for a bit if that's what it would take. \n\nMy issue is positioning. I’ve done PO-ish responsibilities. I’ve run a business. I understand tech and stakeholders. But I’ve never officially held the “Product Owner” title.\n\nHow do I avoid looking like “dev who’s bored of coding” and instead come across as legit PO material?\n\nIs getting something like PSPO from Scrum.org worth it?\n\nFor devs who transitioned — how did you land your first role?\n\nAny red flags I should watch for when joining a company as a PO?\n\nWould really appreciate any tips.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1rbnmct/dev_who_wants_to_transition_into_po/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o6s2og1",
          "author": "MavicMini_NI",
          "text": "For me, to be a successful PO, irrespective of your background, you need to have the correct mentality. We interview a lot of Engineers who want to transition, and if you do not have the correct mindset, its an uphill battle.\n\nYou need to understand first and foremost, what is the problem the user/customer/stakeholder is having. Do they themselves even understand what the problem is. How do you then prioritize what problem to focus on, and once thats understood, how do you agree or identify an appropriate Outcome to aim towards, and how will this be measured (KPIs etc) - this speaks to your ability to work through a Discovery and Framing session appropriately and sets the scene for what comes next.\n\nOnce these are known, you can then start to incept your backlog, and create actual user stories, NOT technical requirements\n\nToo many Devs who become a PO cannot relinquish technical control, and keep dictating to teams a singular solution based around requirements, rather than user stories. Your role is to act as the voice of the customer, and translate their problems into Stories (or Spikes). Its then up to your engineers to identify a way they feel best meets the Acceptance Criteria to deliver usable value to a user quickly, and get feedback as often as possible.",
          "score": 4,
          "created_utc": "2026-02-22 14:54:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6s4f4a",
              "author": "Ok_Piano_420",
              "text": "From my pov another important thing is that PO should understand the product flows in and out. Because I've seen multiple times PO's acting more like dreamers, coming up with very abstract use cases which led to abstract designs that seemed to have been built basically in a vacuum, not taking into account how product operates and so on. Heck devs even had to estimate spikes without any designs ready based on abstract use cases alone. In such cases us devs had to step in often and basically perform proper discovery, define AC and requirements ourselves, because our PO seemed to perform more of PM/Scrum master duties instead of u know, PO.\n\nMaybe I'm wrong, but best PO's I ever worked with would give me ready tickets to work on, with figma sketch, backend contracts and all scenarios (use cases) ready, and if I ever had a doubt or a question the required info was a quick 5min call away, instead of me as a dev having to reverse engineer business decisions or drive communication with 3 other teams myself.",
              "score": 1,
              "created_utc": "2026-02-22 15:03:00",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o6s8x9d",
              "author": "theproductref",
              "text": "I second the call on relinquishing technical control. It is helpful to understand enough of the technical to spot where there is a miscommunication between product and dev, but how something is built is the devs call. You’ll have to bite your tongue.\n\nI went to school to be a dev, started in test, then went into product.\n\nTo be successful in product you really need to be good at a lot of soft skills, which many devs don’t. Heck a lot of devs I know like that they can do their job without interfacing with other people.\n\nCheckout this medium article that has sample questions for a PO interview and think how you’d respond, and if this is part of the job that you are okay with doing: https://medium.com/the-product-ref/how-to-find-a-top-notch-product-owner-6a42eaa3b45a",
              "score": 1,
              "created_utc": "2026-02-22 15:25:35",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6s9rjd",
          "author": "agileliecom",
          "text": "Honestly you're already more qualified than half the POs I've worked with in 25 years. You've run an actual business, you understand the tech side, and the stuff you listed that energizes you is literally the job. Most POs I've seen came from business analyst roles and have never shipped anything in their lives.\n\nThe PSPO, look I'm not gonna tell you certifications are useless because they do get you past HR filters. But be real about what it is. You're paying $200 for a keyword on your resume. The actual material is a few pages. It won't teach you anything you don't already know from running a gaming server company that actually made money. That experience is worth ten times the cert.\n\nThe \"dev who's bored of coding\" thing, flip it. You're not a dev who's bored. You're a dev who realized he creates more value on the product side and has the technical background to actually understand what the team is building. That's rare. Most POs write user stories and have no idea what's technically feasible. You do. That's your entire pitch.\n\nRed flags when joining as PO: if the company already has a \"product committee\" or \"stakeholder board\" that makes all the real decisions, you're not a PO, you're a ticket writer. Ask in interviews who actually decides what gets built. If the answer is vague you have your answer.\n\nSkip the free intern thing. You ran a business, charge what you're worth.",
          "score": 2,
          "created_utc": "2026-02-22 15:29:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6s3g2w",
          "author": "Nearby-Habit5468",
          "text": "Check out forward deployed engineer and product engineer type roles, those hybrid roles lend itself well to strong dev and product skills. They are also rapidly growing roles in high demand. The future of tech is skewing towards hands on builders, especially as AI is automating so much knowledge work. \n\nOtherwise you can just change your last role title on your resume, to make it look like you already transitioned and it’s easier for recruiters and hiring managers to consider you. In this hiring environment, it’s hard for decision makers to take the risk on someone doing a career transition. So you gotta give them confidence that it’s already how you have been operating. Keep in mind it’s your resume, you can highlight your skills and title to best align with your next career goals. Don’t worry about being too literal. I had obscure job titles that are uncommon, so I put the next closest title that aligned to my target title. Don’t out right lie, but a bit of marketing goes a long way. \n\nI did something similar but I went from product to engineer, and I only got traction once I tweaked my profile accordingly.",
          "score": 1,
          "created_utc": "2026-02-22 14:58:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6s9rri",
          "author": "Forgot-pas",
          "text": "Dev transitioning into PO role can be the much needed voice of reason for PM sometimes.",
          "score": 1,
          "created_utc": "2026-02-22 15:29:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6sdgm1",
          "author": "richownsyou",
          "text": "Reading your post made me feel as if I wrote this.\n\nI just transitioned from senior dev -> PO this year. \n\nI love this position but one thing I must stress when people are transitioning from developer to such position is that you NEED soft-skills. You must be able to communicate to different types of people, different personalities. If you are not able to communicate, negotiate, explain and compromise then I think it will be a uphill battle.\n\nI did PSPO and it was a really nice refresher on scrum methodologies/agile mindset. It defines the purpose of the Product Owner very well. It's worth doing if your company pays for it. \n\nBeing a dev really gives an edge, don't underestimate it. It is usually valuable and appreciated/respected from others. However know your boundaries! When you become PO you are NOT a dev anymore. Respect your dev team and let them do their part. It may be hard at times to not overstep. \n\nDon't accept a pay cut. Your experience is valued and worth something. \n\nFirst few weeks gonna probably hell (depending of your context). I had some ramping up to do for the role itself, business context, knowing my team, some technical context since I switched tech stacks etc. Give yourself time and be kind to yourself. It'll be fine.\n\n\nThere's nothing like being able to achieve a WIN-WIN-WIN (Happy stakeholders, Happy devs, Happy PO) good luck and have fun",
          "score": 1,
          "created_utc": "2026-02-22 15:46:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6tchuw",
          "author": "EngineerFeverDreams",
          "text": "Scrum is dying rapidly. You're a fool to jump on that train now.",
          "score": 1,
          "created_utc": "2026-02-22 18:25:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6tdjt6",
              "author": "Ok_Piano_420",
              "text": "Why? There are like 100+ open job positions in my city alone.",
              "score": 1,
              "created_utc": "2026-02-22 18:30:07",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6te4rc",
                  "author": "EngineerFeverDreams",
                  "text": "Do you live in India?",
                  "score": 0,
                  "created_utc": "2026-02-22 18:32:47",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6u441f",
          "author": "BoringChess",
          "text": "Do you really think that PO roles and Scrum are going to survive? A series of roles and a methodology all created in the 90s and early 2000s. It is 2026 and already lots of companies have software engineers writing 0 code. The processes and roles that made sense in a world where writing features and prototyping ideas was costly are all at the most risk imo. Every company is going to have to adapt or die.\n\nMy overwhelming advice is forget about changing role and focus on getting very good with agents, and quickly. Lead the change in your org. Be ahead of the pack. You may just survive and even rise to the top. This is the moment in a career that you can really move to the places you want to be, if you step up and face it head on.",
          "score": 1,
          "created_utc": "2026-02-22 20:39:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6u58x1",
              "author": "Ok_Piano_420",
              "text": "Imo it doesnt matter how the role will be called. PO, PM, SM, Delivery Manager, Lead Engineer, or even CTO for that matter (depending on the company size) will have similar responsibilites. Someone competent to bridge business and tech will always be necessary.",
              "score": 1,
              "created_utc": "2026-02-22 20:45:32",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6u66i2",
                  "author": "BoringChess",
                  "text": "Absolutely. So why would you pivot into being a PO on less money when the modern engineering role is doing the same work for…more money? With more allowance to actually not just ideate but take ideas from concept to prod with autonomy? Sounds like a huge step down to me. When pretty much all of the bad parts about software engineering just got fixed…",
                  "score": 1,
                  "created_utc": "2026-02-22 20:50:16",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6uiel6",
          "author": "lift_spin_d",
          "text": "> 10 YOE. call myself a mid level dev.\n\nI feel your pain\n\n> get way more satisfaction doing PO / Scrum Master type work.\n\nAm there\n\n> That energizes me way more than debating architecture.\n\nYup.\n\n> I’m seriously considering transitioning full-time into a Product Owner role.\n\nYeah I got a CSM and my company expects me to act like a PO.\n\n> I know that probably means taking around ~40% pay cut.\n\nYeah... (economic) means. you gotta be able to take the hit. Emotio-personally too, I work with people smarter than me (straight up PhDs) who can't use styles in Word to save their life. I had a PhD team member just this past week ask \"what is a landing page?\"\n\n> I’d even intern for free for a bit if that's what it would take.\n\ninsert fuck all that meme.\n\n> But I’ve never officially held the “Product Owner” title.\n\nYes you have.\n\n> How do I avoid looking like “dev who’s bored of coding” and instead come across as legit PO material?\n\nFuck what people think.\n\n> For devs who transitioned — how did you land your first role?\n\nI was a hybrid who coded and managed international teams. Just put that shit on <projectManagementSoftwareName>. Current role is hybrid who manages all-local teams + 1 person in Mexico. \n\n> Any red flags I should watch for when joining a company as a PO?\n\nOhhpf. Sorry to be sarcastic but yeah, you should watch for all the red flags. Too many to list.",
          "score": 1,
          "created_utc": "2026-02-22 21:51:42",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r71giz",
      "title": "Story points in bugs",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1r71giz/story_points_in_bugs/",
      "author": "aana-lya",
      "created_utc": "2026-02-17 09:24:01",
      "score": 5,
      "num_comments": 69,
      "upvote_ratio": 0.65,
      "text": "Hi everyone,\n\nI am a product manager apprentice. In my company we don’t put story points on bugs ticket (bugs from tests of the previous sprint or « new » ones).\n\nBut I made a presentation at school following what my company does, and the teacher told me that’s an heresy… and now I have to do again the project… what do you think ?\n\nIs there 2 schools about it ? Is my teacher right to invalidate my work ?\n\nEDIT : thank you all for your answers ! There is a million ways to do things, that’s what I will remember but for the sake of my diploma I will do what my teacher is waiting…",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1r71giz/story_points_in_bugs/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o5u7re4",
          "author": "PhaseMatch",
          "text": "Your teacher has no a very flawed understanding of agility.\n\n\\- you can be agile without using Story Points at all  \n\\- you can be agile without using Sprints at all\n\nPeople who argue about whether defects get story points are worrying about the wrong thing.\n\nAll that really matters is \n\n\\- you make change cheap, easy, fast and safe (no new defects)  \n\\- you get fast feedback from users on the value that change created\n\nSTOP arguing about whether bugs need points, or even using points  \nSTART getting the team into the defect prevention business\n\nOP - Read up on XP (Extreme Programming), and how the practices there support defect prevention. And read the Scrum Guide, to understand why it doesn't matter in Scrum either. \n\n ",
          "score": 49,
          "created_utc": "2026-02-17 09:33:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5u9111",
              "author": "elad350",
              "text": "This is the way",
              "score": 8,
              "created_utc": "2026-02-17 09:45:33",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o5umtim",
              "author": "afops",
              "text": "You still need to have some kind of hunch about how large a bug might be in order to weigh it against other bugs. If two bugs are equally severe but one is a 1hr fix and the other is a 1 week fix then you’d always do the quicker one first because it gives the higher value sooner. You don’t need an absolute estimate but some severity and a rough/relative time is useful",
              "score": 2,
              "created_utc": "2026-02-17 11:47:17",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5ybk9p",
                  "author": "ChaosClarified",
                  "text": "Not really, story points reflect *complexity* not effort or size. The complexity has already been reflected in the underlying story, the bugs coming out of those should already be sort of taken into account due to how hard the underlying story have been from the beginning. If these manageable stories have both been fitted into the same sprint, it's unlikely that you'd unexpectedly get a bug that takes a week to resolve. Or rather, there *is* one scenario and that is if you've neglected your requirements process to such a degree that you can have fallout that fucks your whole sprint with a huge bug like that. You should have seen stuff like that in analysis.\n\nSo again, you've done good analysis, broken down stuff to manageable pieces, you'll have two 3-point stories, any bugs from small-medium complexity work like that will spawn small-medium complexity bugs.\n\nAnd another point - bugs always (unless there's some good reason) have highest priority so they're both prioritized in the current sprint anyways.",
                  "score": 2,
                  "created_utc": "2026-02-17 23:05:12",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o5vevrc",
                  "author": "Devlonir",
                  "text": "I think the two schools of thought are about what story points represent.\n\nFor some, they mostly represent input (work required and uncertainty scale), in those situations bug fixes you need to plan into a future iteration could use story points for exactly the reason you mention. There Story points are a measure of effort.\n\nFor some, story points represent the value added to the product more than the required input. Bug fixing is not value addition, it is value repair. Hence there is no need to add story points. So fixing bugs means you sacrifice value addition for value maintenance. Often teams then also dont give story points to things like package updates and other tech maintenance work.\n\nMy personal preference is to only give story points to bugs and maintenance when the team needs it to determine if we have space to fix a bug in a coming iteration while also still moving the work on our product goals forward, and not to add story points to bugs that are found and quickly fixed within the current iteration. \n\nAs long as these work items are a clearly different type of item than normal value creation tasks, both sides are pleased. That way you can have both the measure of effort and planning number, as well as a way to measure what you add in value and what you need to spend to keep the product as stable as possible.",
                  "score": 1,
                  "created_utc": "2026-02-17 14:39:30",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o5v3q8b",
              "author": "aana-lya",
              "text": "Thank you for your answer, it seems to be that people using agile method are not that agile…",
              "score": 1,
              "created_utc": "2026-02-17 13:38:35",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5wmfk8",
                  "author": "PhaseMatch",
                  "text": "I don't really understand what you mean by \"the agile method\"?\n\nThe Manifesto for Agile Software Development was created by a bunch of people who used different  \"lightweight\" approaches, like Scrum, XP and Crystal.\n\nThese approaches all managed business risk in a novel way compared to stage-gate delivery, and had a lot in common with the philosophy of \"lean\" from manufacturing.  This greatly reduced the bureaucracy involved, leading to more value in less time.\n\nMany teams use a combination of approaches from Scrum, XP< Kanban and lean software development.    \n  \nSome do it well and with a lot of discipline, having invested in all of the technical and non-technical skills needed.    \n  \nSome do it less well, and what you get is a half-way house that has to fall back on the expensive, bureaucratic processes and control systems and is kind of a waste of time.  \n  \nStart with The Manifesto For Agile Software Development.  \n",
                  "score": 2,
                  "created_utc": "2026-02-17 18:13:37",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5uah4y",
          "author": "bedel99",
          "text": "its school do whatever the teacher says, get good marks. leave school and actually do the right thing. You can't win fighting them. ",
          "score": 22,
          "created_utc": "2026-02-17 09:58:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5uhejf",
              "author": "iceGoku",
              "text": "this guy schools",
              "score": 5,
              "created_utc": "2026-02-17 11:01:34",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o5v3z39",
              "author": "aana-lya",
              "text": "You are right but I wanted to know if outside my company and the school, there was a consensus…",
              "score": 2,
              "created_utc": "2026-02-17 13:39:57",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5wymo5",
                  "author": "No_Delivery_1049",
                  "text": "The consensus is, you try lots of different methods and keep doing what works best for your situation and goals",
                  "score": 1,
                  "created_utc": "2026-02-17 19:09:39",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o65cugc",
                  "author": "Benathan23",
                  "text": "The consensus is ever company does it a bit differently.  You have to understand when/where it makes sense to push back and have your own justification.",
                  "score": 1,
                  "created_utc": "2026-02-18 23:32:10",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5ucin9",
          "author": "KazDragon",
          "text": "I disagree with your teacher: it is not heresy.  It is in fact a highly discussed question even amongst seasoned professionals, as you can probably see in this thread.  Furthermore, if your assignment was to talk about what your company does, and they do this, then it is a factual account and your teacher telling you to rewrite the section so that the the practices of the company you're reporting on are misrepresented is very weird.\n\nThat said, my opinion is: \n\n1) don't use story points.  If you're in charge, there are many, many better ways of doing this that don't involve your engineers sitting around writing interactive fiction for product managers who cannot answer the question of \"what is the single most important thing to do?\" where they could instead be spending time building the damn thing.\n\n2) if you've ignored that, and are using them anyway, then at least don't use them for bugs.  \n\nThere is an idea that story points track work towards the improvement of the product and is used to predict the future.  Bugs are work items for which that improvement has already been claimed and not actually delivered.  Bugs absorbing effort and receiving no score and thus reducing velocity for it is therefore a \\_correction\\_ in the score and in theory will lead to better predictions in the long term.",
          "score": 7,
          "created_utc": "2026-02-17 10:17:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5v48j7",
              "author": "aana-lya",
              "text": "Thank you for the developed answer. According to all the answers I had, it’s high sensitive subject !",
              "score": 2,
              "created_utc": "2026-02-17 13:41:23",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o5z9ppx",
              "author": "takethecann0lis",
              "text": "I teach that defects are a tax the team and organization must pay as a result of not paying attention to quality practices like WIP or Story Definition of Ready but the practice of not measuring story points on issues that don’t deliver value is one that I don’t understand.  It seems fairly easy to filter out any story points attributed to non-value based issue types.  \n\nissueType != Defect\n\nBut I’m also a fan of No Estimates.  That said if a team uses story points and wants to account for total capacity I support estimating defects.",
              "score": 2,
              "created_utc": "2026-02-18 02:08:55",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5u99c7",
          "author": "WArslett",
          "text": "I’ve always found estimating bugs a pointless exercise. A bug ticket is usually “this thing doesn’t work how we expected and we don’t know why”. Sometimes with old software we don’t even know the functionality very well. So you want me to tell you how complicated it’s going to be to implement a solution I haven’t worked out yet for a problem I haven’t understood yet? Any “estimate” I give you is going to be completely made up. You can tell yourself there is some value in the process but it’s basically reading tea leaves: a process invented to find certainty that doesn’t exist. The best you can do is time box it.",
          "score": 9,
          "created_utc": "2026-02-17 09:47:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5umg50",
              "author": "hala_mass",
              "text": "This is a good explanation. I'd still have testing metrics like first pass rate, which would be useful for retros and improvement, but no story pointing. ",
              "score": 0,
              "created_utc": "2026-02-17 11:44:19",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5umyev",
          "author": "Skeewampus",
          "text": "It’s agile. If a team finds value in story pointing bugs then they can story point bugs. Usually teams that story point everything are doing it to understand what total capacity they have in a sprint. \n\nI do understand the argument of why you wouldn’t.",
          "score": 4,
          "created_utc": "2026-02-17 11:48:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5u7kjq",
          "author": "ryanojohn",
          "text": "It’s theoretically a bug because someone didn’t know it would happen.  You can only accurately point it after you know what caused it…\n\nSo, no it’s not crazy, but I’ve worked in many companies that do it both ways.  Neither works notably better…",
          "score": 3,
          "created_utc": "2026-02-17 09:31:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5wdxke",
          "author": "sentrix_l",
          "text": "Your teacher is stupid. It's all about the perspective.\n\nWith sprint user stories, you preemptively do technical research to understand how much effort is going to be required to implement said user story. This allows you to predictively estimate the story points needed.\n\nWith bugs, you start the ticket by investigating and doing technical analysis (1 SP+). You cannot say how many story points it'd take as you don't know, you're guessing. After investigating you can tell, but at that point you're mid way through fixing the bug. Also very much depends on the bug. What's the surface area, the severity, impact... and if you need to fix prod. data then that's another 2 SP if not more (depending on conditions).\n\nThat's why we don't story point bugs. Some are 1SP, some are 4SP+. You could easily mislabel 8SP bug as 2 SP because you haven't investigated yet. That's half a day turning into 2 full work days bug.\n\nThere's always a reason. Better to be safe than sorry. I'd be slapping 4sp on most bugs if I were told to story point them lol. And guess what, I'd probably still be underestimating.\n\nI built sprintflint.com with story points in mind. Works well for well defined user stories (sprints, dev days), not so much for bugs or random small tasks.\n\nHope this helps. And good luck! *fuming for you*",
          "score": 3,
          "created_utc": "2026-02-17 17:34:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5xfwjv",
          "author": "sweavo",
          "text": "You're learning an important lesson during your apprenticeship: nobody knows what they're talking about, and you have to adjust the message to the audience and the purpose. Redo your assignment, get your grade, and move on! Whether or not to estimate bug fixes depends on a lot of cultural factors and on whether your code is clean enough and your team mean enough to just fix bugs as they arise. In the dream setup, I would keep estimates for feature work that is on a deadline, because that is the stuff we want to forecast the delivery of. But if we're 400 engineers working on a twenty year old codebase and the customers are each paying 30% of the turnover, we have to work on what they say, so bug fixes need to be estimated and prioritised along with all the other work.",
          "score": 3,
          "created_utc": "2026-02-17 20:31:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5u89ud",
          "author": "Fr4nku5",
          "text": "It's a bug:\n\nA normal story is \"do\".\nA bug is \"do, undo and redo\"\n\nIn estimating a bug you need to understand it's origin, impact and risk of removal, be able to recreate it and ensure fixing it doesn't cause a big elsewhere... Just to estimate it.\n\nTeachers do theory: in theory,  practice and theory are the same, in practice they aren't.",
          "score": 3,
          "created_utc": "2026-02-17 09:38:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5uakdu",
              "author": "LightPhotographer",
              "text": "I see what you mean - the analysis of a bug is 90% of the work and it's not easy to estimate.\n\nWe sometimes used a sergeant-of-the-week who would do initial analysis (and fix it if it's easy).  That way we had more information.",
              "score": 1,
              "created_utc": "2026-02-17 09:59:47",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o5ua0d9",
              "author": "SuperbAd8266",
              "text": "Also, they say people who can’t do, teach. I say this because if the teacher has never worked in the real world, they don’t understand how it actually works.",
              "score": 1,
              "created_utc": "2026-02-17 09:54:38",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5ug78i",
                  "author": "Fr4nku5",
                  "text": "It might be the case that the teacher has been in the business and used agile, but I've seen the syllabus for DevOps degrees and it was patently disconnected from reality... It basically advocated mini waterfall, and downplayed continuous integration.\n\nIt's a shame that IT education doesn't have the feedback loop seen in medicine - folks now graduate from medical school with better skills in keyhole surgery and other techniques because real life learning is fed back into the education system after a year or so.",
                  "score": 2,
                  "created_utc": "2026-02-17 10:51:03",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5u8pxc",
          "author": "rcls0053",
          "text": ">teacher told me that’s an heresy\n\nYour teacher doesn't understand agility at all. Story points aren't part of agile. They're part of the frameworks people built around the simple idea that is agile. I do understand that they try to teach you to follow rules, because that's the easiest way to get started in anything new, but they should say that. Just follow scrum until you understand the rules, then eventually you start bending them and not even needing them (Dreyfus model of skill acquisition).\n\nUsing story points is closer to heresy because even the inventor of story points said they were a stupid idea. In history they've just been used to get management off developers backs because managers want time estimations and developers don't want to, so they invented this abstract notion of complexity + time that makes no sense.\n\nBug tickets don't need story points. User stories don't need story points. But a bug ticket is an investigation. It's a bug of an unknown origin. You have no idea what's wrong. Why guess points for a ticket that you have no idea how to solve until you dig into it?\n\nBut in the end if it works for the team, use them. If they don't, don't use 'em. There's no bible here that we need to follow. Do what works best for your team, be it story points or time estimates. Continuous improvement.",
          "score": 2,
          "created_utc": "2026-02-17 09:42:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5v4syw",
              "author": "aana-lya",
              "text": "Thank you for your answer, it’s really detailed and with the other answers it helps me understand all pov !",
              "score": 1,
              "created_utc": "2026-02-17 13:44:34",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5uahnm",
          "author": "designtom",
          "text": "Story points are a comfort blanket for management, not a useful tool for developers.\n\nBut I recommend you don’t say that to your teacher.\n\n(One exception: it’s useful to have some kind of tool to help devs break big chunks of work into smaller chunks. Story points can do that, but so can other things.)",
          "score": 2,
          "created_utc": "2026-02-17 09:59:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5uclma",
          "author": "Kempeth",
          "text": "> Is there 2 schools about it?\n\nMore like a million. Ultimately, the proof of the pudding is in the eating.\n\nIn my book. Story points are for work that is at least reasonably predictable and that you can defer freely. Bugs often tend to score low on both of these criteria.\n\nSo often bugs are almost all discovery. The fix itself is usually tiny in comparison. It's impossible to meaningfully estimate an effort that can take anywhere from minutes to days.\n\nAlso unlike new fuctionality (where you generally have a working process and just want to transition to a more convenient process) bugs can have much more significant business impacts. If there is a fire and you have to evacuate the building, you're not going to estimate how many story points that's going to consume. You just do it.\n\nBeyond that, an obsession with estimating is usually driven by a need to earn credit / justify yourself. Which is usually the exact environment where you're pushed to take shortcuts which inevitably leads to bugs.\n\nIn the end though, your teacher wants it a certain way and he can make you do it a certain way. It's great that you ask about this, but being right will probably not help you with your teacher.",
          "score": 2,
          "created_utc": "2026-02-17 10:18:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5w7hyt",
          "author": "Internal-Alfalfa-829",
          "text": "Why would something that consumes capacity not get a number put on it?",
          "score": 2,
          "created_utc": "2026-02-17 17:02:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5z8bua",
              "author": "ReyBasado",
              "text": "Typically bugs and defects shouldn't be timebound to a sprint like a development task is. Development tasks/user stories tend to be planned out in advance with a general understanding of complexity, level of effort, and size. This allows a developer to estimate whether it will fit within the sprint or not. Ultimately, all story points are are estimates of whether or not a work item will fit within a sprint window. It's a measure of risk.\n\nA bug or defect usually occurs because of some unknown reason so the risk of it not fitting within a sprint window is incredibly high. Also, the fact that the root cause is unknown makes it impossible for a dev to accurately estimate risk. This is typically why O&M teams tend to manage everything using a simple kanban board, completely doing away with sprints and story points.",
              "score": 1,
              "created_utc": "2026-02-18 02:01:58",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o60tq5o",
                  "author": "Internal-Alfalfa-829",
                  "text": "I think these points are all fair. Personally I'd still prefer them estimated, and it's fine if they kinda do it afterwards. Gives us better historic data of the true capacity of the team.\n\nOooor: We keep 20% of the capacity completely outside of the sprint game. Saying: You have 80% of your time allocated to sprint work and 20% is for unplanned real-time stuff. That works too, and the estimates can be skipped on that. It does require a very focus sprint workflow, so that adding bugs on top does not end up in too many parallel work items going on.",
                  "score": 1,
                  "created_utc": "2026-02-18 08:58:49",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5uczce",
          "author": "RevolutionarySky6143",
          "text": "I'm a Test Manager by trade (and have been a tester for many, many years).  We used to point bugs at complexity 1 US point.  ",
          "score": 1,
          "created_utc": "2026-02-17 10:21:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ugz6p",
          "author": "Bowmolo",
          "text": "He's not necessarily right. It depends a bit on the perspective.\n\nIf SP represent 'effort' then even Bugs should be estimated.\n\nTypically though, SP represent 'value creating effort'. And since Bugs, Defects and the like are not 'value creating' but 'value restoring' work items (aka failure demand in Lean terms), they don't get Story Points at all. \n\nSo, as others also pointed towards, your teacher seems to have a view often found in people coming from 'classic' Project Management, which is very focused on managing/optimizing effort (time, cost); which is of lower importance as compared to 'delivering value' - a view that is more aligned with contemporary agile thinking.\n\nP. S.: And yes, I'm also in favor of not using Story Points at all and replace estimates by something else (forecasting based on historical data).",
          "score": 1,
          "created_utc": "2026-02-17 10:57:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ui7ht",
          "author": "Prize_Conference9369",
          "text": "I'm actually pro estimating defects. In fact i'm strongly for animating most of the defects so the team learns where the issues are coming from. Giving it some story points is a few minutes work where the key is to converge, and if we don't - smith is missing.\nI'm also using SP data to calculate the amount of effort spent on maintenance. It's quite big for some teams so I use it to justify some changes I need: change QA strategy, reduce commitments, ask for people etc.\nCalling things \"heresy\" is the only heresy in the agile world.",
          "score": 1,
          "created_utc": "2026-02-17 11:08:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ukiat",
          "author": "Ouch259",
          "text": "I try not to use story points any more for anything\n\nWhen I do leadership just wants a whole mess of stupid reporting. Its binary, the developer say he can do it or he cant. \n\nI try to go back to the agile I used in  the 1990’s as much as I can before I even knew the word agile.",
          "score": 1,
          "created_utc": "2026-02-17 11:28:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5uy8ve",
          "author": "flundstrom2",
          "text": "School tend to teach the happy path, while reality is much more nuanced. That said, as PO I want bug tickets to have some form of estimate, so I can balance the sprint backlog.\n\nNaturally, it is often not possible to estimate a bug without having an idea of what's happening. \n\nOne solution I've found to work well, is to timeboxed the bug to 2-5 SP depending on apparent complexity, with the DoD that the bug shall be understood, there should be some form of PoC that either proves it can be solved, or reproduced or cannot be reproduced. If the time box isn't enough, them the outcome shall be a plan for how to continue, and that makes it possible to make an informed decision on if it's worth spending more time at this moment, possibly descoping something from the sprint, or park it for further investigation in the future.",
          "score": 1,
          "created_utc": "2026-02-17 13:06:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5uyack",
          "author": "Saki-Sun",
          "text": "I would rather spend time reducing bugs than working out the best way to incorporate them into our workflow.\n\n\nAs a bonus you can assign them to team velocity and as you write less bugs your teams velocity goes up.",
          "score": 1,
          "created_utc": "2026-02-17 13:06:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5uzsqm",
          "author": "hoxxii",
          "text": "We do zero bug and even throw out some. \n\nWe would give that teacher a heartattack.",
          "score": 1,
          "created_utc": "2026-02-17 13:15:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5v1cgw",
          "author": "jrutz",
          "text": "\"When a measure becomes a target, it ceases to be a good measure\".\n\nWhen it helps the team better understand the issue, story points are fine. If you are squabbling over what number to assign to a bug because someone says you have to, then it's just creating waste, people lose faith in the system and you just get apathetic compliance.\n\nAnd if you're using it as a measure of velocity, why not estimate everything in story points. Otherwise you are excluding important information that will help you make better decisions. \n\n(Although as story points are assigned at the point the team knows LEAST about the work, one can question how valuable story points are to calculate a velocity to begin with...)",
          "score": 1,
          "created_utc": "2026-02-17 13:24:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5v3tqa",
          "author": "Zentraedi",
          "text": "When it comes to pointing, the thing I've learned that matters most is consistency.  Teams should align on a perspective of what and how they point and stick to it to establish their velocity.\n\nI'm personally not a fan of pointing defects.  I acknowledge that there is risk and complexity and effort involved; however, you're repairing something back to a working state that should have been working right all along.",
          "score": 1,
          "created_utc": "2026-02-17 13:39:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5vcru0",
          "author": "WaylundLG",
          "text": "There is no \"right\" answer. After trying a lot of different things, where I settled was to not use point estimation on bugs. I use points on things that I would consider scope of work (features work mostly). That way when we are forecasting with our points, we're forecasting for scope completion. If we make buggy code then, it will manifest as slowed scope delivery, rather that looking like ballooning scope.",
          "score": 1,
          "created_utc": "2026-02-17 14:28:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5vpqaa",
          "author": "potatoelover69",
          "text": "Complete waste of time estimating bug tickets. The estimate will almost never hold once a dev starts to investigate it and the effort required a bug varies wildly so you'll learn nothing from this process.",
          "score": 1,
          "created_utc": "2026-02-17 15:33:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5vq69c",
          "author": "EngineerFeverDreams",
          "text": "Stop doing scrum",
          "score": 1,
          "created_utc": "2026-02-17 15:35:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5wf53f",
          "author": "Bnb53",
          "text": "Defects are unbounded work, it's hard to predict points. You should track 'estimated points' and 'actual points' estimates for story work and then collect actual for both story and defects after completing the work",
          "score": 1,
          "created_utc": "2026-02-17 17:39:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5wttnz",
          "author": "Silly_Turn_4761",
          "text": "You estimate bug tickets just like you do for user stories. They both take up devs time and it's unknown how much of iit will be unknown., so why wouldn't you? \n\nI  would politely ask to see where this \"rule\" or \"policy\" is that states this. If they can't then they are just teaching their opinion.",
          "score": 1,
          "created_utc": "2026-02-17 18:47:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5xamjx",
          "author": "sonofabullet",
          "text": "Toss out story points altogether. \n\nThey don't help.\n\nThey're bullshit numbers giving you a sense of control where there is none.\n\nDon't believe me?\n\nGo run all of your metrics doing story points and story counts and check for yourself. \n\nYou will find that all of the metrics and all of the charts look exactly the same regardless of whether story points were used or not. ",
          "score": 1,
          "created_utc": "2026-02-17 20:06:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5yxzzm",
          "author": "serbcyclist",
          "text": "Project management implies a certain level of manageability, predictability, transparency, and the ability to understand delivery health through meaningful metrics and empirical data. Not all projects use the same metrics, and not every metric carries equal weight across different contexts. What matters is selecting the right signals to properly assess the state of a given project. That said... assigning story points to bugs can serve two practical purposes:  \n  \na) to increase the visibility of effort and preserve the integrity of delivery metrics, and  \nb) to provide an early signal of potential over-commitment during sprint planning\n\nIf bugs materially affect delivery capacity and forecasting, they *must be made visible* in whatever planning metric the team relies on. \n\nI’ve worked with quite a few teams that plan from time to time by committing to an expected number of SP while also picking up several bugs that are not clearly visible through delivery metrics. This often leads to reduced focus due to hidden work in progress and a chronic underestimation of the maintenance workload, while at the same time stakeholders draw incorrect conclusions from the reported metrics, which as a consequence causes unnecessary friction. And yes, this becomes particularly problematic in scaled organizations, where metrics and reports are often a more dominant indicator of project and team health than direct input, contextual understanding, or a realistic assessment of actual capacity and outcomes.\n\n**TLDR**: If bugs consume sprint capacity but are not reflected in planning, velocity becomes misleading, hidden WIP increases, and stakeholders draw incorrect conclusions. Estimating bugs work makes maintenance visible, protects forecasting, and prevents chronic overcommitment, especially in scaled organizations where metrics drive perception.",
          "score": 1,
          "created_utc": "2026-02-18 01:09:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6gyycn",
          "author": "Proper-Agency-1528",
          "text": "Story point estimation is a form of estimation... and not the only form. Nevertheless there is a rule that should be followed: never estimate defects.\n\nWhy? There's no point. What do I mean? Well, when I worked at the world's largest software company I was a pretty good developer and sometimes got contacted by other groups to help with bugs. The first question I'd be asked \"How long do you think it will take to fix this?\" My answer was always the same... \"About an hour, after the aha! moment.\" You know, when you've looked at the code, maybe put some log statements or  stepped through the debugger, and then you found out that the code did exactly what it was written to do instead of what the developer wanted it to do, usually because the developer did something stupid. Then, you make the change, rebuild, execute again to verify the fix works, maybe added a comment, did a full build, updated a unit test, committed... all that takes about an hour. From the aha! moment.\n\nWe estimate to make a decision. With bugs, the decision is simple: does it need to be fixed? If the answer is yes, then how long it takes doesn't matter. It will take as long as it takes (the developer's job is to ensure it doesn't take any longer than it takes). If it doesn't need to be fixed, then how long it takes doesn't matter. \n\nIf the team has a lot of bugs, then I can generate some simple velocity metrics by determining the mean time to resolve a defect and doing some simple math (linear regression). If we have 1000 bugs and 10 developers and each developer can fix a bug a day on average, then it should take me 1000 dev days, or 100 business days (5 months) to fix the defects. I can also look to see what the bug 'find' rate is, too. If we're finding more bugs than we're fixing, the time to finish the project and deliver is getting longer. Hint: learn how to finish a sprint with no new defects by improving your coding practices.\n\nTaicho Ohno taught us that a perfect workflow stage isn't one that never creates a defect, it's a state that finds and fixes all defects before they escape downstream to the next stage. Defects are unavoidable. Defects that escape a sprint are completely avoidable. Don't estimate defects, fix them as soon as they're found.",
          "score": 1,
          "created_utc": "2026-02-20 18:53:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5u7plw",
          "author": "mistyskies123",
          "text": "Agile manifesto has people over process\n\n\nThat said, I agree personally with your teacher in that never pointing bugs is a delivery anti-pattern. Do you think bugs never take any sprint time to complete?  And they're all minor little things?\n\n\nMake work visible ==> plan better ==> sprints keep to goals and devs aren't under pressure for there being too much work in the sprint to actually do.",
          "score": -3,
          "created_utc": "2026-02-17 09:32:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5u9ope",
              "author": "elad350",
              "text": "How does that help the team focus on delivering actual value for users? \n\nIF you’re using story points to estimate delivery of of value (aka story points) then surely adding story points to bugs would obfuscate the output of value. The key to this is in the name ‘story points’ aka user story points. \n\nIf the team or the org want to measure output (over value delivered) so timelines are more knowable then it makes sense to estimate bugs. And tasks. And anything else that contributes to delivering outputs.",
              "score": 2,
              "created_utc": "2026-02-17 09:51:40",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5un3xw",
                  "author": "psgrue",
                  "text": "Our value was delivered with the feature. We absolutely did not double count a bug as more value even though story points were assigned to some bugs because they affected capacity. The adjustment to value calculation was trivial. \n\nWe actually had a few bugs we labeled as “committed” because the PO/PM said it had to be done and it was important enough that we wanted visibility, those got points because they competed with features. We had bugs that teams worked kanban and didn’t get story points at all. \n\nSo we did both ways and there was much debate and no real impact to “agility”. It evolved that way and worked.",
                  "score": 1,
                  "created_utc": "2026-02-17 11:49:33",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o5v0urd",
                  "author": "flundstrom2",
                  "text": "Since the very presence of a bug decrease the value of what has previously been deliverwd, it certainly adds value to fix it as well.\n\nAs PO, one responsibility is to balance intake from different stakeholders so the team feel the sprint goal is achievable and they can treat bugs as part of the sprint cadence rather than sprint-breaking. Calculating the velocity (delivered/planned) for the next sprint based on the outcome of the previous, is only one way to keep the sprint backlog in balance. The scrum guide does not stipulate any specific method. The important thing is the visibility and understanding.",
                  "score": 1,
                  "created_utc": "2026-02-17 13:21:59",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o5vx9r4",
                  "author": "mistyskies123",
                  "text": "\"How does that help team focus on delivering actual value for users?\"  \n\n\nActually shipping a project or programme of work delivers value for users. You'll find that many companies struggle to get stuff out on time, hit their commitments etc. \n\n\nYou'll also find many bugs come up regularly from code that has nothing to do with what they're working on at the moment. Like production incidents for example.\n\n\nDev teams that tend to be off track with their commitments often correlate with teams that are not sizing and prioritising their work correctly (or at all). It also correlates with greater dogmatism and purity about \"how things should be done\" and \"the best teams (allegedly) do this so we should do this\".\n\n\nPeople over process. Of course you don't need to estimate every damn bug there is. What I was saying here that I think a hard-line policy of attaching 0 points to a bug is an anti patterns which I've seen play out in practice more than one time.\n\nBack in the days when I was a lead developer, our rule of thumb was say - if the work e.g. refactoring or I guess bug fixing (we didn't have so many of those) was going to take half a day or more, we would factor that into (sprint-level) planning.\n\n\nAnd I've had arguments with product where the amount of time all the various people involved have spent debating e.g. should we upgrade React etc took more capacity and time from those individuals than actually doing the work would do. \n\n\nYou just need to be sensible about these things. But one of the most recent senior engineering managers who reported to me had a \"we don't point bugs\" rule and on the legacy undocumented codebase his team were responsible for maintaining (without even being familiar with the languages), guess what - this policy made no sense and that team were barely getting anything across the line (while signing themselves up to all sorts of other work).\n\n\nPick the context that works for your team.\n\n\nBut don't let dogmatism and purity of principles get in the way of doing \"the right thing\", whatever that may be for that team in that org.",
                  "score": 1,
                  "created_utc": "2026-02-17 16:10:41",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o5udpv0",
              "author": "Kempeth",
              "text": "The world is full of things that will eat up sprint time. Unless they are predictable and plannable any estimation of these things is about justifying your job - not improving your planning.",
              "score": 2,
              "created_utc": "2026-02-17 10:28:48",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o5v7xso",
              "author": "frankcountry",
              "text": "Bugs take time, that’s for sure.  Even without pointing bugs, the rate your product is advancing will still be represented in your throughput or velocity.  The idea is that bugs are worked on as they come in, taking time to point them takes that time away from fixing them.  \n\nIf you have too many coming in, it’s not a sign that they need to be estimated and prioritized with work, it’s a sign that something is wrong and everyone needs to stop to find the root cause of the quality problem they’re encountering.",
              "score": 1,
              "created_utc": "2026-02-17 14:01:48",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5w0bb1",
                  "author": "mistyskies123",
                  "text": "There's a thing called judgement ... \n\n\nSome bugs are big/complex and merit some actual capacity, time and mental energy to fix. So you'd want your Devs to spot them & call those out so the work can be accounted for.\n\n\nI'm not talking about stuff that's an hour or so task - if only all bugs were so simple.\n\n\nAnd if your bug backlog is constantly near zero, great stuff. That's not been my experience of most teams' work in practice - even in smaller orgs like series B companies or whatever. ",
                  "score": 1,
                  "created_utc": "2026-02-17 16:25:52",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o5ufud8",
              "author": "vcuriouskitty",
              "text": "I feel like people fail to understand that agile is a mindset and not a holy bible that needs to be followed religiously. I actually agree with this because this is our practice and everyone is happy. PO is happy. Dev team is happy because they don’t feel any pressure to quickly work on a user story since our sprint items are carefully considered during sprint planning, and THEY actually prefer that (backlog bug items to have an SP).\n\nAt the end of the day, there is an output and value, and the sprint goal is still achieved. I don’t see anything wrong with it if it doesn’t affect the productivity of the team.",
              "score": 0,
              "created_utc": "2026-02-17 10:47:57",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5u7bth",
          "author": "vcuriouskitty",
          "text": "If it’s in the backlog then yeah, you should add a story point to the bug ticket. If it happened during the sprint or it rolled over from the previous sprint then you shouldn’t add a story point.",
          "score": -5,
          "created_utc": "2026-02-17 09:29:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5u92f1",
              "author": "kiraka67",
              "text": "Could you elaborate on this?",
              "score": 1,
              "created_utc": "2026-02-17 09:45:54",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5ubzo2",
                  "author": "vcuriouskitty",
                  "text": "We don’t add story points on progression and regression bugs if we are to fix them on the same sprint or the next sprint (it really depends on PO’s priority). PO moves bugs to the backlog if she deems them as a low priority for various reasons (missed requirement, cosmetic, edge case, etc.), and only will be fixed if the team has capacity. \n\nDuring refinement, we add an SP to these backlog bug tickets because they will be included in our sprint planning. If it becomes a priority then we will have to consider which user stories to bring in. If we include these in the sprint without SP then surely, they won’t prioritize it as they will always prioritize working on the user stories.\n\nThis has always been the process in our project and never did we have any problem with it. This way, the dev team knows that the bug does really need to be fixed during that sprint. This may not be applicable or ideal to other teams for whatever reason but hey if it works for us, then why would I fix something that isn’t broken 🤷🏽‍♀️ much better too because our bug backlogs are gradually getting cleaned up.\n\nNote: not all of our backlog bug items get an SP because.. well, some of them are no longer valid because the devs have fixed them (unknowingly) during the development.",
                  "score": 1,
                  "created_utc": "2026-02-17 10:12:52",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o5u9qo9",
              "author": "SuperbAd8266",
              "text": "But pointing is estimating work effort and bugs are unpredictable rabbit holes that often seem simple but then so many changes were made after the bug was introduced that you realize you have other bugs making your work harder or even blocking it. Obviously we don’t point bugs, lol. 🐛",
              "score": 1,
              "created_utc": "2026-02-17 09:52:10",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5ucz6x",
                  "author": "vcuriouskitty",
                  "text": "Yeah, exactly. That is why they are in the backlog — they will need to be refined. We don’t just add a backlog bug to the sprint without knowing the context especially if it has been sitting there for a while. User stories are always the priority to be worked on, and backlog bug tickets added to the sprint without an estimated effort will likely be ignored because technically having this spilled over won’t affect the burndown chart or velocity. We want to lessen the number of our backlog items, of course.",
                  "score": 1,
                  "created_utc": "2026-02-17 10:21:57",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1r94yyj",
      "title": "Chaos Getting Codified",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1r94yyj/chaos_getting_codified/",
      "author": "Direct_Donut287",
      "created_utc": "2026-02-19 17:11:58",
      "score": 4,
      "num_comments": 7,
      "upvote_ratio": 0.67,
      "text": "I’ve noticed a recurring pattern in leadership meetings where someone floats a proposal — often under urgency — and within about 10 minutes it subtly shifts from “what if we just…” to “okay, so we’re doing this.”\n\nNext thing you know, it’s on a slide somewhere as a commitment.\n\nI’ve tried the usual guardrails:\n\n* “This isn’t commitment.”\n* “We need to validate first.”\n* “Let’s give a date for the date.”\n\nAnd still, 9 times out of 10, the first proposal becomes the plan.\n\nI wrote up my thoughts in more detail on my \"This is NOT thought leadership\" substack (first post, so be gentle), but I’m interested in how other teams navigate this OR if they see the same\n\n[https://notthoughtleadership.substack.com/p/how-chaos-gets-codified-when-proposals](https://notthoughtleadership.substack.com/p/how-chaos-gets-codified-when-proposals)",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1r94yyj/chaos_getting_codified/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o6al194",
          "author": "PhaseMatch",
          "text": "That's \"anchoring bias\" for you.\n\nPlus the desire to race to a solution, rather than understand the actual problem.\n\nMy general go-to for incoming.... stuff ... tends to be \n\n\\- have a 45 minute session with a whiteboard and a lean business canvas;  keep it tight, and  get to a solid problem statement, measurable business outcome, the key SMEs, along with assumptions and risks  \n  \n \\- first past estimation - based on those assumptions and risks in Sprints using Fibonacci  \n  \n\\- have a few days for everyone to think and reflect  \n  \n\\- second session to work through the points raised  \n  \n\\- does this \"feature candidate\" still stack up in terms of the ROI we are looking for (measurable benefits obtained in return for effort and money expended)   \n  \n\\- who owns the risks?    \n  \n ",
          "score": 7,
          "created_utc": "2026-02-19 19:26:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6alfcc",
              "author": "Direct_Donut287",
              "text": "Love this. Have you found a way to keep exec leadership at bay or buy in to this space for reflection? That’s always one of the hardest parts, imo.",
              "score": 2,
              "created_utc": "2026-02-19 19:28:45",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6arets",
                  "author": "PhaseMatch",
                  "text": "That's more of a problem.\n\nSenior leadership should really be operating at the strategic level - so very much overall direction and guide rails in a \"commanders intent\" way.\n\nWhen they are reaching down in a highly directive way to direct things operationally or even tactically its a problem.  Especially when they are bringing the team solutions to implement not problems to solve.\n\nFacing into a lack of basic senior leadership competence is hard - it can be better to find leadership worth following.  \n\nCoercive, fear-and-reward, power-and-status management styles are orthogonal to agility.\n\nThat whole Theory-X mindset and belief runs headlong into team empowerment.  They will tell you they belive in empowered teams right up to the point where it is some of their power (and hence apparently status) they need to give up.\n\nOnly solution there tends to be risk ownership, but inevitably when theres a risk of being scapegoated you will slide into CYA paperwork and signoffs.\n\nWhich takes you back towards \"heavyweight\" bureaucratic processes to maange business risk (and feel safe) - which is exactly the problem that lightweight (\"agile\") methods set out to solve",
                  "score": 3,
                  "created_utc": "2026-02-19 19:57:31",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6b26pj",
          "author": "99ProllemsBishAint1",
          "text": "Weak engineering and operations leadership leads to this. They're allowing suck-ups to implicitly commit on their behalf and undermine the quality and supportability to make the client-facing person happy in the moment. When they allow themselves to be put into that position they're deciding to waste future capacity babysitting terrible, rushed code. \n\nLeadership needs to get the client-facing people out of the room during solutioning discussions. They need to tamp down eagerness to please in that moment and demand advocacy for best practices, knowing that clients will prefer to wait a bit longer for something that isn't flaky and unreliable.",
          "score": 4,
          "created_utc": "2026-02-19 20:50:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6b5la5",
              "author": "PhaseMatch",
              "text": "There's a tendency in sales/marketing to confuse\n\n***\"a polite excuse as to why I'm not buying (or dropping) your product\"***\n\nand\n\n***\"this is the only barrier to closing the sale (or retaining*** ***the customer)\"***\n\nTelling you that \"you are missing feature X\" allows them to shut down the discussion quickly and easily, and move to their preferred provider.  There could be a whole bunch of unspoken reasons why they prefer another vendor, product, team or even individual, and that might not be something the individual you are talking to has influence or control over.  ***But they don't want to have that conversation with you.***\n\nIt's becomes more real when they want to collaborate - whether that's committing their  time, money or  \nboth -  in support of that development.  Especially if that development is going to open up a wider market and you can shift your product strategy towards that opportunity.\n\nBut mostly, it's just people being polite and closing down the conversation.",
              "score": 2,
              "created_utc": "2026-02-19 21:06:57",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6b6pwo",
                  "author": "99ProllemsBishAint1",
                  "text": "Who is they in the collaboration piece? The client?",
                  "score": 1,
                  "created_utc": "2026-02-19 21:12:25",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6o0wdt",
          "author": "analyteprojects",
          "text": "To me, this is a symptom of a lack of overall business strategy. The powerful questions here are: does this align with our business strategy? (As a reminder to people that it should). Another powerful question is to ask \"Why\" and in particular \"Why now?\"",
          "score": 1,
          "created_utc": "2026-02-21 21:22:52",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r6sjkq",
      "title": "Things I've learned in my 10 years as an engineering manager",
      "subreddit": "agile",
      "url": "https://www.jampa.dev/p/lessons-learned-after-10-years-as",
      "author": "fagnerbrack",
      "created_utc": "2026-02-17 01:33:08",
      "score": 4,
      "num_comments": 3,
      "upvote_ratio": 0.75,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1r6sjkq/things_ive_learned_in_my_10_years_as_an/",
      "domain": "jampa.dev",
      "is_self": false,
      "comments": [
        {
          "id": "o5sgeh4",
          "author": "fagnerbrack",
          "text": "**Condensed version:**\n\nThe engineering manager role has no standard definition — it shifts based on team size, whether a PM exists, and where bottlenecks sit across product, process, people, and programming. Everyone on the team must care about the product because code only matters when it delivers user value, and teams that understand the problem (not just the spec) can pivot when needed. Processes should earn their keep or get cut; ceremony bloat creeps in when no one questions whether a ritual still improves delivery. Communicating down demands transparency — withholding information that affects your reports causes lasting resentment — while communicating up demands a clear structure: context, problem, plan, and what support you need. A manager's time breaks down roughly into 10% player, 30% coach, and 60% cheerleader, with genuine (not ritualistic) praise and making engineers' wins visible beyond the team. The ultimate goal is building a team that thrives without you: delegate relentlessly, stay off the critical path, refuse to become the bus factor of one, and trust your people's effort and honesty while still verifying through both quantitative metrics and the qualitative signals — like who quietly holds the team together — that no \"management AI tool\" can capture.\n\nIf the summary seems inacurate, just downvote and I'll try to delete the comment eventually 👍\n\n[^(Click here for more info, I read all comments)](https://www.reddit.com/user/fagnerbrack/comments/195jgst/faq_are_you_a_bot/)",
          "score": 7,
          "created_utc": "2026-02-17 01:33:08",
          "is_submitter": true,
          "replies": []
        },
        {
          "id": "o5xph7p",
          "author": "SnooPaintings5610",
          "text": "Very cool article! Great job!\n\nI am currently a product manager in a team of software engineers but I want to step into a people management role, work in a big corporation in Europe. Any suggestions on how to break the glass barrier?",
          "score": 1,
          "created_utc": "2026-02-17 21:16:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5zmz6m",
          "author": "Nowhere-Man-Nc",
          "text": "Great article and great insights. I can only support everything what is said there. ",
          "score": 1,
          "created_utc": "2026-02-18 03:23:38",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1ra0huz",
      "title": "Juggling an Agile Project While On Other Projects/Maintenance",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1ra0huz/juggling_an_agile_project_while_on_other/",
      "author": "CrystalBlueSkyes",
      "created_utc": "2026-02-20 16:46:30",
      "score": 3,
      "num_comments": 11,
      "upvote_ratio": 0.8,
      "text": "Here's something I'm not too familiar with.  If other people have dealt with this situation, could you share a bit of guidance?\n\nWe have a new project that we're trying to use Agile for.  It's pretty loose, using Scrum components (sprints, estimation, backlog, ect).  However, a large portion of the project is investigation and business knowledge gathering before any Dev work can begin.  The Devs on the team (me plus two others) are expected to put most of our working time on the tasks, but we have other projects and maintenance to do...and we are the only Devs.  In addition, a lot of the rest of the team (business and system analysts) are also swamped with work outside of the project.\n\nThe project is very important, but I've only worked with teams before that commit nearly 80%+ of their time to said project and are insulated from outside factors and meetings.  How do you juggle this kind of time in an Agile/Scrum framework when the external forces aren't something you can realistically control?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1ra0huz/juggling_an_agile_project_while_on_other/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o6gcct9",
          "author": "dnult",
          "text": "I'm reading between the lines here since I'm not entirely sure what question you're asking.\n\nIf you need to do research or experiment before committing to development, you capture that work as a spike user story. After the spike you may need to adjust the development story based on what you learned.\n\nThe other facet of your question seems to be related to capacity. Story points and sprints are great, but if you ignore capacity, you're likely to make promises you can't keep.\n\nStart by defining a meaningful pointing system. Day-points is the simplest pointing system I've used. A 2 and a 3 point story should take roughly the same time as a single 5 point story. Same is true for a 5 and a 3 point story being equivalent to a single 8 point story. Define your capacity as the number of available days during the sprint or increment. Carve out time for overhead (meetings, training, drive-bys), which is likely to be at least 20%. Commit to stories with the highest business value up to your capacity.",
          "score": 3,
          "created_utc": "2026-02-20 17:10:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6gnh85",
              "author": "CrystalBlueSkyes",
              "text": "Sorry if I was too broad.  I'm trying to figure out how to do good capacity planning in sprint planning and grooming when members of the team can't commit to a solid amount of time in a given sprint.  I know everyone has time off and being sick, ect.  But a lot of our pain is coming in 'Team Member X has to get pulled in on this project suddenly in the middle of our sprint and can't finish anything or commit to next sprint'.",
              "score": 1,
              "created_utc": "2026-02-20 18:02:08",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6ifnpr",
                  "author": "wbqqq",
                  "text": "It is what it is - you can’t make commitments to specific project work because the team aren’t committed to the team. \n\nSome tactics that _might_ work include dedicating particular days or half days and communicating to everyone else that the team are not available Tuesdays and Wednesdays and focus time on the project then (with a capacity of 40%), or expanding your work management to everything that the team does and because you can’t commit more than a day out, just use a kanban and backlog and focus on completing what you start and minimising WIP. \n\nNo easy answer, and someone will have the hard work of communicating “No, not today but probably next week” to everyone outside the team",
                  "score": 1,
                  "created_utc": "2026-02-20 23:17:24",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o6ihur2",
                  "author": "broc_ariums",
                  "text": "You can plan current, dedicated capacity to a sprint and assign work accordingly. If those individuals get pulled into other high priority work you can then speak to the work the started and communicated that it won't be delivered because of the shifting priorities. This is ok. You can then report out on the successes/challenges of the sprint and what impacted delivery like, shifting priorities. You can then use start using the assigned work to help prevent them from jumping from priority to priority by communicating to whoever is pulling them off by starting, \"If Team Member X is moved to this other thing, know that the work assigned to them won't get completed\". You can also communicate to stakeholders in advance, what sprint work is assigned and prioritize accordingly so there aren't surprises when you say, \"this won't get done because we're moving them to X. Is this ok?\"",
                  "score": 1,
                  "created_utc": "2026-02-20 23:30:06",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6gdtzl",
          "author": "never-starting-over",
          "text": "Been there, recently. I bet this is some kind of software agency.\n\nIn order to handle more work, you need to either increase resources, increase timeline or decrease scope. Which is the company compromising on?\n\nRegardless of the choice of compromise, what I've done is create a roadmap and a general timeline for these things, so you at least have some numbers to showcase the options and how each affects the project. At that point it can be discussed with decision makers. After that, you can decide on whether to:\n\n1. Compromise on scope\n2. Compromise on timeline\n3. Compromise on resources (not always possible or a linear improvement)\n\nThese aren't even mutually exclusive, often removing some things from the scope also reduces the timeline and the required resources. I'm partial towards compromising on scope and that generally works better for who I work with, especially since timeline compromises typically also mean cost and risk increases; I've seen better results by having phased approaches.\n\nIf you have a small team and a relatively small timeline but a big scope, then the outlier seems to be that the scope is disproportionately large. Or is it? Answering that alone should give you some direction.\n\nAs for the other projects, you'll just have to assume you can't put 40 hrs/week per dev on this new project. It would also be worthwhile figuring out how many hours you *should* be putting towards these other existing projects.",
          "score": 3,
          "created_utc": "2026-02-20 17:17:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6gnhth",
              "author": "morsofer",
              "text": "Additionally, you should communicate to stakeholders as soon as possible - ideally with a clear visualization that your team can dedicate only 20% of their time to this project. That means 20% for understanding the business goal, 20% for refinement, and ultimately 20% for development.\nI would also rethink how to adapt your sprint cycle to such limited capacity. Your two-week sprints are effectively just two actual working days. Do two-week sprints really make sense in this case? Do sprints make sense at all in this setup?\nYou need to clearly answer these questions together with the people who are funding the project.",
              "score": 2,
              "created_utc": "2026-02-20 18:02:13",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o6go79i",
              "author": "CrystalBlueSkyes",
              "text": "Funny enough, it's not a software agency.  Long story short, this is a system integration project where our company is trying to do this integration as a Scrum project.",
              "score": 2,
              "created_utc": "2026-02-20 18:05:27",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6gslwq",
          "author": "Proper-Agency-1528",
          "text": "Scrum does not support part-time Scrum team members. Instead of assigning one person to multiple projects, we can bring backlog items in from multiple product backlogs for the team. \n\nIf you have multiple projects and also ad hoc work (support, bug fixes) that need to be addressed by a team of people, create policies around classes of service and give each project its own swim lane and queue, including an ad hoc swim lane. The policy should tell people what to work on next (how to determine which item in the swim lane queues should be pulled into the workflow).",
          "score": 1,
          "created_utc": "2026-02-20 18:25:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6gvyih",
          "author": "kida24",
          "text": "\"Hey, I have 3 number one priorities, what do I do?\"\n\n\nYou are being setup to fail. \n\nDon't worry about estimates. Worry about what is the most important thing to get done and attack that thing. \n\nFigure out who you need to ask to prioritize your work. This is a demonstrable incompetence of the product side or management. Avoiding context switching is one of the biggest things anyone can do to make a person more productive.",
          "score": 1,
          "created_utc": "2026-02-20 18:40:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6i09kl",
          "author": "PhaseMatch",
          "text": "**TLDR;  If you want Scrum to be effective, then the whole team needs to be 100% on that project. Effective agile delivery acts to control your business risk in a lightweight way;  what you are describing is a long way from that in terms of technical practice**.\n\nScrum requires the whole team working on one project to be effective.\n\nThere's some really solid reasons for this;  the main one is around \"context switching\"\n\n\\- a 2017 study showed you lose about 20% of the teams effectiveness when they work on 2 or more projects;  that's consistent with the data I have collected on just throughput/velocity terms over the years\n\n\\- Gloria Mark's research shows the core of the problem - you tend to get shoulder tapped on project (A) while you are working project (B); that not only interrupts \"flow\" (with a 15-25 minute recovery time), but also leads people to work longer \"to catch up\" and creates stress\n\n\\- Stress lowers our \"working memory\";  you'll get more slips, lapses and mistakes from team members, so more test-and re-work cycles slowing you down\n\n\\- that's more likely to force you towards \"deliberate violations\";  compromising on technical quality to reach a deadline or target, with the consequential \"long tail\" of defects, bugs and problems\n\n**You get into a downward spiral;  context switching kills quality and productivity, and the defects that arise creates more context switching.**\n\n**More critically perhaps, the sequence you describe has nothing to do with agility, at all.**\n\nYou are talking about upfront-requirements-and-design, feeding through to developers.  \nSo very much a stage-gate based delivery model, with analysis and sign offs, in order to control risk.\n\nThat's exactly the kind of \"heavyweight\" approach that agility is designed to disrupt;  you don't control risk through upfront design processes, you control it by\n\n**- having the technical skills in place so change is cheap, easy, fast and safe (no new defects)**  \n**- you get fast feedback on the value created by that change from real users**\n\nYou drop the upfront analysis and the \"contractual\" sign-off relationship with users, and instead have them embedded in the team, collaboratively working continuously to make sure what is built is correct.\n\n**As long as change is not expensive, hard, slow or risky, this is cheaper and faster.**\n\nMy only suggestion here would be \"The Kanban Method\" -\n\n\\- start where you are now  \n\\- make the work and dependencies visible  \n\\- get agreement to evolve how you work  \n\\- apply systems thinking and theory of constraints ideas  \n\\- ruthlessly improve to reduce cycle times  \n\\- apply \"shift left\" concepts to defect prevention (DevOps / XP)  \n\\- STOP worrying about individual utilisation of people  \n\\- START worrying about how work flows, and the delays in handoffs\n\nThe state of your code-base and the investment in technical skill development will dictate whether agile approaches will control your business risk on not - but it might be a long haul (years) to get there.",
          "score": 1,
          "created_utc": "2026-02-20 21:55:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6jpepe",
          "author": "resteele02",
          "text": "My take - projects aren't agile or not agile. Your team is either agile or not agile. If you make the transition to agile, all the work your team does is agile. \n\nA team cannot do some projects using an agile approach and others not using an agile approach. Being agile is a team decision, not a project decision. \n\nI say this from 15 years of experience as a PMO director. It's about the team, not the project.",
          "score": 1,
          "created_utc": "2026-02-21 04:00:02",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r86z0s",
      "title": "📊 Helping my son - My son George is writing his undergraduate dissertation on how Agile delivery management actually works in practice vs. how it's presented in theory.",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1r86z0s/helping_my_son_my_son_george_is_writing_his/",
      "author": "Rough-Dimension3325",
      "created_utc": "2026-02-18 16:04:42",
      "score": 0,
      "num_comments": 27,
      "upvote_ratio": 0.47,
      "text": "📊 Helping my son with his dissertation — would love this community's input!\n\nI'm Kevin I've spent 30 years in tech delivery, including SAFe Programme Consulting and digital transformations in the UK energy sector. \n\nMy son George is writing his undergraduate dissertation on how Agile delivery management actually works in practice vs. how it's presented in theory.\n\nHis research focuses on the gap between Agile frameworks and real-world delivery — specifically around scaling, governance, organisational culture, and emerging technologies. As someone who's lived this gap for three decades, I can tell you it's a topic worth exploring.\n\nI'm using my platform to help him gather wider perspectives. If you've got 10 seconds, please vote:\n\nWhat is the single biggest factor that limits Agile effectiveness in your organisation?\n\n🔘 Governance & traditional management structures\n\n🔘 Scaling challenges (cross-team dependencies, alignment)\n\n🔘 Organisational culture (resistance to change, lack of trust)\n\n🔘 Emerging tech complexity (AI, automation, tooling overload)\n\n🔘 Lack of leadership buy-in or understanding of Agile\n\n🔘 Other (drop a comment!)\n\nAll responses are anonymous and for academic use only. Happy to share the results back with the community once he's written up — and I'll probably write something up on it myself.\n\nIf anyone would also be open to a \\~45 min confidential interview with George, please DM me.\n\nAppreciate it 🙏\n\n[View Poll](https://www.reddit.com/poll/1r86z0s)",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1r86z0s/helping_my_son_my_son_george_is_writing_his/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o62ruzu",
          "author": "ckdx_",
          "text": "Cargo cult Agile is the single biggest limitation in our business!",
          "score": 6,
          "created_utc": "2026-02-18 16:21:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o62qfe3",
          "author": "CleverNameThing",
          "text": "Are you interested in how SAFe works in practice or agility in general?  They aren't synonymous.",
          "score": 3,
          "created_utc": "2026-02-18 16:15:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o62r0jg",
              "author": "Rough-Dimension3325",
              "text": "Hi his research is speaking with professionals who have experience working with Agile frameworks such as LeSS, Nexus, SAFe, Scrum, Kanban or similar approaches. So Agility in general, Thanks in advance",
              "score": 1,
              "created_utc": "2026-02-18 16:17:41",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o62rtfc",
                  "author": "CleverNameThing",
                  "text": "Thanks.  I voted, but it was a tough call between leadership and culture from my experience.  ",
                  "score": 3,
                  "created_utc": "2026-02-18 16:21:18",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o62xodk",
                  "author": "iseke",
                  "text": "SAFe = Shitty Agile For enterprises? ",
                  "score": 0,
                  "created_utc": "2026-02-18 16:47:47",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o62qniw",
          "author": "webby-debby-404",
          "text": "Other: ALL OF THE ABOVE!",
          "score": 3,
          "created_utc": "2026-02-18 16:16:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o62ro0q",
              "author": "Rough-Dimension3325",
              "text": "Thank you 👍",
              "score": 1,
              "created_utc": "2026-02-18 16:20:37",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o62wfsu",
          "author": "Illustrious-Jacket68",
          "text": "other: all of the above but also, each one of those has a lot of context and is often misunderstood.  they are also interdependent - e.g. one of the most missed scaling challenges is less about how to put in the mechanisms to manage dependencies.. but to actually decrease the amount of dependencies through changing the organizational structures, changing the architecture/tech, etc. \n\nplenty of studies and deep dives to be done about what theory / textbook said vs. how it needed to be adjusted.  \n\n",
          "score": 2,
          "created_utc": "2026-02-18 16:42:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o63a64r",
              "author": "Rough-Dimension3325",
              "text": "Thanks for your feedback very useful for him to include 👍",
              "score": 1,
              "created_utc": "2026-02-18 17:44:24",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o63q8uh",
          "author": "Chicken_shish",
          "text": "Fixed scope, fixed timeline, mission critical with no concept of an MVP - it either works or it doesn't.\n\n(most financial processing systems)\n\nAnd they insist on Agile.",
          "score": 2,
          "created_utc": "2026-02-18 18:54:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o64o10b",
              "author": "Rough-Dimension3325",
              "text": "Ok will pass on your opinion thank-you",
              "score": 1,
              "created_utc": "2026-02-18 21:30:44",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o63rgdn",
          "author": "ithkrul",
          "text": "For me its the realization that Agile is not the only or the best situation, based upon a variety of issues and concerns. Waterfall frequently becomes more valuable in certain ecosystems, team structures, etc.\n\nAlso, that corporate leadership rarely lacks understanding into how Agile actually works. Mostly around the intersection of pointing an hours spent. As both metrics are valuable to different audiences but frequently come into conflict.",
          "score": 2,
          "created_utc": "2026-02-18 18:59:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o64o77y",
              "author": "Rough-Dimension3325",
              "text": "Perfect thankyou I will pass on your response 👍",
              "score": 1,
              "created_utc": "2026-02-18 21:31:32",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o63vq1j",
          "author": "PhaseMatch",
          "text": "There's three surface level ones: \n\n\\- the organizational culture is very much Theory-X (\"***The Human Side of the Enterprise\" - MCGregor***) ;  agility needs a \"learning organsiation\" culture (***\"The Fifth Discipline\" - Peter Senge***) as a prerequisite.  The emphasis is on intrnsic motivation and leadership, not extrinsic motivation and management (***\"Out of the Crisis\" - Deming***)  \n  \n\\- change is not cheap, easy, fast and safe (no new defects);  without this, management will never shift their mindset, because when change is expensive, hard, slow and risky then the cost of failure leads to the need for control.  The fear of being scapegoated pushes you back towards heavyweight bureaucratic  processes, and stage-gate relases  \n  \n\\- you don't get fast feedback from actual users on the value created, inside the development cycle;  everything becomes about performative metrics, not actually measuring value created and using that to respond to change  \n  \nhowever the all point to   \n  \n\\- **under investment in technical and non-technical professional development at the team level**\n\nLeadership training only for managers; non pf the negotiation, conflict resolution, communication, facilitation and presentation skills developed in teams, so that leaders can lead not manage.  Zero technical training in 25-year old practices that help teams to deliver in days.\n\n  \n",
          "score": 2,
          "created_utc": "2026-02-18 19:19:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o64nqaj",
              "author": "Rough-Dimension3325",
              "text": "Thank for this I will pass on all the information you have provided. 👍",
              "score": 1,
              "created_utc": "2026-02-18 21:29:23",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o64ppqr",
          "author": "serbcyclist",
          "text": "Lack of leadership buy-in or understanding of Agile, followed by the organizational culture.   \nEverything else follows. ",
          "score": 2,
          "created_utc": "2026-02-18 21:38:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o676bki",
              "author": "Rough-Dimension3325",
              "text": "Great thanks for your input 👍",
              "score": 2,
              "created_utc": "2026-02-19 06:21:12",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o67px1l",
          "author": "mister_rossi_esquire",
          "text": "Think it's already been mentioned, but it's probably the Iron Triangle, working with fixed scope, fixed deadline and fixed cost. ",
          "score": 2,
          "created_utc": "2026-02-19 09:22:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o67r538",
              "author": "Rough-Dimension3325",
              "text": "Super thank a for feedback 😁",
              "score": 1,
              "created_utc": "2026-02-19 09:34:33",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6evf3s",
          "author": "mjratchada",
          "text": "Which agile theory is this? Agile came out of practicalities, not academia. Agile is more about practices than it is about frameworks. Vast majority of orgs have a hybrid approach rather than a purely agile one. ",
          "score": 2,
          "created_utc": "2026-02-20 12:43:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6f0v17",
              "author": "Rough-Dimension3325",
              "text": "Thanks. George will conduct a thorough review of the common frameworks used by organisations, analysing their strengths, weaknesses, and challenges.",
              "score": 1,
              "created_utc": "2026-02-20 13:17:10",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o62vdb9",
          "author": "RDOmega",
          "text": "I like the nature of what you're doing here, but I sadly must quibble with the premise of the question.  So for that reason, I'm one of your \"Other\" votes.\n\nThe thing I take issue with is in the pre-supposition that there is any permutation of Agile that will yield a positive (\"effective\" as stated in your question) result.  That so long as a company can overcome all the other response options you listed - and likely more - that they will then be considered nominally Agile and home-free so long as they stay on top of it.\n\nAgile as it's understood and practiced by the LinkedIn class today is not about process and delivery, but instead is a tool for performance management and blame.  For this, I consider the notion of agile (little-a) scorched Earth. Though I would still say that the original manifesto is a valuable piece of industry wisdom.  It just needs a rebrand.\n\n(I have experienced SAFe and other cargo cultings of agile in a professional setting with both multinational and small organizations alike.  Happy to have a chat with George if you'd like!)",
          "score": 2,
          "created_utc": "2026-02-18 16:37:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o62w92z",
          "author": "Rough-Dimension3325",
          "text": "That would be so good if you could. I agree with a lot of what you say and can identify with the good and the bad of agile delivery across many settings. I've also had many years of delivering in a waterfall scenario, with more than my fair share of rework due to misconstrued requirements.",
          "score": 1,
          "created_utc": "2026-02-18 16:41:23",
          "is_submitter": true,
          "replies": []
        },
        {
          "id": "o6614pu",
          "author": "cdevers",
          "text": "> Helping my son with his dissertation — would love this community's input!\n\n…so your kid is at university and you’re still helping with his homework?",
          "score": -1,
          "created_utc": "2026-02-19 01:49:28",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}