{
  "metadata": {
    "last_updated": "2026-01-25 08:55:26",
    "time_filter": "week",
    "subreddit": "agile",
    "total_items": 7,
    "total_comments": 84,
    "file_size_bytes": 122339
  },
  "items": [
    {
      "id": "1qkrzwk",
      "title": "SAFe (scaled agile) is into bad practices? Warning!",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1qkrzwk/safe_scaled_agile_is_into_bad_practices_warning/",
      "author": "Agile_Dragon",
      "created_utc": "2026-01-23 14:18:08",
      "score": 19,
      "num_comments": 40,
      "upvote_ratio": 0.76,
      "text": "Scaled Agile (SAFe) refuses to provide digital certifications to anybody who passed their exam after the experation date. It doesn't matter if you paid and worked for the certificate they will keep it hidden behind a paywall.\n\nI realized my documents had been missing a certification, the SAFe SM Certification 5.1. I looked everywhere on the site could not find any download links. I did see a renewal for version 6 and was not interested in being ropped out of another 300$ dollars and time.\n\nSo then I reached out to support. The level 1 personnel told me he could also not access the .pdf and I had to renew to have access to an old, expired, certifications I had earned. I explained I was not interested in the new material and simply wanted what I paid for. I had to insist on escalation to somebody who did have the authority. According to current law and buisness this was bad practice. \n\nWorth inquiring with the \\[BBB.org\\](https://www.bbb.org/us/co/boulder/profile/business-development/scaled-agile-inc-1296-1000123264) right? They are already UNTRUSTED with a C- as of early 2026.\n\nLevel 2 also tried to explain to me that the system was locked up behind the renewal paywall and they also could not provide the old certification. I asked them if they practiced Agile at their offices or that was in the title only.\n\nAfter finding them on Google maps. I found I was not the only person with bad support issues. Some other people reviews include \"Waterfall dressed as a clown.\". \n\nGiving everybody a heads up.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1qkrzwk/safe_scaled_agile_is_into_bad_practices_warning/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o18vhww",
          "author": "motorcyclesnracecars",
          "text": "Its a bit of a bull shit thing. I use to pay to keep renewing my certs... but thought why? I passed, have stayed in the field and relevant. Im not going to continue to pay for a \"piece of paper\". I dont do that with my college degree. Its just a meaningless way for these companies to keep an income stream, thats it.\n\nAlso, no employer has ever asked to see my current, active cert. So why bother.",
          "score": 13,
          "created_utc": "2026-01-23 14:47:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o19izoc",
              "author": "Dull_Sense7928",
              "text": "I let my SAFe 4.0 and 6.0 certs lapse rather continue paying $895 each year just to get filtered out of prospective roles. In my market, there's a glut of SAFe trainers, salespeople, vendors who have no real world experience, giving anyone SAFe experience a black mark. Once I removed it from my resume, I got callbacks. \n\nIt's a shame, as I remember when SAFe was announced before it even needed an x.0, and the initial product was pretty good, lightweight, suitable for knitting dependencies together among apps  Exactly what was needed for decoupled web app development. \n\nMy over-a-decade old Scrum Alliance certs, obtained when they actually meant something, are the next ones I won't renew",
              "score": 4,
              "created_utc": "2026-01-23 16:36:26",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o193nfu",
              "author": "oreo-cat-",
              "text": "The only one I bother to keep up is my PMP but I just listen to podcasts for the continuing education.",
              "score": 1,
              "created_utc": "2026-01-23 15:27:19",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o19dukn",
                  "author": "Agile_Dragon",
                  "text": "Conferences are also good. I attended the DevOps (also Agile) conference and loved it. Gene Kim has fantastic books to read.",
                  "score": 2,
                  "created_utc": "2026-01-23 16:13:23",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o18ujx9",
          "author": "Aggravating_Pen_6062",
          "text": "SAFe is a waste of time.  I have a POPM cert and missed two questions on the whole exam.  I've been in software for 34 years.  Good old-fashioned [scrum.org](http://scrum.org) scrum would be enough if people bothered to follow it.  Sigh.",
          "score": 25,
          "created_utc": "2026-01-23 14:43:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1dst0t",
              "author": "Venthe",
              "text": "> Good old-fashioned scrum.org scrum would be enough if people bothered to follow it\n\n1. You'd have to read it first, who could be arsed to read <15 pages?\n2. You'd have to understand basic English, and _think_. We need prescriptions dammit!\n3. You'd have to _ultimately_ change the organization to empower people. We want agile, but at most we can change _names_. Is there a better process than SAFe that allows for everything to remain the same?",
              "score": 3,
              "created_utc": "2026-01-24 06:16:19",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1emzd6",
                  "author": "Aggravating_Pen_6062",
                  "text": "Amen",
                  "score": 2,
                  "created_utc": "2026-01-24 10:47:31",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1j8ai1",
                  "author": "flundstrom2",
                  "text": "I've been thinking about your last question for a few months. Best alternative I can think of, is scrum@scale.\n\nBut I have a few ideas on a method that would be able to scale agile without having to change the organization. I just need to distill it and make a tool to guide an organization. Some day, at least.",
                  "score": 1,
                  "created_utc": "2026-01-25 01:06:17",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o18zhvd",
              "author": "Agile_Dragon",
              "text": "Solid.",
              "score": 1,
              "created_utc": "2026-01-23 15:07:33",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o18rlio",
          "author": "Illustrious-Jacket68",
          "text": "I wouldn't worry about it or even continue to bother.  I think these days, having SAFe certification on your resume may actually work against you.  Would be emphasizing the pieces and practices of SAFe that you think are useful and why.  \n\n",
          "score": 20,
          "created_utc": "2026-01-23 14:27:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1b61n3",
              "author": "Competitive_Ring82",
              "text": "Hard agree. I would not hire a SAFe proponent.",
              "score": 3,
              "created_utc": "2026-01-23 21:08:36",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o19ivi4",
              "author": "Agile_Dragon",
              "text": "Fighting the good fight.\n\nThose who know how to speed up a buisiness, create value, only need let their work speak for itself. [Scrum.org](https://www.scrum.org/) already has most of what you need. \n\nI recommend these Agile certifications first:\n- PSM\n- Scrum Inc\n- CSM",
              "score": 1,
              "created_utc": "2026-01-23 16:35:55",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o18t4ch",
          "author": "nborders",
          "text": "PMI does the renewal game also. I still take credit bypassing the tests in both situations (PMP and SAFe’s SCP). \n\nProject Management certifications are a scam…but they have somehow convinced those in power that the person with the credentials have of some sort of quality. \n\nThe PMP exam was tough but really only showed I can learn vocabulary words and recall how PMI organized the PMBOK. \n\nSAFe was the big player in scaling agile for larger software organizations. Frankly every SAFe rollout I took part in eventually morphed into “[name of company]-agile”. In other words they figured out it was agile moved up to the program and portfolio-levels. \n\nThey are a scam.  Yet I sometimes wonder I should have kept my PMI subscription, but I hated the meetings and would rather have the money.",
          "score": 7,
          "created_utc": "2026-01-23 14:35:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o18zssz",
              "author": "Agile_Dragon",
              "text": "I have the course and all the points myself. Would only need to take the PMP / ACP exam... But nobody has asked for those in over 10 years. Would have been more wasted money.",
              "score": 1,
              "created_utc": "2026-01-23 15:09:02",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o19c2mx",
                  "author": "nborders",
                  "text": "I’m seeing PMP arise again in many PM job postings recently. \n\nOnly 2 where SAFe qualifications were asked for. Agility has matured in many organizations and specialists in Agile are not needed as much. \n\nI’m seeing more hybrid-roles, if agile is on the list of requirements. Someone to run the project or program who knows how agile systems work.",
                  "score": 1,
                  "created_utc": "2026-01-23 16:05:26",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1afxod",
          "author": "PhaseMatch",
          "text": "Certification mills are like multi-level-marketing schemes.\n\nSAFe is a very expensive collection of other people's agile/lean ideas, along with \"PI Planning\" as the only unique thing they offer.  Everything else you can find online, or in books, or is well discussed.\n\nSAFe \"transformations\" tend to fail for the same reason that Scrum transformations fail, or for that matter transformations in general fail.   There's a focus on the easy bits, getting \"quick wins\" and so on, which tends to mean the hard stuff never moves.\n\nIf you need SAFe certification for a job, chances are the job will suck.",
          "score": 3,
          "created_utc": "2026-01-23 19:05:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1akafz",
              "author": "Agile_Dragon",
              "text": "Simply and well put.\n\nOld Business have been opperating in a way for a long time, sometimes several decades or more. It's going to take far more than a couple of years to change the culture in the company. It's committed slow or big-bang approach (company wide restructure). Both approaches come with setbacks to obtain the perks.",
              "score": 1,
              "created_utc": "2026-01-23 19:26:02",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1as0mp",
                  "author": "PhaseMatch",
                  "text": "My preference is mor4 towards the \"Kanban Method\" as described in \"essential Kanban condensed\" \n\n\\- start where you are  \n\\- get agreement to evolve the organsiation  \n\\- do this through data-driven experiments  \n\\- encourage acts of leadership at every level  \n\\- apply systems thinking concepts and ideas  \n\\- continuously improve\n\nThe whole \"transformation\" industry is heavily driven by expensive consultancies and the idea that change is a big-design-up-front, value-at-process.    \n  \nAnd it's simply not.  \n\nW Edwards Deming understood this, which is why \"Out of the Crisis!\" back in 1980 outlined 14 points for managers which are still highly relevant.  Agility drew very heavily on his \"lean\" concepts and ideas.\n\nI learned a LOT working in a SAFe environment, but none of that was SAFe specific.\n\nA lot of the desperate \"pearl clutching\" reactions tend to miss that most of SAFe is just other people's ideas, rebranded.\n\nFor example, an \"Agile Release Train\" is really just \"The Spotify Model\" that everyone was gushing over back in 2017 or so, just with more boring, corporate sounding names.  \n\n\nSAFe training - like Scrum training - is really about everyone agreeing to use a certain terminology, and not changing what those words mean. \"Minimum Viable Product\" anyone?  \n  \nAnd very little of it has to do with the actual practical side of agility, Extreme Programming (XP) and more latterly DevOps.  If   \n  \n\\- change is not cheap, easy, fast and safe (no new defects)  \n\\- you don't get fast feedback from users on the value you created  \n  \nthen pretty much you have nothing.  You'll wind up adding processes and documentation to control risk, because your technical teams don't have the skills to do it for you.  \n\n\nBut we can afford to send senior managers on \"Leading Safe 6.x\" or whatever.  \nJust not train the delivery teams in ScrumXP, because it costs too much.  \n  \nYour SAFe transformation died right there.",
                  "score": 1,
                  "created_utc": "2026-01-23 20:02:10",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o18t63b",
          "author": "RDOmega",
          "text": "You don't want SAFe on your resume.",
          "score": 13,
          "created_utc": "2026-01-23 14:36:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o18yvnk",
              "author": "Agile_Dragon",
              "text": "I haven't even reviewed the teachers. Talked about Alphas and Sigmas for days. What a joke.",
              "score": 3,
              "created_utc": "2026-01-23 15:04:31",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1906a5",
          "author": "DeanOnDelivery",
          "text": "I think I got POPM 4.5 or something like that a few years back. \n\nI don't really give a shit now. I suspect that certifications are going to become of secondary value given the ability to leverage AI to help facilitate processes. \n\nI'm not saying people won't still gatekeep job applicants for such certifications and such shops where SAFe® is still a big deal. \n\nI'm just saying, given the recent de-investment in all things agile from CPO's, COOs, and CTOs, to the point where they're jettisoning Scrum Masters in Agile coaches left and right into the Styx lake of the laid off. \n\nBasically, sponsors of such training and certification are likely to take that money and place their bets elsewhere.",
          "score": 2,
          "created_utc": "2026-01-23 15:10:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o193nfl",
              "author": "Agile_Dragon",
              "text": "- Value chain. \n- Lean portfolio management.\n- Agile.\n- From project to product.\n\nEverything you need to thrive in 2026, 2027, 2028.",
              "score": 1,
              "created_utc": "2026-01-23 15:27:19",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o19p60z",
                  "author": "Strenue",
                  "text": "You can get all of that elsewhere. In fact it’s probably better to.",
                  "score": 1,
                  "created_utc": "2026-01-23 17:04:12",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o190bbi",
          "author": "AllForKarmaNaught",
          "text": "Pretend your an employer and you need the certificate to verify their resume.",
          "score": 2,
          "created_utc": "2026-01-23 15:11:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o19ddny",
              "author": "Agile_Dragon",
              "text": "Scaled Agile as a company sucks.",
              "score": 2,
              "created_utc": "2026-01-23 16:11:16",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1a9ynj",
          "author": "m0strils",
          "text": "The sooner SAFE disappears the better.",
          "score": 2,
          "created_utc": "2026-01-23 18:38:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o192hti",
          "author": "clem82",
          "text": "Always has been. It’s started as a cash grab for waterfall homers who lost money when the PMP bucket dried up",
          "score": 3,
          "created_utc": "2026-01-23 15:21:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o193qj6",
              "author": "Agile_Dragon",
              "text": "Yup",
              "score": 1,
              "created_utc": "2026-01-23 15:27:43",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1ax6g0",
          "author": "paul_h",
          "text": "Seems unethical- charge for the certification and provide free proof, \n\nor provide free certification and charge to access the proof/ verification of the same \n\n… not both",
          "score": 1,
          "created_utc": "2026-01-23 20:26:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1cw41x",
          "author": "Jolly-Lie4269",
          "text": "No money? The train has left the station choouuuuuu chooouuuu",
          "score": 1,
          "created_utc": "2026-01-24 02:37:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1cwlzi",
              "author": "Agile_Dragon",
              "text": "I laughed out loud.\nDamn, this was dumb. 😂",
              "score": 1,
              "created_utc": "2026-01-24 02:40:27",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1e81jd",
          "author": "mathilda-scott",
          "text": "That’s frustrating, but it’s unfortunately how SAFe has operated for a while. Their certs are treated more like subscriptions than lifetime credentials, which is very different from PMI, Scrum, etc. BBB won’t usually force access, but filing a complaint can at least create a paper trail. For anyone considering SAFe: assume ongoing renewal costs and limited long-term value unless your employer explicitly requires it. If not, frameworks with permanent digital certs tend to age better.",
          "score": 1,
          "created_utc": "2026-01-24 08:30:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1jaou9",
          "author": "funbike",
          "text": "The A in SAFe is a lie.   It's waste of time, regardless if you got a cert or not out of it.",
          "score": 1,
          "created_utc": "2026-01-25 01:19:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1967pv",
          "author": "Internal-Alfalfa-829",
          "text": "SAFe is not Agile anyway. It's a way for old people to pretend they are doing Agile, so they can slap the label on things. All while clinging on to their old way of predicting and controlling multiple years of future without changing the slightest thing. Not a loss.\n\nThat said, recruiting is kinds dumb about that stuff and the AI filter might require the \"SAFe\" buzzword to let you through. Worst case put it in your CV in the list of certs and that's it. Nobody said we have to show the actual cert docs.\n\nSucks for you, but customer support cannot change the way their software functions. As long as they explain how things currently work and pass on the feedback, they are doing a good job.\n\nEDIT: Ok, this part if funny though - the C- is based on\n\n\\- Failure to respond to 1 complaint(s) filed against business\n\n\\- 1 complaint(s) filed against business that were not resolved\n\nThat is ***nothing***. The BBB is a private, nonprofit organization. They can't even legislate legally binding rules for businesses. So this rating carries zero weight, even less so if the entire thing is based on data from one single potential incident.",
          "score": 0,
          "created_utc": "2026-01-23 15:39:07",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qi70an",
      "title": "How to prioritize backlog of bugs?",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1qi70an/how_to_prioritize_backlog_of_bugs/",
      "author": "Subject-Scholar6197",
      "created_utc": "2026-01-20 17:13:58",
      "score": 13,
      "num_comments": 32,
      "upvote_ratio": 0.93,
      "text": "I’ve been tasked with prioritizing and categorizing our 400+ backlog of bugs. I want to use two things to measure:\n\nImpact\n\nPriority\n\nTo categorize these. Any tips or suggestions on how to measure impact and subsequently assign a priority for our next sprint? I’d like to ideally spend 30-60 seconds per bug and crush through the list. Any advice would be appreciated. ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1qi70an/how_to_prioritize_backlog_of_bugs/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o0p89g1",
          "author": "FreeKiltMan",
          "text": "If they are > 90 days old, delete them. These are bugs that are either not important, or will be reported again quickly (so you know how important they really are). Anyone willing to sit on a bug for 3 months has either already churned, or it’s not really important to solve because the workaround is easy.\n\nThe remainder - what are you measuring their impact against? That’s the real question to have a good answer for before you start. If it’s conversion, rank them in severity of how they impact that. If it’s revenue retention, speak to Account Managers to figure out the churn risk of customers.\n\nI don’t recommend getting too granular. High/Med/Low impact should be enough of a prioritisation. If you find too many in one bucket, you should recalibrate your thresholds. Generally, I’d keep it 10% high, 30% medium and 60% low. Those might feel like arbitrary buckets but you cannot have 100 high impact bugs, you need to keep recalibrating your scale until only the most severe issues are considered “high”.",
          "score": 23,
          "created_utc": "2026-01-20 17:27:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0tdv40",
              "author": "GreatZoran",
              "text": "So much people are afraid of deleting backlog items but it is the way to dot it ! \nIf no one talks of a bug its a feature not a bug 😅\nAll products have bugs and lot of them are 'admitted'",
              "score": 2,
              "created_utc": "2026-01-21 07:10:17",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o0rf3xf",
              "author": "lampstool",
              "text": "To add to this, you can run a session (or multiple sessions) with a impact vs effort chart to help them visualize it a bit better. (Effort on x axis, effort on y). \nThat'll also help you bin off any tickets you think could be valuable after already purging any older bugs. \nGiven the sheer size you are dealing with, start with high impacting low effort quick wins and get them prioritized into sprints. \nThen hold a bi-weekly triaging session to continue the prioritisation over time until it's more manageable (then can probably move over to monthly)",
              "score": 1,
              "created_utc": "2026-01-20 23:40:29",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0pe85i",
          "author": "Pretty-Substance",
          "text": "I use a simple triage: \n\nCosts no money\n\nCosts the company money \n\nCosts the customer money",
          "score": 18,
          "created_utc": "2026-01-20 17:55:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0qihur",
              "author": "SuperbAd8266",
              "text": "Things related to money are always the highest priority on my team.",
              "score": 3,
              "created_utc": "2026-01-20 20:59:10",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0s912q",
                  "author": "reubendevries",
                  "text": "I mean it probably depends on how much money. How much effort, how much likely hood of it re-occurring it should be a formula based on company tolerance.",
                  "score": 2,
                  "created_utc": "2026-01-21 02:27:50",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0p9k8v",
          "author": "DingBat99999",
          "text": "A few thoughts:\n\n* People always over-complicate defect tracking. They almost always do so because they allow too many defects to accumulate and/or they have a fundamental quality problem in their development process.\n* My recommendations:\n   * The first step would be to simply delete any defect over a given age. It wasn't important to fix before so stop worrying about them.\n   * I would then simply sort the remaining defects into \"Must Fix Immediately\" and \"Not Must Fix Immediately\" buckets. Who cares about the impacts/reasons. Just make a judgement call. This is really the POs job btw.\n   * Start working on the first bucket.\n   * If the first bucket is more than one sprints work, you probably have a quality problem.",
          "score": 8,
          "created_utc": "2026-01-20 17:33:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0pkxrj",
          "author": "lypaldin",
          "text": "In my company, we use [frequency/severity](https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQpwG-j1tWk_cYiJF2B4cj5XTcaE7eYr5ssPQ&s) matrix\n\n- Is it frequent ? (Once in a while or every day, how many users impacted, etc) \n\n- Is it severe? (Impossible to make an action or just a minor turnaroundable inconvenience?)\n\nWe have an indicator in our ticketing system that helps to identify if it's red, yellow and green, and each time I create a new ticket, I just add this information",
          "score": 6,
          "created_utc": "2026-01-20 18:25:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0pr2bl",
          "author": "TomOwens",
          "text": "A lot of people are saying to delete, often based on the age of the issue. I find that an incredibly scary idea. Perhaps it's my background in regulated industries, but failure to report a known issue with a system would be a pretty serious non-compliance with regulations or contracts.\n\nHowever, they aren't wrong in that the first step should be a rapid cleanup of the known issues.\n\nAnything that doesn't have enough information to let someone knowledgeable in the system attempt to reproduce it can be closed. If there aren't good preconditions and reproduction steps, there's no need to waste anyone else's time. Without this information, not only will it be hard to reproduce in a development environment, but confirming the fix will also be difficult.\n\nAs a parallel activity, consider setting standards for new issues. Make sure that anything that is newly reported has enough information to reproduce, fix, and verify the solution. Don't accept defect reports that don't have the necessary information.\n\nYou also have another opportunity to close issues quickly. If the feature the defect was reported against no longer exists, you can close it. Features are deprecated all the time, and one problem I've seen is that when a feature is deprecated, the backlog work associated with it isn't cleaned up. Not only can reported defects be closed, but any ideas for enhancements or tech debt paydown can also be closed, since they're now irrelevant.\n\nInstead of categorizing by impact and priority, I'd start with something more objective. Can you check that each defect is associated with one or more features or architectural elements of the system? If so, do that. Then, you can prioritize defect repair with planned feature development. If you have planned work associated with a given feature, pull defects associated with that feature at the same time. Use this time to conduct a deeper analysis, close irrelevant defects, and fix those that need to be fixed. This also gives you a prioritization method, especially if you know the value of or risks associated with a particular feature. Instead of categorizing each defect, you cluster and improve an aspect of the system.",
          "score": 3,
          "created_utc": "2026-01-20 18:52:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0q5gtt",
              "author": "Fickle_Musician7832",
              "text": "Yes!  For one of our projects, the issue backlog is long/old because the dev team is ignoring them - not because they aren't important.  We are reminding them continuously that they need to fix bugs.",
              "score": 3,
              "created_utc": "2026-01-20 19:58:53",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0sdl44",
                  "author": "happycat3124",
                  "text": "Exactly. We have defects that are being complained about and critical. We just ignore the issues and have trained the customers that complaining is futile.  Some of these things cost way more in productivity than the cost to fix.  Others are control issues or financial issues that, if identified by the “right” person would be escalated to a Sr. Level and given a very very high priority. But there are decision makers that put their heads in the sand. They are making a decision that the likelihood of their careers being impacted negatively by asking for more resources to get the things done is higher then the likelihood of them getting called out as responsible for ignoring the problem.",
                  "score": 1,
                  "created_utc": "2026-01-21 02:53:47",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0pvjpe",
          "author": "cdevers",
          "text": "\nI know I’m in the minority opinion on this, but I am strongly opposed to just deleting bugs. \n\nThe thing to consider is that your bug database is part of your organization’s institutional memory — it should be the permanent record of the work that came up, whether or not that work ended up being carried out. \n\nMy preference is to set up a “rejected” or “won't fix” status in your bug tracker (Jira or what have you), and have this status semantically be one of the “closed” states. That way, if you make a determination that a bug isn’t worth spending time on, you can reject it now, and get it off your open backlog. \n\nThe big advantage of this approach is for later trend analysis. Right now, it might seem like that bug isn’t worth fixing — and maybe that’s the right decision! But if it turns out that you’re getting a steady trickle of reports of what amounts to the same bug, then maybe this “minor” issue is more significant than it seemed at first, and it’s worth working on after all. \n\nDeleting the bug reports is bad, because it discards this information and makes later analysis difficult or impossible. \n\nSo my approach is fairly simple — review the bugs, reject the ones that don’t seem worth working on any time soon, and focus on the remaining high-priority issues. Later though, as new reports come in, compare them to the existing closed & rejected bugs in the archive to see if they could be a match for anything that has come up before, and if so, cross-reference the reports so that you can start building up a list of instances of the same problem, as this can inform future decisions about whether or not that bug is worth reprioritizing.",
          "score": 4,
          "created_utc": "2026-01-20 19:12:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0putmg",
          "author": "FairEntertainment194",
          "text": "Allowing 400 bugs in backlog is far too much. I don't think they can be fixed in one sprint. You have bigger problem than just categorisation of bugs.",
          "score": 3,
          "created_utc": "2026-01-20 19:09:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0pd8tc",
          "author": "Alpheus2",
          "text": "Delete.\nFocus on reducing the rate of new bugs so the rate slows down or stops.\n\nYou can prioritise anything younger than 60days once you’ve stopped the bleeding.",
          "score": 2,
          "created_utc": "2026-01-20 17:50:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0per8a",
          "author": "phaulski",
          "text": "There used to be a free agile app/website called easybacklog and one of the things i loved most about it was the 50/90 column. This was an estimate of time it takes to complete the item. \n\n1. How much time would it have a 50% chance of being completed \n2. How much time for a 90% chance of being completed. \n\nFor instance, i might have a 50% chance of emptying the dishwasher and getting the next load in in 20 minutes, but in 45 minutes, its a 90% chance. \n\nI cant remember how the algo weighted things but it led to a WSJF list - weighted (by importance, impact, whatever) shortest job first",
          "score": 2,
          "created_utc": "2026-01-20 17:57:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0pr0a3",
          "author": "basilray",
          "text": "Something that might be worth considering, partnering with someone in customer support. They likely can tell you top contact drivers. Focus on those, because they have a two-pronged value:\n\n1. Reducing client contacts saves support dollars\n2. Gives you great ROI for the work performed to remediate over high visibility defects",
          "score": 2,
          "created_utc": "2026-01-20 18:52:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0p87g4",
          "author": "Lasdary",
          "text": "I'd add a 'complexity'. Or you'll have 80 or so low priority bugs that take 5 mins to solve but will never be addressed. Use low complexity to use up hours where nothing else would fit. And as easy tasks to solve, which tend to improve morale.\n\nPriority is up to the PO, and without knowing the business logic it's impossible to tackle. You need to weight revenue loss vs time incurred in support, or risk against failing an audit, or those bugs that the longer they exist, the harder it is to fix the erroneous data later on...",
          "score": 1,
          "created_utc": "2026-01-20 17:27:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0planp",
          "author": "PhaseMatch",
          "text": "**TLDR;  Stop the rot by getting into the defect-and-ticket prevention game;  use an LLM to cluster defects and overhaul the \"buggy\" areas that disrupt user workflows.  That might mean rewrites not bug fixes.**\n\n**First things first - stop the rot!**\n\nYou really need to get in front of \"**building quality in**\" as a team rather than running a \"test and rework\" cycle and hoping you trap every defect;  building up to 400+ defects is kind of insane.\n\nYou also need to get in front of \"ticket management\" as the defects come in;  immediate triage into this Sprint, backlog, won't fix (kill);  not every defect or request has to be addressed.\n\nThe team needs the technical skills to make change cheap, easy, fast and safe (no new defects);  you'll be battling uphill until they can.  This is what the XP (Extreme Programming) and DevOps practices are for - shift left, slice small, and defence-in-depth to trap-and-resolve defects inside your Sprint cycle.\n\nLook into **\"Continuous Testing for DevOps Professionals\"** for a bunch of essays/structures/ideas for improvement.  Raise the bar, coach into the gap.\n\nThen:\n\n\\- feed the defect list into your LLM of choice and do some cluster analysis on common themes, as they impact on user workflows, functionality groups  or value creation by the users\n\n\\- use this to prioritise in a roadmap sense;  overhaul the buggy workflows that have a lot of complaints, or the parts of the codebase that are really buggy.  Create focused Sprints where you can have an outcome from a user workflow perspective.  Don't work tactically.\n\n\\- identify code that can't be saved;  you might need to kill off complex, low use functionality that doesn't \"wash it's face\" in terms of value created Vs defects raised;  solve the users problem a better way and replace it entirely\n\n\\- do a deeper analysis on likely root causes, cluster, and identify with the team how where that specific defect should have been trapped \"upstream\" of the user and any manual tests as part of getting into the defect prevention business\n\n\\- improve",
          "score": 1,
          "created_utc": "2026-01-20 18:27:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0pruab",
          "author": "Jo0102",
          "text": "Not sure if you're using incidents or only the bug type, for me a good start would be to group them in categories: critical, high, medium low by the urgency. \n\nIf you have a bug that is blocking your customers or safety issue, it's definitely critical bug, \n\nhigh can be something that the current release relies on, \n\nmedium- something valuable but not time critical and\n\nlow- some design issues that are just annoying to see and not affecting the customers. \n\nAfter this you should pretty good idea of the backlog if you're a beginner. \n\nThis is pretty similar to MosCoW model of prioritization, but most companies use RICE model.",
          "score": 1,
          "created_utc": "2026-01-20 18:56:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0pu9ew",
          "author": "dnult",
          "text": "Really its the impact you want to define. The priority should be the top N issues with the highest impact.\n\nOne approach might be an FMEA RPN scoring system. It is based on severity of the issue, probability of an issue occurring, and how the issue is detected. The score is the product of those three scores. The goal is to identify high impact, and frequently occuring issues, with emphasis on client impact.",
          "score": 1,
          "created_utc": "2026-01-20 19:07:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0pxc33",
          "author": "KariKariKrigsmann",
          "text": "I would encourage you to look into the Cost of Delay method of prioritising bugs:\n\nhttps://www.3cs.ch/priority_cost_of_delay_and_kanban/\n\nImpact is a proxy for impact, and Cost of Delay is IMHO a better way to do it.",
          "score": 1,
          "created_utc": "2026-01-20 19:21:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0q1vaq",
          "author": "LightPhotographer",
          "text": "Putting a list of 400 items in a different order is not helping anyone. It's rearranging deckchairs on the Titanic. \n\nI suggest a few regular bug-squash-fridays with the team: Fridays spent only on fixing bugs. Make sure to celebrate.   You do not have to go through all 400 to find candidates. Just ask each developer and possibly some stakeholders for their favorite - and do these first.  When you get the hang of it it will also become easier to just select bugs instead of arguing about them.\n\nIt was a great success for us because we fixed bugs that never reached the treshold of being serious enough, yet they were in the system for months.\n\nFor the rest... triage always helps.  Does it cost money, who does it impact and how many people are we talking about, and is there a workaround?",
          "score": 1,
          "created_utc": "2026-01-20 19:42:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0q4bwm",
          "author": "Fickle_Musician7832",
          "text": "Make a policy that only bugs with complete info will be worked on and send them back to the people who submitted them to add priority and severity. If they aren't available, have the system owner/business owner do it. They have x number of days to complete that exercise or the bugs will be cancelled.",
          "score": 1,
          "created_utc": "2026-01-20 19:53:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0q97gi",
          "author": "renq_",
          "text": "Same as everything else. I prefer to think of every story as a bug. Either something not implemented or behaviour that should be changed.",
          "score": 1,
          "created_utc": "2026-01-20 20:16:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0qm2vu",
          "author": "flamedown12",
          "text": "A graph of complexity vs impact, start with low complex but has high impact in terms of solution and work from there.",
          "score": 1,
          "created_utc": "2026-01-20 21:15:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0rd4xt",
          "author": "erebus2161",
          "text": "First of all, how much authority do you have? Several people have said delete the old ones. Is that even an option?\n\n\nSecond, what's the source of the bugs? Users or QA? My QA team notices when a bug is deleted and don't report it again. And they all talk, so if someone finds a bug and someone says they wrote it up 6 months ago and it was removed, it won't get reported again.\n\n\nThird, are you required to fully prioritize this backlog? Because it is impossible to order 400 bugs. At best you can put them into a few categories.\n\n\nFinally, the only real metric is importance. And how your project determines that will be somewhat unique for your project. Bugs that completely prevent a feature from working are probably high on the list. But maybe there are features no one really uses. Or maybe there's a feature one person uses, but they're a VIP.\n\n\nI would start with just categorizing as critical or not. Until you've finished the critical ones, there's no point in putting any thought into the rest. Once the criticals are resolved you can lower the importance bar and do another batch of most important. I would generally aim for about 2 sprints worth of the most important bugs actually being ordered.\n\n\nYour two metrics of impact and priority kind of sound like the same thing. Wouldn't high impact = high priority and low impact = low priority? My team uses what's called a RICE score; reach, impact, confidence, effort; because we are required to, but it really isn't that complicated to review a bug and determine how important it is.",
          "score": 1,
          "created_utc": "2026-01-20 23:29:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ri7ii",
          "author": "funbike",
          "text": "I've been through that several times.  Your team will NOT fix all those 400 bugs, so it's a complete waste of time.\n\nDelete all of them, except anything reported in the last month.  Come up with a better way of dealing with bug reports.  Your team has fundamental issues.",
          "score": 1,
          "created_utc": "2026-01-20 23:57:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0rldjf",
          "author": "Silly_Turn_4761",
          "text": "- level 1 - causing outage of multiple customers/users with no work around\n- level 2 - causing outage of multiple customers/users with a workaround\n- level 2 - causing outage to a few customers/users with no workaround\n- level 3 - highly probable edge case \n- level 4 - Mild issue with workaround\n\n\nI've seen something similar to the above dictate priority. \n\nNow, I've also seen multiple variables dictate it, for example:\n\n-  how many users are affected\n-  is there a workaround\n- is it in a high priority module of the software \n\nIt honestly comes down to how much bandwidth the team has and what will the priority levels will be used for? If they will be used in tandem with estimates to help the team decide if it can or should be worked in the next sprint, that makes sense.\n\nIs the team planning to agree on working a set amount of bugs per sprint? For example, I've been on teams where we tried to dedicate at least 10 or 20% towards tech debt. Same for bugs. That type of decision is going to rely heavily on what the team is being pressured to deliver.",
          "score": 1,
          "created_utc": "2026-01-21 00:14:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0rnm3a",
              "author": "Silly_Turn_4761",
              "text": "Just re-read your post again, and wanted to mention a few more things.\n\nImpact typically represents how many users/customers are affected\nUrgency could be used for whether there is a workaround\n\nYou need to find out what the intended uses of the priorities and categories are first. \n\nI have been on a team where we CLOSED all tickets older than 2 years. Then anything older than a year, the customer support rep or whoever owns the ticket, reached out to the customer to confirm before closing it. You could suggest something similar. \n\nIf QA Prioritizes their test cases or test plans, which they should, that would also be a good data set to use to influence how these get prioritized. \n\nFor example, I used to work for a loan management software company. When I started I had to build a test case repository. In doing that, I always put a priority on the tests. I based the priority off of what the projected impact would be, should a defect make it to prod. Most priority 1 test cases were in the loan configuration module, and each module also had 1 or 2 high priority TC. I say all this because, I heavily researched the bugs that had been historically reported up until current. I exported them and filtered to see which ones were fixed, which ones were considered super severe and went in a hot fix, etc. \n\nYou could also ask customer service which areas of the software tend to always be buggy. \n\nHope some of this is helpful. \n\nJust make sure whatever you use to represent Defcon Level 1 importance, is limited to truly what stops business.",
              "score": 1,
              "created_utc": "2026-01-21 00:26:45",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0s8ugc",
          "author": "reubendevries",
          "text": "This is a decision process question. You should be categorizing all bugs - once you have organized your bug backlog, delete any duplicates or merge them. Then you need to talk to your SDET/QA team and determine the likely hood of the bug occurring (rate out of 10), then you need to determine the impact of the damage it costs. While business will always rate things in dollars you'll need to figure out a dollar value and rate it out of 10 (i.e $1,000,000 per hour would probably be a 10, $10 per hour would be 1) When you have those two numbers multiple them and take the top 5% to 10% and start working on them. This should be a continual process and when you have discovered a bug, change your template so that the person filling out the template can input that information for you. You should be working on bugs that are consistently hitting the 80 - 100 scale, trying to figure out quick cheap wins on the 50 - 80 scale and mainly disregarding anything that scores under 50, until it is pushed above 50.",
          "score": 1,
          "created_utc": "2026-01-21 02:26:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0sbiw7",
          "author": "easy-agile",
          "text": "The 30-60 second constraint is actually helpful here - it forces you to trust your gut instead of overthinking each decision.\n\nFor impact, ask yourself two questions per bug: How many users does this affect? How much does it block their work? That usually gets you to a high/medium/low rating faster than elaborate scoring systems. High impact = lots of users or completely blocks a key workflow. Medium = affects some users or creates workarounds. Low = edge cases or minor annoyances.\n\nFor priority, you're essentially deciding \"when should we fix this\" - next sprint, soon, or later. The combination usually shakes out naturally: high impact bugs that are quick wins go in the next sprint, high impact complex problems get scheduled, and low impact items stay in the backlog until you have cycles.\n\nOne approach that works well for big backlogs: start with a quick filtering pass. Anything that hasn't been reported again in your typical release cycle might not need immediate attention. You could also sort by how often the bug appears in support tickets or user reports - bugs that keep surfacing probably deserve prioritization even if they initially seemed minor.\n\nWith 400+ bugs, consider doing a first pass just bucketing things into critical/high/medium/low/obsolete, then spend your detailed triage time on the critical and high buckets. You'll get through the list much faster and make better decisions about what actually needs attention in your next sprint.",
          "score": 1,
          "created_utc": "2026-01-21 02:42:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0t03y8",
              "author": "Subject-Scholar6197",
              "text": "This is the best advice thank you!!!",
              "score": 1,
              "created_utc": "2026-01-21 05:18:40",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qh13e3",
      "title": "My first 2026 sprint retrospective",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1qh13e3/my_first_2026_sprint_retrospective/",
      "author": "yukittyred",
      "created_utc": "2026-01-19 10:52:37",
      "score": 10,
      "num_comments": 29,
      "upvote_ratio": 0.82,
      "text": "\nI’m looking for some feedback on a recent sprint retrospective I just joined. We have two teams that were recently combined, and it was a bit of a chaotic start—we actually had to use a Discord \"wheel of fortune\" just to pick someone to take notes because the team was so hesitant.\nI’ve listed the key takeaways below and would love to know if these are \"normal\" growing pains or if we are heading in a weird direction. \n\nWhat Went Well\n * Standardizing Reviews: Finally got code reviews integrated into the workflow.\n * Cross-Unit Collaboration: Our SD unit started utilizing the AI Unit group in GitLab, which is a big win for resource sharing.\n\nWhat We’re Stopping (The \"Red Flags\")\n * Massive Merge Requests: We’re implementing a hard rule: if an MR takes longer than 30 minutes to review, it’s rejected.\n * Production Cowboys: No more compiling or packaging on the production server. We're moving to a private registry for built images.\n * Estimation Issues: Stopping the use of \"distribution factors\" for man-day calculations (it’s been inaccurate) and stopping last-minute sprint backlog changes.\n * Task Management: Developers were juggling multiple user stories simultaneously; we’re moving back to a \"one person, one priority\" flow.\n\nWhat We’re Starting (The Action Plan)\n * Accountability: No more \"ghost tasks\" (work without records) or editing tasks you aren't assigned to.\n * Technical Debt & CI/CD: Cleaning devcontainers every sprint, improving pipelines incrementally, and ensuring test results are visible directly in the MR.\n * Local Dev: Pushing for local development on lightweight projects to save server resources.\n * Communication: Meeting Minutes (MoM) for reviews and reporting unresolved bugs to the Scrum Master at least 2 days before the review.\n\nMy questions : is there anything or weird thing in our sprint retrospective? \n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1qh13e3/my_first_2026_sprint_retrospective/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o0gipkb",
          "author": "sweepers-zn",
          "text": "Looks solid! I’m curious how you arrived at the conclusions. Did someone say “this is what we’re doing/not doing from now on” or was it a more collaborative process?\n\nYour outcomes look mostly like changes in behavior rather than specific actions. How are you planning to track they were implemented?",
          "score": 6,
          "created_utc": "2026-01-19 11:16:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0gj3v1",
              "author": "yukittyred",
              "text": "All of this decision is made by our unit head, basically the guy who manages us.\n\nHe just listen and then tell us what to write on it. \n\nThere's alot of problems hidden actually but we just pretend it's nice.",
              "score": 4,
              "created_utc": "2026-01-19 11:20:05",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0h1n5f",
                  "author": "HydrolyticEnzyme",
                  "text": "That sounds like the team doesn’t own any of those actions/improvements if the decisions were all made by the manager.  What did members of the team want to do?  Did they have their own ideas?\n\nSomeone coming up with a ‘good enough’ idea themselves will have more engagement than being told the ‘perfect’ idea from someone else. \n\nIf the team is used to the manager/someone outside the team coming up with ideas, that can build the habit of just waiting to be told what to do. ",
                  "score": 5,
                  "created_utc": "2026-01-19 13:34:59",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o0h5032",
                  "author": "sweepers-zn",
                  "text": "Okay so what looks like a nice retrospective outcome is actually a prescription from the manager. A red flag but not necessarily a problem.\n\nIt appears that the prescription solves some pains that the team identified themselves, is that right?\n\nDo the team members respect the manager? Do they agree with the solutions? Will they follow the guidelines? What are you doing yourself to ensure the guidelines will be followed? Are you planning to review how successful you were in following them in the next retro?",
                  "score": 2,
                  "created_utc": "2026-01-19 13:54:15",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o0m8f1j",
                  "author": "PhaseMatch",
                  "text": "\"manager tells team what to do\"  will tend to drive a couple of things\n\n\\- people do what they are told while they are being watched  \n\\- people don't do anything they are not explicitly told to do \n\nIn the short term for inexperienced teams \"telling\" works, but the coaching arc you have for that manager might want to take them through \"Selling\" and \"Telling\" and onto \"coaching\" and \"delegating\", if they really want to drive high performance.",
                  "score": 1,
                  "created_utc": "2026-01-20 05:22:28",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0glxus",
          "author": "app1310",
          "text": "This reads very normal for a team that’s just been merged....early uncertainty followed by tighter working agreements is a common pattern.  \nOne thing to keep an eye on is review time rules - speed is important, but clarity and shared understanding matter just as much....Overall the focus on single-priority work, clear ownership and better communication feels like healthy stabilization rather than a red flag.",
          "score": 2,
          "created_utc": "2026-01-19 11:44:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0gn7uk",
          "author": "Dsan_Dk",
          "text": "I would say this looks great, my ambition is to get my teams close to these topics atleast.\n\nMy experience is that when we have this many actions to start, teams often get critical that to much is in focus, and the result is often that none of it is truly tried and implemented in the following sprint. \n\nSo I am trying to become better at having the team reflect deeper towards what is the MOST limiting, so they focus on 1 thing to change or try in the comming sprint - the rest is fairly talked about, and if they want, they can do those aswell but we won't follow up necessarily.",
          "score": 2,
          "created_utc": "2026-01-19 11:54:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0gox2k",
          "author": "LazyJogi",
          "text": "IMO, there are too many action items, and they don’t look very concrete. Maybe you discussed this during the retrospective, but based on the text alone, they don’t seem actionable enough.",
          "score": 1,
          "created_utc": "2026-01-19 12:08:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0gpe3k",
          "author": "Kenny_Lush",
          "text": "“Accountability: No more \"ghost tasks\" (work without records) or editing tasks you aren't assigned to.” \n\nThis is where “agile” always loses me. Maybe it’s ADHD, but if I’m not free to roam the range I’d lose my mind.",
          "score": 1,
          "created_utc": "2026-01-19 12:11:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0jffkz",
          "author": "Sweaty_Ear5457",
          "text": "yeah the weirdest part is that your unit head is basically dictating the whole thing and the team is pretending it's fine. a real retro needs the team to actually drive it, not just take orders. maybe try a different approach where everyone can throw cards onto a canvas anonymously or collaboratively, then group them into zones by theme and draw arrows between related problems. that way the hidden stuff actually has a chance to surface. i use instaboard for this kind of team mapping - the infinite canvas lets you see everything at once instead of just listing things in linear format.",
          "score": 1,
          "created_utc": "2026-01-19 20:17:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0juz3w",
              "author": "yukittyred",
              "text": "Oh I try this before but they told me it is a waste of time so we don't use anymore.",
              "score": 1,
              "created_utc": "2026-01-19 21:31:46",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0kqbty",
          "author": "ScrumViking",
          "text": "While I applaud your team’s eagerness to improve things, chances are that none of these items will really be implemented within the next few sprints. \n\nOften it’s better to really focus on one or two items that will help the team, create a plan of implementation, determine how to measure its outcome throughout the sprint. \n\nIf you are interested in reading a bit about how to organize retrospective, that can lead to meaningful, positive change, I can really recommend the book from Esther Derby called “Agile Retrospectives”.",
          "score": 1,
          "created_utc": "2026-01-20 00:13:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0kzb5w",
          "author": "WideFunction6166",
          "text": "Some of these look like working agreements rather than actions.  Are working agreements written down?  It might do to gather a list of working agreements and review them at the beginning of each Retro.  Suggest turning 2-3 of these into stories and making the rest working agreements to be chewed over in future retros.  This looks like a team that should discuss kanban practices.",
          "score": 1,
          "created_utc": "2026-01-20 01:01:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0l9aor",
              "author": "yukittyred",
              "text": "I did ask why don't use kanban, but our supervisor say its scrum and nothing is wrong.\n\nWorking agreement is our business process which was written down and force to follow.\n\nOur user story have to accept all those things from business process.",
              "score": 1,
              "created_utc": "2026-01-20 01:56:20",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0nhjzv",
                  "author": "WideFunction6166",
                  "text": "Since it is your first retro, get into the flow.  Ultimatly the decision on how the work is processed belongs to the team.  As you get to know the supervisor some coaching may be needed.  The Distribution Factors idea screams Kanban to me.  Take your time.  Come to know all the people.  The heart of agile isnt scrum or kanban it is an empowered team",
                  "score": 1,
                  "created_utc": "2026-01-20 11:54:25",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0m64a0",
          "author": "Mr_Matt_Ski_",
          "text": "Was your retro in person or remote? Having to use a tool to pick a note taker kind of feels like no one wants to be the one speaking up. I’d recommend allowing anonymous feedback next time, I find that can make a huge difference in newer or combined teams where everyone’s not yes super comfortable. If you’re doing them remote, check out Kollabe. It’s pretty easy to add anonymous feedback",
          "score": 1,
          "created_utc": "2026-01-20 05:06:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0n55dc",
              "author": "yukittyred",
              "text": "We doing physical only",
              "score": 1,
              "created_utc": "2026-01-20 10:08:12",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0m9k8h",
          "author": "PhaseMatch",
          "text": "Not clear to me \n\n\\- how you are measuring performance  \n\\- how you are measuring your experiments\n\nWithout something to measure you will be left with dogma; did our additional processes make things better?\n\nIf the processes are imposed top down and don't tie back to any measure, then expect them to start to erode over time, which will lead you back round in a circular loop or adding more processes...",
          "score": 1,
          "created_utc": "2026-01-20 05:30:45",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qit3zb",
      "title": "Agile Transformed how my department works, but not getting recognised. How did you handle this?",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1qit3zb/agile_transformed_how_my_department_works_but_not/",
      "author": "Maverick2k2",
      "created_utc": "2026-01-21 09:08:38",
      "score": 9,
      "num_comments": 46,
      "upvote_ratio": 0.91,
      "text": "In my current role, I’ve fundamentally transformed how my department operates.\n\nWe went from:\n\n\t•\tLittle to no visibility over the pipeline of work\n\n\t•\tFrequent escalations and firefighting\n\n\t•\tPoor relationships with cross-team dependencies\n\nTo:\n\n\t•\tFull visibility of delivery and priorities\n\n\t•\tFewer escalations and more predictable outcomes\n\n\t•\tStronger, more strategic cross-team relationships\n\nThe work is respected and people openly say things run much more smoothly now. I’m seen as someone who “keeps things running” and unblocks problems.\n\nThe issue is recognition.\n\nWhen it comes to showcasing impact, leadership tends to spotlight my peers’ initiatives instead. Their work gets presented upward, raising their profiles, while my transformation work stays largely in the background - even though it underpins a lot of what others are delivering.\n\nI’m not being treated badly, and I am respected, but it feels like I’ve become invisible in terms of progression. I’m starting to think about leaving, but before I do:\n\nFor those who’ve been in a similar position - how did you handle it?\n\n\t•\tDid you manage to reframe your impact and get recognition internally?\n\n\t•\tDid you deliberately change how you worked to be more visible?\n\n\t•\tOr did you eventually leave, and was that the right call?\n\nWould really appreciate hearing how others navigated this.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1qit3zb/agile_transformed_how_my_department_works_but_not/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o0vzc92",
          "author": "agile_pm",
          "text": "You solved a problem and moved things from dysfunction to competence.  You did what you're paid to do.  \n\nEven though what you accomplished is genuinely valuable, it's not strategic in the way that leadership defines strategy.  The issue isn't recognition; it's that you are not positioning your work in terms of outcomes.  Operational excellence is not the same as enterprise movement.  Delivery, predictability, and stronger relationships are table stakes.\n\nWhat can the organization do now that it couldn't before?  Which strategic problems were solved or opportunities were realized?  You're winning an operational game while trying to be promoted into a strategic game.  I don't know if it's too late to capitalize on past success, but going forward be sure to reframe your success in terms of strategic outcomes, not just operational efficiency.\n\nI'm not saying you should leave, but I was in a similar situation and was not promoted until after I left and proved myself at the next employer, where I was intentionally and visibly more strategic.",
          "score": 9,
          "created_utc": "2026-01-21 17:18:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o17j3uv",
              "author": "Maverick2k2",
              "text": "I do appreciate that perspective. At the same time, I’ve seen a number of highly paid Agile Coaches and senior managers hired to deliver exactly this kind of change who ultimately didn’t manage to make it stick.\n\nThat’s where the frustration comes from. They held the titles and compensation, while I’ve delivered comparable - if not stronger - outcomes as a Scrum Master on a significantly lower salary.\n\nAnd this hasn’t just been about operational tidy-up. The department is now more strategic and forward-looking in how work is delivered. We’re able to incrementally and continuously deliver outcomes, make better prioritisation decisions, and reduce ambiguity. Previously, there was a lot of confusion and unclear ownership around what mattered most.\n\nI also actively work with Product Management on Roadmapping activities.",
              "score": 3,
              "created_utc": "2026-01-23 09:13:14",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1jew77",
                  "author": "agile_pm",
                  "text": "Let's take a step back and look at some definitions:\n\n* Efficiency is the core component of excellence, focusing on cost reduction and faster, improved execution. \n* Operational Excellence ensures all processes align with strategy to deliver superior value. \n* Strategy defines the unique, long-term value proposition and competitive advantage. \n\nNow, let's look at some of your statements:\n\n* The department is now more strategic and forward-looking in how work is delivered.\n* ...there’s a clear quarter-on-quarter increase in the number of projects delivered (+50%). \n* relying instead on continuous prioritisation and flow.\n* I also actively work with Product Management on Roadmapping activities.\n\nIt sounds like you're moving into Operational Excellence, but your framing is about delivery, which gets interpreted as efficiency, not strategic value.  How has what you, and those working with you, have accomplished moved the strategic needle?  Why would an executive, who is concerned about tradeoffs, revenue, cost savings, etc., look at your accomplishments and think that you've done more than make things really efficient?  Sure, you've done a great job, but have you done more than is expected of you?\n\nAs I said before, what you've accomplished is important.  Companies need good people that can keep things running smoothly.  Why would they want you to do something else?\n\nYou've expressed that you're frustrated that you're not getting recognized for your contributions.  Whose job have you made easier?  The Product Manager's and the project team's, or the CEO's?  All three are possible, but to borrow from u/chiggy1223:\n\n* Has it created new markets or protected its old markets better?\n* Is it tangibly raising profit margins or supercharging growth?\n\nWhich strategic objectives have you met?  Did the company have a top-level goal to deliver faster or deliver more projects?  What strategic initiatives would not have been able to be completed, let alone started, if not for the changes you helped bring about?  Nobody else is going to frame your successes in terms of strategic value for you.  If you're not doing it, how will they know?\n\nI'm not saying to run around blowing your own horn and extolling your virtues.  but if asked what you've accomplished that makes you feel you deserve a promotion, does your answer sound more strategically focused if it is \"We delivered 50% more projects, QoQ, by doing ...\" or \"We've realized 25% revenue growth, YoY, for the past three quarters as a result of...\"?  How you describe your successes affects how they are viewed, which affects how you are viewed.  Are you efficient or are you strategic?",
                  "score": 1,
                  "created_utc": "2026-01-25 01:43:12",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o1cdqcl",
              "author": "chiggy1223",
              "text": "This is exactly right. I have never worked for an organisation that actually values operational excellence - even when they started with completely terrible operations. I’ve come to see that perhaps the reason why they were in such dire straits operationally to begin with may be that they systematically undervalue it, and hence doing work there no matter how significant does not make you valuable.",
              "score": 2,
              "created_utc": "2026-01-24 00:50:49",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1eqy90",
                  "author": "Maverick2k2",
                  "text": "I’ve just reviewed our quarterly metrics and there’s a clear quarter-on-quarter increase in the number of projects delivered (+50%). This improvement has been achieved without reverting to waterfall delivery, relying instead on continuous prioritisation and flow. I’ve rarely seen this sustained in a large organisation, and it reflects strong leadership alignment around agile ways of working. Which I have done.\n\nThis isn’t just operations , it’s been a total shift in mindset across all stakeholders.",
                  "score": 2,
                  "created_utc": "2026-01-24 11:23:15",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0u3t3l",
          "author": "flamehorns",
          "text": "Invisible is good. The old days of fetishizing agile are long gone. You can drive the recognition. You can thank management and all team members for their support. You are a servant leader, you know you did well, your ego doesn't need masturbating, you are above that. Stay invisible, keep serving quietly from the background, and praise the others and masturbate their egos generously.",
          "score": 5,
          "created_utc": "2026-01-21 11:11:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0u9nts",
              "author": "Maverick2k2",
              "text": "It just really comes down to being paid what you are deserved. The work I’m doing is hard. Driving change without any authority.\n\nOn that note, I am well on my way with solving systemic organizational problems and I’m being paid a lot less that my manager. \n\nDoesn’t make sense.\n\nI am also coaching other departments on how to structure their work and building a reputation as an Agile expert.",
              "score": 1,
              "created_utc": "2026-01-21 11:57:43",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0tr344",
          "author": "mmmleftoverPie",
          "text": "Do you have before and after metrics with respect to initiatives being delivered?\n\nEg 10 initiatives per quarter pre-transfornation, 15 initiatives per quarter after.\n\nOr x% initiatives delivered on time compared to y% delivered on time before.\n\nThat can help you.\n\nOtherwise can you measure/identify the reduction in fires that need putting out.\n\nAre you org's engagement scores rising?\n\nIs sick leave down?\n\nIt's a rich tapestry.",
          "score": 4,
          "created_utc": "2026-01-21 09:14:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0trak8",
              "author": "Maverick2k2",
              "text": "Yes , I track throughput and lead time. There has been an improvement with both. \n\nLeadership acknowledges this , but that’s it.",
              "score": 1,
              "created_utc": "2026-01-21 09:16:21",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0trefq",
                  "author": "mmmleftoverPie",
                  "text": "What recognition are you looking for?",
                  "score": 2,
                  "created_utc": "2026-01-21 09:17:26",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o0tsiwv",
                  "author": "LogicRaven_",
                  "text": "What are some differences between your peer’s initiatives and yours? \n\nBoth in terms of topic, deliveries and how the results are presented.",
                  "score": 2,
                  "created_utc": "2026-01-21 09:28:22",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o0x5vlr",
                  "author": "TMan-X",
                  "text": "Throughput and lead time doesn’t equal value. Figure out how to measure that in your setting.",
                  "score": 1,
                  "created_utc": "2026-01-21 20:27:54",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0x5ns3",
          "author": "TMan-X",
          "text": "You say the issue isn’t about recognition. Clearly though it is or you wouldn’t be posting about it. You also stated “I’ve fundamentally transformed how my department operates”.\n\n News flash, it isn’t about you.\n\nAs a good Scrum Master you should be highlighting how the TEAM transformed and more importantly how that resulted in better outcomes and value for their stakeholders.\n\nIf a scrum master does their job right, they put themselves out of a job. You either build on your success and go help another team in your organization, you move into a different role, or you go work somewhere else.",
          "score": 3,
          "created_utc": "2026-01-21 20:26:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0v81x5",
          "author": "Triabolical_",
          "text": "You need statistics and - shudder - a dashboard. \n\nOne of the inherent problems with software is that trans work on different things and nobody knows how long they should take, and managers often look at activity as a sign of improvement and innovation. \n\nCalm and competent teams get ignored. \n\nI led one team where we had a lot of control over process and we did really, really well. Calmly. \n\nI ended up with very high ratings in employee satisfaction - in the high eighties versus the mid seventies. \n\nAnd... I got marked down on my review because I wasn't working my employees hard enough. And my peers were unhappy because they made me look bad. \n\nSo figure out the stats that make you look good but beware of your peers because they will fight back, even if they are your friends.",
          "score": 2,
          "created_utc": "2026-01-21 15:14:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o15mf8w",
          "author": "ben505",
          "text": "Welcome to the workplace lol, shit sucks. This is why ruthlessly selfish people tend to climb the ladder",
          "score": 2,
          "created_utc": "2026-01-23 01:17:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1epl5e",
          "author": "AgileEvolves",
          "text": "Wow! Great comments here. Lots of wisdom to process. Maverick, that’s a tough situation you have here. There may be a strategy to stay vs leaving. You have to do the pros and cons. The stay strategy is to create  new internal job for yourself and sell it to leadership. Using AI give it your current job description and then have it give you the one you want to be promoted to. Tweak it and then pitch internally as “ I want to servant lead the whole corp to have the same outcomes as my department.” In other words sell them the idea of you as Enterprise Agile\nCoach coaching other SM and establishing a LACE. . Worse case they say no, best case you’ve prepped for external job interviews. You gave them a chance and if they decline, you did your all. Good luck!",
          "score": 2,
          "created_utc": "2026-01-24 11:11:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0tvvfy",
          "author": "ScrumViking",
          "text": "One of the core conflicts is that impact of successful transformation is delayed and hard to correlate. This is where setting objectives and visualizing progress towards them can really help give it the attention it deserves. Leading with Obeya is a good method to create insight into translating strategic objectives towards results, couple them with initiatives and impediments.",
          "score": 2,
          "created_utc": "2026-01-21 10:00:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0u32yg",
          "author": "corny_horse",
          "text": "The obvious omission in our entire post is how that translates to $.  If you just took the three info points from your first two, you could achieve the same points by tanking the team productivity, too. Less stuff done = more visibility and fewer escalations, and more time to be \"strategic.\"  \n\nWould that be good for the company and/or team? Probably no to both.\n\nYou need to translate that into how you are achieving results and how that helps the team ship code to customers who pay you money.",
          "score": 1,
          "created_utc": "2026-01-21 11:05:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0uaexx",
              "author": "Maverick2k2",
              "text": "That is the problem, it doesn’t cleanly translate to dollars . At the same time, I’ve got the department to the point where they have more clarity in terms of how the work is planned and delivered. Previously nobody had any idea of what was going on. I’m sure that should account for something?",
              "score": 1,
              "created_utc": "2026-01-21 12:03:17",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0ucyob",
                  "author": "jesus_chen",
                  "text": "It does account for something: your firm values it at $55k per year. \n\nIf I were you, I’d get the firm to pay for every Scrum cert under the sun including product roles because what you aspire to be, based on your feedback in this thread, is a Product Owner. Get the certs, put your jead down and work on tour resume (with How you transformed a loose engineering org into a product machine) and once the market turns back up (2027?), go for a new org with a ton pf experience on your CV.",
                  "score": 2,
                  "created_utc": "2026-01-21 12:21:46",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o0uh2zt",
                  "author": "corny_horse",
                  "text": "Your department doesn't do anything that produces value?  It should be glaringly obvious how your department produces value, even if you're a cost center.  In the case of the former, it's the amount of profit, if you're a cost center its the amount of labor hours you've saved.  \n\nFor example: How expensive was an escalation before the work?  How frequently did they happen?  If you had one incident a month and it required 50 engineering hours to fix, and now there are .33 incidents per month and they take 1 hour to fix... back of the napkin math - which is sometimes just as good as management is concerned would reveal you want from ~$1.2m in firefighting to $5-10k annually.",
                  "score": 1,
                  "created_utc": "2026-01-21 12:49:26",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0vzskb",
          "author": "Budget_Pin5828",
          "text": "Demonstrating Value and Impact \n\n* What are you tracking today?  I think I saw in the comments below you are tracking lead time and throughput. \n* How are tracking value and input?  How are you translating that into actual dollars?  Either cost avoidance or roi?\n* What leading indicators are you tracking?\n*  What I am seeing and typically see alot are metrics, but not metrics tied to value.  Cycle time and lead time went down, so what?  Translate that into dollars. Did we make more money because we delivered early?  If defects are down, are there fewer customer complaints or has customer retention or activation improved?\n* While the metrics you are capturing are ok, they don't speak to the overall value or impact to the bottom line, or to the overall product/customer lifecycle.  \n\nRecognition and promotion  \n\n* The market is flooded with Scrum Masters and Agile Coaches.  \n* So if you're looking to exit your company, it's ultra competitive out there.  You'd be competing with SMs that have your success story 5 times over\n* Further, these SMs and Agile Coaches have already figured out how to tie their process metrics to actual dollars.  \n* Things that appear to be missing (based on your post) that would help make the case for a promotion:\n   * Tying process metrics to value and impact\n   * Metrics translations to actual dollars\n   * Customer and Stakeholder Sentiment\n   * Product and Customer Metrics\n* These will help you build a broader empirical narrative for making your case for promotion. its hard to argue with empirical data with tangible impact.",
          "score": 1,
          "created_utc": "2026-01-21 17:20:28",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qgcq2r",
      "title": "First SM role, need advice",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1qgcq2r/first_sm_role_need_advice/",
      "author": "throwawayyqweqwe",
      "created_utc": "2026-01-18 16:17:11",
      "score": 5,
      "num_comments": 8,
      "upvote_ratio": 0.86,
      "text": "Hello everyone, I work as a Junior Consultant and I took the PSM test a few months ago (I passed). Although I know it by theory, I never had any chance to apply it/be in a scrum team. Now I have been assigned to a project where I will be a scrum master and I have no idea how to start, or establish a process. I’m really stressed out looking things up online, asking around. Can you guys give me some advice? Real life scenarios, how you drive the stand ups, how you schedule the ceremonies, who should I reach out to. Anything really will help. Thank you so much.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1qgcq2r/first_sm_role_need_advice/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o0bajve",
          "author": "Fr4nku5",
          "text": "If you work at a consultancy, you might be better off asking people in the consultancy.\n\n\nSome of the larger consultancies have their own spin on scrum. For them they might want you to record minutes or ensure everyone is doing lots of work... or they might want you compiling reports on your team...\n\n\nI suspect it'll be more like that, because you've been given a job and little support in the way of documentation or a mentor.\n\n\nI hope I've got the wrong end of the stick, but acting on advice from this community might contradict you consultancy's practices and reflect poorly on you. ",
          "score": 6,
          "created_utc": "2026-01-18 16:28:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0bq1wi",
              "author": "Kenny_Lush",
              "text": "I suspect you are right. In “weaponized agile” the role is “summarize and report on the daily status call.”",
              "score": 4,
              "created_utc": "2026-01-18 17:42:49",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0brbeo",
          "author": "Bernhard-Welzel",
          "text": "I had the Scrum Master role in 20+ Organisations so far. It was always different and there is no pattern.\n\nYour #1 priority should be to understand what is expected of you. Ask your manager: \"How can you tell i did a great job?\" - \"how will you evaluate my performance?\"  \n  \nFrom way to much experience, i fear what is expected of you is to be the manager of a feature factory: Make sure the team delivers stuff, make sure they play nice with each other and don´t start any drama. In short: manage the throughput of the team and make sure what is promised gets delivered. At the core, it is the \"make sure\" part that you need to figure out. \n\nFor the rest: ask an LLM for advice - it will give you all the details you need. \n\nThe Scrum Master role that the trainings or scrum guide talks about needs something that you might not have: senior management buy-in and support. To be effective as a SM, you have to be part of an ongoing transformation of the organisation that is fully aligned with the business goals and C-Level.  \n  \nOtherwise, you just burn out or get kicked out very, very quickly.",
          "score": 5,
          "created_utc": "2026-01-18 17:48:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0qpfcg",
              "author": "Wiszcz",
              "text": "It was always different and there is no pattern. - exactly",
              "score": 1,
              "created_utc": "2026-01-20 21:31:06",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0gdl1k",
          "author": "MagnusLink",
          "text": "Hey! Exciting with a new role and new experiences. Understandably scary, too. \n\nIf you go in with the right mindset, you will be fine. Before you make many changes or force strict Scrum rules on people, observe and listen.\n\nYour approach will depend on the team’s past experience and how they work now. It also matters if this is a new team.\n\nSet up 1-on-1s with people inside and outside the team. Ask what works and what does not work. Ask how open they are to change and what you should focus on first. This does not mean they are right or that you must do what they say. It will, however, give you very useful input for your next steps.\n\nTo answer your specific questions:\n\n1. For stand-ups, try to keep them short. If they already do daily stand-ups, keep the format until you know what works in their context. Check if one person runs the meeting, if there are too many people, and if it is a status report instead of a focus on blockers and teamwork.\n\n2. I prefer shorter iterations, (1-2 weeks). I plan ceremonies in the middle of the week, not Monday or Friday. I also plan prep meetings with the team or with a few people before the main ceremonies.\n\n3. Meet everyone on the team in 1-on-1s. Also meet key people outside the team. You can ask the team who those people are.\n\nGood luck!",
          "score": 2,
          "created_utc": "2026-01-19 10:30:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0lfyi5",
          "author": "No-Literature-6695",
          "text": "Find games and questions to help the team get to know each other and build trust. \nHelp the team learn the signs of anti-agile patterns: stories stuck in-process, stories piling up in testing, all or most stories getting done in the last 1-2 days of the sprint, pushing ‘almost done’ stories to the next sprint, instead of the the backlog for re-prioritization. Role or domain specialization within the team (yes, this slows things down.)\n\nGently guide the team into find their own solutions to these anti-patterns. \n\nYou should have monthly confidential one-on-ones with each member of the team. They may not feel safe enough to be honest, especially, if they’re offshore, but you can often discern clues of problems with team dynamics. Speaking of off-shore, their culture may be very hierarchical. You want to encourage, incentivize, and praise speaking up, pointing out problems, and speaking truth to power (i.e. you, the product owner, the BSA/tech PO, and anyone else with scary onshore role or culture power.",
          "score": 1,
          "created_utc": "2026-01-20 02:32:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0o69zj",
          "author": "bookninja717",
          "text": "Also ask the team. \n\nA consultant almost always starts with: \"How is this working for you?\" \n\nIn my first job, I asked the team what they needed, and I got a very different answer than I expected.",
          "score": 1,
          "created_utc": "2026-01-20 14:26:28",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qkrw44",
      "title": "Feature Prioritization: Representative Democracy or a Authoritarian State?",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1qkrw44/feature_prioritization_representative_democracy/",
      "author": "AgileEvolves",
      "created_utc": "2026-01-23 14:13:58",
      "score": 5,
      "num_comments": 17,
      "upvote_ratio": 0.86,
      "text": "Had a great question posed about this and I know what I think. Open to other views. \n\nHow do you view feature prioritization by Product Managers or Product Management?\n\nHow do you perform it or seen it performed?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1qkrw44/feature_prioritization_representative_democracy/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o19k0fa",
          "author": "LightPhotographer",
          "text": "Definitely not a democracy - do that and you get a product designed by committee and it's absolute horror. \n\nThe product owner is the Single Wrenchable Neck, meaning one person to make the call, one person to explain them (and base them on data) ... and responsible also means accountable. \n\nIt's like the captain on a ship. The fact that he has final authority does not mean he can run the ship alone, or that the insights of the others are not valuable.   \nBut at some point you have to make the call and a democracy leans itself to lengthy discussions and wheeling and dealing.",
          "score": 10,
          "created_utc": "2026-01-23 16:40:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1b5p04",
              "author": "99ProllemsBishAint1",
              "text": "This is the answer. At some point discussion ends and they need to make the call and then be supported by those around them.\n\nMany years ago I heard an executive say that they needed to know whose neck to squeeze if something goes wrong. It helped me recognize accountability gaps. I'm happy to see that concept in other places",
              "score": 2,
              "created_utc": "2026-01-23 21:06:55",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1bofmi",
                  "author": "LightPhotographer",
                  "text": "I notice two things. When it's unclear who should take the decision, it's debated at great length and everybody feels their opinion counts.\n\nWhen someone does take a decision, you would expect a lot of discontent, based on the amount discussion. But actually a lot of it evaporates, people are happy that a decision has been made (they can probably see both sides, and they're happy they are not the one making the call).",
                  "score": 2,
                  "created_utc": "2026-01-23 22:36:05",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o18pvlg",
          "author": "Budget_Pin5828",
          "text": "Neither. Data Driven  \nAs a PdM I'm accountable for the prioritization of my Product backlog, but realistically, I can't do it on my own.",
          "score": 7,
          "created_utc": "2026-01-23 14:19:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o19ee06",
              "author": "ratczar",
              "text": "Yes. It's only in absence of data that it becomes this kind of choice. \n\nDemocracy is particularly stupid, though. If you're getting a broad range of inputs you should be able to assemble a broad range of data, if only through NLP and sentiment analysis.",
              "score": 3,
              "created_utc": "2026-01-23 16:15:47",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o18qmj9",
          "author": "Fr4nku5",
          "text": "Maybe unpack a bit more:\n\n* Who posed the question and in what context?\n* What do you think and why you're looking for others responses? \n* What you think the difference is between product managers and product management?\n* Why are the two options 'representative democracy' and 'authoritarian state'? \n* Are those the only two options?",
          "score": 4,
          "created_utc": "2026-01-23 14:23:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o19ty4d",
              "author": "AgileEvolves",
              "text": "Answer the question or not. There is no try. 😉",
              "score": -1,
              "created_utc": "2026-01-23 17:26:48",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o19v2ue",
                  "author": "Fr4nku5",
                  "text": "Oh in that case the answer is \"7 ht - 13.4\"",
                  "score": 1,
                  "created_utc": "2026-01-23 17:32:00",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o19r735",
          "author": "flamehorns",
          "text": "It shouldn’t matter who does it , it should be based on a solid business case with numbers and some kind of prioritization model . The priority you end up with should be independent of who does it.\n\nIf 2 different people came up with completely different ideas about priorities I would see this as an issue. The whole company should have a good understanding of the goals of the organization and that should be reflected in an understanding of the relative priorities of all the high level initiatives and that should inform most prioritization decisions.\n\nAt some point thought it doesn’t really matter you can let the team decide on what order to go things in based on technical risk or something.",
          "score": 2,
          "created_utc": "2026-01-23 17:13:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1adolg",
          "author": "PhaseMatch",
          "text": "First comes the product vision  \nThen comes the business roadmap  \nThen comes what \"user benefits\" we are targeting  \nThen comes the customer buying and promotional cycle  \nThen comes a \"lean feature\" canvas and high-level sizing  \nWhat to do next kind of falls out from that.",
          "score": 2,
          "created_utc": "2026-01-23 18:55:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ev2zz",
          "author": "UKS1977",
          "text": "Like a proper government. Input from all, decision by one.",
          "score": 2,
          "created_utc": "2026-01-24 11:58:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o19a1jm",
          "author": "jesus_chen",
          "text": "The only opinion that matters is that of the end user answering this question: did you provide value?",
          "score": 2,
          "created_utc": "2026-01-23 15:56:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o19rgmn",
          "author": "BoBoBearDev",
          "text": "In my org, it is none of my org's business. My org is just a sweatshop contractor, we don't have commercial products. Meaning, the client is another company that pays us, a single entity. We have zero control over it. We prioritize based on them. I mean sure, we can prioritize our way, but why the fuck we we do that? That's stupid.",
          "score": 1,
          "created_utc": "2026-01-23 17:14:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o19y09a",
          "author": "AgileEvolves",
          "text": "These are all great comments. Thanks to all who took the time.",
          "score": 1,
          "created_utc": "2026-01-23 17:45:25",
          "is_submitter": true,
          "replies": []
        },
        {
          "id": "o1bbesc",
          "author": "mrhinsh",
          "text": "I don't think feature prioritisation is a democracy *or* an authoritarian act. That framing already assumes the wrong problem.\n\nIn Scrum, prioritisation is an **accountability**, not a voting exercise and not a power grab.\n\nPolitically, it maps closest to **technocracy with delegated authority**: decisions are made by the person accountable for outcomes, informed by evidence and expertise, and constrained by transparency, not popularity.\n\nThe Product Owner is accountable for maximising value. That means:\n\n* synthesising customer evidence, market signals, risk, and constraints\n* making trade-offs explicit\n* ordering work based on outcomes, not volume or loudness\n\nTeams don't vote on priorities because accountability without decision authority is meaningless. But equally, good Product Owners don't operate in isolation. They rely on:\n\n* Developers to surface technical risk and feasibility\n* Stakeholders to provide context and demand signals\n* Evidence from real usage to invalidate assumptions\n\nWhen prioritisation feels authoritarian, it's usually because strategy is unclear, feedback loops are weak, or the backlog is treated as a demand intake queue instead of a hypothesis list.\n\nWhen it feels like democracy, it's often because no one is actually accountable for outcomes.\n\nThe healthy pattern is neither.\n**Accountable technocracy under transparent constraint.**\n\nIf prioritisation can't be explained in terms of value and learning, it's broken, regardless of who made the call.",
          "score": 1,
          "created_utc": "2026-01-23 21:33:39",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qipgu6",
      "title": "Free retrospective formats that actually surface real issues",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1qipgu6/free_retrospective_formats_that_actually_surface/",
      "author": "easy-agile",
      "created_utc": "2026-01-21 05:35:20",
      "score": 4,
      "num_comments": 22,
      "upvote_ratio": 0.59,
      "text": "Hey r/agile \\- I work at Easy Agile and we've been collecting retro formats from teams for a while now. We built a free tool (Easy Agile Review) but honestly the formats themselves are useful regardless of what you use to run them.\n\nSome that consistently work well:\n\n* **Sailboat retro** \\- what's pushing you forward, what's holding you back, what risks are ahead\n* **4Ls** \\- Liked, Learned, Lacked, Longed For (good for reflecting on learning)\n* **Mad, Sad, Glad** \\- helps surface emotional blockers that \"start/stop/continue\" misses\n\nThe ones that tend to fall flat:\n\n* Start/Stop/Continue when it becomes too routine\n* \"Roses and thorns\" when teams aren't psychologically safe yet\n\nWhat formats have actually helped your team have honest conversations vs just going through the motions? Always looking to understand what works in practice.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1qipgu6/free_retrospective_formats_that_actually_surface/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o0u6s7x",
          "author": "Sky_Linx",
          "text": "Honestly, I've come back to plain plus/delta more times than I can count. The fancy formats are fun to try but they often get in the way.\n\nThe main thing I've noticed is that simpler formats mean people actually think about what they want to say, rather than spending half the time wondering \"wait, is this a 'Lacked' or a 'Longed For'?\" With two columns with obvious and straightforward meaning, there's nowhere to hide and nothing to overthink.\n\nThe other benefit is everything in the \"needs improvement\" column is already pointing at action. You don't have to decode metaphors about anchors and winds to figure out what to work on next.\n\nI also think elaborate formats can feel a bit performative after a while - the novelty wears off and then you're stuck with something complicated that's also stale. Plus/delta just... keeps working.\n\nNot saying the other formats are bad - sailboat can be great for a change of pace - but for week-in-week-out retros, simple wins.",
          "score": 4,
          "created_utc": "2026-01-21 11:35:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0uuvc7",
          "author": "CassiusBotdorf",
          "text": "In all seriousness, all of the retrospective templates are just variations of mad sad glad. Personally, and maybe that's really just me, I see little value different templates add to the process. The process is the thing that adds value.",
          "score": 8,
          "created_utc": "2026-01-21 14:08:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0uxwve",
              "author": "Sky_Linx",
              "text": "Agreed! At the end of the day every format boils down to \"what's working, what isn't, and how do we feel about it\". The wrapper is just packaging.\n\nThe value comes from the conversation and what you do with it afterwards - not from whether you're using a sailboat or 4Ls or starfish or whatever the flavour of the month is. IMO a well-facilitated plus/delta beats a poorly-run elaborate format every time.\n\nIf anything, I think the obsession with finding the \"right\" template can be a distraction from the harder work of actually creating space for honest feedback and then following through on it.",
              "score": 3,
              "created_utc": "2026-01-21 14:24:32",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0v4u20",
          "author": "clem82",
          "text": "I can get in a room without a format and surface real issue\n\n\nThe visual tool is just a tool, the person is how you uncover issues",
          "score": 3,
          "created_utc": "2026-01-21 14:59:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0y45zf",
              "author": "easy-agile",
              "text": "100% agree. I've seen facilitators with zero tools still run amazing retros just by asking good questions and actually listening. The format is scaffolding at best.\n\nThat said, for newer facilitators or teams that struggle with participation, having a structured format can be a helpful crutch until they build that muscle. But yeah, the person matters way more than the pretty template",
              "score": 2,
              "created_utc": "2026-01-21 23:09:43",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0y4jsj",
                  "author": "clem82",
                  "text": "I agree, but I think it comes down to the person.  \n\nIf the person is good with people, they should not force use the tool and think about how to uncover the information. The right SM/facilitator it will come natural to it.  Where the struggle comes in is if they're forcing it",
                  "score": 1,
                  "created_utc": "2026-01-21 23:11:43",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0tj5ec",
          "author": "ya_rk",
          "text": "It's not a format but a meta-structure for retrospdctives in general that I like to keep in mind:\n\nORID - Objective, Reflective, Interpretation, Decision",
          "score": 2,
          "created_utc": "2026-01-21 07:58:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0u7vsr",
              "author": "Sky_Linx",
              "text": "Yeah this is a good distinction. ORID works as a mental model for the facilitator - making sure the conversation moves from facts to feelings to meaning to action, rather than jumping straight to solutions before the problem is properly understood.\n\nI think the key is it stays invisible to participants. If you're explicitly walking the team through \"okay now we're in the Interpretive phase\" it gets a bit workshop-y. But as a guide for how to steer the discussion, it's solid.\n\nAnd it works with any format - you could run a simple plus/delta while using ORID to shape how you facilitate it.",
              "score": 3,
              "created_utc": "2026-01-21 11:44:29",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0thm8v",
          "author": "vcuriouskitty",
          "text": "I hardly follow those formats and I create my own template.\nFor example, today’s retro I used these:\n\n1. Rate the last sprint\n2. Chef’s kiss (what went well)\n3. Oof moments (what went wrong)\n4. Superstars last sprint (kudos/shoutout)\n5. Action items\n\nIt changes every sprint. I was a part of their team as a QA before so I know they don’t like the classic template of sprint retro and they feel more comfortable speaking up when the theme is creative.",
          "score": 1,
          "created_utc": "2026-01-21 07:44:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0u7kcg",
              "author": "Sky_Linx",
              "text": "One downside of changing formats every sprint - you lose the ability to compare retros over time and spot recurring themes. Also adds friction for quieter folks who have to re-learn the format each time instead of just knowing where their thoughts go.\n\nConsistency has its own value, especially if your retro tool has analytics features. Being able to track recurring topics, sentiment trends, and patterns across sprints gives you a much better picture of team health than any single retro can. Hard to do that when you're switching formats constantly - you end up with apples-to-oranges data.\n\nThe best format is probably one that becomes invisible so people focus on the content, not the structure.",
              "score": 0,
              "created_utc": "2026-01-21 11:42:02",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0uhlfk",
                  "author": "vcuriouskitty",
                  "text": "Well, what matters the most is it works for us. The theme changes, but the point of the sprint retrospective remains. Everyone is on the same page, and we’re still able to address the actions items. Our team members are vocal too so 🤷🏽‍♀️ it has always been like this even before I was the SM. If it works, then I ain’t gonna break it. We don’t see any downside.\n\nAt the end of the day, you gotta find what template or format that will make your team feel comfortable to express their opinion and at the same time without compromising the purpose of the retro. It just so happens my team likes creativity.",
                  "score": 1,
                  "created_utc": "2026-01-21 12:52:41",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0vozij",
          "author": "deadmuthafuckinpan",
          "text": "The most useful tool I've found is what I call a Feelings Map because I don't know what it's really called. Basically you plot out the timeline of the project on the x axis with a few key milestones or events identified, then you ask everyone to draw a line indicating how they felt along the way with the y axis going from Fantastic at the top to Scared/Awful/Gonna Lose My Job at the bottom. \n\nThen you, the facilitator, looks for insights or key overlapping sentiments and uses those as discussion points for the group, recording those insights, actions, or learnings along the way. \n\nThis works great at a whiteboard. I've never seen this implemented digitally. ",
          "score": 1,
          "created_utc": "2026-01-21 16:31:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0y4c86",
              "author": "easy-agile",
              "text": "Thank you for sharing. I have never heard of it called Feelings Map but the concept makes sense. Emotional trajectory over time surfaces patterns that point-in-time formats miss.\n\nHave you found this works better for longer retrospectives (end of project/quarter) vs sprint retros? Seems like it needs more time to map and discuss than a standard 2-week sprint retro would allow",
              "score": 2,
              "created_utc": "2026-01-21 23:10:37",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0y5c8a",
                  "author": "deadmuthafuckinpan",
                  "text": "For sure, it's not useful for a sprint retro. But for an end-project retro, or if you're coming in mid-project to turn things around, it can be super valuable. ",
                  "score": 3,
                  "created_utc": "2026-01-21 23:15:55",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0wgvob",
          "author": "Sporknight",
          "text": "When you've been doing retros with the same team every two weeks for two+ years, it can be good to mix up formats!  Keeps things fresh for the team.  \n\nHaving said that, I'll sometimes do a picture/gif retrospective - either offer \\~4 different pictures, and ask people which one represents the past sprint for them the most, or ask folks to find and share a picture or gif of how they felt.  For the former approach, it's interesting to see what different elements people pick out that resonate with them.  For the latter, it can be a little silly and a fun icebreaker, but may not get the deepest, most meaningful results.  However, it can give folks a chance to vent a bit and get some things off their chest (hopefully with a laugh!), paving the way to a more robust conversation where you dig out action items and process improvements.",
          "score": 1,
          "created_utc": "2026-01-21 18:35:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0y4k3n",
              "author": "easy-agile",
              "text": "The gif/picture approach is great for breaking up monotony. Sometimes teams just need permission to be silly for a few minutes before they can get real.\n\nCurious though when you do the picture selection approach, do you intentionally pick images that surface different aspects (technical, team dynamics, external factors)? Or just choose randomly and see what resonates?",
              "score": 1,
              "created_utc": "2026-01-21 23:11:46",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0y7x4c",
                  "author": "Sporknight",
                  "text": "I tend to pick based on a theme, like springtime, travel, or sports, and then have different pictures based on a vibe, like stressed/chaotic, busy but productive, or sunshine and rainbows.  Folks will often pick out something unexpected from a picture that resonated with them, which makes it interesting.",
                  "score": 2,
                  "created_utc": "2026-01-21 23:29:44",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0zyr9a",
          "author": "gemneye73",
          "text": "I usually run a retro by using a Lean Coffee. Theme being focused on what worked well, what didn’t, etc. \nAnd then while discussing, we can do a little bit of the 5 whys. Works pretty well and teams love it because we managed to talk through a few items and get to a decent root cause.",
          "score": 1,
          "created_utc": "2026-01-22 05:42:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o10qyy6",
              "author": "Sky_Linx",
              "text": "Yeah Lean Coffee is solid for keeping things moving - the voting stops retros from getting hijacked by one topic and the time-boxing keeps energy up. Pairing it with 5 whys to dig into root causes is smart.\n\nOnly thing I'd watch for is that voting can bury uncomfortable stuff. If someone has an issue that others don't want to publicly upvote, or it only affects one person, it might never get discussed even if it's important.\n\nDo you do anything to catch those or just trust the important stuff surfaces eventually?",
              "score": 1,
              "created_utc": "2026-01-22 09:51:43",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o14xi3n",
          "author": "recycledcoder",
          "text": "I seldom use templated retros, we mostly just have conversations - but there's one \"template\" I like to throw in at random intervals: \"WTF Just Happened?!\"\n\nNot when something goes wrong or particularly right, mind you - it's just meant to elicit what extraordinary things _may_ have happened that somehow went unremarked upon. Even when it fails to elicit something, it ends up being _at least_ as generative as start/stop/continue, with any luck as good as mad/sad/glad.",
          "score": 1,
          "created_utc": "2026-01-22 23:05:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o189mxl",
          "author": "ringmaster",
          "text": "We’ve “invented” over many years of refinement these categories:\n\n**Kvetches** - Get the complaints out of the way that we know there’s nothing we can do to fix it. Acknowledge them and move on, otherwise the things you have no power to change will consume the whole retro. If they are solvable, they move to Flaws….  \n**Appreciations** - Something or someone you appreciated. Always done last so that you can end on a high note.  \n**Flaws** - Things that went wrong we should try to improve. This is the bulk of the retro, talking through them trying to come up with solutions to try.  \n**Experiments** - Suggestions for changing the way we do things to gain some edge. Usually take just one and try it until next retro to see if it has the expected positive effect.  \n\nWe’re pretty diligent about engaging people’s minds before the retro - “think about what happened over the last couple of weeks” - and creating explicit follow-ups that we re-incorporate into our planning. For example, output from experiments go directly into our bi-weekly planning notes so we never have the “oh, we meant to do that but never did” experience.\n\nAs many are pointing out, the categories are only partially useful as part of a complete retro process.",
          "score": 1,
          "created_utc": "2026-01-23 12:49:12",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}