{
  "metadata": {
    "last_updated": "2026-01-28 02:39:58",
    "time_filter": "week",
    "subreddit": "agile",
    "total_items": 13,
    "total_comments": 159,
    "file_size_bytes": 213259
  },
  "items": [
    {
      "id": "1qnz9ty",
      "title": "Sprint planning feels like theatre",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1qnz9ty/sprint_planning_feels_like_theatre/",
      "author": "easy-agile",
      "created_utc": "2026-01-27 01:09:01",
      "score": 57,
      "num_comments": 72,
      "upvote_ratio": 0.95,
      "text": "We spend 2 hours planning. Story points agreed. Dependencies mapped.\n\nThree days in, a \"quick question from sales\" becomes a 3-day spike. By Friday, half our planned work rolls over and we've pulled in random stuff that wasn't even in the backlog.\n\nNext sprint? Same 2-hour ceremony like it actually matters.\n\nAt what point is this just planning theatre? Or do some teams actually make the plan stick?\n\n*(Work at a Jira app company, see this constantly - but feels more like a process issue than a tool issue)*",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1qnz9ty/sprint_planning_feels_like_theatre/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o1xvciv",
          "author": "Brickdaddy74",
          "text": "Sounds like you have a bad PO that doesn’t protect the team.\n\nAlso, if your sprint planning takes longer than 30 minutes your team has other problems. I generally have 15-20 minute sprint plannings for a team of 5-6 devs. Seems there are problems in defining your tickets, features, or the discussions that happen at refinement",
          "score": 27,
          "created_utc": "2026-01-27 02:09:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1ye05p",
              "author": "mhyquel",
              "text": "I just got out of a course where the instructor told us that sprint planning can be up to 8 hours for a 4 week sprint. \n\nThat's 4 hours for a 2 week sprint. \n\nIt boggled my mind.  We have a refined backlog of tickets prioritized and story pointed.  We know our velocity, and how many days away this sprint.\n\nSo we take the top 35 story points from the backlog, put them in a new Sprint and go. \n\nIt's like 15 minutes.",
              "score": 11,
              "created_utc": "2026-01-27 03:54:52",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1yg54e",
                  "author": "Brickdaddy74",
                  "text": "Yeah that instructor is probably one of those people who he himself went through a course and became an instructor with no real world experience or never worked on a functional team.\n\nIf sprint planning takes that long for any team, here are a few guesses of mine:\n-you are estimating at sprint planning instead of refinement\n-your PO sucks at getting worked described properly and the tickets are confusing\n-you didnt actually have the designs, or something close to final designs at refinement\n-you don’t have your teams aligned around products but by skills, and this will kill your whole org\n-your devs are potheads who can’t remember what video game they played last night much less what you talked about at refinement\n\nThere may be other sources of the distinction too 😂. Hit me with an upvote if your devs are potheads",
                  "score": 8,
                  "created_utc": "2026-01-27 04:08:01",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1zelrz",
                  "author": "Kaivosukeltaja",
                  "text": ">So we take the top 35 story points from the backlog, put them in a new Sprint and go. \n\nThis approach works great if your goal as a team is just to crunch out stories as much as possible. But what happens if you get customer feedback that completely opposes your plan, such as a crucial functionality that is missing from what you just delivered?\n\nThe idea with sprints is to introduce checkpoints where we get feedback and react to it by changing our plans accordingly. If you're not getting actual customer feedback or using it as evidence to update your plans, you're kind of missing the point of it.",
                  "score": 5,
                  "created_utc": "2026-01-27 08:34:35",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1yyeis",
                  "author": "kneeonball",
                  "text": "Up to is the key word there, and it depends on the complexity of the product and work involved, figuring out how to split it up, etc.\n\nIt’s mainly there to signal if you’re going over this, you’re doing something majorly wrong. \n\nFor many teams, they’ll never take this long. But to 4 hours to plan somewhere between 240 and 800ish hours of time spent for the team (80 hours x 3 - 10 team members) isn’t even that unreasonable when you think about it. \n\nIt won’t come out to exactly that but using rough numbers to illustrate the point. If you have a complex environment it could be reasonable. Depends on how much you want to plan out up front in the sprint vs plan as you go along.",
                  "score": 4,
                  "created_utc": "2026-01-27 06:14:55",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o235tn8",
                  "author": "Z-Z-Z-Z-2",
                  "text": "Looks like someone doesn’t understand what time boxing is and that Scrum doesn’t prescribe what you do for a 2-week sprint over a month-long sprint. It is just said for shorter sprints the events are usually shorter. Seems like sensible guidance to me.",
                  "score": 1,
                  "created_utc": "2026-01-27 20:50:32",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o1yrozg",
              "author": "evergreen-spacecat",
              "text": "The bad part of the PO is not even protecting the team but rather they should be aware of input from important stakeholders ahead of time. If customer requirements are this volatile, which they can be if sales is trying to land a very big client, then PO should be aware and on daily calls with the sales team to plan ahead.",
              "score": 6,
              "created_utc": "2026-01-27 05:24:21",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o1zbcuy",
              "author": "Pretty-Substance",
              "text": "It depends if the PO is actually invested with the power to say no. In most companies I’ve worked at this wasn’t the case",
              "score": 3,
              "created_utc": "2026-01-27 08:04:36",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o20exea",
                  "author": "Brickdaddy74",
                  "text": "I take a different approach…if it’s the right thing to do then I do it. I trust people will see the motivations and I will explain it to them, trust and respect grows, and empowerment is a mutual agreement.\n\nIf you let people walk all over you they will never trust or respect you.",
                  "score": 1,
                  "created_utc": "2026-01-27 13:22:51",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o247rpm",
                  "author": "Interesting-Ad5589",
                  "text": "Absolutely right. It's all about the sales staff having too much power",
                  "score": 1,
                  "created_utc": "2026-01-27 23:49:34",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o213s2q",
              "author": "Pandas1104",
              "text": "Sounds like they are doing refinement and sprint planning at the same time. \n\nWould agree with a bad PO, whatever outside teams want should have a process for getting to the team and not interfere with the current planning",
              "score": 2,
              "created_utc": "2026-01-27 15:27:17",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1xnjfa",
          "author": "HRH_QueenAnneChonk",
          "text": "What’s the retro like?  That’s the most critical component imho.\n\nIf I were on the team, I’d say - this unplanned ‘churn’ from Steve is a seems to be a new pattern, so let’s plan for it - and clearly document which other stories in the backlog would be pulled in if Steve leaves us alone for a cycle.",
          "score": 28,
          "created_utc": "2026-01-27 01:27:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1xp8h8",
              "author": "easy-agile",
              "text": "Yes! Retro is where you either solve this or just commiserate about it again.\n\n'Planning for Steve' and tracking what you sacrifice is exactly right. Best teams I've seen actually budget for disruption capacity upfront - like forecasting for hurricanes. Feels pessimistic, but way more honest than pretending 40 points means 40 points.",
              "score": 9,
              "created_utc": "2026-01-27 01:36:38",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1xolm3",
          "author": "Fast_Language_2059",
          "text": "Most development methodologies are theater. Everyone just shoves their existing patterns and workflows into whatever, including agile. And it never works since the methodologies require buy in from everyone, not just at the developer IC level.\n\n\nThe places where agile works well tend to do well with any method of organizing and prioritizing work, because they already have their functional patterns and workflows.",
          "score": 17,
          "created_utc": "2026-01-27 01:33:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2481ml",
              "author": "Interesting-Ad5589",
              "text": "Absolutely. If sales and marketing are not held to account then this pattern will just go on",
              "score": 1,
              "created_utc": "2026-01-27 23:50:58",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1xlho1",
          "author": "Timely-Ad-3439",
          "text": "Switch to Kanban?",
          "score": 7,
          "created_utc": "2026-01-27 01:16:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1xmls1",
              "author": "easy-agile",
              "text": "Kanban works great if your work is genuinely unpredictable flow. But if the real problem is Steve from Sales creating 3-day spikes with his \"quick questions,\" that guy has a Kanban board login too.\n\nSprint boundaries at least let you gesture sadly at your commitments before getting overruled. With Kanban, you're just constantly explaining why your WIP limits matter to people who think WIP stands for \"Work In Progress, But Actually Do Mine First.\"",
              "score": 2,
              "created_utc": "2026-01-27 01:22:12",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1xqp6q",
                  "author": "mriforgot",
                  "text": "Sounds like your team has a problem with pulling in stories at a moment's notice, which does tend to fit a Kanban model. Or you all need the ability to tell Steve from Sales that you will look at it later.",
                  "score": 10,
                  "created_utc": "2026-01-27 01:44:37",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1xuz49",
                  "author": "anotherleftistbot",
                  "text": "That's a management/team lead problem. \n\nWhoever is responsible for protecting your team productivity is failing. That can happen in any \"methodology.\"",
                  "score": 5,
                  "created_utc": "2026-01-27 02:07:57",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1y4r65",
                  "author": "FreshLiterature",
                  "text": "Overruled by who?\n\nSales shouldn't have the authority to overrule you.\n\nI commented elsewhere, but I'll repeat it here - you need to show and tell cost of delay for your team. It sounds like there is a pretty clear perception that delaying the work your team is doing is \"free\". You need to disabuse them of that perception.",
                  "score": 4,
                  "created_utc": "2026-01-27 03:01:25",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1ze8j9",
                  "author": "Trustadz",
                  "text": "Honestly, this sounds like the issue is outside of the team. The PO and you should manage Steve that his quick questions don't warrent the utmost attention from the team. The questions should pass the PO (whom should know the answers most likely) and if they are new features the PO is the one responsible for adding them to the backlog.",
                  "score": 3,
                  "created_utc": "2026-01-27 08:31:06",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1xy682",
          "author": "the_ballmer_peak",
          "text": "\"Quick question from sales\" can become a three day spike in your next sprint unless product decides it's so important that something from the current sprint can be removed.",
          "score": 3,
          "created_utc": "2026-01-27 02:25:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o216usr",
              "author": "Pandas1104",
              "text": "This trade off is key",
              "score": 1,
              "created_utc": "2026-01-27 15:41:15",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1xtev2",
          "author": "No_Thought_4145",
          "text": "Lotsa ways to be agile; you should talk with your team to figure out how they want to work.\n\nMAYBE the team needs to allow for regular shifts in direction mid-sprint for good reasons. If that's the case, then accept that the sprint is not locked-in once started, and be sure that the team and stakeholders understand how abrupt change messes with productivity.\n\nMy recent experience has had me processing a lot of my own negativite feelings because my teammates have not be following MY expectations for the team's process eg. bringing in surprise tickets mid-sprint, being pulled away from planned tickets to support another team, etc. I'm now realizing that the team has never truly bought-in-to such strict ticket/scope management, nor does team leadership expect that. So if I am unhappy, it's because my expecations don't match reality.\n\nI have been on teams (at a different company) where sprint scope WAS treated as sacred, with technical leadership being on the same page and supporting the plan. To make that work you do need the general culture who is willing to \"play within the rules\" - which is easier said than done.",
          "score": 3,
          "created_utc": "2026-01-27 01:59:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1xvcl1",
              "author": "easy-agile",
              "text": "This is painfully accurate. Misaligned expectations between \"how I want to work\" and \"what the org actually supports\" is the silent killer of most agile implementations.\n\nYou can't enforce sacred sprint scope without cultural buy-in up the chain. Otherwise you're just documenting your disappointment in 2-week increments.\n\nThe self-awareness to say \"my expectations don't match reality\" is huge. Now you get to choose: make peace with chaos or find a less chaotic home. Both beat fighting a battle nobody else signed up for.",
              "score": 3,
              "created_utc": "2026-01-27 02:09:58",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1xw573",
                  "author": "No_Thought_4145",
                  "text": "Validation ❤️\n\n> documenting your disappointment in 2-week increments\n\n🤣🤣🤣",
                  "score": 1,
                  "created_utc": "2026-01-27 02:14:17",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1ze8if",
                  "author": "LightPhotographer",
                  "text": "But is it bad? \n\nWhat about the work you are doing? \n\nAre you perhaps working at a large project, chopped up into two week intervals, and not delivering value every two weeks?  If you're not delivering actual value into the hands of someone who cares... then yes, you are going through the motions. \n\nImagine you're in a restaurant. Steve's 'quick question' would mean that this lady has to wait 30 minutes longer. That's a real cost. So Steve gets a polite 'no'. \n\nDo you have that? Or are you delivering a large project to which Steves' question makes no difference?",
                  "score": 1,
                  "created_utc": "2026-01-27 08:31:06",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o215bar",
          "author": "Few_Cauliflower2069",
          "text": "It's your fault for not sticking to the plan. Just tell them off or tell them they have to wait for next sprint. If management doesn't like that, they will have to make you stop doing sprints altogether",
          "score": 2,
          "created_utc": "2026-01-27 15:34:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1xllov",
          "author": "watdawg44",
          "text": "It’s always been theater. The whole thing",
          "score": 3,
          "created_utc": "2026-01-27 01:16:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1xto0i",
          "author": "ExtraordinaryKaylee",
          "text": "Edit: I had a good thing about my solution using stretch goals to account for this.   But OP is not actually asking a question, just fishing.",
          "score": 1,
          "created_utc": "2026-01-27 02:00:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1xu3ik",
          "author": "mrhinsh",
          "text": "That’s the system telling you something, and it’s being ignored.\n\nIf interruptions regularly consume multiple days, planning to full capacity is a false assumption. Sprint Planning is optimising for a reality that does not exist, so the plan predictably collapses. Until planning reflects the actual operating conditions, the ceremony will continue to look serious while producing no signal worth trusting.\n\nThe Sprint Goal already covers this. It is the only commitment in the Sprint. Make the Sprint Goal smaller, then create a concrete implementation plan for the first 24 hours only, and adapt it each day.\n\nThat rolling 24-hour plan can change at any time as new information arrives. The Sprint Goal remains achievable because it represents a small, intentional subset of the Sprint. You deliberately leave slack in capacity for the known unknowns. If you get most of the way through the Sprint, you can always pull more work from the Product Backlog.\n\nThis is how Scrum is intentionally designed to adapt; we learn more by doing.",
          "score": 1,
          "created_utc": "2026-01-27 02:03:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1xvqc3",
              "author": "easy-agile",
              "text": "This is 100% correct and also describes a level of discipline that approximately 3% of teams actually maintain past week 2.\n\n\"Rolling 24-hour planning that adapts daily\" is theoretically perfect and practically... well, it requires everyone to show up to daily standup actually caring about replanning, which is a heroic assumption in most orgs.\n\nThe Sprint Goal approach is smart though. Committing to less and leaving slack is way healthier than the \"plan 40 points, deliver 22, repeat forever\" cycle. The hard part is convincing stakeholders that \"we're planning for less on purpose\" isn't the team being lazy, it's the team being honest about Steve from Sales.\n\nYou're describing Scrum as designed. Most of us are living Scrum as implemented, which is... different.",
              "score": 2,
              "created_utc": "2026-01-27 02:12:02",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1xywkv",
                  "author": "mrhinsh",
                  "text": "The signals are there.\n\nYou appear to understand the problem, yet you frame inaction as “realism” and continue to accept the consequences of not acting.",
                  "score": 2,
                  "created_utc": "2026-01-27 02:29:29",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1xwxq6",
          "author": "YAMMYYELLOW",
          "text": "What the fuck are any of your Product people doing to help your developers?\n\nProtect your team, people",
          "score": 1,
          "created_utc": "2026-01-27 02:18:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1xxk94",
              "author": "easy-agile",
              "text": "The real question.\n\nProduct is supposed to be the bouncer at the club, not the guy holding the door open while Steve from Sales and his seven friends push their way to the front of the line yelling 'we're on the list!'",
              "score": 2,
              "created_utc": "2026-01-27 02:22:01",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1xyjbp",
          "author": "trophycloset33",
          "text": "How are you differentiating planned from unplanned work in your tracking tool? How about committed vs uncommitted objectives?",
          "score": 1,
          "created_utc": "2026-01-27 02:27:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1y4xeu",
              "author": "easy-agile",
              "text": "In theory: we have a 'unplanned work' tag and track it.\n\nIn reality: Steve's thing shows up as a comment on a random ticket, becomes a Slack thread, someone creates a subtask, it balloons into three stories across two epics, and by the time anyone thinks to tag it properly, the sprint's over and we're in retro going 'where did the time go?'\n\nGreat suggestion. Feel like making the unplanned work visible is half the battle. The other half is getting people to actually use the tags before everything's on fire.",
              "score": 2,
              "created_utc": "2026-01-27 03:02:23",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1y5tnn",
                  "author": "trophycloset33",
                  "text": "I’d start by bringing up that people are t following the team procedures in the next retro. See what yall can do to get back to the documented procedures.\n\nIt’s hard to judge procedures when they are never followed. Try and next retro, reassess how they went.\n\nYou shouldn’t be adding anything do or changing much of anything at this point.",
                  "score": 1,
                  "created_utc": "2026-01-27 03:07:20",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1y2jvh",
          "author": "young_horhey",
          "text": "Who is allowing the ‘quick question’ from sales to be higher priority than the existing sprint work? No one is pushing back once you realise this ‘quick question’ is taking multiple days?",
          "score": 1,
          "created_utc": "2026-01-27 02:49:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1y4j29",
              "author": "easy-agile",
              "text": "Everyone and no one. It's a beautiful organisational tragedy.\n\nSales says it's urgent. Product doesn't want to be the bad guy. Leadership says \"be flexible.\" The team pushes back and gets told they're \"not being collaborative.\" \n\nBy day 3, everyone's neck-deep in Steve's \"quick question\" and pointing fingers at each other about how we got here. Tale as old as time.",
              "score": 1,
              "created_utc": "2026-01-27 03:00:11",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1yyts5",
                  "author": "rayfrankenstein",
                  "text": "Does management take accountability for sprint carryover due to Steve’s quick question? Or are you still held to that deadline with consequences for spring carryover?",
                  "score": 1,
                  "created_utc": "2026-01-27 06:18:19",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1y48cm",
          "author": "FreshLiterature",
          "text": "When I say that organizations have to be on board with Scrum in order for it work this is what I mean.\n\nFirst, you shouldn't be bumping planned work for a spike.\n\nSpikes are research for future planned work when you aren't sure how to proceed.\n\nSecond, there should be some venue you can go to to make it clear you keep having to bump planned work because you aren't empower to tell sales no.\n\nEvery single time sales interrupts your team work there is a cost - ie, Cost of Delay.\n\nYou can pick something and calculate the cost of delaying that item and you SHOULD do that when you're assessing whether or not bumping a planned work item makes sense.\n\nBarring that, you should pick a high priority item from the past that was delayed for many sprints and do a retroactive cost of delay on that.\n\nTake that, run a theoretical cost of delay on your next sprint, bring it to leadership.\n\nIf there is regular work that requires your team to spend time every sprint then you need to prioritize building tools to offload whatever that work is.",
          "score": 1,
          "created_utc": "2026-01-27 02:58:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1y9kal",
          "author": "UnreasonableEconomy",
          "text": "> At what point is this just planning theatre\n\nIf your discussions fixate on cost but ignore value it's probably roleplay.\n\n> By Friday, half our planned work rolls over \n\nThat in and of itself isn't that big of an issue, IMO. Sprints can be ambitious.\n\n> random stuff that wasn't even in the backlog.\n\nThat sort of defeats the purpose of a sprint altogether though.\n\n---\n\nIf you want to get fired, ask your PO/SM:\n\n\"What is the purpose of a sprint? Why do we do sprints?\"",
          "score": 1,
          "created_utc": "2026-01-27 03:28:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1yed9g",
          "author": "dastardly740",
          "text": "So, you are counting uncompleted stories in your velocity? Or, counting the unplanned stories in your velocity? One thing to try is counting partial stories as 0 points. Because from your description your velocity is not 40 points or whatever you are planning, it is far less.\n\nIn addition, I have found a lot of these problems management worries about, like getting done what you say you will each iteration, are mitigated by smaller stories. First, larger stories are more likely to not finish. A larger story started later in the iteration is less likely to finish. When unplanned work comes in to screw up your planning you are more likely to be able to move out whole stories, thus reducing WIP.\n\nOne other thing to consider. Make sure all the issues are painfully visible. Generally, various Agile processes make it harder to hide problems, but management loves their illusions of control that tend to hide what is really going on and therefore giving them little real control. So, make sure that while sucking it up and dealing with all these issues that they are painfully visible to everyone.",
          "score": 1,
          "created_utc": "2026-01-27 03:57:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1yefrp",
          "author": "oneThing617",
          "text": "So many issues here. A few ideas come to mind. First thing first is to identify the root cause of the problems:\n\n-Why is spring planning taking so long?\n-Why isn’t there a good notion of the sprint plan in place before starting?\n-Why is the churn rate so high?\n-Why is the team or PO consistently allowing sprint goal/scope changes? Are these truly necessary immediate needs that can’t be brought in the next sprint?\n\nSorry to say, but these issues existing and not being addressed seems to be mostly a leadership and coaching deficiency of the Scrum Master or whatever agile lead role.\n\nAfter identifying root causes, I would ask the team for suggestions for changes to the ways of working. If there’s hesitancy, offer suggestions to consider yourself. You can always frame changes as an “experiment” to test for a few sprints. Some options that come to mind without knowing the true causes:\n\n-Try setting strict boundaries on sprint changes/churn, not allowing any changes except for emergency P1 level responses.\n\n-If the team truly needs to be available for drop-in issues, try reducing commitment and allocating a % of capacity for drop-in work.\n\n-Try Retroing your retro - bring to the team how the purpose of the retro is continuous improvement, and that the way it’s going isn’t fulfilling that goal. Ask for suggestions for changes (notice how I often go to asking the team, even if you steer them toward the best practices you already know, help them come to the idea themselves for quicker buy-in)\n\n-Consider using metrics for more objective insights. Measure average velocity, completion against commitment rates, churn rates, sprint volatility, etc. Having data to point to objectively helps frame the conversation, especially with analytical problem solvers like software engineers. It also shows it’s not your thoughts or opinions, but is empirical. Identify one or two deficiencies and devise tactical plans to focus on improvements.\n\nLastly, if agile ways of working are not encouraged by leadership, particularly in the business/product domain, coaching is needed. Assuming you have some type of Agile Delivery Manager or Agile PMO or something you report into, share the challenges you face with the community of practice and agile leaders so they’re aware of the misalignments. If there’s no space for coaching, feedback, improvements, or even working through these challenges with those not aligned and causing the problems, then thats a toxic environment and you should probably look for a new job.",
          "score": 1,
          "created_utc": "2026-01-27 03:57:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1yqbya",
          "author": "evergreen-spacecat",
          "text": "What about your PO takes a meeting with Steve a week before sprint planning. Any relevant work from Steve can be prioritized and broken down way ahead of sprint planning. This crap suggests the PO is not very close to stake holders.",
          "score": 1,
          "created_utc": "2026-01-27 05:14:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1yv7kb",
          "author": "Bowmolo",
          "text": "Seems like there is more demand variability than your process - primarily its cadence - can handle.\n\nTwo options:\n- If this variability is beneficial, hence justified, change your approach to managing it.\n- Else: educate people that their behavior leads to instability, lack of learning, and ultimately to less delivery and predictability.",
          "score": 1,
          "created_utc": "2026-01-27 05:50:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1z3z7c",
          "author": "Illustrious_Sea_17",
          "text": "Where is your product owner when Steve from Sales has a quick question that takes the whole team off plan?  And how was the retro after that sprint - did everyone think it was a disaster or was it just sort of a shrug and move on?\n\nIf your spidey sense is telling you that disruptions like this could become a regular occurrence, give everyone on the team a blank 3 point card in the next sprint so you can accept the next late ask, but also use the planning theater to force a prioritization discussion with your product owner.  If you use all those blank cards in the sprint, there’s a bad pattern developing that needs to be escalated.",
          "score": 1,
          "created_utc": "2026-01-27 07:00:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1z53t2",
          "author": "James-the-greatest",
          "text": "Tell the sales team to fuck off.\n\nThis is an education issue. The product owner and scrum master need to do their jobs. Educate the rest of the business.\n\nOr you just do Kanban and not worry about sprints",
          "score": 1,
          "created_utc": "2026-01-27 07:09:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1z8bgo",
          "author": "Kempeth",
          "text": "* Why are you accepting massive work items when you have tiny 1 week iterations? Why can't they be kicked down the road for 2 more days and picked up then?\n* Why are you planning your sprints like you won't be doing that when you know you will?\n\nThere are lots of things that can be said about what you should or should not be doing but none of that matters while you're all in denial about the process you actually have.\n\nOnly then can you strategize for change. Make the consequences of this behavior visible and attach a cost that is relevant to those with the power to change it.",
          "score": 1,
          "created_utc": "2026-01-27 07:37:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1zbhb6",
          "author": "Pretty-Substance",
          "text": "The first question I would ask is: why do we plan? What’s the actual purpose of planning? \n\nOr was it just sth that the teams were told to do for what reason?",
          "score": 1,
          "created_utc": "2026-01-27 08:05:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o20jsez",
          "author": "Budget_Pin5828",
          "text": "How do teams make the plan stick?\n\n\n1. Discipline \n2. A good PO\n3. A good SM\n4. Data driven decision making\n\n\nThere's a lot to unpack with your post. As there are tons of reason why the sprint changes. Some valid, some poor execution and decision-making. Its hard to diagnose your particular issue. \nRecurring pattern is a signal that something is amiss. But I cant tell based on the info provided.\n\n\nLet me ask this... what has been the impact to the team, the product, and the business when the sprint goes sideways? Is the sprint goal still achieved?",
          "score": 1,
          "created_utc": "2026-01-27 13:48:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o20krfj",
          "author": "Morrowless",
          "text": "Say no to anything not planned for the sprint. Put it in the backlog to be prioritized.\n\n  \nMuch of it does feel like theater. If that's what the company want to pay me for then I'm ok with it.",
          "score": 1,
          "created_utc": "2026-01-27 13:53:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o20n8oo",
          "author": "TMan-X",
          "text": "Your PO (and team) need to learn the word “No”. Or better “No, not now”. Also consider doing shorter sprints.",
          "score": 1,
          "created_utc": "2026-01-27 14:06:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o20xvgp",
          "author": "wringtonpete",
          "text": "Yeah that's messed up.\n\nSprint Planning should take no more than 30 minutes, though the scrum master needs to ensure everything is prepped beforehand. Specifically, make sure with the help of the PO that you have enough high priority stories refined, sized and ready to start. You can even do a quick run through with the PO a day or two before to make sure you're ready.\n\nWrt interference from outside, like Sales, what I found useful was to tell them you're mid sprint but are happy to discuss the details and fit it into the next sprint, but that's ultimately your PO's call. Crucially, tell them that if you are forced to put it into the sprint then the sprint will be cancelled to replan a new one, and, as per standing instructions, you will have to let senior management know.",
          "score": 1,
          "created_utc": "2026-01-27 14:59:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o21yfu0",
          "author": "Interesting-Invstr45",
          "text": "TLDR not all responses read.\n\nAre you able to track if and how Steve’s comment added to quality or $ value as part of DoD?\n\nIs your organization startup mode or mature? Is there a sale/quota pressure across the various silos?\n\nDo you have scrum of scrums or a one on one with Steve about why this behavior? Is Steve a one man sales org or is there actual sales organization with other than Steve in there?\n\nDo you want to solve this or this is interview prep for next role? If you want to solve this what’s your next top 3 steps from this posts comments / discussions?\n\nGood luck 🍀 to us all",
          "score": 1,
          "created_utc": "2026-01-27 17:41:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o22fgxw",
          "author": "liquidpele",
          "text": "It's almost like trying to fit real-world work into 2 week buckets that are micromanaged by non-technical people just isn't a good system!",
          "score": 1,
          "created_utc": "2026-01-27 18:53:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2476j7",
          "author": "Interesting-Ad5589",
          "text": "It's the usual thing , sales team say something..everyone jumps and the plans just turn to crap.\n\nHave seen it over and over in waterfall , agile and no planning companies and projects. If everyone just believes it's blindly about sales and instant revenue you are stuck. The sales people get the praise and the poor staff trying to deliver something get the brickbats.. Forgive my bitterness. It's nothing to do with agile and all about blindly giving the sales staff too much power.",
          "score": 1,
          "created_utc": "2026-01-27 23:46:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1yb6ma",
          "author": "agileliecom",
          "text": "**25 years building software, Head of IT Architecture at a bank. What you're describing has a name: it's called Risk Management Theater.**\n\nThe 2-hour planning ceremony isn't about planning. It's about creating the *appearance* of predictability for stakeholders who are uncomfortable with the inherent uncertainty of software development.\n\nHere's the uncomfortable truth: **the plan was never supposed to survive contact with reality.** Everyone in that room knows it. But the ritual continues because:\n\n1. **It gives management something to point at.** When the VP asks \"what's the team working on?\", there's a Jira board with story points. Doesn't matter if it's fiction by Wednesday.\n2. **It distributes blame.** When things slip, it's because of \"unplanned work\" or \"scope creep\" - not because estimates are fundamentally unreliable for complex knowledge work.\n3. **It feels productive.** Two hours of structured discussion with sticky notes and story points *feels* like work. Meanwhile, the actual work gets interrupted by \"quick questions from sales.\"\n\nThe pattern you're seeing - plan → interrupt → rollover → repeat - isn't a bug. It's the system working exactly as designed. The ceremony exists to manage organizational anxiety, not to optimize delivery.\n\n**Teams that \"make the plan stick\" usually do one of three things:**\n\n1. They have enough slack built in that interruptions don't derail them (rare, because slack looks like \"inefficiency\" to people who measure utilization)\n2. They have a PM/manager who actively shields them from \"quick questions\" (also rare, because that person gets labeled as \"not collaborative\")\n3. They pad estimates so aggressively that they always \"finish early\" (common, but nobody admits it)\n\n**What actually works:** Stop pretending you can predict 2 weeks out. Use a pull-based system. Work on the highest priority thing until it's done. When priorities change, acknowledge it explicitly instead of pretending it's an exception.\n\nBut that requires leadership to admit they don't have control. And the whole point of the theater is to avoid that admission.\n\nYou work at a Jira company - you've probably seen the dashboards people build. Burndown charts, velocity trends, cycle time reports. Ask yourself: how often does any of that data actually change a decision? Or does it just make everyone feel like there's a process?",
          "score": 0,
          "created_utc": "2026-01-27 03:38:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1yfcba",
              "author": "morksinaanab",
              "text": "Hello AI",
              "score": 2,
              "created_utc": "2026-01-27 04:03:03",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o22s2bh",
              "author": "Vegetable-Ad-7184",
              "text": "Preach !",
              "score": 1,
              "created_utc": "2026-01-27 19:48:28",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qo5h8r",
      "title": "Im So miserable as an agile coach, dont know what to do😵‍💫",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1qo5h8r/im_so_miserable_as_an_agile_coach_dont_know_what/",
      "author": "Specific_Crab3601",
      "created_utc": "2026-01-27 05:50:52",
      "score": 40,
      "num_comments": 39,
      "upvote_ratio": 0.92,
      "text": "Honestly being AC was my dream job: i looove systemic thinking, I love systems design, coaching (willingful) people, diagnose problems, finding root causes, improve, remove blockers, facilitate etc. I was just amazing...on paper.\n\nIn reality, for 5 years Im doing politics, finding ways to tell stuff in a polite way to people who I find dumb🙈teaching super basics to people who think their dictatorship is better than psychological safety. \"Selling\" my stuff to people who were forced to have an AC by people who dont understand what an AC does. Being expected to fix disfunction with a magic wand and then watching disappointment when i say I need commitment and sponsorship for a change.\n\nEven more! im my new company i discovered that the \"success\" is measured by outputs, numbers of workshops, my agile Boss doesnt understand metrics, people dont understand Product, human-centricity, evidence based management. They just produce confluences with rules and processes. My Boss is reluctant for me to talk to anyone above certain level and I have to fight her to even exercise my ideas.\n\nI feel incompetent when I am unable to change an unchangeable things. I feel a good coach can fix anything. I know it is not true and its in my head but i still feel it.\n\nAnd in the same time idk what else to do. Consulting? PMing? Management? it is all less ideal than AC on paper. But maybe it is better IRL? does anyone have any advice, Im honestly so tired...",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1qo5h8r/im_so_miserable_as_an_agile_coach_dont_know_what/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o1yvqgf",
          "author": "AhamBrahmassmmi",
          "text": "You are not alone.. M in the same boat.. Highly frustrated now.",
          "score": 20,
          "created_utc": "2026-01-27 05:54:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1yz8hv",
          "author": "NobodysFavorite",
          "text": "Disappointment or delight comes from the gap between expectation and reality.\n\nThis is the real life of agile coaching. Unpicking messy toxic environments where your presence is simultaneously inspiring and threatening, desired and reviled. You have to navigate that mess mastering the microinteractions.\nTrailblazers get burned but the first followers achieve enormous change and get praised for it. (Hint: it wasn't possible without the trailblazers going first).\n\nOne piece of advice I got was when your client insists asking you for the wrong thing, you give it to them in such a way that they realise what the right thing was all along. \nWhen they have that epiphany that you were leading them to, be magnanimous and you'll find them easier to work with afterward. \n\nAnd don't try to change too much too quickly. Overreach will get you ejected. The evolutionary change model is really good here and I highly recommend it.",
          "score": 27,
          "created_utc": "2026-01-27 06:21:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1z0v0g",
              "author": "fixingmedaybyday",
              "text": "This is one of the most honest takes I’ve read from an agile insider.",
              "score": 3,
              "created_utc": "2026-01-27 06:34:41",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o1z2grw",
              "author": "Specific_Crab3601",
              "text": "This is true but also very sad, it sounds toxic af as a job",
              "score": 2,
              "created_utc": "2026-01-27 06:47:47",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1z4csx",
                  "author": "NobodysFavorite",
                  "text": "When you get a real buzz moment, it's like a drug giving you a work high that completely outweighs any of the toxic stuff. It'll draw you back again and again.",
                  "score": 3,
                  "created_utc": "2026-01-27 07:03:21",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1zl682",
                  "author": "Maverick2k2",
                  "text": "Extremely well paid role too. Which is why people do it.",
                  "score": 1,
                  "created_utc": "2026-01-27 09:36:03",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1z5can",
          "author": "ScrumViking",
          "text": "What the ask when they hired you? How did they describe your assignment? Do they really want help or just “more efficiency”. \n\nI’ll never ‘inflict’ help on those who never asked for it, even if you really think they need it. It’s a path of disillusion and misery that rarely leads to any satisfying result. It does end up with annoyed clients and burned out coaches.\n\nI’ve been a consultant for nearly a decade now and I’ve found that the intake before even doing the job is most critical for defining success. It pays to understand and set expectations and define what success looks like. It provides a framework for measuring success as well. This is key because with what we do it’s hard to correlate actions and improvements to results.",
          "score": 7,
          "created_utc": "2026-01-27 07:11:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o215f9y",
              "author": "notantisocial",
              "text": "The intake for that job being the most important criteria of success, could not have said that better. Definitely need to work on that myself. Sometimes we feel like we don’t have a lot of options or leads.",
              "score": 3,
              "created_utc": "2026-01-27 15:34:51",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o205wjy",
          "author": "DingBat99999",
          "text": "Long time agile coach here, recently retired.\n\nIf I had to point to one thing where I think agile failed, it's in grossly underestimating the North American/western managerial need for a sense of control. Many managers are find an ideal agile environment chaotic and are very willing to forego any potential improvements to retain that sense of control. Command and control is a helluva drug.\n\nI mean, Beck et al were idealists. And they could largely control their own environment. What we needed to do was remember that Deming had to go to Japan to get his ideas heard.",
          "score": 8,
          "created_utc": "2026-01-27 12:27:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1yyakj",
          "author": "Kaivosukeltaja",
          "text": "Sounds awfully familiar. That's basically what got me to say \"screw this\" after 8 years of being a full time SM/AC and go back to writing code. \n\nIn my view, the problem boils down to too many layers of middle management. They want to have goals that are easy to achieve reliably, such as story points delivered. They don't care about actual business outcomes because they're unpredictable - and it's not their money on the line.",
          "score": 6,
          "created_utc": "2026-01-27 06:14:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1zlefk",
              "author": "Maverick2k2",
              "text": "Experienced that.\n\nThe agile community is partially to blame too.\n\nTo influence you need to first be likeable. If the org hasn’t asked you for changes and you forcefully push for it, you will without a doubt become frustrated and disliked. It also means doing what you are told.\n\nWhenever anyone posts a situation where they are frustrated , the agile community blames them and worse still, tells them they are shit if they can’t influence or following orders.",
              "score": 4,
              "created_utc": "2026-01-27 09:38:10",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o200eun",
          "author": "zero-qro",
          "text": "What I'm about to tell you may break your spirit, but that's the truth for most cases.\n\nNow some may come and say that their experience is different, but I'm not talking about anecdotes, which are valid and I respect that. I'm talking about market and industry trends and behaviors.\n\nAgile Coach, as a role, is a dead end.\n\nIt is a delusion that in the best-case scenario is just a fever dream for a perfect world where people have common sense and environments are completely devoid of politics and personal agendas. In the worst-case scenario, it's just a money-grab scheme.\n\nAnd I'm no bitter developer/manager who was hurt by a bad scrum master. I speak from experience. I was once a believer. I lived through the Agile hype for more than 20 years. I started in 2008, through XP, then Scrum, then all the Scaling mania. I worked in startups, mid-size companies, and big corps, and in most of them Agile Coaching didn't work or would never work.\n\nDon't get me wrong. I still think and work through the Manifesto values and principles, but the so-called 'Agile Coach' role is trying to achieve something that is unreachable through a group of individuals.\n\nLet's start with the Coach stance, which over the years was more and more co-opted by the 'Life Coach' style. Agile Coaches became corporate therapists, without having any qualification for that, and soon the field was invaded with a lot of wishy-washy-hugging-tree practices that simply don't apply to software development delivery. I value individual coaching, but that doesn't work for teams. Instead of becoming more like basketball/soccer/football coaches, i.e., having experience and authority on the field to provide guidance, agile coaches became more like 'Tony Robbins' figures, with very generic and toothless approaches that maybe make you feel good but don't have any influence on real software development.\n\nThings like 'influence without authority' or 'facilitate without intervening or being opinionated' are just BS.\n\nAdd to the mix that Agile was originally intended for software development teams, not entire companies or any other field.\n\nNot that the principles, values, and some techniques can't be applied at different levels and fields, but calling it Agile is a stretch.\n\nWhen context gets bigger, complexity increases exponentially, and expecting that one professional, or a department of said professionals, can change the entire system is insanity.\n\nBig corps are the way they are because they evolved to be that way. There's no training, workshop, or coaching session that will change years of politics and psychological conditioning.\n\nThis is system thinking 101: the system works exactly the way it is designed to work.\n\nI've seen rare changes in those environments during my career, but that happened when you had actual real leadership that was worried about quality, time to market, and customer focus.\n\nYou alone, or your department, will never succeed in this mission because you were not created for this.\n\nUnfortunately, nowadays being an Agile Coach is being set up for failure.\n\nReality hit me hard like this a few years ago. Then I shifted my career back to being a tech lead, or Technical Product Manager, sometimes Delivery Lead.\n\nReassess your skills and check where you would fit in the software development cycle. Maybe go back to coding. Maybe focus on becoming a Product Manager, Program Manager, or Delivery Lead.\n\nTry to go back to something tangible, where you can feel accountable for and apply what you know, other than 'Agile mindset'.\n\nSorry for the sour honesty, but that's the message I would like to have received a decade ago.\n\nBest of luck",
          "score": 4,
          "created_utc": "2026-01-27 11:47:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o20dz2e",
              "author": "his_rotundity_",
              "text": "At this point, if I get an Agile Coach role, I know it has less than an 18-month shelf life. I fully expect to be out of a job within that timeframe (informed by multiple layoffs). So I milk it for what it's worth, deliver value where I can, and constantly remain in the market during that period.",
              "score": 3,
              "created_utc": "2026-01-27 13:17:30",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o20kdc5",
              "author": "Specific_Crab3601",
              "text": "I think you are right",
              "score": 1,
              "created_utc": "2026-01-27 13:51:52",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o20zfj6",
          "author": "Consistent_Voice_732",
          "text": "Loving Agile in theory and hating Agile in practice is more common than we admit. Coaching without sponsorship isn't coaching it's emotional labor with a scrum vocabulary. Still figuring out what to do with that truth",
          "score": 4,
          "created_utc": "2026-01-27 15:07:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o20nsc1",
          "author": "Anxious-Narwhal7901",
          "text": "Most of these companies want to say they're agile but they don't really believe in what agile brings to the table. It requires a mindset shift they're not willing to make.\n\nIt also asks those who crave power to release some of that power, which many of that nature are reluctant to do 🥲\n\nLoved all my agile coaches in the past. I was lucky to be in an environment where they were respected and listened to.\n\nSorry to hear it wasn't the case for you so far.\n\nThere are definitely places out there where you'll be loved and valued though ❤️",
          "score": 3,
          "created_utc": "2026-01-27 14:09:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o23qzqe",
              "author": "Colt2205",
              "text": "There's also cases where someone doesn't mind giving up power but because of the project and skill set gap it isn't possible to do it.  I'm in one of those positions where the external factors influencing the development change rather frequently and the tech stack is completely different from the rest of the team.",
              "score": 1,
              "created_utc": "2026-01-27 22:25:51",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1zdl4l",
          "author": "theholewizard",
          "text": "Very relatable. This is why I stopped doing it. I still believe strongly in the potential of human collaboration and learning organizations, but my actual experience in the world of tech startups is a series of toxic territorial senior engineers and hapless impatient management who don't see how they're enabling the bullshit, stifling everyone's potential, and creating an environment of learned helplessness. It happens with such regularity in these settings that I would be inclined to think it's just me if I didn't have such deeply rewarding collaborative experiences in other areas of my life. \n\nI switched to product management and data analysis. It may not be the most exciting job in the world, but every day that I don't have to coach around some fragile middle aged man's dysregulated emotions is a good day.",
          "score": 2,
          "created_utc": "2026-01-27 08:25:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o20ajmv",
          "author": "attractiveblonde",
          "text": "I was a project manager before my organization changed to scaled agile. Not only do I dislike my role, like you; I absolutely despise SAFe. Talk about a mess on both fronts.",
          "score": 2,
          "created_utc": "2026-01-27 12:57:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o20f76m",
          "author": "Affectionate-Log3638",
          "text": "Not an AC, but I can relate.\n\nI started as an SM on one of the very first release trains in our org, seven years ago. It being terrible from the start hasn't stopped them from rolling out two dozen more trains, that have basically ruined our organization. (Our org is slow as molasses and as inflexible as they come. Morale across the entire org is down. People are publicly criticizing SVP level leaders in town hall meetings now, which is wild stuff.)\n\nI recently joined a train as a PO where myself and the PO I work closely with have far more experience than everyone else. Including the RTE and Portfolio Manager. We're very vocal about what needs to change and offer solutions other teams get excited about.....The RTE labeled us a \"contagion\". I've tried to take my SM under my wing, with us even presenting ideas to the RTE and Portfolio Manager (his boss)....The Portfolio Manager told him to stop spending time with me.\n\nMyself and the PO end up in meetings with these two every month, where they try to get in our way. They want to \"take everything offline\" to avoid us sharing ideas for improvement with others.",
          "score": 2,
          "created_utc": "2026-01-27 13:24:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1z1kra",
          "author": "similkameenjp",
          "text": "I agree with the comment that you can't change everything too quickly. Some issues have to simmer for a bit. Agile coaching taught me patience for the big issues. \n\nAll that said i moved from agile coaching to delivery management. I use the same skills but work with product owners to achieve business outcomes. I am waaay happier now as I can focus on business outcomes instead of changing everything.\nOnce teams deliver more business outcomes it builds momentum for change.",
          "score": 1,
          "created_utc": "2026-01-27 06:40:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1z5r93",
          "author": "Purple_Tie_3775",
          "text": "It’s easy to get suckered by what used to work well as an AC. All there’s left is old legacy companies that want faster delivery without compromising anything. A lot of the old memes need to be let go. There good but they weren’t everything. \n\nWhat you need is to start small and build momentum. It sounds like you’re adrift right now and you need to find ways that bring relief to teams, regardless how small. You need to start things and get them to shoulder before you can have a fire. \n\nLook for ways to measure and eliminate small bits of waste. Things that teams are willing to do. I have been creating a lot of tools to provide  them with data to plan faster and better. Stick with rudiments and things that can prove your effectiveness. \n\nRemember that regardless of whatever is done, collaboration and stakeholder satisfaction is the only real thing that moves the needle besides whatever lame maturity you have. Maturity is a red herring. All that matters is value is delivered and customers are happy. You need to show your teams are either creating increased business or cutting costs (or both). \n\nDon’t get caught up in the romance of making teams more realized or happier. They’re helpful but that’s not what pays the bills.",
          "score": 1,
          "created_utc": "2026-01-27 07:15:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1zkx2v",
          "author": "Maverick2k2",
          "text": "You can always go into project management.",
          "score": 1,
          "created_utc": "2026-01-27 09:33:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2155yh",
          "author": "notantisocial",
          "text": "This is something I struggle with too. I took a break from coaching. It was really tired of politics. Sometimes you can only help someone so much and then there’s no more room to grow.",
          "score": 1,
          "created_utc": "2026-01-27 15:33:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o218fsa",
          "author": "DaedalusandIcarus",
          "text": "Try only accepting missions with clients who have both management and the teams onboard with agile. People tend to lose their time, trying to convince one or the other about the change. But the change is being forced on them. So you're going to waste your time and breath trying to convince them of this change. During an interview, just ask them if both are ready to commit and if other coachs in the past have had issues with the organisation that doesn't want to change, it just want's to say it's doing agile.",
          "score": 1,
          "created_utc": "2026-01-27 15:48:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o228snd",
          "author": "Strutching_Claws",
          "text": "You work for a business, demonstrate how your actions impact the bottom line and people will pay attention,  otherwise you are fluff.",
          "score": 1,
          "created_utc": "2026-01-27 18:25:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o228u8c",
          "author": "Strutching_Claws",
          "text": "You work for a business, demonstrate how your actions impact the bottom line and people will pay attention,  otherwise you are fluff.",
          "score": 1,
          "created_utc": "2026-01-27 18:25:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o22wogg",
          "author": "Hexpnthr",
          "text": "Don’t underestimate the power of culture. Agile works better in some cultures and worse in other. If you are in the US or a culture that is highly hierarchical, you are fighting against the current.",
          "score": 1,
          "created_utc": "2026-01-27 20:08:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o22y0nv",
          "author": "Turkishblokeinstraya",
          "text": "I feel you mate. Pointing out operational shortcomings with solid data, getting acknowledgement, but insufficient commitment. Old habits die hard. The appetite to hire big consultants that often lead to mass lay offs for short-term cost-reduction is still common. Operations keep bleeding money more often than not. \n\nMeanwhile, plenty of practitioners are stuck in a rut, unwilling to learn, measuring velocity, discussing definition of ready, giving no tangible benefits to employers so they consider switching back to their old ways which they never manage to change.\n\nWe need more competence. That's why I offer fluff-free mentoring to less experienced practitioners. Most people learn frameworks and can't apply them, because agility can't be shoehorned into a politically intense, process-heavy organisation. Navigating politics is a different game.",
          "score": 1,
          "created_utc": "2026-01-27 20:15:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o23o3z8",
          "author": "Colt2205",
          "text": ">Being expected to fix disfunction with a magic wand and then watching disappointment when i say I need commitment and sponsorship for a change.\n\nOh man do I feel this in my soul as a software engineer and not even as an agile coach.  But wait, we don't need sponsorship to go work on what is currently the most important priority task until an hour later another request comes in that is also the top priority task!",
          "score": 1,
          "created_utc": "2026-01-27 22:12:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1z4ho8",
          "author": "Rojeitor",
          "text": "You probably don't know how to code shit, never built a long lasting high performance high reliability system, and you're trying to tell the people who KNOW how to do this but rainbows and butterflies",
          "score": -8,
          "created_utc": "2026-01-27 07:04:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1zbavg",
              "author": "theholewizard",
              "text": "I simply can't imagine how a team with you on it might have been dysfunctional",
              "score": 5,
              "created_utc": "2026-01-27 08:04:05",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o1z65eb",
              "author": "eigenwijzemustang",
              "text": "Somebody has had some bad experiences. Enlighten us. What happened?",
              "score": 4,
              "created_utc": "2026-01-27 07:18:23",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1zebul",
                  "author": "Annual-Ad6647",
                  "text": "There’s always one in every team, they don’t like how things are but even worse than that would be change. Fixed mindset people can be so destructive to a team.",
                  "score": 3,
                  "created_utc": "2026-01-27 08:32:00",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o1zeksr",
              "author": "Specific_Crab3601",
              "text": "Ahhhhh that's why🤩",
              "score": 5,
              "created_utc": "2026-01-27 08:34:19",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o1zsjwq",
              "author": "psgrue",
              "text": "An agile coach doesn’t do the estimation for you. They ask you to decide how long it takes you.",
              "score": 1,
              "created_utc": "2026-01-27 10:42:41",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qkrzwk",
      "title": "SAFe (scaled agile) is into bad practices? Warning!",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1qkrzwk/safe_scaled_agile_is_into_bad_practices_warning/",
      "author": "Agile_Dragon",
      "created_utc": "2026-01-23 14:18:08",
      "score": 19,
      "num_comments": 40,
      "upvote_ratio": 0.75,
      "text": "Scaled Agile (SAFe) refuses to provide digital certifications to anybody who passed their exam after the experation date. It doesn't matter if you paid and worked for the certificate they will keep it hidden behind a paywall.\n\nI realized my documents had been missing a certification, the SAFe SM Certification 5.1. I looked everywhere on the site could not find any download links. I did see a renewal for version 6 and was not interested in being ropped out of another 300$ dollars and time.\n\nSo then I reached out to support. The level 1 personnel told me he could also not access the .pdf and I had to renew to have access to an old, expired, certifications I had earned. I explained I was not interested in the new material and simply wanted what I paid for. I had to insist on escalation to somebody who did have the authority. According to current law and buisness this was bad practice. \n\nWorth inquiring with the \\[BBB.org\\](https://www.bbb.org/us/co/boulder/profile/business-development/scaled-agile-inc-1296-1000123264) right? They are already UNTRUSTED with a C- as of early 2026.\n\nLevel 2 also tried to explain to me that the system was locked up behind the renewal paywall and they also could not provide the old certification. I asked them if they practiced Agile at their offices or that was in the title only.\n\nAfter finding them on Google maps. I found I was not the only person with bad support issues. Some other people reviews include \"Waterfall dressed as a clown.\". \n\nGiving everybody a heads up.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1qkrzwk/safe_scaled_agile_is_into_bad_practices_warning/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o18vhww",
          "author": "motorcyclesnracecars",
          "text": "Its a bit of a bull shit thing. I use to pay to keep renewing my certs... but thought why? I passed, have stayed in the field and relevant. Im not going to continue to pay for a \"piece of paper\". I dont do that with my college degree. Its just a meaningless way for these companies to keep an income stream, thats it.\n\nAlso, no employer has ever asked to see my current, active cert. So why bother.",
          "score": 13,
          "created_utc": "2026-01-23 14:47:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o19izoc",
              "author": "Dull_Sense7928",
              "text": "I let my SAFe 4.0 and 6.0 certs lapse rather continue paying $895 each year just to get filtered out of prospective roles. In my market, there's a glut of SAFe trainers, salespeople, vendors who have no real world experience, giving anyone SAFe experience a black mark. Once I removed it from my resume, I got callbacks. \n\nIt's a shame, as I remember when SAFe was announced before it even needed an x.0, and the initial product was pretty good, lightweight, suitable for knitting dependencies together among apps  Exactly what was needed for decoupled web app development. \n\nMy over-a-decade old Scrum Alliance certs, obtained when they actually meant something, are the next ones I won't renew",
              "score": 4,
              "created_utc": "2026-01-23 16:36:26",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o193nfu",
              "author": "oreo-cat-",
              "text": "The only one I bother to keep up is my PMP but I just listen to podcasts for the continuing education.",
              "score": 1,
              "created_utc": "2026-01-23 15:27:19",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o19dukn",
                  "author": "Agile_Dragon",
                  "text": "Conferences are also good. I attended the DevOps (also Agile) conference and loved it. Gene Kim has fantastic books to read.",
                  "score": 2,
                  "created_utc": "2026-01-23 16:13:23",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o18ujx9",
          "author": "Aggravating_Pen_6062",
          "text": "SAFe is a waste of time.  I have a POPM cert and missed two questions on the whole exam.  I've been in software for 34 years.  Good old-fashioned [scrum.org](http://scrum.org) scrum would be enough if people bothered to follow it.  Sigh.",
          "score": 25,
          "created_utc": "2026-01-23 14:43:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1dst0t",
              "author": "Venthe",
              "text": "> Good old-fashioned scrum.org scrum would be enough if people bothered to follow it\n\n1. You'd have to read it first, who could be arsed to read <15 pages?\n2. You'd have to understand basic English, and _think_. We need prescriptions dammit!\n3. You'd have to _ultimately_ change the organization to empower people. We want agile, but at most we can change _names_. Is there a better process than SAFe that allows for everything to remain the same?",
              "score": 4,
              "created_utc": "2026-01-24 06:16:19",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1emzd6",
                  "author": "Aggravating_Pen_6062",
                  "text": "Amen",
                  "score": 2,
                  "created_utc": "2026-01-24 10:47:31",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1j8ai1",
                  "author": "flundstrom2",
                  "text": "I've been thinking about your last question for a few months. Best alternative I can think of, is scrum@scale.\n\nBut I have a few ideas on a method that would be able to scale agile without having to change the organization. I just need to distill it and make a tool to guide an organization. Some day, at least.",
                  "score": 1,
                  "created_utc": "2026-01-25 01:06:17",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o18zhvd",
              "author": "Agile_Dragon",
              "text": "Solid.",
              "score": 1,
              "created_utc": "2026-01-23 15:07:33",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o18rlio",
          "author": "Illustrious-Jacket68",
          "text": "I wouldn't worry about it or even continue to bother.  I think these days, having SAFe certification on your resume may actually work against you.  Would be emphasizing the pieces and practices of SAFe that you think are useful and why.  \n\n",
          "score": 19,
          "created_utc": "2026-01-23 14:27:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1b61n3",
              "author": "Competitive_Ring82",
              "text": "Hard agree. I would not hire a SAFe proponent.",
              "score": 3,
              "created_utc": "2026-01-23 21:08:36",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o19ivi4",
              "author": "Agile_Dragon",
              "text": "Fighting the good fight.\n\nThose who know how to speed up a buisiness, create value, only need let their work speak for itself. [Scrum.org](https://www.scrum.org/) already has most of what you need. \n\nI recommend these Agile certifications first:\n- PSM\n- Scrum Inc\n- CSM",
              "score": 1,
              "created_utc": "2026-01-23 16:35:55",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o18t4ch",
          "author": "nborders",
          "text": "PMI does the renewal game also. I still take credit bypassing the tests in both situations (PMP and SAFe’s SCP). \n\nProject Management certifications are a scam…but they have somehow convinced those in power that the person with the credentials have of some sort of quality. \n\nThe PMP exam was tough but really only showed I can learn vocabulary words and recall how PMI organized the PMBOK. \n\nSAFe was the big player in scaling agile for larger software organizations. Frankly every SAFe rollout I took part in eventually morphed into “[name of company]-agile”. In other words they figured out it was agile moved up to the program and portfolio-levels. \n\nThey are a scam.  Yet I sometimes wonder I should have kept my PMI subscription, but I hated the meetings and would rather have the money.",
          "score": 8,
          "created_utc": "2026-01-23 14:35:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o18zssz",
              "author": "Agile_Dragon",
              "text": "I have the course and all the points myself. Would only need to take the PMP / ACP exam... But nobody has asked for those in over 10 years. Would have been more wasted money.",
              "score": 1,
              "created_utc": "2026-01-23 15:09:02",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o19c2mx",
                  "author": "nborders",
                  "text": "I’m seeing PMP arise again in many PM job postings recently. \n\nOnly 2 where SAFe qualifications were asked for. Agility has matured in many organizations and specialists in Agile are not needed as much. \n\nI’m seeing more hybrid-roles, if agile is on the list of requirements. Someone to run the project or program who knows how agile systems work.",
                  "score": 1,
                  "created_utc": "2026-01-23 16:05:26",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1afxod",
          "author": "PhaseMatch",
          "text": "Certification mills are like multi-level-marketing schemes.\n\nSAFe is a very expensive collection of other people's agile/lean ideas, along with \"PI Planning\" as the only unique thing they offer.  Everything else you can find online, or in books, or is well discussed.\n\nSAFe \"transformations\" tend to fail for the same reason that Scrum transformations fail, or for that matter transformations in general fail.   There's a focus on the easy bits, getting \"quick wins\" and so on, which tends to mean the hard stuff never moves.\n\nIf you need SAFe certification for a job, chances are the job will suck.",
          "score": 4,
          "created_utc": "2026-01-23 19:05:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1akafz",
              "author": "Agile_Dragon",
              "text": "Simply and well put.\n\nOld Business have been opperating in a way for a long time, sometimes several decades or more. It's going to take far more than a couple of years to change the culture in the company. It's committed slow or big-bang approach (company wide restructure). Both approaches come with setbacks to obtain the perks.",
              "score": 1,
              "created_utc": "2026-01-23 19:26:02",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1as0mp",
                  "author": "PhaseMatch",
                  "text": "My preference is mor4 towards the \"Kanban Method\" as described in \"essential Kanban condensed\" \n\n\\- start where you are  \n\\- get agreement to evolve the organsiation  \n\\- do this through data-driven experiments  \n\\- encourage acts of leadership at every level  \n\\- apply systems thinking concepts and ideas  \n\\- continuously improve\n\nThe whole \"transformation\" industry is heavily driven by expensive consultancies and the idea that change is a big-design-up-front, value-at-process.    \n  \nAnd it's simply not.  \n\nW Edwards Deming understood this, which is why \"Out of the Crisis!\" back in 1980 outlined 14 points for managers which are still highly relevant.  Agility drew very heavily on his \"lean\" concepts and ideas.\n\nI learned a LOT working in a SAFe environment, but none of that was SAFe specific.\n\nA lot of the desperate \"pearl clutching\" reactions tend to miss that most of SAFe is just other people's ideas, rebranded.\n\nFor example, an \"Agile Release Train\" is really just \"The Spotify Model\" that everyone was gushing over back in 2017 or so, just with more boring, corporate sounding names.  \n\n\nSAFe training - like Scrum training - is really about everyone agreeing to use a certain terminology, and not changing what those words mean. \"Minimum Viable Product\" anyone?  \n  \nAnd very little of it has to do with the actual practical side of agility, Extreme Programming (XP) and more latterly DevOps.  If   \n  \n\\- change is not cheap, easy, fast and safe (no new defects)  \n\\- you don't get fast feedback from users on the value you created  \n  \nthen pretty much you have nothing.  You'll wind up adding processes and documentation to control risk, because your technical teams don't have the skills to do it for you.  \n\n\nBut we can afford to send senior managers on \"Leading Safe 6.x\" or whatever.  \nJust not train the delivery teams in ScrumXP, because it costs too much.  \n  \nYour SAFe transformation died right there.",
                  "score": 1,
                  "created_utc": "2026-01-23 20:02:10",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o18t63b",
          "author": "RDOmega",
          "text": "You don't want SAFe on your resume.",
          "score": 13,
          "created_utc": "2026-01-23 14:36:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o18yvnk",
              "author": "Agile_Dragon",
              "text": "I haven't even reviewed the teachers. Talked about Alphas and Sigmas for days. What a joke.",
              "score": 3,
              "created_utc": "2026-01-23 15:04:31",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1906a5",
          "author": "DeanOnDelivery",
          "text": "I think I got POPM 4.5 or something like that a few years back. \n\nI don't really give a shit now. I suspect that certifications are going to become of secondary value given the ability to leverage AI to help facilitate processes. \n\nI'm not saying people won't still gatekeep job applicants for such certifications and such shops where SAFe® is still a big deal. \n\nI'm just saying, given the recent de-investment in all things agile from CPO's, COOs, and CTOs, to the point where they're jettisoning Scrum Masters in Agile coaches left and right into the Styx lake of the laid off. \n\nBasically, sponsors of such training and certification are likely to take that money and place their bets elsewhere.",
          "score": 2,
          "created_utc": "2026-01-23 15:10:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o193nfl",
              "author": "Agile_Dragon",
              "text": "- Value chain. \n- Lean portfolio management.\n- Agile.\n- From project to product.\n\nEverything you need to thrive in 2026, 2027, 2028.",
              "score": 1,
              "created_utc": "2026-01-23 15:27:19",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o19p60z",
                  "author": "Strenue",
                  "text": "You can get all of that elsewhere. In fact it’s probably better to.",
                  "score": 1,
                  "created_utc": "2026-01-23 17:04:12",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o190bbi",
          "author": "AllForKarmaNaught",
          "text": "Pretend your an employer and you need the certificate to verify their resume.",
          "score": 2,
          "created_utc": "2026-01-23 15:11:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o19ddny",
              "author": "Agile_Dragon",
              "text": "Scaled Agile as a company sucks.",
              "score": 2,
              "created_utc": "2026-01-23 16:11:16",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1a9ynj",
          "author": "m0strils",
          "text": "The sooner SAFE disappears the better.",
          "score": 2,
          "created_utc": "2026-01-23 18:38:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o192hti",
          "author": "clem82",
          "text": "Always has been. It’s started as a cash grab for waterfall homers who lost money when the PMP bucket dried up",
          "score": 3,
          "created_utc": "2026-01-23 15:21:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o193qj6",
              "author": "Agile_Dragon",
              "text": "Yup",
              "score": 1,
              "created_utc": "2026-01-23 15:27:43",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1ax6g0",
          "author": "paul_h",
          "text": "Seems unethical- charge for the certification and provide free proof, \n\nor provide free certification and charge to access the proof/ verification of the same \n\n… not both",
          "score": 1,
          "created_utc": "2026-01-23 20:26:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1cw41x",
          "author": "Jolly-Lie4269",
          "text": "No money? The train has left the station choouuuuuu chooouuuu",
          "score": 1,
          "created_utc": "2026-01-24 02:37:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1cwlzi",
              "author": "Agile_Dragon",
              "text": "I laughed out loud.\nDamn, this was dumb. 😂",
              "score": 1,
              "created_utc": "2026-01-24 02:40:27",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1e81jd",
          "author": "mathilda-scott",
          "text": "That’s frustrating, but it’s unfortunately how SAFe has operated for a while. Their certs are treated more like subscriptions than lifetime credentials, which is very different from PMI, Scrum, etc. BBB won’t usually force access, but filing a complaint can at least create a paper trail. For anyone considering SAFe: assume ongoing renewal costs and limited long-term value unless your employer explicitly requires it. If not, frameworks with permanent digital certs tend to age better.",
          "score": 1,
          "created_utc": "2026-01-24 08:30:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1jaou9",
          "author": "funbike",
          "text": "The A in SAFe is a lie.   It's waste of time, regardless if you got a cert or not out of it.",
          "score": 1,
          "created_utc": "2026-01-25 01:19:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1967pv",
          "author": "Internal-Alfalfa-829",
          "text": "SAFe is not Agile anyway. It's a way for old people to pretend they are doing Agile, so they can slap the label on things. All while clinging on to their old way of predicting and controlling multiple years of future without changing the slightest thing. Not a loss.\n\nThat said, recruiting is kinds dumb about that stuff and the AI filter might require the \"SAFe\" buzzword to let you through. Worst case put it in your CV in the list of certs and that's it. Nobody said we have to show the actual cert docs.\n\nSucks for you, but customer support cannot change the way their software functions. As long as they explain how things currently work and pass on the feedback, they are doing a good job.\n\nEDIT: Ok, this part if funny though - the C- is based on\n\n\\- Failure to respond to 1 complaint(s) filed against business\n\n\\- 1 complaint(s) filed against business that were not resolved\n\nThat is ***nothing***. The BBB is a private, nonprofit organization. They can't even legislate legally binding rules for businesses. So this rating carries zero weight, even less so if the entire thing is based on data from one single potential incident.",
          "score": 0,
          "created_utc": "2026-01-23 15:39:07",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qit3zb",
      "title": "Agile Transformed how my department works, but not getting recognised. How did you handle this?",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1qit3zb/agile_transformed_how_my_department_works_but_not/",
      "author": "Maverick2k2",
      "created_utc": "2026-01-21 09:08:38",
      "score": 11,
      "num_comments": 50,
      "upvote_ratio": 0.99,
      "text": "In my current role, I’ve fundamentally transformed how my department operates.\n\nWe went from:\n\n\t•\tLittle to no visibility over the pipeline of work\n\n\t•\tFrequent escalations and firefighting\n\n\t•\tPoor relationships with cross-team dependencies\n\nTo:\n\n\t•\tFull visibility of delivery and priorities\n\n\t•\tFewer escalations and more predictable outcomes\n\n\t•\tStronger, more strategic cross-team relationships\n\nThe work is respected and people openly say things run much more smoothly now. I’m seen as someone who “keeps things running” and unblocks problems.\n\nThe issue is recognition.\n\nWhen it comes to showcasing impact, leadership tends to spotlight my peers’ initiatives instead. Their work gets presented upward, raising their profiles, while my transformation work stays largely in the background - even though it underpins a lot of what others are delivering.\n\nI’m not being treated badly, and I am respected, but it feels like I’ve become invisible in terms of progression. I’m starting to think about leaving, but before I do:\n\nFor those who’ve been in a similar position - how did you handle it?\n\n\t•\tDid you manage to reframe your impact and get recognition internally?\n\n\t•\tDid you deliberately change how you worked to be more visible?\n\n\t•\tOr did you eventually leave, and was that the right call?\n\nWould really appreciate hearing how others navigated this.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1qit3zb/agile_transformed_how_my_department_works_but_not/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o0vzc92",
          "author": "agile_pm",
          "text": "You solved a problem and moved things from dysfunction to competence.  You did what you're paid to do.  \n\nEven though what you accomplished is genuinely valuable, it's not strategic in the way that leadership defines strategy.  The issue isn't recognition; it's that you are not positioning your work in terms of outcomes.  Operational excellence is not the same as enterprise movement.  Delivery, predictability, and stronger relationships are table stakes.\n\nWhat can the organization do now that it couldn't before?  Which strategic problems were solved or opportunities were realized?  You're winning an operational game while trying to be promoted into a strategic game.  I don't know if it's too late to capitalize on past success, but going forward be sure to reframe your success in terms of strategic outcomes, not just operational efficiency.\n\nI'm not saying you should leave, but I was in a similar situation and was not promoted until after I left and proved myself at the next employer, where I was intentionally and visibly more strategic.",
          "score": 10,
          "created_utc": "2026-01-21 17:18:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o17j3uv",
              "author": "Maverick2k2",
              "text": "I do appreciate that perspective. At the same time, I’ve seen a number of highly paid Agile Coaches and senior managers hired to deliver exactly this kind of change who ultimately didn’t manage to make it stick.\n\nThat’s where the frustration comes from. They held the titles and compensation, while I’ve delivered comparable - if not stronger - outcomes as a Scrum Master on a significantly lower salary.\n\nAnd this hasn’t just been about operational tidy-up. The department is now more strategic and forward-looking in how work is delivered. We’re able to incrementally and continuously deliver outcomes, make better prioritisation decisions, and reduce ambiguity. Previously, there was a lot of confusion and unclear ownership around what mattered most.\n\nI also actively work with Product Management on Roadmapping activities.",
              "score": 3,
              "created_utc": "2026-01-23 09:13:14",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1jew77",
                  "author": "agile_pm",
                  "text": "Let's take a step back and look at some definitions:\n\n* Efficiency is the core component of excellence, focusing on cost reduction and faster, improved execution. \n* Operational Excellence ensures all processes align with strategy to deliver superior value. \n* Strategy defines the unique, long-term value proposition and competitive advantage. \n\nNow, let's look at some of your statements:\n\n* The department is now more strategic and forward-looking in how work is delivered.\n* ...there’s a clear quarter-on-quarter increase in the number of projects delivered (+50%). \n* relying instead on continuous prioritisation and flow.\n* I also actively work with Product Management on Roadmapping activities.\n\nIt sounds like you're moving into Operational Excellence, but your framing is about delivery, which gets interpreted as efficiency, not strategic value.  How has what you, and those working with you, have accomplished moved the strategic needle?  Why would an executive, who is concerned about tradeoffs, revenue, cost savings, etc., look at your accomplishments and think that you've done more than make things really efficient?  Sure, you've done a great job, but have you done more than is expected of you?\n\nAs I said before, what you've accomplished is important.  Companies need good people that can keep things running smoothly.  Why would they want you to do something else?\n\nYou've expressed that you're frustrated that you're not getting recognized for your contributions.  Whose job have you made easier?  The Product Manager's and the project team's, or the CEO's?  All three are possible, but to borrow from u/chiggy1223:\n\n* Has it created new markets or protected its old markets better?\n* Is it tangibly raising profit margins or supercharging growth?\n\nWhich strategic objectives have you met?  Did the company have a top-level goal to deliver faster or deliver more projects?  What strategic initiatives would not have been able to be completed, let alone started, if not for the changes you helped bring about?  Nobody else is going to frame your successes in terms of strategic value for you.  If you're not doing it, how will they know?\n\nI'm not saying to run around blowing your own horn and extolling your virtues.  but if asked what you've accomplished that makes you feel you deserve a promotion, does your answer sound more strategically focused if it is \"We delivered 50% more projects, QoQ, by doing ...\" or \"We've realized 25% revenue growth, YoY, for the past three quarters as a result of...\"?  How you describe your successes affects how they are viewed, which affects how you are viewed.  Are you efficient or are you strategic?",
                  "score": 1,
                  "created_utc": "2026-01-25 01:43:12",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o1cdqcl",
              "author": "chiggy1223",
              "text": "This is exactly right. I have never worked for an organisation that actually values operational excellence - even when they started with completely terrible operations. I’ve come to see that perhaps the reason why they were in such dire straits operationally to begin with may be that they systematically undervalue it, and hence doing work there no matter how significant does not make you valuable.",
              "score": 2,
              "created_utc": "2026-01-24 00:50:49",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1eqy90",
                  "author": "Maverick2k2",
                  "text": "I’ve just reviewed our quarterly metrics and there’s a clear quarter-on-quarter increase in the number of projects delivered (+50%). This improvement has been achieved without reverting to waterfall delivery, relying instead on continuous prioritisation and flow. I’ve rarely seen this sustained in a large organisation, and it reflects strong leadership alignment around agile ways of working. Which I have done.\n\nThis isn’t just operations , it’s been a total shift in mindset across all stakeholders.",
                  "score": 2,
                  "created_utc": "2026-01-24 11:23:15",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0u3t3l",
          "author": "flamehorns",
          "text": "Invisible is good. The old days of fetishizing agile are long gone. You can drive the recognition. You can thank management and all team members for their support. You are a servant leader, you know you did well, your ego doesn't need masturbating, you are above that. Stay invisible, keep serving quietly from the background, and praise the others and masturbate their egos generously.",
          "score": 6,
          "created_utc": "2026-01-21 11:11:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0u9nts",
              "author": "Maverick2k2",
              "text": "It just really comes down to being paid what you are deserved. The work I’m doing is hard. Driving change without any authority.\n\nOn that note, I am well on my way with solving systemic organizational problems and I’m being paid a lot less that my manager. \n\nDoesn’t make sense.\n\nI am also coaching other departments on how to structure their work and building a reputation as an Agile expert.",
              "score": 1,
              "created_utc": "2026-01-21 11:57:43",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0tr344",
          "author": "mmmleftoverPie",
          "text": "Do you have before and after metrics with respect to initiatives being delivered?\n\nEg 10 initiatives per quarter pre-transfornation, 15 initiatives per quarter after.\n\nOr x% initiatives delivered on time compared to y% delivered on time before.\n\nThat can help you.\n\nOtherwise can you measure/identify the reduction in fires that need putting out.\n\nAre you org's engagement scores rising?\n\nIs sick leave down?\n\nIt's a rich tapestry.",
          "score": 5,
          "created_utc": "2026-01-21 09:14:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0trak8",
              "author": "Maverick2k2",
              "text": "Yes , I track throughput and lead time. There has been an improvement with both. \n\nLeadership acknowledges this , but that’s it.",
              "score": 1,
              "created_utc": "2026-01-21 09:16:21",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0trefq",
                  "author": "mmmleftoverPie",
                  "text": "What recognition are you looking for?",
                  "score": 2,
                  "created_utc": "2026-01-21 09:17:26",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o0tsiwv",
                  "author": "LogicRaven_",
                  "text": "What are some differences between your peer’s initiatives and yours? \n\nBoth in terms of topic, deliveries and how the results are presented.",
                  "score": 2,
                  "created_utc": "2026-01-21 09:28:22",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o0x5vlr",
                  "author": "TMan-X",
                  "text": "Throughput and lead time doesn’t equal value. Figure out how to measure that in your setting.",
                  "score": 1,
                  "created_utc": "2026-01-21 20:27:54",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0x5ns3",
          "author": "TMan-X",
          "text": "You say the issue isn’t about recognition. Clearly though it is or you wouldn’t be posting about it. You also stated “I’ve fundamentally transformed how my department operates”.\n\n News flash, it isn’t about you.\n\nAs a good Scrum Master you should be highlighting how the TEAM transformed and more importantly how that resulted in better outcomes and value for their stakeholders.\n\nIf a scrum master does their job right, they put themselves out of a job. You either build on your success and go help another team in your organization, you move into a different role, or you go work somewhere else.",
          "score": 3,
          "created_utc": "2026-01-21 20:26:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0v81x5",
          "author": "Triabolical_",
          "text": "You need statistics and - shudder - a dashboard. \n\nOne of the inherent problems with software is that trans work on different things and nobody knows how long they should take, and managers often look at activity as a sign of improvement and innovation. \n\nCalm and competent teams get ignored. \n\nI led one team where we had a lot of control over process and we did really, really well. Calmly. \n\nI ended up with very high ratings in employee satisfaction - in the high eighties versus the mid seventies. \n\nAnd... I got marked down on my review because I wasn't working my employees hard enough. And my peers were unhappy because they made me look bad. \n\nSo figure out the stats that make you look good but beware of your peers because they will fight back, even if they are your friends.",
          "score": 2,
          "created_utc": "2026-01-21 15:14:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o15mf8w",
          "author": "ben505",
          "text": "Welcome to the workplace lol, shit sucks. This is why ruthlessly selfish people tend to climb the ladder",
          "score": 2,
          "created_utc": "2026-01-23 01:17:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1epl5e",
          "author": "AgileEvolves",
          "text": "Wow! Great comments here. Lots of wisdom to process. Maverick, that’s a tough situation you have here. There may be a strategy to stay vs leaving. You have to do the pros and cons. The stay strategy is to create  new internal job for yourself and sell it to leadership. Using AI give it your current job description and then have it give you the one you want to be promoted to. Tweak it and then pitch internally as “ I want to servant lead the whole corp to have the same outcomes as my department.” In other words sell them the idea of you as Enterprise Agile\nCoach coaching other SM and establishing a LACE. . Worse case they say no, best case you’ve prepped for external job interviews. You gave them a chance and if they decline, you did your all. Good luck!",
          "score": 2,
          "created_utc": "2026-01-24 11:11:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0tvvfy",
          "author": "ScrumViking",
          "text": "One of the core conflicts is that impact of successful transformation is delayed and hard to correlate. This is where setting objectives and visualizing progress towards them can really help give it the attention it deserves. Leading with Obeya is a good method to create insight into translating strategic objectives towards results, couple them with initiatives and impediments.",
          "score": 2,
          "created_utc": "2026-01-21 10:00:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0u32yg",
          "author": "corny_horse",
          "text": "The obvious omission in our entire post is how that translates to $.  If you just took the three info points from your first two, you could achieve the same points by tanking the team productivity, too. Less stuff done = more visibility and fewer escalations, and more time to be \"strategic.\"  \n\nWould that be good for the company and/or team? Probably no to both.\n\nYou need to translate that into how you are achieving results and how that helps the team ship code to customers who pay you money.",
          "score": 1,
          "created_utc": "2026-01-21 11:05:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0uaexx",
              "author": "Maverick2k2",
              "text": "That is the problem, it doesn’t cleanly translate to dollars . At the same time, I’ve got the department to the point where they have more clarity in terms of how the work is planned and delivered. Previously nobody had any idea of what was going on. I’m sure that should account for something?",
              "score": 1,
              "created_utc": "2026-01-21 12:03:17",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0ucyob",
                  "author": "jesus_chen",
                  "text": "It does account for something: your firm values it at $55k per year. \n\nIf I were you, I’d get the firm to pay for every Scrum cert under the sun including product roles because what you aspire to be, based on your feedback in this thread, is a Product Owner. Get the certs, put your jead down and work on tour resume (with How you transformed a loose engineering org into a product machine) and once the market turns back up (2027?), go for a new org with a ton pf experience on your CV.",
                  "score": 2,
                  "created_utc": "2026-01-21 12:21:46",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o0uh2zt",
                  "author": "corny_horse",
                  "text": "Your department doesn't do anything that produces value?  It should be glaringly obvious how your department produces value, even if you're a cost center.  In the case of the former, it's the amount of profit, if you're a cost center its the amount of labor hours you've saved.  \n\nFor example: How expensive was an escalation before the work?  How frequently did they happen?  If you had one incident a month and it required 50 engineering hours to fix, and now there are .33 incidents per month and they take 1 hour to fix... back of the napkin math - which is sometimes just as good as management is concerned would reveal you want from ~$1.2m in firefighting to $5-10k annually.",
                  "score": 1,
                  "created_utc": "2026-01-21 12:49:26",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0vzskb",
          "author": "Budget_Pin5828",
          "text": "Demonstrating Value and Impact \n\n* What are you tracking today?  I think I saw in the comments below you are tracking lead time and throughput. \n* How are tracking value and input?  How are you translating that into actual dollars?  Either cost avoidance or roi?\n* What leading indicators are you tracking?\n*  What I am seeing and typically see alot are metrics, but not metrics tied to value.  Cycle time and lead time went down, so what?  Translate that into dollars. Did we make more money because we delivered early?  If defects are down, are there fewer customer complaints or has customer retention or activation improved?\n* While the metrics you are capturing are ok, they don't speak to the overall value or impact to the bottom line, or to the overall product/customer lifecycle.  \n\nRecognition and promotion  \n\n* The market is flooded with Scrum Masters and Agile Coaches.  \n* So if you're looking to exit your company, it's ultra competitive out there.  You'd be competing with SMs that have your success story 5 times over\n* Further, these SMs and Agile Coaches have already figured out how to tie their process metrics to actual dollars.  \n* Things that appear to be missing (based on your post) that would help make the case for a promotion:\n   * Tying process metrics to value and impact\n   * Metrics translations to actual dollars\n   * Customer and Stakeholder Sentiment\n   * Product and Customer Metrics\n* These will help you build a broader empirical narrative for making your case for promotion. its hard to argue with empirical data with tangible impact.",
          "score": 1,
          "created_utc": "2026-01-21 17:20:28",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qo9zs1",
      "title": "how do teams surface production issues back into the backlog?",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1qo9zs1/how_do_teams_surface_production_issues_back_into/",
      "author": "SalamanderFew1357",
      "created_utc": "2026-01-27 10:13:51",
      "score": 10,
      "num_comments": 11,
      "upvote_ratio": 1.0,
      "text": "alerts fire, incidents happen, but getting that info back into planned work is messy. how are you handling this with proper backlog management?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1qo9zs1/how_do_teams_surface_production_issues_back_into/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o1zqlog",
          "author": "negotiationtable",
          "text": "It would be interesting to know why it seems to be messy - what specifically is happening and what mess is created as a result",
          "score": 4,
          "created_utc": "2026-01-27 10:25:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1zqrno",
          "author": "Any_Side_4037",
          "text": "asana boards let us move alerts from an incident column to the main backlog, but it requires a human to prioritize each one.",
          "score": 2,
          "created_utc": "2026-01-27 10:26:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o201mud",
          "author": "ninjaluvr",
          "text": "Product Owner and Product Manager weigh the priority of upcoming features and decide. If you've exhausted your error budget, your error budget policy should dictate prioritization of reliability fixes.",
          "score": 2,
          "created_utc": "2026-01-27 11:56:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o205mf4",
          "author": "percomis",
          "text": "I would handle it like technical debt, priority based on impact/likelyhood of the incident. If you do sprints, carve out space for technical debt in each.",
          "score": 1,
          "created_utc": "2026-01-27 12:25:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o20m1xn",
          "author": "Pyroechidna1",
          "text": "It’s messy for me because our dev teams are laid out in a way that makes it impossible to tell who owns a given bug",
          "score": 1,
          "created_utc": "2026-01-27 14:00:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o20pzuo",
              "author": "Fragrant_Contact_100",
              "text": "How’s your communication?  What type of cross functional discourse do you have?",
              "score": 1,
              "created_utc": "2026-01-27 14:20:47",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o2115v4",
              "author": "WaylundLG",
              "text": "It seems like you have the answer to your problem. One of the biggest challenges I see with teams trying to become more agile is that they assume things are fixed that aren't,  like team design.",
              "score": 1,
              "created_utc": "2026-01-27 15:15:15",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2139fz",
          "author": "dgmib",
          "text": "This smells more like a symptom of a deeper problem.",
          "score": 1,
          "created_utc": "2026-01-27 15:24:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o23wy4p",
          "author": "easy-agile",
          "text": "We see teams faceplant into this constantly. Production issues show up like uninvited guests and trash your sprint because there's no process beyond panic and guilt.\n\nTeams that handle it well have one secret: just because something's broken doesn't mean it gets to cut the line.\n\nWhen alerts fire, someone (RIP to whoever's on \"interrupt handler\" duty this week) creates tickets but doesn't automatically yeet them into the current sprint. Instead, they go through actual prioritisation: either at the next refinement or through a quick \"is this genuinely burn-it-all-down urgent?\" chat.\n\nWhat works: A dedicated swim lane/label for production issues - visible but contained. Team eyeballs the impact and decides if it needs to blow up the sprint right now or can wait.\n\nWhat makes everyone cry: Production issues getting lobbed straight into the sprint with zero discussion about what they're displacing. It's like adding passengers to an already-full bus and acting shocked when it breaks down",
          "score": 1,
          "created_utc": "2026-01-27 22:54:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o24s0xo",
          "author": "teink0",
          "text": "This suggestion requires valuing individuals and interactions over processed and tools. Somebody will be planned to commit to prioritizing production issues over backlog items. If it isn't worth the effort it can go to the backlog",
          "score": 1,
          "created_utc": "2026-01-28 01:33:51",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qmutuk",
      "title": "Visualizations of agile transformation journey",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1qmutuk/visualizations_of_agile_transformation_journey/",
      "author": "Specific_Crab3601",
      "created_utc": "2026-01-25 20:44:21",
      "score": 6,
      "num_comments": 14,
      "upvote_ratio": 0.69,
      "text": "another question from me today 🥹 \n\nHow do you guys visualize progress. do you have some storytelling ideas for management? or portfolio style things? \n\ni know for some metrics I can show graphs but i am thinking about some kind of systemic change picture that is easy to understand. idk How can i do it. just write a narrative???🤔",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1qmutuk/visualizations_of_agile_transformation_journey/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o1p9inv",
          "author": "Strenue",
          "text": "I love doing a timeline retro to tell the story over time.",
          "score": 3,
          "created_utc": "2026-01-25 21:59:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1pcysv",
              "author": "lexpectopatronum",
              "text": "We do this in our sprint review meeting. There's basically a timeline and our roadmap and a little star that says \"we are here!\" \n\nIt checks a waterfall-PMO box and lets us keep doing what we do without being bothered. It's actually been really helpful visually for leadership. \n\nI ALSO added a \"how we were agile\" slide for monthly leadership that gives a short narrative of a few examples of behaviors from the team that demonstrate the agile principles. It's been VERY effective for getting \"what's the point of agile\" across to reluctant senior leaders. \n\nNot quite what you asked for but has been huge for telling the story for my team.",
              "score": 7,
              "created_utc": "2026-01-25 22:14:06",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o1qnfcy",
              "author": "SoCaFroal",
              "text": "Can you tell me more about this? How does a timeline retro work?",
              "score": 2,
              "created_utc": "2026-01-26 01:57:32",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1pga6a",
          "author": "uaySwiss",
          "text": "What helped me the most in previous jobs: Releases per day (usually it starts with releases per month). Then you combine it with NPS or other user happiness indicators which are comparable over time. Ah and ensure the quality (uptime and bugs) don't drop.\n\nWhy releases? If you can ship more and still struggle, it should be easier to navigate. If you are not able to ship multiple times a day, you should first work on that. It usually is one or multiple of:\n- people with bad mindset\n- bad tech stack / architecture\n- toxic culture\n- bad error culture\n- ...",
          "score": 4,
          "created_utc": "2026-01-25 22:28:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1p96km",
          "author": "jake_morrison",
          "text": "One way is to make the work itself visible, i.e., a Kanban board. Then you can see the number of items in the backlog and the work in progress. You can see how big the items are. You can see what is waiting on other people, either for client approvals or on other teams.\n\nThen you get into DevOps transformation, and all the downstream processes needed to deploy to production and operate. You have the feedback loops from prod back to dev and product. Then you have the work to optimize process steps and handoffs. See Accelerate and The DevOps Handbook.\n\nVisualize the value chain and show what the bottlenecks are.",
          "score": 2,
          "created_utc": "2026-01-25 21:57:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ra9wc",
          "author": "Consistent_Serve9",
          "text": "A metric i recently discovered (forgot the name); Compare the number of tickets created in the backlog during the sprint vs the numbers of tickets closed during the sprint. That tells you if your backlog is growing exponentially and if your tech debt might be.overwhelming.",
          "score": 2,
          "created_utc": "2026-01-26 03:59:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1sgwyu",
              "author": "kiraka67",
              "text": "Backlog health",
              "score": 1,
              "created_utc": "2026-01-26 09:28:45",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1pegex",
          "author": "Strenue",
          "text": "I use it to tell the story - not review by review, but certainly when something big happens, like the product gets its first customer - so longer time spans.",
          "score": 1,
          "created_utc": "2026-01-25 22:20:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1r86id",
          "author": "mrhinsh",
          "text": "This usually turns into a self-congratulatory exercise.\n\nIf you’re looking for a “systemic change picture” to show management, it’s often because the actual outcomes haven’t moved.\n\nThe only story that matters is outcomes:\n\n* Are you delivering more frequently?\n* Is quality improving, fewer incidents, faster recovery?\n* Are customers actually happier or using the product differently?\n* Are you learning faster from real usage?\n\nIf those numbers have moved, the story tells itself. A simple before/after trend is enough.\n\nIf they haven’t moved, no narrative or visualisation will fix that. It just becomes a “look how agile we are” deck.\n\nAgile doesn’t need storytelling about the journey. It needs evidence that the system now produces better results.\n\nStart with outcomes. If you need a picture to explain it, something is probably wrong.",
          "score": 1,
          "created_utc": "2026-01-26 03:46:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1rd25o",
              "author": "Specific_Crab3601",
              "text": "I dont think i agree... We have an AC for 6 months and there was a change - they came into a nightmarish place with no rules and clarified a lot - made a lot of issues transparent. I see that people are not as scared to speak up, the issues are being discussed now. But we didnt manager to fix them yet since it is all interconnected and a lot of issues are upper mgmt above our influence (so far). So if youd Ask me- i see a big difference, but mgmt is not seeing it yet",
              "score": 1,
              "created_utc": "2026-01-26 04:16:35",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1r9qap",
          "author": "rayfrankenstein",
          "text": "Working software is the primary measure of progress.",
          "score": 1,
          "created_utc": "2026-01-26 03:56:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1rd6m9",
              "author": "Specific_Crab3601",
              "text": "🙄",
              "score": 1,
              "created_utc": "2026-01-26 04:17:21",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1vi0ce",
          "author": "PhaseMatch",
          "text": "**Agility is a means to an end, not an end in and of itself.**\n\n\\- what can the business do now, that it couldn't do 3, 6 and 9 months ago?  \n\\- how has that impacted on the bottom line (costs, revenues)? \n\nSo for example, if you have successfully coached the organisation  \n  \n\\- away from measuring \" producivity\" and toward measuring \"value created\"  \n => what impact has that had on costs, revenues and user growth?\n\n\\- to have a better culture and invest in professional development  \n=> how has that impacted on staff retention and recruitment over that time?\n\n\\- to communicate more effectively and use the cadence events as intended  \n=>how has that reduced the number of non-cadence meetings/events needed?\n\n\\- towards \"building quality in\" and not \"inspect and rework\"  \n=> how has that reduced the time/cost and revenues\n\n\\- towards greater team autonomy and away from top-down decisions  \n=> how has that impacted the ability to flow work faster\n\n  \nYou should be able to give a time line and directly tie in the organizational change you have intentionally created   to' real-word business impacts, and so give a data-driven narrative tying your core coaching arcs to the outcomes you were aiming at.\n\nEven if your coaching arcs have been more ad-hoc and what comes across your bow, then a timeline comprising the \"wins\" you have had and the core (lean) business impact (the why?) is the way to go.",
          "score": 1,
          "created_utc": "2026-01-26 19:20:02",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qkrw44",
      "title": "Feature Prioritization: Representative Democracy or a Authoritarian State?",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1qkrw44/feature_prioritization_representative_democracy/",
      "author": "AgileEvolves",
      "created_utc": "2026-01-23 14:13:58",
      "score": 5,
      "num_comments": 19,
      "upvote_ratio": 0.86,
      "text": "Had a great question posed about this and I know what I think. Open to other views. \n\nHow do you view feature prioritization by Product Managers or Product Management?\n\nHow do you perform it or seen it performed?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1qkrw44/feature_prioritization_representative_democracy/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o19k0fa",
          "author": "LightPhotographer",
          "text": "Definitely not a democracy - do that and you get a product designed by committee and it's absolute horror. \n\nThe product owner is the Single Wrenchable Neck, meaning one person to make the call, one person to explain them (and base them on data) ... and responsible also means accountable. \n\nIt's like the captain on a ship. The fact that he has final authority does not mean he can run the ship alone, or that the insights of the others are not valuable.   \nBut at some point you have to make the call and a democracy leans itself to lengthy discussions and wheeling and dealing.",
          "score": 11,
          "created_utc": "2026-01-23 16:40:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1b5p04",
              "author": "99ProllemsBishAint1",
              "text": "This is the answer. At some point discussion ends and they need to make the call and then be supported by those around them.\n\nMany years ago I heard an executive say that they needed to know whose neck to squeeze if something goes wrong. It helped me recognize accountability gaps. I'm happy to see that concept in other places",
              "score": 2,
              "created_utc": "2026-01-23 21:06:55",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1bofmi",
                  "author": "LightPhotographer",
                  "text": "I notice two things. When it's unclear who should take the decision, it's debated at great length and everybody feels their opinion counts.\n\nWhen someone does take a decision, you would expect a lot of discontent, based on the amount discussion. But actually a lot of it evaporates, people are happy that a decision has been made (they can probably see both sides, and they're happy they are not the one making the call).",
                  "score": 2,
                  "created_utc": "2026-01-23 22:36:05",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o1xfnxc",
              "author": "Fugowee",
              "text": "Single neck to wring.\nSingle nectarine.\nFwiw",
              "score": 1,
              "created_utc": "2026-01-27 00:45:15",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o18pvlg",
          "author": "Budget_Pin5828",
          "text": "Neither. Data Driven  \nAs a PdM I'm accountable for the prioritization of my Product backlog, but realistically, I can't do it on my own.",
          "score": 9,
          "created_utc": "2026-01-23 14:19:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o19ee06",
              "author": "ratczar",
              "text": "Yes. It's only in absence of data that it becomes this kind of choice. \n\nDemocracy is particularly stupid, though. If you're getting a broad range of inputs you should be able to assemble a broad range of data, if only through NLP and sentiment analysis.",
              "score": 4,
              "created_utc": "2026-01-23 16:15:47",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o18qmj9",
          "author": "Fr4nku5",
          "text": "Maybe unpack a bit more:\n\n* Who posed the question and in what context?\n* What do you think and why you're looking for others responses? \n* What you think the difference is between product managers and product management?\n* Why are the two options 'representative democracy' and 'authoritarian state'? \n* Are those the only two options?",
          "score": 5,
          "created_utc": "2026-01-23 14:23:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o19ty4d",
              "author": "AgileEvolves",
              "text": "Answer the question or not. There is no try. 😉",
              "score": -1,
              "created_utc": "2026-01-23 17:26:48",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o19v2ue",
                  "author": "Fr4nku5",
                  "text": "Oh in that case the answer is \"7 ht - 13.4\"",
                  "score": 1,
                  "created_utc": "2026-01-23 17:32:00",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o19r735",
          "author": "flamehorns",
          "text": "It shouldn’t matter who does it , it should be based on a solid business case with numbers and some kind of prioritization model . The priority you end up with should be independent of who does it.\n\nIf 2 different people came up with completely different ideas about priorities I would see this as an issue. The whole company should have a good understanding of the goals of the organization and that should be reflected in an understanding of the relative priorities of all the high level initiatives and that should inform most prioritization decisions.\n\nAt some point thought it doesn’t really matter you can let the team decide on what order to go things in based on technical risk or something.",
          "score": 2,
          "created_utc": "2026-01-23 17:13:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1adolg",
          "author": "PhaseMatch",
          "text": "First comes the product vision  \nThen comes the business roadmap  \nThen comes what \"user benefits\" we are targeting  \nThen comes the customer buying and promotional cycle  \nThen comes a \"lean feature\" canvas and high-level sizing  \nWhat to do next kind of falls out from that.",
          "score": 2,
          "created_utc": "2026-01-23 18:55:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ev2zz",
          "author": "UKS1977",
          "text": "Like a proper government. Input from all, decision by one.",
          "score": 2,
          "created_utc": "2026-01-24 11:58:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o19a1jm",
          "author": "jesus_chen",
          "text": "The only opinion that matters is that of the end user answering this question: did you provide value?",
          "score": 2,
          "created_utc": "2026-01-23 15:56:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o19rgmn",
          "author": "BoBoBearDev",
          "text": "In my org, it is none of my org's business. My org is just a sweatshop contractor, we don't have commercial products. Meaning, the client is another company that pays us, a single entity. We have zero control over it. We prioritize based on them. I mean sure, we can prioritize our way, but why the fuck we we do that? That's stupid.",
          "score": 1,
          "created_utc": "2026-01-23 17:14:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o19y09a",
          "author": "AgileEvolves",
          "text": "These are all great comments. Thanks to all who took the time.",
          "score": 1,
          "created_utc": "2026-01-23 17:45:25",
          "is_submitter": true,
          "replies": []
        },
        {
          "id": "o1bbesc",
          "author": "mrhinsh",
          "text": "I don't think feature prioritisation is a democracy *or* an authoritarian act. That framing already assumes the wrong problem.\n\nIn Scrum, prioritisation is an **accountability**, not a voting exercise and not a power grab.\n\nPolitically, it maps closest to **technocracy with delegated authority**: decisions are made by the person accountable for outcomes, informed by evidence and expertise, and constrained by transparency, not popularity.\n\nThe Product Owner is accountable for maximising value. That means:\n\n* synthesising customer evidence, market signals, risk, and constraints\n* making trade-offs explicit\n* ordering work based on outcomes, not volume or loudness\n\nTeams don't vote on priorities because accountability without decision authority is meaningless. But equally, good Product Owners don't operate in isolation. They rely on:\n\n* Developers to surface technical risk and feasibility\n* Stakeholders to provide context and demand signals\n* Evidence from real usage to invalidate assumptions\n\nWhen prioritisation feels authoritarian, it's usually because strategy is unclear, feedback loops are weak, or the backlog is treated as a demand intake queue instead of a hypothesis list.\n\nWhen it feels like democracy, it's often because no one is actually accountable for outcomes.\n\nThe healthy pattern is neither.\n**Accountable technocracy under transparent constraint.**\n\nIf prioritisation can't be explained in terms of value and learning, it's broken, regardless of who made the call.",
          "score": 1,
          "created_utc": "2026-01-23 21:33:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1lskuh",
          "author": "Alpheus2",
          "text": "Neither. Get data on the impact on bottom line (costs, revenue, opportunities, competitive afvantage) and divide responsibilities.\n\nUsually in large companies it’s a handful of people drawing strategic interests then being supervised and handed off to individual leaders, who then delegate in their sphere of influence.\n\nIn startups and smes it’s usually one person driving strategy on a main axis and negotiating tradeofs on other axes. Example: CPO driving innovation interests while the CTO and COO claw back on resourcing compromises.",
          "score": 1,
          "created_utc": "2026-01-25 12:05:29",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qipgu6",
      "title": "Free retrospective formats that actually surface real issues",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1qipgu6/free_retrospective_formats_that_actually_surface/",
      "author": "easy-agile",
      "created_utc": "2026-01-21 05:35:20",
      "score": 4,
      "num_comments": 23,
      "upvote_ratio": 0.59,
      "text": "Hey r/agile \\- I work at Easy Agile and we've been collecting retro formats from teams for a while now. We built a free tool (Easy Agile Review) but honestly the formats themselves are useful regardless of what you use to run them.\n\nSome that consistently work well:\n\n* **Sailboat retro** \\- what's pushing you forward, what's holding you back, what risks are ahead\n* **4Ls** \\- Liked, Learned, Lacked, Longed For (good for reflecting on learning)\n* **Mad, Sad, Glad** \\- helps surface emotional blockers that \"start/stop/continue\" misses\n\nThe ones that tend to fall flat:\n\n* Start/Stop/Continue when it becomes too routine\n* \"Roses and thorns\" when teams aren't psychologically safe yet\n\nWhat formats have actually helped your team have honest conversations vs just going through the motions? Always looking to understand what works in practice.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1qipgu6/free_retrospective_formats_that_actually_surface/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o0u6s7x",
          "author": "Sky_Linx",
          "text": "Honestly, I've come back to plain plus/delta more times than I can count. The fancy formats are fun to try but they often get in the way.\n\nThe main thing I've noticed is that simpler formats mean people actually think about what they want to say, rather than spending half the time wondering \"wait, is this a 'Lacked' or a 'Longed For'?\" With two columns with obvious and straightforward meaning, there's nowhere to hide and nothing to overthink.\n\nThe other benefit is everything in the \"needs improvement\" column is already pointing at action. You don't have to decode metaphors about anchors and winds to figure out what to work on next.\n\nI also think elaborate formats can feel a bit performative after a while - the novelty wears off and then you're stuck with something complicated that's also stale. Plus/delta just... keeps working.\n\nNot saying the other formats are bad - sailboat can be great for a change of pace - but for week-in-week-out retros, simple wins.",
          "score": 4,
          "created_utc": "2026-01-21 11:35:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0uuvc7",
          "author": "CassiusBotdorf",
          "text": "In all seriousness, all of the retrospective templates are just variations of mad sad glad. Personally, and maybe that's really just me, I see little value different templates add to the process. The process is the thing that adds value.",
          "score": 7,
          "created_utc": "2026-01-21 14:08:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0uxwve",
              "author": "Sky_Linx",
              "text": "Agreed! At the end of the day every format boils down to \"what's working, what isn't, and how do we feel about it\". The wrapper is just packaging.\n\nThe value comes from the conversation and what you do with it afterwards - not from whether you're using a sailboat or 4Ls or starfish or whatever the flavour of the month is. IMO a well-facilitated plus/delta beats a poorly-run elaborate format every time.\n\nIf anything, I think the obsession with finding the \"right\" template can be a distraction from the harder work of actually creating space for honest feedback and then following through on it.",
              "score": 3,
              "created_utc": "2026-01-21 14:24:32",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0v4u20",
          "author": "clem82",
          "text": "I can get in a room without a format and surface real issue\n\n\nThe visual tool is just a tool, the person is how you uncover issues",
          "score": 3,
          "created_utc": "2026-01-21 14:59:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0y45zf",
              "author": "easy-agile",
              "text": "100% agree. I've seen facilitators with zero tools still run amazing retros just by asking good questions and actually listening. The format is scaffolding at best.\n\nThat said, for newer facilitators or teams that struggle with participation, having a structured format can be a helpful crutch until they build that muscle. But yeah, the person matters way more than the pretty template",
              "score": 2,
              "created_utc": "2026-01-21 23:09:43",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0y4jsj",
                  "author": "clem82",
                  "text": "I agree, but I think it comes down to the person.  \n\nIf the person is good with people, they should not force use the tool and think about how to uncover the information. The right SM/facilitator it will come natural to it.  Where the struggle comes in is if they're forcing it",
                  "score": 1,
                  "created_utc": "2026-01-21 23:11:43",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0tj5ec",
          "author": "ya_rk",
          "text": "It's not a format but a meta-structure for retrospdctives in general that I like to keep in mind:\n\nORID - Objective, Reflective, Interpretation, Decision",
          "score": 2,
          "created_utc": "2026-01-21 07:58:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0u7vsr",
              "author": "Sky_Linx",
              "text": "Yeah this is a good distinction. ORID works as a mental model for the facilitator - making sure the conversation moves from facts to feelings to meaning to action, rather than jumping straight to solutions before the problem is properly understood.\n\nI think the key is it stays invisible to participants. If you're explicitly walking the team through \"okay now we're in the Interpretive phase\" it gets a bit workshop-y. But as a guide for how to steer the discussion, it's solid.\n\nAnd it works with any format - you could run a simple plus/delta while using ORID to shape how you facilitate it.",
              "score": 3,
              "created_utc": "2026-01-21 11:44:29",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0thm8v",
          "author": "vcuriouskitty",
          "text": "I hardly follow those formats and I create my own template.\nFor example, today’s retro I used these:\n\n1. Rate the last sprint\n2. Chef’s kiss (what went well)\n3. Oof moments (what went wrong)\n4. Superstars last sprint (kudos/shoutout)\n5. Action items\n\nIt changes every sprint. I was a part of their team as a QA before so I know they don’t like the classic template of sprint retro and they feel more comfortable speaking up when the theme is creative.",
          "score": 1,
          "created_utc": "2026-01-21 07:44:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0u7kcg",
              "author": "Sky_Linx",
              "text": "One downside of changing formats every sprint - you lose the ability to compare retros over time and spot recurring themes. Also adds friction for quieter folks who have to re-learn the format each time instead of just knowing where their thoughts go.\n\nConsistency has its own value, especially if your retro tool has analytics features. Being able to track recurring topics, sentiment trends, and patterns across sprints gives you a much better picture of team health than any single retro can. Hard to do that when you're switching formats constantly - you end up with apples-to-oranges data.\n\nThe best format is probably one that becomes invisible so people focus on the content, not the structure.",
              "score": 0,
              "created_utc": "2026-01-21 11:42:02",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0uhlfk",
                  "author": "vcuriouskitty",
                  "text": "Well, what matters the most is it works for us. The theme changes, but the point of the sprint retrospective remains. Everyone is on the same page, and we’re still able to address the actions items. Our team members are vocal too so 🤷🏽‍♀️ it has always been like this even before I was the SM. If it works, then I ain’t gonna break it. We don’t see any downside.\n\nAt the end of the day, you gotta find what template or format that will make your team feel comfortable to express their opinion and at the same time without compromising the purpose of the retro. It just so happens my team likes creativity.",
                  "score": 1,
                  "created_utc": "2026-01-21 12:52:41",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0vozij",
          "author": "deadmuthafuckinpan",
          "text": "The most useful tool I've found is what I call a Feelings Map because I don't know what it's really called. Basically you plot out the timeline of the project on the x axis with a few key milestones or events identified, then you ask everyone to draw a line indicating how they felt along the way with the y axis going from Fantastic at the top to Scared/Awful/Gonna Lose My Job at the bottom. \n\nThen you, the facilitator, looks for insights or key overlapping sentiments and uses those as discussion points for the group, recording those insights, actions, or learnings along the way. \n\nThis works great at a whiteboard. I've never seen this implemented digitally. ",
          "score": 1,
          "created_utc": "2026-01-21 16:31:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0y4c86",
              "author": "easy-agile",
              "text": "Thank you for sharing. I have never heard of it called Feelings Map but the concept makes sense. Emotional trajectory over time surfaces patterns that point-in-time formats miss.\n\nHave you found this works better for longer retrospectives (end of project/quarter) vs sprint retros? Seems like it needs more time to map and discuss than a standard 2-week sprint retro would allow",
              "score": 2,
              "created_utc": "2026-01-21 23:10:37",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0y5c8a",
                  "author": "deadmuthafuckinpan",
                  "text": "For sure, it's not useful for a sprint retro. But for an end-project retro, or if you're coming in mid-project to turn things around, it can be super valuable. ",
                  "score": 3,
                  "created_utc": "2026-01-21 23:15:55",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0wgvob",
          "author": "Sporknight",
          "text": "When you've been doing retros with the same team every two weeks for two+ years, it can be good to mix up formats!  Keeps things fresh for the team.  \n\nHaving said that, I'll sometimes do a picture/gif retrospective - either offer \\~4 different pictures, and ask people which one represents the past sprint for them the most, or ask folks to find and share a picture or gif of how they felt.  For the former approach, it's interesting to see what different elements people pick out that resonate with them.  For the latter, it can be a little silly and a fun icebreaker, but may not get the deepest, most meaningful results.  However, it can give folks a chance to vent a bit and get some things off their chest (hopefully with a laugh!), paving the way to a more robust conversation where you dig out action items and process improvements.",
          "score": 1,
          "created_utc": "2026-01-21 18:35:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0y4k3n",
              "author": "easy-agile",
              "text": "The gif/picture approach is great for breaking up monotony. Sometimes teams just need permission to be silly for a few minutes before they can get real.\n\nCurious though when you do the picture selection approach, do you intentionally pick images that surface different aspects (technical, team dynamics, external factors)? Or just choose randomly and see what resonates?",
              "score": 1,
              "created_utc": "2026-01-21 23:11:46",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0y7x4c",
                  "author": "Sporknight",
                  "text": "I tend to pick based on a theme, like springtime, travel, or sports, and then have different pictures based on a vibe, like stressed/chaotic, busy but productive, or sunshine and rainbows.  Folks will often pick out something unexpected from a picture that resonated with them, which makes it interesting.",
                  "score": 2,
                  "created_utc": "2026-01-21 23:29:44",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0zyr9a",
          "author": "gemneye73",
          "text": "I usually run a retro by using a Lean Coffee. Theme being focused on what worked well, what didn’t, etc. \nAnd then while discussing, we can do a little bit of the 5 whys. Works pretty well and teams love it because we managed to talk through a few items and get to a decent root cause.",
          "score": 1,
          "created_utc": "2026-01-22 05:42:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o10qyy6",
              "author": "Sky_Linx",
              "text": "Yeah Lean Coffee is solid for keeping things moving - the voting stops retros from getting hijacked by one topic and the time-boxing keeps energy up. Pairing it with 5 whys to dig into root causes is smart.\n\nOnly thing I'd watch for is that voting can bury uncomfortable stuff. If someone has an issue that others don't want to publicly upvote, or it only affects one person, it might never get discussed even if it's important.\n\nDo you do anything to catch those or just trust the important stuff surfaces eventually?",
              "score": 1,
              "created_utc": "2026-01-22 09:51:43",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o14xi3n",
          "author": "recycledcoder",
          "text": "I seldom use templated retros, we mostly just have conversations - but there's one \"template\" I like to throw in at random intervals: \"WTF Just Happened?!\"\n\nNot when something goes wrong or particularly right, mind you - it's just meant to elicit what extraordinary things _may_ have happened that somehow went unremarked upon. Even when it fails to elicit something, it ends up being _at least_ as generative as start/stop/continue, with any luck as good as mad/sad/glad.",
          "score": 1,
          "created_utc": "2026-01-22 23:05:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o189mxl",
          "author": "ringmaster",
          "text": "We’ve “invented” over many years of refinement these categories:\n\n**Kvetches** - Get the complaints out of the way that we know there’s nothing we can do to fix it. Acknowledge them and move on, otherwise the things you have no power to change will consume the whole retro. If they are solvable, they move to Flaws….  \n**Appreciations** - Something or someone you appreciated. Always done last so that you can end on a high note.  \n**Flaws** - Things that went wrong we should try to improve. This is the bulk of the retro, talking through them trying to come up with solutions to try.  \n**Experiments** - Suggestions for changing the way we do things to gain some edge. Usually take just one and try it until next retro to see if it has the expected positive effect.  \n\nWe’re pretty diligent about engaging people’s minds before the retro - “think about what happened over the last couple of weeks” - and creating explicit follow-ups that we re-incorporate into our planning. For example, output from experiments go directly into our bi-weekly planning notes so we never have the “oh, we meant to do that but never did” experience.\n\nAs many are pointing out, the categories are only partially useful as part of a complete retro process.",
          "score": 1,
          "created_utc": "2026-01-23 12:49:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o23uqrd",
          "author": "Sweaty_Ear5457",
          "text": "what's helped us is spatial layouts over lists - i put the retro format visually on a canvas (boat for sailboat, 4 quadrants for 4ls) and everyone drops cards in the relevant section during the call. we do this in instaboard and having everything visible at once keeps the conversation flowing better than sequential updates.",
          "score": 1,
          "created_utc": "2026-01-27 22:43:53",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qoalzn",
      "title": "best way to handle production alerts in task tracking",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1qoalzn/best_way_to_handle_production_alerts_in_task/",
      "author": "Infamous-Coat961",
      "created_utc": "2026-01-27 10:49:42",
      "score": 4,
      "num_comments": 6,
      "upvote_ratio": 0.83,
      "text": "alerts and monitoring tools generate a lot of noise, and translating those into actionable tasks is messy. sometimes a critical incident gets lost in the backlog because the system isnt integrated with dev tracking tools.  \ndoes anyone have a setup where production alerts automatically create backlog items, assign owners, and track resolution and how do you prevent overloading devs while keeping visibility for PMs and ops? ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1qoalzn/best_way_to_handle_production_alerts_in_task/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o1zv1ws",
          "author": "Upset-Addendum6880",
          "text": "key is separating noise from critical incidents. otherwise devs just ignore alerts.",
          "score": 4,
          "created_utc": "2026-01-27 11:04:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1zuixg",
          "author": "Effective_Guest_4835",
          "text": "we automatically create tickets from alerts and tag by severity keeps critical issues from getting lost.",
          "score": 2,
          "created_utc": "2026-01-27 10:59:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2034xs",
          "author": "Canenald",
          "text": "Looks like it's time to re-examine the fundamentals. It sounds like PMs and ops care about the alerts and devs don't. Why?\n\nWhy is there noise? What can you do to reduce it?\n\nWhat is the goal of the devs? How is their performance measured? If they only care about delivering code, they'll never care about production alerts.\n\nHow was the tooling that generates alerts and backlog items picked and set up? Did the devs do it or was it imposed on them because there's a lack of trust?\n\nThe preferred flow here would be:\n\n* Tell devs that the reliability of their software is important, that there is a problem with how it performs in production, and that they need to deal with it (or you will, and they won't like it)\n* Your place here is to make suggestions if you have experience with these things, not to prescribe a solution.\n* Work together to hypothesise a solution to the problem, scope it out, and make sure it's prioritised correctly. You may be surprised. The solution might end up being something else entirely, or you might decide reliability is not important after all if it takes time away from feature factory churn\n* Iterate. The first attempt is always far from perfect. Noise is normal when a team first adopts monitoring software. Work on removing problems that are causing noise, even if those problems are not defects that affect users directly, because noise hides the real defects and erodes our trust in the monitoring solution.",
          "score": 2,
          "created_utc": "2026-01-27 12:07:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1zvgx2",
          "author": "SalamanderFew1357",
          "text": "Auto create for incidents and error spikes, manual for everything else. dedicated triage view + weekly review keeps it manageable while maintaining full visibility.",
          "score": 1,
          "created_utc": "2026-01-27 11:07:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o201w1i",
          "author": "Kri77777",
          "text": "I would dig deeper here. Why does it create noise? How can we reduce the noise and isolate to the actionable? Are there certain thresholds we can measure, summaries or dashboards we can create, groupings we can do, etc.?\n\n\nIt might be worth it to take one or more stories to implement those reductions. The product is not just the end user interface, but the entire system including monitoring and operating standards.\n\n\nWith that noise reduction, then you can focus on the actionable. Obviously, best solution would be to keep taking those as stories to automate to further reduce new/future issues. But yes, if you can reduce that noise, there are a lot of ways to have it added to a tracker. You don't mention what you are using, but as a team you could do some basic research, or again, take a story or so to research and/or implement such a system.\n\n\nBut hopefully, your Product Owner is reviewing these findings and deciding the best course of action - aka, is the reduction in productivity really much of a drain that tradeoffs can be made? Great topic for retrospective.",
          "score": 1,
          "created_utc": "2026-01-27 11:58:19",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qkuzc1",
      "title": "Delivery Manager interview",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1qkuzc1/delivery_manager_interview/",
      "author": "mindovermanauk",
      "created_utc": "2026-01-23 16:12:00",
      "score": 4,
      "num_comments": 9,
      "upvote_ratio": 0.75,
      "text": "For a job I’ve seen online, it mentions the final part of the interview process will involve coming into the office to carry out a presentation. What might that look like?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1qkuzc1/delivery_manager_interview/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o19f9cc",
          "author": "motorcyclesnracecars",
          "text": "If you make it that far in the interview process, they will let you know.",
          "score": 7,
          "created_utc": "2026-01-23 16:19:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1arimf",
              "author": "mindovermanauk",
              "text": "Yeah that makes sense. I’ll have a look into what companies usually expect. As I replied to someone else, this is the first time I’ve looked at applying for this position as I come from QA. Cheers for the answer.",
              "score": 1,
              "created_utc": "2026-01-23 19:59:48",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1q6vv0",
          "author": "icricketnews",
          "text": "Most likely they are going to give you a scenario or ask you to present your overall approach\n\nGreat thing in 2026 you don’t have to worry about creating a presentation (just ask Claude), but focus more on your content, things you already know, you got this!",
          "score": 2,
          "created_utc": "2026-01-26 00:33:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1icwwr",
          "author": "ChocoMcChunky",
          "text": "Just some PowerPoint nonsense which you could knock together with copilot or chatgpt in less than an hour including speaker notes",
          "score": 1,
          "created_utc": "2026-01-24 22:23:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1wi7rn",
          "author": "darknternal",
          "text": "The focus is on assessing executive presence, structured thinking, and real-world delivery judgment, not slide design. Expect a 15 to 30-minute presentation on managing delivery in their environment. Key topics would likely include taking over a failing program, setting up delivery governance, managing risk and dependencies, balancing speed versus quality, collaborating with product, engineering, and stakeholders, and measuring success. They may provide a vague brief to test your ability to scope ambiguity.\n\nThey are evaluating your clarity of thinking, credibility, stakeholder management, practicality, and presence. Your content should have a clear structure, starting with your delivery philosophy and priorities, followed by a simple operating model for planning, execution, risk, dependencies, and reporting. Include concrete examples with outcomes and metrics, explicit trade-offs, and a short 30-60-90 day plan if hired. Avoid jargon unless it directly maps to action.\n\nIn the room, try to be confident but not rehearsed, using minimal slides (think 5 to 8 max). You should drive the narrative, invite questions, try to handle interruptions well, and adjust when challenged or focus shifts. Avoid generic Agile or SAFe theory, excessive slides, lack of a point of view, avoiding hard calls, and treating it like a training session.\n\nUltimately, they are assessing your trustworthiness to manage delivery in messy, visible situations. Your task in that focused interview is to demonstrate judgment, not methodology.",
          "score": 1,
          "created_utc": "2026-01-26 21:59:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1zffq1",
          "author": "Droma-1701",
          "text": "A significant part of the job is stakeholder management, presentations and leading the room in a subject is part and parcel of this.\nThey will give you a subject to present on, if they've already invited you to that meeting (or you're not at an earlier stage but they've told you the format of subsequent stages before you've actually made it that far), then I'm surprised they haven't told you the subject already to start prepping...  If you're unlucky then they are going to give you 20 mins to prep before going to straight in - if this is so, the key is that you JUST PRESENT WELL - they know you're flustered and ill prepared, that's the test, not the content.\nThe subject they want you to present on will normally be a key problem in their business right now, you can often tell what sort of shit show you're walking into just by this...\nUse GPT to get \"top 5-10 key outcomes for [Role] to focus on in a company doing [market vertical]\", DO NOT get copilot to auto gen the presentation: it's paint by numbers, \"3-5 bullets and a picture\" design is obvious a mile out.\nDesign/Variants/Drop Down/Colours/Customize Colours; go to their website, install Colour Picker browser extension and steal their colour scheme hex codes and check their fonts, put them into your PowerPoint deck, you are now branded correctly for their company.  Keep each slide titled succinctly to one of the key points, don't present more than 5 points total, support each point with no more than 3 extra slides, pull in key quotes, process diagrams, etc.  Keep your slides clear of clutter and focussed, Whitespace is King (I've seen people have one word slides that they just talk around for 5 minutes).  Favour a smaller, focussed deck than a large one.  Do not over stay your welcome.  Stand up, speak up, then shut up.\nRead and reread the presentation subject and edit the deck to bring it back to WHAT THEY ASKED FOR - for this role it's probably going to be either \"tell us about this subject\" in which case they've asked for knowledge so give it, but support with \"and then you will solve this problem, or achieve this outcome\"; or it'll be \"how do we get out of this mess?\" In which case give an action plan supported by the reasoning of knowledge.  The second may be couched in \"what would you do in this scenario\" terms but they mean the former - soften the action plan verbage slightly, but it's still an action plan.  You're a Delivery Manager, the clue is in the title, tell them what and how you're delivering for them.\nGood luck, have fun.",
          "score": 1,
          "created_utc": "2026-01-27 08:42:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o19kia6",
          "author": "TheRamblingPeacock",
          "text": "You may have to do a presentation in an office I would guess. \n\nSeriously just as the recruiter that actually knows the answer ffs",
          "score": 0,
          "created_utc": "2026-01-23 16:43:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o19ellx",
          "author": "stefan-m-",
          "text": "..like any other presentation?\n\nDepending on the topic of the presentation, the hiring company likely wants to know how you approach things like how to approach blocking issues for upcoming important deliveries. Without context this question is impossible to answer properly.",
          "score": -1,
          "created_utc": "2026-01-23 16:16:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1arb63",
              "author": "mindovermanauk",
              "text": "Yeah that’s fair enough and as much information as it says on the job spec. This is my first time applying for a Delivery Manager position as I’ve only ever interviewed for QA jobs before (I moved into a Delivery Manager from QA at my current company).",
              "score": 1,
              "created_utc": "2026-01-23 19:58:51",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qod0wj",
      "title": "How accurate are AI meeting summaries compared to what actually happened",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1qod0wj/how_accurate_are_ai_meeting_summaries_compared_to/",
      "author": "Fancy_Bodybuilder697",
      "created_utc": "2026-01-27 12:53:21",
      "score": 3,
      "num_comments": 19,
      "upvote_ratio": 0.62,
      "text": "I rely on my ai meeting summaries pretty heavily at this point. Like, I trust them enough that I often don't even review the full transcript anymore.\n\nBut every once in a while I'll read one and think wait... that's not really what we decided.\n\nThe factual stuff is usually spot on. Names, dates, specific numbers that got mentioned. All captured correctly.\n\nBut the nuance gets lost sometimes. Like the summary might say \"team agreed to move forward with option A\" when really the actual conversation was more like \"team is leaning toward option A but wants to think about it more before committing.\" That difference matters a lot.\n\nStarted doing a quick skim of summaries right after calls to catch these. Takes maybe 2 minutes and I've caught a few things that would've caused confusion later if I'd just sent the summary without looking.\n\nHow much do you trust your ai summaries? Do you actually verify them or just assume they're close enough and move on?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1qod0wj/how_accurate_are_ai_meeting_summaries_compared_to/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o20ha63",
          "author": "Fragrant_Contact_100",
          "text": "As a BA/PM I use AI to summarize so many of my meetings.  Not a single summary goes out unedited by me.\n\nKinda feel like it falls into the old 80/20 rule.  80% of it is spot on, the other 20% could be anything from misidentified nuance to outright conjecture that needs to be removed.\n\nSaves me hours each week of converting notes to summaries.",
          "score": 5,
          "created_utc": "2026-01-27 13:35:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o20oe2h",
              "author": "omgFWTbear",
              "text": "It’s the old “the junior tried real hard but at the end of the day, a senior should make sure some nuance isn’t lost.”\n\nI had a gig where the transcription AI absolutely murdered initialisms, and our org was rife with cross functional teams / input, so virtually every third sentence had two initialisms.\n\nFortunately that *tended* to be a CTRL+H exercise, but every now and then someone’s preference for how to “word” an initialism would mix things up.",
              "score": 3,
              "created_utc": "2026-01-27 14:12:40",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o20i4rl",
          "author": "Budget_Pin5828",
          "text": "I still take notes manually alongside my AI.  And I use my AI to summarize. AI cant pick up things like the look on someone's face when they said something. It cant pick up 'subtext' or 'subtleties'. It cant pick up if someone is behaving differently or unusual. \n\n\nNothing produced by AI leaves my hands without a thorough review by a human.",
          "score": 3,
          "created_utc": "2026-01-27 13:40:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o20uhwo",
          "author": "blackcompy",
          "text": "Somewhat accurate, but not very. It's basically like a motivated intern - great at typing things, not great on contextual understanding or nuance. It's fine for general meetings and tracking information for later, but I wouldn't base a customer contract on it.",
          "score": 2,
          "created_utc": "2026-01-27 14:43:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o20hf7u",
          "author": "Kenny_Lush",
          "text": "No one listens in the meeting - they certainly aren’t going back to read about it. The “meeting notes” are digital garbage from the instant of creation. How is accuracy an issue? We use it for that very reason - so no one has to take notes that no one cares about.",
          "score": 1,
          "created_utc": "2026-01-27 13:36:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o22cfn9",
              "author": "BoBoBearDev",
              "text": "My meeting summary is, the same shit we have been doing for every single sprint planning. Or today's standup meeting shows everyone is on track, okayyy. Or, today's UX meeting, the conclusion is, wait for UX team to update the markup.",
              "score": 2,
              "created_utc": "2026-01-27 18:40:28",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o22dhor",
                  "author": "Kenny_Lush",
                  "text": "Lol. My favorite is when someone goes down a list of tickets and the invariable response to each is “no update.”",
                  "score": 2,
                  "created_utc": "2026-01-27 18:44:54",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o20ns4z",
              "author": "omgFWTbear",
              "text": "On the one hand, it’s intensely rare that I find anyone cares about the notes, wholesale.\n\nOn the other, \n\n(1) when we do, it’s usually the whole thing as a root cause analysis on when where and who began a disaster\n\n(2) more commonly, someone refers to the notes because they forgot *something* often enough.\n\nSo in the old days, whole meetings dedicated to which verb accurately captures the real feeling … clearly a waste based on the return. But, a 2 minute skim to make sure the notes reflect the gist, a value.",
              "score": 1,
              "created_utc": "2026-01-27 14:09:34",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o20pkmw",
                  "author": "Kenny_Lush",
                  "text": "Ah, true - it is a smoking gun when someone deserves a beating. \n\nI’ve always been siloed, so any consensus is a matter of indifference.",
                  "score": 1,
                  "created_utc": "2026-01-27 14:18:40",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o20qilz",
              "author": "AlanOix",
              "text": "Honestly this. My hot take is that most meetings can be summarized by one sentence, and If people cannot remember what was said, then it was not that important to begin with.  \n\nIf it is important but so complex that no one can remember all the details, then AI should not be involved, because if it is not clear in your head, AI might lead you to \"remember\" inaccuracies.\n\nIf you want to have a list of actionables at the end of the meeting, just take 5 minutes at the end to make sure everyone knows what they should do.",
              "score": 1,
              "created_utc": "2026-01-27 14:23:25",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o20v2vl",
                  "author": "Kenny_Lush",
                  "text": "Exactly. Our dailies are mandated from above, so we use the time to bullshit and maybe raise those one-line issues and questions. The ai transcript goes to the facilitators garbage folder.",
                  "score": 1,
                  "created_utc": "2026-01-27 14:46:02",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o20c5lc",
          "author": "sweepers-zn",
          "text": "Good for details of the conversation and rationale for decisions. Actual decisions and actions I would write down myself and have attendees agree on the wording during the meeting.",
          "score": 1,
          "created_utc": "2026-01-27 13:07:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o20qb06",
          "author": "SmartPessimist_PM",
          "text": "I am going to answer your question by telling you something you already know but probably need to hear again. \n\nThe only statement AI gets 100% correct every time is the disclaimer that says:\n\nAI can make mistakes. 🤷🏻‍♂️",
          "score": 1,
          "created_utc": "2026-01-27 14:22:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o211bnd",
          "author": "mondayfig",
          "text": "You are accountable for what you share so reviewing and editing/fixing is part of using AI responsibly. My main experience has been with Teams and Microsoft 365 Copilot and I found that the summaries that are generated by default are of poor quality. Explicitly prompting it with clear instructions often yields much better summaries and list of actions. Still, it does contain mistakes from time to time.",
          "score": 1,
          "created_utc": "2026-01-27 15:15:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2127o9",
          "author": "WaylundLG",
          "text": "My experience is the same - it's really good except when it totally makes stuff up. Quick editing catches and fixes it though. I like that it usually cites the transcript with Gemini so I can go and read it if I need to.\n\nI'm also seeing comments on how theybare useless because the meeting wasn't useful and, while that is sometimes true, I think it's also irrelevant. If you are holding useless meetings, fix your meetings. If all the value of a meeting was in that meeting and you'll never need it again, don't worry about the notes for that one. And for the love of God, stop assuming that since you don't go back and read notes, then no one else does. Some people find it valuable.",
          "score": 1,
          "created_utc": "2026-01-27 15:20:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2133n4",
          "author": "DwinDolvak",
          "text": "I think 80-90%  . they definitely need some human validation/editing (I primarily use Gemini)",
          "score": 1,
          "created_utc": "2026-01-27 15:24:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o22dwir",
          "author": "widowmakerau",
          "text": "More accurate than my note taking, that is for sure.",
          "score": 1,
          "created_utc": "2026-01-27 18:46:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o20a42p",
          "author": "Latter-Giraffe-5858",
          "text": "fellow actually lets you edit the summary if something's wrong or missing context. saved me a few times when the ai missed some nuance. not sure if other tools have that",
          "score": 0,
          "created_utc": "2026-01-27 12:54:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o20a5v2",
          "author": "Select-Print-9506",
          "text": "switched to fellow partly because of this. the summaries capture more of the \"we're leaning toward\" vs \"we decided\" distinction than what i was using before. still worth a quick review but less cleanup needed",
          "score": 0,
          "created_utc": "2026-01-27 12:54:54",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qkskme",
      "title": "Need help in Organizing test across a large group of teams in Agile",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1qkskme/need_help_in_organizing_test_across_a_large_group/",
      "author": "Present_Bat_2050",
      "created_utc": "2026-01-23 14:41:12",
      "score": 2,
      "num_comments": 9,
      "upvote_ratio": 0.63,
      "text": "Looking for testing strategies for 10+ Agile teams building a CRM website. What are effective methods for unit, integration, and system testing when coordinating across multiple teams? Specifically, how can we stagger testing so teams don't just deploy to QA and wait idly for testing resources? Any tips for avoiding QA bottlenecks appreciated!",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1qkskme/need_help_in_organizing_test_across_a_large_group/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o192w1m",
          "author": "Triabolical_",
          "text": "Bottlenecks are inherent in systems with handoffs, and software makes it bad because cycle times are not consistent. \n\nCombined engineering - where the teams own both Dev and test - is the only solution I've seen work well.",
          "score": 6,
          "created_utc": "2026-01-23 15:23:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1943jr",
              "author": "Strenue",
              "text": "This. You will kill your project with too many handoffs. You have to make dev and test in the same team, performed by the same engineers.",
              "score": 3,
              "created_utc": "2026-01-23 15:29:23",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o194yw7",
                  "author": "Triabolical_",
                  "text": "I should probably have mentioned Goldratt's theory of constraints work.\n\nThe goal is a classic book.",
                  "score": 7,
                  "created_utc": "2026-01-23 15:33:24",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1bqnnp",
                  "author": "WaylundLG",
                  "text": "There are many ways to read \"performed by the same engineers\". Not sure which you meant, but generally people should not test their own work. That said, TDD and good code reviews or paired programming can really help code quality. ATDD, BDD, or Spec by example can do a lot to front-load QA and leaves very little QA after development.",
                  "score": 2,
                  "created_utc": "2026-01-23 22:47:18",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o19srv2",
          "author": "LightPhotographer",
          "text": "The QA environment is an inherent bottleneck.\n\nEverybody tested on mocks and stubs. There was a lot of communication between the teams to build and maintain these: If I send you this, how will your component respond?  \nIt seems like a lot of work but it helped to make assumptions explicit.\n\nThe QA environment was running continuously because it was triggered by deployments. But almost everything was already tested within the teams because of the good mocking/stubbing.\n\nAgile is about shortening feedback loops. If you defer that feedback because it's a lot of work then you only get it when the QA is ready for you.\n\nShorten your feedback loops. Then shorten them again. Yes it's expensive. The only thing more expensive is not doing it.",
          "score": 6,
          "created_utc": "2026-01-23 17:21:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1aovz0",
          "author": "PhaseMatch",
          "text": "Stop thinking of QA (quality assurance) as meaning 'testing' as a start point.  \nTesting is QC - quality control;  you uncover the quality is there.\n\nAgile was drawn very heavily from \"lean\" ideas, pioneered by W Edwards Deming.  \nHe pushed back very strongly against test-and-rework cycles and toward build quality in.\n\nAgile technical practices are really defined by XP (Extreme Progrmming), which create a layered \"defense in depth\"  against \n\n\\- building the wrong thing  \n\\- building the wrong thing\n\nThey also work to make change cheap, easy, fast and safe (no new defects), so that if you do build the wrong thing, it's okay, because it's not expensive, hard, slow and risky to fix it.\n\nIn general that means aiming towards\n\n\\- unit, integration and regression tests are automated, and created by developers; XP included ideas like TDD, where you write the unit tests first, then create code to satisfy the tests.  Better designs and defect prevention\n\n\\- continuous integration;  no long-live branches, and code check-ins multiple times a day.  Test automation on the pipelines prevents environment failures, and where it doesn't, that's the priority.  \n\n\\- team collaborations not hand-offs;  while you might have specializations, there's still a degree of cross-functionality so that if the residual manual/exploratory testing you have is a constraint, then others on the team can support  \n\nDon't worry, there's still plenty for technical experts to do on quality.  Seen some interesting stuff on \"mutation testing via AI\" for example - it's an approach that creates modified versions of your code (think flipping a + for a -) so you get to find out how effective your automated coverage really is - and so assuring quality, \n\nBrian Marick's **Agile Testing Quadrants** as expended on by Crispin and Gregory (\"***Agile Testing Condensed***\")is a good starting point.     \n  \nEran Kinsbruner's book \"**Continuous Testing for DevOps Professionals: A Practical Guide From Industry Experts\"** also embraces this concept.\n\nif you want to go deeper, then as other people have mentioned \n\n\\- Theory of Constraints is work a look (**\"The Goal\" - Eli Goldratt**)   \n\\- Lean is pretty key (**\"Out of the Crisis!\" - W Edwards Deming**)",
          "score": 2,
          "created_utc": "2026-01-23 19:47:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1k8eiq",
          "author": "kida24",
          "text": "Quality needs to be built in from the ground up in the system. It can't be an after thought or a toss over the wall to someone else. ",
          "score": 1,
          "created_utc": "2026-01-25 04:32:48",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qmm7xi",
      "title": "Measuring Agile Coaches impact",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1qmm7xi/measuring_agile_coaches_impact/",
      "author": "Specific_Crab3601",
      "created_utc": "2026-01-25 15:34:30",
      "score": 2,
      "num_comments": 37,
      "upvote_ratio": 0.56,
      "text": "How do you guys measured an AC impact? hard to justify the money that is spent on them so id like to understand How others do it.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1qmm7xi/measuring_agile_coaches_impact/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o1n1ypc",
          "author": "mrhinsh",
          "text": "Agile Coaches don’t improve teams directly.\n\nThey improve the **system** teams operate in.  \nIf these metrics don’t move, either the coaching isn’t landing, or the system isn’t actually being changed.\n\nIf you want to measure an Agile Coach’s impact, measure **what the system produces**, not what the coach does.\n\nThese measures don’t exist to assign credit or isolate cause. Outcomes are always influenced by multiple factors. What matters is whether the **conditions for better outcomes** now exist. An Agile Coach’s contribution is indirect by design: they make improvement possible by changing how the system works. Whether improvement is realised depends on whether the organisation acts on what is exposed.\n\nYou could start with:\n\n- **Time to Market (EBM)**  \n  How long it takes for an idea or hypothesis to reach users.  \n  **Why:** Exposes decision latency, batching, hand-offs, and approval drag. These only change when the system changes.\n\n- **Lead Time for Changes (DORA)**  \n  Time from code committed to code running in production.  \n  **Why:** Reveals delivery pipeline friction, testing debt, and organisational bottlenecks that sit beyond any single team.\n\n- **Deployment Frequency (DORA)**  \n  How often the organisation successfully deploys to production.  \n  **Why:** A strong proxy for flow, technical health, and organisational trust, none of which can be improved in isolation.\n\n- **Unrealised Value (EBM)**  \n  Known opportunities that exist but are not yet delivering value.  \n  **Why:** Shows whether the organisation is learning and adapting, or simply executing what it already decided.\n\nYou can also use **Columinity** for team-level metrics that avoid measuring individuals and instead surface stability, interaction patterns, and continuity over time.\n\nIf these measures improve, it does not prove a single cause.  \nIf they do not improve, it does show the system has not changed.\n\nStay away from BS metrics like:\n\n- Velocity  \n- Utilisation  \n- Story points completed  \n- Tasks  \n- Original estimates vs actuals  \n\nThese describe activity. They do not explain results, and they do not change the system.\n\nIf you want to go deeper, read:\n\n- Scrum.org – Evidence-Based Management (EBM)  \n- DevOps Research and Assessment – DORA Metrics  \n- Columinity – Team stability, interaction, and system signals  \n\nFlow metrics would also help a lot.",
          "score": 18,
          "created_utc": "2026-01-25 16:17:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1njjd5",
              "author": "Specific_Crab3601",
              "text": "Columinity is interesting, never heard this word in my entire life😅 How do you work with it?\n\nAs for the rest - I understand and agree that delivery health and overall organisation health is important and measurable, but as you know nowadays everyone is getting laid off and ACs are usually the first to go. My bosses are asking \"How do you know the AC is valuable, that they are the ones driving the change and not team members actually got their shit together\" - and as I know it is ACs, i can see it, you know that numbers are the only thing that are interesting. Was doing the storytelling - behavioral changes, teams cooperation patterns, even Lean waste - none of this is showing the leadership How much is it the work of AC. Devs complete jira stories and they see it getting deployed and driving money, AC even if they show output in Jira doesnt translate to $$$$$$",
              "score": 1,
              "created_utc": "2026-01-25 17:32:51",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1py5pk",
                  "author": "mrhinsh",
                  "text": "I think this argument is kind of irrelevant to how this actually works in real organisations.\n\nIt assumes you can isolate one person and draw a straight line from their work to revenue. That’s not how complex systems work, and it’s not how we measure any other leadership or system role.\n\nDevelopers produce features. Those features can be tied to money.\nAgile Coaches don’t produce features. They work on the conditions that allow teams to produce features reliably.\n\nAsking “how do you know it was the Agile Coach and not the team getting their shit together” misses the point. Teams don’t just magically improve inside the same constraints. When lead time drops, coordination improves, waste goes down, and delivery becomes more predictable, that only happens because something in the system changed.\n\nThat change doesn’t show up as a Jira ticket that maps to dollars. And expecting it to is a category error. We don’t ask architects, managers, finance, or legal to justify themselves in story points either.\n\nSaying “leadership only cares about numbers” also doesn’t really help the case. Numbers show outcomes, not who gets credit. No serious organisation tries to attribute revenue to a single role. They look at whether results improved after deliberate changes to how the organisation works.\n\nIf leadership is asking for a clean $$$ attribution, they’re not actually asking how to measure impact. They’re looking for justification during layoffs. No metric will satisfy that, because the decision isn’t about evidence.\n\nThe only honest question is:\nDid the system produce better outcomes after the coaching started?\n\nIf yes, the coaching mattered.\nIf no, it didn’t, or leadership refused to change.\n\nEverything else is just BS.\n\n---\n\nhttps://columinity.com/",
                  "score": 3,
                  "created_utc": "2026-01-25 23:51:29",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o1n2mee",
              "author": "Extreme_Dragonfly802",
              "text": "+1 to Columninity",
              "score": 1,
              "created_utc": "2026-01-25 16:19:59",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1muqov",
          "author": "CleverNameThing",
          "text": "Results.  Is your product better?  Is delivery fasters?  Are you producing it cheaper?",
          "score": 5,
          "created_utc": "2026-01-25 15:45:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1mwndf",
              "author": "Specific_Crab3601",
              "text": "True but this can be a results of many things, not just the AC",
              "score": 2,
              "created_utc": "2026-01-25 15:54:04",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1n2lqi",
                  "author": "CleverNameThing",
                  "text": "But that is the only question that matters.  Part of the definition of agile means accepting that the best measure of progress is working software, not some simple metric.  The other question I face, and this may not apply to you, is that my agile coach gets ignored.  The operational decisions (e.g., should we be time-boxed or flow-based) are decided by other managers.  How can I hold the AC responsible when they aren't making the decisions that affect agility?  Again, that may not be your issue.  Hopefully you have empowered Scrum Masters (not \"schedule\" masters) who report to qualified Agile Coaches.",
                  "score": 1,
                  "created_utc": "2026-01-25 16:19:55",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1mx3p5",
          "author": "Ouch259",
          "text": "In the old days it was teaching agile methods.  Nowadays it satisfying leadership’s excessive reporting needs without adding work to the team.\n\nIf i can get leadership to show for demos and keep them from asking for burn down charts or story point reporting I consider myself a success.",
          "score": 8,
          "created_utc": "2026-01-25 15:56:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1n67ss",
              "author": "Specific_Crab3601",
              "text": "But are the burndown charts and storypoints needed by the leadership? Why",
              "score": 2,
              "created_utc": "2026-01-25 16:35:27",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1n6rk3",
                  "author": "Ouch259",
                  "text": "They are not needed!",
                  "score": 2,
                  "created_utc": "2026-01-25 16:37:48",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1pgejo",
                  "author": "Euphoric-Usual-5169",
                  "text": "They love simple numbers. That’s why they want them. ",
                  "score": 1,
                  "created_utc": "2026-01-25 22:29:23",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1rlozh",
          "author": "WaylundLG",
          "text": "As someone who had a business selling coaching services, I tried to measure my effectiveness and my employee's effectiveness a lot of ways. What I eventually found worked best was to just commit to results. \n\nOnce we understood the context a bit, we'd talk with teams, managers, leadership and ask them to describe a workplace that was better for everyone. Sometimes it was less stress at release time. Sometimes it was informed and engaged stakeholders, other times it was productivity. Then, if we thought we could help, we'd say \" We think we can help you make X change for Y group in Z months. Here is what you will need to do in order for that to happen. Does that sound valuable to you? When do you want to start.\" Then we would.",
          "score": 3,
          "created_utc": "2026-01-26 05:12:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1mt51d",
          "author": "YAMMYYELLOW",
          "text": "What’s your starting point as a team/org?",
          "score": 2,
          "created_utc": "2026-01-25 15:38:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1mwqbn",
              "author": "Specific_Crab3601",
              "text": "In what way",
              "score": 1,
              "created_utc": "2026-01-25 15:54:26",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1n9v08",
                  "author": "YAMMYYELLOW",
                  "text": "Tell us literally anything about where you’re at as a team or company to understand what the agile coach is walking into",
                  "score": 1,
                  "created_utc": "2026-01-25 16:51:13",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1neejl",
          "author": "DingBat99999",
          "text": "It's important to remember that Deming did NOT say \"If you can't measure it, you can't measure it\". \n\nWhat he actually said was: \"\n\n>It is wrong to suppose that if you can’t measure it, you can’t manage it – a costly myth.”\n\n  \nThere's nothing wrong with asking people: \"Is this coach adding value?\". If they say yes, that can be good enough.",
          "score": 2,
          "created_utc": "2026-01-25 17:10:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1njahp",
              "author": "Specific_Crab3601",
              "text": "It is not for the mgmt😭",
              "score": 2,
              "created_utc": "2026-01-25 17:31:46",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1n7zcd",
          "author": "Specific_Crab3601",
          "text": "Columinity is interesting, never heard this word in my entire life😅 How do you work with it?\n\nAs for the rest - I understand and agree that delivery health and overall organisation health is important and measurable, but as you know nowadays everyone is getting laid off and ACs are usually the first to go. My bosses are asking \"How do you know the AC is valuable, that they are the ones driving the change and not team members actually got their shit together\" - and as I know it is ACs, i can see it, you know that numbers are the only thing that are interesting. Was doing the storytelling - behavioral changes, teams cooperation patterns, even Lean waste - none of this is showing the leadership How much is it the work of AC. Devs complete jira stories and they see it getting deployed and driving money, AC even if they show output in Jira doesnt translate to $$$$$$",
          "score": 1,
          "created_utc": "2026-01-25 16:43:06",
          "is_submitter": true,
          "replies": [
            {
              "id": "o1njx0x",
              "author": "sf-keto",
              "text": "Columinity is a giant checklist of generic questions you can re-arrange & present as a survey to the business & teams. \n\nIt can be anonymous or by team. This way the business knows who to fire when they complain or criticize in the survey. \n\nLook Barry Overeem is a great guy & means well. His big client is Lego & they love his “you want metrics, I’ll create metrics with all kinds of assessments! You can track all kinds of charts with data going up & down in a dashboard!” \n\nThe issue is that these kinds of assessments create vanity metrics. Useless.  They say nothing meaningful about the state of the culture, the product, the team, revenue, or the customer satisfaction.\n\nThe only metrics you need are SPACE, DORA, DevEx, Pirate, Ops, customer satisfaction, and EBITDA. You can add the Scrum Evidence-Based Metrics as frosting. \n\nIf an Agile coach or coaching staff is adding value, SPACE, DORA, DevEx & EBITDA will improve rapidly.",
              "score": 1,
              "created_utc": "2026-01-25 17:34:32",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1oam01",
                  "author": "Specific_Crab3601",
                  "text": "Idk idk, they would probably for a timeboxed transformation project where everything is centrally orchestrated and the change is fast... I would expect a slower change over long time if there is a lot of issues and the resistance is high... And during a slower change mgmt can challenge indirect metrics as not related to AC. No?",
                  "score": 1,
                  "created_utc": "2026-01-25 19:25:52",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1ng7uc",
          "author": "Competitive_Ring82",
          "text": "It really depends on what I've thrown them into. If liquid, look at total displacement. If solid, look at deformation - both to the surface, and the coach.",
          "score": 1,
          "created_utc": "2026-01-25 17:18:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1vp05n",
          "author": "PhaseMatch",
          "text": "Agility is not an end in and of itself\n\n\\- avoid using data that reinforces the \"software and IT is an ivory tower\"  \n\\- focus on data that impacts the bottom line of the business\n\nGrowing and sustain a deep, meaningful collaboration between \"the business\" and \"the team(s)\", and indeed \"the users\" if that is a different group is key to using agility to \"move the dial\" on the overall business.   \n  \nWhile there is a lot of data you will use to help guide improvements, you need to \n\n\\- worry less about tactical and operational stuff within the teams and departments  \n\\- focus more on how this contributes to the overall business strategy and KPIs",
          "score": 1,
          "created_utc": "2026-01-26 19:50:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1xbeuy",
          "author": "DaLeprechaunDon",
          "text": "AC here. It’s shifted a lot in the 10 years I’ve been doing it. Many people here are saying the right things. Used to be reaching the “book”, following strict ceremony guidelines, R&R, etc. \n\nNow it’s more of coaching other roles to find better ways to operate within the system. Are there improvements the system should do? If they do then what will improve? Can we be consistent and predictable? We are often in higher level meetings and a bridge between the team and their managers and other leadership roles. Manager dogging somebody? AC should step up. Product team keeps forcing unclear and unplanned work last minute? AC should step up. \n\nThe golden moment is when you don’t need to do any of this anymore and then hopefully you can move up or move on.",
          "score": 1,
          "created_utc": "2026-01-27 00:23:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1p5gkv",
          "author": "Complete-Cricket-351",
          "text": "TBH I suspect your bosses are correct I've never seen agile coaches achieve much apart from politics and I've seen them in half a dozen orgs.",
          "score": 0,
          "created_utc": "2026-01-25 21:40:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ngxkp",
          "author": "rashguir",
          "text": "4 keys (DORA) is my goto metric to measure improvment in a team or an organisation",
          "score": 0,
          "created_utc": "2026-01-25 17:21:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1oar6k",
              "author": "Specific_Crab3601",
              "text": "That was my first idea too but mgmt said its not directly showing the impact of AC",
              "score": 1,
              "created_utc": "2026-01-25 19:26:31",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1nlbig",
          "author": "ya_rk",
          "text": "It's not only delivery, it's also sensing and responding to product realities. Do priorities ever change, and when they do, how quickly can the product group respond to the change? Delivering rapidly is important, but it's insufficient when its very easy to deliver the wrong thing. For teams, the ability to completely change the topic of work from sprint to sprint is one measure. If they always need time to wind down previous work and ramp up new work, that's a problem. For the PO, If  they are busy with defining work for the team rather than evaluating the product signals and metrics and responding accordingly with priority changes, that's another problem. If the PO is changing direction every sprint (the other extreme of not changing at all) that's also a problem.",
          "score": 0,
          "created_utc": "2026-01-25 17:40:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1wgzf8",
          "author": "forestcall",
          "text": "Nahhhhh - Everything is different. I think the way teams work is completely changed. Ai is making it so a Customer Support manager or even a hourly temp worker can log into a company Kanban Dev Tool like \"Auto Claude\" and make changes and a Worktree is created and then the dev team can check the work. Now Project Owners can create mockups to get their idea across unlike any time before. Agile and SCRUM needs to be completely reimagined. In my mind to disagree means you are not aware of whats going on in the AI coding space. u/mrhinsh for example is partly correct but the ideas are completely outdated. I can build extremely complex Rust features that would have taken 6 months with a team of 9 in less than 5 days by myself.",
          "score": 0,
          "created_utc": "2026-01-26 21:54:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1xd80q",
              "author": "mrhinsh",
              "text": "AI absolutely accelerates execution.\n\nIt does not change decision rights, funding models, governance, risk tolerance, or the speed at which value reaches users. Those are system properties.\n\nAgile coaching exists to change those properties, not to make individuals type faster. That is why its impact shows up in system outcomes, not personal productivity anecdotes.",
              "score": 1,
              "created_utc": "2026-01-27 00:32:45",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1p50d9",
          "author": "EngineerFeverDreams",
          "text": "Easy. They are parasites. So, everything they do, double the cost.",
          "score": -2,
          "created_utc": "2026-01-25 21:39:00",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}