{
  "metadata": {
    "last_updated": "2026-01-18 16:49:53",
    "time_filter": "week",
    "subreddit": "agile",
    "total_items": 16,
    "total_comments": 228,
    "file_size_bytes": 300258
  },
  "items": [
    {
      "id": "1qdh744",
      "title": "After talking to hiring managers at Fortune 100 companies: Agile transformation is basically over",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1qdh744/after_talking_to_hiring_managers_at_fortune_100/",
      "author": "Maverick2k2",
      "created_utc": "2026-01-15 11:34:59",
      "score": 112,
      "num_comments": 80,
      "upvote_ratio": 0.89,
      "text": "The current state of the Agile market - based on conversations I’ve had with hiring managers at Fortune 100 companies.\n\n**Q: Do you need people to implement agile ways of working?**\n\nA: No. We’ve spent the last few years investing in our transformations. Now we just need people to focus on delivering the work.\n\n**Q: What would you like Scrum Masters to focus on?**\n\nA: Helping to put together delivery plans, facilitating the ceremonies, and making sure the work gets delivered on time.\n\n**Q: Is there scope to transform ways of working beyond team level?**\n\nA: No. We already have a framework in place and expect people to work within it. Any change can impact programme-level metrics and be disruptive.\n\n**My take:**\n\n**You can complain on principle that the role is no longer transformation-led. But if that stance doesn’t bring food to the table - and companies clearly don’t want it - what’s the point? You are just spreading misinformation and killing people’s livelihoods.**\n\n**Agile Coaches had the opportunity to coach this properly while leading transformations. Frankly, many messed it up. After all these years, if organisations still don’t understand the Scrum Master role, that failure sits with the people who were meant to teach it and ensure it was implemented correctly.**\n\n**You can’t spend a decade leading transformations, fail to translate the value in business terms, and then be surprised when leadership reverts to delivery-first roles.**",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1qdh744/after_talking_to_hiring_managers_at_fortune_100/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "nzpt83e",
          "author": "Big-Chemical-5148",
          "text": "This tracks with what I’m seeing too. A lot of big orgs feel done with Agile and now just want predictable delivery. The language changed from transformation to execution.\n\nIt doesn’t mean Agile is dead, just that the market moved on. Scrum Masters and coaches who can translate this into planning, risk management and getting work shipped are still valuable. The ones stuck in theory or ceremony for ceremony’s sake are the ones getting squeezed out.",
          "score": 21,
          "created_utc": "2026-01-15 12:25:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzptba9",
              "author": "Maverick2k2",
              "text": "Correction - Agile transformation as a role is dead.\n\nDelivering work in sprints is not.",
              "score": 15,
              "created_utc": "2026-01-15 12:26:23",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzpu0s1",
                  "author": "Hopelesz",
                  "text": "Indeed, a lot of us in larger companies took what works in agile for us and build a process around it. Each company will design a process that works for them, who in their right mind would try to 'apply' agile by the book? This never made sense.\n\nSprints on the other hand, have a good chunk of benefits to a working stream regardless of how the process is rounded up.\n\nIn my teams, the term agile coach is a joke. We have prodduct owners and delivery managers that understand how to move requirements from our stakeholders to the teams and focus on quick wins. This is what companies want. The idea of an agile coach has no value.",
                  "score": 13,
                  "created_utc": "2026-01-15 12:31:23",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzppx49",
          "author": "DingBat99999",
          "text": "My feelings:\n\n* Agile is basically dead. Oh, there will always be pools of high performing agile organizations that \"get it\". But as a large scale movement? It's dead, Jim.\n* Most organizations have successfully resisted changing to become more agile. If they're lucky, they have pockets of agility encompassing a product, or a team, but the overall impact is probably minor.\n* As you say, most agile coaches/champions failed to convince stakeholders of the benefits of changing, or, if they did, managed to carry through the changes. Whether or not that is the fault of the coaches or if they were mostly doomed from the start, I'm not equipped to judge.\n* I can't simply point to failures at the management level. If you look at the kinds of posts seen here in this sub, and others, it's tragic. Endless arguments over story points. Definitions of Ready and other \"agilified\" phase gates. Cargo cult approaches to methods. Scrum Masters who are essentially meeting schedulers. Complete lack of any sort of organizational feedback loop with actual change.\n* The rank and file of our industry largely rejected adopting agile as well.\n* We never drove the idea that software could be managed like a factory production line out of the industry and, given the current economic trends, it might actually be even more entrenched now. I'm still having arguments about basic ideas like slack in plans that I had two decades ago.\n* I'll always wonder if Beck & co had productized XP in the same way Scrum was productized. Could it have won the agile wars? Probably not. In my experience, most developers talk a good game about professionalism, but don't really want to put in the effort.",
          "score": 46,
          "created_utc": "2026-01-15 12:01:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzq5qyx",
              "author": "paul_h",
              "text": "Yup, XP is the best - thin vertical slices for the win!!",
              "score": 7,
              "created_utc": "2026-01-15 13:43:10",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzx7coe",
                  "author": "ContactExtension1069",
                  "text": "XP is great, helped us with PR nightmares.",
                  "score": 1,
                  "created_utc": "2026-01-16 14:06:34",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nzznczz",
                  "author": "luettmatten",
                  "text": "XP is part of the Agile family.",
                  "score": 1,
                  "created_utc": "2026-01-16 20:48:08",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nzrdbft",
              "author": "aefalcon",
              "text": "The sad thing is, most of the content of Extreme Programming Explained can be used within scrum.  Scrum.org's Professional Scrum developer test is at least 50% XP questions.  I just cannot get anyone to read that book.  I didn't read it until I was something like 12 years into the industry though.  However, I was given \"Mythical Man Month\" by a CTO 10 years before that.  Maybe I just need to order a pallet of XP Explained and gift it to everyone, lol.",
              "score": 6,
              "created_utc": "2026-01-15 17:11:00",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nzps5bf",
              "author": "Maverick2k2",
              "text": "It’s fine if Agile hasn’t been implemented as intended across industries.\n\nBut for people within the Agile Community to then go around bash anyone who is not actively transforming orgs is pathetic. \n\nIf Scrum Masters are not being paid to transform an org , then they can’t be held to that standard and told by people thar they are shit at their jobs.\n\nTraditional textbook Agile ways of working is also not the only only way to run an org. Many of these orgs not doing it properly are earning billions.",
              "score": 8,
              "created_utc": "2026-01-15 12:18:06",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzptb0q",
                  "author": "DingBat99999",
                  "text": "Meh.\n\nMany of these orgs earning billions were earning billions before anyone mentioned agile. The question is: Would they earn more if they were more agile? This is, of course, unanswerable.\n\nThe sign of a strong organization is how resilient they are in hard times. Earning billions alone isn't enough of a metric to warrant celebration, at least if measuring the impact of agile is the topic.\n\nBut adopting Scrum with the clear intention to reject change is.... not the smartest move. The Scrum Master IS a transformative role and always has been.\n\nAs for calling them \"shit\", I wouldn't do that for attempting to transform their organization and failing. All SMs have failed at that at one time or another. I call them \"shit\" for not developing the tools to even begin to have such a conversation.",
                  "score": 10,
                  "created_utc": "2026-01-15 12:26:20",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nzwu7o8",
              "author": "TheMagecite",
              "text": "Most places just completely butchered what agile is.  They put things like scrum on it and pretended it adhered to the good concepts.\n\nActually read the manifesto and you will realise just how wrong most places are.\n\n  \n[Manifesto for Agile Software Development](https://agilemanifesto.org/)\n\n\n\nHowever they blame agile, not their incopentance in trusting and hiring good employees.",
              "score": 2,
              "created_utc": "2026-01-16 12:53:08",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nzv9xac",
              "author": "Colt2205",
              "text": "The company I work for has daily standups with a scrum guy apparently under this particular team.  I'm not too into it as I got enough interruptions and already self manage using an excel sheet, which is basically a long term planner with estimates on completion and milestones.  I break off the smaller stuff and sub-items into one or two week estimated completion windows.",
              "score": 1,
              "created_utc": "2026-01-16 05:10:58",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nzy7n70",
              "author": "AdministrationWaste7",
              "text": "idk what people mean by agile failing.\n\na majority of orgs are implementing some form of agile methodology SOLD TO THEM by \"agile coaches\".",
              "score": 1,
              "created_utc": "2026-01-16 16:54:32",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzpw2w2",
          "author": "lakerock3021",
          "text": "Yeah, agreed with some specifications: the industry of Agile Transformation is slowing down (call it dead if you want to, idc) but Agile as an approach is becoming the current standard- hear me out:\n\nBefore Agile, software delivery was molded after manufacturing projects of the time, where start to delivery was 2-3 YEARS. Big huge investigative plan, ruminating internally to identify ALL the details, the pitfalls, exactly when who would be doing what. THEN execute the plan for 2-3 years and SEE if you could sell the product or if your users liked the new version (think Windows 95, Windows 98, Windows 2000... bulk build, release). \n\nNow, while there are still orgs who build software this way, most (granted limited sample size) are building much more Agile delivering multiple times a year, if not month. There is more receptivity to the ideas in the Agile Manifesto, there is more alignment with the Agile principles (regardless of if they are referenced).\n\nAgile mindset is a competitive advantage.\n\nIf you want to talk about frameworks of Agile (Scrum, Kanban, XP) sure these are not doing well (if even used correctly) and as you mentioned thousands of SM were \"paraded around\" to signal that a company was using Scum without going through the challenge that is a transformation (put makeup on a pig). I don't personally blame the Scrum Masters- they were dropped in a chaotic situation, but that is a rant for another time. But yes, there is a significant decrease in the opportunity for a \"Scrum transformation\" (maybe the same, just fewer orgs dressing up to \"play Scrum\" since it is no longer the fad).\n\nThere is still opportunity for organizational and department and team transformation- but as you made note of, it's not the ONLY accountability orgs are looking for from the SM or Agile Coach role. Some of that is moving to management, some orgs are asking for facilitation, delivery scheduler, and transformation. Just not enough appetite for it to be a full time role (and, c'mon look at the industry track record for \"transformation\")",
          "score": 7,
          "created_utc": "2026-01-15 12:45:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzu1zl3",
              "author": "Venthe",
              "text": "What we've seen is the ploriferation of companies that are able to leverage modern practices, like CI/CD pipelines, containerization, cloud and - for better or worse - shift left testing to adapt to the instant delivery/internet era.\n\nWhat we generally don't see is the companies \"uncovering the better ways of delivering the software\". Practices remained the same, only that the goals are now split into two weeks chunks; and the quality is down the drain.\n\nEven if it's somewhat aligned with the agile principles, I am fully convinced that this is only a coincidence - or rather - better tooling + market pressure reduced the frequency of delivery, nothing else.",
              "score": 3,
              "created_utc": "2026-01-16 00:52:51",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o039w49",
                  "author": "Maverick2k2",
                  "text": "A lot of companies accept that there might be delays , at which point, and if urgent, they get teams to work overtime. \n\nReality is a lot of orgs do not need to have perfect delivery processes, the strength of their product offerings means they will make billions anyway.",
                  "score": 1,
                  "created_utc": "2026-01-17 11:44:43",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzpvtny",
          "author": "davy_jones_locket",
          "text": "There's a lot of misconceptions about Agile transformation as a whole. \n\n\nStartups dont need transformations. They were born within Agile. \n\n\nEvery transformation I've been a part of since 2013 has been \"these are the boundaries of which we work, how can we adopt more agile ways of thinking within these boundaries?\" Sure you may have opportunities to push those boundaries, but at the end of the day, Scrum isn't the only flavor of being agile, you don't need a dedicated scrum master or product owner (I've held both roles at the same time for different teams with a completely different title within the org), and \"textbook agile\" is literally just the agile manifesto. \n\n\nIf you're trying to find a job with a title of agile coach, scrum master, product owner, etc... those days are long gone. They are folded into the responsibilities of other titles. Tech leads and engineering managers often serve as scrum masters. Engineering managers and product managers often serve as product owners. Engineering managers often serve as agile coaches. \n\n\nThis is why we said scrum master, product owners etc weren't entry level roles... Because engineering manager isn't an entry level role. Because tech lead isnt an entry level role. Sometimes product management can be. ",
          "score": 5,
          "created_utc": "2026-01-15 12:43:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzw1ypc",
              "author": "Maverick2k2",
              "text": "I agree that SM is not an entry level role. It is what it is though and a reflection of shit transformation.\n\nHere is thing though , the Agile community had their chance to do things properly when Agile transformation was the craze. We only have ourselves to blame now that the market has moved on for not guiding companies the right way.\n\nEarlier on in my career , I remember working in companies that had a legion of Enterprise Agile Coaches. What the hell were they doing?",
              "score": 2,
              "created_utc": "2026-01-16 09:03:14",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o021c3s",
                  "author": "Affectionate-Log3638",
                  "text": "My organization threw tons of people into agile roles that had zero experience in them. Primarily project managers. I think things would have been rough but gotten better if they actually had agile mindsets and were willing to learn and adapt over time. But most of them were rigid and carried ways of thinking that completely undermined agility. All of our coaches, RTEs, and most of our Scrum Masters held/hold on to out-of the-box SAFe for dear life. They kept and continue to keep stuff that clearly didn't work, and never fully fleshed out generic concepts that could work with more development.\n\nAnd then you have consultants coming in with deeper knowledge of agile, but zero understanding of our organization's structure or culture. So they have zero idea how to apply any of it in a meaningful way. We spun all of these ridiculous ARTs that make zero sense from a workflow perspective, ripping teams from their natural habit, forcing them to \"collaborate\" with teams they have zero commonality with. I've been going off on our RTE and Portfolio Manager every week (as a PO) because they keep expecting my team to deliver on stuff we literally don't have the knowledge or skillset for.\n\nMy organization has been undergoing its transformation for seven years with 20 different trains at this point across our massive organization. Every train gives the same spiel about \"things getting better as we mature\". But I have not seen a single train reach any level of maturity. There's entry level Scrum Masters everywhere that know nothing, RTEs that have no idea how to improve ARTs, and tone deaf coaches who occasionally run some half-baked educational sessions that lack substance.",
                  "score": 1,
                  "created_utc": "2026-01-17 05:07:29",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzpsghi",
          "author": "Trustadz",
          "text": "Of course change is going to be disruptive. If not then why change in the first place?\n\nIn all seriousness, agile is long from dead in my experience but I’m heavily bias to my work area. Transformations are still rolled out, lots of coaching especially on higher level management. And I think agile will shine more brighter when the current group of middle managers who “get it” will get into senior management roles.",
          "score": 3,
          "created_utc": "2026-01-15 12:20:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzpt5u6",
              "author": "Maverick2k2",
              "text": "Been following this since 2016.\n\nI am sure there are some companies might be doing it well, which I suspect are start ups. But from experience,  the companies I interview for , top tier , highly competitive companies are not. \n\nGo and have a look at the FAANGs, and ask yourself if it is all about having self-organized cross-functional teams then why are they are hiring Project and Program Managers?\n\nFrom interviewing with FAANGs, the only thing they seem to like about agile concepts are the sprint cycles.",
              "score": 3,
              "created_utc": "2026-01-15 12:25:19",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o023d4o",
              "author": "Affectionate-Log3638",
              "text": "I'm not convinced there's enough of us that \"get it\". And many of the ones that don't are ruining the young impressionable ones who could do some good with proper development.\n\nMyself and my current SM came to our current team from a team that wasn't on an ART, so we had some creative liberties. I developed some processes to automate a lot of the manual labor agile teams in our old department were doing in Jira. Myself and my Scrum Master presented those things to the RTE and Portfolio Manager (the SM's boss) on our current train. They shot them down for no reason. The next week my SM told me his boss said he was \"spending too much time with me\".\n\nI have a PO that I work hand in hand with (same boss) who is equally creative and even more experienced than me. We're super vocal in things like Inspect & Adapt, with other teams saying they appreciate what we bring, even attempting to adopt our practices.....The RTE has referred to the two of us and our boss as \"a contagion\".\n\nThe RTE and Portfolio Manager have been meeting with the two of us every month for several months now. It feels like they're trying to silence us and keep us from spreading our ideas. (Because evidently new ideas are bad.). They try to convince us the ART is doing things \"the right away\"....That being said, their knowledge and experience can't hold a candle to either one of us, let alone both of us at the same time. We absolutely thrash both of them every time we meet.\n\nI think there's are some really good people trying to make the climb that could do great things if they got to the senior level. But I'm not sure if this framework will even salvageable by time they get there.",
              "score": 2,
              "created_utc": "2026-01-17 05:22:28",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o03a9h2",
                  "author": "Maverick2k2",
                  "text": "Sorry you are going through this.\n\nPerfectly ties to my 3rd point - companies have a framework and want you to work within it. In other words, it sounds like your role is not aligned with transformation but making sure the work gets delivered while accepting how the current landscape is structured.\n\nLet me guess, you are low in the org chart?\n\nIf so , try to understand it from your manager’s , manager position - his reportee is trying to change ways of working without his involvement. How do you think that comes across? \n\nDon’t you think they think it’s their job to be setting strategy and direction for the team?",
                  "score": 1,
                  "created_utc": "2026-01-17 11:47:51",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzqij7y",
          "author": "sf-keto",
          "text": "Welcome to 2022, OP. This has been going on for 4 years already. Good luck. If I were you, I’d stop even using the word “agile.”",
          "score": 3,
          "created_utc": "2026-01-15 14:49:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzr9mlz",
          "author": "liquidpele",
          "text": "Thank god.   Agile was co-opted by micro managers and spawned whole jobs of bullshit like \"scrum master\" and \"TPO\" and \"PM but just for your team\" etc.   So of course it failed, it turned into micromanagement with useless positions that just slowed everything down and created BS work.  But the biggest reason is the degradation of engineer quality... as people hire cheaper and cheaper and outsource and the like, agile works less and less because it requires people who care and are at least somewhat independent in their jobs.",
          "score": 3,
          "created_utc": "2026-01-15 16:54:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o03b49p",
              "author": "Maverick2k2",
              "text": "At the core of it , agile is very simple . It is about incrementally and continuously work, and adapting your delivery process so that you can try to do it more efficiently.\n\nThe problem is where you have agile coaches and scrum masters who get so anal about the agile practices, that everyone else starts to wonder if they are worth investing in. The constant debates about story pointing and how it should be precisely done when the rest of the business doesn’t give a shit about it, is an example of this.",
              "score": 1,
              "created_utc": "2026-01-17 11:55:00",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzse9cp",
          "author": "PhaseMatch",
          "text": "My take - \n\n\\- **\"Agile Transformations\" will always lead to the \"limits to growth\" systems thinking archetype**;  that's because most organizational change models focus on \"quick wins\", and when you do that, the hard stuff never gets addressed\n\n\\- **the hard stuff tends to be control systems, power structures, and the overall view on work, utilisation, value and motivatio**n; those parts of (Johnson and Scholes) cultural web don't get touched, so you end up with \"what we had before with new job titles, new artifacts, and new events\" mostly  \n\n\\- **there's insufficient emphasis on professional development**; agility requires significant technical and non-technical skills to be embedded at a team level. Most \"agile training\" focusses on processes and tools, rather than the core leadership and (Extreme Programming / DevOps) skills needed\n\n\\- **there's a huge \"legacy codebase\"**; legacy in the Michael Feathers sense that we cannot make changes cheaply, easily, quickly and safely (no new defects) because of a combination of over-complexity, poor design and ineffective test automation.  \n\n\\- **the cloud is expensive***;*  agile practices are based on \"run it and see, then refactor\";  when you are on-prem with low cost hardware (or hardware that has been capitilised) that's one thing.  When you are running on a cloud where every byte and cycle costs, that's something else.  We used \"measure twice, cut once\" back in the mainframe days as well. \n\nAgility has much in common with \"lean\", and \"lean\" initiatives also tended to fail where it wasn't seen to be an exercise in continuously evolving the organisation towards better and better performance, over the long term.  \n  \nVery, few people in management roles are interested in the long term;  quick-wins to bolster the resume so they can move on in 3-5 years - or gain some short term bonus - tends to be the norm.",
          "score": 3,
          "created_utc": "2026-01-15 19:56:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzpx5qk",
          "author": "Naive-Wind6676",
          "text": "A cornerstone of Agile is continuous feedback cycles so while the 'transformation' is done, the work of transforming never does.  \n\nThe people you spoke to kind of don't get it.",
          "score": 4,
          "created_utc": "2026-01-15 12:52:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzq66sw",
              "author": "Kenny_Lush",
              "text": "In theory, once upon a time. Now the majority of folks subjected to ‘agile’ are ordered to STAND UP! and say what they did yesterday, while their fellow oarsmen glaze over at the same droning that didn’t affect them yesterday and won’t affect them tomorrow.",
              "score": 2,
              "created_utc": "2026-01-15 13:45:33",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzq7mpw",
                  "author": "Naive-Wind6676",
                  "text": "I get it and agree.  At least at the train level, I'd hope that retrospective is part of the PI process and that the organization can refine it's processes",
                  "score": 1,
                  "created_utc": "2026-01-15 13:53:19",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nzpxp0z",
              "author": "Maverick2k2",
              "text": "I get that.\n\n They may not get it, but they are the hiring managers. If you want a job at Meta, you need to give them reasons to hire you. Not argue with them and be perceived as difficult.",
              "score": 1,
              "created_utc": "2026-01-15 12:55:50",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzth52y",
                  "author": "Naive-Wind6676",
                  "text": "I really don't want a job there so...",
                  "score": 1,
                  "created_utc": "2026-01-15 23:00:36",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzpruny",
          "author": "Rich-Engineer2670",
          "text": "We tried it, though in our case it was for Fragile Transformation (fail fast, fail often).   Honestly, we gave up.  We gave up because it worked great on paper, but the benefits were always \"just around the corner\" and we learned nothing slows things down better than adding customers in who have absolutely no idea what they want, but want to bring in the date.\n\nSee Mercedes Lackey and Threes if you want the song for it.",
          "score": 2,
          "created_utc": "2026-01-15 12:15:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzpuz02",
          "author": "motorcyclesnracecars",
          "text": "Your post makes sense. I think by now, those that have transformed are deep into their transformation and now their needs have changed to Performing. Those that are \"still\" transforming, do not really want it or, they say they want it but don't want to make the changes it takes to make it successful.",
          "score": 2,
          "created_utc": "2026-01-15 12:38:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzpvvlw",
          "author": "LargeSale8354",
          "text": "What I've seen has been businesses ring fencing agile as an IT only thing. They want all the benefits of change without being the ones to change.\n\nI've seen one or two near successes.  We had a highly senior stakeholder who was everything you'd hope for and more. The product was exciting everyone who saw it and interacted with it. Honestly,  it looked like an inevitable success.  Then there was a blitzkreig of office politics where the protagonists turned into millipedes with a fetish for shooting themselves in the foot.\n\nI feel that roles such as product manager and scrum master,  whatever they were intended to be, turned into gate keepers to prevent useful communication and teamwork. \n\nBusinesses cherry picked what they wanted to hear out if the agile manifesto. This seems to be \"we don't  any form of plan or deep thought. We can make stuff up on the fly as we go along\".\n\nHonestly, I  prefer a smaller company because communication and teamwork have to exist for that company's success.  If a company has more than 6 HR people, it's probably not going to be a fan of agile",
          "score": 2,
          "created_utc": "2026-01-15 12:44:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzq68cl",
          "author": "nikosx85",
          "text": "Can’t even count how many “agile coaches” I have spoken over the years that had zero experience working in an agile team of any kind.",
          "score": 2,
          "created_utc": "2026-01-15 13:45:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzt2e1k",
          "author": "Efficient-County2382",
          "text": ">Now we just need people to focus on delivering the work.\n\nThis is what it should be all about",
          "score": 2,
          "created_utc": "2026-01-15 21:48:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzppphg",
          "author": "UKS1977",
          "text": "This is just discussing SAFe. A non-agile (and indeed Non-Agile) methodology with a 100% failure rate. \n\nGet away from SAFe and things start looking different.",
          "score": 6,
          "created_utc": "2026-01-15 12:00:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzq5g10",
              "author": "maizerage25",
              "text": "“100% failure rate”\n\n🙄",
              "score": 2,
              "created_utc": "2026-01-15 13:41:32",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nzpuj3s",
              "author": "motorcyclesnracecars",
              "text": "Where was SAFe mentioned in OP? You have beef with SAFe and just look for any opportunity to pee on it? I've been in multiple orgs that ran SAFe very successfully. Sorry you had a bad experience, but YOUR experience does not mean that's how it is for everyone.",
              "score": 1,
              "created_utc": "2026-01-15 12:34:59",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzpvmg9",
                  "author": "Maverick2k2",
                  "text": "Without realizing it , where I currently work I introduced a form of PI Planning. On a quarterly basis, we review the Roadmap and decide what initiatives to focus on delivering.\n\nSince doing that , we seem to be delivering work more strategically and the leadership team feel more at ease from having a clearer understanding of what to expect.\n\nI didn’t realize SAFe did something similar but I can now see why it is popular.",
                  "score": 2,
                  "created_utc": "2026-01-15 12:42:24",
                  "is_submitter": true,
                  "replies": []
                },
                {
                  "id": "o02e9ix",
                  "author": "Affectionate-Log3638",
                  "text": "It's how it is for 99% of the people I've seen talk about it. You're the exception, not the poster you're responding to.",
                  "score": 1,
                  "created_utc": "2026-01-17 06:52:15",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nzu2aog",
                  "author": "Venthe",
                  "text": "> I've been in multiple orgs that ran SAFe very successfully\n\nSafe is for the companies that want to claim that they are agile but they don't want to change anything. Companies that did deliver will still deliver.",
                  "score": 1,
                  "created_utc": "2026-01-16 00:54:34",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nzpr216",
              "author": "Maverick2k2",
              "text": "My original post is applicable to the majority of companies.\n\nSeems like you want to be unemployed.",
              "score": -1,
              "created_utc": "2026-01-15 12:10:11",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzq247i",
                  "author": "OTee_D",
                  "text": "Wow ...   _\"Seems like you want ro be unemployed\"_ ?\n\n\nWhy are you so passive aggressive?",
                  "score": 4,
                  "created_utc": "2026-01-15 13:22:58",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzqthqy",
          "author": "HawkeyeGK",
          "text": "Engineering director here...\n\nThe agile transformation community needs to transform themselves into a group that understands and facilitates the transformation to agentic-driven development practices or they're going to be dinosaurs. \n\nWe are on the cusp of a radically different set of practices that facilitate development in an AI-driven development org. Very few have figured out the right way to manage this, but agile principles still are the guidepost we can use to figure it out. \n\nThink about it this way...  Almost all of the practices we employ today are about managing the reality that writing the code is on the critical path. What happens when writing the code takes minutes? What is the point of the vast majority of our practices in that kind of world?  Why do I even need story pointing any more, for example? Requirements gathering, rapid iteration, feedback loops, etc. become critical in this kind of world. Out of vogue practices like RAD and XP have things and ideas we can use to build a new model, and we'll probably need to invent whole new ways of constructing software. Non-developers who feed requirements are going to have to do things very differently to keep up. They should now be a primary focus of this community.  \n\nThe near future of dev is radically changed. Agile practitioners who try to impose old methodologies on the new reality will be left behind. Skate to where the puck is going to be, not where it is or was.",
          "score": 2,
          "created_utc": "2026-01-15 15:41:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzrgwob",
              "author": "Maverick2k2",
              "text": "One of the biggest ironies in the Agile community is how fixed some mindsets have become. For a movement built on adaptability, there’s surprisingly little tolerance for change.",
              "score": 3,
              "created_utc": "2026-01-15 17:27:12",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzt7a1f",
                  "author": "HawkeyeGK",
                  "text": "I very much agree.  There is a significant percentage of agile coaches who are dogmatic about process prescription.  I think the role has attracted people who like \"process\", and those kinds of individuals tend to resist disruption.  Unfortunately for those people, I think we're going to need a Ken Schwaber or Guilherme Benchimol to define a new set of best practices before they adapt to what's happening.",
                  "score": 3,
                  "created_utc": "2026-01-15 22:11:30",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzqetyk",
          "author": "wbrd",
          "text": "The only important thing about agile is continuous feedback from the customer. As an IC, I've been in many \"transformations\" and it's just different paperwork. The real work stays the same and doesn't ever go any quicker. It's just the management doing a different dance.",
          "score": 1,
          "created_utc": "2026-01-15 14:31:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzrthzx",
          "author": "Pretty-Substance",
          "text": "The most I see these days, especially in B2B is iterative waterfall with multiple quarters of planning horizon cosplaying as agile. And that’s fine. Not for every product/customer/market agile development and things like CI/CD are useful. \n\nMostly I’m convinced that agile mostly took hold because companies believed they wouldn’t be able to hire good devs if they weren’t „offering“ an agile work environment. This seems to be supported by the fact that usually only the dev orgs work agile while the rest of the company does not. Not even speaking of sales cycles.",
          "score": 1,
          "created_utc": "2026-01-15 18:23:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzt0fwd",
          "author": "tevert",
          "text": "🌟🌟🌟 M I S S I O N  A C C O M P L I S H E D 🌟🌟🌟",
          "score": 1,
          "created_utc": "2026-01-15 21:39:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzvtiaj",
          "author": "ScrumViking",
          "text": "Everything answer given there points out that they need more help than ever because clearly they never really understood what it’s about. \n\nAt the same time I get it. Most transformations I’ve seen are carried out like project and a goal of its own. Agile is about embracing change in order to discover what works better. Perfect doesn’t exist so it’s truly a never ending journey. Most organizations treat it as simply installing work process x.0 and call it a day. \n\nIn essence, it comes down to a paradigm shift of the values and principles on how we see work and results. Changing this is slow, gradual and organic. It needs continuous nurturing because it’s too easy to fall into old patterns when things hit a rough spot. The few examples I’ve witnessed myself where I can say it was truly successful were those organizations where everyone kept curious on how to keep adjusting for better outcomes and weren’t just satisfied with what was achieved.",
          "score": 1,
          "created_utc": "2026-01-16 07:46:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzw054e",
              "author": "Maverick2k2",
              "text": "People can keep on saying that these companies need help and don’t get it.\n\nThe point is , if people want to work for them , they need to adapt to their needs and understanding of agile, not the other way round.\n\nIf you applied to Meta, got an interview, wanted the job and the hiring manager version of agile didn’t match yours, will you tell them that they don’t understand agile?\n\nEDIT\n\nI guarantee that if you go in and challenge them, you will not pass the interview.",
              "score": 1,
              "created_utc": "2026-01-16 08:46:23",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzw6u3x",
                  "author": "ScrumViking",
                  "text": "I agree, people should choose the companies they work for carefully. I’ve done so my entire professional career. It’s why I wouldn’t work for any company that would give the answers you posted. \n\nIdentifying organizations that might need help in their understanding of organizational adaptiveness and market responsiveness is a diagnostic. Organizations are free to disagree. I’m the last person to inflict help on those who don’t want it. I’m simply pointing out that if it was the  desire of these organizations to be truly adaptive every answer you posted is a red flag for the reasons I gave. They can limit themselves by their believe they ticked all the boxes and are done; time will tell whether they are adaptable enough to survive or remain significantly relevant beyond the next market disruption. \n\nI get asked by organizations that have problems in need of solving. That’s my job; I solve systemic problems by giving organizations the tools to learn how to become more effective. It typically takes a bit of time for most leadership teams to understand the impact of that ask. \n\nThere are also plenty of organizations that I end up not taking assignments for, sometimes for the reasons listed above, sometimes because I am not suited for their needs. In all cases I respectfully do not want to waste anyone’s time if there is no clear outcome I can contribute towards. \n\nIt turns out there are plenty of other organizations looking to beat the competition that are willing to look inward and figure out. I’m not in short supply of work nor worried about my ability to put food on the table.",
                  "score": 1,
                  "created_utc": "2026-01-16 09:48:55",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzz0gt6",
          "author": "bzBetty",
          "text": "They're already trying to do ai transformations, just need to use the buzzwords that excites them",
          "score": 1,
          "created_utc": "2026-01-16 19:01:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o05v9bf",
          "author": "strong_and_minded",
          "text": "I think most critics only know fake agile and have never seen the rare occasion of real agile with all it’s power and potential. \nI can understand that. But using agile is not being agile. Because to really transform you have to transform the mindset. And there is so much resistance that this cannot be done without experienced outside help. Because every time people think they got it, they still only know the tip of the iceberg. \nAnd then good Agile Coaches are as rare as gold. Sure you can do a 6 week course and get a certification. But to really grasp the essence you would need 5 years experience in truly agile teams or organizations.",
          "score": 1,
          "created_utc": "2026-01-17 19:57:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o08tvke",
          "author": "WaylundLG",
          "text": "Citation? Who are we talking to? How many? What questions? Is this just vibes? Nothing wrong with that, but if so, in the words of the Dude, \"that's just like, your opinion, man\"",
          "score": 1,
          "created_utc": "2026-01-18 05:41:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzr15q9",
          "author": "jbigspin421",
          "text": "Stop the cap! It's hotter and more valuable.than ever, except Scrum Masters need to be more leaders alas project manager to deliver more value. Developers want to take their time doing projects without a time line. Not gonna happen.",
          "score": 1,
          "created_utc": "2026-01-15 16:16:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzpumpa",
          "author": "kaimeister",
          "text": "It’s the fear of uncertainty, as described by John Cleese, that kills any agile or creative work.",
          "score": 0,
          "created_utc": "2026-01-15 12:35:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzrklsv",
          "author": "AmosRid",
          "text": "3 problems with scrum (and agile to a lesser extent)\n\n\n\n1. Scrum does not scale. Dependencies, coordination and cost of communication are not factored in.\n\n2. Better agile does NOT lead to higher profits, more revenue, market share, etc. because CUSTOMERS DO NOT CARE.\n\n3. There is an anti-establishment thread that developers know best and other roles in an organization need to limit participation to outside of scrum. That was never sustainable and even more so now with offshore outsourcing and AI. I get tired of developers saying we do agile wrong and point to the latest framework, which is as common as the latest JavaScript framework.\n\n\n\nProduct (Operating) Model “enhanced” by AI is probably the replacement.\n\nI have done this for 20+ years in software, marketing, manufacturing and consulting. I still have an agile role, but the % of my time being a scrum master goes down every year. If you are a scrum master then you need to have a career pivot or exit planned.",
          "score": 0,
          "created_utc": "2026-01-15 17:43:53",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qbj9nb",
      "title": "how do you create team accountability in slack without micromanaging",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1qbj9nb/how_do_you_create_team_accountability_in_slack/",
      "author": "greasytacoshits",
      "created_utc": "2026-01-13 05:43:01",
      "score": 28,
      "num_comments": 34,
      "upvote_ratio": 0.8,
      "text": "we're a 15 person product team and most coordination happens in slack. the issue is there's zero accountability built into slack conversations. someone volunteers to do something in a thread, everyone moves on, and then three days later we realize it never got done.\n\ni don't want to be the person following up on every little thing, but if i don't, stuff just sits there. we've tried tagging things as \"action items\" in threads but people still forget because slack isn't designed for tracking work.\n\nthe engineering side uses jira which works fine for dev work, but for everything else (design reviews, content approvals, client requests, internal projects) we need something lighter. most pm tools are overkill and nobody maintains them.\n\nwhat systems do you use to make sure people actually do what they commit to in slack without turning into a nag?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1qbj9nb/how_do_you_create_team_accountability_in_slack/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "nzho4di",
          "author": "veraaustria08",
          "text": "using the slack app chaser for this. it turns those slack commitments into actual trackable items with automatic reminders. way less nagging required and people take ownership better when they have to acknowledge tasks.",
          "score": 10,
          "created_utc": "2026-01-14 05:24:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzb8vk5",
          "author": "sweavo",
          "text": "You need a leader, not a tracking tool",
          "score": 10,
          "created_utc": "2026-01-13 06:49:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzb1e47",
          "author": "bedel99",
          "text": "Jira",
          "score": 27,
          "created_utc": "2026-01-13 05:48:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzb1yyq",
              "author": "Fun_Apartment631",
              "text": "Yeah, +1 Jira.\n\nOP, you don't have to have a million statuses and a ton of automation.  \"to Do,\" \"Doing\" and \"Done\" is enough. \n\nYes it takes maintenance.  That's the job.",
              "score": 8,
              "created_utc": "2026-01-13 05:52:30",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzb26b7",
                  "author": "bedel99",
                  "text": "There are basic flows like this, built in.",
                  "score": 3,
                  "created_utc": "2026-01-13 05:54:07",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nzb1ut9",
              "author": "wbrd",
              "text": "Yep. Use Jira. You can create tasks or stories right from slack and the bot will sync the thread with the comments in the ticket.",
              "score": 6,
              "created_utc": "2026-01-13 05:51:36",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nzd46g9",
              "author": "wringtonpete",
              "text": "Yeah we use Jira 'tasks' for miscellaneous bits of work that aren't directly related to stories, such as spikes or things that come out of retros. Then they're visible on the sprint backlog and can be tracked during the daily standup",
              "score": 5,
              "created_utc": "2026-01-13 15:13:33",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nzba2is",
              "author": "LogicRaven_",
              "text": "One Tool to rule them all,\n\nOne Tool to find them,\n\nOne Tool to bring them all\n\nand in the darkness bind them",
              "score": 3,
              "created_utc": "2026-01-13 06:59:51",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzcyf4q",
          "author": "LessonStudio",
          "text": "> later we realize it never got done\n\nI find that often people will all say, \"Hey we should have clouds, let's add clouds. Then, when someone goes to add clouds, they discuss it more, and realize that clouds are a stupid application of resources.\n\nThe key is that people will chase that which gets the biggest reward. Jira seems to be a good way to do this, but I personally think it is a terrible terrible terrible way to directly manage a project. All it does is set in stone, those \"let's add cloud\" issues; but now you have that accountability; but wasted accountability.\n\nThe problem is that accountability has now entirely replaced any autonomy. Jira is \"let's work together as a team as long as you obey your manager.\"\n\nThe developers then become jira ticket closing fools.\n\nKanban is somewhat better, and can work with Jira, but an Eisenhower matrix is the ideal. It technically can be combined with Jira; and that way you can see if people are closing the most urgent and important tickets, this way \"bug which is really annoying key client\" gets priority over \"let's add pretty clouds.\"\n\nOnce you replace autonomy with accountability, you, as a horrific micromanager, need to have the ability to make all the decisions, as once micromanagement kicks in, your team will mentally check out. You will have thrown out a massive amount of their ability to self regulate.\n\nThis is the difference between leadership and mangement. Management is always micromanagement. It only works when there is a process, like a factory; you need to make sure the hoppers are topped up, the machines are oiled, the forklift safety classes are passed.\n\nLeadership, is where you oversee a group of creative smart, driven people, and help them toward realizing a vision.\n\nThe moment a person says, \"Herding cats\" you have a micromanaging fool. A leader holds out a treat, the cats follow, as long as the leader isn't trying to get the cats to go somewhere stupid; as they are smart enough to not go there.\n\nBut, jira tickets can be, \"Sleep in the middle of a superhighway\" and some poor schlub will try to close that ticket.",
          "score": 7,
          "created_utc": "2026-01-13 14:44:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzdku3a",
              "author": "nix206",
              "text": "I like the discussion here. \n\nI agree that the more managers think, the less teams do. \n\nPerhaps the question is if there is a rational “customer” (using the XP moniker) who is making decisions for what the business truly needs. Adding clouds might be just what a key account needs in three months, but no devs know this.",
              "score": 2,
              "created_utc": "2026-01-13 16:30:56",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzfqfhc",
                  "author": "LessonStudio",
                  "text": "> Adding clouds might be just what a key account needs in three months, but no devs know this.\n\nThis is how micromanagers think. They have this weird idea that if they give the devs the whole picture it will \"distract them\".\n\nThe reality is that partial information is where distractions come from. They will be told, clouds, oceans, and tables (rows cols).\n\nSo, they don't entirely know which one to prioritize. Except the big picture is that it is going to be accounting software used by accountants. Now they know how to prioritize.\n\nThe simple reality is that most managers got there through the peter principle. Thus, are the least equipped to make decisions; yet proceed to take away all the information and authority from those best equipped.\n\nThe simple failing of most managers is the understanding that you can't delegate responsibility, without also delegating authority. Yelling at drones because they didn't close enough tickets, or the correct tickets is the road to higher turnover, and even less independent thought.\n\nBad managers result in bad employees.",
                  "score": 3,
                  "created_utc": "2026-01-13 22:39:33",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzb54cr",
          "author": "PhaseMatch",
          "text": "**Don't use processes and tools to fix an individuals and interactions problem.**\n\nAs a team, you need to discuss this at a retrospective, and decide, as a team what you will do about it, and run an experiment or two.  One experiment might be to ditch slack and async communication, and go back to first principles and work face-to-face for a bit. \n\n***The most efficient and effective method of***  \n***conveying information to and within a development***  \n***team is face-to-face conversation.***\n\nA lot of the principles in The Manifesto for Agile Software Development are handed down kind of like the ten commandments, but usually if you dig down you'll find underpinning research that supports the idea.\n\nIn this case, the key question is whether people remember things better when you have f2f discussions (real world or online) or use chat.  Seems like it does for a bunch of reasons like \n\n\\- non-verbal cues and tone aid in recall  \n\\- online chat tends to mean greater \"self focus\" rather than group focus  \n\\- people are often multi-tasking or context switching, decreasing working memory and recall\n\nall of that means people are just less likely to remember things they said they would do.\n\nStill - YMMV and all, but we've been having similar conversations about ineffective communications and so on recently, and we're going more f2f for a lot of stuff after the last few retros.",
          "score": 4,
          "created_utc": "2026-01-13 06:17:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzb20wv",
          "author": "flamehorns",
          "text": "You don’t. Just leave it. If these action items are so unimportant that they can sit around for days and no one does them and no one cares, then they should not be done! Focus more on doing what’s important , than telling others what to do on slack . If something was meant to be done, and it was valuable, several people would be caring about it and getting it done. It’s likely people are too busy with their important work to worry about bullshit slack tasks. This is actually how accountability works. Knowing what should not get done, and being brave enough to just abandon low value tasks without fear. Micromanaging would be much worse, trying to force people to waste time on these slack tasks would destroy all accountability.",
          "score": 6,
          "created_utc": "2026-01-13 05:52:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzb2wog",
              "author": "sweepers-zn",
              "text": "This is an interesting take and definitely OP should consider cutting out the unnecessary work. I have one question though - if the actions are not important, why are people volunteering to deal with them? Is it to just shut someone up for the time being, knowing they won’t follow up? I would explore whether this is not a “we’re so busy chopping down the forest that we don’t have time to sharpen our axes” situation.",
              "score": 5,
              "created_utc": "2026-01-13 05:59:51",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzcdh23",
                  "author": "lakerock3021",
                  "text": "Awareness that we don't have time to sharpen our axes- so to say- is a real possibility and probablility. I do believe that people frequently volunteer to do the work, NOT with the intent to dismiss the task- but without realistic plans to execute on it.\n\nSpeaking from experience, it is easy to use pressure to offload a responsibility (awkward silence, yelling, guilting, threatening) so this is usually considered a win (\" I am responsible for getting someone else to do it, they volunteered- it's not my problem anymore- err... for now\") it takes more energy, more effort, and makes us uncomfortable to ensure there is a plan to execute it- this sometimes feels like micromanagement (and can easily turn into it).",
                  "score": 3,
                  "created_utc": "2026-01-13 12:46:50",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzb9iiy",
          "author": "Rusty-Swashplate",
          "text": "> because slack isn't designed for tracking work\n\nThere's your answer why Slack does not work for tracking work. Wrong tool.\n\nUse something like...Jira, or any ticket system. There's a thing to do? Make it a ticket, attach it with a name and a deadline by when it's supposed to be done. Any simpler Kanban will work too, so you do not have to go down the Jira rabbit hole.",
          "score": 1,
          "created_utc": "2026-01-13 06:55:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzbarho",
          "author": "LogicRaven_",
          "text": "OP your problem can’t be solved with tooling. \n\nIf you help design/content etc to set up a simple Kanban board in Jira, then they should be able to use it. If they don’t, then no other tool would help either.\n\nWhat is the impact of these stuff sitting there? What is the reason people don’t progress with them? \n\nTalk to people and ask them how they would like to work and what are their current constraints. Even better if the team could discuss this together.",
          "score": 1,
          "created_utc": "2026-01-13 07:05:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzbb0fg",
          "author": "Bowmolo",
          "text": "Get all the people together. Assume you just have release something of value.\n\nAsk 'What typically happens before that?' as long as you arrive at 'someone placed the demand for something of value' - irrespective of who does it.\n\nFlip the order.\n\nThere you have your true workflow.\n\nBuild a Jira workflow around that. Agree to follow that.",
          "score": 1,
          "created_utc": "2026-01-13 07:08:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzbg60q",
          "author": "OTee_D",
          "text": "Slack is just communication it's not a planning tool.\n\n\nWhat do you use for planning? Where do you document requirements, tasks, user stories  components to be built? (Or however you tailor and manage development)\n\n\nThe person that communicates in Slack that they will take over something, should get a work item assigned in your planning tool.",
          "score": 1,
          "created_utc": "2026-01-13 07:55:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzbmb8l",
          "author": "Svenstornator",
          "text": "You can create Jira issues directly from slack. We have found that very effective.",
          "score": 1,
          "created_utc": "2026-01-13 08:53:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzbo3ks",
          "author": "LightPhotographer",
          "text": "Also a team of 15 is too big. Too many lines of communication, too much to keep track of.  You have passed the point where adding more people added a positive return - which is usually around 5. \n\nInteresting thought: What if you bring all these people together. Let them brainstorm about what their work is and what their responsibilities are (tip: not a group discussion, look up Liberating Structures and do 1-2-4-all a couple of times).  \nOnce you have everyone aligned at the purpose of this team, it's time for the real question. Again preferably in 4 different groups, make a proposal on how they would organize the people around the work.  Discuss, give pros and cons. Compare to the current situation.  \nMake sure not to align too quickly as you want different ideas, not the one idea from that person that shouted first.",
          "score": 1,
          "created_utc": "2026-01-13 09:11:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzbp3c9",
          "author": "Ouch259",
          "text": "It happens in the demo.  Let each person demo their work.  The people who constantly miss their commitments get exposed.",
          "score": 1,
          "created_utc": "2026-01-13 09:20:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzbqwnn",
          "author": "tushkanM",
          "text": "Slack list? Monday? Trello? Ol' good Google Sheet?",
          "score": 1,
          "created_utc": "2026-01-13 09:38:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzcg2jh",
          "author": "halpin-381f",
          "text": "Slack is not an accountability layer, it's for ad-hoc communication. Jira will track assignments and progress, but not intentions (the root of accountability).\n\nProcess > tools. Have you tried a lightweight standup? \"Today I plan to ...\" is a helluva drug.",
          "score": 1,
          "created_utc": "2026-01-13 13:03:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzcgyhh",
          "author": "AggravatingStop1940",
          "text": "Use Planner in Teams",
          "score": 1,
          "created_utc": "2026-01-13 13:09:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzcq0sw",
          "author": "Kenny_Lush",
          "text": "Put every little thing in a SNOW ticket and have a dedicated pest that names and shames stagnant tickets. It lights a fire and gets it off your plate.",
          "score": 1,
          "created_utc": "2026-01-13 14:00:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzdc3rn",
          "author": "Triabolical_",
          "text": "This is a team interaction and tracking issue. \n\nLet the team figure out how to solve it.",
          "score": 1,
          "created_utc": "2026-01-13 15:51:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzezcow",
          "author": "cdevers",
          "text": "I love Slack, but it’s not the tool for this. \n\nThe primary source of truth for the work that needs to be done, and that has been accomplished, should be a ticketing system like Jira. \n\nThat information needs to be in an archive that can be annotated with information describing the work, including who worked on it, and this is what Jira (or equivalent) provides.\n\nBy all means, use Slack to have conversations about the tickets, but that’s supplementary information, not the record to go by when trying to answer questions about the upcoming work, the recently finished work, etc. \n\nI find it useful to cross-link Slack & Jira, so that Slack discussions can be anchored to the tickets that they’re referring to, and Jira tickets can link to the Slack discussions for additional context. That’s all great, and very easy to do. The important thing is just to be mindful that Slack is where ideas can be hashed out, but a tracker like Jira is the archive of record for tracking the work that got done.",
          "score": 1,
          "created_utc": "2026-01-13 20:32:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzfe7mz",
          "author": "MagnusLink",
          "text": "Agree with others Slack isn't a system of record.\n\nOne part that often fails (even with Jira) is a **hand-off** moment. Someone says \"Yes, I'll do it\" in Slack, but no one converts into a ticket with a due date. Some kind of \"commitment handshake\" might be needed.\n\nJira might feel overkill, but it's easy to set up a lightweight Kanban board to track \"commitments\" in Jira or elsewhere. Keep it as simple as possible.\n\nAt the end of the day, the team needs to agree on the ways of working on how to make the handshake in Slack, and how/what items are transferred over to some common place where things are tracked.\n\nWhat kind of misses are you seeing most: quick follow-ups that slip, or larger work that never makes it into a tracker? Does everyone (or most) agree it's a problem?",
          "score": 1,
          "created_utc": "2026-01-13 21:41:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzfuj58",
          "author": "krogmatt",
          "text": "I prefer Linear if you can swing it, it’s got fantastic integrations with Slack where you have sync’d threads between the tools to keep a single conversation. You can also use a ticket emoji to convert a slack thread into a ticket which is great. \n\nI’m sure you could setup a similar flow with Jira but linear does all that OOTB",
          "score": 1,
          "created_utc": "2026-01-13 23:00:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzm0fir",
          "author": "Turkishblokeinstraya",
          "text": "Purpose brings accountability, and transparency brings traceability. You seem to need both.",
          "score": 1,
          "created_utc": "2026-01-14 21:08:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzb6nrl",
          "author": "Used_Discipline_3433",
          "text": "Your problem is not accountability, but that picked stuff isn't get done.\n\n  \nNow, is that really a problem? If a developer volunteers to do something (like introduce a feature), and during their work they realize it doesn't make sense, is too costly or that functionallity already exists, it's within the benefit of the business to cease working on that. There are valid reasons to abandon development of a feature.\n\n  \nAnother alternative is that they tried to deliver the feature, but they found an abstacle or a bloker. Some skill they miss, some information they lack, some permission they don't have, they need some feedback from the actual end-user but they don't have it. If that's the case, then it's your job as a manager to remove that blocker - get him the permission, give him the information, book a course for him to get the skill he needs, get the end-customer oncall for him to get feedback.\n\n  \n\\> what systems do you use to make sure people actually do what they commit to in slack without turning into a nag?\n\nBe careful with \"systems\" to keep people in line. They don't help. What you need to do is to motivate developers and skilled individuals with a vision, so that they care about the product enough, and trust them to get the job done. When the work isn't done, 99% of the time it's not due to malice or laziness, but because of some blocker. Sometimes that blocker is just misalignment of people in a team, maybe a person is forced to work with a tool they don't like (e.g. if an expert 15 years developer knows linux very well and now is forced to work on windows, he's not going to be happy, believe me). \n\nSo build the trust with the team, find out what blocks a particular person and remove that blocker.",
          "score": 0,
          "created_utc": "2026-01-13 06:30:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzb70oj",
          "author": "ThePracticalPMO",
          "text": "Make a central shared spreadsheet to track these items and their status and tag people in it.\n\nIf someone agrees to do the task in slack they add it to the spreadsheet. Review the spreadsheet at retrospectives and see if people like it.",
          "score": -1,
          "created_utc": "2026-01-13 06:33:43",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qflbky",
      "title": "How do you restore a standup after it becomes a status report",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1qflbky/how_do_you_restore_a_standup_after_it_becomes_a/",
      "author": "thecreator51",
      "created_utc": "2026-01-17 18:47:02",
      "score": 28,
      "num_comments": 54,
      "upvote_ratio": 0.83,
      "text": "I keep seeing the same pattern across teams. The daily standup starts as a quick sync, but slowly morphs into a round robin status report to the manager. Each person takes their turn listing what they did yesterday and will do today. Everyone else waits quietly. Real blockers are not raised in this format, and collaboration does not happen. The meeting happens every day, but its original purpose to coordinate and unblock the team is gone.\n\nWhat is tricky is that the ritual becomes non negotiable. Suggestions to shorten it, make it asynchronous, or change the structure are often rejected. There is a sense that leadership values the simple visibility of everyone checking in more than the meeting's actual output.\n\nWhat single change had the biggest impact on making a standup like this useful again?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1qflbky/how_do_you_restore_a_standup_after_it_becomes_a/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o05icev",
          "author": "fishoa",
          "text": "Somebody needs step up and say the Daily is dysfunctional. Fixing it is the easiest part: just look at the tasks on the board instead of focusing on the people. \n\nAsk: why are these tasks still on review after two days? What else is missing so that we can merge them? Why is this task still on “In Progress” after 5 days?\n\nUse your Cycle Time to measure the usual time tasks take until completion, and don’t discuss task that are too new.\n\nCongratulations, your Daily now takes 5 minutes and your developers won’t hate you.\n\nI highly recommend reading anything by Daniel Vacanti to learn more. IIRC Kanban Guide for Scrum Teams covers this, and it’s available for free.",
          "score": 32,
          "created_utc": "2026-01-17 18:55:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o05krv3",
              "author": "thecreator51",
              "text": "Agreed, as soon as the board becomes the focal point, the standup stops being performative and starts surfacing real delays. Timeboxing and ignoring brand-new work does more to change behavior than any reminder about what standups are for.",
              "score": 8,
              "created_utc": "2026-01-17 19:06:44",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o05oqhu",
              "author": "D20babin",
              "text": "Great feedback!!!\n\nI would argue that a lot of time there a genuine need for a status meeting (project or sprint or otherwise) at the managerial level (attached stakeholders and the such for the product). It's important to acknowledge that need and then explain to them that the stand up is an AWFUL MOMENT AND PLACE to have a status meeting.\n\nThat is where you can involve your PO or PM to take action on that with support from your SM.",
              "score": 5,
              "created_utc": "2026-01-17 19:25:35",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o08lvtz",
                  "author": "heathercarmen23",
                  "text": "When would you say it's appropriate to have a status meeting?  (Genuinely curious.)",
                  "score": 1,
                  "created_utc": "2026-01-18 04:44:12",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o05ijvi",
          "author": "mike34113",
          "text": "A standup becomes useful again the moment updates stop being addressed to a manager and start being directed at teammates.",
          "score": 15,
          "created_utc": "2026-01-17 18:56:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o05kx1i",
              "author": "thecreator51",
              "text": "Exactly. When updates are aimed at teammates instead of up the org chart, the standup naturally shifts from reporting to coordination. The format matters far less once that audience changes.",
              "score": 8,
              "created_utc": "2026-01-17 19:07:25",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o05oc3s",
              "author": "fixingmedaybyday",
              "text": "Yeah but managers need to feel important so that they can schedule inquisitions, I mean meetings to figure out where the problem is and who is struggling and have something to gossip about with their managers.",
              "score": 6,
              "created_utc": "2026-01-17 19:23:39",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o05q0rs",
                  "author": "thecreator51",
                  "text": "In that case the problem isn’t the standup, it's getting leadership to care about actual blockers instead of just filling time. That shift feels like an uphill battle in a lot of places.",
                  "score": 2,
                  "created_utc": "2026-01-17 19:31:41",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o05jiqb",
          "author": "TechnicallyCreative1",
          "text": "I stop going. I've had 15m stand-ups with 10+ people where each person was given essentially a minute to raise any blockers. Some people would take 90s other would simple say nothing. It was glorious. Worked well for two full years. \n\nOne day an admin decided to pop in to 'ask some questions' immediately the format changed from a standup to a 1hr mandatory status update thing that 100% could have been covered entirely by jira. We kept asking admins to stop popping in but they felt it was the most efficient use of their time to get updates (regardless of the fact it clearly was being used for a social hour). \n\nI stopped attending altogether, started a new 'standup' with the original format explicitly not listing it on the public calendar. Sure enough admin found out and started attending that, turning it yet again into a social hour yet now we had two distinct social hours on the books every single day. Wtf. \n\nLeft for greener pastures. If admin is allowed to control or attend a standup, there really is no avoiding turning it into a roundtable status update that is going to be littered with those unnecessary friendly topics like what did you do over the weekend or how your kids are. That has no place in a standup, it's not a blocker and irrelevant to my life entirely. I certainly don't need a status update on your kids everyday.",
          "score": 4,
          "created_utc": "2026-01-17 19:00:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o05lp2f",
              "author": "thecreator51",
              "text": "That’s been my experience too. Once standup becomes a management touchpoint, the incentive shifts from coordination to performance signaling, and the format follows. At that point it’s usually easier to change the audience than to keep trying to fix the meeting.",
              "score": 2,
              "created_utc": "2026-01-17 19:11:05",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0b7k0j",
                  "author": "scataco",
                  "text": "> performance signaling\n\nLol. Reminds me of success theater.",
                  "score": 1,
                  "created_utc": "2026-01-18 16:14:45",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o06iwsc",
              "author": "Kenny_Lush",
              "text": "We all stopped going. So they made it mandatory.",
              "score": 2,
              "created_utc": "2026-01-17 21:57:48",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o073mm4",
          "author": "the_ballmer_peak",
          "text": "A status report is fine if nobody is blocked. A standup exists to find out if anyone is blocked and who has the information to assist them. That assistance should not happen in the actual standup.\n\nIf nobody is blocked and we just do a quick update, we're done in five minutes.",
          "score": 4,
          "created_utc": "2026-01-17 23:42:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o05k7jt",
          "author": "byeckyalou",
          "text": "Change the format to walk the board and review how long tasks are in progress. The majority of my time is spent focusing on in progress tasks during stand up. Do the developers/QAs have what they need to complete it? If something has been in progress for what we’ve determined is “too long” we talk about why and determine a plan to get it done. \n\nIf needed, we’ll talk about next priority items. If someone is close to being done with their work, we’ll usually identify what they are going to tackle next. \n\nI had one team resist the method change pretty intensely. I made a deal with them. Try my method for 2 sprints and if they still didn’t like it or find value in it, we’d go back. They’ve been walking the board for years now. \n\nIf it continues to be a status reporting session to the manager, ask the manager to not show up for a while. If they insist on being there, that leads to a more fundamental issue. \n\nAlso if leadership continues to need to see the status, walking the board to ensure it’s up to date is a great option for them. They can look at the board any time they want to see where things are. Having leadership buy in means they don’t need daily updates but that is a much bigger fish to fry.",
          "score": 3,
          "created_utc": "2026-01-17 19:04:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o05nzer",
              "author": "thecreator51",
              "text": "Changing ingrained habits takes more than new formats, it requires shifting trust and expectations across the team and leadership. Without that, even the best methods struggle to stick long term.",
              "score": 1,
              "created_utc": "2026-01-17 19:21:58",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o0b0yt0",
              "author": "wringtonpete",
              "text": "Yeah I generally don't invite any managers to the stand up and explain that it's a meeting for the dev team. If they insist then I tell them they have to be in 'background' mode: video off and to not speak as they are just there to observe. If they have something to say they can speak to me after the  meeting",
              "score": 1,
              "created_utc": "2026-01-18 15:43:25",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o05zccl",
          "author": "ForexedOut",
          "text": "The fastest fix is removing the expectation that everyone must speak, silence is usually a sign of clarity, not disengagement.",
          "score": 3,
          "created_utc": "2026-01-17 20:17:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0asiva",
              "author": "ServeIntelligent8217",
              "text": "Sometimes teams are afraid to ask for help",
              "score": 1,
              "created_utc": "2026-01-18 15:01:03",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o05k6p8",
          "author": "HenryWolf22",
          "text": "The biggest shift I’ve seen work is removing verbal updates as the default input to the meeting. When the current state of work is already visible before people join, the standup stops being about reciting progress and starts being about coordination. Teams that rely on a shared delivery view, where blocked items and stalled work are obvious, like in monday dev, naturally spend the time asking who needs help and what actually needs to move today.",
          "score": 2,
          "created_utc": "2026-01-17 19:03:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o05mczh",
              "author": "thecreator51",
              "text": "Yes. When progress isn’t something you have to narrate, it changes the meeting’s purpose by default and the conversation naturally shifts to what’s stuck and what needs attention now.",
              "score": 1,
              "created_utc": "2026-01-17 19:14:12",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o05v8s7",
          "author": "bleudude",
          "text": "Standups start working again when they stop optimizing for leadership visibility and focus on enabling team decisions. One effective shift is anchoring the conversation on what is not moving and why, rather than who did what. \n\nWhen work, dependencies, and blockers are already transparent in the systems teams rely on day to day, including setups built around monday dev, standups become a space to resolve friction instead of perform status updates.",
          "score": 2,
          "created_utc": "2026-01-17 19:57:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o05wfqn",
              "author": "thecreator51",
              "text": "I concur, transparency in tools sets the stage, but it’s the conversation that makes the difference.",
              "score": 1,
              "created_utc": "2026-01-17 20:03:09",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o05jhpi",
          "author": "grepzilla",
          "text": "Tell the manager to step out of the meeting.",
          "score": 1,
          "created_utc": "2026-01-17 19:00:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o05liuc",
              "author": "thecreator51",
              "text": "That’s often the fastest way to change the dynamic. Once the perceived audience changes, the behavior usually follows without touching the format at all.",
              "score": 1,
              "created_utc": "2026-01-17 19:10:16",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o05lmdl",
          "author": "FuzzeWuzze",
          "text": "Isn't this literally the job of the SM or did I take different agile training",
          "score": 1,
          "created_utc": "2026-01-17 19:10:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o05ocbm",
              "author": "thecreator51",
              "text": "In practice, the challenge is that the SM role varies widely, sometimes they can drive change, other times they’re constrained by leadership expectations or team dynamics. It’s rarely as clear-cut as training suggests.",
              "score": 1,
              "created_utc": "2026-01-17 19:23:41",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o089xqr",
                  "author": "FuzzeWuzze",
                  "text": "What is there to constrain?   The SM should be the facilitator of these meetings to keep them on track and tell management this meeting is for the team and to schedule other 1:1 if they need specifics.  If the management insists just make a new meeting and don't invite them",
                  "score": 1,
                  "created_utc": "2026-01-18 03:30:03",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o05pld4",
          "author": "caschir_",
          "text": "If nothing changes as a result of the standup, the format is broken no matter how faithfully it runs.",
          "score": 1,
          "created_utc": "2026-01-17 19:29:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o05svsw",
              "author": "thecreator51",
              "text": "Yeap, meeting only works if it drives action and clears blockers, otherwise, it’s just a ritual with no real impact.",
              "score": 1,
              "created_utc": "2026-01-17 19:45:32",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o05polh",
          "author": "adayley1",
          "text": "Give Standup Poker a try: https://agilearizona.org/archive/agileArizona2016/slides/5-5-Standup%20Poker%20-%20How%20One%20Change%20Revolutionized%20Our%20Daily%20Stand-up%20and%20Team's%20Mindset-Kalpesh%20Shah.pdf",
          "score": 1,
          "created_utc": "2026-01-17 19:30:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o05rc5q",
          "author": "teink0",
          "text": "Why does the existence of one meeting stop you from having another meeting?",
          "score": 1,
          "created_utc": "2026-01-17 19:38:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o05t0v5",
              "author": "thecreator51",
              "text": "Good question. The issue isn’t having multiple meetings but whether each one adds real value. Too often, standups turn into just another checkbox rather than a place to unblock and coordinate.",
              "score": 1,
              "created_utc": "2026-01-17 19:46:14",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o06dkzw",
                  "author": "teink0",
                  "text": "If managers want a status meeting because it is valuable for managers, and not necessarily the team. It is fine to let managers have their status meeting.  Level with the team what it actually is which is the team reporting directly up to managers for the status updates managers up want. That is what the meeting is and we can say that the meeting provides zero value to the team and that can be communicated to the team transparently.\n\nWhen it comes to something productive, such as a daily scrum, if the team values it they will do it. If they don't value it, they wont. But teams tend to perpetuate value without any convincing, and stop useless meetings all the same.\n\nA publication \"The anatomy of social dynamics in escape rooms\" described different teams solving escape rooms. Escape rooms are self-managing self-leading teams, just as is in agile, and it is an example of the dynamics that managers tend to fail to imitate; \"teams tend to start the game with a high amount of group interactions. This pattern is associated with teams ‘warming up’, familiarizing themselves with the environment, and discussing together a strategy. Such a number falls abruptly after the first 5 min, reflecting division of work and individual focus.\"",
                  "score": 1,
                  "created_utc": "2026-01-17 21:31:16",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o05vlqh",
          "author": "LightPhotographer",
          "text": "Change the questions from 'what did you do' to 'what did you achieve, want to achieve and plan to achieve'. \n\nRemove the manager from the meeting for the good of the team, or join perhaps once a week. If the manager feels they 'need' to be there, then they probably want to micromanage as well. Otherwise they would not need to know who does what on Wednessday. \n\nPersonally I´d start with the manager and discuss what his/her presence does to the team: It absolves them of responsibility and it gives the manager a sense of power and control. Both are not Agile.  If the manager can live without this dopamine kick it's much better for the team: they will realize \\*they\\* have to fix their own fertilizer.",
          "score": 1,
          "created_utc": "2026-01-17 19:58:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o05x23b",
              "author": "thecreator51",
              "text": "The challenge is helping managers let go of control without feeling out of the loop. It takes building trust and finding new ways for them to stay informed without dominating the team’s space and that shift can unlock a lot more autonomy and real collaboration.",
              "score": 2,
              "created_utc": "2026-01-17 20:06:17",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o06t26t",
                  "author": "LightPhotographer",
                  "text": "Indeed. A good question is 'what are you going to do with the information?'\n\nIf the answer is 'nothing' then you don't need it. If you say 'I may be able to intervene' you're doing the wrong thing. If you say 'I may be able to use my Management Powers to make obstructions go away' I want to marry you and carry your children.",
                  "score": 1,
                  "created_utc": "2026-01-17 22:48:23",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o06iedd",
              "author": "ExitingBear",
              "text": "\"What did you achieve?\" is at best not going to be any different than \"what did you do?\" and probably going to make it worse as everyone tries to make everything sound like an achievement and keep babbling until something seems to have stuck.",
              "score": 1,
              "created_utc": "2026-01-17 21:55:13",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o06shcs",
                  "author": "LightPhotographer",
                  "text": "It's not the play of words you take it for.  \nI tell my developers that the last time someone was interested in what they *did* was when they were 4, it was their parents and they were faking it.  No one cares what you did. \n\nIf I order a meal I don't want to know that they cut the unions and heated up the oil and cleaned the kitchen. That's just sounding busy.  I want to know when I can expect my food. Even when it's a message I don't want (like 2 hours) I can at least take action on that.\n\nBusy is nothing.  \nEverybody cares what you built, made, failed, in other words, in results.",
                  "score": 1,
                  "created_utc": "2026-01-17 22:45:22",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o06091n",
          "author": "ben505",
          "text": "I mean the core element of a standup is identifying impediments, you can do that and share what you did yesterday and plan for today too lol, they just let the most important part of the standup fall off",
          "score": 1,
          "created_utc": "2026-01-17 20:22:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o063qrr",
          "author": "frankcountry",
          "text": "Rather than focusing around people (round robin,) use the board and walk it from right to left.  What would it take to close this story?  When can we get this story in users hands?  If someone says they’re going to start a new story, ask them to first check if anyone on the team could use support.  Encourage this collaboration.  Sometimes you’ll need to force it the first couple of times so they have a taste of it, after that they can make their own decision.",
          "score": 1,
          "created_utc": "2026-01-17 20:40:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o066tgl",
          "author": "pineapplepredator",
          "text": "Everyone will be so glad when you say “okay today just tell us what your blockers are and skip if you have none”",
          "score": 1,
          "created_utc": "2026-01-17 20:56:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o06inbk",
          "author": "Kenny_Lush",
          "text": "You don’t, because it’s the cornerstone of dystopian micromanagement. You really think the authorities have any desire to change “YOU, IN THE CORNER - STAND UP AND TELL ME WHAT YOU DID?” It’s what they’ve always dreamt of.",
          "score": 1,
          "created_utc": "2026-01-17 21:56:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o06n7pq",
          "author": "PhaseMatch",
          "text": "**TLDR; The surface issue isn't the underlying problem;  if you get the core practices right for your framework and do the XP stuff, managers stop wanting daily status reports.**  \n  \nIn general, the best way to do this is to \n\n\\- shift away from individuals working in silos and towards working as team  \n\\- really applying the practices/tools from the approaches you follow  \n\\- focus on the technical practices that drive agility\n\n**- if you are using Scrum, have Sprint Goals**  \nYou are delivering a business outcome, not a work package;  the Sprint Backlog can be dynamic as you learn more and adapt towards that Sprint Goal.  That includes releasing increments inside the Sprint cycle for feedback.  The Sprint Goal is part of an outcome-oriented roadmap, not just delivering backlog, and you replan every day based on what you now know.\n\n**- if you are using Kanban, focus on flow**  \nUse visual management;  the board tells the status, not the developer.  The emphasis is on \"stop starting, start finishing\" and how the team will collaborate, as a team, to focus on closing work.  That means swarming onto blockers, for example, while keeping WIP down, and managing any hand-offs or urgent items.\n\n\\- **use XP (Extreme Programming) Practices**  \nStatus-report daily scrums are usually a sign that you have individuals working on big chunks of work.  That feels like \"efficiency\", but in practice it's setting you up for longer inspect-and-rework loops or just building the wrong thing and finding out slowly. This is **exactly** what agile approaches should avoid, and why Extreme Programming (XP) was one of the original \"lightweight\" methods.  Slice small, use pairing, have an onsite customer to collaborate with and deliver outcomes. \n\nOf those, getting the XP stuff right is the bottom line in agility.  You need to  \n\n**- make change cheap, easy fast and safe (no new defects)**  \n**- get fast feedback from users on the value that change created**\n\nThis is very hard, and requires a lot of discipline and practice to get right.    \n  \nThe pay off tends to be autonomy.  \n  \nWhen it's not expensive, hard, slow and risky to fix problems, then managers fell much safer and don't need to micro-manage.  The team is safer to - it's okay for them to be wrong.  And the customer is happier.",
          "score": 1,
          "created_utc": "2026-01-17 22:18:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o06nq20",
          "author": "Bullroarer_Took",
          "text": "do you have retros? that’s where i would bring this up.\n\nbut i would also be open to people preferring it a certain way, unless you can articulate a clear problem and the benefit of change. Not following picture perfect agile\nis fine, what matters is value getting shipped to users",
          "score": 1,
          "created_utc": "2026-01-17 22:21:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o075hmp",
          "author": "DingBat99999",
          "text": "A few thoughts:\n\n* I don't have time to go into a long description of why this happens, but in my experience, it often has to do with the WIP limit on a team being too high.\n* If all developers on a team are working individually on different things, then there's no real reason to collaborate and therefore nothing much to do in a Scrum besides provide updates.\n* Drop the WIP thereby forcing the team to collaborate. You'll get a better team and work will actually be delivered faster. \n\n  \nIf you honestly feel that WIP isn't the problem, then shift the format to a \"walk the board\" where instead of polling each developer, you simply talk about each story in progress. Hurry the team through \"what was done yesterday\" and make sure more time is spent on the other two questions.",
          "score": 1,
          "created_utc": "2026-01-17 23:52:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o07hrh8",
          "author": "lunivore",
          "text": "Trying some different things. Some teams ended up \"walking the boards\" from right to left, working out what needed to happen to close things. Some teams explicitly ask \"What can the team do to help you with X?\"\n\nGenerally standups are now an opportunity to say \"Still waiting for a review on X\" or \"Does anyone know how to do Y in Z system?\" etc. - much more focused on getting help. It's not perfect, but it's a lot better. Particularly, we made it OK to say \"I'm good\" when there was nothing worth sharing and no help was needed.\n\nWe are pretty disciplined about keeping our ticket status up to date, so management don't need to ask about that in the meetings.",
          "score": 1,
          "created_utc": "2026-01-18 00:57:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o07njvr",
          "author": "RDOmega",
          "text": "Get rid of it and learn to trust the people hired.",
          "score": 1,
          "created_utc": "2026-01-18 01:27:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o07zndz",
          "author": "WaylundLG",
          "text": "I think you've answered your own question. In your description, leadership is driving the behavior (intentionally or otherwise). Leadership needs to step away for a while. Maybe permanently. If they feel like this deprives them of information, solve that another way.\n\nMost leaders don't want to be disruptive, but no one tells them when they are. If you approach them respectfully, most will want to adjust their behavior.",
          "score": 1,
          "created_utc": "2026-01-18 02:32:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o08uvo3",
          "author": "Ezl",
          "text": "The person who runs the meeting needs to *run the meeting.*",
          "score": 1,
          "created_utc": "2026-01-18 05:49:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o08xlik",
          "author": "Illustrious_Sea_17",
          "text": "Change the board to view by epic, not by assignee.  If the epics aren’t already arranged in your product owner’s priority order, make that change.  Now you can have a truly connected conversation about what we’re delivering today against our #1 priority, #2, #3 etc, and can ask more strategic questions like do we need to shift resources to higher priority work. \n\nCouple weeks (maybe even days) of that and the manager will exit - they will see you’ve got eyes on priorities and the team is self-clearing blockers, which is the whole point of standup.",
          "score": 1,
          "created_utc": "2026-01-18 06:10:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o09q6zd",
          "author": "Fr4nku5",
          "text": "Don't go round the room, go across the board from in the rightmost story (nearest to being complete).\n\nAsk \"how do we get this over the line today?\".\n\nPraise developers who have a conversation about the work.\n\nStop people talking about yesterday - calmly say this isn't a status meeting it's sharing any context for today. Don't react to yesterday, today, blocker patterns.\n\nAsk at the end \"are there any external events that might interfere with everyone's plans?\" - fire alarms in the middle of meetings, code freezes, national holidays in other countries etc. it makes sense to have it at the start, but until people understand its purpose it may derail the meeting",
          "score": 1,
          "created_utc": "2026-01-18 10:28:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o09tv6k",
          "author": "maclirr",
          "text": "The whole point of the standup is for the manager to get a round robin status update from the team. Why would it be anything else?\n\nAgile is a fig leaf to help the manager pretend it's an important ritual for knowledge sharing and mutual unblocking. It feels less top-down that way, and it's a good line to shut up anyone who asks awkward questions, like OP.\n\nSource: 20-year software engineering career.",
          "score": 0,
          "created_utc": "2026-01-18 11:02:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o06ddwc",
          "author": "bownyboy",
          "text": "With some teams I worked with we changed it to 'is anything stopping you? and what do you need help with?' \n\nWe then also had a 15mins mini backlog refinement straight afterwards. \n\nBoth of these were run by the dev team after initial guidance and suggestions from me.\n\nBut more importantly I encouraged team members to have a stand-up / discussion whenever they needed it and not just at a fixed time everyday. Conversations should be organic, ongoing and exactly when needed. \n\nFor more mature teams daily stand-ups became less important. Instead it was continuous feedback, contiunous refinement and continuous improvement.",
          "score": -1,
          "created_utc": "2026-01-17 21:30:16",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qcje9u",
      "title": "Retros feel disconnected from what actually happened during the sprint",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1qcje9u/retros_feel_disconnected_from_what_actually/",
      "author": "seizethemeans4535345",
      "created_utc": "2026-01-14 09:57:35",
      "score": 21,
      "num_comments": 39,
      "upvote_ratio": 0.89,
      "text": "Our retros have become this weird ritual where people try to remember what went wrong two weeks ago and half the stuff that actually caused friction never gets brought up because everyone forgot or it feels too minor in hindsight\n\nLike we had this whole thing in standups mid sprint where the same blocker kept coming up for three days straight but by retro time nobody mentioned it. or stuff that got heated in slack just doesn't surface because people moved on\n\nFeels like we're doing retros based on vibes and selective memory instead of what actually happened. Has anyone found a way to make these more grounded in reality?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1qcje9u/retros_feel_disconnected_from_what_actually/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "nzon601",
          "author": "SchrodingerWeeb",
          "text": "we started using fellow's charbot to pull patterns from standups and planning meetings before retro. just ask it what blockers kept coming up or where people seemed frustrated and it surfaces stuff the team forgot about",
          "score": 34,
          "created_utc": "2026-01-15 06:12:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzorco9",
              "author": "seizethemeans4535345",
              "text": "does it only look at meetings or can it see slack too",
              "score": 1,
              "created_utc": "2026-01-15 06:47:23",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzormvy",
                  "author": "SchrodingerWeeb",
                  "text": "theres a connector that pulls from slack convos too so you get the full picture. changed our retros completely because now we're discussing real patterns not just whatever people remember",
                  "score": 1,
                  "created_utc": "2026-01-15 06:49:48",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nziiuz5",
          "author": "DonKlekote",
          "text": "If you remember those situations, why don't you bring them up? If you're a part of the team then speak up.",
          "score": 32,
          "created_utc": "2026-01-14 10:01:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzij2tl",
              "author": "vcuriouskitty",
              "text": "Agreed.\n\nWhy wait up for other team members to bring it up when you can?",
              "score": 3,
              "created_utc": "2026-01-14 10:03:40",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzikq0o",
          "author": "LetFrequent5194",
          "text": "Get the retro board added at the beginning of the sprint and let people add their feedback when they're experiencing the issues. Usually this will help to jog memory once you get to the retro.",
          "score": 18,
          "created_utc": "2026-01-14 10:19:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzn4n8h",
              "author": "lampstool",
              "text": "I created a \"living retro\" board for my squads. It's helped us quite a bit so that people dont feel like they are scrambling to think about wtf happened a week and a half ago which pissed them off",
              "score": 2,
              "created_utc": "2026-01-15 00:27:49",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzimc3l",
          "author": "WRB2",
          "text": "One of the things about being a servant leader is that you’re supposed to be observant and document. You’re supposed to be observant about what goes on what goes wrong? What goes right and document it. A retrospective if they’re not bringing this stuff up is good for you to bring up. If the same thing keeps happening week after a week after a week sprint after sprint, this should be documented and buy about the third sprint when the same shit rolls around you forced them to deal with it. Yes I said force. People don’t always like fixing things when it’s hard. But if they don’t fix things, they never get better. That’s called leadership.\n\nIf they don’t like this approach next retrospective said there like a bump on a log. When they ask, why are you sitting there, explain to them the situation you want to make things better you’ve documented things that are not going well and no one else wants to. This is their responsibility to make it better. They are guided by servant leadership but at some point in time they’re like a horse you can lead them to water, but you can’t force him to drink",
          "score": 6,
          "created_utc": "2026-01-14 10:33:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzik3g1",
          "author": "rcls0053",
          "text": "I haven't had too many retros where people actually reflect on what went wrong with the team and where we could improve on to be better. It's more about what went wrong with the work and comment on that, which doesn't really move the team forward as it was more about things we can't control. That or just patting each other on the back about what a good job someone did. It's fine but it feels like padding so that people can avoid discussing actual problems.",
          "score": 5,
          "created_utc": "2026-01-14 10:13:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzipyq5",
              "author": "Frustrated_Barnacle",
              "text": "I have this problem too. Our issues are either entirely another teams fault and completely out of our control or we've acted perfectly and the rollouts are great. \n\nI'm not sure what the solution is. People are either not getting involved because they don't understand the point of the ceremonies or don't see any actions from what's not gone well. Some people don't speak up because they don't feel \"safe\", which is fair as when we've raised negative points in the past, we've had to defend them and some team members have the emotional resilience of wet paper. We also have no outputs from issues that are raised and no decent conversations after about them so even if you raise an issue, why bother when it goes nowhere?",
              "score": 3,
              "created_utc": "2026-01-14 11:05:40",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzpc2j0",
                  "author": "MagnusLink",
                  "text": "One exercise I use sometimes when everything is someone else's problem is **\"Outside In\"**: [https://retromat.org/en/?id=124](https://retromat.org/en/?id=124)\n\n>If your team has a tendency to see obstacles outside of their team and influence and primarily wants others to change, you can try this activity:  \n  \nDraw a big rectangle on the board and another rectangle inside of it, like a picture frame. Hang all complaints and grievances that surfaced in previous phases into the frame.  \n  \nNow comes the interesting twist: Explain that if they want anything in the outside frame to change, they will have to do something themselves to affect that change. Ask the team to come up with actions they can do. Put these actions into the inner rectangle (near the outer sticky they are addressing).\n\nYou can probably find other exercises to try over at retromat, too. For example, to address or at least create awareness about psychological safety, try \"elephant in the room\"",
                  "score": 4,
                  "created_utc": "2026-01-15 10:02:08",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nzivtqz",
                  "author": "davearneson",
                  "text": "The solution is to discuss the blockers that are outside your control, work out the solutions to them and then work with your managers and other teams to fix them.",
                  "score": 3,
                  "created_utc": "2026-01-14 11:53:15",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nzkqloa",
                  "author": "Ablabab",
                  "text": "Sounds like the perfect team ;)",
                  "score": 2,
                  "created_utc": "2026-01-14 17:42:35",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nzivoe6",
              "author": "davearneson",
              "text": "It is critical to discuss the things you can't control so you can work with your managers to fix the system that you are in",
              "score": 3,
              "created_utc": "2026-01-14 11:52:07",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzja63j",
                  "author": "rcls0053",
                  "text": "Problem is they never get fixed. A bottleneck in the process? Can't change the process because everyone uses it. Want to reduce time spent on accessing system logs to better debug issues? Can't be done because some ivory tower architect decided that for security reasons you have to login to a VPN, then to a system to download a connection config, so you can access a proxy server through which you can access the actual server and log files in a text format. Oh and logs can't be piped to a better log storage that would have a UI because it costs too much.\n\nSome things you just can't fix. I could discuss them to death but it won't help.",
                  "score": 2,
                  "created_utc": "2026-01-14 13:28:57",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzjnsll",
          "author": "Budget_Pin5828",
          "text": "Retros can feel perfectory and typically suffer from recency bias.  Whatever format or agenda you're using for your retro, change it.",
          "score": 2,
          "created_utc": "2026-01-14 14:42:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzkb239",
          "author": "brain1127",
          "text": "There's a retro format that uses a timeline view of the sprint where the team places the notes at the point where the issue occured.  It takes a couple of cycles for them to get used to it, but it helps supports thinking about the whole sprint during retros.    \n  \nNot a silver bullet, when combined with questioning, it can help address these situations.",
          "score": 2,
          "created_utc": "2026-01-14 16:32:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzikxjh",
          "author": "Feroc",
          "text": "I usually have a digital whiteboard prepared for the next retrospective. When I see something like you mentioned, then I simply write it down immediately.",
          "score": 1,
          "created_utc": "2026-01-14 10:20:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzirmmv",
          "author": "CombatAnthropologist",
          "text": "I keep a daily log.  Nothing too hard, just a Word document.  Jot down anything worth remembering during the day or spend ten minutes at the end of the day.",
          "score": 1,
          "created_utc": "2026-01-14 11:19:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzit3h6",
          "author": "weather_permitting",
          "text": "Does your team feel comfortable raising/discussing issues in the retro? It doesn’t sound like they are. Or they might not feel that anything will change even if they do raise something. The answer might be more with team culture and psychological safety than any process.\n\nBut if that isn’t it, look for a tool that integrates retrospectives with your work. I know there are Jira apps that do this.",
          "score": 1,
          "created_utc": "2026-01-14 11:31:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzjttmv",
          "author": "wbqqq",
          "text": "Two suggestions:  \n \\- run retro weekly - doesn't need to be at the same cadence as delivery, and if you are on a 2-week sprint cadence, can actually help focus on the way things are done rather than the what is being delivered  \n\\- (similar to other mentions) whoever is running/facilitate the retro should focus on the facilitation rather than participating (at least defer their own input to last) - I always re-emphasise the focus of the retro (how work is done, not the work itself), sometimes even have a specific primary theme like \"blockers\", \"deployments\", \"testing\" for even more focus, and I sometimes revert to a quick 10-second overview of what happened since the last retro to jog peoples' memories",
          "score": 1,
          "created_utc": "2026-01-14 15:12:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzjv4m8",
          "author": "OTee_D",
          "text": "Bring Up exactly what you said in the next retro instead of talking to Reddit strangers.\n\n\nHonestly, a neutral politely phrased  \"I miss added value in our retro because we all tend to focus on ... instead of our current sprint .\" seems like a good start.\n\n\n Just as an idea: It could be that the other team members had significantly more problems with the topics you dismiss and don't think that the situation is adressed, so they might not \"repeat\" those things (to you) but readdress.\n\n\nI remember a project where part if the team was internal and part was staff from another company. As the contracts between the companies were bad some tasks, responsibilities, commitments couldn't be allocated, certain stuff just \"fell through\". The team adressed it but the SM wasn't able to change and also had no channel to a manager that could make adjustments to the project setup. So the same issue was mentioned over and over again for nearly a year.",
          "score": 1,
          "created_utc": "2026-01-14 15:18:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzjvfb8",
          "author": "Passthecheese",
          "text": "Had similar issue. Trying to use a confluence page tied to the sprint to summarize issues as they occur.",
          "score": 1,
          "created_utc": "2026-01-14 15:20:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzjvnrl",
          "author": "secondsleeping",
          "text": "I just have the sprint report on another monitor to refresh their memories. Work every time and never fails to dredge up trauma.",
          "score": 1,
          "created_utc": "2026-01-14 15:21:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzl71ra",
          "author": "BoBoBearDev",
          "text": "This post feels exactly like the failed retro where there is an elephant in the room and no one wants to point out. The most obvious reason is because \"they are not comfortable raising the issues\". You knew exactly why, but instead of admitting it, you come up with other excuses like \"they forgot\".\n\n\nAnd like other comment, you can obviously speak up, you didn't, and you clearly didn't forget either. You knew.",
          "score": 1,
          "created_utc": "2026-01-14 18:55:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzldiuv",
          "author": "Nowhere-Man-Nc",
          "text": "How continuous improvement is reflected in objectives and metrics for the team?\n\nThe reason why I am asking that is such disconnect typically demonstrates primarily misunderstanding of the retro purpose. Understanding could come from \"motivated professionalism\" (a true professional is never satisfied and always looking for what to improve, but this is a rare species these days) or from understanding how exactly the continuous improvement is required and unavoidable.\n\nIf people aren't under external pressure where continuous improvement is required by metrics or as a part of process compliance (think of ISO 27000 or ITIL 4) then retros easily become useless time-wasting. If people don't want themselves and aren't required externally to improve, then why would they really be engaged in retros?",
          "score": 1,
          "created_utc": "2026-01-14 19:24:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzlhvnn",
          "author": "makoto123",
          "text": "as mentioned somewhere in the comment, you can do timelines so the team familiarizes themselves on what happened during the sprint. Usually you will put deploy, rollbacks, bug founds, anything that affected delivery or scope.",
          "score": 1,
          "created_utc": "2026-01-14 19:44:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzlkwpm",
          "author": "PhaseMatch",
          "text": "Main things for me would be \n\nDON'T WAIT - saving up issues for the retrospective (or indeed praise) is like a manager saving up feedback for the end-of-year review.  Pointless and dumb.  Talk about the issue at the time, and if you agree to park it until the retro, add it to your retro board as a reminder.  \n\nUSE A WHITE BOARD - every single retro tool I have seen falls into the same trap of being \"snapshot\" focussed;  an enduring whiteboard (real or virtual) lets you track your progress, detail your working agreements, and provides a focal point for framing the start of the retrospective\n\nPOSITIVE FRAMING - always express things in terms of \"what could go better\", in a good-faith way.  There's some solid psychology and neuroscience around why this will tend to drive the team towards finding creative solutions rather than falling into the \"victim, villain, hero\" drama triangle and blame game\n\nDON'T RACE TO SOLUTIONS- it's much better to use the retro time to really dig down and get to a solid \"problem statement\" than it is to try and use the short time you have to \"solve\" things;  it's okay to set things up for a later workshop using \"Ishikawa Fishbone\", \"Evaporating Clouds\" or a bit of a \"systems thinking archetype\" approach to addressing an issue. \n\nMEASURE STUFF - when you agree to a change how you work, remember it's an experiment.  Change without data to support the value of that change is just dogma.  What are you measuring, and for how long?  And remember Goodhart's Law - you are using data to confirm improvements, not to set targets.",
          "score": 1,
          "created_utc": "2026-01-14 19:57:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzlmfnf",
          "author": "SimonTheRockJohnson_",
          "text": "You can't because the business doesn't care. Let me explain. The best case scenario typical retro cycle is:\n\n1. Everyone is excited to do retros and participates\n2. Problems get talked about action items get created.\n3. Low hanging fruit gets solved.\n4. The same problems come up over and over again and the same action items come up over and over again.\n5. There are no resources in the roadmap to solve those items because the business feels they're low ROI.\n6. People start to take it as a light bullshitting meeting and you get kudos fests or external blame fests because they sure as hell know that the meeting won't actually solve anything.\n\nThe only time retro problems get solved is if they're easy or if they affect the business. Everything else withers on the vine because typical teams are not given the room and self determination to make improvements.\n\nRetros in practice do one thing, teach engineers how much the business cares about their problems.",
          "score": 1,
          "created_utc": "2026-01-14 20:04:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzmwru4",
          "author": "DeusLatis",
          "text": ">  Has anyone found a way to make these more grounded in reality? \n\nHere are some tips that could help\n\n1) BRING THE DATA\n\nYou should start the retro looking at objective data that measured what happened during your iteration or sprint. What did you commit to? What did you ship? Did you achieve your goal or goals? Bring the core data you as a team use to measure your success as a team.\n\nIf you don't have this data then start by discussing how you do want to measure success and what metrics you will use to do so.\n\n2) FOCUS ON OUTCOME\n\nThe point of the retro should be to change something. Rants about what went wrong are not very productive unless you are going to make some change to the process that improves it. That is why a lot of frameworks for prompting conversations are focused around things like 'Things to keep vs things to change'.\n\nTry and get the team to frame their discussion items in terms of not what went wrong but what you are going to do different next iteration. If this becomes difficult or people still fall into rant mode, make this very explicate, the prompt for discussion should be what should we do differently next iteration and why.\n\n3) TAKE SMALL BITES\n\nIt can be tempting in a retro to try and boil the ocean. Everyone dumps a million complaints and then it can feel like big sweeping change is needed. Oh my god look at everything that is going wrong. You create a ton of follow up tasks and then nothing gets done.\n\nInstead, focus on the most serious issue from the previous iteration and implement one change that should improve it in the next iteration.\n\nIf people worry that you are losing all the valuable rants from the retro assure them not to worry, if a problem is really a problem _it will come up again_ over and over and that will be a signal to fix it in a future retro.\n\nWhat can work well is that everyone writes down an issue on a sticky and then you all vote, and you tackle only the issue with the highest votes as it indicates that is affecting the most people.\n\n4) MEASURE SUCCESS\n\nFrame the change you are going to make not simply as something new the team will do but also frame it as what you _expect_ to be different when you do it. Then measure that and bring that data into the next retro. You changed how you communicate that a Pull Request is waiting to be reviewed, did you see faster PR approval? No? So that seems like it is still a pressing concern that you should tackle, rather than just move on to the next issue.\n\nHope this helps.",
          "score": 1,
          "created_utc": "2026-01-14 23:45:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzostyu",
          "author": "Justin_3486",
          "text": "We timebox retros to 30 min and limit to two action items max. Helps with focus at least.",
          "score": 1,
          "created_utc": "2026-01-15 07:00:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzotdne",
          "author": "sychophantt",
          "text": "Started keeping a running doc during the sprint where anyone can drop notes when something happens. Way better than trying to reconstruct it all at the end.",
          "score": 1,
          "created_utc": "2026-01-15 07:04:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzwuouf",
          "author": "app1310",
          "text": "This is a really common failure mode of retros. Memory is a terrible data source. What’s worked better for me is capturing *signals during the sprint*, not at the end—lightweight notes when blockers repeat, decisions get reversed, or work spills unexpectedly.\n\nThen the retro becomes a review of evidence (events, patterns, timelines) instead of feelings. Even a simple “friction log” or tagging standup notes makes a big difference. When retros are grounded in what actually happened, they get a lot less abstract and a lot more actionable.",
          "score": 1,
          "created_utc": "2026-01-16 12:56:06",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qfi035",
      "title": "QA roles in today's agile setup",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1qfi035/qa_roles_in_todays_agile_setup/",
      "author": "EarlOfAwesom3",
      "created_utc": "2026-01-17 16:42:37",
      "score": 15,
      "num_comments": 33,
      "upvote_ratio": 0.94,
      "text": "I went to an interview and they were astonished that we did not use dedicated QA at my last company (web dev). Well in my team we didn't. For some time we had the \"release every week\" cycle where every team contributed and there was a cut-off date once a week. One of the few remaining dedicated software tester was looking at quality. \n\nWe switched to an \"every ticket is released instantly\" method. No more feature freeze, no more waiting or testing cycles. \n\nTesting was shifted inside every small software team (approx 5-8 people). It was their shared responsibility. Shared understanding and knowledge was important, pair review and pair testing became a default. There was no dedicated tester role. You ship after your definition of done.\n\nI worked a few years with this agile setup and I do not want to go back.\n\nNow the new company would use a dedicated (and sometimes external) testing team. To me that sounds a bit old fashioned. \n\nTo teams still using (dedicated) QA roles: how is your agile setup? How do you include testers in the team and make sure they understand the requirements? If you use a dedicated QA team that is not part of the scrum/kanban team: would you consider this still agile?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1qfi035/qa_roles_in_todays_agile_setup/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o04v28a",
          "author": "DwinDolvak",
          "text": "We have a dedicated offshore  resource that does a ton of regression testing for releases.  We are operating in a shared environment with coordinated biweekly production releases to a large web property. Any one change could impact other teams’ work.",
          "score": 3,
          "created_utc": "2026-01-17 17:07:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o05u0cn",
          "author": "LightPhotographer",
          "text": "So they're saying\n\nthe development team is not responsible for their own work\n\nthey don't deliver value or even shippable software\n\nit's fine that they are interrupted by bugs from a previous sprint\n\nand they are probably in discussion about what are bugs or 'works as designed' and how to read/interpret the specs  (fun anecdote, I had two functional designers re-hired as testers going over their own specs; one says to the other 'what the hell does this mean?') \n\nLast I predict that the testers don't want to be responsible for saying the software is OK ... either they want way more testing or they want someone else to take this responsibility. \n\nIt's back to the 90's people. It's not a well-thought out software development process, it's a process that displayed flaws and they put a bandaid on it.",
          "score": 2,
          "created_utc": "2026-01-17 19:51:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o04srcd",
          "author": "pipeweedbalrog",
          "text": "QA review specifications and confirm test cases before development begins. They actively test and mark bugs as resolved before release. They are not just clicking buttons. They are in charge of finding issues within the application before our users do. They actively do that for every release. Most major bugs have been caught by QA",
          "score": 2,
          "created_utc": "2026-01-17 16:56:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o05bb81",
              "author": "konm123",
              "text": "Good QA is actually bug prevention. Meaning they really dig deep to understand what cause the bug to be written in and even get as far for them to be able to detect it during tests.",
              "score": 5,
              "created_utc": "2026-01-17 18:23:01",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o05nham",
                  "author": "Head-Bureaucrat",
                  "text": "Hard agree on this. One of the teams I help out more still has dedicated QA and it's a mixed bag. They spend part of their time executing rote test cases which hardly ever yields valuable results. The other part of the time they're working with devs during development to help with UX issues, asking questions about implementation and specs, and refining test cases based on discussions with the devs. They are constantly finding great issues when doing that.",
                  "score": 2,
                  "created_utc": "2026-01-17 19:19:34",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o072o0j",
              "author": "DingBat99999",
              "text": "What you're describing is QC, to be more correct. And it's an activity, not necessarily a separate role.\n\nNote that the OP didn't say that work wasn't being done. Just that they didn't have a separate role dedicated to it. Anyone with even basic knowledge of a product should be able to confirm test cases.",
              "score": 1,
              "created_utc": "2026-01-17 23:38:01",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o0at983",
              "author": "EarlOfAwesom3",
              "text": "So what happens if direction, specifications or tests change during development, like it does all the time? Isn't that counter-intuitive to agile in its most basic form?\n\nIf they are in charge of finding issues (whatever issue here means) they must work closely with developers and the product manager on a daily basis. \n\nTo me it doesn't work throwing software and specs over a fence and getting a bug report back. \n\nThe only way this could work is if members of the QA are actually on the agile team. And then it's questionable why those guys are not developers themselves.",
              "score": 1,
              "created_utc": "2026-01-18 15:04:53",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o05738w",
          "author": "AintNoGodsUpHere",
          "text": "It just shows how little people actually know about QAs. It's sad really.",
          "score": 3,
          "created_utc": "2026-01-17 18:03:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o04thnl",
          "author": "Emorin30",
          "text": "Moving away from QA functional testing is a huge efficiency gain with very little downside risk. Having developers who are willing and able to write automation tests (not unit tests) or a dedicated automation tester is helpful. Having an exploratory tester or a PO who is willing and able to do this, is also helpful.",
          "score": 1,
          "created_utc": "2026-01-17 16:59:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o04z86l",
              "author": "capathripa",
              "text": "That may be true in young companies or startups, but in a place with a lot of old tech and heavy dependencies between siloed teams, that's a disaster waiting to happen.",
              "score": 4,
              "created_utc": "2026-01-17 17:26:49",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o04zitm",
                  "author": "Emorin30",
                  "text": "Nope. Did it for 3 separate departments in a 100 year old insurance company. And the first one was almost 10 years ago when tech was far less mature. It's quite standard tbh and people don't realize just how little value most QA orgs are adding.",
                  "score": 2,
                  "created_utc": "2026-01-17 17:28:13",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o04uk8d",
              "author": "EarlOfAwesom3",
              "text": "Developers wrote automated unit tests, integration tests and end-2-end tests (if feasible and needed). Since the whole team is responsible for the outcome, there is an incentive to understand what the goal is and the software should do.",
              "score": 1,
              "created_utc": "2026-01-17 17:04:54",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o050p9e",
                  "author": "dastardly740",
                  "text": "Exploratory testing is looking for the things no one thought of specifying. You won't have automated tests on those things because no one thought of it. I like to say exploratory testing means checking your sanity at the door because you need to do things no sane user would do because if it was sane, someone would have thought of it and writtan automated test. A reductionist example is a button that is enabled that makes no sense to press. Exploratory testing presses that button because they can.\n\nA key point is that it is vanishingly unlikely that after all the other automated testing that exploratory testing will find a show stopper defect on any particular deployment. So, it is not a deployment gate. You do it on some cadence independent of the deployment cycle.\n\nOne other thing I find I have to teach orgs when I try to make them more agile. Deploy does not have to mean Release. We Deploy code. We Release Features. I.e. feature flags. Automated tests prevent regressions and now you can deploy code with that partially done feature or that feature that the product owner/team wants to exercise a bit in a non-prod environment to make sure it solves the business problem before making it available to everyone. It also helps prevent long-lived branches, which are often a pain in the butt.",
                  "score": 1,
                  "created_utc": "2026-01-17 17:33:46",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o04v32p",
                  "author": "Emorin30",
                  "text": "Ya sure not all devs are gonna lean into that and \"making\" people do stuff they don't like is generally a bad idea. You can have one person who has automation skills that can easily cover a team and add value without the classic trappings of the manual QA tester checking off each ticket one at a time.",
                  "score": 1,
                  "created_utc": "2026-01-17 17:07:20",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o04rcyv",
          "author": "rideoncycling",
          "text": "I'm experiencing this too. It hurts to watch and listen to it.\nI finally got the Head of Delivery to see the benefits (for him the penny dropped when he realised the time, money and hassle of not having to manage testing teams and contract testers).\n\nIt is unexceptable to me that the developers aren't responsible for the quality of their work.\n\nI will push and push for a better way but I suspect it will take years for the culture and mindset to change (they only started to automate testing last year 😭",
          "score": 1,
          "created_utc": "2026-01-17 16:50:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o06v7ht",
          "author": "PhaseMatch",
          "text": "**TLDR;  I run into this a lot;  we have dedicated testers right now.  Start where you are and improve things through  empiricism, managing up and effective retrospectives.**  \n  \nAgile concepts drew down from lean ideas, which meant you aim to \n\n\\- build quality in and prevent defects, rather than   \n\\- run expensive, slow test-and-rework loops  \n  \nMost of the Extreme Programming (XP) practices bend towards that goal of either preventing defects, or making small mistakes that are quickly found and easily addressed.  **I don't think you can really be agile without doing these things - given a lot of the authors of TMFASD were XP people**.  \n  \nThe challenge with a dedicated testing group is that \"testing\" becomes conflated with \"quality assurance\", when these are different things.  The whole XP/DevOps/Lean \"shift left\" mindset goes out of the window and you are into   \n  \n\\- stage-gate hand-offs  \n\\- increasing documentation  \n\\- increasing process controls  \n\\- less collaboration  \n\\- more blamestorming  \n  \n**So back to big batch, stage-gate and sign off delivery.  With Sprints.  Twice the meetings, half the work.**  \n  \nI'm in the middle of shifting another set of team into a more agile way of working;  it's an incremental and iterative process because you need to have \"team pull\" not \"leadership push\"\n\n\\- start with Brian Marick's agile testing quadrants  \n\\- move on to the team's process flow and see how they fit  \n\\- have a \"test and rework\" column on your board  \n\\- measure the cycle time for defects  \n\\- express that as part of the overall cycle time  \n  \nThat starts you in with baseline data where you can begin to:  \n  \n\\- tall about real quality assurance;  so build quality in, not test-at-end  \n\\- show management the cost of \"paying someone to create defects\"  \n\\- get the team into the defect prevention business  \n\\- collate defects by root causes   \n\\- start to see where XP practices could have brought in a shift left  \n\\- run experiments into using those practices  \n\\- measure the outcome\n\nIt also means good conversations with the test team manager, team lead, lead tester and principal developers, while working on coaching arcs across the board, while showing how change will save time and save money.  \n\nIt can also mean starting the shift in role from  \"tester\" to \"technical analyst\" who works end-to-end across the teams flow of work, while supporting automation and helping the devs with good TDD practices and not just happy path coding.\n\nKanban helps here - so inspecting and adapting column policies for \"done\" and creating low-friction flow, as well as getting teams into what Kanban actually is.\n\nThis online game (in teams, competing) can be an interesting way to lead that:\n\n[https://www.kanbanboardgame.com/](https://www.kanbanboardgame.com/)",
          "score": 1,
          "created_utc": "2026-01-17 22:59:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0740ft",
          "author": "DingBat99999",
          "text": "Yer gonna get downvoted for that opinion.\n\nBut not by me. \n\nI started when there was no such thing as dedicated QA, or testers of any sort. Developers were expected to deliver \"fit for use\" results and the idea that this wasn't \"natural\" never occurred to us. \n\nBut most of the things people call QA today isn't. It's quality control at best. Most testers are \"checkers\". They check that shit that was specified was implemented. The irony is that this is donkey work and a waste of most testers potential, but testers get very offended if you try to say an explicit role is unnecessary. \n\nI would much prefer quality personnel spend their time preventing defects, but that's pretty much unheard of in our industry. But if they can't do that, I'd prefer they spend their time doing exploratory testing finding things that fell through the cracks or were broken by side effects of changes or just plain unanticipated impacts. \n\nChecking is drone work that should rightly be done by automated tests.\n\nI've also found that most testers lack a well developed sense of self-preservation. They allow developers to toss shit over the wall at them and don't get angry. If I had developers giving me product that had easily found defects in it, I'd call them out. Most testers meekly take it.",
          "score": 1,
          "created_utc": "2026-01-17 23:44:45",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qasifg",
      "title": "Team level Scrum Masters working across multiple teams - how is that effective?",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1qasifg/team_level_scrum_masters_working_across_multiple/",
      "author": "Maverick2k2",
      "created_utc": "2026-01-12 11:30:39",
      "score": 10,
      "num_comments": 26,
      "upvote_ratio": 1.0,
      "text": "When I started working at my current firm , I was working across the whole department. Which at the time was needed as part of leading a department - wide top-bottom delivery transformation.\n\nWhat I found though by doing this , was that I was stretched too thin and I was not able to build domain experience for any of the work streams.\n\nSince then, I have been embedded into a single workstream. It has taken me a good part of 6 months just to understand the nuisances of what the team is working on. Where as part of that process, I now understand at enough technical depth , how they are delivering work and what they are trying to achieve.\n\nDeveloping this domain knowledge is now proving critical in helping them with shaping their ways of working, in a way that makes sense for them and the business. It is also helping them with keeping their deliveries on track. Whenever there are issues, I can understand more clearly why, and what teams to work with to unblock it with.\n\nOften on here I read about how people think that SM role is not full time unless they are working across several teams. Taking the above into account, I’m starting to wonder why?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1qasifg/team_level_scrum_masters_working_across_multiple/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "nz59nil",
          "author": "Agileader",
          "text": "Scrum Master role is hugely misunderstood.\n\nAlso: The Scrum Master is not an anaylst and much less a process designer and manager.\n\nIn my opinion, a Scrum Master working across multiple teams is most effective if those teams work on the same product and have inter-team dependencies.\n\nBut then, I believe that 'Team Scrum Masters' are a dysfunction in scaled product development.\n\nScrum Masters need to work in a team (or teams) \\*and\\* inter-team in scaled product development.",
          "score": 10,
          "created_utc": "2026-01-12 11:38:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "nz5acm0",
              "author": "Maverick2k2",
              "text": "Even when designing and guiding team members on process to improve dependency management, it is very hard to do so if you do not properly understand the nuisances of that team’s work.\n\nAt least what I’ve found.\n\nThis is what I am doing right now.",
              "score": 1,
              "created_utc": "2026-01-12 11:43:48",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nz5kcqc",
                  "author": "davy_jones_locket",
                  "text": "Are you new to the industry/domain in which they work in? Are you new to scrum mastering? ",
                  "score": 1,
                  "created_utc": "2026-01-12 12:56:11",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o07z7i8",
                  "author": "Agileader",
                  "text": "You help design a process, you don't design.\n\nYou guide on approach to process improvement, not on process improvement.",
                  "score": 1,
                  "created_utc": "2026-01-18 02:30:18",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nz5pwxl",
          "author": "WideFunction6166",
          "text": "Every SM role is unique.  There are ranges from the XP Player Coach to pure play facilitators.  The 'right' answer is the one that allows the team/s to deliver value.  In flight adjustments to the role are critical.  Having a set playbook is misconstruing the message of agile.",
          "score": 4,
          "created_utc": "2026-01-12 13:30:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "nz7k4el",
              "author": "Maverick2k2",
              "text": "I’ve interviewed at six Fortune 100 companies recently, including Google. Five out of six were clearly looking for strong project management skills - someone who can create delivery plans and make sure they’re executed. The only “agile” aspect was the way work was run, through sprints or Kanban, rather than the expectations of the role itself.\n\nThe market expectations doesn’t seem to align with the agile community.",
              "score": 1,
              "created_utc": "2026-01-12 18:48:38",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nz7zuea",
                  "author": "WideFunction6166",
                  "text": "I work at a top ten product development firm and belive you observation is spot on.  Agile can certianly provide delivery plans.  Watch Heinricks Product Managments in a Nutshell 'all the way through' to see how.  However scaling agile is quite different from agile on a team, there are pros and cons.  Plus side of the ledgr, big co can carry you when you're down.  Downside, there is more process necessary to make sure the whole battleship is moving.",
                  "score": 2,
                  "created_utc": "2026-01-12 20:00:28",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nz7em1z",
          "author": "WaylundLG",
          "text": "It depends a bit on what people need. You're talking about teaching people and identifying solutions for them, which is not strictly needed as a SM. There are many techniques for coaching people toward a solution using their knowledge of their environment that don't require you to understand their work. \n\nNow, while I think this is a very valuable skill to have as a SM, I also think people over-use it. To your points, teaching and co-creating are also valuable approaches. Forcing people thrpugh a coaching approach when there is ready information is expensive and exhausting. Sometimes it's worth it, sometimes not.\n\nI'm a fairly technical coach. When you compare times I use my knowledge to times I don't, I find that applying my own technical experience is faster, unless it backfires and people feel threatened, then it's slower. The trick for me has been knowing who needs what approach. Just my experience with dozens of teams.",
          "score": 2,
          "created_utc": "2026-01-12 18:24:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "nz7f02l",
              "author": "Maverick2k2",
              "text": "Just had an interview for a SM role at a top-tier company. \n\nIt was all focused on making sure initiatives get delivered and being point of contact for status.\n\nThe SM role is now being seen as Project Management.\n\nIf I had no understanding of the nature of the work, I wouldn’t be able to do it.",
              "score": 2,
              "created_utc": "2026-01-12 18:25:50",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nz7owt3",
                  "author": "WaylundLG",
                  "text": "Sure. I can't really answer for people mislabeled their job titles. If the job is delivery lead and they call it scrum master, you better have delivery lead skills. That feels like a different conversation.",
                  "score": 2,
                  "created_utc": "2026-01-12 19:10:10",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nz5bj6x",
          "author": "ya_rk",
          "text": "In multi team scrum, you shouldn't have a totally different domain across multiple teams. All teams are working on the product, and generally speaking, all teams need to be able to take whole items from the backlog and deliver them. That means that teams would have largely the same domain.\n\nHaving said that, your role isn't to understand their specific circumstances: technical, product and human, and solve it for them. But rather, it is to help them develop the skills to solve it themsleves. You're teaching them to fish, not catching fish  for them. This is important, since you absolutely don't need to know their domain in-depth to do that. It doesn't hurt, but it's also not strictly necessary. In the end, team and org dysfunctions are broadly similar across many companies. this is why the patterns of agile are so broadly applicable. You CAN have a big impact on a team even when your attention is split across several. It helps when these teams share a domain, and it helps when you have your full attention for one at a time. But it's not necessary.",
          "score": 1,
          "created_utc": "2026-01-12 11:53:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "nz5czwb",
              "author": "Maverick2k2",
              "text": "How can you teach someone how to fish, when you have no idea on the nature of their problems? It’s the blind leading the blind? \n\nBy the way , when I mean developing domain knowledge, I do not mean knowing how to do the work. But understanding the world they operate it , and why the outcomes they are trying to achieve are important. So that you are in a position to guide them.\nTo do that, conceptually you have to understand the nature of the work.",
              "score": 2,
              "created_utc": "2026-01-12 12:04:09",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nz5izcv",
                  "author": "ya_rk",
                  "text": "The nature of the problems of teams and orgs are rarely in the technical details. Again, if it was, broad concepts like agile wouldn't be viable. \n\n\\> By the way , when I mean developing domain knowledge, I do not mean knowing how to do the work. But understanding the world they operate it , and why the outcomes they are trying to achieve are important.\n\nI understand that. If you are working for multiple teams and they each have different outcomes and different worlds, then the problems are REALLY not in the technical details.",
                  "score": 2,
                  "created_utc": "2026-01-12 12:47:06",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nztx05o",
          "author": "mrhinsh",
          "text": "There is a huge difference between the role  called a Scrum Master in a company, and rne accountability defined in the Scrum Guide.\n\nA company will create a role that has a range of accountabilities and may call that whole thing a Scrum Master.",
          "score": 1,
          "created_utc": "2026-01-16 00:25:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz5mptg",
          "author": "webby-debby-404",
          "text": "A Scrum Master should rely on the domain knowledge of the team members. They do not have to have deep technical knowledge of anything. The things you focus on besides your responsibility to help the team 'staying agile' are responsibilities of roles like Process Engineer, Release Manager, CI/CD Engineer and Software Architect.  \n\n\nAs SM you should only be asking the right questions to find real impediments and how to address them without solving them yourselves. This is never full time in the context of one single team.",
          "score": 1,
          "created_utc": "2026-01-12 13:11:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "nz68rjj",
              "author": "Maverick2k2",
              "text": "I used to think this , but every time I’ve relied on the domain knowledge of the team , the team eventually starts treating you like shit.\n\n‘Why do we need a SM , they don’t know contextually what we are trying to do?’\n\nThis is not an issue that I have uniquely experienced , I have friends who are Devs with a SM, that is operating that way bitching about them behind their back.\n\nBy the way what I mean about domain knowledge , is a high level understanding of their work. For example, if you work with a DevOps team , understanding what kubernetes, reddis, load balancers are - do not need to implement it.",
              "score": 5,
              "created_utc": "2026-01-12 15:11:17",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qddl9x",
      "title": "trying to find good kanban board tools",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1qddl9x/trying_to_find_good_kanban_board_tools/",
      "author": "Budget-Consequence17",
      "created_utc": "2026-01-15 07:53:15",
      "score": 8,
      "num_comments": 18,
      "upvote_ratio": 0.83,
      "text": "looking for a simple kanban tool for agile workflows. anyone have any idea?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1qddl9x/trying_to_find_good_kanban_board_tools/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "nzp0y1w",
          "author": "SalamanderFew1357",
          "text": "trello is still my go to for simple kanban. free tier is plenty for most teams, power ups add what you need, and it doesnt try to be more than a board.",
          "score": 7,
          "created_utc": "2026-01-15 08:13:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzrnk1v",
              "author": "No_Wave_3579",
              "text": "I completely agree",
              "score": 1,
              "created_utc": "2026-01-15 17:56:59",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nzrtead",
              "author": "brimister",
              "text": "I came here to say this.",
              "score": 1,
              "created_utc": "2026-01-15 18:22:59",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzp46zi",
          "author": "Trustadz",
          "text": "There are so many of these tools. What have you tried and why didn’t they work?",
          "score": 2,
          "created_utc": "2026-01-15 08:45:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzozpvu",
          "author": "Infamous-Coat961",
          "text": "we tried zenkit and liked how flexible it was for different project types.",
          "score": 1,
          "created_utc": "2026-01-15 08:02:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzp179p",
          "author": "Dsan_Dk",
          "text": "I mean, you don't say a lot, but my go-to in the past was always trello for starters.   \nToday, going beyond trello, I might just look at Miro actually.\n\nIf by agile, you mean a lot of rules and status management, Jira is the way.",
          "score": 1,
          "created_utc": "2026-01-15 08:16:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzp1rjv",
          "author": "SlightReflection4351",
          "text": "we use linear in kanban view. its built for devs so its fast and has keyboard shortcuts for everything. the simplicity is in the speed",
          "score": 1,
          "created_utc": "2026-01-15 08:21:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzp28bp",
          "author": "Ashamed-Button-5752",
          "text": "if you are looking for just a board and nothing else, kanbanflow is super clean and has a built in pomodoro timer, which is nice for focus",
          "score": 1,
          "created_utc": "2026-01-15 08:26:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzp40ni",
          "author": "ShivamS95",
          "text": "We use Slateo. We are a small team. Slateo is simpler and works for us. Wanted to skip Jira",
          "score": 1,
          "created_utc": "2026-01-15 08:43:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzp4er8",
          "author": "PhaseMatch",
          "text": "I'd start with a simple whiteboard.  \nWork out what you need from that.  \n  \nMost \"agile\" or \"kanban\" tools make the wrong things easy and the right things hard, and I've not seen any that are effective at showing everything you need on one, easy-to-see radiator.  \n  \nRemember one of the goals is \"visual management of work\" - no-one should ever need to ask for a status update of anything every again.",
          "score": 1,
          "created_utc": "2026-01-15 08:47:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzpafxs",
          "author": "emteg1",
          "text": "[https://kanboard.org/](https://kanboard.org/)",
          "score": 1,
          "created_utc": "2026-01-15 09:46:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzpfkn3",
          "author": "Immediate-Web4294",
          "text": "I'm still a fan of Trello, mainly for its simplicity.\n\nBut their are many other tools such as Linear, Smartsheet, ClickUp, Monday.com, Shortcut etc.. that allow you to setup digital boards and they all work well in agile teams. - It may depend on if you need any other functionality as to which you choose.",
          "score": 1,
          "created_utc": "2026-01-15 10:34:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzqakz2",
          "author": "vstreamsteve",
          "text": "\"Which kanban tools allow for signaling or automation based on work item age, SLEs and WIP limits?\"  \n\\^ these are the factors I consider the most important for managing work in Kanban  \nActionable Agile in Jira does the job well, but Jira is very heavy  \n\"**Businessmap** (formerly Kanbanize) provides visual workflow management with customizable WIP policies at multiple levels, WIP limit warnings and enforcement options, plus WIP trend analysis. The platform supports aging views and automation based on conditional logic.  \n**Swift Kanban** includes built-in aging views, business rules for automation using IFTTT-style logic, and AI-powered features. Teams can automate board activities based on custom criteria including work item age thresholds.\"",
          "score": 1,
          "created_utc": "2026-01-15 14:09:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzs4mrz",
          "author": "sameunderwear2days",
          "text": "Buy and implement Servicenow and just use their visual task board (I am joking)",
          "score": 1,
          "created_utc": "2026-01-15 19:12:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzsreco",
          "author": "Sweaty_Ear5457",
          "text": "yeah lots of options out there but honestly most tools are either too basic or try to do too much. the issue is they force you into columns when what you really want is to see everything in one place.\n\nwhat ive been doing instead is mapping projects on a canvas. i use instaboard and just create sections for backlog doing in progress and done. then i can see the whole workflow at a glance and move cards around without being stuck in a strict layout. you can add attachments or notes right on each card too which helps keep context in one place.\n\ngives you that visual radiator without the overhead of a heavy tool",
          "score": 1,
          "created_utc": "2026-01-15 20:58:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o010rad",
          "author": "krogmatt",
          "text": "I don’t know a tool that doesn’t have a kanban board these days",
          "score": 1,
          "created_utc": "2026-01-17 01:06:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o08cc4x",
          "author": "its_k1llsh0t",
          "text": "Asana?",
          "score": 1,
          "created_utc": "2026-01-18 03:43:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzozun8",
          "author": "Longjumping-Cat-2988",
          "text": "Take a look at Teamhood.",
          "score": 1,
          "created_utc": "2026-01-15 08:03:36",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qfwj0h",
      "title": "How important do you believe 'Servant Leadership' is, and do you see it being employed/lived in your orgs?",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1qfwj0h/how_important_do_you_believe_servant_leadership/",
      "author": "Agileader",
      "created_utc": "2026-01-18 02:37:19",
      "score": 8,
      "num_comments": 17,
      "upvote_ratio": 0.9,
      "text": "",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1qfwj0h/how_important_do_you_believe_servant_leadership/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "o08iaax",
          "author": "DwinDolvak",
          "text": "Servant leadership is vital to a good culture and creating loyalty within an organization. \n\nThe opposite of servant leadership— command and control — ruins cultures and creates mistrust and a finger pointing, non collaborative environment.",
          "score": 9,
          "created_utc": "2026-01-18 04:20:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o08ij6v",
              "author": "mrhinsh",
              "text": "This.\n\nId also promote the importance of \"intent based leadership\" (see Turn this Ship Around) and negotiation (see Never Split the Difference)",
              "score": 2,
              "created_utc": "2026-01-18 04:21:59",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o09hwc5",
              "author": "mondayfig",
              "text": "Are servant leadership and command & control necessarily polar opposites though? \n\nI feel they can live side by side when balanced correctly. The past ten years I've predominantly had leadership roles in high growth tech businesses and due to the constant and rapid change, and often chaos, I found that a level of command and control is actually quite helpful. \n\nI've always felt those periods of rapid growth where everything is constant breaking not that dissimilar to being in a crisis situation, which often needs more command and control.",
              "score": 2,
              "created_utc": "2026-01-18 09:11:28",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0a2al9",
                  "author": "DwinDolvak",
                  "text": "A servant leader asks “what can I do to help you be successful?”\n\nA c&c leader just tells you to what to do and asks for status on those requests. \n\nCan someone do both? Sure. Pretty confusing though. The motivations are ultimately different for both kinds of leadership.",
                  "score": 3,
                  "created_utc": "2026-01-18 12:15:14",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o0ap9l4",
              "author": "its_k1llsh0t",
              "text": "I've seen this first hand at my last job. I am a servant leader. My bosses wanted command and control. Loyalty and yes-people. Your comment about culture is spot on. Saw a lot of finger pointing and people were always looking over their shoulder because no one knew who could be the next one out the door. I left because of it.",
              "score": 2,
              "created_utc": "2026-01-18 14:43:49",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o09c9ca",
          "author": "KeepYaWhipTinted",
          "text": "Most managers who have adopted an agile way of thinking and live those values and principles have a deep belief that they exist to help people and improve the system for them so they can do their best work.\n\nBut in a world where talented software engineers have been fired to make way for people overseas who earn nothing, have little experience, and are not motivated to solve their own issues, servant leadership is worthless.",
          "score": 6,
          "created_utc": "2026-01-18 08:19:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o08ujfv",
          "author": "WaylundLG",
          "text": "Servant Leadership (proper noun) is a very old and well established theory of leadership. It is still taught in many graduate programs including MBA's and many good leaders have at least been taught it and it probably works into their approach. On the other hand, servant leadership (general term) is pretty much ubiquitous in all modern leadership approaches. Enabling your people will always radically outperform carrot/stick, expert leadership, and hierarchical directive. You see those things here and there and with inexperienced leaders, but they vanish pretty fast the further along in leadership careers you go.",
          "score": 3,
          "created_utc": "2026-01-18 05:46:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o09s68f",
              "author": "Agileader",
              "text": "So I understand that Servant Leadership is *the* approach (most effective) and that experienced, accomplished leaders will own this approach?\n\nNot exactly what I generally see in upper management, nor in 'experienced' Scrum Masters / Agile Coaches in the german industry though.\n\nAlso, could you expand a little more about 'Servant Leadership' and servant leadership?",
              "score": 2,
              "created_utc": "2026-01-18 10:46:53",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0b36ty",
                  "author": "WaylundLG",
                  "text": "Servant Leadership is a leadership approach from Robert Greenleaf (greenleaf.org) that emphasizes the servant as leader, but also growth of followers and social benefit of people less priveledged. When people discuss servant leadership in regards to scrum or agile, they usually just focus on leaders that concern themselves with the needs of the team to succeed. That's likely why the newest scrum guide dropped the term servant leadership and switched to the awkwardly vague term true leader.\n\nI wouldn't say it is THE approach. There are quite a few theories of leadership out there. The bigger problem is that most managers and business leaders never get any leadership training. I don't know about your experience and I only worked with 5 or 6 German companies, but certainly all of them I worked with were at least trying to consider what their teams needed. Of course, that was during consulting and companies who hire consultants are usually actually trying to change, so my experience is a little skewed.",
                  "score": 2,
                  "created_utc": "2026-01-18 15:54:09",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o08v6bv",
          "author": "BoBoBearDev",
          "text": "Actually there is no right or wrong. I am a servant leader, but I won't tell you this is the only way or this is the only correct way.\n\n\nBecause I have seen it. My mom is a dictator, but she really kept the company alive. The CEO is wanting to burn the company down and my mom blocked it. And under her reign, there is very little mistakes, things are smooth, no need heroics to put out the fire. Other departments are happy because customers are happy. And without her strong personality, the CEO already implemented BS changes and burn the company down with bunch of layoffs.\n\n\nAnd yes, there is another ass kisser manager would follow the directions and would frequently cause hell that affects other departments. And each time my mom left the company, the CEO did their shit and indeed burn the company down.\n\n\nAlso servant leaders often has additional traits to be vague and open ended, because they are not supposed to micromanage. But then, eveyeone just do shit in the wrong directions.\n\n\nServant leaders has as many pitfalls as dictators.",
          "score": 3,
          "created_utc": "2026-01-18 05:51:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o097huc",
          "author": "nibor",
          "text": "I believe in it, have done since learning and introduction agile 23 years ago to the department of a large corporation I worked at as Senior Software Dev \n\nI believe it has allowed me to get to and stay at CTO level about 15 years ago across a number of SME organisations where it was easier to support than when I did corporate work. \n\nI fully respect and understand to concept of HIPPO and how that can alter what I believe Servant Leadership is.  I still use the chicken and pig story to emphasis who has input to ceremonies and who does not.  That is to say I personally do to listen and responds instead of tell and request and if I see others in my team fall toward dictatorial style it is addressed in our one2ones.\n\nI find this works for the  high level strategic deliverables we have to deliver, it can be less effective when there are smaller operational or short term deliverables that come from things like a change in regulation (think GDPR or DORA requirements if you are in the EU) or external business change (recently impact of war) but in situations like that I take a Commanders Intent approach.   That is allowing the team to put their own plans together to take an order and convert it into actions. To some extent it’s a similar concept accept it’s used sparingly for more urgent fixes deliverables where I have to ask a team to change priorities. \n\nIdeally during refinement I will ask for time, express the problem and why this is pressing, seek buy-in from the team, step back and then advice and support as necessary.",
          "score": 2,
          "created_utc": "2026-01-18 07:36:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ap8wi",
          "author": "Illustrious-Jacket68",
          "text": "Absolutely critical.  But, that servant leadership also needs to be respected and not abused.  It also needs to be supported, and not taken for granted by entitlement.",
          "score": 2,
          "created_utc": "2026-01-18 14:43:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0apnmh",
              "author": "Agileader",
              "text": "Cheers, what do you mean by the second part?",
              "score": 1,
              "created_utc": "2026-01-18 14:45:54",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0asslu",
                  "author": "Illustrious-Jacket68",
                  "text": "All too often, when a leader gives the latitude and gives the support to a team, they squander that away by not also understanding the needs of that leader.  \n\n  \nWhile i appreciate the notion that the opposite of servant leadership is command and control, expecting the servant leader to be able to change the entirety of any sizable company overnight is irrational.  Awareness of the environment in which the team operates and looks to contribute and support that servant leadership that is likely taking a chance him/herself, is not being realistic.",
                  "score": 2,
                  "created_utc": "2026-01-18 15:02:27",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0apr69",
          "author": "teink0",
          "text": "It is useful if the leader is capable and dependable of serving. In the TPS a team member had an idea for a new tool to improve productivity and told the leader. The leader prototyped it, gave one to the team member, and when it was found to work made one for each team member.\n\nIf an improvement potential originates from a team member can the team rely on the servant leader to do it without breaking the flow of the rest of the team. If so the team can accelerate.",
          "score": 2,
          "created_utc": "2026-01-18 14:46:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0b4jp4",
          "author": "ExitingBear",
          "text": "The idea is good.\n\nAnyone who uses the term more than once in a quarter is suspect.",
          "score": 2,
          "created_utc": "2026-01-18 16:00:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o096os0",
          "author": "Pretty-Substance",
          "text": "It’s a ruse used mostly to be able to appeal to employees, especially developers, in times it’s hard to find good talent. \n\nIn reality there’s constant management override and when jobs are harder to come by companies very quickly reverse to a strictly hierarchical way of operating.",
          "score": 1,
          "created_utc": "2026-01-18 07:29:02",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qa5tkw",
      "title": "How many teams include QA estimates + dev estimates",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1qa5tkw/how_many_teams_include_qa_estimates_dev_estimates/",
      "author": "Silly_Turn_4761",
      "created_utc": "2026-01-11 17:48:54",
      "score": 7,
      "num_comments": 28,
      "upvote_ratio": 0.74,
      "text": "I'm a PO but in a former life was a QA. The very first Scrum team I worked as a QA on, got an estimate from the devs for their work and an estimate from me for the QA work. \n\nOver the years I've noticed most teams don't do this. They either don't include qa estimates at all or they have the \"devs give the estimates on the qas behalf\" (which of course doesn't pan out since devs aren't doing qa outside of unit testing).\n\nI know in Scrum there is no defined QA role as a member of the Scrum team. But in reality, the majority of the time, there is a designated QA resource that may or may not be an actual member of the team.\n\nI'm curious how others here have seen this handled and what or has not worked for your team. \n\nDo you include estimates for qa together with the devs when putting story points on?\n\nI'm especially interested to hear from anyone working in a sAFE framework and whether that makes much of a difference. ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1qa5tkw/how_many_teams_include_qa_estimates_dev_estimates/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "nz0b2gg",
          "author": "sliced91",
          "text": "We get the whole team to estimate together, and the estimate covers everything we need to do to meet our definition of done (which is in hands of end user)",
          "score": 28,
          "created_utc": "2026-01-11 17:54:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz0besn",
          "author": "Emorin30",
          "text": "Its widely considered bad practice to estimate in time (which is implied here) as well as to estimate phases of the SDLC separately. Both are a clear indication of a waterfall process. \n\nBest practice is to either utilize abstract story points for the full implementation of the story (dev, test, deploy, etc.) or for mature teams or Kanban teams to skip estimation entirely and instead rely on average ticket size and/or WIP limits.",
          "score": 12,
          "created_utc": "2026-01-11 17:55:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "nz33w8g",
              "author": "Silly_Turn_4761",
              "text": "I don't think I said estimates of time. If I did I meant story points. \n\nThat has been my experience and what I have seen work well; including qa estimates with dev estimates for a total estimate (of SP).",
              "score": 2,
              "created_utc": "2026-01-12 01:56:04",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nz348m6",
                  "author": "Emorin30",
                  "text": "The act of estimating them separately and adding them together tells me you're misunderstanding the point of story points. The only reason you'd do that is to \"account for time\" or \"get credit for the work\" which are concepts that are incompatible with even relatively immature agile.",
                  "score": 3,
                  "created_utc": "2026-01-12 01:57:55",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nz0lmn0",
          "author": "dave-rooney-ca",
          "text": "Two things:\n\n1. The whole team is responsible for delivering the work so the whole team should be responsible for estimating it. There isn't a 'dev' component or 'QA' component, but the perspectives of the people in those roles are indeed important. Something that may take an hour for a developer to complete could take days of testing effort and vice versa. You should also consider other roles such as documentation, operations, etc.\n\n2. I used story points from 2002 until the early 2010s. We eventually realized that they really didn't provide any value over just counting completed stories. If you graphed cumulative completed story points over time and cumulative completed story count over time, the lines will be almost identical. Even when the stories aren't as small as they could be this still works, based on the data I pulled from Jira for several teams I worked with.\n\nYou mentioned SAFe and I have a comment about it specifically with respect to story points. SAFe's use of them with the \"8 points per developer per sprint\" idea is complete 🐂💩. I know the two guys who originated story points and that is absolutely NOT what they intended. Also, one of those guys, Ron Jeffries, wrote a while back that he's sorry he was involved with creating the idea of story points and suggests that people don't use them.\n\nIf you need something to forecast when work will be done, I would suggest looking into Troy Magennis' work and his forecasting spreadsheets at [https://www.focusedobjective.com/pages/free-spreadsheets-and-tools](https://www.focusedobjective.com/pages/free-spreadsheets-and-tools) .",
          "score": 4,
          "created_utc": "2026-01-11 18:41:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "nz35phg",
              "author": "Silly_Turn_4761",
              "text": "Interesting and thanks for the resource!\n\n2 out of the dozen teams I have worked on, actually fine tuned their estimation process using story points and were about as close to \"accurate\" as possible. \n\nIt still throws me a little when people say don't estimate using time. Estimate using effort and complexity. \n\nThat makes sense logically, but if you aren't basing SP on time, how would they be used to make any type of prediction. It made a bit more sense once learning SP are meant to be compared to one another. Either some piece of work will take less than, the same, or more SP than others. \n\nI'm about to start a new gig in a few weeks where they are using SAFe, which I have had no exposure to. So, I'm not sure what you mean about the 8 SP per dev?",
              "score": 2,
              "created_utc": "2026-01-12 02:05:47",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "nz0s0kw",
              "author": "Kaivosukeltaja",
              "text": "Even in SAFe the 8 points per developer is meant just for the team's first sprint ever when historical data doesn't exist yet. The documentation and training material specifically say not to think of estimates as a time unit, which sadly everybody seems to do anyway.",
              "score": 1,
              "created_utc": "2026-01-11 19:08:48",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nz0vfhr",
                  "author": "puan0601",
                  "text": "upper mgmt pushes that ideology down and middle mgmt isn't good at pushing back on it....yet....",
                  "score": 1,
                  "created_utc": "2026-01-11 19:24:11",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nz0dx9k",
          "author": "wringtonpete",
          "text": "Estimate as a team, and allow anyone to predict a higher number of story points if they feel their part is more.complex.\n\ne.g. \"as the QA I know setting up the test data will be especially tricky for this story which is why I voted 5 story points instead of everyone else's 3\"",
          "score": 6,
          "created_utc": "2026-01-11 18:07:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz0uyde",
          "author": "puan0601",
          "text": "we have a dev estimate and a qa estimate and they unite into the estimate",
          "score": 3,
          "created_utc": "2026-01-11 19:22:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz10n8i",
          "author": "signalbound",
          "text": "No, separate QA estimates make zero sense.\n\nYou estimate the whole thing that gets you to meet your DoD.\n\nIf that includes QA, you don't estimate it separately.\n\nAlso, all you are doing is keeping a bottleneck in play if QA estimates are separate.\n\nThe symptom is that you're estimating the bottleneck.",
          "score": 2,
          "created_utc": "2026-01-11 19:47:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz1elp8",
          "author": "Far_Archer_4234",
          "text": "I think pointing out that the dev and qa estimates differ is a great way to remind the PO to invite the qa peeps to the refinement meetings.   If QA isn't invited, then I play the same game and estimate without QA.  When the estimates end up being too low, I remind them that they started this game and we were playing by their rules.",
          "score": 2,
          "created_utc": "2026-01-11 20:52:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "nz3r4fk",
              "author": "Silly_Turn_4761",
              "text": "Excellent",
              "score": 1,
              "created_utc": "2026-01-12 04:01:53",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nz1hcw6",
          "author": "lakerock3021",
          "text": "An estimate per team, if your dev team and QA team are operating separately, and have separate sprints and velocities- get separate estimates.\n\nI don't think having your devs and QA on separate teams is frequently helpful- you will be creating step-gate and bottle necks and more contract negotiation and opening the teams up for finger pointing.\n\nThe challenge with even taking two sizes and combining them is that there is no need for *EVERYONE* on the team to understand the complexity of the story. \"I can only speak to how much work it will be as a dev\" should be a signal that \"I cannot do any QA work because I'm a dev\" meaning that when there is a bottleneck in the \"QA work\" it will only get relieved when you specifically STOP the devs from doing more work.",
          "score": 2,
          "created_utc": "2026-01-11 21:04:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz27532",
          "author": "Prize_Conference9369",
          "text": "Capacity is capacity, you are estimating effort to get shit done. Which according to any reasonable DoD includes validation",
          "score": 2,
          "created_utc": "2026-01-11 23:07:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz0q5ks",
          "author": "capathripa",
          "text": "We come up with a dev (by the devs) and a QA estimate (by the QA people), and add them together. We often capture the separate estimates in a comment but only the total in the story point estimate. There are things that are complex to develop but really easy to QA and vice versa.",
          "score": 2,
          "created_utc": "2026-01-11 19:00:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "nz3687e",
              "author": "Silly_Turn_4761",
              "text": "This is exactly what I've seen work very well!",
              "score": 2,
              "created_utc": "2026-01-12 02:08:32",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nz17uge",
          "author": "carsnick",
          "text": "For better or worse, I have separate numerical custom fields configured for “Dev estimate” and “QA estimate”. The teams know that the numerical value represents work days, where 1 = 1 workday. I then have an automation that sums them whenever either is modified and updates the ootb original estimate field.",
          "score": 1,
          "created_utc": "2026-01-11 20:20:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "nz3r1qa",
              "author": "Silly_Turn_4761",
              "text": "So you do sum the total, and that is the finalized estimate for the story?",
              "score": 1,
              "created_utc": "2026-01-12 04:01:28",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nz3utbp",
                  "author": "carsnick",
                  "text": "Yes, that’s what we do",
                  "score": 1,
                  "created_utc": "2026-01-12 04:23:39",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nz4itl9",
          "author": "da8BitKid",
          "text": "QA are engineers and part of the team, they estimate work for themselves",
          "score": 1,
          "created_utc": "2026-01-12 07:29:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz4n4vt",
          "author": "vcuriouskitty",
          "text": "If the ticket involves testing, we get the estimation both from QA and devs by complexity and effort.",
          "score": 1,
          "created_utc": "2026-01-12 08:09:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o09r6k2",
          "author": "happycat3124",
          "text": "We have separate stories. We carried over a bunch of epics from last PI because the QA work is still outstanding.  Our dev team can’t build much this PI because our release can’t go until April.  We need three weeks for migration through the environments and sign off after a full regression.",
          "score": 1,
          "created_utc": "2026-01-18 10:37:56",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qa4ff7",
      "title": "Scrum/Kanban in knowledge work – how do you plan work with high uncertainty?",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1qa4ff7/scrumkanban_in_knowledge_work_how_do_you_plan/",
      "author": "ScaredWish4834",
      "created_utc": "2026-01-11 16:57:25",
      "score": 6,
      "num_comments": 25,
      "upvote_ratio": 0.81,
      "text": "I've recently started work in a multidisciplinary investigative team that adopted Scrum a few years ago. Think analysts, financial, tactical, (digital) forensics, OSINT, etc., all working on the same investigations. We run 4-week sprints, do sprint planning/review/retro, and track everything on a Kanban board.\n\nComing from a software/engineering background, I’m increasingly struggling with how planning is done for investigative and technical work. What I’m slowly realizing is that the core problem isn’t Scrum or Kanban (or Scrum vs Kanban for that matter), but what my team thinks a ticket should represent.\n\nRight now, a ticket is treated as “a set of known steps that can be planned up front”. That works fine for administrative or coordination work (prepare a meeting → make slides → book room → send invite). Because that’s how most of the team works, the same level of detail is expected from technical and forensic work during sprint planning.\n\nSo engineering tickets get forcibly worded and broken down into tangible, step-like todos to make them understandable and plannable up front.\n\nThe issue is that investigative/engineering work just doesn’t behave that way. Or at least that is what I think. When I get a forensic image, I don’t know yet if it’s usable, whether it’s a RAID, a VM host, corrupted, unsupported, or irrelevant. The work is mostly figuring out *what the work even is*. Planning detailed todos like “copy image”, “generate report”, “analyze report” creates a false sense of predictability and usually has to be rewritten anyway.\n\nWhat makes this really visible is what happens later. Toward the end of a sprint — or after working on the same ambiguous ticket for two or more sprints — it often becomes clear that different people had very different expectations of what that ticket actually entailed at the time of planning. The ticket looked concrete on the board, but the shared understanding wasn’t there. That is something I would really like to get the team aligned on again.\n\nCurious how others have dealt with this, especially in law enforcement, forensics, or other exploratory knowledge-work environments.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1qa4ff7/scrumkanban_in_knowledge_work_how_do_you_plan/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "nz0cswp",
          "author": "mrhinsh",
          "text": "What you are describing is not a failure of investigative work.\nIt is a failure to distinguish refinement work from increment work, and a system that is uncomfortable with uncertainty.\n\nScrum is a social technology for empirical control in complex work. It does not assume the work is knowable up front. Kanban, used alongside it, is an observability pattern. Its purpose is to make the state of work, its age, and its flow visible, not to provide comfort through false precision.\n\nRight now, tickets are being treated as if they must represent a sequence of known steps. That forces discovery to pretend it is delivery. The board looks clear, but the understanding is not.\n\nA key distinction is being missed:\n\n- Refinement work changes the Product Backlog.\nIt reduces uncertainty, clarifies intent, surfaces constraints, and determines what might be worth doing next.\n\n- Sprint work changes the Increment.\nIt produces something usable and inspectable that advances the product or investigation.\n\n\nWhen refinement is treated as if it should behave like increment work, teams manufacture certainty early and then pay for it later in misalignment and rework.\n\nIn investigative and forensic contexts, it is entirely normal, and often correct, for the majority of a Sprint to be spent in refinement. If the primary constraint is lack of understanding, then reducing that uncertainty is the highest-value work available. Scrum does not optimise for output per Sprint; it optimises for learning and control.\n\nThe only requirement is that refinement is intentional, time-bounded, and minimal but sufficient. Open-ended analysis is not the goal, but neither is pretending the work is understood when it is not.\n\nKanban should make this visible. If refinement dominates, that is a signal about the nature of the work, not a problem to be hidden.\n\nTrying to force increment-style delivery before understanding exists does not increase predictability. It just creates fiction.\n\nIf you want to chat about it you hit me up for a diagnostic conversation on [Hinshelwood.com](Https://Hinshelwood.com)",
          "score": 6,
          "created_utc": "2026-01-11 18:02:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzkhrj3",
              "author": "wbqqq",
              "text": "Agreed. \n\nI'd suggest that perhaps to fit in with the current system that each of these tickets be broken in 2-4 tickets - one to analyse, unserstand and prioritise the nature of the work, and then other fuzzy tickets to actually do the work (depending on what it is) - obviously these would be vague, uncertain and have a planning estimate that is a range, but at least this would give visibility that there is work, as yet unknown, that is unknowable without the initial work, and there is initial work to be done to even give definition to the whole ticket's work. (Note ticket -> multiple backlog items, due to uncertainty all work cannot be known at start of sprint)\n\nAs u/mrhinsh says \"Kanban should make this visible. If refinement dominates, that is a signal about the nature of the work, not a problem to be hidden.\" Basically, make the work that you need to do and the nature of that work visible. \n\nI've seen Scrum perfectionists that insist that only the (initial) analysis be planned into a sprint as that is the only estimable work, but then have managers insist that the unknown work needs to be planned for the current sprint as it cannot wait for the next sprint - in that case, just became evident that Strict Scrum with planned sprints was not appropriate for the work in question. See also #NoEstimates for thoughts (https://www.reddit.com/r/agile/comments/1h63gta/noestimates\\_how\\_does\\_it\\_work/ has a decent summary)",
              "score": 1,
              "created_utc": "2026-01-14 17:02:16",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzknx60",
                  "author": "mrhinsh",
                  "text": "I would strongly advise against breaking work down by activity.\n\nActivities have no value on their own. Value exists only potentially in the outcome that emerges from a combination of activities that results in something usable or inspectable. When work is split into “analysis” and then “delivery”, you create hand-offs, false completion points, and the familiar “analysis is done, my part is finished” behaviour. That weakens empiricism rather than strengthening it.\n\nI do agree with the underlying intent of your comment: the nature of the work and its uncertainty must be visible. Where I disagree is how that visibility is achieved.\n\nThe focus of Scrum, or any empirical approach, is potential value delivery and learning, not accounting for individual actions. Visibility comes from making uncertainty explicit, not from decomposing it into artificially precise steps.\n\nUrgency does not turn uncertainty into commitment; it just increases the cost of pretending it is understood.\n\nOn the “Scrum perfectionists” point, this usually is not Scrum at all. It is a Dunning–Kruger effect: people who understand the mechanics but not the theory. Scrum does not require that everything anyone does is represented as a backlog item. That assumption is simply false.\n\nIn Scrum, only work that is intended to change the Increment must be represented in the Sprint Backlog. There is always significant refinement work that happens before an item is ready to be selected. That work produces learning, clarity, and Product Backlog changes, not increments. It does not need to be planned into the Sprint Backlog to be legitimate or valuable, but it does need to be done deliberately.\n\nTrying to force refinement into “planned sprint work” is exactly how teams end up pretending uncertainty does not exist. Making uncertainty visible is correct. Turning learning into activity tickets is not.",
                  "score": 1,
                  "created_utc": "2026-01-14 17:30:24",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nz09ob9",
          "author": "LightPhotographer",
          "text": "Well analyzed problem, I think you are on to something.\n\nKanban is not about tickets. It is about *visualizing your workflow*. \n\nYou could for instance indicate the work on different axis: effort and value (and they don't need to correspond. Something can be a lot of effort but yield no value in your case).  \nYou could indicate how much effort has been spent on something and how much more you expect to do.  \nYou could indicate uncertainy: In the beginning both the amount of work and expected value are complete guesses. When you put in work you learn more.  \nYou can then discuss (this is the value of Agile): We thought this would be valuable with 5 days of work, I put in 3 days and I can see it's going to be another 10. Do we want to continue or do something else?  (I don't know if giving up is an option)",
          "score": 6,
          "created_utc": "2026-01-11 17:47:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "nz0p5uu",
              "author": "ScaredWish4834",
              "text": "This resonates. Introducing uncertainty as an explicit dimension or metric actually might make a lot of sense. In our case there isn’t really such a thing as “giving up” in the sense of abandoning responsibility. But I can absolutely see us consciously stopping or parking a line of investigation once we’ve learned enough to justify that decision. That outcome itself has value, even if it doesn’t produce a tangible artifact.",
              "score": 2,
              "created_utc": "2026-01-11 18:56:15",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nz0vz8h",
                  "author": "LightPhotographer",
                  "text": "That could be something.   \nA ticket could be a line of investigation - like the harddrive. You can map out how much you have spent on it (x-axis), how much you have learned and how much you feel you can still learn - could be on the y-axis. \n\nYour ticket(s) could be post-its on a grid: they start on the left and each day you work on them they move 1 to the right.  \nYou can move them up if you've investigated something and you should have an indication of how high it can travel up - you could write it on the postit, or add extra post-its above the ticket.   \nThat would show like a vertical bar moving from left to right, with one different colored post-it moving up in the bar when you finish one line of investigation. And the bar would grow if you find more interesting things to investigate. \n\nAt any point you can see at an instant how much work has been spent and if you are investigating interesting things on it, or just keeping yourself busy.\n\nThe harddrive would start with 1 task: basic structure.  Then if you find partitions and hidden partitions and raid and encrypted volumes, you add those as tasks or investigations. When you tackle those one by one, you indicate that as well.\n\nso you can see: You have worked on this harddrive for 2 days, scanned it with different tools, scanned the empty space and there is nothing left to discover. On the other harddrive you discovered encryption, you have been at it for 7 days, perhaps you should leave it alone for now.",
                  "score": 1,
                  "created_utc": "2026-01-11 19:26:42",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nz12gsa",
                  "author": "FlyingMooses",
                  "text": "You should look up RICE framework for introducing confidence/uncertainty and all of that. I’d love to chat about it because I’m in a similar situation and can bounce ideas back and forth if you’re interested",
                  "score": 1,
                  "created_utc": "2026-01-11 19:55:46",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nz0vb1n",
          "author": "Sweaty_Ear5457",
          "text": "totally feel this - forcing concrete tickets on uncertain investigations is painful. what if you map out each investigation visually instead? start with a canvas where you can group findings, evidence, and next steps in sections as they emerge. drag things around as your understanding shifts instead of rewriting tickets. i use instaboard for this kind of exploratory work - it lets the whole team see the investigation evolve organically instead of pretending you know the path upfront",
          "score": 2,
          "created_utc": "2026-01-11 19:23:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz08vd7",
          "author": "Own_Try4793",
          "text": "Use time boxes to address ambiguities",
          "score": 4,
          "created_utc": "2026-01-11 17:43:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz06eyk",
          "author": "adayley1",
          "text": "Each work item can be a question to be answered. As you seek answers, the work item might be bigger or smaller than you thought. That’s fine, write more smaller questions to split the big questions. \n\nPlanning then is about estimating how long getting an answer might take. Check if you’ve had questions like this before. How much work did they take? And so on.",
          "score": 1,
          "created_utc": "2026-01-11 17:32:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz08ajj",
          "author": "RickrackSierra",
          "text": "Is this work the highest priority. After the sprint is done, and the work is still in motion, is the work still the highest priority. Then keep working.\n\nCan you create a ticket for figuring out what needs to get done and a separate ticket for the work once it's known?\n\nEstimates should be higher for things with more uncertainty. Estimate for worst case not ideal case. \n\nThings either take half as long, or twice as long as expected.",
          "score": 1,
          "created_utc": "2026-01-11 17:41:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz09eun",
          "author": "broc_ariums",
          "text": "For investigative/ambiguous work we create an \"analysis only\" or a \"spike\" and timebox or limit the hours to like 8 with the purported outcome being to learn what you're suppose to do and create the actionable user story. For bugs we often also say that, if there enough time/bandwidth, and you know how to fix it, then just fix it.",
          "score": 1,
          "created_utc": "2026-01-11 17:46:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz1gkei",
          "author": "Fr4nku5",
          "text": "When we say Kanban board does that mean: columns: To Do, Doing, Done? \n\n\n\nAs u/LightPhotographer said it visualises the work: you had work not completed in sprints - what was decided in the retrospective about that? \n\n\n\nIf your Kanban board is a reflection of all the process to add value, \"locate fields\", \"verify\", etc ... you can create a cummulative flow and identify the constraint - the reason we don't finish work is the last X tickets got stuck in \"verify\" for 2 sprints, what can we do to get work through \"verify\" faster? (Kanban relies on similarly sized work)\n\n  \nIf you are coping with uncertainty - shorter sprints, the observation of the creator of the OODA loop, is 'in a dogfight, the pilot with the shortest OODA loop, generally, wins\". \n\n  \nI'd like to know what you are using as a definition of done, and what potentially shippable release is made for the sprint review?",
          "score": 1,
          "created_utc": "2026-01-11 21:01:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "nz1t5wi",
              "author": "ScaredWish4834",
              "text": "For me the main issue is that the board (effectively BackLog / To Do / Doing / On Hold /Done) suggests linear, stepwise progress, while the investigative and engineering work is anything but linear. At least from my perspective, a lot of the work is exploratory, recursive, and only becomes clear while doing it — the board doesn’t reflect that reality.\n\nThat ties directly into Definition of Done / shippable increment. That’s where things get fuzzy for us. Most often the “increment” isn’t a tangible artifact, but increased understanding, i.e. ruling something out, learning that a path won’t work, or providing input for a next decision. That kind of value is real, but this abstraction doesn’t map cleanly to the notion of “done”.\n\nThat mismatch is what I’m trying to get my head around.",
              "score": 1,
              "created_utc": "2026-01-11 21:59:08",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nz1z8ii",
                  "author": "LightPhotographer",
                  "text": "So your progress only becomes clear while doing the work, and progress is increased understanding - not striking off tasks that you listed beforehand.\n\nSince kanban is visualizing your work, your kanban board will not be a copy of many task-driven examples.\n\nOne instance of kanban was a Japanese park with a limit on the number of visitors. The visitors got a physical card that they would return when they left the park. When you want to enter the park and there are no cards available you have to wait.\n\nKanban is not limited to rows/colums/tasks. That's just a form that fits many teams.",
                  "score": 2,
                  "created_utc": "2026-01-11 22:28:18",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nz4d23m",
                  "author": "Fr4nku5",
                  "text": "Thanks for clarifying - you have a work management board, and the work can be very different in nature and complexity. The outcomes for the work vary and are not often concluded in a sprint. I think iterative makes sense Cynefin more than Scrum or Kanban :)\n\nI worked with a design team at Lloyds who were starving my development teams of work (stupid consultancy knock off of SAFe - horrible).  Iintroduced Impact Maps and used limiting WIP to improve quality of work. This means \"tickets\" were markers and context was a shared set of documents usually diagrams to describe the reality. \n\nTL;DR: your team are using tickets to explain/predict how, they should be focusing on why - and the surrounding context IMO :) knowing - the next action in an uncertainenvironment is enough :)",
                  "score": 1,
                  "created_utc": "2026-01-12 06:39:04",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nz1vu0o",
          "author": "azangru",
          "text": "It sounds like you are trying to look farther into the future than you can (4 weeks is a long time).\n\nIf you were doing proper kanban, you wouldn't have arbitrary-length iterations, and wouldn't be trying to plan for an iteration ahead.\n\nIf you were doing proper scrum, you would have a product (an investigation perhaps), and would identify the most important things to work on for that product; then you would work on them, inspect the result, and decide how to proceed further. If the work is too uncertain, you reduce the length of the sprint, which shortens the feedback loop, such that you don't need to guess for a long time ahead.\n\n\\> Toward the end of a sprint <...> it often becomes clear that different people had very different expectations of what that ticket actually entailed at the time of planning. The ticket looked concrete on the board, but the shared understanding wasn’t there.\n\nAgain, in proper scrum, developers, i.e. people who are actually going to work on the tickets, pull the tickets in from the product backlog during sprint planning after they have agreed that it is doable, and kinda know what they are going to do. When the ticket has moved from the product backlog to the sprint backlog, developers are free to split it however they feel the best to discover the work.\n\nSo how does it happen that people have different expectations of a ticket during sprint planning? Where was the discussion; how did the ticket appear in the sprint backlog?\n\nAgain, having shorter sprints should help with reducing the size of the bets.",
          "score": 1,
          "created_utc": "2026-01-11 22:11:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz2bhky",
          "author": "Triabolical_",
          "text": "If the uncertainty can be addressed, you use a fixed duration spike. That gets you to a better point in what you know. \n\nIf that doesn't help, you are stuck with an item that you track on your Kanban board and it takes as long as it takes.",
          "score": 1,
          "created_utc": "2026-01-11 23:30:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz2csyh",
          "author": "elliotones",
          "text": "My team handles this in a probably suboptimal way, but it works for us.\n\nA ticket represents a goal. We try to keep things achievable in a day. If a goal made it to the top of the todo list, it’s worth doing, and doing until done. “Solve problem X”. If a sidequest comes up in the course of solving the problem - maybe getting groceries requires getting the car unstuck, for a contrived example - we’ll make a new ticket for that at the end of the day straight into the done column. It shows progress towards the overall goal, and represents the true goal getting easier. The primary ticket stays in the in-progress column and continues to count against the WIP limit.\n\nWe subscribe to #noestimates; doing this in a shop that does sprint planning against velocity will require tracking planned points vs unplanned points and keeping enough unplanned points available.\n\nA tough problem might spin off three or four of these unplanned tickets. A very tough problem might turn out to be uncrackable; in which case the primary ticket is abandoned for a new strategy; but the spinoffs still show the work done (and document the learning) from discovering that.",
          "score": 1,
          "created_utc": "2026-01-11 23:37:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz43e9h",
          "author": "slower-is-faster",
          "text": "Incremental decision making",
          "score": 1,
          "created_utc": "2026-01-12 05:22:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzg1x62",
          "author": "flundstrom2",
          "text": "Certain tasks are better to be timeboxed, likely with the expected outcome being a plan (possibly even new tickets) for how to proceed.\n\n\"Try to figure out as much as possible for 3, 5 or whatnot days. Let's see how far it will take us.\"",
          "score": 1,
          "created_utc": "2026-01-13 23:39:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz02ebj",
          "author": "WRB2",
          "text": "Perhaps you need to identify and the define the work for every drive as a ticket.  Then take those tickets you now understand that define success.  Each item is a story with several tickets for necessary for delivering value.",
          "score": 1,
          "created_utc": "2026-01-11 17:13:10",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qaqism",
      "title": "AB tests are destroying our test suite. How do teams handle this",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1qaqism/ab_tests_are_destroying_our_test_suite_how_do/",
      "author": "olivermos273847",
      "created_utc": "2026-01-12 09:30:58",
      "score": 5,
      "num_comments": 14,
      "upvote_ratio": 1.0,
      "text": "We run like 5 experiments at any time. Different buttons, different flows, different everything.\n\nOur Cypress tests have no idea which variant they're looking at. Sometimes checkout has 3 steps, sometimes 4. Sometimes the CTA is green, sometimes blue. Tests fail randomly depending on which bucket the test runner lands in.\n\nCurrently we just rerun failures and hope but that's not sustainable. Do people write separate tests per variant? Force a specific variant in test env? Something else entirely?\n\nLosing my mind over here. ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1qaqism/ab_tests_are_destroying_our_test_suite_how_do/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "nz4wta0",
          "author": "LightPhotographer",
          "text": "First thought: the automation is not the problem. If a human did these tests, (s)he would need to know what they are looking at.    \nAutomated tests are the same. Give them an identifier of some type so they know which variant they are testing.\n\nBetter:  Perhaps you are testing on the browserlevel too much, perhaps it's better to make tests that work independent of the background color or number of steps and just test the whole flow plus backend, not the individual buttons.  \nOne way to do that is to build them a testscreen with all the buttons+fields on which they can do all the tests.\n\nYou can check the actual user screens manually once: if a button works, it works - there is no need to re-test that every time.  \nIf you move a buttons to another screen, but the function stays the same, then perhaps that is not something that needs an automated test.  What does need a test is that the form is filled and ends up in the database.",
          "score": 7,
          "created_utc": "2026-01-12 09:42:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "nz5a47j",
              "author": "ya_rk",
              "text": "Your comment is overall good and I agree in general, but I'd like to push against the recommendation to move away from browser tests. I believe when people do browser tests they don't only move up a level of abstraction, they also abandon the idea of atomic tests. While our unit & integration tests test one thing at a time, our browser tests test a whole flow start to finish. I believe this is where the problem lies: Long flow tests are brittle, slow, give no information when they fail and therefore difficult to fix, and in the case of OP, difficult to configure with flags.\n\n  \nIf you had atomic browser tests (testing one user action, or only a few user actions at a time), a lot of the pain goes away, including the feature flag problem: If a specific action is related to a flag, you have now two tests: one doing the action with the flag and one without it. The rest of the flags don't matter since they're not part of the atomic action. In this way the tests actually help by documenting the active flags and how they affect the system. When a flag is removed and a choice is made, one of those tests would fail, providing proof that the removal of the flag also removed the now-defunct behavior.",
              "score": 1,
              "created_utc": "2026-01-12 11:41:59",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nz5fgj3",
                  "author": "LightPhotographer",
                  "text": "Browser tests are very expensive. They are incredibly slow (compared to other tests), hard to maintain and they break easily.\n\nTherefore it is fair to ask \"what are we really testing here?\".  Or \"what value does it add to test this via the browser?\"   \nThere can be valid reasons to do it, but we should ask those questions.\n\nIf we are testing that a button triggers the right function, we don't need an automated test to confirm that 20 times a day.\n\nIf we are testing a flow, we may be able to test that one level deeper where we decouple the test from the page-layout.\n\nMany people treat automation like it is automating the steps that a manual tester would do. A manual tester runs everything once and while he's doing his flow, he also tests every screen and every button - especially because it's so time-consuming.  \nAn automated test does not need that.\n\nI've seen someone manually test a function by setting up data and using the browser to go through the flow. Took 1.5 days to do it once.  But the function could (and should) have been tested on the unit-level. Writing the unittest took 1.5 hours and it runs in 0.1 seconds.",
                  "score": 1,
                  "created_utc": "2026-01-12 12:22:27",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nz6jvhc",
                  "author": "hippydipster",
                  "text": "If what you're testing is deep in the app where a user has to navigate to get to it, then so does the test.  That's a lot of setup, and anything the AB tests have changed along the path to get there can mess up your \"atomic\" test long before it gets to what is actually tested.  That makes for a lot of work to make a whole test suite robust in the face of such changes.",
                  "score": 1,
                  "created_utc": "2026-01-12 16:04:08",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nz57uo6",
          "author": "WideFunction6166",
          "text": "CI has to run against deterministic flags. Force variants via a server-side override in the test environment (header/cookie/query param). Example: X-Experiment-Overrides: checkout\\_flow=step4;cta\\_color=blue\n\nThis is a good place to be at 'test maturity is dawning', dont lose you mind :)  It's not Cypress tricks it's about experiments that are *testable by design*.  Ask an AI about patterns.",
          "score": 6,
          "created_utc": "2026-01-12 11:23:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz5gdpd",
          "author": "bomerwrong",
          "text": "you need to force variants in test env. we set a cookie that locks experiments to control group for ci. production gets the real distribution alternatively if your experimentation platform has an api you can fetch the variant and branch your test logic. messier but works",
          "score": 1,
          "created_utc": "2026-01-12 12:29:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz5kld0",
          "author": "Charlie___Day",
          "text": "We had this exact problem. wrote like 3x the tests trying to cover variants and maintenance was a nightmare\n\n\ni am using momentic for e2e and the ai actually handles variant differences pretty well bc its finding elements by intent not exact selectors. not perfect but way better than our brittle cypress setup\n\n\nstill use the cookie approach for anything the ai struggles with tho",
          "score": 1,
          "created_utc": "2026-01-12 12:57:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzgbu0b",
          "author": "sokenny",
          "text": "In my company we decided to ignore experiments for our cypress tests. So basically we set it up so that cypress runs do not get experiments assigned. Its a tradeoff that seems to payoff well all things considered.",
          "score": 1,
          "created_utc": "2026-01-14 00:33:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzib424",
          "author": "danielmauno",
          "text": "This is actually a pretty good use case for AI tools. If you write goal driven tests instead, you can still have them pass - even if the implementations are constantly changing.\n\nFor example, instead of writing a test that does (pseudocode)  \nclick('sign-up')  \nfill('first-field')  \nclick('next')  \netc\n\nYou write: \"Ensure that a user can sign up, and the sign-up process is not longer than 5 steps.\" \n\nI am behind one such product (qatech), but there are more out there.",
          "score": 1,
          "created_utc": "2026-01-14 08:46:11",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qd6ia7",
      "title": "Bored tester trying not to learn bad PO habits — how do I prep for a PO or PO-assistant role?",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1qd6ia7/bored_tester_trying_not_to_learn_bad_po_habits/",
      "author": "twitchrdrm",
      "created_utc": "2026-01-15 01:54:43",
      "score": 4,
      "num_comments": 9,
      "upvote_ratio": 0.7,
      "text": "I’m currently a Salesforce SME and UAT / feature-level tester in a SAFe environment. I work closely with POs, devs, and offshore QA, and a lot of my day is spent preventing features from going to prod held together by vibes, hope, and a Jira description that says “works as expected.”\n\nI also already have a Product Owner certification — the problem is I don’t actually get to *practice* being a PO.\n\nAfter a recent re-org, most of the POs I’m now under are… not great at the fundamentals. Weak problem statements, messy backlogs, acceptance criteria that read like fortune cookies, and very little stakeholder alignment. I’m not trying to dunk on anyone, but I *am* trying to avoid absorbing bad habits through prolonged exposure.\n\nWhat I actually do today:\n\n* Refine acceptance criteria on features (often rewriting them so they’re testable)\n* Write my own test user stories\n* Create detailed test scripts\n* Go back to the PO for feedback/clarification on the feature they wrote\n* **Push back on testing when there’s no evidence of unit testing or basic validation** (because “UAT will catch it” is not a strategy)\n* Execute tests and support demos/release validation in a regulated environment\n\nYes, I know how anti-agile that sounds. I live it.\n\nSo yeah… I’m already doing a decent amount of “shadow PO” work, just without the title or authority.\n\nI’m bored in the healthiest way possible: I have capacity, I care, and I want to grow. I’m interested in moving into a Product Owner or PO-assistant-type role and would love advice on what I can proactively do *now*, beyond collecting certs like Pokémon.\n\nWhat I’m hoping to learn from you all:\n\n* What actually signals “PO readiness” coming from a tester/SME background?\n* What PO-type work is safe to take on without becoming *that* person?\n* When you don’t have strong PO role models, what *good* habits or frameworks should you intentionally practice?\n* What artifacts are worth owning or simulating (roadmaps, discovery notes, backlog refinement, etc.)?\n* Any books, courses, or hands-on exercises that helped you level up as a PO?\n\nI’m not trying to fast-track or title-chase — I just want to learn the role *well*, be useful, and avoid becoming a cautionary tale.\n\nAppreciate any advice, scars, or “learned this the hard way” stories.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1qd6ia7/bored_tester_trying_not_to_learn_bad_po_habits/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "nznwp35",
          "author": "Budget_Pin5828",
          "text": "What you described as shadow po work is not much po work at all. Its also unclear to me where you sit in the connected troikas. So I cant really tell how to explore the PO role from where you are today. \nBeing QA, I assume youre toward the end of the PDLC? Product starts at the front of the PDLC. Explore upstream. \nAs for the certifications... I havent seen great ones that really encapsulate the Product space and roles. Also, where in the Product space you wanna lean into matters from a training/cert context. General PO certs like CSPO and the PMPO dont impress like they did 10yrs ago... \n\n\nOne last thing, the AC for SAFe features dont have to be testable. As a PdM, mine never were. SAFe Features validate or invalidate a benefit hypothesis. So the ac for my features were more outcome driven than test driven. ",
          "score": 3,
          "created_utc": "2026-01-15 03:08:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nznx34s",
          "author": "PhaseMatch",
          "text": "The role of \"product owner\" varies hugely between companies.    \n  \n\\- in Scrum-by-the-Guide  it's really just a set of accountabilities, and the person might have a different job title and a bunch of other stuff they do as well\n\n\\- in other companies the role is really \"backlog manager\", where someone else owns the product vision, roadmap, direction and (ultimately) is the one who decides to end-of-life the product\n\n\\- sometimes the PO has full financial accountability for the costs and revenues, sometimes not\n\nFor me, the best product owners: \n\n\\- are a user domain subject matter expert;   \n\\- can collaborate with the team as an \"onsite customer\"   \n\\- don't have to revert to \"the customer\" or \"the business\" all the time  \n\\- can say \"no\" to customers while keeping a positive relationship  \n\\- they have and own a vision for the product  \n\\- they have a business-outcome oriented roadmap for the product and it's uptake  \n\\- they translates that into a series of business problems for the team to solve  \n\\- they don't bring the team solutions to be implemented  \n\\- listens to the team on refactoring and technical debt  \n\\- knows how to forecast effectively",
          "score": 2,
          "created_utc": "2026-01-15 03:11:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nznnvzb",
          "author": "BoBoBearDev",
          "text": "> * Refine acceptance criteria on features (often rewriting them so they’re testable)\n\nBe careful, the way you described your post, especially later on, there is a chance you micro manage\n\n> * Write my own test user stories\n\nThis is suspicious. Too much details on this leads to micro management. \n\n> * Create detailed test scripts\n\nOut of scope of your role, unless you are talking about script as manual steps. While this is good for TDD, you may again running thin and overtasked and everyone is waiting on you to get this ironed out. You are digging your grave. \n\n\n> * Go back to the PO for feedback/clarification on the feature they wrote\n\nThis is odd, I thought you are talking from a PO perspective based on previous points\n\n\n> * **Push back on testing when there’s no evidence of unit testing or basic validation** (because “UAT will catch it” is not a strategy)\n\n\nIf you are PO, this is a no. Tech lead and PR reviewers should do this. If your tech lead is shit, you have to communicate with your tech lead. \n\n\n> * Execute tests and support demos/release validation in a regulated environment\n\n\nThat's just daily build/deploy? Note, demo is good, but don't rely on it. PR should include all the details and steps on how to test it. It should include pictures or videos if necessary. A live demo is only good for features that has a lot of behaviors and requires a lot of variation of the manual test scripts. You shouldn't rely on live demo.",
          "score": 1,
          "created_utc": "2026-01-15 02:16:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzos258",
              "author": "Cultural-Ambition211",
              "text": "OP is a tester today. They are describing their current role.",
              "score": 1,
              "created_utc": "2026-01-15 06:53:28",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nzvcmug",
              "author": "happycat3124",
              "text": "What tech lead?  You mean you don’t just throw entry level developers on a team with a customer PO and expect the group to self manage to get work done effectively ?",
              "score": 1,
              "created_utc": "2026-01-16 05:29:51",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzo1rk0",
          "author": "fixingmedaybyday",
          "text": "Sounds like you’re the PO of the test product.",
          "score": 1,
          "created_utc": "2026-01-15 03:39:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzoo8s9",
          "author": "mmmleftoverPie",
          "text": "Given you know all the mechanics that contribute to good story/software/jira hygiene, i would suggest getting exposure and experiencing PO things that aren't so obvious, ask to ride along with your POs to upward stakeholder sessions with internal and external stakeholders.  Get exposure to budgeting resources and aligning that to a feature roadmap etc, look for activities that the PO does that don't involve the squad.\n\nAlso, have a think about whether the hands off, loosey goosey approach they have towards so many of the things you mentioned are because they have the squad (you) looking out for them and they have trust in their squad.",
          "score": 1,
          "created_utc": "2026-01-15 06:21:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzovof4",
          "author": "mondayfig",
          "text": "Your best chance is to get a promotion in your own company, or move as QA to another company and pursue a PO role there. Very unlikely you’ll get a PO role elsewhere coming from QA.",
          "score": 1,
          "created_utc": "2026-01-15 07:25:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzu0edh",
          "author": "MarkInMinnesota",
          "text": "Sounds to me like you guys really need a retro or bring in a coach to get your overall process shaped up.\n\nPO’s typically represent the business and manage requests made by the business. Also making sure what gets developed meets the need. \n\nAre there opportunities to meet PO’s elsewhere in your company or in your community? If you could find a way to do some job shadowing that could help you.\n\nAt our company certifications don’t matter, experience is king. Specifically knowing business process is what counts, which QA’s can definitely do.\n\nGood luck!",
          "score": 1,
          "created_utc": "2026-01-16 00:44:09",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qbgry5",
      "title": "Suggest me best project management tool for creative agency",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1qbgry5/suggest_me_best_project_management_tool_for/",
      "author": "shivaguru_c",
      "created_utc": "2026-01-13 03:39:05",
      "score": 4,
      "num_comments": 16,
      "upvote_ratio": 0.64,
      "text": "Hi all,\n\nWe are a team of 10 to 15 and want to manage and track projects from start to finish. We don't want to miss any client feedback or internal feedback. I want to organize all files in that project management tool, from MoM to final creatives. The tool should also be useful for clients because clients refuse to update if the tool is too complex. So, all we need is a simple tool with powerful features. We need to store all related documents and creatives in that tool and manage feedback. So, guys, suggest some of the best tools.\n\nThanks",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1qbgry5/suggest_me_best_project_management_tool_for/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "nzbcczs",
          "author": "spambakedbeans",
          "text": "Have you considered Asana? It has custom forms for new requests that will create tasks for you. This could work as intake for ongoing requests. Tasks also have a comment feature which might work for client feedback.",
          "score": 2,
          "created_utc": "2026-01-13 07:19:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzbgaef",
              "author": "shivaguru_c",
              "text": "Thanks will check.",
              "score": 1,
              "created_utc": "2026-01-13 07:56:14",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzcb2hj",
          "author": "Trustadz",
          "text": "What do you want? Kanban? Customer feedback? There a lot of kanban products that can do this. Managed and self hosted. You can use anything from jira (great with its helpdesk feature for this) to Figma with its commenting system. \n\nMy primary advice would be to focus on version control. The management of projects should preferably be independent of that so you can switch easier",
          "score": 2,
          "created_utc": "2026-01-13 12:30:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzeyp34",
          "author": "Sweaty_Ear5457",
          "text": "lots of solid options here but keeping feedback and creatives together without overwhelming clients is the real challenge. instead of the usual list apps, try mapping projects visually on a canvas. i use instaboard for this - each client gets a section with cards for deliverables, feedback rounds, and files all in one place. they can click directly on what they need without menus. seeing the whole flow from brief to final creative in one view helps catch what's stuck and keeps everyone aligned without making clients learn a complex system.",
          "score": 2,
          "created_utc": "2026-01-13 20:29:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzh07cx",
              "author": "shivaguru_c",
              "text": "Thank you will check it.",
              "score": 1,
              "created_utc": "2026-01-14 02:50:34",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzaiswe",
          "author": "ShivamS95",
          "text": "We are using Slateo. It has simple task management and its own documents module. We are a small team, it works for us.",
          "score": 1,
          "created_utc": "2026-01-13 03:46:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzaj2ij",
              "author": "shivaguru_c",
              "text": "Thank you will check that.",
              "score": 1,
              "created_utc": "2026-01-13 03:48:08",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzawy8c",
          "author": "zero-qro",
          "text": "In that case using notion it's a good idea. You can manage documents in notion and it also has task management",
          "score": 1,
          "created_utc": "2026-01-13 05:15:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzax2uk",
              "author": "shivaguru_c",
              "text": "Thank you will check.",
              "score": 1,
              "created_utc": "2026-01-13 05:16:11",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzx63gc",
          "author": "Artistic_Concert_177",
          "text": "oh man, I feel this. we're a similar size and tried like 5 different tools before finding something that actually stuck. clients HATE logging into yet another complicated platformit's like pulling teeth.\n\nwhat finally clicked for us was using something built for client work, not just internal teams. we use CoordinateHQ now, which sounds fancy but honestly it just gives clients a simple portal they access via email (no password crap). they can drop feedback right on files and it auto-updates our tasks. we keep everything therebriefs, revisions, final assetsso nothing gets lost in slack or email chains.\n\nit's not perfect (what tools is lol) but clients actually use it, which was the whole battle for us. before that, we were using Asana and clients would just ignore it and email us anyway, defeating the whole purpose.\n\ngood luck! it's a journey for sure.",
          "score": 1,
          "created_utc": "2026-01-16 13:59:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzxa0al",
          "author": "SalamanderOwn156",
          "text": "we're about your size and went through this exact struggle last year. clients HATE complicated tools  we lost so much feedback in email chains because they just wouldn't log into asana or clickup.\n\nwhat finally clicked for us was using something built specifically for client work, not internal teams. we use CoordinateHQ now and the main thing is clients get a simple portal link via email, no password. they can literally just click and drop feedback on the actual files. all our moms, briefs, and final assets live there in each project, so nothing gets lost.\n\nits not perfect  the reporting took some getting used to  but having clients actually participate without a million reminders saved my sanity. might be worth a look since youre dealing with the same client-resistance issue. what are you currently using?",
          "score": 1,
          "created_utc": "2026-01-16 14:20:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzccken",
          "author": "IamSynin",
          "text": "I can’t say it’s the best, but I’m building a small tool called Storytrack for teams who want the full narrative of a project in one place (client feedback → internal decisions → changes → outcomes), so you can answer “why did we do this?” months later without digging through Slack/email/jira. If that’s a pain for you, happy to share it. It’s also free while in beta so it’s a win.",
          "score": 1,
          "created_utc": "2026-01-13 12:40:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzccrhy",
              "author": "shivaguru_c",
              "text": "Nice to hear! Can you share me the link please?",
              "score": 1,
              "created_utc": "2026-01-13 12:42:07",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzcelxr",
                  "author": "IamSynin",
                  "text": "Sure, just head to https://storytrack.co and request access.",
                  "score": 0,
                  "created_utc": "2026-01-13 12:54:17",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qcnrlz",
      "title": "Step by step example of Agile project management",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1qcnrlz/step_by_step_example_of_agile_project_management/",
      "author": "sergiofm",
      "created_utc": "2026-01-14 13:50:23",
      "score": 4,
      "num_comments": 21,
      "upvote_ratio": 0.67,
      "text": "Hi,\n\nI'm reading alote of Agile and what i miss is a project step by step example. I know it depends of the context but i wold like a practice example with all the steps. Is there a book or site that i can view that? \n\nThanks,",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1qcnrlz/step_by_step_example_of_agile_project_management/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "nzjls5p",
          "author": "Adorable-Strangerx",
          "text": "Its easy:\n1. Try doing something.\n2. See what went wrong\n3. Figure out how to do it better.\n4. Go to 1.",
          "score": 11,
          "created_utc": "2026-01-14 14:32:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzjnco6",
              "author": "DonKlekote",
              "text": "It's as simple as that but if you're interested there's more science theory to it [https://en.wikipedia.org/wiki/PDCA](https://en.wikipedia.org/wiki/PDCA)",
              "score": 4,
              "created_utc": "2026-01-14 14:40:15",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzjt4u6",
          "author": "funbike",
          "text": "Agile is a mindset, not a process.\n\nAre you a sole developer?  Agile was designed for a team (but some of it can be applied to a sole programmer).\n\nThere are several processes that attempt to apply most of Agile's values and principles.  Most well known: Scrum, Kanban, XP (extreme programming).\n\nIt's very common for people to think Scrum == Agile, but that's false.",
          "score": 7,
          "created_utc": "2026-01-14 15:09:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzjufky",
              "author": "sergiofm",
              "text": "Yes, I'm solo developer and I'm learning now in a perspective that in the future work in a team. I will read about the processes.",
              "score": 1,
              "created_utc": "2026-01-14 15:15:36",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o08x9bq",
                  "author": "WaylundLG",
                  "text": "Usually when people say agile, they mean scrum and you can look at the guide for free on scrumguides.org.",
                  "score": 1,
                  "created_utc": "2026-01-18 06:07:53",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzjr1wx",
          "author": "dnult",
          "text": "You should adapt agile to your business. It depends on the nature of what your doing, and how your teams interact with each other. There are best practices that may help, but no playbook. My recommendation would be to focus more on objectives and desired outcomes, then find a system that delivers. If you treat agile like a prescription, you may or may not get the desired results.\n\nIdeally a successful agile implementation simplifies the process of estimation, sets limits on capacity, facilitates collaboration, improves communication, and is based on trust and transparency. Continuous improvement is a key element.",
          "score": 3,
          "created_utc": "2026-01-14 14:58:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzn038j",
          "author": "DeusLatis",
          "text": "Your question doesn't really make sense since as others have pointed out Agile is a mindset not a project management system.\n\nRead the agile manifesto and 12 principles of agile\n\nhttps://agilemanifesto.org/\n\nhttps://agilemanifesto.org/principles.html\n\nIf you want a framework that attempts to implement agile look at something like Scrum and the events that take place inside a sprint. But it is important to understand that a Scrum sprint is not \"agile\", in the same way that implementing a security standard like ISO 27001 is not \"security first mindset\"\n\nhttps://scrumguides.org/scrum-guide.html#scrum-events",
          "score": 3,
          "created_utc": "2026-01-15 00:03:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzjomya",
          "author": "Budget_Pin5828",
          "text": "When you say 'project step by step example', do you mean a Gantt chart?  Are you an Agile Project Manager or a Scrum Master or something else?  I can't clearly understand the context of your question.",
          "score": 2,
          "created_utc": "2026-01-14 14:46:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzjpxsl",
              "author": "sergiofm",
              "text": "No, what I want is a simulation of a project that shows all the processes from beginning to end.",
              "score": 1,
              "created_utc": "2026-01-14 14:53:24",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzjqrq4",
                  "author": "Budget_Pin5828",
                  "text": "Define beginning to end.  Agile mindset is much different from Project mindset.  So 'beginning to end' actually means different things in context.  For clarity, I was a PMP for 10yrs before I went Agile in early 2005.  \nIf you want 'all process from beginning to end' then you might be looking for a development value stream.  However, this might not be correct.  As agilists, we don't really believe in one prescribed process for all things.  We have guiding principles, and the process and tools enable us to implement those principles.  As others have already said, its a PDCA cadence.",
                  "score": 2,
                  "created_utc": "2026-01-14 14:57:35",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzl9y9g",
          "author": "PhaseMatch",
          "text": "What underpins agility is two core things\n\n\\- make change cheap, easy, fast and safe  \n\\- get fast feedback on whether that change created value.\n\nWithin that, there is no fixed approach;  there are a collection of core practices and concepts that apply in different contexts, but the key element is \"lightweight\";    \n  \nBy making sure that changing things is not expensive, hard, slow and risky you don't need a formal set of project management controls and sign-offs to support delivery.  You can use working software as a probe to uncover the real requirements, for example, rather than going through a stage-gate process.\n\n**Extreme Programming Explained** (Kent Beck, 2004) really covers off the technical core of agile software delivery in a lot of ways, showing how the core practices come together to avoid building things that will never be used, and adopting lean philosophies around \"building quality in\"",
          "score": 2,
          "created_utc": "2026-01-14 19:08:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzlkmus",
          "author": "Sweaty_Ear5457",
          "text": "yeah this is the hardest part about learning agile - everything you find is theory and mindset stuff but nobody actually shows you what it looks like in practice. instead of looking for a written example, try mapping out a fake project yourself. make sections for the main phases like backlog, sprint planning, review, and retrospective. then use arrows to show how a feature card moves through each one and what gets updated along the way. i use instaboard for this since you can drag things around and actually see the whole flow on one canvas instead of reading about it abstractly",
          "score": 2,
          "created_utc": "2026-01-14 19:56:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzreh0c",
          "author": "cosmopoof",
          "text": "Try the following: take a 2 week vacation. Plan out every single part of it in advance. Every piece of travel. Every activity. Make restaurant reservations for lunch and dinner well in advance. As well as free time activities. Include outdoor activities. Decide well in advance where exactly you will park your car, where you will refuel, where you will take toilet breaks, and so on.\n\nIf you have the plan complete, act it out. Enjoy your relaxing holiday. See if something happens that was unexpected or if your requirements changed since you made the plan. See how much the plan fails.\n\nAfter you return home, repeat the thing. And think if there's a way to improve on that.\n\nIf you are able to do that, think about how it applies to developing software.",
          "score": 2,
          "created_utc": "2026-01-15 17:16:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzjoear",
          "author": "Trustadz",
          "text": "Think in terms of products, not projects",
          "score": 2,
          "created_utc": "2026-01-14 14:45:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzjsbst",
              "author": "nborders",
              "text": "And delivering prioritized backlog instead of tasks in sequence",
              "score": 3,
              "created_utc": "2026-01-14 15:05:20",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qdcedd",
      "title": "Why do we still estimate tasks manually when we have years of historical data sitting in Jira?",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1qdcedd/why_do_we_still_estimate_tasks_manually_when_we/",
      "author": "pablank_r",
      "created_utc": "2026-01-15 06:42:40",
      "score": 4,
      "num_comments": 41,
      "upvote_ratio": 0.58,
      "text": "",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1qdcedd/why_do_we_still_estimate_tasks_manually_when_we/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "nzosd1p",
          "author": "Internal-Alfalfa-829",
          "text": "You mean as opposed to having Rovo try to do it? Not sure I'd leave this to a machine because it doesn't know all the 2nd level context in the back of our heads. By the time we feed it with that, just doing the estimate ourselves is 10x faster.\n\nPlus remember *why* we estimate: It’s about the conversations much more than the number. Making the team think through the requirement and find out what's unclear. We shall not outsource thinking to the machine.\n\nExperimenting is always an option but I'd probably try NoEstimates first, if average task sizes are identical enough over time.",
          "score": 20,
          "created_utc": "2026-01-15 06:56:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzph4pg",
              "author": "pablank_r",
              "text": "What if the tool already had all that context \nlike it knew your codebase, past sprints, who worked on what? Not to replace the conversation but just give the team a starting point to argue from instead of starting at zero",
              "score": 1,
              "created_utc": "2026-01-15 10:48:53",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzq125l",
                  "author": "Flashy-Whereas-3234",
                  "text": "Nobody would mind a widget that says \"AI thinks it's 12 points because <bullet points>\" if only the team responsible for the task saw it. It's a serving suggestion, a helpful hand, a reminder of things you might have missed.\n\nBut you can bet your ass that all levels of management will see it, and they'll take it as the TRUE figure. It'll turn into a competition to somehow make the team meet the AIs estimate.  Why are you so far off the AI estimate? Your whole backlog is 1000 points we said it would be clear by the eofy. Why are you falling behind. Why is your team under performing.",
                  "score": 6,
                  "created_utc": "2026-01-15 13:16:48",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nzq741j",
                  "author": "Internal-Alfalfa-829",
                  "text": "That's not context. Context is things like \"We think this could be a problem because...\", \"We already did such and such thing many  years ago and it was hard because of human issue X\", \"Compliance with law X requires a different, non-obvious solution\", \"New standard X is comingin 6 months anyway\", \"I did thing X at my previous job\" - All of which lead to a different estimate, making the AI one useless.\n\nAI is a yes-man. It will do what you tell it to, even in moments when the correct answer is: \"This is the wrong thing to do, do X instead\".\n\nA pre-fed number will also bias the team's estimations.\n\nI'm not opposed to finding ways of making things easy with AI. But we're talking about saving only the last few minutes of the conversation, sometimes even only the last few seconds. Its liken spending 100 bucks to save 10 bucks. All of that with the potential trade-off of bias (influencing the number a team member gives) and cognitive atrophy. The friction of estimations is necessary. The interesting part is if the benefits outweigh the downsides or solutionism sneaking in. I'm not convinced. But that's what experimentation is for.",
                  "score": 3,
                  "created_utc": "2026-01-15 13:50:31",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nzqu4gc",
                  "author": "Jazzlike_Argument33",
                  "text": "The amount of time we spend talking about the points is minimal in my team. If we spend more time talking about it, it's more likely a discussion about how to break up a ticket into more reasonable and distinct slices of functionality than a debate over whether something is 3 or 5 points.",
                  "score": 1,
                  "created_utc": "2026-01-15 15:44:44",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o00zj2n",
                  "author": "CodeToManagement",
                  "text": "The team don’t start from zero. They know the codebase and who built what and what happened in past sprints",
                  "score": 1,
                  "created_utc": "2026-01-17 00:59:17",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzpdzog",
          "author": "lucky_719",
          "text": "It's not about the points. The points have never mattered and if you think that's a problem to solve you need to upskill on agile.",
          "score": 7,
          "created_utc": "2026-01-15 10:20:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzosyjg",
          "author": "Ciff_",
          "text": "What problem are you solving?\n\nWe estimate as a refinement aid to align on complexity. The estimate itself takes seconds. The discussions can take allot more. The former there is no point in automating. The latter cannot be automated as the discussions is the purpose",
          "score": 11,
          "created_utc": "2026-01-15 07:01:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzp1ekz",
              "author": "IQueryVisiC",
              "text": "Our boss always pointed to some old similar story. Cherry picked by fastest delivery. My team mate would always estimate too fast , I mean we used wall clock without velocity. Velocity is kinda locking at the old stories . Also check out which stories ended up being to big. It always the same people who push them into the sprint.",
              "score": 1,
              "created_utc": "2026-01-15 08:18:10",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzphi0a",
                  "author": "pablank_r",
                  "text": "The cherry-picking thing is so real. Boss finds the one time something shipped fast and now that’s the benchmark forever. Would be nice to have actual data to push back with like “yeah that one was fast but here’s the 10 similar ones that took 3x longer”",
                  "score": 1,
                  "created_utc": "2026-01-15 10:52:10",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            },
            {
              "id": "nzph7ky",
              "author": "pablank_r",
              "text": "So if there was a baseline number before refinement.\nwould that speed up the discussion or just create more arguments? Like at least you’d have something to push back on instead of pulling numbers out of thin air",
              "score": 1,
              "created_utc": "2026-01-15 10:49:36",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzpkgyd",
                  "author": "Ciff_",
                  "text": "A common language is good, a baseline of what an sp is works for that. You don't need necessary though since you can stick to pair vise comparison. And establishing a baseline happens automatically by the second refinement.",
                  "score": 1,
                  "created_utc": "2026-01-15 11:18:06",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzoy44a",
          "author": "tb5841",
          "text": "Estimation is, where I am anyway, a way tonprotect yourself from overwork. If the company dumps a massive unreasonable task on us at short notice, we can estimate it at 13 points and make it clear that we can't also do everything else they wanted this sprint. It gives us sone measure of control over our work/life balance.\n\nAs soon as we're not estimating manually, we lose that control.",
          "score": 3,
          "created_utc": "2026-01-15 07:47:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzphkss",
              "author": "pablank_r",
              "text": "What happens when management brings their own numbers though? Like “our consultant says 2 weeks”, at least if the team had a data-backed starting point, you’d have something to defend with, no?",
              "score": 1,
              "created_utc": "2026-01-15 10:52:52",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzqfs9y",
                  "author": "Just_Information334",
                  "text": ">our consultant says 2 weeks\n\nGood! Now you know how much to pay your consultant to do it.",
                  "score": 1,
                  "created_utc": "2026-01-15 14:36:08",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o00ynbe",
                  "author": "practicalbackpocket",
                  "text": "Management should _never_ bring estimates to the team. The team knows the work better than anyone else.",
                  "score": 1,
                  "created_utc": "2026-01-17 00:53:55",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o00ypmv",
                  "author": "CodeToManagement",
                  "text": "If you work somewhere with bad management a tool isn’t going to change that",
                  "score": 1,
                  "created_utc": "2026-01-17 00:54:19",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o06yci2",
                  "author": "Wiszcz",
                  "text": "Let the consultant do it in 2 weeks",
                  "score": 1,
                  "created_utc": "2026-01-17 23:15:16",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzqfkm0",
          "author": "Just_Information334",
          "text": "I ain't beholden to an estimate I did not make. It's gonna be done when it's done.",
          "score": 3,
          "created_utc": "2026-01-15 14:35:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzqh3y0",
          "author": "funbike",
          "text": "That's a naive and un-agile take.",
          "score": 3,
          "created_utc": "2026-01-15 14:42:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzot238",
          "author": "PhaseMatch",
          "text": "\"We\" don't.\n\nLoads of lean/agile teams ditched manual estimation and story points years ago.  \nThere's even plugins for Jira/ADO (GetNave) if you can't work out statistical forecasting for your self, but it's perfectly possible to run a serviceable Monte Carlo forecasting system in EXCEL.\n\nAnd Monte Carlo as an approach isn't just limited to forecasting delivery either, so it's a decent tool to add your your box of tricks.",
          "score": 2,
          "created_utc": "2026-01-15 07:02:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzqtj5k",
          "author": "Jazzlike_Argument33",
          "text": "The estimation and even the points that come from it are not the goal. They are a byproduct of the necessary conversation from backlog refinement and ensure everybody understands what the work entails rather than everybody signing off that a ticket is going to take 2 days or whatever. The point is to encourage communication, clear up any misunderstandings, and broadly understand the complexity of a particular task. Estimation shouldn't be used to task-master a team.",
          "score": 2,
          "created_utc": "2026-01-15 15:42:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzsansw",
              "author": "Kearlex",
              "text": "Wild that I had to scroll this far to find the first person who actually understands the value in estimation",
              "score": 1,
              "created_utc": "2026-01-15 19:40:29",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzoxwrj",
          "author": "Tallmaris",
          "text": "You have years of experience showering and getting ready every morning, yet if I ask you how long will it take to get you ready tomorrow, you'll say something like \"15 - 20 minutes\", basically giving me a 25% uncertainty range on something small and super known. \n\n\nWhat makes you feel you're going to give me a more precise estimate on something big and unknown? Estimating is useless",
          "score": 3,
          "created_utc": "2026-01-15 07:45:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzphnaq",
              "author": "pablank_r",
              "text": "So if estimation is useless, how do you scope work for clients? Even a rough starting point helps sometimes, no? At least gives you ground to negotiate from",
              "score": 1,
              "created_utc": "2026-01-15 10:53:29",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o00z998",
                  "author": "practicalbackpocket",
                  "text": "Does your team have a story point matrix? Mine always have. Past stories that were examples of what fell under the points.\n\nThat’s where my teams have usually negotiated from, comparing the new work to past work. \n\nHonestly, pointing was usually a simple discussion because of that. People vote, if someone was way off from the rest, they’d explain their vote. If the rest of the team thought they were right, they’d switch that persons estimate.",
                  "score": 1,
                  "created_utc": "2026-01-17 00:57:38",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzosidd",
          "author": "Z-Z-Z-Z-2",
          "text": "You don’t need estimates. You need continuous refinement and forecasting. Estimation is helpful but ultimately is a waste. Look into Monte Carlo simulation and let your team work.",
          "score": 2,
          "created_utc": "2026-01-15 06:57:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzp1ery",
          "author": "BoBoBearDev",
          "text": "Because every story is basically the same 3pt. 5pt is the max and done rarely. 8pt is forced to split up per typical suggested example from the books. \n\n\nThe estimated is only there for the devs to say,\n\n\n> fuck you PO the story is too big, go split it up.\n\n\nThe true value is how you worded the stories and how you described MVP with actionable Acceptance Criteria. The story point is just a pseudo rating system on how good the story is made.",
          "score": 2,
          "created_utc": "2026-01-15 08:18:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzp1nxp",
          "author": "signalbound",
          "text": "Because then we can uphold the Story Point bureaucracy where we can artificially inflate points to help managers show they're doing a better job and get raises.",
          "score": 2,
          "created_utc": "2026-01-15 08:20:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzphvkb",
          "author": "RDOmega",
          "text": "Because estimates are about establishing pretext for blame.",
          "score": 1,
          "created_utc": "2026-01-15 10:55:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzsa2pe",
          "author": "PhaseMatch",
          "text": "There's usually a core issue to address FIRST.  \n  \n**- all estimates contain assumptions and a degree of uncertainty**;  if we don't communicate the assumptions and uncertainty effectively, they we are likely to get into conflict\n\n**- forecasts build from estimates are not delivery contracts;**  the assumptions in the estimates are risks, and the uncertainty needed to be included.  If we don't communicate this, we get into conflict\n\nWhether the estimates (and forecasts) are developed by experts \"manually\", using statistical analysis or a combination of the two there will still be assumptions and uncertainty. With statistical data the core one is \"the past represents the future\" when it comes to work delivery \n\nI've found in general that \n\n\\- statistical approaches work well in an agile context;  by that I mean we're sticking closely to core \"Extreme Programming\" concepts like \"slicing small\" to support early defect detection, fast feedback on value, and waste reduction\n\n\\- estimating \"big\" things is often based done in a wide-band delphi way with the team, but use an appropriate yardstick (ie Sprints or weeks) and allow that to be a range (3-5) not a fixed value (4)\n\n\\- you address uncertainty and assumptions in estimates through spikes (or indeed Sprints);  time boxed activity with a specific goal to help you learn more  \n  \n\\-always communicate all of this to stakeholders;  make the risks and assumptions transparent",
          "score": 1,
          "created_utc": "2026-01-15 19:37:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzsxmc9",
          "author": "teink0",
          "text": "Let's say you have millions of data records showing how long it takes people to win a game of sudoku. How will you use that to determine how long the next game of sudoku will take?",
          "score": 1,
          "created_utc": "2026-01-15 21:26:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzxhi6j",
          "author": "MSTie_4ever",
          "text": "I really think task estimation is seriously flawed. We tend to underestimate tasks that are new to us, and we estimate like people are fungible. They’re not. A person new to the project is going to take much longer than someone with years of experience.",
          "score": 1,
          "created_utc": "2026-01-16 14:57:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzxyubz",
          "author": "Colt2205",
          "text": "I use scrum / agile on a personal day to day basis.  When I'm estimating completion time I always have the actual completion time in the next column in my excel and keep track of what this entire thing applies to in terms of the software feature or what not.  The main reason I do this is to measure technical debt, which can be reduced if tasks are made to deal with that technical debt.\n\nIf I addressed technical debt, the completion time of the next task would naturally be reduced under that category.  At the same time there would be an entry for that specific task of addressing technical debt under that category that would likely complete faster than the prior tasks (at least from my own experience).  \n\nSo I'm not really following why, under any situation, someone would think it is a good idea to try and automate predicting how long a task takes.  That sounds like a formula for making someone burn a weekend to meet an artificial deadline.",
          "score": 1,
          "created_utc": "2026-01-16 16:15:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzp264g",
          "author": "darknetconfusion",
          "text": "Not all teams are equally capable in a given technology. One developer was really fast in vue , but one year later he was replaced by someone unfamiliar with the framework. Team size, composition, the speed of decisions in the company, dependencies from teams .. all of these factors contribute to complexity and are subject to change.",
          "score": 1,
          "created_utc": "2026-01-15 08:25:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzphw7v",
              "author": "pablank_r",
              "text": "Yeah team changes mess everything up. One guy leaves and all your past estimates mean nothing. Wonder if tracking per-person velocity would help at least you’d know “this estimate assumed we had a Vue expert, now we don’t”",
              "score": 1,
              "created_utc": "2026-01-15 10:55:38",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzp41ci",
          "author": "WRB2",
          "text": "Because no two tasks are exactly the same.",
          "score": 0,
          "created_utc": "2026-01-15 08:43:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzpi0v9",
              "author": "pablank_r",
              "text": "Tru, but patterns exist right? Like “every time we  payments it takes longer than expected”\nthat kind of context could help even if tasks aren’t identical",
              "score": 1,
              "created_utc": "2026-01-15 10:56:45",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzs8x0n",
                  "author": "WRB2",
                  "text": "Is that a task or is that part of the story?",
                  "score": 1,
                  "created_utc": "2026-01-15 19:32:26",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qdghj6",
      "title": "My first sprint in 2026",
      "subreddit": "agile",
      "url": "https://www.reddit.com/r/agile/comments/1qdghj6/my_first_sprint_in_2026/",
      "author": "yukittyred",
      "created_utc": "2026-01-15 10:53:56",
      "score": 1,
      "num_comments": 12,
      "upvote_ratio": 0.57,
      "text": "Over the past two weeks, I’ve been reflecting on why our Scrum process feels broken, and I want to share our current situation to get an outside perspective. Officially, we use Agile Scrum, and on paper the process looks reasonable. User stories appear to be sprint-sized, and we still run sprint planning and other ceremonies. However, the way management interprets and enforces the process fundamentally contradicts how Scrum is supposed to work.\n\nOne major issue is how user stories are treated during delivery. Management does not accept that a user story should be completed collectively by the whole Scrum team within a sprint. Instead, stories are evaluated and approved based on individual man-days. Effort is calculated per person, not as a team commitment. This turns user stories into time-accounting units rather than sprint-level goals, and it removes the idea of shared ownership and collaboration.\n\nAt a higher level, epics are still considered the entire project, while milestones are treated as phase-based breakdowns, similar to waterfall. Each milestone contains only a few user stories, but those stories bundle many features and dependencies. Although these stories look like sprint-sized items, they actually represent a large amount of work spread across multiple people and a long duration, justified through man-day calculations rather than sprint capacity.\n\nSprint planning becomes mostly ceremonial. The scope and effort expectations are effectively decided upfront through man-day assumptions, leaving little room for the team to challenge feasibility or break work down meaningfully. No one really speaks up during planning, not because the issues aren’t obvious, but because the delivery model is already fixed outside the Scrum framework. Planning becomes alignment with pre-approved numbers instead of a collaborative discussion about what can realistically be delivered in one sprint.\n\nThe Product Owner role is also heavily constrained. The PO is not fully allowed to write or refine user stories independently. Acceptance criteria and Definition of Done are decided centrally (mainly by the unit head), which turns user stories into rigid contracts instead of flexible, value-driven items. This prevents proper backlog refinement and removes the PO’s ability to negotiate scope or adapt stories based on feedback and sprint learnings.\n\nOrganizationally, there is a strong control dynamic. The section head prefers to centralize decisions and processes, which limits the unit head’s autonomy and ability to support the team properly. As a result, the unit head enforces rigid and often unrealistic business processes that don’t actually help delivery. This creates a lack of trust in the team’s ability to self-organize and deliver outcomes, reinforcing the reliance on man-day calculations instead of empirical progress.\n\nOverall, the core problem is not that our user stories are obviously too big on paper, but that Scrum is being overlaid on top of a waterfall, control-driven mindset. User stories are treated as individual cost units, not as sprint-level team commitments. Leadership does not appear to trust the team to deliver collectively, and key roles are not allowed to function as intended. Because of this, the process looks Agile on the surface, but behaves very differently in practice.\n\nI’m sharing this to understand whether others have experienced similar “Agile in name only” setups, and how they’ve handled working within—or escaping—this kind of system.\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/agile/comments/1qdghj6/my_first_sprint_in_2026/",
      "domain": "self.agile",
      "is_self": true,
      "comments": [
        {
          "id": "nzpluvw",
          "author": "ya_rk",
          "text": "It's not that your Srum process is broken, you're not doing Scrum. Sure, you're using some Scrum terminology and structures, but a guy wearing a bear costume isn't a bear. Your org is a traditional waterfall org that's wearing a Scrum costume.\n\nThere might be cultural elements at play. Broadly speaking, some types of businesses (and some cultures) have a certain way of doing things that make it harder to actually adopt agile. You might be facing a company culture or even a regional culture that favor hierarchy, centralized decision making and emphasis on risk control, making true agility practically impossible to adopt broadly.",
          "score": 11,
          "created_utc": "2026-01-15 11:29:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzpmawo",
          "author": "Fr4nku5",
          "text": "I've worked in sprints since 2003, at about 20 blue chip companies.\n\nHere is as much generalisation about Scrum as I can confidently say:\n\n\"Most places do it differently, some industries find it harder than others. The best deviations from the norm are made with full awareness of the organisational impediments necessitating the change\"",
          "score": 5,
          "created_utc": "2026-01-15 11:33:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzqfh5l",
          "author": "dnult",
          "text": "Lots going on here and some of it sounds normal - like using day-points (or man days as you call it) for estimates. That makes estimation easier and aligns well with capacity of each team member. Are you also considering risks and dependencies in your estimation process? Just be sure your point scale makes sense. A 1 and a 2 point story should be equivalent to a single 3 point story.  Similarly, a 3 and a 5 point story should be equivalent to a single 8 point story. Try having the PO establish objectives instead of defining user stories - like, \"complete development of X\" or \"Y deployment complete\". Then have the team flesh out those objectives with user stories. Use those retrospectives to fine tune the process and continuously improve.",
          "score": 2,
          "created_utc": "2026-01-15 14:34:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzpo1n9",
          "author": "DingBat99999",
          "text": "A few thoughts:\n\n* The core problem is not that you're stories are too big.\n* The core problem is that you're trying to wedge a collaborative, bottom up, empirical, feedback based process into a command and control, top down, predictive, wish based culture.\n* What was the original driver that led to using Scrum? Management can hardly have understood Scrum and still signed off on its usage.\n* To me, there feels like are a few ways you could find yourself in this situation:\n   * Scrum was a grass roots movement\n   * Significant portions of management are not communicating with each other. Someone launched Scrum without getting buy in from the rest of the management tier.\n* If you have an agile coach or champion, they either do not know their job, or they do and they've realized this is a boondoggle and are simply cashing their checks.\n* My recommendation:\n   * For the sake of the people in the teams, stop doing Scrum.\n   * Have a \"come to Jesus\" meeting. Review why Scrum is even being attempted. Are those goals reasonable and achievable?\n   * Explain the obvious conflicts between the intent of Scrum and the current environment.\n   * Either get some buy in for an actual Scrum trial or discard Scrum altogether.\n   * If you don't have a champion for Scrum that can talk to management, get one.\n\nScrum is probably the most demanding agile method, when it comes to up front organizational change. Management likely made the assumption that the change was for the line workers, not for them. If management has no intention of changing, then Scrum is doomed and you're just wasting time, money, and sanity.",
          "score": 1,
          "created_utc": "2026-01-15 11:47:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzpo1w1",
          "author": "psgrue",
          "text": "“Agile doesn’t work” claims every organization that says they’re doing Agile but aren’t. We had a fundamental contract problem. A lot of government contracts were created with annual deliverable goals. The offshore developer contracts billed by the hour. The structure in between was supposed to be Scaled Agile. \n\nThose were three completely different measurement units of input, throughput, and output. I had to accept that 1 point = 8 hours and break the agile terminology. I had to encourage PO/PM package development stories into MVP bundles of discrete functionality.  I had to treat a bloated release train like a solution train of four release trains in dashboard and reporting. I moved value determination to the PM issue creation instead of the PI planning then replaced the Inspect and Adapt ceremony with RCA topics pulled from Retrospectives.\n\nNone of it was scaled agile by definition but it worked really well.\n\nAgile is a framework. Breaking it where it needed to be broken and adapting it where it needed to be adapted made it work.",
          "score": 1,
          "created_utc": "2026-01-15 11:47:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzq8y1o",
              "author": "Kenny_Lush",
              "text": "Which is why there needs to be a new name for one of them. The ‘agile’ OP describes strikes me as the norm: STAND UP to micromanage today, SPRINT to micromanage two weeks, and Jira to micromanage the rest. That is literally what ‘agile’ is seemingly everywhere.",
              "score": 1,
              "created_utc": "2026-01-15 14:00:23",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzqd4me",
          "author": "WaylundLG",
          "text": "Can confirm - Agile in name only definitely happens a lot of places, but this is by far the purest form of just sticking agile words onto an unrelated process I've ever seen. Furthermore, even from a waterfall standpoint this is terrible project management. We used to do an exercise in classes called Designed to Fail where we asked students to design a process that would fail no matter what you did. This looks like it came out of that exercise. Sorry you are dealing with it.",
          "score": 1,
          "created_utc": "2026-01-15 14:22:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzr1pa9",
          "author": "Laicbeias",
          "text": "If its not working you arent doing it right. ",
          "score": 1,
          "created_utc": "2026-01-15 16:18:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nztyrqw",
          "author": "jbroshin",
          "text": "Your core problem is the leadership and it's top-down control culture. There is no escape from poor leadership - either the company fails or you leave.\n\nTL;DR - get out now!",
          "score": 1,
          "created_utc": "2026-01-16 00:35:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzz62j9",
          "author": "recycledcoder",
          "text": "A very quick heuristic: if \"Agile Scrum\" is mentioned, the rest of a post has absolutely nothing to do with agility. For context: no such thing exists.\n\n* There is agility, yes (lower case important, not \"Agile\". Ever).\n* There is Scrum, yes. \n* Scrum is one of the agility-aligned frameworks out there, yes. \n\n\"Agile Scrum\", however, is not a thing.",
          "score": 1,
          "created_utc": "2026-01-16 19:27:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzpm6dc",
          "author": "UKS1977",
          "text": "Are those real peoples names in the post? I recommend changing those to some better naming convention - I.e. replace \"Bob\" with \"Managing Director\"",
          "score": 1,
          "created_utc": "2026-01-15 11:32:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzpngp4",
              "author": "yukittyred",
              "text": "Ops I go change",
              "score": 2,
              "created_utc": "2026-01-15 11:42:50",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    }
  ]
}