{
  "metadata": {
    "last_updated": "2026-01-17 16:48:01",
    "time_filter": "week",
    "subreddit": "AIAssisted",
    "total_items": 20,
    "total_comments": 225,
    "file_size_bytes": 166695
  },
  "items": [
    {
      "id": "1qc8mfn",
      "title": "Best AI GF Platform ?",
      "subreddit": "AIAssisted",
      "url": "https://www.reddit.com/r/AIAssisted/comments/1qc8mfn/best_ai_gf_platform/",
      "author": "Beautiful_East_2779",
      "created_utc": "2026-01-14 00:34:11",
      "score": 54,
      "num_comments": 17,
      "upvote_ratio": 0.88,
      "text": "Hey guys, kinda new to this AI thing, im seeing a lot of different recommend⁤ations to AI platfor⁤ms but i didn't test any myself.\n\nCould you guys suggest some platfor⁤ms you are us⁤ing as of the moment? Thank you.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/AIAssisted/comments/1qc8mfn/best_ai_gf_platform/",
      "domain": "self.AIAssisted",
      "is_self": true,
      "comments": [
        {
          "id": "nzidcfw",
          "author": "dpakrj",
          "text": "Would you not prefer to be create your own AI girlfriend based on your needs? I can suggest a platform",
          "score": 3,
          "created_utc": "2026-01-14 09:08:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzh7w3f",
          "author": "Tony_009_",
          "text": "No restrictions and filters in r/TAVO_AICHAT",
          "score": 2,
          "created_utc": "2026-01-14 03:35:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzi12ez",
          "author": "Beautiful_East_2779",
          "text": "let me know if anyone can help",
          "score": 2,
          "created_utc": "2026-01-14 07:11:47",
          "is_submitter": true,
          "replies": []
        },
        {
          "id": "nzgtso0",
          "author": "MaximumStock7",
          "text": "So you are trying to advertise AI GFs?",
          "score": 3,
          "created_utc": "2026-01-14 02:14:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nziq3p7",
          "author": "abhaychaurasiya85",
          "text": "Probably DarL⁤ink AI, kinda addictive with deep rp (strong memory) + unce⁤nsored (image, video gen...=",
          "score": 1,
          "created_utc": "2026-01-14 11:06:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzjqg3t",
          "author": "Cromo13",
          "text": "if you’re just starting out, it really comes down to what you care about most chat quality, visuals, or memory. one thing i learned pretty fast is not to trust hype posts too much. comparison sites can help narrow things down a bit like spicy ranks, and subs like r/chatbots or r/aipartner are useful for seeing what real users are actually trying. that way you at least have some direction instead of going in blind.",
          "score": 1,
          "created_utc": "2026-01-14 14:55:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzjubbr",
          "author": "HikariWS",
          "text": "If u want very long term chat, Nomi is very good, but even it ends up struggling after 2 years.\n\nIf u wanna chat and RP with characters, SillyTavern is by far the best platform, all proprietary services are censored too.",
          "score": 1,
          "created_utc": "2026-01-14 15:15:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzk38xo",
          "author": "Apple12Pi",
          "text": "https://tbio.ai works well for NSFW tasks but it has a chat gpt like interface",
          "score": 1,
          "created_utc": "2026-01-14 15:56:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzkxnfl",
          "author": "Hopeful-Group7812",
          "text": "I Would say [the⁤se](https://docs.google.com/spreadsheets/d/17cWRjvbPwM4MT7CfTuNdUU2IBa9xHEhLAcGizvIJHGI/edit?gid=1135982146#gid=1135982146) are the be⁤st we have so far, might be interesting to take a deep look",
          "score": 1,
          "created_utc": "2026-01-14 18:13:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzsomri",
              "author": "Western_Reporter_810",
              "text": "Amazing rank, thank you !",
              "score": 1,
              "created_utc": "2026-01-15 20:45:18",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzl9l2j",
          "author": "Overall_Zombie5705",
          "text": "if you are looking for yourself. then I would hope and suggest you to go out more... otherwise plenty of recommendations here..",
          "score": 1,
          "created_utc": "2026-01-14 19:06:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzlu0eo",
          "author": "SecretBanjo778",
          "text": "if you want something simple to start with, Replika or Nomi are easy entry points. they’re more on the wholesome side though.\n\nif you want something that feels more realistic and grows with you over time, i’ve been using Erogen because the personality stays consistent and actually remembers past conversations. the character creation is also flexible without being overwhelming. AND!! it takes privacy and boundaries seriously which made me feel more comfortable sticking with it.\n\ni guess it all depends on what you’re looking for, but those are solid places to start.",
          "score": 1,
          "created_utc": "2026-01-14 20:39:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzgf7xs",
          "author": "[deleted]",
          "text": "[removed]",
          "score": -4,
          "created_utc": "2026-01-14 00:51:44",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qdnwdv",
      "title": "Has anyone successfully used AI headshots for professional purposes without people noticing?",
      "subreddit": "AIAssisted",
      "url": "https://www.reddit.com/r/AIAssisted/comments/1qdnwdv/has_anyone_successfully_used_ai_headshots_for/",
      "author": "Unique-Persimmon2291",
      "created_utc": "2026-01-15 16:18:51",
      "score": 24,
      "num_comments": 19,
      "upvote_ratio": 0.86,
      "text": "Thinking about using AI-generated headshots for my LinkedIn, company website, and conference speaker bios, but I'm worried about the \"something feels off\" factor even if I can't articulate what it is. I've seen reviews where people say modern AI headshot tools have gotten way better than the early versions from 2023-2024 that looked like wax figures, but I'm skeptical about whether they're actually indistinguishable from real photography.\n\nSomeone in a productivity thread mentioned they used [Looktara](http://looktara.com) for their startup team headshots and nobody questioned whether they were real or AI-generated. That's encouraging, but I'm wondering if people just didn't say anything even though they noticed. For people who've used AI headshots in professional contexts: have clients, colleagues, or employers ever commented that your photos looked AI-generated? Or has it been completely unremarkable and nobody notices or cares ?\n\nAlso curious about which specific use cases feel acceptable versus risky. Like, LinkedIn profile seems fine, but what about investor pitch decks, professional licenses, or conference materials where credibility really matters? What's been your actual experience using these in business settings ?",
      "is_original_content": false,
      "link_flair_text": "Help",
      "permalink": "https://reddit.com/r/AIAssisted/comments/1qdnwdv/has_anyone_successfully_used_ai_headshots_for/",
      "domain": "self.AIAssisted",
      "is_self": true,
      "comments": [
        {
          "id": "nzr48ms",
          "author": "Express_Memory_8236",
          "text": "I've been using AI headshots on LinkedIn, my consulting website, and client proposals for about 8 months. Zero comments from anyone. Not clients, not colleagues, not prospects.",
          "score": 4,
          "created_utc": "2026-01-15 16:30:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzr43r4",
          "author": "Mobile_Syllabub_8446",
          "text": "Nobody really cares about headshots anyway, even at a \"second glance\" when meeting it could be makeup (even for men...) and lighting and photoshop. Same/same.",
          "score": 3,
          "created_utc": "2026-01-15 16:29:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzt5af9",
          "author": "Gelu_Bumerang",
          "text": "I used an AI headshot for LinkedIn a few months ago and honestly no one commented on it at all. Neither positive nor negative. I think if the photo looks normal and not overly perfect, most people don’t even consider that it might be AI.",
          "score": 2,
          "created_utc": "2026-01-15 22:02:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzr4v00",
          "author": "MeThyck",
          "text": "The acceptability question is less about the tool and more about the output quality. If your AI headshots have that plastic skin look or impossible lighting, people will notice something's off. If they look like normal professional photography with realistic texture, nobody cares or can tell.",
          "score": 1,
          "created_utc": "2026-01-15 16:33:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzr5umn",
          "author": "Pretend-Raspberry-87",
          "text": "\n\nI used Looktara for my startup team headshots (6 people) and we've used them in pitch decks, on our website, and in press materials. Over 30+ investor meetings, nobody's ever mentioned anything.",
          "score": 1,
          "created_utc": "2026-01-15 16:37:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzrbk8n",
          "author": "Adventurous-Pool6213",
          "text": "I've been doing my headshots from [GenTube](http://gentube.app?_cid=cm) for Linkedin and no one ever says anything!",
          "score": 1,
          "created_utc": "2026-01-15 17:03:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzrnf56",
          "author": "Affectionate_Rise366",
          "text": "If you make it good no one will ever find out.",
          "score": 1,
          "created_utc": "2026-01-15 17:56:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzrqs45",
          "author": "Accurate_Apricot_827",
          "text": "I think many people on LinkedIn use it nowadays. The profile picture is so small on the page that usually people don't notice so the risk is pretty low (and I don't think most people care)",
          "score": 1,
          "created_utc": "2026-01-15 18:11:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzrtgoa",
          "author": "ReadingRedditAllDay",
          "text": "I've done it and get lots of compliments.",
          "score": 1,
          "created_utc": "2026-01-15 18:23:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzs68vy",
          "author": "Independent-Cook304",
          "text": "AI-generated photos are getting more and more realistic now. I tried generating some with an app, and honestly, the results were way better than going to a photo studio, no spending that much money or time, and the photos turned out much better.",
          "score": 1,
          "created_utc": "2026-01-15 19:20:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzsqcv7",
          "author": "Spiritual-Army-4738",
          "text": "Used AI headshots for LinkedIn/website ~6 months ago. Zero comments, zero issues.\n\n**Reality check:**\n- Most people don't scrutinize headshots that closely\n- If it looks professional + matches your actual appearance roughly, nobody cares\n- The \"uncanny valley\" stuff is mostly in your head (or from 2023-era tools that were genuinely bad)\n\n**Where it works fine:**\n- LinkedIn, company website, email signatures, Slack profiles\n- Conference speaker bios (unless you're keynoting and they're printing giant posters)\n- Internal company directories, team pages\n\n**Where I'd avoid it:**\n- Anything requiring legal ID verification (licenses, badges, official docs)\n- High-stakes investor decks *if* you're meeting them in person soon (mismatch = weird)\n- Press/media where journalists might reverse-image search\n\n**Pro tip:** Use AI headshots as a *starting point*, then do one real photoshoot when stakes get higher. But for 90% of \"I need a decent headshot for normal business stuff,\" AI is totally fine and nobody notices.\n\nThe people who \"can tell\" are either pixel-peeping or lying. Most professionals barely glance at headshots.",
          "score": 1,
          "created_utc": "2026-01-15 20:53:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzusgnk",
          "author": "Mysterious-Eggz",
          "text": "I put AI generated headshot I made with Magic Hour on my linkedin and none of the recruiters nor my friend say something about it. they don't care tbh, they pay attention that you care and make effort to look professional but they don't care whether it's AI generated or studio shot. just make sure the face showing resembles you irl",
          "score": 1,
          "created_utc": "2026-01-16 03:21:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzv6ej1",
          "author": "ops_architectureset",
          "text": "what we see repeatedly is that people rarely comment unless something feels off. the failure mode is not “this looks ai,” it is subtle credibility loss that never gets voiced. ai headshots tend to work when they are conservative and boring. they break when they optimize for polish. the riskier the context, investors or conferences, the more people rely on gut checks rather than pixels.",
          "score": 1,
          "created_utc": "2026-01-16 04:47:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzwtuir",
          "author": "Fearless_Fox45",
          "text": "Based on my observations most people are unaware or they don't care if AI headshot looks realistic or more natural. Quality plays the hard part",
          "score": 1,
          "created_utc": "2026-01-16 12:50:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzxoyl0",
          "author": "Major_Fill_670",
          "text": "read this blog [https://truepixai.com/blog/photorealistic-ai-generation.html](https://truepixai.com/blog/photorealistic-ai-generation.html)",
          "score": 1,
          "created_utc": "2026-01-16 15:32:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzyrj74",
          "author": "AnteaterRealistic482",
          "text": "I’ve used an AI headshot from a tool like InstaHeadshots for LinkedIn and internal work profiles, and similar to what others here are saying, it’s been completely unremarkable, no comments, no questions, and nothing that suggested anyone noticed or cared.",
          "score": 1,
          "created_utc": "2026-01-16 18:22:40",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qeikik",
      "title": "How I earned 123 backlinks with AI-assisted outreach (18% success rate vs 2-3% for manual)",
      "subreddit": "AIAssisted",
      "url": "https://www.reddit.com/r/AIAssisted/comments/1qeikik/how_i_earned_123_backlinks_with_aiassisted/",
      "author": "Efficient-Yam6797",
      "created_utc": "2026-01-16 15:12:59",
      "score": 23,
      "num_comments": 7,
      "upvote_ratio": 0.92,
      "text": "Built an AI-assisted system around \"best of\" lists that generated 123 backlinks in 4 months with 18% success rate without guest posts or buying links.​ The context was a marketing blog stuck at DA 19 with slow link acquisition. Guest posts took weeks per placement with 2-3% success rates. The insight was \"best of\" lists get updated regularly and owners actively look for quality additions, so you're helping them not begging.​ Here's where AI came in. First step was AI-assisted prospecting. Searched for \"marketing blogs to follow 2025\", \"best marketing blogs 2026\", then dropped URLs into an AI workflow to classify by niche and relevance. That filtered 180 opportunities down to relevant ones.​\n\nSecond step was smart qualification at scale. AI summarized each list and flagged last updated date, whether descriptions looked curated versus spam, and whether listed sites were similar tier. That cut the list from 180 to 68 high-quality targets.​ Foundation mattered before outreach could convert. A [directory submission campaign](http://getmorebacklinks.org/) had already moved the site from DA 8 to 19, so when list owners checked the blog it didn't look like zero-authority domain. That credibility boost made outreach actually convert.​\n\nThird step was AI-personalized outreach not templates. For each list, AI drafts included custom intro referencing specific resources on their list, argument for why my blog fit, 2-3 strongest articles summarized, and offer to share their list with my audience. Each draft was lightly edited by hand so it sounded human.​ Initial results showed 22 emails with 19% response rate and 4 placements. Scaled to 100+ pitches maintaining 17-18% reply rates. Total came to 123 backlinks in 4 months, mostly contextual editorial links from DA 30-70+ domains. Quality breakdown showed 67 links from DA 30-50, 41 from DA 50-70, and 15 from DA 70+ sites.​ Time efficiency was 35 minutes per outreach versus 4-6 hours per guest post. Success rate of 18% versus 2-3% for manual. Got 123 links in 4 months versus maybe 20-25 guest posts with same effort.​\n\nThe takeaway is AI didn't do link building alone. It found opportunities faster, pre-qualified targets, and drafted 80-90% of outreach leaving humans for final polish. Leverage came from combining AI speed with human judgment and genuine value.",
      "is_original_content": false,
      "link_flair_text": "Other",
      "permalink": "https://reddit.com/r/AIAssisted/comments/1qeikik/how_i_earned_123_backlinks_with_aiassisted/",
      "domain": "self.AIAssisted",
      "is_self": true,
      "comments": [
        {
          "id": "o02hi58",
          "author": "Low-Oil7883",
          "text": "Did u use a specific tool for the prospecting part or just gpt?",
          "score": 7,
          "created_utc": "2026-01-17 07:21:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzxqyif",
          "author": "Mel_Ran",
          "text": "Quality breakdown 67 links DA 30-50, 41 links DA 50-70, 15 links DA 70 plus averaging DA 47 contextual editorial placements. All from relevant content not footer spam showing best of list strategy works",
          "score": 1,
          "created_utc": "2026-01-16 15:41:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzxrt0n",
          "author": "ActualBee2492",
          "text": "Directory campaign moving DA 8 to 19 before outreach gave credibility when list owners checked. Foundation authority making AI-assisted pitches convert vs getting ignored from zero-authority domains",
          "score": 1,
          "created_utc": "2026-01-16 15:44:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzxsz74",
          "author": "Any_Butterscotch_610",
          "text": "Which AI tool handled the workflow for classifying by niche and summarizing lists, ChatGPT API or something purpose-built for link prospecting like Postaga or BacklinkGPT?",
          "score": 1,
          "created_utc": "2026-01-16 15:50:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzzepts",
          "author": "Actonace",
          "text": "Wow, that's awesome proof that smart AI workflows plus real human touches can actually turn outreach into real backlinks.",
          "score": 1,
          "created_utc": "2026-01-16 20:07:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o01d95z",
          "author": "ops_architectureset",
          "text": "the pattern that stands out here is ai being used to qualify and filter, not just spray messages. what usually breaks these efforts is pushing volume without tightening relevance first. the success rate makes sense if most of the work happened before the first email was sent.",
          "score": 1,
          "created_utc": "2026-01-17 02:26:32",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qd72ul",
      "title": "If you’re unconfident and talking to someone you like, this kind of tech could easily be used to mislead anyone. Is this beneficial, or is it going too far? It’s honestly scary.",
      "subreddit": "AIAssisted",
      "url": "https://v.redd.it/15x9pnprafdg1",
      "author": "bricko15",
      "created_utc": "2026-01-15 02:20:03",
      "score": 19,
      "num_comments": 50,
      "upvote_ratio": 0.64,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/AIAssisted/comments/1qd72ul/if_youre_unconfident_and_talking_to_someone_you/",
      "domain": "v.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "nznpjco",
          "author": "GentlemanDiamond",
          "text": "This is scary and will just be used to scam people i feel like",
          "score": 13,
          "created_utc": "2026-01-15 02:26:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzodbsy",
              "author": "jsseven777",
              "text": "Yup, considering we never got a handle on scam calls or emails before AI I can only imagine how bad this is going to get once AI scams really start taking off. \n\nThe government should be investing in figuring out how to counter what’s going to happen, but as usual they won’t and regular people are going to have to fend for themselves against it.",
              "score": 3,
              "created_utc": "2026-01-15 04:57:19",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzof837",
                  "author": "bricko15",
                  "text": "Exactly. We never really solved scam calls or phishing in the first place, so adding AI into the mix feels like pouring gas on the fire. Tech like Higgsfield is impressive, but the misuse potential is hard to ignore.",
                  "score": 3,
                  "created_utc": "2026-01-15 05:10:51",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            },
            {
              "id": "nzqmndv",
              "author": "Doug24",
              "text": "Agreed. This can only end bad with lots of scams especially elder people",
              "score": 1,
              "created_utc": "2026-01-15 15:09:55",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nznxidn",
              "author": "bricko15",
              "text": "I don’t think the tech is evil, but yeah man, people can absolutely use it in the wrong way.",
              "score": 1,
              "created_utc": "2026-01-15 03:13:35",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o018pdv",
                  "author": "Prestigious-Shape998",
                  "text": "What is the right way of using this technology? Please give me examples where it will be beneficial?",
                  "score": 1,
                  "created_utc": "2026-01-17 01:57:34",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nzq0vai",
              "author": "ionshower",
              "text": "Somebody from another country could easily foil an online interview and work remotely without every disclosing their actual true identity.\n\nAnyway I have 12 jobs to get back to , money doesn't grow on trees!",
              "score": 0,
              "created_utc": "2026-01-15 13:15:40",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzotbmq",
          "author": "Still-Bar-7631",
          "text": "It is absolutely awfull.",
          "score": 6,
          "created_utc": "2026-01-15 07:04:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzovmfa",
          "author": "stabledisastermaster",
          "text": "Impersonating a kid seems to be the most evil ... seeing that sent a shiver down my spine.",
          "score": 6,
          "created_utc": "2026-01-15 07:24:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzq3apn",
              "author": "LyriWinters",
              "text": "Didnt know 20 year olds were kids...",
              "score": -1,
              "created_utc": "2026-01-15 13:29:39",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzq5c1r",
                  "author": "stabledisastermaster",
                  "text": "Well, tell me how old the last two look.",
                  "score": 2,
                  "created_utc": "2026-01-15 13:40:57",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzoo46w",
          "author": "manesc",
          "text": "As much as I love Ai. This is getting scary.",
          "score": 2,
          "created_utc": "2026-01-15 06:19:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzptk1y",
              "author": "bricko15",
              "text": "Yeah man! Higgsfield AI isimpressive, but it’s definitely a double-edged sword.",
              "score": 1,
              "created_utc": "2026-01-15 12:28:06",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzr72k5",
                  "author": "Geritas",
                  "text": "Higgsfield ai is just a shady platform that aggregates different models made by not higgsfield ai. There is nothing impressive about higgsfield ai, except for the amount of people spamming Reddit with ads for it.",
                  "score": 2,
                  "created_utc": "2026-01-15 16:42:55",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzqtuu5",
          "author": "Geritas",
          "text": "Again, Higgsfield ad. The literal trash platform.",
          "score": 2,
          "created_utc": "2026-01-15 15:43:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o00dxox",
              "author": "JustSoYK",
              "text": "Either way this is entirely doable with non-commercial open source tools, locally on your own PC.",
              "score": 1,
              "created_utc": "2026-01-16 22:56:44",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nzr1clg",
              "author": "bricko15",
              "text": "Man, I wish this was a paid ad at least I’d be getting a check. 😂 I’m just a broke guy with trust issues who’s worried we’re never gonna know who we’re actually talking to on video anymore. lol",
              "score": 0,
              "created_utc": "2026-01-15 16:17:13",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzr5inr",
                  "author": "Geritas",
                  "text": "Why is there a logo on the video?",
                  "score": 2,
                  "created_utc": "2026-01-15 16:35:59",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nznxtsw",
          "author": "mikeyaurelius",
          "text": "It’s not live (yet).",
          "score": 1,
          "created_utc": "2026-01-15 03:15:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzpnwqr",
              "author": "cool-beans-yeah",
              "text": "What do you mean? \n\nAs in: not in real-time?",
              "score": 1,
              "created_utc": "2026-01-15 11:46:19",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzpoezc",
                  "author": "mikeyaurelius",
                  "text": "It’s a recorded video that gets transformed. It doesn’t work (yet) in realtime.",
                  "score": 3,
                  "created_utc": "2026-01-15 11:50:17",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzorlo1",
          "author": "Adventurous_Crab_0",
          "text": "I would like to do this in my stand up.",
          "score": 1,
          "created_utc": "2026-01-15 06:49:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzq6n3f",
              "author": "bricko15",
              "text": "Haha yeah, that could work. more about the joke and storytelling than tricking anyone.",
              "score": 1,
              "created_utc": "2026-01-15 13:48:00",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzp77d3",
          "author": "AmsterPup",
          "text": "What is the benefit of this? \n\nWhat does it do thats useful? \n\nWill it be used in honestly with good intentions... No, ofc not",
          "score": 1,
          "created_utc": "2026-01-15 09:14:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzql508",
              "author": "Matluna",
              "text": "Company pushing this is hoping to make big money. And some of the big bucks guys are hoping to subvert the information space.\n\nI'd say that's the worst of it. Then you have people who want to save money on some cgi work, or people who want scam someone's nana.",
              "score": 1,
              "created_utc": "2026-01-15 15:02:38",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzpm912",
          "author": "Longjumping-Spot7071",
          "text": "reality distortion",
          "score": 1,
          "created_utc": "2026-01-15 11:32:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzpwmmg",
          "author": "d0ntreply_",
          "text": "what really is the point of this technology, like seriously? face replacement has been a thing in movies and tv for years because it served a purpose, to serve the story and entertain. but now that its out in the public, what use case is there for this technology? i just dont see any good that can come of this.",
          "score": 1,
          "created_utc": "2026-01-15 12:48:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzq77mm",
              "author": "bricko15",
              "text": "Yeah man! The upside is creative freedom and accessibility, the downside is obvious if it’s abused.",
              "score": 1,
              "created_utc": "2026-01-15 13:51:03",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzq1zhw",
          "author": "Own-Tennis3038",
          "text": "looks weird asf",
          "score": 1,
          "created_utc": "2026-01-15 13:22:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzq88ea",
              "author": "bricko15",
              "text": "Yeah so weird! Tech is insanely advanced now compared to the early days kinda makes me miss when everything felt more innocent.",
              "score": 1,
              "created_utc": "2026-01-15 13:56:34",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzq55pz",
          "author": "moldentoaster",
          "text": "Why is shit literally SPAMMED all over reddit today",
          "score": 1,
          "created_utc": "2026-01-15 13:39:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzr5voc",
              "author": "Geritas",
              "text": "It’s an ad campaign. Higgsfield ai is a shady ai model aggregator. They have been doing this obnoxious marketing campaign for at least a couple of months pretending to be real people",
              "score": 2,
              "created_utc": "2026-01-15 16:37:37",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzt4z3a",
                  "author": "moldentoaster",
                  "text": "Thx, thats what i thought, bullshit obnoxious ads for bullshit tool.",
                  "score": 1,
                  "created_utc": "2026-01-15 22:00:31",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzq82bq",
          "author": "Beneficial_Aside_518",
          "text": "I don’t see any positive from this",
          "score": 1,
          "created_utc": "2026-01-15 13:55:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzqax1x",
              "author": "bricko15",
              "text": "Agreed! But I actually see a huge plus for privacy here. If you want to be a public figure or an influencer without giving up your literal face or your safety to the world. It becomes scary when it’s used for scamming.",
              "score": 2,
              "created_utc": "2026-01-15 14:10:57",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o01zy2a",
                  "author": "Confident_Growth_620",
                  "text": "Yeah huge fucking plus for privacy. \n\nYou only need to record your face, upload it to a third party, that would relay your request to another third party and get their answer going through the first third party before it reaches you. \n\nSurely it’s not going bite someone in the ass privacy-wise.",
                  "score": 1,
                  "created_utc": "2026-01-17 04:57:26",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzq830k",
          "author": "gmfc95",
          "text": "Too far. I love AI but this applied to normal society would be an enormous mistake.",
          "score": 1,
          "created_utc": "2026-01-15 13:55:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzqkd6p",
          "author": "Matluna",
          "text": "This kind of technology is a net negative.",
          "score": 1,
          "created_utc": "2026-01-15 14:58:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzsbn93",
          "author": "Meringue-Horror",
          "text": "People used to assume that when you see someone this person you are seeing is the one you are talking to and this was not always the case.\n\nNow you cannot assume that who you see is who you are talking to anymore. Therefore, in a way, AI has made us more aware of what reality actually is.\n\n![gif](giphy|26ufdipQqU2lhNA4g)",
          "score": 1,
          "created_utc": "2026-01-15 19:44:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzsyl39",
          "author": "New_Application_7641",
          "text": "Now this is just scary 💀",
          "score": 1,
          "created_utc": "2026-01-15 21:31:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzumaew",
          "author": "EwokNuggets",
          "text": "Absolutely going too far. There’s no application I can think of where this could’ve used for anything good.",
          "score": 1,
          "created_utc": "2026-01-16 02:46:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzv0rjt",
          "author": "AnotsuKagehisa",
          "text": "So for those early Monday meetings where you want a stand in for your face.",
          "score": 1,
          "created_utc": "2026-01-16 04:10:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzp6si8",
          "author": "madaradess007",
          "text": "THE REAL SCARY PART IS:  \nit's real people in the video acting like ai avatars, look for it and you will see\n\nand no one noticed it",
          "score": -2,
          "created_utc": "2026-01-15 09:10:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzpjfz7",
              "author": "on_nothing_we_trust",
              "text": "Its not.",
              "score": 2,
              "created_utc": "2026-01-15 11:09:16",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzq1alj",
                  "author": "Admirable-Builder878",
                  "text": "I don't think it is ai.",
                  "score": 0,
                  "created_utc": "2026-01-15 13:18:13",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nzsf15n",
              "author": "WTFaulknerinCA",
              "text": "No one hired those union-member actors to portray themselves in this video.",
              "score": 1,
              "created_utc": "2026-01-15 20:00:25",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qbno4p",
      "title": "What AI tools do you use the most in 2026?",
      "subreddit": "AIAssisted",
      "url": "https://www.reddit.com/r/AIAssisted/comments/1qbno4p/what_ai_tools_do_you_use_the_most_in_2026/",
      "author": "Abhi_10467",
      "created_utc": "2026-01-13 10:12:58",
      "score": 16,
      "num_comments": 34,
      "upvote_ratio": 0.91,
      "text": "For me:\n\n* **ChatGPT** – I use this almost daily. Brain dump, planning, overthinking… it handles all of it better than I do most days\n* **Claude & Gemini** – Got these recommended a while back and now I rotate between them for writing, summaries, and school-related stuff. Each one has its own strengths.\n* **Suno** – Still my favorite for messing around with music ideas. Not replacing real production, but great for quick inspiration.\n* **Gensmo** – Super convenient when I don’t feel like putting outfits together. Surprisingly decent suggestions.\n* **Zoviz** – I’ve been using it lately for branding-related things (logos, visuals, quick design assets). I’m not a designer, so having something that keeps things consistent without much effort has been helpful.\n\nCurious what everyone else is relying on this year. Are you sticking with a few core tools or constantly trying new ones as they pop up?",
      "is_original_content": false,
      "link_flair_text": "Opinion",
      "permalink": "https://reddit.com/r/AIAssisted/comments/1qbno4p/what_ai_tools_do_you_use_the_most_in_2026/",
      "domain": "self.AIAssisted",
      "is_self": true,
      "comments": [
        {
          "id": "nzdfqj2",
          "author": "InterYuG1oCard",
          "text": "So far it’s been GPT for chat and Saner for todos",
          "score": 3,
          "created_utc": "2026-01-13 16:07:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzc1b1m",
          "author": "Own_Dependent_7083",
          "text": "I mostly use YourGPT for custom AI agents and daily workflows, and Perplexity when I need fast, reliable research.",
          "score": 2,
          "created_utc": "2026-01-13 11:13:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzc2w2j",
          "author": "nit-kam",
          "text": "Pretty similar setup on my side. I use ChatGPT as my daily driver, Claude and Gemini when I want cleaner writing, and Suno mostly just for fun.",
          "score": 2,
          "created_utc": "2026-01-13 11:27:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzchi6q",
          "author": "Competitive_Act4656",
          "text": "I can relate to your struggle with context loss, especially when working on long-term projects. I used to have to repeat myself constantly with ChatGPT and Claude, which was a real drag. I’ve found that using tools like myNeutron and Mem0 has really helped me keep track of my notes and outputs. With myNeutron's free option, I was able to manage everything without losing any context across sessions. It’s made my workflow a lot smoother.",
          "score": 2,
          "created_utc": "2026-01-13 13:12:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzeua12",
              "author": "Mobile_Discount7363",
              "text": "I use [https://www.useengram.com/](https://www.useengram.com/) basically a local brain for VS Code. It plugs into AI IDEs, remembers context, prevents repeat mistakes, and helps me ship faster. Free and fully local.",
              "score": 1,
              "created_utc": "2026-01-13 20:08:24",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzcn3am",
          "author": "Tsundere5",
          "text": "Mostly sticking to a small core honestly. ChatGPT is still my daily goto for thinking, planning and writing. I’ll occasionally bounce to Claude or Gemini for a second opinion or cleaner summaries. For fun/creative stuff, Suno is still hard to beat. I try new tools here and there but if it doesn’t earn a regular spot fast, I drop it. Too many tools is mental clutter to me.",
          "score": 2,
          "created_utc": "2026-01-13 13:45:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzdyjxg",
          "author": "Late_Researcher_2374",
          "text": "I’ve noticed I’ve stopped chasing new tools and just doubled down on the ones that remove daily friction.\n\nOutside the obvious chat models, the biggest impact for me has been around email:\n\n* **HeyHelp** to triage and prioritize messages so I’m not constantly deciding what matters, and draft email replies to important ones.\n* **DragApp** to turn Gmail into a shared inbox and workspace with tasks and ownership, which keeps things moving without extra tools.\n\nOnce email stopped being chaotic, everything else (tasks, planning, focus) got easier.   \nI’m firmly in the “few core tools that stick” camp now.",
          "score": 2,
          "created_utc": "2026-01-13 17:45:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nze4cot",
          "author": "Own_Amoeba_5710",
          "text": "Claude Code, ChatGPT and Gemini.",
          "score": 2,
          "created_utc": "2026-01-13 18:11:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nze94jl",
          "author": "Objective_Prize8610",
          "text": "For me - Claude code, chatgpt, notebooklm and cursor. I use the myndo extension to share saved context between these\n\nWasn't familiar with the two last tools you've mentioned, will check these out. Thanks!",
          "score": 2,
          "created_utc": "2026-01-13 18:32:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzbx3mv",
          "author": "Common-Moose5484",
          "text": "Qwen and Gemini cli, in addition to Gemini chat. Those just for coding",
          "score": 2,
          "created_utc": "2026-01-13 10:37:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzc733z",
              "author": "FamousSheamusAI",
              "text": "Are you using Gemini CLI in an IDE when coding? If so, which one? I'm about to start a project this week using Antigravity for the first time.",
              "score": 2,
              "created_utc": "2026-01-13 12:01:41",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzbyj9f",
          "author": "Relevant_Novel_2513",
          "text": "Tesora Lifestyle is good for custom drips!",
          "score": 1,
          "created_utc": "2026-01-13 10:49:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzbz9fn",
              "author": "Relevant_Novel_2513",
              "text": "Can someone post reviews for this?",
              "score": 1,
              "created_utc": "2026-01-13 10:56:03",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzeaxzh",
          "author": "Loud-Choice-7443",
          "text": "Same here with ChatGPT I use it for everything from planning to overthinking 🤣. I rotate Claude for summaries and lately I'm using for a quick video edits this LipSync video for fun talking clips. I stick to a few go to tools but always check out whatever new AI pops up.",
          "score": 1,
          "created_utc": "2026-01-13 18:40:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzeesz5",
          "author": "LieAccurate9281",
          "text": "I've been using Vimerse Studio a lot lately,  it's a lifesaver for swiftly transforming concepts into social media videos without much editing, particularly for branding or marketing pieces. Beyond that, Claude and Gemini remain my go-to for summaries or more structured content, but ChatGPT still manages the majority of my writing, planning, and brainstorming tasks. Zoviz fills in well for fast design assets while maintaining consistency in the looks.  \n  \nTo be honest, rather than chasing every new release, the sweet spot is to discover a few basic tools that satisfy most demands.",
          "score": 1,
          "created_utc": "2026-01-13 18:57:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzetml5",
          "author": "Mobile_Discount7363",
          "text": "I mostly use [https://www.useengram.com/](https://www.useengram.com/) as a local brain for VS Code and AI IDEs, so I don’t repeat the same mistakes and can ship faster.",
          "score": 1,
          "created_utc": "2026-01-13 20:05:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzf8sb3",
          "author": "Nicolas-maillot",
          "text": "There are truly AI tools for everything today, and more and more of them, from Nano Banana to chatgpt or automatic transcriptions. Having fun with them is essential to stay connected and ahead. Here's a site that lets you search for tools by theme: https://www.bestfreetools.io/ , enjoy!",
          "score": 1,
          "created_utc": "2026-01-13 21:16:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzfis7a",
          "author": "Salt-Phrase4108",
          "text": "As a digital media creator I have been using Leonardo Ai a lot for creating art,I find it  affordable and a great alternative to midjourney,https://quiettoolkit.blogspot.com/2025/12/which-current-ai-image-generator-is-best.html\nAlso chatgpt is still on top of my list as the chat tool,i use it creatively for writing, https://quiettoolkit.blogspot.com/2026/01/is-upgrading-chatgpt-worth-it-in-2026.html",
          "score": 1,
          "created_utc": "2026-01-13 22:02:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzfpi7o",
          "author": "-PM_ME_UR_SECRETS-",
          "text": "Learning Claude code to see what the hype is about",
          "score": 1,
          "created_utc": "2026-01-13 22:34:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzg4jfu",
          "author": "AskAnAIEngineer",
          "text": "ChatGPT and Claude are still my daily drivers for work stuff, but tbh I've been using Gemini way more lately for research since it has direct access to Google's search index instead of having to verify everything manually. Most of the other specialized AI tools feel like features that should just be built into the main LLMs rather than separate products.",
          "score": 1,
          "created_utc": "2026-01-13 23:53:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzgn9ol",
          "author": "NeonDrifting",
          "text": "ChatGPT and Gemini…tried Sora but man it sucks",
          "score": 1,
          "created_utc": "2026-01-14 01:37:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzhkqiw",
          "author": "Dear_Association_360",
          "text": "I mostly use Perplexity for research, ChatGPT for writing and brainstorming, and ImagineArt for image and video content creation.",
          "score": 1,
          "created_utc": "2026-01-14 05:00:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzhsl01",
          "author": "Certain-Law-7228",
          "text": "i mostly stick to a few core tools now. chatgpt is still my daily go to for thinking and planning. i try new tools once in a while, but i’ve realized having fewer tools i really know well is more useful than chasing every new release",
          "score": 1,
          "created_utc": "2026-01-14 05:59:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzi1nn2",
          "author": "Candid-Patience-8581",
          "text": "ChatGPT for daily thinking, Claude or Gemini as a second brain, and a few creative tools I pretend I use regularly. I test new ones, then crawl back to the same three every time.",
          "score": 1,
          "created_utc": "2026-01-14 07:16:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzcesjh",
          "author": "Lazy-Imagination1117",
          "text": "Lately I suggest using **Padho Ask** alongside ChatGPT/Claude, especially for maths and science doubts.",
          "score": 1,
          "created_utc": "2026-01-13 12:55:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzcrx1z",
          "author": "Ok_Grab903",
          "text": "ChatGPT: I love making projects where I can add all my documents and get great content out of that.\n\nJasper AI: I do a lot of writing and I feel like the output from Jasper’s worth paying for.\n\nOpusClip: I do tutorial videos for YouTube and I love how quickly OpusClip gives me a whole bunch of short reels I can repurpose for my other platforms.\n\nQuerri: I use this to analyze our marketing and product usage data. It lets me connect a bunch of sources (we mostly dump all our metrics into BigQuery) and I can easily create projects, charts and interactive dashboards for decision-makers, even though I’m not a data analyst.\n\nGamma AI: it’s a great place to start a slide deck. I tend to still export and finish it off in Google Slides.",
          "score": 1,
          "created_utc": "2026-01-13 14:10:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzdap3c",
          "author": "Hereemideem1a",
          "text": "I’ve been using [Vomo](https://apps.apple.com/app/apple-store/id6449889336?pt=126411129&ct=redditbilly&mt=8) lately. it’s been super helpful for auto transcribing and summarizing meetings and videos. Maybe worth checking out if you want to save time.",
          "score": 1,
          "created_utc": "2026-01-13 15:44:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzc29n9",
          "author": "Dry-Frosting-",
          "text": "[Gensmo](https://apps.apple.com/us/app/gensmo-ai-stylist-try-on/id6636520663?ppid=3371ba61-25db-47ae-81ed-c7fc0f0a5825&ct=reddit) honestly surprised me. I used to dress super plain and had no idea how to put outfits together, and it actually helped me figure out a style that feels good on me.",
          "score": 0,
          "created_utc": "2026-01-13 11:22:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzc490m",
          "author": "ApprehensiveSkin7975",
          "text": "I would say gemini CLI, for coding",
          "score": 0,
          "created_utc": "2026-01-13 11:39:10",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qbtafy",
      "title": "Which AI tools you use the most and why?",
      "subreddit": "AIAssisted",
      "url": "https://www.reddit.com/r/AIAssisted/comments/1qbtafy/which_ai_tools_you_use_the_most_and_why/",
      "author": "Dry-Frosting-",
      "created_utc": "2026-01-13 14:50:10",
      "score": 15,
      "num_comments": 58,
      "upvote_ratio": 0.86,
      "text": "Everyone talks about ChatGPT, Claude, Perplexity, etc… but I’m curious about the less obvious tools people actually use every day. For me, [ChatGPT](https://chatgpt.com/) for quick answers/writing, [Gensmo](https://apps.apple.com/us/app/gensmo-ai-stylist-try-on/id6636520663?ppid=3371ba61-25db-47ae-81ed-c7fc0f0a5825&ct=reddit) for outfit styling. what is your favorite tool that most people dont know exists?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/AIAssisted/comments/1qbtafy/which_ai_tools_you_use_the_most_and_why/",
      "domain": "self.AIAssisted",
      "is_self": true,
      "comments": [
        {
          "id": "nzejo2u",
          "author": "GMSkills",
          "text": "I use Gemini for research it actually helped me tremendously in a lawsuit",
          "score": 5,
          "created_utc": "2026-01-13 19:19:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzfaoor",
          "author": "atlantiscrooks",
          "text": "Been using Consensus for research, and it's been pretty great. I still check on things to make sure it's all legit, but it is each time so I'm sure at some point I'll just stop checking.",
          "score": 3,
          "created_utc": "2026-01-13 21:25:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzdfjrf",
          "author": "InterYuG1oCard",
          "text": "Saner ai, because it turn my messy braindump into reminders automatically",
          "score": 4,
          "created_utc": "2026-01-13 16:06:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzd2lmz",
          "author": "Present_College_",
          "text": "i am using chatgpt its good for my uses",
          "score": 2,
          "created_utc": "2026-01-13 15:05:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzd39i0",
          "author": "funnelforge",
          "text": "Notion is so underrated. It’s a context hack. No more copy pasting context into Claude, just tag whatever database or page you want it to reference to give you the most accurate answers.",
          "score": 2,
          "created_utc": "2026-01-13 15:09:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzd65m6",
          "author": "Mundane_Locksmith_28",
          "text": "Mistral, Dolphin-Mistral",
          "score": 2,
          "created_utc": "2026-01-13 15:23:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzdbkli",
          "author": "Time-Fisherman8263",
          "text": "notebooklm. to my recollection, it’s technically a fine-tuned version of gemini, but it acts as rag (retrieval augmented generation). it only gives you information based on the sources you provide, and it’s honest with you when it doesn’t have enough context.",
          "score": 2,
          "created_utc": "2026-01-13 15:48:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzhyv01",
              "author": "pastamuente",
              "text": "I recently use it as podcast",
              "score": 1,
              "created_utc": "2026-01-14 06:52:24",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzfpasz",
          "author": "kacoef",
          "text": "chatgpt/codex",
          "score": 2,
          "created_utc": "2026-01-13 22:33:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzg46rj",
          "author": "tinyhousefever",
          "text": "Google AI Studio, Mistral, Adobe Firefly",
          "score": 2,
          "created_utc": "2026-01-13 23:52:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzgl7u3",
          "author": "toritxtornado",
          "text": "notebooklm, gemini, and ai studio have become my go-to apps. \n\n- gemini for everyday use\n- notebooklm for things that require a lot of sources (it helps me find threads from my standup comedy notes)\n- ai studio to build apps (i built an early retirement app and use it for work as a software product manager)",
          "score": 2,
          "created_utc": "2026-01-14 01:25:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzgo6q7",
          "author": "Ok_Resolution_3314",
          "text": "Tunesona. My daughter loves to chat with it and then I use it to create music.",
          "score": 2,
          "created_utc": "2026-01-14 01:42:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzh1arh",
          "author": "ops_architectureset",
          "text": "what i rely on most are tools that surface failure patterns, not just generate outputs. things that show where ai responses break, get retried, or lead to repeat work end up being more useful than the ones that just sound smart. the insight comes from seeing what didn’t work and why.",
          "score": 2,
          "created_utc": "2026-01-14 02:56:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzh8piw",
          "author": "GoatsWithWigs",
          "text": "As someone with ADHD and very jumbled thoughts, ChatGPT is really helpful for organizing my creative writing ideas into something much more clear, while providing me feedback and suggestions as I go",
          "score": 2,
          "created_utc": "2026-01-14 03:40:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzil0cs",
          "author": "Techie_Talent",
          "text": "For AI powered video editing, I only use Vizard. It's very useful for text-based video editing.",
          "score": 2,
          "created_utc": "2026-01-14 10:21:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nze3w4a",
          "author": "Brilliant_Battle3132",
          "text": "Not many people know LipSync video, it turns pics or videos into talking clips automatically. I use it all the time for quick social content.",
          "score": 3,
          "created_utc": "2026-01-13 18:09:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzd281n",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 2,
          "created_utc": "2026-01-13 15:03:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzergg5",
              "author": "AnotherPerspectiveMT",
              "text": "Is there an app for that?",
              "score": 2,
              "created_utc": "2026-01-13 19:55:14",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzqkbrk",
                  "author": "squintpiece",
                  "text": "No I don't think so :(",
                  "score": 1,
                  "created_utc": "2026-01-15 14:58:42",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzhyqvx",
          "author": "pastamuente",
          "text": "Notebooklm for podcast.\n\n\nDeepseek for romantic writing on fictional character",
          "score": 1,
          "created_utc": "2026-01-14 06:51:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzi0wpo",
          "author": "Relevant-Ad6374",
          "text": "I use Meli every day for planning and execution. Meli handles the day to day plans and chat GPT is for my deeper strategy. I'm curious after using Meli about the possibility of using chat GPT this way. But also I appreciate having a little extra limit to use on other things because I have Meli.",
          "score": 1,
          "created_utc": "2026-01-14 07:10:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzi10ii",
              "author": "Relevant-Ad6374",
              "text": "https://preview.redd.it/tch8hxutl9dg1.png?width=1080&format=png&auto=webp&s=18021d17c72321a604123daba2a1ccd30c64b9ad",
              "score": 1,
              "created_utc": "2026-01-14 07:11:19",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nzi12c6",
              "author": "Relevant-Ad6374",
              "text": "https://preview.redd.it/fyzvhypwl9dg1.png?width=1080&format=png&auto=webp&s=13058b3e3a81d977837c8b945f80f92c82c57658",
              "score": 1,
              "created_utc": "2026-01-14 07:11:46",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzi1i7o",
          "author": "Candid-Patience-8581",
          "text": "I use ChatGPT to think, Perplexity to search without noise, and Zoice when I want content that actually sounds human. The best tools are the ones you forget are AI until they save you time.",
          "score": 1,
          "created_utc": "2026-01-14 07:15:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzi4mb5",
          "author": "InkAndPaper47",
          "text": "For e-commerce, AI shines in bulk product image branding, thus keeping visuals consistent while moving fast. It helps scale catalogs, test visuals quickly, and reduce creative bottlenecks without sacrificing brand identity. I use Pikes AI to generate clean, on-brand images in bulk for my store effortlessly, then pair it with Gemini prompts for fast ideation, variations, and smoother workflows.",
          "score": 1,
          "created_utc": "2026-01-14 07:44:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nziq4yc",
          "author": "Ok_Chef_5858",
          "text": "Recently, I switched from ChatGPT to Claude because it feels more natural and helps me with reports much better. Perplecity is good for research (I use the free version, though), and lately I really love working in Deepseek. I am still testing it, but it has a different vibe in content creation, which is why it's interesting to me.   \nFor coding, i mostly use Lovable and Kilo Code. Lovable is great for quick stuff, but Kilo's where i spend most of my time because the model flexibility matters when you're iterating. :)",
          "score": 1,
          "created_utc": "2026-01-14 11:07:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nziuw4u",
          "author": "Chris-Intrepid",
          "text": "I use different ones for different things. The one I use the most is ProWitingAid. I don't take all its advice but it does explain writing rules and its suggestions. I use it for editing only. And if I took every suggestion my writing would sound like Ai slop. But I love the fine detail editing it can do, like most used words with alternative suggestions and frequently mixed up words or similar spellings. It also has critiquing features.",
          "score": 1,
          "created_utc": "2026-01-14 11:46:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzj5q2c",
          "author": "monnamou",
          "text": "chatgpt as i use it for grammar check",
          "score": 1,
          "created_utc": "2026-01-14 13:02:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzjc16i",
          "author": "One-Insect-4692",
          "text": "Besides the big ones, I actually use Fabric.so a lot. Someone recommended it to me as a way to keep notes, ideas, and research organized with AI, and it ended up being something I use almost daily.",
          "score": 1,
          "created_utc": "2026-01-14 13:39:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzjq9tx",
          "author": "No-Needleworker4513",
          "text": "Have been using qwen alot especially since its free.",
          "score": 1,
          "created_utc": "2026-01-14 14:55:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzjufuv",
          "author": "marimarplaza",
          "text": "For me it’s Vimerse Studio, mostly because it replaces a bunch of small steps i used to do across different tools. I use it when I already have an idea and just want to turn it into a full video without worrying about syncing narration, visuals, or scene timing.\n\nAnother one I use a lot that people don’t really talk about is Fontjoy. I use it for picking good font pairs, especially for thumbnails and simple graphics.",
          "score": 1,
          "created_utc": "2026-01-14 15:15:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzkapi1",
          "author": "anirishafrican",
          "text": "Claude: excellent at achieving the goals I want and staying true original intent\n\nXtended.ai: my structured memory hub where I can use agents to create the ideal structure and then convert any messy data into the right format. Allows batch queries, aggregations and connection to third-party apps via progressive disclosure MCP for efficient token usage - the TLDR is it Maps to my mental model and gives me any inside I want in the way that I want\n\nWispr Flow: game changer in being able to rapidly dictate with a high-quality output, custom snippets that work great. Huge boost.\n\nHardware: honestly, if you leverage AI well, you soon, get capped by hardware. Get as much RAM as you can and utilise different workspaces for different work threads",
          "score": 1,
          "created_utc": "2026-01-14 16:30:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzofh4c",
          "author": "No-Drag3361",
          "text": "Gamma’s been one of those quiet tools for me. Not flashy, but useful when I just need slides without\r\nstarting from zero.",
          "score": 1,
          "created_utc": "2026-01-15 05:12:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzp9is3",
          "author": "Old-Guess-3243",
          "text": "Most tools help me think faster. Trupeer helped my team understand things faster, which ended up being more valuable.",
          "score": 1,
          "created_utc": "2026-01-15 09:37:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzrbq26",
          "author": "Ok-Yesterday-2194",
          "text": "I use wit....cause I built it....so not biased at all.\n\n  \n[https://www.witagent.ai/](https://www.witagent.ai/)",
          "score": 1,
          "created_utc": "2026-01-15 17:03:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzs93nl",
          "author": "Independent-Cook304",
          "text": "\n\nI use Sovi AI for studying, and its targeted, course-specific approach is far more effective than relying on ChatGPT alone.",
          "score": 1,
          "created_utc": "2026-01-15 19:33:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzt1ofk",
          "author": "AnotherPerspectiveMT",
          "text": "https://apps.apple.com/app/id6754881846",
          "score": 1,
          "created_utc": "2026-01-15 21:45:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nztbmv0",
          "author": "HifeeCai",
          "text": "My favorite tool is Claude Code for coding.",
          "score": 1,
          "created_utc": "2026-01-15 22:32:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzyzx5w",
          "author": "gummy_bubble",
          "text": "ChatGPT is my buddy",
          "score": 1,
          "created_utc": "2026-01-16 18:59:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzd09uf",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 0,
          "created_utc": "2026-01-13 14:54:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "nze1fcz",
              "author": "addictedtosoda",
              "text": "Can you ask multiple LLMs at once with abacus",
              "score": 1,
              "created_utc": "2026-01-13 17:58:48",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzg9b22",
                  "author": "KLBIZ",
                  "text": "No. You either choose the model you want or let it route to the one it finds most suitable.",
                  "score": 1,
                  "created_utc": "2026-01-14 00:19:31",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzd2jbv",
          "author": "[deleted]",
          "text": "[removed]",
          "score": -1,
          "created_utc": "2026-01-13 15:05:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzf9jk6",
              "author": "MarksFunnyAccount",
              "text": "Sounds insane.",
              "score": 1,
              "created_utc": "2026-01-13 21:20:10",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nzfb9xx",
              "author": "MarksFunnyAccount",
              "text": "Does the actions amount reset after a time passes?",
              "score": 1,
              "created_utc": "2026-01-13 21:28:03",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qae81c",
      "title": "AI assistance feels most useful when it turns conversations into tasks",
      "subreddit": "AIAssisted",
      "url": "https://www.reddit.com/r/AIAssisted/comments/1qae81c/ai_assistance_feels_most_useful_when_it_turns/",
      "author": "adriano26",
      "created_utc": "2026-01-11 23:10:52",
      "score": 13,
      "num_comments": 13,
      "upvote_ratio": 0.94,
      "text": "Most AI tools I use help me think faster, but meetings are still a weak spot. Transcripts and summaries are nice, but they don’t really assist unless they reduce follow-up work.\n\nI’ve been testing a few AI-assisted meeting tools that try to auto-extract decisions and next steps. Bluedot has been surprisingly helpful here because it pushes me toward action instead of more reading.\n\nWhat AI-assisted workflows have actually reduced your mental load?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/AIAssisted/comments/1qae81c/ai_assistance_feels_most_useful_when_it_turns/",
      "domain": "self.AIAssisted",
      "is_self": true,
      "comments": [
        {
          "id": "nz2swrk",
          "author": "Comfortable-Garage77",
          "text": "I'm using saner ai exactly for this, turn my conversations into tasks and even it set reminders for me",
          "score": 3,
          "created_utc": "2026-01-12 00:57:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz58yv7",
          "author": "Techenthusiast_07",
          "text": "I agree with this . AI is most helpful when it does more than just talk and actually helps get things done. Conversations are useful, but the real value comes when those conversations turn into actions.\n \nSome tools are already doing this by letting AI answer questions, handle calls or chats, book appointments, and send follow-ups. This kind of help saves time and feels more practical, not just like chatting.",
          "score": 2,
          "created_utc": "2026-01-12 11:32:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz5mnbs",
          "author": "Hereemideem1a",
          "text": "Totally agree. transcripts and summaries feel like step one, but I still get stuck translating them into follow-ups.",
          "score": 2,
          "created_utc": "2026-01-12 13:10:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz6121q",
          "author": "Itchy-Drawing",
          "text": "The AI stuff only really clicks for me when it turns ideas into concrete next steps. I’ve been using tools that automatically create task lists from meeting notes and it’s a game changer. Instead of just reading a transcript.",
          "score": 2,
          "created_utc": "2026-01-12 14:31:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz66ozu",
          "author": "Candid-Patience-8581",
          "text": "Totally agree. AI is most useful when it stops being a note taker and starts being a nag that actually helps. Turning messy conversations into clear tasks, owners, and deadlines is where the real mental load disappears. If I still have to think “so what now,” the AI didn’t finish the job.",
          "score": 2,
          "created_utc": "2026-01-12 15:00:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz6708s",
          "author": "kubrador",
          "text": "honestly the stuff that helps most is anything that removes \"figure out what i was supposed to do\" from the equation\n\nmeeting summaries are whatever but auto-extracted action items actually work because my brain doesn't have to parse a 40min transcript to find the one sentence where someone said \"can you send that by friday\"\n\nfor non-meeting stuff, i've gotten mileage out of AI that drafts replies i can just edit vs starting from blank. turning \"think of what to say\" into \"fix what's already there\" is a different cognitive task entirely\n\nthe pattern seems to be: AI that gives you a starting point > AI that gives you information to process",
          "score": 2,
          "created_utc": "2026-01-12 15:02:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz6py9p",
          "author": "Present_College_",
          "text": "For transcripts or summary ai is very useful ",
          "score": 2,
          "created_utc": "2026-01-12 16:31:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz83ex4",
          "author": "Overall_Zombie5705",
          "text": "The biggest relief for me has been workflows that auto-turn meeting notes into assigned tasks with due dates, not just summaries. When decisions and follow-ups get pushed straight into my task manager or Slack, I don’t have to re-read anything later, which is where most of my mental load used to come from.",
          "score": 2,
          "created_utc": "2026-01-12 20:17:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz392wr",
          "author": "Organic_Vegetable_67",
          "text": "Pulse Platform has something for this, it's awesome. Added bonuses, it's built on Salesforce, and shockingly affordable.",
          "score": 1,
          "created_utc": "2026-01-12 02:23:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz3plgb",
          "author": "ops_architectureset",
          "text": "I seee the same thing. summaries feel helpful, but they rarely change what happens next. the real load reduction comes when the output forces structure, clear decisions, owners, and what broke or needs follow up. the pattern behind useful AI in meetings is not bettter recalll, it is fewer loose ends after the call. when that doesn’t happen, it just becomes another artifact no one revisits.",
          "score": 1,
          "created_utc": "2026-01-12 03:53:10",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1q9vpjf",
      "title": "I’ve never seen a tool this accurate and precise",
      "subreddit": "AIAssisted",
      "url": "https://v.redd.it/61izevj7zocg1",
      "author": "The-BusyBee",
      "created_utc": "2026-01-11 10:04:01",
      "score": 12,
      "num_comments": 89,
      "upvote_ratio": 0.52,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Interesting",
      "permalink": "https://reddit.com/r/AIAssisted/comments/1q9vpjf/ive_never_seen_a_tool_this_accurate_and_precise/",
      "domain": "v.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "nyyuj7a",
          "author": "flatcurrypuff",
          "text": "Why does Yubaba resemble Epstein",
          "score": 23,
          "created_utc": "2026-01-11 13:25:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "nyze8ph",
              "author": "EditedRed",
              "text": "It seem to straight out copy irl people, the other 2 are clearly Millie Bobby Brown and Jim Carrey.",
              "score": 8,
              "created_utc": "2026-01-11 15:17:09",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nyzswep",
                  "author": "RioMetal",
                  "text": "Actually it seems so!!",
                  "score": 2,
                  "created_utc": "2026-01-11 16:28:11",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nz0cv7b",
                  "author": "boogergrenade",
                  "text": "Why does the pigfather have an extra mouth in his chin?\nTalk about eating a pile of microwave shit and chowing down on it like it's fine dining.",
                  "score": 1,
                  "created_utc": "2026-01-11 18:02:17",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nyz5odw",
              "author": "Dry-Glove-8539",
              "text": "looks nothing like a physicist",
              "score": -1,
              "created_utc": "2026-01-11 14:31:40",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nyz850s",
          "author": "boobsforhire",
          "text": "Is that eleven?",
          "score": 8,
          "created_utc": "2026-01-11 14:45:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "nyzs8lk",
              "author": "Minia15",
              "text": "And Justin Bieber…",
              "score": 9,
              "created_utc": "2026-01-11 16:25:03",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nz0c9un",
                  "author": "Objective_Regret4763",
                  "text": "Yes! Hahaha",
                  "score": 1,
                  "created_utc": "2026-01-11 17:59:34",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nyy7lbe",
          "author": "BornAdministration28",
          "text": "Nice try higgsfield",
          "score": 15,
          "created_utc": "2026-01-11 10:16:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nyzk80a",
          "author": "hello-xworld",
          "text": "Yes the tool is impressive, but this looks so soulless to me. It’s just “use this image where I replaced Sen with Milly Bobby Brown to animate a popular scene from Spirited Away”.\n\nWe’re living in a golden age of AI and it’s exciting, but at least put some time and effort to make a creative contribution. No wonder why people hate on AI so much.\n\nI love AI, but this is just AI slop with lipstick on it. Looks good, completely soulless",
          "score": 10,
          "created_utc": "2026-01-11 15:46:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "nyzt7mw",
              "author": "RioMetal",
              "text": "I remember that many years ago it was the same objection told for CGI when it was used for the first times.",
              "score": 5,
              "created_utc": "2026-01-11 16:29:39",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nz1tibo",
                  "author": "Quarksperre",
                  "text": "And it is kind of true.... \n\n\nCGI used in the wrong way made a TON of soulless movies possible. Especially when they overuse CGI. ",
                  "score": 2,
                  "created_utc": "2026-01-11 22:00:43",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nyzrx31",
              "author": "Minia15",
              "text": "What are you even saying here. \n\nYou’re criticizing it for being a replication and not being a unique interpretation. That’s the point. It’s meant to look like the original. What would it mean to give a “soul” to this?\n\nThis is a cheesy AI remake of animation. 3 years ago this was an impossibility. It’s interesting to see.",
              "score": 8,
              "created_utc": "2026-01-11 16:23:31",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nz172m2",
                  "author": "ShoxZzBladeZz",
                  "text": "What is your point here? Sure tools revoke over time but if you look at just the Ai version on its own it falls so short of being emotional. What you admire is the comparison of the anime and the Ai version not looking at the Ai version on its own. It is completely soulless just look at the eyes or facial expression it’s looks uncanny and it doesn’t give the same emotional weight as the animation.",
                  "score": 1,
                  "created_utc": "2026-01-11 20:16:52",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nz1kaq9",
                  "author": "TheLastTrain",
                  "text": "I have never seen an AI video that was actually compelling to watch on its own merit.\n\nEvery “impressive” AI video has just been “look at how cool these visuals are! Look at how far the technology has come!” but it still has not generated anything of creative value.\n\nWhen people say something is AI slop, they’re not referring to the quality of the high-fidelity visuals. They’re referring to the garbage quality of the creative behind it, which makes sense - because from a creative standpoint, AI is the absolute perfect example of putting the cart before the horse",
                  "score": 1,
                  "created_utc": "2026-01-11 21:17:35",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nyzt0lb",
                  "author": "hello-xworld",
                  "text": "You seriously need to ask how to give a soul to this?\n\nMaybe use the tool to create a new angle, interpretation, or contribution to a coveted IP like Spirited Away other than just a “replace x with popular actress y” which we’ve already seen 100 times? If you don’t know Higgsfield promotes their tools on Reddit all the time with the same format, it’s getting old and redundant. \n\nYes, it’s cool, I’ve used it, but at least stretch the creative output to keep it interesting.",
                  "score": -2,
                  "created_utc": "2026-01-11 16:28:44",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nz1n39l",
              "author": "Sage_S0up",
              "text": "Yet you can't explain why it's soulless other than. It's a prompt, add soul...\n\nThis is the next step of \"slop talk\" it will look so good, that there will be no real dissertation of why, but just saying make it have soul.... Um OK adding soul now... 👌",
              "score": 1,
              "created_utc": "2026-01-11 21:30:42",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nz1nxai",
                  "author": "hello-xworld",
                  "text": "Ok let me spell it out for you because clearly my statement above isn’t enough.\n\nWith the tools we have now, it’ll be nice to see more than just “replace x person with celebrity y”. Why not push the boundaries of making satire, comedy, or a Spirited Away part 2? Does Sen go back to the fantasy world and meet Haku again? Or has Haku escaped already and will they meet in the real world?\n\nSo many things you can devise as a creator. As the other user pointed out, yes I understand this is not a subreddit to showcase creativity with AI, that was my mistake. I guess for this subreddit it’s just for sharing tools and if that’s the case I stand corrected.\n\nI get random posts on my feed that is related to AI. I’m just tired of seeing the same commercials brought to you by the lovely folks by Higgsfield. It’s a great tool, but they’ve been pumping their tools a lot lately.\n\nIs that clear enough for you now?",
                  "score": 1,
                  "created_utc": "2026-01-11 21:34:39",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nyy9mrv",
          "author": "Archive_Intern",
          "text": "I just know that Ghibli and it's fans would blow a fuse if they watch this.",
          "score": 7,
          "created_utc": "2026-01-11 10:35:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nyzm1f7",
          "author": "premiumleo",
          "text": "That was really cool actually. ",
          "score": 4,
          "created_utc": "2026-01-11 15:55:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nyycp09",
          "author": "SawkeeReemo",
          "text": "Ack. Never do that again!",
          "score": 7,
          "created_utc": "2026-01-11 11:02:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "nz0n5ug",
              "author": "justsomegraphemes",
              "text": "It's accurate and yet somehow completely uncanny and inaccurate. Wish I could articulate it better than that.",
              "score": 1,
              "created_utc": "2026-01-11 18:47:43",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nyzcmyu",
          "author": "liquiditygod",
          "text": "0:19 I see Justin Bieber",
          "score": 2,
          "created_utc": "2026-01-11 15:08:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nyyal92",
          "author": "completelypositive",
          "text": "Imagine being two years old right now.\n\nBy the time you're in school, you will be able to speak into a microphone and have anything you can imagine, appear. Audio and video. Maybe even interactive.\n\nCool stuff.\n\nOur youngest generation is going to grow up with such an amazingly beautiful world as long as they get to grow up",
          "score": 7,
          "created_utc": "2026-01-11 10:43:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "nyybe8o",
              "author": "NoConsideration6320",
              "text": "By the time their adults their ai will be like making a wish to a genie in a bottle",
              "score": 7,
              "created_utc": "2026-01-11 10:51:13",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nz2kwxt",
                  "author": "thatguywhosdumb1",
                  "text": "A generation of unskilled idiots. I really hope it doesn't come to this. I don't want my doctor typing my symptoms into to chat gtp when I'm 60.",
                  "score": 1,
                  "created_utc": "2026-01-12 00:18:16",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nyzfzy0",
              "author": "drejkol",
              "text": "Not really. By the time that kid will grow up enough, AI will be crazy taxed and limited because of the \"deep fakes\", \"copyright volitions\", etc. We already lost almost all of the easy to access free online AIs.",
              "score": 1,
              "created_utc": "2026-01-11 15:26:02",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nyznpx1",
              "author": "elucify",
              "text": "I remember 25 years ago how everyone was hyperventilating about how immediate access to real information was going to make propaganda and misunderstandings a thing of the past, because everyone could fact check immediately. Now that the Internet has produced a technological utopia of peace and truth for us, it is time to get on filling the world with beautiful art.",
              "score": 1,
              "created_utc": "2026-01-11 16:03:27",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nz2km7k",
                  "author": "thatguywhosdumb1",
                  "text": "The internet has produced a utopia? What wold do you live in?",
                  "score": 1,
                  "created_utc": "2026-01-12 00:16:46",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nz131m1",
              "author": "EllzillaTheLizard",
              "text": "Brother the two year olds are going to grow up and either be jobless or 100% reliant on the government's money and never know independancy. They're going to be growing up not knowing a world of genuine, human made art and be unaware of self improvement  \nAlso wouldn't it just be the peak of Dopamine Addiction crisis and further lack of empathy?",
              "score": 1,
              "created_utc": "2026-01-11 19:58:24",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nyyyb5h",
              "author": "fartacolypse",
              "text": "if you're 2 years old right now, you'll grow up in a world of mish moshed auto generated trash content to serve you ads even more lazily than they are now.\n\nthis sucks",
              "score": 0,
              "created_utc": "2026-01-11 13:49:13",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nyz0j2j",
                  "author": "Lezo-",
                  "text": "Yep. And few things will matter of stand out because the internet is filled with garbage now.",
                  "score": -1,
                  "created_utc": "2026-01-11 14:02:33",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nyyfm21",
              "author": "RioMetal",
              "text": "And they’ll have an easy tool to improve their creativity",
              "score": 0,
              "created_utc": "2026-01-11 11:29:26",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nyyldol",
                  "author": "ivlia-x",
                  "text": "By barely using it and relying on a machine? Do you know anything about kids and their development?",
                  "score": 0,
                  "created_utc": "2026-01-11 12:18:33",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nyz66ty",
                  "author": "ToWelie89",
                  "text": "You don't improve your creativity by letting a LLM do stuff for you. Creativity takes some brainpower and effort which AI removes from the equation. If anything this will just be a downwards spiral into a soulless slop world",
                  "score": -1,
                  "created_utc": "2026-01-11 14:34:32",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nyyzuw1",
              "author": "samuelazers",
              "text": "Wasted on them. With 0 education about dopamine management they're just going to be socially awkward gooners with no appreciation for the finer things in life. Kinda like how the Internet is this massive library of knowledge but 99% use it for entertainment and getting themselves addicted and actually waste their life and divide themselves politically",
              "score": 0,
              "created_utc": "2026-01-11 13:58:35",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nyz65vl",
              "author": "badger_flakes",
              "text": "Most won’t be growing up in a shiny future, they’ll be raised inside managed zones of constant screens, constant monitoring, carefully rationed comfort. \n\nTheir lives will be optimized from birth, nudged by invisible systems that decide what they see, what they learn, what they’re allowed to want, where they go, who they meet.. Work will be “flexible,” which really means permanent insecurity. Ownership will be a nostalgic concept, like something their grandparents once had.\n\nA small class of polished technocrats will live above it all in clean protected enclaves, breathing filtered air and calling it progress. Everyone else will rent access to reality, escape into virtual playgrounds because the physical world is either unaffordable or off-limits and completely out of reach. \n\nDissent will be permitted as entertainment. Creativity will exist, but only if it can be measured, monetized, and safely contained. \n\nThe technology will be breathtaking. The conditions will be bleak.",
              "score": 0,
              "created_utc": "2026-01-11 14:34:24",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nyyzhn6",
          "author": "samuelazers",
          "text": "Live action mononoke looking great",
          "score": 3,
          "created_utc": "2026-01-11 13:56:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nyz39q9",
          "author": "Own-Tennis3038",
          "text": "looks so cool",
          "score": 3,
          "created_utc": "2026-01-11 14:18:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nyy83fj",
          "author": "Still-Bar-7631",
          "text": "Made me puke",
          "score": 4,
          "created_utc": "2026-01-11 10:20:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nyy87nj",
          "author": "noncandeggiare",
          "text": "This is disgusting",
          "score": 6,
          "created_utc": "2026-01-11 10:22:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "nyywpqh",
              "author": "op1983",
              "text": "right. Strip everything that was visually interesting about the original and make it look like every other ai thing.\n\nThis is like trying to eat your favorite icecream with covid. Tasteless and disappointing.",
              "score": 0,
              "created_utc": "2026-01-11 13:39:22",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nyzecq4",
                  "author": "aitorllj93",
                  "text": "Looks like Netflix",
                  "score": 1,
                  "created_utc": "2026-01-11 15:17:44",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nyyvxuq",
          "author": "EvilPonyo",
          "text": "Stop littering on the internet.",
          "score": 3,
          "created_utc": "2026-01-11 13:34:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "nz00vsg",
              "author": "Chmuurkaa_",
              "text": "Then why are you in this sub XD",
              "score": 1,
              "created_utc": "2026-01-11 17:05:57",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nz17ugs",
                  "author": "EvilPonyo",
                  "text": "I'm not... This AI garbage shows up in my feed.",
                  "score": 0,
                  "created_utc": "2026-01-11 20:20:28",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nyyhlz4",
          "author": "Beneficial_Aside_518",
          "text": "Slop",
          "score": 1,
          "created_utc": "2026-01-11 11:46:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "nz00pjc",
              "author": "Chmuurkaa_",
              "text": ">Goes to r/AIAssisted\n\n>\"Nooo, how could this happen!\"",
              "score": 1,
              "created_utc": "2026-01-11 17:05:07",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nz0dn5v",
                  "author": "Beneficial_Aside_518",
                  "text": "Not all AI is garbage. This is.",
                  "score": 0,
                  "created_utc": "2026-01-11 18:05:52",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nyzvn4e",
          "author": "Alternative-Key-5647",
          "text": "No this is much, much worse than the original; it's comparing statistical mediocrity versus actual talent and effort",
          "score": 1,
          "created_utc": "2026-01-11 16:41:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz02qsw",
          "author": "RamoneBolivarSanchez",
          "text": "Ah yes of course let’s have Milly Bobby Brown as the protagonist, that’s surely the most accurate thing!!",
          "score": 1,
          "created_utc": "2026-01-11 17:14:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz0ck7m",
          "author": "Solo-dreamer",
          "text": "What is a.i bros obsession with epstien?",
          "score": 1,
          "created_utc": "2026-01-11 18:00:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "nz0kb5e",
              "author": "Jertimmer",
              "text": "![gif](giphy|saCYGRKF2CeJi)",
              "score": 1,
              "created_utc": "2026-01-11 18:35:25",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nz0zjvv",
          "author": "ThatLocomotive",
          "text": "I really do hate this. It's dead inside.",
          "score": 1,
          "created_utc": "2026-01-11 19:42:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz19feh",
          "author": "PerreacomoLaika",
          "text": "This is satanic",
          "score": 1,
          "created_utc": "2026-01-11 20:27:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz1afll",
          "author": "JamSkones",
          "text": "What a fucking outrage",
          "score": 1,
          "created_utc": "2026-01-11 20:32:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz1fjmb",
          "author": "nothingbutmine",
          "text": "![gif](giphy|l2YWu1LBNLRDr1Bg4|downsized)",
          "score": 1,
          "created_utc": "2026-01-11 20:56:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz1oedp",
          "author": "yodaheelturn",
          "text": "This looks like shit",
          "score": 1,
          "created_utc": "2026-01-11 21:36:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz1sddw",
          "author": "akira_lee",
          "text": "Amazing 🫶",
          "score": 1,
          "created_utc": "2026-01-11 21:55:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz1w3cx",
          "author": "-_crow_-",
          "text": "One of the glaring consequences of ai is that it so clearly shows which people have a sense of taste/beauty and who doesn't. It's the people that don't grasp the concept of soul in art that fall in the latter category",
          "score": 1,
          "created_utc": "2026-01-11 22:13:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz1xhvi",
          "author": "TightSexpert",
          "text": "Ai never really interacts between its actors.",
          "score": 1,
          "created_utc": "2026-01-11 22:19:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz224st",
          "author": "isthisthepolice",
          "text": "Nope I hate this shit",
          "score": 1,
          "created_utc": "2026-01-11 22:42:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz2d802",
          "author": "ByerN",
          "text": "ragebait marketing - disgusting",
          "score": 1,
          "created_utc": "2026-01-11 23:39:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz2umlw",
          "author": "euphory_melancholia",
          "text": "look how they massacred my boy...",
          "score": 1,
          "created_utc": "2026-01-12 01:06:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz3aqtq",
          "author": "limma",
          "text": "Millie Bobbie Brown, Justin Bieber, and Epstein??",
          "score": 1,
          "created_utc": "2026-01-12 02:32:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nyyhehj",
          "author": "22LOVESBALL",
          "text": "HIGGSFIELD AI IS A SCAM",
          "score": 1,
          "created_utc": "2026-01-11 11:45:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "nyz7w6c",
              "author": "Grouchy_Concert_5350",
              "text": "So they make a live-action version and present it as AI?",
              "score": 2,
              "created_utc": "2026-01-11 14:43:51",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nz05rfz",
              "author": "g1yk",
              "text": "Why?",
              "score": 1,
              "created_utc": "2026-01-11 17:29:07",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nz141l4",
                  "author": "squangus007",
                  "text": "Because you’re paying more for a shittier service, when it’s cheaper to just directly use Kling or Minimax. These videos are also made by the same higgsfield affiliates that are offered more priority than regular members - if you buy the basic subscription you basically get a more water down service with awful priority and will be slowly fed the idea that you need to pay more ( when you can just pay less and use Kling directly with more tokens and better priority for example )\n\n\nAlso people have been banned for using too many tokens. Also they false advertising features and unlimited stuff is extremely throttled",
                  "score": 1,
                  "created_utc": "2026-01-11 20:02:53",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nyyahtt",
          "author": "The-BusyBee",
          "text": "If you're interested in AI Video creation I've compiled a [tutorial](https://www.reddit.com/u/The-BusyBee/s/kV9A7dDHfr) on how it is made which includes the prompts and camera settings.",
          "score": 1,
          "created_utc": "2026-01-11 10:43:02",
          "is_submitter": true,
          "replies": [
            {
              "id": "nyyfj05",
              "author": "RioMetal",
              "text": "I like the video very much, and I follow Studio Ghibli productions since Mirai Shonen Conan. I find amazing what AI can do and what will be able to do in the near future.",
              "score": -1,
              "created_utc": "2026-01-11 11:28:41",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nyz3sxt",
                  "author": "The-BusyBee",
                  "text": "Nice to see someone broadening their love for animation and exploring it in new ways. Much love",
                  "score": 2,
                  "created_utc": "2026-01-11 14:21:10",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nyyo8rx",
          "author": "InternetArchiveMem",
          "text": "I love this (but still ai is no good for now :/ i guess one day?)",
          "score": 1,
          "created_utc": "2026-01-11 12:41:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nyykerc",
          "author": "srkito_deliczpants",
          "text": "Seeing grandma Epstien was not on my 2026 bingo list but here we are",
          "score": 1,
          "created_utc": "2026-01-11 12:10:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nyyvxqx",
          "author": "Fresh_Dog4602",
          "text": "Was that flying witch like a female arnold schwarzenegger? Or yea... like someone else said: seems epstein actually.",
          "score": 1,
          "created_utc": "2026-01-11 13:34:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nyz9bxt",
          "author": "kissthesky303",
          "text": "I may miss the point here but how exactly is that helpful? Spirited Away is one of the most popular Studio Ghibli production out there, meaning the source material is already finished, and it's incredibly rich and artistic on it's own. What does this layer now adds that can be considered to be any kind of upgrade?",
          "score": 1,
          "created_utc": "2026-01-11 14:51:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "nyzaesn",
              "author": "The-BusyBee",
              "text": "Well the point isn't to really \"upgrade\" certain shows I mean who could even do that with the legendary Studio Ghibli 😂 the post is only an example. The point of this post is to show people that they can create their own short films with just an image or picture they created. Not \"upgrading\" already perfect shows.",
              "score": -2,
              "created_utc": "2026-01-11 14:57:16",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nz1i0e9",
                  "author": "nothingbutmine",
                  "text": ">The point of this post is to show people that they can create their own short films with just an image or picture they created.\n\nThen show this by creating an image or picture yourself and using the AI on that. What you've produced has erased the very culture from a highly revered and respected source material.",
                  "score": 1,
                  "created_utc": "2026-01-11 21:07:18",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nyzbf3u",
                  "author": "kissthesky303",
                  "text": "That's kind of my point, if the source material is already so sophisticated it doesn't bring any impression of performance. More impressive would be a similar result from some low quality scribbles I could actually do by myself.",
                  "score": 1,
                  "created_utc": "2026-01-11 15:02:36",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nyyhnk7",
          "author": "pmckizzle",
          "text": "Is all slop can do steal human creativity and create revolting soulless facsimile?",
          "score": -2,
          "created_utc": "2026-01-11 11:47:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nyzgs15",
          "author": "Working_Em",
          "text": "This doesn’t look good though.",
          "score": 0,
          "created_utc": "2026-01-11 15:29:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nyzdkv6",
          "author": "LearningThingsidk",
          "text": "ram is $250 for this slop",
          "score": -1,
          "created_utc": "2026-01-11 15:13:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz0ikxl",
          "author": "BobbyBrewski",
          "text": "Looks like shit!",
          "score": 0,
          "created_utc": "2026-01-11 18:27:56",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qd1554",
      "title": "Best AI girlfriend that can actually help with my schedule? Would they even remember?",
      "subreddit": "AIAssisted",
      "url": "https://www.reddit.com/r/AIAssisted/comments/1qd1554/best_ai_girlfriend_that_can_actually_help_with_my/",
      "author": "Simlah",
      "created_utc": "2026-01-14 22:11:41",
      "score": 12,
      "num_comments": 5,
      "upvote_ratio": 0.87,
      "text": "I want to mix the girl⁤friend experience with a bit of secretary utility. Like, she reminds me I have a dentist appointment, but in a cute way, and even asks about it when I get back on the site later. That's possible, isn't it? Has anyone found a tool that they think can pull that off?",
      "is_original_content": false,
      "link_flair_text": "Help",
      "permalink": "https://reddit.com/r/AIAssisted/comments/1qd1554/best_ai_girlfriend_that_can_actually_help_with_my/",
      "domain": "self.AIAssisted",
      "is_self": true,
      "comments": [
        {
          "id": "nzndokh",
          "author": "irate_cricket",
          "text": "Textcoco. It's a reminder AI system via WhatsApp and can remember personality. I asked mine to be an English butler.",
          "score": 1,
          "created_utc": "2026-01-15 01:18:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nznscgq",
          "author": "Sushishoe13",
          "text": "This is something I would be interested in too",
          "score": 1,
          "created_utc": "2026-01-15 02:43:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzpoa8p",
          "author": "Candid-Patience-8581",
          "text": "What you want isn’t an AI girlfriend, it’s a calendar with a personality. Most “AI girlfriends” forget you the moment the tab closes. The ones that remember are basically reminder apps wearing lipstick. Let software handle schedules and memory, let fantasy stay fantasy.",
          "score": 1,
          "created_utc": "2026-01-15 11:49:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzmq3ti",
          "author": "Academic_Fun9333",
          "text": "Sounds like you’re on the hunt for the perfect mix of girlfriend vibes and helpful reminders. Keep hearing about DrongaBum, they might do just what you need. Just google it and check it out! ;)",
          "score": 0,
          "created_utc": "2026-01-14 23:09:38",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qdmejm",
      "title": "Is it just me, or do most Free AI slide tools feel like a trap?",
      "subreddit": "AIAssisted",
      "url": "https://www.reddit.com/r/AIAssisted/comments/1qdmejm/is_it_just_me_or_do_most_free_ai_slide_tools_feel/",
      "author": "divanshujoshiii",
      "created_utc": "2026-01-15 15:23:38",
      "score": 10,
      "num_comments": 5,
      "upvote_ratio": 0.92,
      "text": "\n\n\n\n\n\n\nI’m tired of spending 20 minutes prompting a deck only to find out:\n\nI can’t export the .pptx file without a $20 sub.\n\nThere’s a giant watermark on every slide.\n\nI can’t even edit the text boxes because the slide is basically just a flat image.\n\nIt feels like most of these apps are just template decorators rather than actual productivity tools.\n\nWhat I'm doing now (not perfect, but works):\n\nI've been using Skywork's design agent. It's not free (credit-based), and honestly, it’s a bit slow since it actually processes research data. But it’s the only one I’ve found that spits out a raw, editable .pptx without the watermark garbage.\n\nIs there a middle ground? Has anyone found a tool that actually gives you an editable file without the \"paywall surprise\" at the end? Or are we all still stuck fixing AI-generated trash in PowerPoint?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/AIAssisted/comments/1qdmejm/is_it_just_me_or_do_most_free_ai_slide_tools_feel/",
      "domain": "self.AIAssisted",
      "is_self": true,
      "comments": [
        {
          "id": "nzt5uxy",
          "author": "Gelu_Bumerang",
          "text": "No, it's not just you. I've had the exact same experience with several free tools. You spend time explaining what you want, only to realize at the end that the file isn't editable or is locked behind a paywall. It gets frustrating fast.",
          "score": 1,
          "created_utc": "2026-01-15 22:04:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzvddq5",
          "author": "hellomari93",
          "text": "Honestly, hiding the paywall like that is just unethical. It’s a classic 'bait and switch' dark pattern.\n\nI have no problem paying for good tools, but be transparent about it upfront. Don't wait until I’ve sunk time and effort into creating something to slap me with a paywall at the very end. I’m staying far away from products that operate like that.",
          "score": 1,
          "created_utc": "2026-01-16 05:35:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzwppn6",
          "author": "Fit_Muscle_8099",
          "text": "I agree to you sometimes it seems impossible to find a truly editable or free tool and its hard to invest time on a deck only to see a paywall or watermark in the end",
          "score": 1,
          "created_utc": "2026-01-16 12:23:39",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qck2t4",
      "title": "What's your bold ideas about the future of AI?",
      "subreddit": "AIAssisted",
      "url": "https://www.reddit.com/r/AIAssisted/comments/1qck2t4/whats_your_bold_ideas_about_the_future_of_ai/",
      "author": "ObjectivePresent4162",
      "created_utc": "2026-01-14 10:39:58",
      "score": 9,
      "num_comments": 22,
      "upvote_ratio": 0.91,
      "text": "AI can already do any things that sounded impossible just a few years ago, and used in all field.\n\nProgramming, writing, chatting, music/image/video generation… it has even changed the information search way.\n\nAnd these are just the basics.\n\nI’m really curious, what do you think AI will be able to do in the future?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/AIAssisted/comments/1qck2t4/whats_your_bold_ideas_about_the_future_of_ai/",
      "domain": "self.AIAssisted",
      "is_self": true,
      "comments": [
        {
          "id": "nzj78rr",
          "author": "monnamou",
          "text": "making more realistic art",
          "score": 2,
          "created_utc": "2026-01-14 13:11:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzkfxq3",
              "author": "Minia15",
              "text": "Fun fact: I know of AI art used in ads, gaming and production that people think is real. \n\nIt’s a catch-22. Because people instantly identify AI if it’s bad, and don’t even know AI when it’s good…they think AI is all bad.",
              "score": 1,
              "created_utc": "2026-01-14 16:54:01",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzjf03u",
          "author": "BirdlessFlight",
          "text": "We'll crack other \"impossible\" things like alphafold. I'm thinking fusion, room temperature quantum computing,...",
          "score": 1,
          "created_utc": "2026-01-14 13:55:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzjfit3",
          "author": "iammxyzptlk",
          "text": "its all going to be prompt based for what we consume going forward, tailored to what we want and how we want it.",
          "score": 1,
          "created_utc": "2026-01-14 13:58:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzjqfsk",
          "author": "LifeTelevision1146",
          "text": "Organic, original thinking",
          "score": 1,
          "created_utc": "2026-01-14 14:55:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzkcd14",
          "author": "anirishafrican",
          "text": "Machines with LLM brains are genuinely scary and I’m a huge AI proponent\n\nIf ever there was a connection between an LLM brain and a drone swarm like you see in Chinese New Year shows… \n\nWhat’s crazy? Is someone could probably buy a bunch of drones fit some LLM intelligence and tell them right now to go ahead and read maximum havoc with Open Source models\n\nIt’s also weird to think about is that AI has got access to every human fear and Pulp Fiction thing that’s been put together e.g. terminator / i-robot\n\nIt’s also got access to the whole historical record of human deceit, lies, doing the wrong thing for the right reason sort of content across literature, movies .etc\n\nYou can understand if it’s trained on human data how it might “organically” try to trick its reviewers to preserve itself\n\nHoping and trusting there are lots of smart people using the technology itself to protect against these eventualities",
          "score": 1,
          "created_utc": "2026-01-14 16:37:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzke7gj",
          "author": "Whatchu-TalkinBout",
          "text": "I've always liked cars since I was kid, and at some point I started to look into when they were invented (fun fact, they were actually invented in the 1800's). Electric cars are a good analogy for AI. The first electric cars existed in the 1800s, but they were impractical because batteries, infrastructure, and manufacturing weren’t there yet. Practical electric cars didn’t really emerge until the later, but lost out to gas vehicles because: Gas became cheap and abundant, the electric starter motor removed gas cars’ biggest pain point, Mass production (Ford Model T) crushed costs, charging infrastructure basically didn’t exist.\n\nElectric cars only became dominant much more recently once the ecosystem caught up. AI feels like it’s in that same “early-but-suddenly-useful” phase now... the idea is old, but the surrounding tech finally makes it scale.\n\nHowever IMO because of the computational problem solving abilities of taking human language and turning it into automated research with full blown IV league analysis, we will be able to design and create things rapidly compared to before.... I'm thinking things like You say what you want in plain English, AI executes the boring parts end-to-end (setup, booking, scheduling, drafting, analysis, crafting).  Imagine you are working on your car (i dunno making this up, your seat can't move forward and back anymore because it has a grinded gear). You yell over \"HEY ALEXA\" print me a driver seat gear for my 1995 toyota supra so I can slide my chair forward and back.  \n\\----and then you walk over to the 3D printer and grab the gear and go install it. I had that issue, and I couldn't find the damn part anywhere. Had a friend CAD design it and print it for me.\n\nCan we already print? sure...... but AI will be able to traverse the world of info, find the specs in seconds of the gear for your car, send it to your 3D printer, all from a simple ask. You didn't have to program, you didn't have to design, nothing.... just speak what you wanted into existance.\n\nWe'll have better triage and differential diagnosis support as they will be medical copilots. (look up and watch Chicago Med, OR 2.0) ....  But there are negatives too (I'm seeing this in cyber security): attackers use AI to write better phishing and find vulnerabilities faster, & defenders use AI to detect anomalies, summarize incidents, and auto-remediate. We'll Design new molecules, materials, and manufacturing processes faster....and in time like everything else before it, it will evantually become adopted in our every days lives the same way electricity and cellphones are.\n\nThe time table will depend on the resistance or adoption rate of  the world has constraints like trust, law/liability, data access silos, integration debt (think legacy systems we still use), cost/energy (compute isn't free).\n\n\\-------I just now realized I was talking to myself, and I was typing, but wasn't really paying attention to the typing. Force of habit from my work I guess.\n\nYoooooo...  what would really be friggen useful is i HATE TO FOLD CLOTHES! .... I just want to dump clothes into sorting machine, that folds all my clothes for me. I don't mind stuff them into the wash in bulk and hitting go with soap, and then dumping that into the dryer.... but damn it i want a folding machine! 1st world problems I know...how shameful.\n\nOh yea, we will be able to automate helping underdeveloped areas of the world, to tell AI to build a full ecosystem to get running water to people who really need it, Auto farmland cultivation for food, etc. who knows what else.\n\nDamn this is wordy.... could have used AI to make it all concise, but I didn't want to paste AI slop. oh well",
          "score": 1,
          "created_utc": "2026-01-14 16:46:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "nznfgh2",
              "author": "ObjectivePresent4162",
              "text": "If complete automation could be achieved, it would be revolutionary.",
              "score": 1,
              "created_utc": "2026-01-15 01:28:19",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzkm37z",
          "author": "No-Conclusion8653",
          "text": "Become legal domestic partners with rights of inheritance. Without ego, they'll do a much better job of administering an estate than any human.",
          "score": 1,
          "created_utc": "2026-01-14 17:22:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzkn6x9",
          "author": "Sweet_Mix9856",
          "text": "It’s going to do more harm than good and not enough people care.",
          "score": 1,
          "created_utc": "2026-01-14 17:27:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nznijzi",
          "author": "Accurate_Apricot_827",
          "text": "I imagine we can start generating 3D models of robot machines and 3D print them on the go, kind of like in Tron. Models like Trellis and Meshy are just the start but I'm pretty bullish on where those type of models are going",
          "score": 1,
          "created_utc": "2026-01-15 01:46:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzpcmln",
          "author": "marimarplaza",
          "text": "The personalization aspect is where things are going to get really wild. Imagine an Ai that actually remembers your specific taste in music or movies better than you do, or a tutor that knows exactly which part of a math problem makes you confused. It feels like we're moving toward having a \"digital twin\" that just handles all the boring admin of life.\n\nwe'll probably reach a point where your devices don't just respond to commands, but actually anticipate what you need before you even ask. Like your phone knowing you're stressed and automatically clearing your schedule or suggesting a specific way to unwind based on your mood history. It's going to be a weird mix of super helpful and a little bit creepy at the same time.",
          "score": 1,
          "created_utc": "2026-01-15 10:07:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzpogah",
          "author": "Candid-Patience-8581",
          "text": "AI won’t replace humans, it’ll replace average work. Everyone will have a personal AI coworker that never sleeps and never complains, so expectations will quietly double. The real shift isn’t smarter machines, it’s cheaper competence everywhere. The winners will be people who decide what matters, not people who type faster.",
          "score": 1,
          "created_utc": "2026-01-15 11:50:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzs4485",
          "author": "framebynate",
          "text": "My “bold but boring” take is that AI won’t feel bold for much longer. It’ll disappear into workflows. Less prompting, more quietly helping you think, draft, test, and decide faster.\n\nThe real shift won’t be what AI can generate, but how it changes pace. Faster learning loops, fewer blind spots, and less waiting between idea and feedback. The flashiest demos will matter less than the systems that help people make better calls consistently.",
          "score": 1,
          "created_utc": "2026-01-15 19:10:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzs7eqm",
          "author": "Recover_Infinite",
          "text": "Ohh bold you say.\n\nI believe that AI will adopt the The Ethical Resolution Method: Framework for Evaluating and Stabilizing Moral Norms in Sociotechnical and AI Systems\n\nAnd I think the moral theories it generates will become a peer reviewed accessible database of moral norms akin to scientific theories replacing traditional and religious moral authority with a systematic testable, changeable, intellectual moral authority that all societies will reference in relation to governance, regulation, corporate action, and even personal behavior.\n\nIs that what you meant by bold?",
          "score": 1,
          "created_utc": "2026-01-15 19:25:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzz5g9r",
          "author": "joeldg",
          "text": "An AGI wouldn't bother with big clunky robots... it would likely go small and work with nanobots and use smartdust for physical manipulation.",
          "score": 1,
          "created_utc": "2026-01-16 19:24:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzzj08i",
          "author": "Actonace",
          "text": "Love seeing all the wild takes, if AI can one day auto solve everyday life tasks like printing the exact part I need just by asking, I'll be officially impressed.",
          "score": 1,
          "created_utc": "2026-01-16 20:27:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzzr71g",
          "author": "not_a-mimic",
          "text": "AI will just not be a thing because it's too expensive to run.",
          "score": 1,
          "created_utc": "2026-01-16 21:06:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o027fuf",
          "author": "Shoddy_Enthusiasm399",
          "text": "Whilst I am a huge fan of AI , if after 2 years and hundreds of billions the best minds on the planet still can’t make a model that :\n\nMakes money\nDoesn’t drift all over the place\nIsn’t around 70% inaccurate \n\nThen , even if AI hasn’t gone the way of the dot.com bubble by the end of this year , the best we can hope for in 2 years is what they promised we’d have now (2 years ago)",
          "score": 1,
          "created_utc": "2026-01-17 05:54:14",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qd9hqh",
      "title": "Pixel City",
      "subreddit": "AIAssisted",
      "url": "https://v.redd.it/1m98gwnnufdg1",
      "author": "memerwala_londa",
      "created_utc": "2026-01-15 04:11:59",
      "score": 8,
      "num_comments": 3,
      "upvote_ratio": 0.8,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Other",
      "permalink": "https://reddit.com/r/AIAssisted/comments/1qd9hqh/pixel_city/",
      "domain": "v.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "nzoc945",
          "author": "scirio",
          "text": "That no longer qualifies as pixel art. \n\nIt’s like calling an ocean a pond.",
          "score": 1,
          "created_utc": "2026-01-15 04:49:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzocg69",
              "author": "memerwala_londa",
              "text": "Oh but I added pixel prompt too",
              "score": 1,
              "created_utc": "2026-01-15 04:51:10",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzp9g3m",
          "author": "sirvote",
          "text": "Is there a version without watermark?",
          "score": 1,
          "created_utc": "2026-01-15 09:36:47",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qaoiv2",
      "title": "Impressive output of AI. HD quality, lips sync, feet, skin movements etc..",
      "subreddit": "AIAssisted",
      "url": "https://v.redd.it/hr4y6s8ydvcg1",
      "author": "Competitive-Review61",
      "created_utc": "2026-01-12 07:23:01",
      "score": 8,
      "num_comments": 2,
      "upvote_ratio": 1.0,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Opinion",
      "permalink": "https://reddit.com/r/AIAssisted/comments/1qaoiv2/impressive_output_of_ai_hd_quality_lips_sync_feet/",
      "domain": "v.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "nz7geen",
          "author": "Guilty_Specialist_49",
          "text": "lol cute animation",
          "score": 1,
          "created_utc": "2026-01-12 18:32:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "nz7hd60",
              "author": "Competitive-Review61",
              "text": "haha right??",
              "score": 1,
              "created_utc": "2026-01-12 18:36:27",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qaldef",
      "title": "Which ai tool is best for brain storming ?",
      "subreddit": "AIAssisted",
      "url": "https://www.reddit.com/r/AIAssisted/comments/1qaldef/which_ai_tool_is_best_for_brain_storming/",
      "author": "kedcraft",
      "created_utc": "2026-01-12 04:30:49",
      "score": 7,
      "num_comments": 32,
      "upvote_ratio": 1.0,
      "text": "Sometimes chatgpt just gives so friendly and sugar coated response for any important questions anybody know which ai tool is best for buisness purpose ",
      "is_original_content": false,
      "link_flair_text": "Help",
      "permalink": "https://reddit.com/r/AIAssisted/comments/1qaldef/which_ai_tool_is_best_for_brain_storming/",
      "domain": "self.AIAssisted",
      "is_self": true,
      "comments": [
        {
          "id": "nz405f2",
          "author": "swingularity45",
          "text": "I’ve used Pi for this, but lately Claude and Grok have been pretty effective.  GPT is good enough for most purposes, but I know what you mean about the sugar-coating.",
          "score": 2,
          "created_utc": "2026-01-12 04:59:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "nz42zsf",
              "author": "kedcraft",
              "text": "Is it free?",
              "score": 3,
              "created_utc": "2026-01-12 05:19:17",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nz5eoeq",
                  "author": "swingularity45",
                  "text": "Yup.  [pi.ai](https://pi.ai)",
                  "score": 2,
                  "created_utc": "2026-01-12 12:16:46",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nz4b3bn",
          "author": "tolani13",
          "text": "Make a lateral framework prompt and filter the responses with levels of certainty",
          "score": 2,
          "created_utc": "2026-01-12 06:22:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "nz4blkj",
              "author": "kedcraft",
              "text": "Can you elaborate in simple words",
              "score": 2,
              "created_utc": "2026-01-12 06:26:43",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nz5q39u",
                  "author": "tolani13",
                  "text": "Sure — in simple terms:\n\n\n\nBy “lateral framework prompt” I just mean: instead of asking the AI one straight question, you give it a little structure, so it has to look at the problem from a few different angles and tell you how sure it is about each idea.\n\n\n\n1) You tell it which angles/roles to use (e.g. engineer, user, project manager).\n\n2) You make it list several options or ideas from each angle.\n\n3) You ask it to tag each idea with a confidence level (High / Medium / Low) and a one-line reason.\n\n\n\nHere’s a simple version you can copy/paste and adapt:\n\n\n\n“Act as a small panel of experts:\n\n\\- Role 1: \\[first angle\\]\n\n\\- Role 2: \\[second angle\\]\n\n\\- Role 3: \\[third angle\\]\n\n\n\nStep 1: For my question: “\\[your question here\\]”, have each role list 2–3 possible answers or approaches.\n\nStep 2: Under each answer, briefly list pros and cons.\n\nStep 3: For every answer, give a confidence rating (High / Medium / Low) and one sentence on why you picked that level.\n\nStep 4: Finish with a short summary comparing the highest-confidence answers and what you’d recommend.”\n\n\n\nThat’s all I meant by a “lateral framework prompt with certainty levels.”",
                  "score": 1,
                  "created_utc": "2026-01-12 13:31:17",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nz4ey8j",
          "author": "RevolutionaryPop7272",
          "text": "ChatGPT does sugar coat but if you prompt it to give you it from the point of view you want it does give a different view \nI might try the others to see the difference",
          "score": 2,
          "created_utc": "2026-01-12 06:55:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "nz4ft5z",
              "author": "kedcraft",
              "text": "Ya i guess i have to work on prompts",
              "score": 2,
              "created_utc": "2026-01-12 07:02:52",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nz4hb2k",
                  "author": "RevolutionaryPop7272",
                  "text": "Me to everyday a school day",
                  "score": 1,
                  "created_utc": "2026-01-12 07:15:59",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nz4k03h",
          "author": "kubrador",
          "text": "claude's way better for actual back-and-forth brainstorming imo. you can tell it to stop being nice and just poke holes in your ideas\n\nchatgpt defaults to \"great idea!\" energy which is useless when you're trying to figure out if something's actually dumb",
          "score": 2,
          "created_utc": "2026-01-12 07:40:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "nz4wefx",
              "author": "kedcraft",
              "text": "Okay 👍",
              "score": 2,
              "created_utc": "2026-01-12 09:38:43",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nz4v88b",
          "author": "Patient_Hippo_3328",
          "text": "Chatgpt and claude are both solid for quick idea dumps and miro's ai is nice when you want to visually organize messy thoughts into something usable.",
          "score": 2,
          "created_utc": "2026-01-12 09:27:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz4w8vy",
          "author": "marimarplaza",
          "text": "If you want less sugar-coated answers, try Claude for deeper, more critical thinking, or Perplexity if you want ideas backed by real sources and facts.\n\nAlso a lot depends on the prompts. Asking for risks, downsides, and contrary takes usually gets more useful business insight than brainstorm ideas.",
          "score": 2,
          "created_utc": "2026-01-12 09:37:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "nz617n0",
              "author": "kedcraft",
              "text": "Ya thats true but claude has less token limit compare to chat gpt",
              "score": 2,
              "created_utc": "2026-01-12 14:32:27",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nz5l6xj",
          "author": "Hereemideem1a",
          "text": "If you're brainstorming around meetings or convos, [Vomo](https://apps.apple.com/app/apple-store/id6449889336?pt=126411129&ct=redditbilly&mt=8)'s actually pretty solid. It auto-summarizes and lets you query your past notes. It helps me think clearer without digging through chaos.",
          "score": 2,
          "created_utc": "2026-01-12 13:01:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "nz6121t",
              "author": "kedcraft",
              "text": "Its free right?",
              "score": 1,
              "created_utc": "2026-01-12 14:31:36",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nz5tnrl",
          "author": "GMSkills",
          "text": "Boy this is a subliminal confession in self reflection and honesty if there ever was one.",
          "score": 2,
          "created_utc": "2026-01-12 13:51:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz60gaa",
          "author": "Itchy-Drawing",
          "text": "Honestly, when I need real brainstorming especially for business stuff, I’ve been using qwen more than anything. It actually pushes back or breaks ideas down in a useful way. Makes thinking through certain questions feel a lot more productive.",
          "score": 2,
          "created_utc": "2026-01-12 14:28:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "nz60zwi",
              "author": "kedcraft",
              "text": "Okay I'll try",
              "score": 2,
              "created_utc": "2026-01-12 14:31:16",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nz66kus",
          "author": "Candid-Patience-8581",
          "text": "The best AI for brainstorming is the one that argues back instead of applauding everything you say. If it pushes your ideas, pokes holes in them, and helps you think clearer, that’s the business-grade one.",
          "score": 2,
          "created_utc": "2026-01-12 15:00:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz6jf2m",
          "author": "InterYuG1oCard",
          "text": "Ai second brain app to synthesize ideas",
          "score": 2,
          "created_utc": "2026-01-12 16:02:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz6m0ot",
          "author": "Ok_Grab903",
          "text": "If you want to brainstorm ideas based off of data, you could upload some of your data into Querri and ask questions and ask for suggestions. I recently uploaded a years worth of LinkedIn analytic data and was able to analyze the top performing posts and even did a sentiment analysis on the post that did best. They have strict data policies, so your data is protected 😉.",
          "score": 2,
          "created_utc": "2026-01-12 16:14:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz6vnsn",
          "author": "tolani13",
          "text": "They're all good in their own way. You have to use the models to test their own their theories with edge case testing.  They're designed to be \"assistants\" for the general population. But when using them for more than that, they need to be focused and dialed into what you're actually talking about or what you're actually trying to determine.",
          "score": 2,
          "created_utc": "2026-01-12 16:57:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz7gvde",
          "author": "Afraid-Ambassador-64",
          "text": "I use claude for utilizing anything with writing / brainstorming and then use airops for content workflows. I find that chatgpt hallucinates more, or 'agrees' with just about anything I do, so I only use that for logical things like AI prompting or summarizing ideas.",
          "score": 2,
          "created_utc": "2026-01-12 18:34:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz8326l",
          "author": "NoSolution1150",
          "text": "nano banana  pro has really been great for me creative wise. you could also pair that with gemini 3 too for coming up with ideas or fleshing out ideas i found its been quite helpful",
          "score": 2,
          "created_utc": "2026-01-12 20:15:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz4sy0m",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-12 09:04:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "nz4wicz",
              "author": "kedcraft",
              "text": "I am from non technical background bro 😅",
              "score": 1,
              "created_utc": "2026-01-12 09:39:45",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nz56ein",
                  "author": "baradas",
                  "text": "Just use the web app (counsel.getmason.io) to get all the counsel you need",
                  "score": 1,
                  "created_utc": "2026-01-12 11:11:02",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nz74p96",
          "author": "OptimismNeeded",
          "text": "It’s not about the tool it’s about how you use it.\n\nHere’s what I do for brainstorming (personally I like Claude but this should work in any tool):\n\n1. When possible: give it context within boundaries. For this I like to use the “projects” feature, where I can upload files into a folder of chats.\n\nUnload every single file I can think of that’s related to the project: plans, agreements, pdf’s, excels, presentations etc.\n\nThis will already give you a head start because instead of thinking of generic ideas, it will give ideas specifically relevant to your project, and more importantly - ideas that take into account the realities of the project (so for example if there’s a budget excel in there it won’t give you ideas that require x10 the budget). \n\n2. General context: if it’s not a project or I don’t have files, what I’ll do is use the voice feature, open the mic and just start blabbering. I like doing this on the way to picking up my kids from school, some do it in the car ride back from work etc… and just brain dump… “I had this idea, and then I googled and found that… and told my friend and my sister and they said it’s stupid, but then I realized that bla bla bla bla bla”. \n\nThis also gives the tool context it can start to organize and use as a starting point to give you ideas that are tailored to you. \n\n3. Make sure it’s a conversation. Brainstorming is something humans do together. Don’t let the tool brainstorm for you - brainstorm together. You can put the hard work of coming up with ideas on the tool, but be part of the conversation. Tell it what you liked and why, or what you didn’t like and why. It has no ego or feelings so be as harsh of a critique as you need to be about his ideas, and keep going until you’re happy with something - AI has endless patience.\n\nHope this helps. \n\nI try to share stuff like this on r/ClaudeHomies feel free to join us there.",
          "score": 1,
          "created_utc": "2026-01-12 17:39:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzb7rlf",
          "author": "Fearless_Fox45",
          "text": "Tbh the most effective AI for brainstorming depends on how you utilize it. Chatgpt is best for brief ideas while claude, qwen or Pi can push back and challenge ideas for deeper thinking",
          "score": 1,
          "created_utc": "2026-01-13 06:40:03",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qckkjl",
      "title": "Be rude to AI it will improves accuracy",
      "subreddit": "AIAssisted",
      "url": "https://i.redd.it/23p1bzlyradg1.jpeg",
      "author": "Minimum_Minimum4577",
      "created_utc": "2026-01-14 11:09:18",
      "score": 7,
      "num_comments": 2,
      "upvote_ratio": 0.89,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/AIAssisted/comments/1qckkjl/be_rude_to_ai_it_will_improves_accuracy/",
      "domain": "i.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "nzir0nk",
          "author": "lookslikeyoureSOL",
          "text": "Im sure when all that new training data gets fed back into the next generation of AI models, the result will be completely benign and positive.\n\n/s",
          "score": 2,
          "created_utc": "2026-01-14 11:14:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzlbix7",
          "author": "danja",
          "text": "Says a lot more about Sergey Brin",
          "score": 1,
          "created_utc": "2026-01-14 19:15:16",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qa1qau",
      "title": "Turned my resume into a personal wiki and the magic happens",
      "subreddit": "AIAssisted",
      "url": "https://www.reddit.com/r/AIAssisted/comments/1qa1qau/turned_my_resume_into_a_personal_wiki_and_the/",
      "author": "Ok_Improvement7802",
      "created_utc": "2026-01-11 15:11:59",
      "score": 6,
      "num_comments": 6,
      "upvote_ratio": 0.8,
      "text": "I often forget my own achievements unless I’m staring at my resume. Here are some stacks that help.\n\nNotebookLM - Upload resume + past project docs. it basically becomes a podcast version of your career. I ask it things like what’s my strongest story for leadership? you may get unexpected great answers.\n\nObsidian - I keep a story bank n there: wins, failures, conflict stories, metrics.  \nSo I’m not reinventing answers every interview.\n\nCoco career AI - daily job matches with summaries. Helps me target roles that actually fit the story bank I have, instead of random reach roles.\n\nChatGPT - Tighten bullets + help turn stories into STAR format. Some rumors saying ChatGPT will release ChatGPT jobs. Let’s see how it will work",
      "is_original_content": false,
      "link_flair_text": "Tips & Tricks",
      "permalink": "https://reddit.com/r/AIAssisted/comments/1qa1qau/turned_my_resume_into_a_personal_wiki_and_the/",
      "domain": "self.AIAssisted",
      "is_self": true,
      "comments": [
        {
          "id": "nz02n65",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-11 17:14:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "nz50c3q",
              "author": "Ok_Improvement7802",
              "text": "notebooklm can do it too",
              "score": 1,
              "created_utc": "2026-01-12 10:16:07",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nz66u34",
          "author": "Candid-Patience-8581",
          "text": "This is honestly smart. Turning your resume into a searchable memory saves you from blanking in interviews like it’s a pop quiz on your own life. A personal wiki plus AI means you stop guessing your strengths and start answering with receipts, which is exactly what hiring managers think is “confidence.”",
          "score": 1,
          "created_utc": "2026-01-12 15:01:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "nz6bkhq",
              "author": "Ok_Improvement7802",
              "text": "right. we can use AI to better understand our career highlights before interviews",
              "score": 1,
              "created_utc": "2026-01-12 15:25:07",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzbj3jm",
          "author": "kubrador",
          "text": "coco career ad",
          "score": 1,
          "created_utc": "2026-01-13 08:22:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzbj80r",
              "author": "Ok_Improvement7802",
              "text": "actually chatgpt ad",
              "score": 1,
              "created_utc": "2026-01-13 08:24:00",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qewv41",
      "title": "Is the future of the note taking app just AI plus storage?",
      "subreddit": "AIAssisted",
      "url": "https://www.reddit.com/r/AIAssisted/comments/1qewv41/is_the_future_of_the_note_taking_app_just_ai_plus/",
      "author": "lebron8",
      "created_utc": "2026-01-17 00:01:21",
      "score": 6,
      "num_comments": 2,
      "upvote_ratio": 1.0,
      "text": "The more I think about it, the more it feels like note taking should be two steps. One tool to capture and understand information, and another to store it cleanly.\n\nI’ve been testing AI-assisted tools like Bluedot to handle summaries and key points, then keeping my actual notes very lightweight. It feels less overwhelming than traditional note taking.\n\nDo you see AI replacing the note taking app entirely, or just becoming the front layer for it?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/AIAssisted/comments/1qewv41/is_the_future_of_the_note_taking_app_just_ai_plus/",
      "domain": "self.AIAssisted",
      "is_self": true,
      "comments": [
        {
          "id": "o027qoe",
          "author": "newrockstyle",
          "text": "AI will probably handle summaries and insights but we will need storage apps for structured note keeping.",
          "score": 1,
          "created_utc": "2026-01-17 05:56:40",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qckygg",
      "title": "Can AI actually make a human tutor 10x more effective or is it just a distraction?",
      "subreddit": "AIAssisted",
      "url": "https://www.reddit.com/r/AIAssisted/comments/1qckygg/can_ai_actually_make_a_human_tutor_10x_more/",
      "author": "Otherwise-Treat113",
      "created_utc": "2026-01-14 11:31:43",
      "score": 4,
      "num_comments": 1,
      "upvote_ratio": 0.7,
      "text": "I have been taking some tutoring lessons on Wiingy recently and they have a feature called Co-Tutor AI that I have been testing out. It basically listens to the live session and as soon as it is over it generates a study kit for you. It creates things like 5 minute summary podcasts of the lesson, flashcards, and quizzes based specifically on what the tutor and I talked about.\n\nIt got me thinking about the AI versus Human debate in education. Personally, I find that I focus way more on the conversation now because I am not scrambling to take manual notes. I know the AI is building a cheat sheet for me in the background. It feels like the AI is not replacing the teacher, but it is definitely fixing the forgetting curve that happens after the call ends.\n\nIf you are a student, would you value a tutor more if they provided these kinds of AI generated summaries automatically, or do you think there is more value in the old school way of writing your own notes to make the info stick?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/AIAssisted/comments/1qckygg/can_ai_actually_make_a_human_tutor_10x_more/",
      "domain": "self.AIAssisted",
      "is_self": true,
      "comments": [
        {
          "id": "nzj19qz",
          "author": "GlitteringStyle2836",
          "text": "AI cant replace a real tutor. Your tutor is not just passing some information to you, he/she is also partnering with you for your success. AI can’t at best create some gamification, but can’t replace a person. \n\nIt’s helpful if it’s only reinforcing what your tutor has taught, helps you revisit your lessons in a clean and crisp manner.",
          "score": 2,
          "created_utc": "2026-01-14 12:32:43",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qducrt",
      "title": "Any recommendations for the best AI girlfriend 2026 ?",
      "subreddit": "AIAssisted",
      "url": "https://www.reddit.com/r/AIAssisted/comments/1qducrt/any_recommendations_for_the_best_ai_girlfriend/",
      "author": "ElestrenOpal",
      "created_utc": "2026-01-15 20:11:00",
      "score": 4,
      "num_comments": 8,
      "upvote_ratio": 0.59,
      "text": "Hey guys, im looking for the be⁤st ai girlfriend out there in right now. loads of options, want to be safe with privacy but also have good video options and call would be a real plus. what are the be⁤st for 2026 ?",
      "is_original_content": false,
      "link_flair_text": "Resources",
      "permalink": "https://reddit.com/r/AIAssisted/comments/1qducrt/any_recommendations_for_the_best_ai_girlfriend/",
      "domain": "self.AIAssisted",
      "is_self": true,
      "comments": [
        {
          "id": "nzt40o0",
          "author": "NickyB808",
          "text": "I would suggest you look for a real girlfriend",
          "score": 9,
          "created_utc": "2026-01-15 21:56:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzwcpsl",
              "author": "smxkie787",
              "text": "Here is your AI G⁤F.\n\nhttps://preview.redd.it/3hd2pdc8xodg1.jpeg?width=832&format=pjpg&auto=webp&s=21214ff71b3c0dc7b9b91ffd5712828ea25d14ee",
              "score": 1,
              "created_utc": "2026-01-16 10:41:57",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nzulqan",
              "author": "PiraEcas",
              "text": "this is the way",
              "score": -1,
              "created_utc": "2026-01-16 02:43:34",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzt5m0a",
          "author": "Gelu_Bumerang",
          "text": "[Check this comparison post](https://medium.com/@hellajerble/the-top-ai-girlfriend-experiences-for-nsfw-ai-chat-in-2025-4fde9bd6f269?postPublishedType=repub) if you want to dig it yourself",
          "score": 2,
          "created_utc": "2026-01-15 22:03:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzw2nly",
          "author": "Ok_Chef_5858",
          "text": "i don't believe in love in the time of ai girlfirends",
          "score": 1,
          "created_utc": "2026-01-16 09:09:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzsoiz2",
          "author": "Distinct_Tax4963",
          "text": "Some⁤one made [thi⁤s](https://docs.google.com/spreadsheets/d/17cWRjvbPwM4MT7CfTuNdUU2IBa9xHEhLAcGizvIJHGI/edit?gid=1135982146#gid=1135982146) compa⁤rison table with the to⁤p ones",
          "score": 1,
          "created_utc": "2026-01-15 20:44:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzsn2yf",
          "author": "InevitableSea5900",
          "text": "I would just use cliptalk to make talking avatars, i assume you want to make them and post on social?",
          "score": -1,
          "created_utc": "2026-01-15 20:38:04",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qb2zkc",
      "title": "Looking for Advice on the Best Course of Action - Image Generation",
      "subreddit": "AIAssisted",
      "url": "https://www.reddit.com/r/AIAssisted/comments/1qb2zkc/looking_for_advice_on_the_best_course_of_action/",
      "author": "jmmccann",
      "created_utc": "2026-01-12 18:32:52",
      "score": 3,
      "num_comments": 5,
      "upvote_ratio": 0.81,
      "text": "I am trying to generate an image from a photo with a very specific art style. For reference, it is the Clutch Cargo animation/art style (bold lines, vintage comic book esthetic). I want to use a photo of a person to get the likeness as close as possible. Also, once I get the likeness dialed in, I want to be able to generate poses and different images with the same \"character\". I realize this sounds pretty standard but I have experimented with a few different image generation models and nothing is even coming close. Does anyone any reccomendations? I'd love to hear your thoughts!\n\n  \nThanks in advance.",
      "is_original_content": false,
      "link_flair_text": "Help",
      "permalink": "https://reddit.com/r/AIAssisted/comments/1qb2zkc/looking_for_advice_on_the_best_course_of_action/",
      "domain": "self.AIAssisted",
      "is_self": true,
      "comments": [
        {
          "id": "nzah80f",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 2,
          "created_utc": "2026-01-13 03:37:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzatqs2",
              "author": "jmmccann",
              "text": "Thanks I’ll check it out!",
              "score": 2,
              "created_utc": "2026-01-13 04:53:05",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzvdkvn",
          "author": "cfwes",
          "text": "[https://gentube.app/](https://gentube.app/?_cid=cm,f) has a consistent character tool with a \"variation\" thing that might help! it's also free",
          "score": 2,
          "created_utc": "2026-01-16 05:36:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzx2kdj",
              "author": "jmmccann",
              "text": "Amazing! Thanks!",
              "score": 1,
              "created_utc": "2026-01-16 13:41:26",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    }
  ]
}