{
  "metadata": {
    "last_updated": "2026-02-21 08:57:51",
    "time_filter": "week",
    "subreddit": "aipromptprogramming",
    "total_items": 2,
    "total_comments": 14,
    "file_size_bytes": 17918
  },
  "items": [
    {
      "id": "1r4lgpf",
      "title": "90 days before all platforms are flooded with AI slop to the point where they are no longer usable",
      "subreddit": "aipromptprogramming",
      "url": "https://i.redd.it/v798gh8pvgjg1.jpeg",
      "author": "dataexec",
      "created_utc": "2026-02-14 14:05:28",
      "score": 123,
      "num_comments": 29,
      "upvote_ratio": 0.91,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/aipromptprogramming/comments/1r4lgpf/90_days_before_all_platforms_are_flooded_with_ai/",
      "domain": "i.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "o5f1yxy",
          "author": "angry_gingy",
          "text": "source?: trust me bro",
          "score": 30,
          "created_utc": "2026-02-14 22:54:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5iupsu",
              "author": "gaudiocomplex",
              "text": "This has been a long established outcome of dead internet theory, or particularly the dark forest subset that believes traditional channels will become so overwrought with bot activity that we will retreat to private online spaces where there's some way to verify humanity. It's not an original thought at all and there's plenty of scholarly work on it.",
              "score": 26,
              "created_utc": "2026-02-15 15:48:39",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o67cto8",
                  "author": "Imaginary_Cellist272",
                  "text": "Why 90? Why not 1000? Why not last year? That's the trust me bro",
                  "score": 3,
                  "created_utc": "2026-02-19 07:16:59",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5dhmv6",
          "author": "chumbaz",
          "text": "This is already happening in places I moderate. Now I’m checking account ages constantly because now I’m seeing bots talking to bots in groups where you’re asking for specific help in a specific industry. \n\nThey’re literally making up problems to get other bots to make up helpful answers.",
          "score": 18,
          "created_utc": "2026-02-14 17:54:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5hefyq",
              "author": "saintpetejackboy",
              "text": "Yeah, people don't realize the insidious nature of some of this shit. It isn't just marketing and all the malfeasance that goes along with that, but pushing ideologies and forming \"the opinion\" of the public. You see a topic being discussed about something polarizing and see several different viewpoints offered, and ironically, they are all coming from bots. The goal used to be, basically, expose people to information - inform people so they can make a decision (journalism and reporting in general). Now, the goal seems to be spoon-feeding us the entire narrative along with how we are supposed to feel about it.\n\nAnother really interesting thing is \"audience farming\", I know there is probably another name for it. Here is the basic premise:\n\nYou know those obviously fake AI videos and pictures people share on platforms like Facebook? Like \"here is this African child who built a helicopter out of plastic water bottles!\"\n\nWell, when people like or share those videos, they are \"marked\" as gullible idiots. This might seem harmless, but now they are easy to identify as potential victims of future scams. If they are stupid enough to fall for the AI slop, they probably want to invest in a crypto pyramid scheme or romance scam. The video or pictures being OBVIOUSLY and blatantly fake is a baked in part of the litmus test: if an average person or a smart person might also be tricked, then the content doesn't hold as much value.\n\nSome of those even involve \"switches\", so, say I make a group on Facebook of \"Funny cute kittens\", and I get thousands of followers, then without warning I swap if over to \"crypto millions\" scam machine page. These people are already now in the group and I have front row access to their content feed. (And this is a gross over-simplification of how complex and malicious some of these schemes are)\n\nAs a programmer,  I became acutely aware of this \"underworld\" many years ago after having been approached to contribute to some of these same kind of scams. Long before AI was even as capable as it is now, back when it couldn't even make Will Smith eat spaghetti. This isn't just a \"in theory\" or \"maybe\" scenario, this is real stuff already deployed and active in the same world we occupy, daily.\n\nhttps://misinforeview.hks.harvard.edu/article/how-spammers-and-scammers-leverage-ai-generated-images-on-facebook-for-audience-growth/\n\nMost people think \"aha! This video/picture is AI!\", but they don't stop to think: why would somebody make this? What is the point of a picture supposedly showing an orphan child constructing a jet engine from driftwood? Who benefits from disseminating that content? Why would they put the effort?\n\nSo then, there is the obvious, low-hanging fruit: they just want the engagement and the traffic is often worth money (so, direct clicks to an ad-bloated third party site to take in those ad dollars).\n\nBut, some of them are also trying to sell fake products and outright scam users out of their data, or money. Direct scams from the content. Pretty obvious, and not what I am talking about.\n\nWhile those things exist, so does the \"let's see how many complete idiots we can get to like and share this obvious brain rot AI story about a little girl with cancer being visited by a bunch of bikers, so we can later use them as a list of leads to hit up for our crypto scam\".\n\nA good analogy here is to imagine the scammers are mechanics. Their goal is to tell you a $5 repair is due to your car having run out of blinker fluid, causing your engine to backfire and, without this very costly repair, your house will burn down. Does it make sense? How could your car being broken cause your house to burn down? How would an electronic thing like your turn signal require a liquid fluid to operate? \n\nThey don't want people who would ask those type of questions or use critical thinking. They don't want another mechanic to happen to bring their car in. \n\nBut, WHAT IF, they could corner the market in 79 year old ladies who couldn't tell a transmission from a transsexual? Well, in that case, mam, it seems like you made a fatal mistake. Do you even remember the last time you had your blinker fluid topped off, or replaced? Probably not, which is why your house might burn down.",
              "score": 11,
              "created_utc": "2026-02-15 09:36:39",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o5j2gpc",
              "author": "QueshunableCorekshun",
              "text": "People create throwaway accounts and have since day 1. How is accounts age going to tell you much other than the age? Are you just assuming that new accounts are bots? Or do you have a legitimate method?",
              "score": 1,
              "created_utc": "2026-02-15 16:26:19",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5moqtv",
                  "author": "chumbaz",
                  "text": "These aren't throwaways. It's very obvious, but I always check account age to sanity check. A lot of these bots are SUPER verbose which normal people asking questions in our group don't do. Then the bots that answer respond in kind with multiple paragraphs of glazing when \"You are correct\" would suffice.",
                  "score": 3,
                  "created_utc": "2026-02-16 04:30:47",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5dvvxa",
          "author": "PersonoFly",
          "text": "This is just the next individual wanting attention. Platforms are deleting ai and non-ai slop as we speak.",
          "score": 20,
          "created_utc": "2026-02-14 19:04:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5he8ed",
              "author": "stingraycharles",
              "text": "They’re not deleting nearly enough, fast enough though. It’s obvious Reddit is completely drowning in AI slop.",
              "score": 15,
              "created_utc": "2026-02-15 09:34:38",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o5femjf",
              "author": "jeffwadsworth",
              "text": "Yeah just grandstanding with his pet theory.  It won’t happen because of paid verified accounts.",
              "score": -1,
              "created_utc": "2026-02-15 00:12:10",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5gfeal",
          "author": "Illustrious-Film4018",
          "text": "Why 90 days? I don't get it. This has been possible for a while now...",
          "score": 5,
          "created_utc": "2026-02-15 04:20:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5iecfo",
              "author": "pinkypearls",
              "text": "He thinks the world will massively adopt OpenClaw in 90 days or less. He’s an idiot.",
              "score": 3,
              "created_utc": "2026-02-15 14:22:13",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5zaw8j",
                  "author": "Ecstatic-Run-9767",
                  "text": "Can anyone tell me why OpenClaw is a big deal, I'm not sure I get it.",
                  "score": 2,
                  "created_utc": "2026-02-18 02:15:05",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5s1v9o",
          "author": "bs679",
          "text": "The bots aren't doing this on their own. Actual human beings are directing them to do insidious shit. The worst shit on agent social networks is prompted by humans.",
          "score": 4,
          "created_utc": "2026-02-17 00:08:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5feeiq",
          "author": "jeffwadsworth",
          "text": "Yawn.  Ok",
          "score": 3,
          "created_utc": "2026-02-15 00:10:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5du33m",
          "author": "GrowFreeFood",
          "text": "I'm been writing smoke-signal memes for just such an occasion.\n\n🔥☁️ ☁️",
          "score": 2,
          "created_utc": "2026-02-14 18:55:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5mf2cm",
          "author": "Wayward_Prometheus",
          "text": "Good. Adapt or leave.  \nWe create technology to take over the tasks we don't want to do or atleast make things easier.  \nIF that was the road we took, why should we believe we will not be outpaced in general by our own technology?\n\nThis is what we wanted. Either we use it or step to the side and go do other things......that are left to do.",
          "score": 2,
          "created_utc": "2026-02-16 03:23:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5cdesn",
          "author": "Snoron",
          "text": "Stopping it is easy, just disable all the accounts that didn't confirm their identity with ID ;)\n\nUK just getting ahead, haha.",
          "score": 2,
          "created_utc": "2026-02-14 14:24:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5cdv1z",
              "author": "dataexec",
              "text": "I see. I guess that is why he is saying that then. They are making users pay to verify and that will get rid of those who have not verified their profiles.",
              "score": 2,
              "created_utc": "2026-02-14 14:27:28",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5ieiv5",
                  "author": "pinkypearls",
                  "text": "Bots pay for verified accounts, I’m not sure why he thinks this solves anything.",
                  "score": 1,
                  "created_utc": "2026-02-15 14:23:15",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5hdhrl",
          "author": "HedgepigMatt",
          "text": "RemindMe! 90 days",
          "score": 1,
          "created_utc": "2026-02-15 09:27:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5hdkxp",
              "author": "RemindMeBot",
              "text": "I will be messaging you in 3 months on [**2026-05-16 09:27:19 UTC**](http://www.wolframalpha.com/input/?i=2026-05-16%2009:27:19%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/aipromptprogramming/comments/1r4lgpf/90_days_before_all_platforms_are_flooded_with_ai/o5hdhrl/?context=3)\n\n[**2 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Faipromptprogramming%2Fcomments%2F1r4lgpf%2F90_days_before_all_platforms_are_flooded_with_ai%2Fo5hdhrl%2F%5D%0A%0ARemindMe%21%202026-05-16%2009%3A27%3A19%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201r4lgpf)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
              "score": 1,
              "created_utc": "2026-02-15 09:28:11",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5i6tc1",
          "author": "Rajiin_B",
          "text": "RemindMe! 90 days",
          "score": 1,
          "created_utc": "2026-02-15 13:37:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5p0j89",
          "author": "David-Bogea",
          "text": "Why 90 days tho? 🧢",
          "score": 1,
          "created_utc": "2026-02-16 15:14:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5p10vu",
              "author": "dataexec",
              "text": "It wouldn’t grab people’s attention if it was longer",
              "score": 3,
              "created_utc": "2026-02-16 15:16:38",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5p29wc",
                  "author": "David-Bogea",
                  "text": "Hahah, fair enough",
                  "score": 1,
                  "created_utc": "2026-02-16 15:22:51",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5smm4c",
          "author": "theosib",
          "text": "Haha. Social media is already flooded with foreign trolls, paid to sew political discord. And there are already plenty of bots. It's bad and only going to get worse. But social media platforms are fine with this since it makes the advertisers think they're getting views.",
          "score": 1,
          "created_utc": "2026-02-17 02:10:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5xgyzg",
          "author": "gmcarve",
          "text": "…. Is this why over the last few days my phone has been blowing up with junk text and calls",
          "score": 1,
          "created_utc": "2026-02-17 20:36:28",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r4viuv",
      "title": "What did i just create? Introducing RuVector Format (.RVF) A Cognitive Container. One Ai file to rule them all.",
      "subreddit": "aipromptprogramming",
      "url": "https://v.redd.it/naex201mvijg1",
      "author": "Educational_Ice151",
      "created_utc": "2026-02-14 20:49:27",
      "score": 5,
      "num_comments": 1,
      "upvote_ratio": 0.86,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/aipromptprogramming/comments/1r4viuv/what_did_i_just_create_introducing_ruvector/",
      "domain": "v.redd.it",
      "is_self": false,
      "comments": []
    }
  ]
}