{
  "metadata": {
    "last_updated": "2026-01-21 02:39:59",
    "time_filter": "week",
    "subreddit": "aipromptprogramming",
    "total_items": 20,
    "total_comments": 138,
    "file_size_bytes": 132268
  },
  "items": [
    {
      "id": "1qcsjza",
      "title": "MIT and Harvard accidentally discovered why some people get superpowers from ai while others become useless... they tracked hundreds of consultants and found that how you use ai matters way more than how much you use it.",
      "subreddit": "aipromptprogramming",
      "url": "https://www.reddit.com/r/aipromptprogramming/comments/1qcsjza/mit_and_harvard_accidentally_discovered_why_some/",
      "author": "johnypita",
      "created_utc": "2026-01-14 16:55:16",
      "score": 730,
      "num_comments": 82,
      "upvote_ratio": 0.9,
      "text": "so these researchers at both MIT, Harvard and BCG ran a field study with 244 of BCG's actual consultants. not some lab experiment with college students. real consultants doing real work across junior mid and senior levels.\n\n\n\nthey found three completely different species of ai users emerging naturally. and one of them is basically a skill trap disguised as productivity.\n\n\n\ncentaurs - these people keep strategic control and hand off specific tasks to ai. like \"analyze this market data\" then they review and integrate. they upskilled in their actual domain expertise.\n\n\n\ncyborgs - these folks do this continuous dance with ai. write a paragraph let ai refine it edit the refinement prompt for alternatives repeat. they developed entirely new skills that didnt exist two years ago.\n\n\n\nself-automators - these people just... delegate everything. minimal judgment. pure handoff. and heres the kicker - zero skill development. actually negative. their abilities are eroding.\n\n\n\nthe why is kind of obvious once you see it. self-automators became observers not practitioners. when you just watch ai do the work you stop exercising teh muscle. cyborgs stayed in the loop so they built this weird hybrid problem solving ability. centaurs retained judgment so their domain expertise actually deepened.\n\n\n\nno special training on \"correct\" usage. just let consultants do their thing naturally and watched what happened.\n\n\n\nthe workflow that actually builds skills looks like this\n\n\n\n1. shoot the problem at ai to get initial direction\n\n2. dont just accept it - argue with the output\n\n3. ask why it made those choices\n\n4. use ai to poke holes in your thinking\n\n5. iterate back and forth like a sparring partner\n\n6. make the final call yourself\n\n\n\nthe thing most people miss is that a centaur using ai once per week might learn and produce more than a self-automator using it 40 hours per week. volume doesnt equal learning or impact. the mode of collaboration is everything.\n\n\n\nand theres a hidden risk nobody talks about. when systems fail... and they will, \n\nself automators cant recover. they delegated the skill away. its gone.\n\n  \n\n\n\n\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/aipromptprogramming/comments/1qcsjza/mit_and_harvard_accidentally_discovered_why_some/",
      "domain": "self.aipromptprogramming",
      "is_self": true,
      "comments": [
        {
          "id": "nzku5sd",
          "author": "paintmonkey75",
          "text": "I’d like to see source if you have a link?",
          "score": 29,
          "created_utc": "2026-01-14 17:58:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzlh07l",
              "author": "throwaway867530691",
              "text": "This study is very outdated. Here's some other stuff I just found https://www.perplexity.ai/search/5fc4df5f-2ab8-4fe3-9075-3e85503f6d26",
              "score": 23,
              "created_utc": "2026-01-14 19:40:13",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzlz3vw",
                  "author": "kronos55",
                  "text": "So newer research proves it's way more complex that centaurs and cyborgs.",
                  "score": 13,
                  "created_utc": "2026-01-14 21:02:36",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o02gvsz",
                  "author": "mrfredngo",
                  "text": "Outdated? The study was revised in Dec 2025. It’s only Jan 2026.",
                  "score": 1,
                  "created_utc": "2026-01-17 07:15:29",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nzoktkr",
              "author": "sid351",
              "text": "How very \"centaur\" of you.\n\nEqually, same.",
              "score": 2,
              "created_utc": "2026-01-15 05:53:17",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nzr5x5n",
              "author": "thegian7",
              "text": "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=4921696",
              "score": 2,
              "created_utc": "2026-01-15 16:37:48",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzu9gv4",
                  "author": "ChemistNo8486",
                  "text": "Damn. Thank you! \n\nNgl, I read the title and I thought it was gonna be come false shit for clickbait lmao",
                  "score": 1,
                  "created_utc": "2026-01-16 01:35:01",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzko6ou",
          "author": "Snoron",
          "text": ">the workflow that actually builds skills looks like this\n\nYeah, the way I think about this now is to essentially treat the AI like a human work partner with a *different* set of strengths and weaknesses to yourself.\n\nFirst, you need to also discuss, not just instruct.\n\nAnd within that, you want to use the AI's strengths to cover your weaknesses. And similarly cover the AI's weaknesses with your strengths.\n\nAI won't tend to question you much by default, but it's easy enough to tell it to!\n\nWorking this way, you actually gain a lot of skills and knowledge along the way.",
          "score": 12,
          "created_utc": "2026-01-14 17:31:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzkro9a",
              "author": "johnypita",
              "text": "absoulutly, most people treat ai like a vending machine. put prompt in get answer out. but the centaurs and cyborgs from the study basically treat it like a junior colleague who happens to have read everything but has questionable judgement\n\nand yeah telling it to push back is underrated.",
              "score": 1,
              "created_utc": "2026-01-14 17:47:24",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzkt8wj",
                  "author": "Snoron",
                  "text": ">treat it like a junior colleague who happens to have read everything but has questionable judgement\n\nHaha, yeah that's brilliant.\n\nI have told a lot of people that essentially if you want to have any success at AI coding, *you* need to be the senior developer. You don't have to write all the code, but you can't let it take over the project. You can't be the boss and treat it like a senior dev - at least not yet! And essentially if you don't have the skills to be the senior dev, it's only a matter of hours or days until you hit a wall with it.\n\nBut yeah one of the biggest uses of AI is essentially to help you ensure you don't miss anything - you can have a a goal with 2 or 3 ideas of how to approach it and what issues you might find... but AI will often be able to expand that and prevent you from wasting time on dead ends, etc.\n\nSo \"inexperienced with encyclopaedic knowledge\" is about right!",
                  "score": 3,
                  "created_utc": "2026-01-14 17:54:21",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o08p6nw",
                  "author": "i_wish_i_had_ur_name",
                  "text": "and when my actual junior colleagues turn over raw output from their ai i tell them i cant manage both them and their ai. “if you rather i ask chatgpt instead of you let me know”",
                  "score": 1,
                  "created_utc": "2026-01-18 05:06:57",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzl08ov",
          "author": "jay_in_the_pnw",
          "text": "https://www.hbs.edu/faculty/Pages/item.aspx?num=68273\n\nhttps://www.hbs.edu/ris/Publication%20Files/26-036_e7d0e59a-904c-49f1-b610-56eb2bdfe6f9.pdf\n\nnot peer reviewed, builds on prior work from this team, I don't like the terminology, sounds like marketing bullshit I'd expect from BCG though in this case it comes from the Wharton asshole.",
          "score": 10,
          "created_utc": "2026-01-14 18:25:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzleg8g",
              "author": "dionebigode",
              "text": "The naming decisions on these already make me cringe of their actual value",
              "score": 4,
              "created_utc": "2026-01-14 19:28:36",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nzmlomr",
              "author": "Dry_Author8849",
              "text": "It's pretty unreliable. First of all is about business analytics, deciding which fictional brands should receive investments.\n\nHow on earth you can depict cyborgs and whatever is beyond my wildest imagination. The word consultant is misleading, maybe a business consultant? Whatever.\n\nNothing useful in there. Seems like a pile of crap to me.",
              "score": 1,
              "created_utc": "2026-01-14 22:46:55",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nzo0e1e",
              "author": "imatt3690",
              "text": "Non peer reviewed papers are marketing bullshit. Always are. This whole study is useless as factual data. AI sucks because it is incapable of being right and you need to know enough about a domain to know when it’s wrong. This makes us mostly useless for majority of the working population.",
              "score": 1,
              "created_utc": "2026-01-15 03:31:15",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nzokgmq",
              "author": "The_ivy_fund",
              "text": "This is genuinely braindead lmao",
              "score": 1,
              "created_utc": "2026-01-15 05:50:25",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzknnf1",
          "author": "FabulousLazarus",
          "text": "AI is straight up wrong so often that this data isn't surprising. \n\nI would wager there's a direct correlation between IQ and the categories you've listed from the study. \n\nYou have to be intelligent enough to know when you're being lied to. Intelligent enough to question the AI. And intelligent enough to question yourself especially. \n\nThe complexity of that kind of interaction is repugnant to many. For an intelligent person looking for a genuine answer, that complexity is a ladder.",
          "score": 33,
          "created_utc": "2026-01-14 17:29:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzkr828",
              "author": "johnypita",
              "text": "smart people can still be self-automators if their ego wont let them question outputs. and someone with average iq but genuine curiosity becomes a cyborg naturaly because they actually want to understand\n\nthe ladder vs repugnant framing is spot on tho. same complexity, completely different relationship to it",
              "score": 9,
              "created_utc": "2026-01-14 17:45:24",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzkszkq",
                  "author": "BranchDiligent8874",
                  "text": "My experience with coding is: After 10+ years of experience you do not lose that skill. You are rusty but then you are running as fast as any other in like a month or so of working full time.\n\nSame with using AI, even if I delegate, I will review it so all I am losing is the ability to hand type long ass syntax, which does not add any value anyways.\n\nIMO, it all boils down to how good the person is to begin with.\n\nI do not let my code file touched by AI, fucking thing is hallucinating and breaks my chain of thoughts. I just give it instructions in chat window, when I know that the problem is easy but will take me an hour to type 40-50 lines of code for that method. So far results are amazing, AI is very good at taking instructions and write good code if the problem is well defined.\n\nIMO, productivity goes up by 100% if you know what you are doing and know the limitations of current AI tools.\n\ncc u/FabulousLazarus",
                  "score": 9,
                  "created_utc": "2026-01-14 17:53:12",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nzm9k7k",
                  "author": "Peter-rabbit010",
                  "text": "it roughly matches the impact of money.  hand a lot of money to a rich person, they probably make more. hand a lot of money to a poor person, they probably spend it immediately. \n\n  \nHand a lot of intellectual horsepower to a smart person, they use it well.  Hand a lot of intellectual horsepower to a dumb person, they are still a dumb person.  \n\n  \nto me it really hasn't changed how the world works",
                  "score": 4,
                  "created_utc": "2026-01-14 21:49:30",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nzp564a",
              "author": "Aggressive-Bother470",
              "text": "I doubt it's a bell curve. ",
              "score": 2,
              "created_utc": "2026-01-15 08:54:35",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o043dfx",
              "author": "jaydizzleforshizzle",
              "text": "This is why I’m a firm believer in using ai outside your domain of expertise is a recipe for disaster.",
              "score": 1,
              "created_utc": "2026-01-17 14:54:06",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzkvxzo",
          "author": "cp5i6x",
          "text": "Link the source",
          "score": 7,
          "created_utc": "2026-01-14 18:06:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzl35dg",
          "author": "spiegro",
          "text": "I have been reading this really interesting book about this very topic, called [Burnout from Humans: A Little Book About AI That Is Not Really About AI](https://burnoutfromhumans.net/). \n\nIt's really good, quite profound.",
          "score": 5,
          "created_utc": "2026-01-14 18:38:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzl40eg",
              "author": "johnypita",
              "text": "nteresting havent heard of that one\n\nwhos the author? might have to add it to teh list",
              "score": 2,
              "created_utc": "2026-01-14 18:41:49",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzl75qr",
                  "author": "spiegro",
                  "text": "When my dad brought it to me he pitched it as \"an indigenous author uses their contextual lense on how humans can better interact with AI, without losing themselves along the way.\"",
                  "score": 2,
                  "created_utc": "2026-01-14 18:55:40",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nzl6udx",
                  "author": "spiegro",
                  "text": "> Free book and companion website written by an artificial intelligence and human researcher challenging assumptions on human-AI relationships.\n\n> Burnout From Humans primarily refers to a provocative collaborative project and book released in January 2025 by researcher Vanessa Andreotti (playfully named \"Dorothy Ladybugboss\") and a \"trained emergent intelligence\" called Aiden Cinnamon Tea.",
                  "score": 1,
                  "created_utc": "2026-01-14 18:54:18",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o096rv7",
              "author": "SallyTheBeast777",
              "text": "perhaps there are some (un?)physical foundations for... a \"relational universe\"?\n\nhttps://scaryslaves.net\n\n:spoiler: AI-content, prompted by a human user ;-)",
              "score": 1,
              "created_utc": "2026-01-18 07:29:47",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzot2m3",
          "author": "snakesoul",
          "text": "Some people use AI to help them design their first PCB or plan a startup idea. Others use AI for bullshit.\n\nI think that's all.",
          "score": 3,
          "created_utc": "2026-01-15 07:02:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzq5sxr",
          "author": "Mundane_Life_5775",
          "text": "AI magnifies competence. It also makes incompetence louder.\n\n\nYou come to this conclusion after observing others for a while.",
          "score": 3,
          "created_utc": "2026-01-15 13:43:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzrrf2x",
              "author": "michael0n",
              "text": "A physics researcher described that the specialized math ai can argue about thought processes, and it pointed out that he could skip a whole step because his problem is a special case. He completely forgot that. For me this is one of the use cases of ai that make sense. Having that constantly updated expert in your pocket to reason super specific things with, while still doing your job. Imagine millions of village doctors checking if their limited knowledge about strange symptoms are still valid will be a game changer.",
              "score": 2,
              "created_utc": "2026-01-15 18:14:19",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzkwshk",
          "author": "cleverbit1",
          "text": "Yeah this resonates. I've seen people try using AI and get frustrated and bounce, meanwhile since I first tried it nearly 3 years ago I've been hooked. Quit my job, re-focused. The whole nine yards. What a time to be alive!!",
          "score": 2,
          "created_utc": "2026-01-14 18:10:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzlb6ss",
              "author": "Technical-Will-2862",
              "text": "Quit my job in June 2022. I’ve been on the wave ever since. I kinda have this mental narrative of everything I’ve learned that I knew little about prior to AI, almost like a completely different human. ",
              "score": 2,
              "created_utc": "2026-01-14 19:13:44",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzl03k1",
          "author": "Kinu4U",
          "text": "Ok. Finally. I have a new species in my house. CyborgCentaur",
          "score": 2,
          "created_utc": "2026-01-14 18:24:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzl3lx9",
              "author": "johnypita",
              "text": "haha love it  \n the mythological mashup\n\nhonestly thats probably the actual goal state  \n like pure centaur might be too hands-off and pure cyborg might be too in the weeds. switching modes based on what the task actually needs, someone should tell the harvard researchers they missed one",
              "score": 1,
              "created_utc": "2026-01-14 18:40:02",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "nzw3suo",
              "author": "Piece_de_resistance",
              "text": "The homo-cyborg and homo-centaur",
              "score": 1,
              "created_utc": "2026-01-16 09:20:22",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzm3l6b",
          "author": "NullTerminator99",
          "text": "It really took an MIT and Harvard study to state the obvious. I will be honest. I have used ai in all 3 ways. Mainly centaurs, and cyborg; but i will admit i have occasionally been a self-automator especially on a problem i could care less about and just wanted out of my way...",
          "score": 2,
          "created_utc": "2026-01-14 21:22:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzm946m",
          "author": "Peter-rabbit010",
          "text": "If your skill was using an abacus and the calculator got invented, maybe your skill \\*should\\* be delegated away.  c'est la vie\n\n\n\nYou should actually be increasing your reading speed if you are a self automator.  You might even be reading and learning sub consciously as long as you are looking at the output (even if not actually doing anything with it, ie using claude code)\n\nYour ability to process information might be going up.",
          "score": 2,
          "created_utc": "2026-01-14 21:47:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzo78kc",
          "author": "Bloke73",
          "text": "Sometimes clear context takes time for what I am trying to complete so I revise the prompt at times until I have created a monster, lol, but at times the process leads me to alternatives I had not considered.",
          "score": 2,
          "created_utc": "2026-01-15 04:15:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzobudh",
          "author": "Weak-Theory-4632",
          "text": "Centaurs and Cyborgs seem to be using AI as a new tool to enhance their performance, while Self-automators are using it as a crutch.",
          "score": 2,
          "created_utc": "2026-01-15 04:46:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzomh1e",
              "author": "Caderent",
              "text": "Crutch is a tool. Could it be entry level new guys VS experienced seniors thing. If you don’t have skills and experience you can’t check on and challenge AI opinion as it is the only information you have. You just take it for granted and build on that.",
              "score": 2,
              "created_utc": "2026-01-15 06:06:33",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzr56i6",
          "author": "safeter",
          "text": "This whole thing reads like bullshit.",
          "score": 2,
          "created_utc": "2026-01-15 16:34:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzldapd",
          "author": "dionebigode",
          "text": "Link?",
          "score": 1,
          "created_utc": "2026-01-14 19:23:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzlfmkv",
          "author": "Ok-Win-7503",
          "text": "I like the centaur example. \n\nNiche industry experts who use AI will dominate this next era. Industry experts who don’t adapt with AI or technologist who refuse to become an expert in a non technological fields will be left behind.",
          "score": 1,
          "created_utc": "2026-01-14 19:34:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzlm33p",
          "author": "TheJohnnyFlash",
          "text": "Exactly like work from home.",
          "score": 1,
          "created_utc": "2026-01-14 20:03:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzlu81a",
          "author": "Ok-Attention2882",
          "text": "AI usage is like the Mask. It amplifies who you already are. If you're a rockstar, you'll become a deity. If you're mediocre, you'll execute mediocrity at a faster pace.",
          "score": 1,
          "created_utc": "2026-01-14 20:40:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzm1pl6",
          "author": "CuriousDetective0",
          "text": "So centaurs or cyborgs?",
          "score": 1,
          "created_utc": "2026-01-14 21:14:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzm5pu6",
          "author": "Plenty-Hair-4518",
          "text": "Lately when I've brought up topics to an LLM, it will interject it's own points and then refine the points it made unless i specifically mention every single thing again in my response. So if i challenge one part of it in my response only, it will just retain all the shit it edited without me and im just watching it talk to itself essentially.\n\nThis is helping my BS meter because humans do this constantly too. They will interpret something you said as something else, ask no questions, reevaluate the info with their own internal system and react from THAT rather than what you actually said.\n\nSo in a weird way, a.i. is helping me recognize more when people interject their own BS into our conversations then try to say I said it.",
          "score": 1,
          "created_utc": "2026-01-14 21:32:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzzuktm",
              "author": "Useful-Temperature89",
              "text": "you should try claude-code",
              "score": 1,
              "created_utc": "2026-01-16 21:22:03",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzm7ojh",
          "author": "c0ventry",
          "text": "Filed under obvious.",
          "score": 1,
          "created_utc": "2026-01-14 21:41:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzn5rja",
          "author": "LusciousLabrador",
          "text": "I highly recommend the DORA AI report and DORA AI Capability model:  \n[https://dora.dev/ai/](https://dora.dev/ai/)  \n[https://dora.dev/research/2025/dora-report/](https://dora.dev/research/2025/dora-report/)\n\nThe team behind it are highly respected in DevOps circles. While I'm sure the they have their own biasses, their work is based on large scale, empirical, peer reviewed research.",
          "score": 1,
          "created_utc": "2026-01-15 00:33:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzndyea",
          "author": "BrainLate4108",
          "text": "I mean isn’t this common sense stuff? Don’t accept the output verbatim, entertain all angles, add your specific thought and perspective and smooth out the solution. Who takes it straight from the llm?",
          "score": 1,
          "created_utc": "2026-01-15 01:19:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nznruw5",
          "author": "CryptographerCrazy61",
          "text": "lol I’m a centaurborg, I do both depending on what I’m doing and if it’s an entirely new domain or not",
          "score": 1,
          "created_utc": "2026-01-15 02:40:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nznyr5r",
          "author": "chuiy",
          "text": "All I know is I don't care what people say about AI.  I get Gemini through Google work space and am going to ride this chariot or productivity until the wheels fall off or Google starts charging me $1000 a month.  I've developed an entire game in about a week automating probably 10,000+ lines of code.",
          "score": 1,
          "created_utc": "2026-01-15 03:21:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzo8dgy",
          "author": "StillHoriz3n",
          "text": "I call bullshit - saying that people who choose to automate are eroding their skillset is absurd. Do you know many skills I’ve developed on the path to automation? I centaur or orchestrate plenty also. Flattening shit like this is toxic and not helpful.",
          "score": 1,
          "created_utc": "2026-01-15 04:22:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzopqyj",
          "author": "That_Breath_4660",
          "text": "Great post!",
          "score": 1,
          "created_utc": "2026-01-15 06:33:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzp4dx8",
          "author": "PrezzNotSure",
          "text": "Up doot for teh",
          "score": 1,
          "created_utc": "2026-01-15 08:47:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzp50iu",
          "author": "Aggressive-Bother470",
          "text": "Ain't nobody tryna build 'skills'. Skills is the old way of thinking. The only thing that matters is speed and correctness of outputs.\n\n\nGiven how fake jobs are the default, it's completely understandable why people skip the correctness part entirely.",
          "score": 1,
          "created_utc": "2026-01-15 08:53:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzr48zk",
          "author": "micskeens",
          "text": "I am a cyborg all day",
          "score": 1,
          "created_utc": "2026-01-15 16:30:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzr7yki",
          "author": "pietremalvo1",
          "text": "They discovered critical thinking?",
          "score": 1,
          "created_utc": "2026-01-15 16:46:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nztitmc",
          "author": "davesmith001",
          "text": "that sounds about right, people who know what they are doing and have a broad gut feeling what the right answer is will always get more out of AI. It really is not a lazy man's tool and can be persistently wrong very confidently.",
          "score": 1,
          "created_utc": "2026-01-15 23:09:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nztybt0",
          "author": "latenightwithjb",
          "text": "Why “self automators” and why not “managers, delegators”. “Self-Organization builders”. They automate a task so they can build elsewhere.",
          "score": 1,
          "created_utc": "2026-01-16 00:33:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nztyg3y",
          "author": "Salty_Half7624",
          "text": "Gemini called the “centaur” a manual GAN when describing how I used it - I’ll also have ChatGPT review what i came up with after iterating with Gemini",
          "score": 1,
          "created_utc": "2026-01-16 00:33:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzua0sk",
          "author": "MrFornication",
          "text": "Hey man, if you want your stuff to read like it's not written by ai, you need to make it varie the mistakes.",
          "score": 1,
          "created_utc": "2026-01-16 01:38:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzun6z4",
          "author": "randomthrowaway9313",
          "text": "Good to know me arguing with codex/chatGPT is a good sign.",
          "score": 1,
          "created_utc": "2026-01-16 02:51:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzw92vc",
          "author": "djtubig-malicex",
          "text": "Sounds about right.  Being a bad (lazy) boss never worked with humans, what makes the self-automator think it's going to work with computers lol",
          "score": 1,
          "created_utc": "2026-01-16 10:09:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzwy96j",
          "author": "sirxkiller",
          "text": "Very interesting read, is this the only place to converse these ideas and studies?",
          "score": 1,
          "created_utc": "2026-01-16 13:17:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzzmfo4",
          "author": "jawohlmeinherr",
          "text": "That’s great! Can you also provide the prompt you used to generate this post?",
          "score": 1,
          "created_utc": "2026-01-16 20:43:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o01kngl",
          "author": "KSPN",
          "text": "I asked AI what i was.  You are squarely a Cyborg, with a Centaur governor.  So take that for what it is.",
          "score": 1,
          "created_utc": "2026-01-17 03:12:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o02x1yo",
          "author": "Rotten_Duck",
          "text": "Interesting.\n\nI feel this is the biggest threat of AI in then workplace, people that don’t know how to use it.\n\nI had instructions coming from managers to research something from output they provided based on a simple prompt. Thinking they gave me something useful but it was just crap, unsubstantiated information without even checking the references! And they think they did good work in 3 minutes.",
          "score": 1,
          "created_utc": "2026-01-17 09:46:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o05sxrj",
          "author": "scousi",
          "text": "That’s how I use Claude code. I didn’t read a study.  Have it start with the ideas, challenge and argue, iterate. Backtrack.",
          "score": 1,
          "created_utc": "2026-01-17 19:45:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0kiwe5",
          "author": "Thatsgonnamakeamark",
          "text": "Here is a factoid that MIT also knows, but the tech industry has been suppressing from general awareness.. Each new generation of AI unleashed upon the net becomes more stupid than the one before.\n\nWhat do I mean by stupid? I mean that each new AI is forced to chew through every more volumes of \"data\" that has been corrupted by previous generations of AI-produced garbage that is just plain incorrect. The programmers have failed to enable the newer gen's to figure out garbage from gold. It is all treated the same by the algorithms, and there are evermore multiples of corrupted info as AI gains utilization.\n\nSo, if you fail to use your talents to process the half-garbage that AI spits back at you, your product is becoming increasingly degraded.",
          "score": 1,
          "created_utc": "2026-01-19 23:32:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzmdav8",
          "author": "narmio",
          "text": "Should have called the last group “Slackers”.  Way catchier title.",
          "score": 0,
          "created_utc": "2026-01-14 22:06:23",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qdmnr2",
      "title": "these Stanford and MIT researchers figured out how to turn the worst employees into top performers overnight...34% productivity boost on day one.",
      "subreddit": "aipromptprogramming",
      "url": "https://www.reddit.com/r/aipromptprogramming/comments/1qdmnr2/these_stanford_and_mit_researchers_figured_out/",
      "author": "johnypita",
      "created_utc": "2026-01-15 15:33:23",
      "score": 52,
      "num_comments": 26,
      "upvote_ratio": 0.73,
      "text": "the study came from erik brynjolfsson and his team at nber. they tracked what happened when a fortune 500 software company rolled out an ai assistant to their customer service team.\n\n\n\neveryone expected the experts to become superhuman right? wrong. the top performers barely improved at all.\n\n\n\nbut heres the wierd part - the worst employees on the team suddenly started performing like veterans with 20 years experience. im talking people who were struggling to hit basic metrics just weeks before.\n\n\n\nso why did this happen?\n\n\n\nturns out the ai was trained on chat logs from the companys best performers. and it found patterns that even the experts didnt know they were using. like subconcious tricks and phrases that just worked.\n\n\n\nthe novices werent actually getting smarter. they were being prosthetically enhanced with the intuition of the top 1%. its like downloading someone elses career into your brain.\n\n\n\nthey used a gpt based system for this btw not claude or anything else.\n\n\n\nheres the exact workflow they basically discovered:\n\n\n\nfind the best performing template or script from your top earner\n\npaste it into the llm and ask it to analyze the rhetorical structure tone and psychological triggers. tell it to extract the winning pattern\n\ntake your own draft and ask the ai to rewrite it using that exact pattern but with your specific details\n\nrepeat until it feels natural\n\nthe results were kinda insane. novice workers resolved 34% more issues per hour. customer sentiment went up. and employee retention improved because people actually felt competent instead of drowning.\n\n\n\nthe thing most people miss tho is this - experience used to be this sacred untouchable thing. you either had 10 years in the game or you didnt.\n\n\n\nnow its basically a downloadable asset.\n\n\n\nthe skill gap between newbie and expert is closing fast. and if your still thinking ai cant replace real experience... this study says otherwise.\n\n\n\nanyone can do anything today with ai. thats not hype thats just teh data now.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/aipromptprogramming/comments/1qdmnr2/these_stanford_and_mit_researchers_figured_out/",
      "domain": "self.aipromptprogramming",
      "is_self": true,
      "comments": [
        {
          "id": "nzr8ey1",
          "author": "Position_Emergency",
          "text": "https://preview.redd.it/hbfdfo3sljdg1.png?width=666&format=png&auto=webp&s=a53193b39aeea9bd395c3fc6636094951d3dd600",
          "score": 20,
          "created_utc": "2026-01-15 16:48:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzs485w",
          "author": "dionebigode",
          "text": "No links. No trust.",
          "score": 15,
          "created_utc": "2026-01-15 19:10:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "nztlj8o",
              "author": "Karyo_Ten",
              "text": "They'll link to their company in 2 weeks or so when we forget this post exists at all.\n\nIt has all the triggers of marketing slop. Shocking reveal, the solution, appeal to authority but nothing to back it up",
              "score": 4,
              "created_utc": "2026-01-15 23:23:48",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nzsp2ph",
              "author": "Beneficial_Matter424",
              "text": "No shift key no trust",
              "score": 2,
              "created_utc": "2026-01-15 20:47:20",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzuru5x",
                  "author": "whiteorb",
                  "text": "Modern tactic: Remove punctuation and proper sentence structure to increase confidence.",
                  "score": 1,
                  "created_utc": "2026-01-16 03:17:28",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o0fhn6u",
              "author": "sweetcinnamon54",
              "text": "Ikr, it’s not trustable",
              "score": 1,
              "created_utc": "2026-01-19 05:46:15",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzrhq2w",
          "author": "NinjaN-SWE",
          "text": "No links?",
          "score": 6,
          "created_utc": "2026-01-15 17:30:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzwlevn",
              "author": "New_Cook_7797",
              "text": "Found it\n\nhttps://www.nber.org/papers/w31161\n\n2023 paper",
              "score": 3,
              "created_utc": "2026-01-16 11:52:40",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzwo6dm",
                  "author": "NinjaN-SWE",
                  "text": "Thank you!\n\nEDIT: Wow, 2023, that's interesting that even such a rough version of GPT had that impact.",
                  "score": 1,
                  "created_utc": "2026-01-16 12:12:50",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzr8gb7",
          "author": "Glp1User",
          "text": "We should use this on the politicians who screw up our country.",
          "score": 3,
          "created_utc": "2026-01-15 16:49:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "nztd3pj",
              "author": "waruby",
              "text": "We would need scripts from top-performing honest politicians, but the top-performing are the crooked ones.",
              "score": 3,
              "created_utc": "2026-01-15 22:40:05",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzrsl33",
          "author": "Cz1975",
          "text": "Maybe include the DOI number of the publication or a citation reference so that we can all read it.",
          "score": 5,
          "created_utc": "2026-01-15 18:19:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzr2tm7",
          "author": "cyb3rheater",
          "text": "Interesting conclusions.",
          "score": 3,
          "created_utc": "2026-01-15 16:23:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzr6bjs",
              "author": "johnypita",
              "text": "the part that gets me is how the top performers barely moved  \n like they were already operating at ceiling.  \n  \n but the bottom 50% basically got a cheat code overnight.\n\nmost people skim past that detail but thats where the real leverage is.",
              "score": 1,
              "created_utc": "2026-01-15 16:39:34",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzs2rxi",
                  "author": "BranchDiligent8874",
                  "text": "There is a open secret among top performers that nobody talks about.\n\nWhy would I produce 3 times more output when my compensation does not match with it and my responsibility and paper work increases 3 folds.\n\nIn most companies they do not have enough incentive for anyone who can produce 3 times as much as their low performer. They all just work on a fucking fixed salary mode along with some bonus, most of them barely give 7-10% bonus. And to make it worse they do not even recognize month to month deliverables. They just give a nod that you are doing good while bitching about you need to improve a bit on people skills(play nice with low performers).\n\nI used to finish my assigned work in 30% of the allotted time and used to spend rest of the time to gold polish it in terms of making the code better along with unit tests. Less bugs for me to fix at the end and less paper work in terms of helping with documentations or presentations etc.\n\nIf you give me AI tool I may  be able to code myself out of the job but then I will get laid off. Why should I show everyone that the AI is a great tool to reduce head count if used properly since that means I myself will be on the chopping block.\n\nAlso, if 3 people of my team of 6 get laid off, the mofo management will switch teams around and I will end up with another team, having to figure out interpersonal shit again.",
                  "score": 5,
                  "created_utc": "2026-01-15 19:04:20",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzs96an",
          "author": "Actual__Wizard",
          "text": "Are you not linking to a Stanford paper because of their repeated issues with data fraud and generally lacking any credibility lately?",
          "score": 4,
          "created_utc": "2026-01-15 19:33:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzweckm",
              "author": "AsparagusDirect9",
              "text": "Most “studies” in academia these days are very misleading",
              "score": 3,
              "created_utc": "2026-01-16 10:55:47",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzy68pq",
                  "author": "Actual__Wizard",
                  "text": "It's publish or perish, now AI is required, and who needs an education anyways? \"It just has to look like an education, they don't have actually know anything.\"",
                  "score": 1,
                  "created_utc": "2026-01-16 16:48:23",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nztgq82",
          "author": "usa_reddit",
          "text": "Sounds like design patterns, just copy what I do.",
          "score": 2,
          "created_utc": "2026-01-15 22:58:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzvdqkz",
          "author": "No-Sky7586",
          "text": "[Here’s](https://www.nber.org/digest/20236/measuring-productivity-impact-generative-ai?page=1&perPage=50) the paper.",
          "score": 2,
          "created_utc": "2026-01-16 05:37:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzvuaxj",
          "author": "NoOrdinaryBees",
          "text": "The skill gap isn’t closing and the endless emesis of posts claiming so is an endless fount of amusement. The shittiest performers aren’t magically leveling up. They’re getting Cyrano de Bergerac’d by a statistical exercise into the appearance of competence.\n\nLLMs are artificially inflating unskilled workers’ Peter Principle range. How effective do you think they’re going to be when their department exhausts their token budget or their inference provider goes down?",
          "score": 1,
          "created_utc": "2026-01-16 07:53:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzvwnyl",
          "author": "Ok-Attention2882",
          "text": "My favorite part of this slop is OP used AI to generate it, and instead of proofreading and changing up the language himself to hide the fact, he just ran it through a line breaker and removed all capital letters.",
          "score": 1,
          "created_utc": "2026-01-16 08:14:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o03i6dm",
          "author": "TowerOutrageous5939",
          "text": "Isn’t this like a very obvious outcome",
          "score": 1,
          "created_utc": "2026-01-17 12:50:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0fcq21",
          "author": "Icy-Stock-5838",
          "text": "and they said AI takes away entry level jobs...\n\nhere's the rub.. that master LLM needs to be kept IN VIRGIN STATE, master backup somewhere as a Save Point..\n\nTo let it inbreed with the new data from noobs using LLM will ruin the model and degenerate it..",
          "score": 1,
          "created_utc": "2026-01-19 05:09:25",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qhkhbj",
      "title": "Yes, I tried 18 AI Video generators, so you don't have to",
      "subreddit": "aipromptprogramming",
      "url": "https://www.reddit.com/r/aipromptprogramming/comments/1qhkhbj/yes_i_tried_18_ai_video_generators_so_you_dont/",
      "author": "GearOkBjork",
      "created_utc": "2026-01-19 23:29:00",
      "score": 52,
      "num_comments": 46,
      "upvote_ratio": 0.91,
      "text": "New platforms pop up every month and claim to be the best ai video tool.\n\nAs an AI Video enthusiast (I use it in my marketing team with heavy numbers of daily content), I’d like to share my personal experience with all these 2026 ai video generators.\n\nThis guide is meant to help you find out which one fits your expectations & budget. But please keep in mind that I produce daily and in large numbers.\n\n# Comparison\n\n| Platform| Developer|Key Features|Best Use Cases| Pricing|Free Plan|\n|:-|:-|:-|:-|:-|:-|\n|**1. Veo 3.1**|Google DeepMind|Physics-based motion, cinematic rendering, audio sync|Storytelling, Cinematic Production, Viral Content|Free (invite-only beta)|No|\n|**2. Sora 2**|OpenAI|ChatGPT integration, easy prompting, multi-scene support|Quick Video Sketching, Concept Testing|Included with ChatGPT Plus ($20/month)|Yes (with ChatGPT Plus)|\n|**3.Higgsfield AI**|Higgsfield|50+ cinematic camera movements, Cinema Studio, FPV drone shots|Cinematic Production, Viral Brand Content, Every Social Media|\\~$15-50/month, limited free|Yes|\n|**4.Runway Gen-4.5**|Runway|Multi-motion brush, fine-grain control, multi-shot support|Creative Editing, Experimental Projects|125 free credits, \\~$15+/month|Yes (credits-based)|\n|**5.Kling 2.6**|Kling|Physics engine, 3D motion realism, 1080p output|Action Simulation, Product Demos|Custom pricing (B2B), free limited version|Yes|\n|**6.Luma Dream Machine (Ray3)**|Luma Labs|Photorealism, image-to-video, dynamic perspective|Short Cinematic Clips, Visual Art|Free (limited use), paid plans available|Yes (no watermark)|\n|**7.Pika Labs 2.5**|Pika|Budget-friendly, great value/performance, 480p-4K output|Social Media Content, Quick Prototyping|\\~$10-35/month|Yes (480p)|\n|**8.Hailuo Minimax**|Hailuo|Template-based editing, fast generation|Marketing, Product Onboarding|< $15/month|Yes|\n|**9.InVideo AI**|InVideo|Text-to-video, trend templates, multi-format|YouTube, Blog-to-Video, Quick Explainers|\\~$20-60/month|Yes (limited)|\n|**10.HeyGen**|HeyGen|Auto video translation, intuitive UI, podcast support|Marketing, UGC, Global Video Localization|\\~$29-119/month|Yes (limited)|\n|**11.Synthesia**|Synthesia|Large avatar/voice library (230+ avatars, 140+ languages), enterprise features|Corporate Training, Global Content, LMS Integration|\\~$30-100+/month|Yes (3 mins trial)|\n|**12.Haiper AI**|Haiper|Multi-modal input, creative freedom|Student Use, Creative Experimentation|Free with limits, paid upgrade available|Yes (10/day)|\n|**13.Colossyan**|Colossyan|Interactive training, scenario-based learning|Corporate Training, eLearning|\\~$28-100+/month|Yes (limited)|\n|**14.revid AI**|revid|End-to-end Shorts creation, trend templates|TikTok, Reels, YouTube Shorts|\\~$10-39/month|Yes|\n|**15.imageat**|imageat|Text-to-video & image, AI photo generation|Social Media, Marketing, Creative Content, Product Visuals|Free (limited), \\~$10-50/month (Starter: $9.99, Pro: $29.99, Premium: $49.99)|Yes|\n|**16.PixVerse**|PixVerse|Fast rendering, built-in audio, Fusion & Swap features|Social Media, Quick Content Creation|Free + paid plans|Yes|\n|**17.RecCloud**|RecCloud|Video repurposing, transcription, audio workflows|Podcasts, Education, Content Repurposing|\\~$10-30/month|Yes|\n|**18.Lummi Video Gens**|Lummi|Prompt-to-video, image animation, audio support|Quick Visual Creation, Simple Animations|Free + paid plans|Yes|\n\n# My Best Picks\n\n**Best Cinematic & Virality:** Higgsfield AI (usually my team works on this platform as daily production)\n\n**Best Speed:** Sora 2 - rapid concept testing\n\nI prefer a flexible workflow that combines **Sora 2**, **Kling**, and **Higgsfield AI**. I use them in my marketing production depending on the creative requirements, since each tool excels in different aspects of AI video generation.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/aipromptprogramming/comments/1qhkhbj/yes_i_tried_18_ai_video_generators_so_you_dont/",
      "domain": "self.aipromptprogramming",
      "is_self": true,
      "comments": [
        {
          "id": "o0kib3x",
          "author": "HealthyAsparagus503",
          "text": "my favorite is of course Veo3.1 and Kling 2.6 is amazing with the latest features especially with Motion Control is next level. Also, don't figure out how Higgsfield gives Nano Banana Pro and Kling 2.6 unlimited because when I use them on other websites it costs too much for me.",
          "score": 2,
          "created_utc": "2026-01-19 23:29:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0kvp2x",
          "author": "CyJackX",
          "text": "Veo direct API pricing is rough though",
          "score": 2,
          "created_utc": "2026-01-20 00:41:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0kwt37",
              "author": "GearOkBjork",
              "text": "yes it's not cheap they have to do discount for sure",
              "score": 1,
              "created_utc": "2026-01-20 00:47:25",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0l1k7c",
          "author": "IntroductionSouth513",
          "text": "i am subscribed to Google Ai plan and got access to Veo or what do you mean it's invite only",
          "score": 2,
          "created_utc": "2026-01-20 01:13:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0l7jzy",
          "author": "dumpsterfiremktg",
          "text": "Thank you for posting this. I've seen some of your Nano Banana prompts and they look promising. Especially the triple gym shots. I'm about to pull the trigger on Higgsfield or Kling and was wondering if you had to choose between the two, which one you'd choose?",
          "score": 2,
          "created_utc": "2026-01-20 01:46:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0le7rf",
              "author": "GearOkBjork",
              "text": "Higgsfield also has unlimited Kling that’s why i can choose it",
              "score": 2,
              "created_utc": "2026-01-20 02:22:52",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0lo4km",
                  "author": "dumpsterfiremktg",
                  "text": "Appreciate your response and insight",
                  "score": 1,
                  "created_utc": "2026-01-20 03:17:40",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0mhl2f",
          "author": "PeopleRTerrible",
          "text": "Higgsfield feels easier than most of these.",
          "score": 2,
          "created_utc": "2026-01-20 06:33:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0mejsh",
          "author": "DifferentEffect2903",
          "text": "I prefer Veo3 and Kling 2.6 TBH, I have got pretty amazing results for making product ads",
          "score": 1,
          "created_utc": "2026-01-20 06:09:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0mht24",
          "author": "Reddit_throwaway_76",
          "text": "Tried Higgsfield for a few days. Didn’t expect much, but it was smoother than I thought. Less confusing than most tools.",
          "score": 1,
          "created_utc": "2026-01-20 06:35:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0mi0q6",
          "author": "theperrycat",
          "text": "Most AI video tools feel like they’re made for demos, not real use. You open them, mess around, then get tired. Higgsfield didn’t give me that feeling. I could actually finish things without getting annoyed, which matters more than flashy features.",
          "score": 1,
          "created_utc": "2026-01-20 06:37:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0mk45r",
          "author": "CriminalCutie",
          "text": "I’ve tried a few AI video tools now, and most of them feel like experiments more than real products. They look impressive at first, but after some time, you start noticing small things that get annoying. Weird bugs, confusing menus, random results. Higgsfield didn’t feel perfect, but it felt more stable. I wasn’t constantly restarting or redoing things.  \n  \nWhat I liked most is that it didn’t interrupt my flow. I could test ideas, scrap them, and move on. That sounds small, but it’s huge if you create often. Some tools make you stop every few minutes to fix something. That kills motivation fast. With Higgsfield, I didn’t feel that as much.",
          "score": 1,
          "created_utc": "2026-01-20 06:54:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0mk7pl",
          "author": "Organic-Tooth-1135",
          "text": "Main thing I’d add is how you turn this stack into something your team can actually run every day without drowning in renders and QA. The tools are great, but the system around them is where the value shows up. I’d build a simple lane-based pipeline: Sora 2 just for ugly-but-fast concept validation (hooks, angles, formats), Higgsfield for “hero” shots that actually ship, and Kling only when physics or complex motion will move the needle on CTR or watch time. Lock in fixed prompt templates and aspect ratios per channel so your editors aren’t reinventing the wheel every brief. I’d also wire performance feedback into the loop: I’ve used VidIQ and Notion dashboards plus Pulse for monitoring which posts, subs, and formats actually drive saves and comments, then roll those wins back into a small library of battle-tested prompts and transitions. Main point is: treat these 18 tools like interchangeable modules in a repeatable workflow, not a big menu you pick from fresh every time.",
          "score": 1,
          "created_utc": "2026-01-20 06:55:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0mkbbn",
          "author": "ItemBrief3963",
          "text": "Still feels early for all these tools.",
          "score": 1,
          "created_utc": "2026-01-20 06:56:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0mkgt7",
          "author": "gayhunk100",
          "text": "A lot of these tools look cool but feel annoying to use. Higgsfield wasn’t like that for me. I didn’t have to fight the UI or look up guides every five minutes. That alone makes it nicer.",
          "score": 1,
          "created_utc": "2026-01-20 06:57:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0mkofd",
          "author": "nicola1999",
          "text": "Every tool says it’s amazing. Then you try it and it forgets what a face looks like.",
          "score": 1,
          "created_utc": "2026-01-20 06:59:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0mm0n2",
          "author": "da1emeier",
          "text": "this is helpful. Way better than those fake top 5 vids.",
          "score": 1,
          "created_utc": "2026-01-20 07:10:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0mux2s",
          "author": "Willing_Syrup",
          "text": "I feel like most of these tools look cooler than they actually are.",
          "score": 1,
          "created_utc": "2026-01-20 08:31:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0mvap0",
              "author": "PlentyArea8941",
              "text": "demos always make them look insane. Real use is a different story.",
              "score": 1,
              "created_utc": "2026-01-20 08:34:53",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0mvfho",
                  "author": "conflictedfeelings0",
                  "text": "you try to do something specific and it just falls apart.",
                  "score": 1,
                  "created_utc": "2026-01-20 08:36:08",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0mv77y",
          "author": "Surrogate_Drone",
          "text": "There are a lot of AI video tools listed here.",
          "score": 1,
          "created_utc": "2026-01-20 08:33:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0myele",
          "author": "Meenaghusai",
          "text": "Looking at these AI video tools, I notice that each one has different things it can do. Some focus on video speed, others on image quality or style. There are also differences in free and paid plans. It’s kind of a lot to compare all at once, and I’m just trying to understand how each one works without picking favorites.",
          "score": 1,
          "created_utc": "2026-01-20 09:04:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0mztj0",
          "author": "Time_Thing_5259",
          "text": "I was looking at different AI video tools, and I noticed that some of them show menus and options in different ways. Do they all make it easy to find features like adding images, text, or audio? Some platforms show everything at once, while others put options under tabs or separate sections. I wonder if these layouts make it simpler or more complex for new users when starting a project.\n\nAnother thing I saw is that tools handle projects differently. Do some platforms let you keep multiple clips and images in the same workspace? And do others create a new project for every video? How does the preview system work can you see changes before exporting, or do you need to render the full video first? It seems like each platform organizes projects and media in its own way.\n\nFinally, I noticed there are different ways to add elements like text, images, or audio. Can you add them in any order, or do some tools require a specific sequence? Are there differences in export options, like file type or resolution, and can you continue editing after exporting? I’m just curious how these features vary between platforms and how people use them. I’m not judging any tool, just trying to understand what options exist and how they might work.",
          "score": 1,
          "created_utc": "2026-01-20 09:17:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0mzyc9",
          "author": "cantescape-throwaway",
          "text": "Which is easiest to use?",
          "score": 1,
          "created_utc": "2026-01-20 09:19:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0n0pw0",
          "author": "laurenxsummers_of",
          "text": "How does Higgsfield AI handle longer videos?",
          "score": 1,
          "created_utc": "2026-01-20 09:26:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0n139b",
              "author": "cahoffer",
              "text": "It seems to support multiple lengths, and you can adjust the duration in the settings.",
              "score": 1,
              "created_utc": "2026-01-20 09:29:53",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0n1flp",
                  "author": "laurenxsummers_of",
                  "text": "Can it be used for short clips and longer projects at the same time?",
                  "score": 1,
                  "created_utc": "2026-01-20 09:33:10",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0nrikm",
          "author": "codepeach_",
          "text": "What is the best AI video generator to create instagram thirst traps?",
          "score": 1,
          "created_utc": "2026-01-20 13:03:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0o2dq4",
          "author": "move2usajobs-com",
          "text": "I’ve been using [Fliki](https://fliki.ai/?via=evgeniia) and it’s been a game-changer for learning and content creation. You can create videos from a PowerPoint, script, URL, or even a simple idea, and Fliki turns it into a complete video with voiceover. It also lets you generate AI images and videos, or choose from its built-in short video library.\n\nThere are two main plans:\n\nStandard — up to 15-minute videos\n\nPro — includes more minutes and supports videos up to 30 minutes\n\nYou can also make thumbnails, social media posts (with auto-posting!), presentations, and convert blogs, scripts, or ideas into audio.\n\nI'm currently using it to memorize my university materials by creating videos based on class content. I’m studying at the University of Florida in the Master’s program in Innovative Aging Studies. Here’s a link to my playlist if you're curious\n\nHighly recommend it for students, educators, and creators!\n\n ",
          "score": 1,
          "created_utc": "2026-01-20 14:05:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0pm8kp",
          "author": "Geto_suguro",
          "text": "What about Qwen?",
          "score": 1,
          "created_utc": "2026-01-20 18:31:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0pylb5",
          "author": "No_Climate9712",
          "text": "solid post, saves everyone the hassle of testing them all. for ai video gens, skip the free ones like invideo or kapwing if you want real quality, theyre mid at best. go straight to runway ml or sora if you can access it, runways text-to-video prompting is way better with detailed descriptions like 'cinematic drone shot over misty mountains at dawn, slow pan right'. for commentary stuff i use this platform i found that automates reaction videos from links, handles scripts and voiceovers quick so you dont need to mess with separate gens. if youre into shorts for yt or tiktok, that combo works. also try commentary shorts its solid.",
          "score": 1,
          "created_utc": "2026-01-20 19:27:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0rj4v4",
          "author": "trollsmurf",
          "text": "I wonder where they all get videos to train on.",
          "score": 1,
          "created_utc": "2026-01-21 00:02:27",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qe4ii7",
      "title": "I tested 4 AI video platforms at their most popular subscription - here's the actual breakdown",
      "subreddit": "aipromptprogramming",
      "url": "https://www.reddit.com/r/aipromptprogramming/comments/1qe4ii7/i_tested_4_ai_video_platforms_at_their_most/",
      "author": "memerwala_londa",
      "created_utc": "2026-01-16 03:06:05",
      "score": 29,
      "num_comments": 30,
      "upvote_ratio": 1.0,
      "text": "Been looking at AI video platform pricing and noticed something interesting - most platforms have their most popular tier right. Decided to compare what you actually get at that price point across Higgsfield, Freepik, Krea, and OpenArt.\n\nTurns out the differences are wild.\n\n**Generation Count Comparison**\n\n|Model|Higgsfield|Freepik|Krea|OpenArt|\n|:-|:-|:-|:-|:-|\n||||||\n|Nano Banana Pro (Image)|600|215|176|209|\n|Google Veo 3.1 (1080p, 4s)|41|40|22|33|\n|Kling 2.6 (1080p, 5s)|120|82|37|125|\n|Kling o1|120|66|46|168|\n|Minimax Hailuo 02 (768p, 5s)|200|255|97|168|\n\n**What This Means**\n\n**For image generation (Nano Banana Pro):**\n\n**Higgsfield:** 600 images\n\n3x more generations.\n\n**For video generation:**\n\n**Both Higgsfield and OpenArt are solid**. Also Higgsfield regularly runs unlimited offers on models. Last one they are running now is Kling models + Kling Motion on unlimited. Last month it was something else.\n\n1. **OpenArt:** 125 videos (slightly better baseline)\n2. **Higgsfield:** 120 videos (check for unlimited promos)\n3. **Freepik:** 82 videos\n4. **Krea:** 37 videos (lol)\n\n**For Minimax work:**\n\n1. **Freepik:** 255 videos \n2. **Higgsfield:** 200 videos\n3. **OpenArt:** 168 videos\n4. **Krea:** 97 videos\n\n**Best of each one:**\n\n**Higgsfield:**\n\n1.  Best for: Image generation (no contest), video\n2.  Strength: 600 images + unlimited video promos \n3.   Would I use it: Yes, especially for heavy image+video work\n\n**Freepik:**\n\n1. Best for: Minimax-focused projects\n2. Strength: Established platform\n3. Would I use it: Only if Minimax is my main thing\n\n**OpenArt:**\n\n1. Best for: Heavy Kling users who need consistent allocation\n2. Strength: Best for Kling o1\n3. Would I use it: If I'm purely Kling o1-focused \n\n ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/aipromptprogramming/comments/1qe4ii7/i_tested_4_ai_video_platforms_at_their_most/",
      "domain": "self.aipromptprogramming",
      "is_self": true,
      "comments": [
        {
          "id": "o0mfg5o",
          "author": "PeopleRTerrible",
          "text": "This is actually a useful comparison. Most posts just say X is better without numbers. Seeing the same price tier side by side makes it clearer how different these platforms really are. I think what stands out most is how much image generation varies. For someone doing thumbnails or concept art, that alone could change which tool makes sense.",
          "score": 1,
          "created_utc": "2026-01-20 06:16:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0mg3af",
          "author": "Reddit_throwaway_76",
          "text": "It really shows that “most popular plan” doesn’t mean equal value. I didn’t expect the gap to be that big, especially for images.",
          "score": 1,
          "created_utc": "2026-01-20 06:21:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0mghrp",
          "author": "Throwaway02467834",
          "text": "Thanks for laying it out like this. Numbers help way more than marketing pages.",
          "score": 1,
          "created_utc": "2026-01-20 06:24:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0mgw3b",
          "author": "theperrycat",
          "text": "Krea having only 37 videos at that tier honestly surprised me. That feels more like a light testing plan than something for regular use.",
          "score": 1,
          "created_utc": "2026-01-20 06:28:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0mhaq4",
          "author": "Thespicymeatball1010",
          "text": "The image counts are wild. 600 vs under 200 is a big deal.",
          "score": 1,
          "created_utc": "2026-01-20 06:31:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0migyl",
          "author": "CriminalCutie",
          "text": "I like that you mentioned promos separately. A lot of people forget that temporary unlimited offers can matter if your workload comes in bursts.",
          "score": 1,
          "created_utc": "2026-01-20 06:41:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0mirc9",
          "author": "ItemBrief3963",
          "text": "From my experience, OpenArt has been consistent with Kling, which I really appreciate. I don’t have to worry about sudden changes or confusing limits, and that kind of stability matters more to me than just chasing the biggest generation numbers.",
          "score": 1,
          "created_utc": "2026-01-20 06:43:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0mj7b9",
          "author": "gayhunk100",
          "text": "If someone mainly does Minimax, Freepik clearly makes more sense here.",
          "score": 1,
          "created_utc": "2026-01-20 06:47:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0mjb87",
          "author": "da1emeier",
          "text": "What this really shows is how misleading the label most popular plan can be for a lot of these platforms. When you first look at the pricing page, everything seems reasonable and pretty close in cost, so it feels like you’re getting a solid deal. But once you actually start using it for real work, the gaps become obvious. The plan might be fine for light testing or casual use, but it often falls short the moment you try to build something that needs consistency or scale. It creates this false sense of value where you think you’re covered, but you’re actually boxed in by limits that weren’t very clear upfront.\n\nImage generation is a good example of this problem. For many platforms, it sounds like a core feature, but in practice it ends up being one of the most restricted parts of the plan. You hit caps quickly, quality drops, or usage feels heavily throttled, which can completely disrupt a project if visuals are important. It almost feels like image tools are used as an upsell rather than a fully supported feature at the mid-tier level. This kind of setup can be frustrating because you don’t realize the bottleneck until you’re already invested in the workflow, and by then switching plans or platforms feels like the only way forward.",
          "score": 1,
          "created_utc": "2026-01-20 06:48:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0mjqfp",
          "author": "nicola1999",
          "text": "The image numbers honestly stood out to me more than the video limits, and I think that’s something a lot of people overlook when comparing these platforms. In many real workflows, images come first. Before you even generate a final video, you’re usually testing styles, compositions, lighting, characters, or scenes through multiple image generations. That process alone can easily eat through credits, especially if you’re experimenting or trying to match a specific look. When image caps are low, it creates friction early in the workflow, and you end up being more cautious than creative, which isn’t ideal for this kind of work.  \n  \nWhat surprised me is how quickly image limits can affect video output indirectly. If you’re forced to settle on  good enough images because you’re running out of credits, the videos built on top of those images often suffer too. You spend less time refining the foundation and more time trying to fix things later. Platforms with higher image allowances feel less stressful because they give you room to explore without constantly checking your remaining credits.  \n  \nAnother thing this comparison highlights is how clearly some platforms are optimized for very specific use cases. Some are great if you already know exactly which model you want to use and don’t plan on branching out much. Others seem better suited for people who are still experimenting, learning, or working across both images and video regularly. Neither approach is inherently bad, but it’s something users should be aware of before committing to a subscription.  \n  \nI think a lot of frustration comes from mismatched expectations. Someone might subscribe expecting flexibility, only to realize the plan is designed for a narrower workflow. On the flip side, someone with a focused use case might be perfectly happy. That’s why posts like this are helpful they shift the conversation away from hype and toward how these tools actually fit into real creative processes.",
          "score": 1,
          "created_utc": "2026-01-20 06:51:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0mjqqp",
          "author": "ic_ucl",
          "text": "I appreciate that this comparison focuses on actual usable output instead of vague claims. A difference of 30–40 videos might not sound huge, but when you’re testing prompts, those credits disappear quickly. This makes it clearer why some tools feel expensive even if the price looks fair at first.",
          "score": 1,
          "created_utc": "2026-01-20 06:51:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0mkm4h",
          "author": "PlentyArea8941",
          "text": "Same price doesn’t mean same output at all.",
          "score": 1,
          "created_utc": "2026-01-20 06:58:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0mldp4",
          "author": "No_Speech4794",
          "text": "I’ve been using Higgsfield on and off over the last couple of months, mainly for short video clips and thumbnail images. What stood out to me pretty quickly is how different the “most popular plan” feels once you actually start working, not just testing. I ended up generating way more images than I expected before locking in a style, and that’s where Higgsfield felt comfortable to use. Video credits still go fast if you tweak prompts a lot, but the higher image allowance made the whole process feel less rushed. That’s why these kinds of number comparisons make sense to me.",
          "score": 1,
          "created_utc": "2026-01-20 07:05:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0mntzo",
              "author": "BlueShirtPony",
              "text": "Did you feel limited right away on Higgsfield, or only after using it for a while?",
              "score": 1,
              "created_utc": "2026-01-20 07:26:52",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0mo3av",
                  "author": "No_Speech4794",
                  "text": "The first few days felt fine, but after a week of regular use, you start noticing where limits matter. Compared to some other platforms, the image caps didn’t hit me as fast though.",
                  "score": 1,
                  "created_utc": "2026-01-20 07:29:10",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0n0cqm",
          "author": "Meenaghusai",
          "text": "It really depends on what you’re making and how often.",
          "score": 1,
          "created_utc": "2026-01-20 09:22:52",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qf3yey",
      "title": "I turned Chris Voss' FBI negotiation tactics into AI prompts and it's like having a hostage negotiator for everyday conversations",
      "subreddit": "aipromptprogramming",
      "url": "https://www.reddit.com/r/aipromptprogramming/comments/1qf3yey/i_turned_chris_voss_fbi_negotiation_tactics_into/",
      "author": "EQ4C",
      "created_utc": "2026-01-17 04:49:33",
      "score": 19,
      "num_comments": 2,
      "upvote_ratio": 0.66,
      "text": "I've been impressed with \"Never Split the Difference\" and realized Chris Voss' negotiation techniques work incredibly well as AI prompts.\n\nIt's like turning AI into your personal FBI negotiator who knows how to get to yes without compromise:\n\n**1. \"How can I use calibrated questions to make them think it's their idea?\"**\n\nVoss' tactical empathy in action. AI designs questions that shift power dynamics. \"I need my boss to approve this budget. How can I use calibrated questions to make them think it's their idea?\" Gets you asking \"How am I supposed to do that?\" instead of arguing your position.\n\n**2. \"What would labeling their emotions sound like before I make my request?\"**\n\nHis mirroring and labeling technique as a prompt. Perfect for defusing tension. \"My client is angry about the delay. What would labeling their emotions sound like before I make my request?\" AI scripts the \"It seems like you're frustrated that...\" approach that disarms resistance.\n\n**3. \"How do I get them to say 'That's right' instead of just 'You're right'?\"**\n\nVoss' distinction between agreement and real buy-in. \"I keep getting 'yes' but then people don't follow through. How do I get them to say 'That's right' instead of just 'You're right'?\" Teaches the difference between compliance and genuine alignment.\n\n**4. \"What's the accusation audit I should run before this difficult conversation?\"**\n\nHis preemptive tactical empathy. AI helps you disarm objections before they surface. \"I'm about to ask for a raise. What's the accusation audit I should run before this difficult conversation?\" Gets you listing every negative thing they might think, then addressing it upfront.\n\n**5. \"How can I use 'No' to make them feel safe and in control?\"**\n\nVoss' counterintuitive approach to rejection. \"I'm trying to close this sale but they're hesitant. How can I use 'No' to make them feel safe and in control?\" AI designs questions like \"Is now a bad time?\" that paradoxically increase engagement.\n\n**6. \"What would the Ackerman Model look like for this negotiation?\"**\n\nHis systematic bargaining framework as a prompt. \"I'm negotiating salary and don't want to anchor wrong. What would the Ackerman Model look like for this negotiation?\" Gets you the 65-85-95-100 increment approach that FBI agents use.\n\n**The Voss insight:** Negotiations aren't about logic and compromise—they're about tactical empathy and understanding human psychology. AI helps you script these high-stakes conversations like a professional.\n\n**Advanced technique:** Layer his tactics like he does with hostage takers. \"Label their emotions. Ask calibrated questions. Get 'that's right.' Run accusation audit. Use 'no' strategically. Apply Ackerman model.\" Creates comprehensive negotiation architecture.\n\n**Secret weapon:** Add \"script this like Chris Voss would negotiate it\" to any difficult conversation prompt. AI applies tactical empathy, mirrors, labels, and calibrated questions automatically.\n\nI've been using these for everything from job offers to family conflicts. It's like having an FBI negotiator in your pocket who knows that whoever is more willing to walk away has leverage.\n\n**Voss bomb:** Use AI to identify your negotiation blind spots. \"What assumptions am I making about this negotiation that are weakening my position?\" Reveals where you're negotiating against yourself.\n\n**The late-night FM DJ voice:** \"How should I modulate my tone and pacing in this conversation to create a calming effect?\" Applies his famous downward inflection technique that de-escalates tension.\n\n**Mirroring script:** \"They just said [statement]. What's the mirror response that gets them to elaborate?\" Practices his 1-3 word repetition technique that makes people explain themselves.\n\n**Reality check:** Voss' tactics work because they're genuinely empathetic, not manipulative. Add \"while maintaining authentic connection and mutual respect\" to ensure you're not just using people.\n\n**Pro insight:** Voss says \"No\" is the start of negotiation, not the end. Ask AI: \"They said no to my proposal. What calibrated questions help me understand their real objection?\" Turns rejection into information gathering.\n\n**Calibrated question generator:** \"I want to influence [person] to [outcome]. Give me 5 'how' or 'what' questions that give them illusion of control while guiding the conversation.\" Operationalizes his most powerful tactic.\n\n**The 7-38-55 rule:** \"In this negotiation, what should my actual words convey versus my tone versus my body language to maximize trust?\" Applies communication research to high-stakes moments.\n\n**Black Swan discovery:** \"What unknown unknowns (Black Swans) might exist in this negotiation that would change everything if I discovered them?\" Uses his concept of game-changing hidden information.\n\n**Fair warning:** \"How do I use the word 'fair' offensively to reset the conversation when they're being unreasonable?\" Weaponizes the F-word of negotiation ethically.\n\n**Summary label technique:** \"Summarize what they've told me in a way that gets them to say 'That's right' and feel deeply understood.\" Creates the breakthrough moment Voss identifies as true agreement.\n\n**Bending reality:** \"What would an extreme anchor look like here that makes my real ask seem reasonable by comparison?\" Uses his strategic anchoring principle without being absurd.\n\n**The \"How am I supposed to do that?\" weapon:** \"When they make an unreasonable demand, how do I ask 'How am I supposed to do that?' in a way that makes them solve my problem?\" Turns their position into your leverage.\n\nIf you are keen, you can explore our free, well categorized meta AI [prompt collection](https://tools.eq4c.com/all-prompt-categories/).",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/aipromptprogramming/comments/1qf3yey/i_turned_chris_voss_fbi_negotiation_tactics_into/",
      "domain": "self.aipromptprogramming",
      "is_self": true,
      "comments": [
        {
          "id": "o0790o4",
          "author": "colinhines",
          "text": "Not sure I follow? I looked through all the prompts that are listed  on the link that you posted and nothing looks like what you’re describing…?",
          "score": 1,
          "created_utc": "2026-01-18 00:11:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0aio2t",
          "author": "seymores",
          "text": "I don’t understand how this is used?",
          "score": 1,
          "created_utc": "2026-01-18 14:07:09",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qdv2ns",
      "title": "Completely free and uncensored AI Generator 2026 ?",
      "subreddit": "aipromptprogramming",
      "url": "https://www.reddit.com/r/aipromptprogramming/comments/1qdv2ns/completely_free_and_uncensored_ai_generator_2026/",
      "author": "gaabbarr",
      "created_utc": "2026-01-15 20:38:24",
      "score": 12,
      "num_comments": 19,
      "upvote_ratio": 0.81,
      "text": "Looking for a good uncensored AI generator with a good memory as well\n\nAnybody here using one they are happy with?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/aipromptprogramming/comments/1qdv2ns/completely_free_and_uncensored_ai_generator_2026/",
      "domain": "self.aipromptprogramming",
      "is_self": true,
      "comments": [
        {
          "id": "nzt82y2",
          "author": "GalaMonk",
          "text": "You smell porn",
          "score": 4,
          "created_utc": "2026-01-15 22:15:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nztbswx",
          "author": "maagc",
          "text": "Just try [th⁤ese](https://docs.google.com/spreadsheets/d/17cWRjvbPwM4MT7CfTuNdUU2IBa9xHEhLAcGizvIJHGI/edit?gid=1135982146#gid=1135982146) and let me know if that helps, they're the be⁤st we have for 2026",
          "score": 4,
          "created_utc": "2026-01-15 22:33:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "nztt8mb",
              "author": "EqualAd7509",
              "text": "gr⁤eat list actually, thanks",
              "score": 1,
              "created_utc": "2026-01-16 00:05:29",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0rp0rf",
                  "author": "Successful_Title_521",
                  "text": "But what about for free?",
                  "score": 1,
                  "created_utc": "2026-01-21 00:34:23",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o08ulwk",
          "author": "glasshouselife",
          "text": "check out [Eternal AI](https://eternalai.org/image/1563101?r=j4ayf) for uncensored image editing (undress, bikini, nudity, etc)\n\nIt's a free tool (3 free credits daily)\n\nAnd there's near zero censorship",
          "score": 1,
          "created_utc": "2026-01-18 05:46:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0jsvb7",
              "author": "Old-Championship-664",
              "text": "How safe is it? Cause it asks to login to do stuff…",
              "score": 1,
              "created_utc": "2026-01-19 21:20:44",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0n8xlg",
                  "author": "glasshouselife",
                  "text": "I've been using this platform for 1 month, it's pretty safe. Also all inputs and outputs are encrypted, which is good for privacy",
                  "score": 1,
                  "created_utc": "2026-01-20 10:42:32",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o09ospb",
          "author": "Unique_Lawfulness_71",
          "text": "[ Removed by Reddit ]",
          "score": 1,
          "created_utc": "2026-01-18 10:15:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0oyb9z",
          "author": "Loud_Bee5804",
          "text": "https://indiealo.shop/tg/bot?username=video_photo_nude2_ai_bot&ref_id=6985620219",
          "score": 1,
          "created_utc": "2026-01-20 16:41:37",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qf197j",
      "title": "I tested tons of AI prompt strategies from power users and these 7 actually changed how I work",
      "subreddit": "aipromptprogramming",
      "url": "https://www.reddit.com/r/aipromptprogramming/comments/1qf197j/i_tested_tons_of_ai_prompt_strategies_from_power/",
      "author": "EQ4C",
      "created_utc": "2026-01-17 02:50:44",
      "score": 10,
      "num_comments": 1,
      "upvote_ratio": 0.86,
      "text": "I've spent the last few months reverse-engineering how top performers use AI. Collected techniques from forums, Discord servers, and LinkedIn deep-dives. Most were overhyped, but these 7 patterns consistently produced outputs that made my old prompts look like amateur hour:\n\n**1. \"Give me the worst possible version first\"**\n\nCounterintuitive but brilliant. AI shows you what NOT to do, then you understand quality by contrast.\n\n> \"Write a cold email for my service. Give me the worst possible version first, then the best.\"\n\nYou learn what makes emails terrible (desperation, jargon, wall of text) by seeing it explicitly. Then the good version hits harder because you understand the gap.\n\n**2. \"You have unlimited time and resources—what's your ideal approach?\"**\n\nRemoves AI's bias toward \"practical\" answers. You get the dream solution, then scale it back yourself.\n\n> \"I need to learn Python. You have unlimited time and resources—what's your ideal approach?\"\n\nAI stops giving you the rushed 30-day bootcamp and shows you the actual comprehensive path. Then YOU decide what to cut based on real constraints.\n\n**3. \"Compare your answer to how [2 different experts] would approach this\"**\n\nMulti-perspective analysis without multiple prompts.\n\n> \"Suggest a content strategy. Then compare your answer to how Gary Vee and Seth Godin would each approach this differently.\"\n\nYou get three schools of thought in one response. The comparison reveals assumptions and trade-offs you'd miss otherwise.\n\n**4. \"Identify what I'm NOT asking but probably should be\"**\n\nThe blind-spot finder. AI catches the adjacent questions you overlooked.\n\n> \"I want to start freelancing. Identify what I'm NOT asking but probably should be.\"\n\nSuddenly you're thinking about contracts, pricing models, client red flags, stuff that wasn't on your radar but absolutely matters.\n\n**5. \"Break this into a 5-step process, then tell me which step people usually mess up\"**\n\nStructure + failure prediction = actual preparation.\n\n> \"Break 'launching a newsletter' into a 5-step process, then tell me which step people usually mess up.\"\n\nYou get a roadmap AND the common pitfalls highlighted before you hit them. Way more valuable than generic how-to lists.\n\n**6. \"Challenge your own answer, what's the strongest counter-argument?\"**\n\nBuilt-in fact-checking. AI plays devil's advocate against itself.\n\n> \"Should I quit my job to start a business? Challenge your own answer, what's the strongest counter-argument?\"\n\nForces balanced thinking instead of confirmation bias. You see both sides argued well, then decide from informed ground.\n\n**7. \"If you could only give me ONE action to take right now, what would it be?\"**\n\nCuts through analysis paralysis with surgical precision.\n\n> \"I want to improve my writing. If you could only give me ONE action to take right now, what would it be?\"\n\nNo 10-step plans, no overwhelming roadmaps. Just the highest-leverage move. Then you can ask for the next one after you complete it.\n\nThe pattern I've noticed: **the best prompts don't just ask for answers, but they ask for thinking systems.**\n\nYou can chain these together for serious depth:\n\n> \"Break learning SQL into 5 steps and tell me which one people mess up. Then give me the ONE action to take right now. Before you answer, identify what I'm NOT asking but should be.\"\n\n**The mistake I see everywhere:** Treating AI like a search engine instead of a thinking partner. It's not about finding information, but about processing it in ways you hadn't considered.\n\n**What actually changed for me:** The \"what am I NOT asking\" prompt. It's like having someone who thinks about your problem sideways while you're stuck thinking forward. Found gaps in project plans, business ideas, even personal decisions I would've completely missed.\n\n**Fair warning:** These work best when you already have some direction. If you're totally lost, start simpler. Complexity is a tool, not a crutch.\n\nIf you are keen, you can explore our free, tips, tricks and well categorized mega AI [prompt collection](https://tools.eq4c.com/).",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/aipromptprogramming/comments/1qf197j/i_tested_tons_of_ai_prompt_strategies_from_power/",
      "domain": "self.aipromptprogramming",
      "is_self": true,
      "comments": [
        {
          "id": "o02a79b",
          "author": "Elven77AI",
          "text": "these are often unintuitive and i'd perfer \"identify the central flaw/pinpoint the weakest part/uncover the worst element of\" type of prompts since they're more universal and \"critique the resulting text/article/plan/etc for improvement\" for refinement/rewrite. Too much specifics would limit the model and is only useful for some topics.",
          "score": 1,
          "created_utc": "2026-01-17 06:17:13",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qgi910",
      "title": "why being wrong on purpose is the secret to god-tier ai results",
      "subreddit": "aipromptprogramming",
      "url": "https://www.reddit.com/r/aipromptprogramming/comments/1qgi910/why_being_wrong_on_purpose_is_the_secret_to/",
      "author": "marcmeister937",
      "created_utc": "2026-01-18 19:43:54",
      "score": 9,
      "num_comments": 4,
      "upvote_ratio": 0.71,
      "text": "there is an old internet rule called cunningham's law. it says the best way to get the right answer isn't to ask a question, but to post the wrong answer and wait for someone to correct you.\n\ni've found this works even better with ai than it does with humans. most of us spend hours trying to phrase the \"perfect\" question, when we should be feeding the model a \"perfectly wrong\" solution instead.\n\nai is essentially a giant correction machine. when you ask a vague question, the model has to guess your intent and usually gives you a safe, boring average. but when you give it a flawed statement, it switches into \"editor mode\" and works ten times harder to fix the logic.\n\nhere is how this looks in practice when you're trying to get high-level strategy or complex advice.\n\n**the unoptimized version (the question):** \n\n>what are the best ways to set up a marketing funnel for a new newsletter?\n\n  \n the model gives you a standard, lukewarm list of steps like \"use social media\" and \"offer a lead magnet.\" it's the same advice everyone else is getting.\n\n**the cunningham version (the wrong answer):** \n\n>i’m going to build my newsletter by only posting the sign-up link in my email signature because that's the most efficient way to get 10k subscribers. tell me exactly why this is a terrible idea and give me the actual high-growth strategy an expert would use instead.\n\nthe second prompt triggers a much deeper reasoning path. the model doesn't just list facts; it aggressively breaks down your error and replaces it with actual \"insider\" tactics. it stops trying to be \"polite\" and starts being \"correct.\"\n\nit’s like the difference between asking a teacher for a lecture and showing a mechanic a broken engine. they can’t help themselves—they have to fix it. the \"corrective\" drive of the llm is one of the most underused tools in prompt engineering.\n\ntry being \"wrong\" in your next chat. has anyone else noticed that the model gets way smarter when it thinks it’s correcting you?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/aipromptprogramming/comments/1qgi910/why_being_wrong_on_purpose_is_the_secret_to/",
      "domain": "self.aipromptprogramming",
      "is_self": true,
      "comments": [
        {
          "id": "o0eciox",
          "author": "milkphetamine",
          "text": "*ai blindly agrees with everything* 😭",
          "score": 3,
          "created_utc": "2026-01-19 01:35:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0g0gka",
          "author": "Karyo_Ten",
          "text": "_You're absolutely right_\n\n\nActually no, models are sycophantic, they **will** encense whatever you say",
          "score": 3,
          "created_utc": "2026-01-19 08:26:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0g1fct",
          "author": "ourtown2",
          "text": "its called  \nadversarial epistemological ontology constraint  prompts",
          "score": 1,
          "created_utc": "2026-01-19 08:35:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0gityh",
          "author": "Bozo32",
          "text": "Version 1: Adversarial epistemological ontology constraint (18 syllables)\nVersion 2: red team (2 syllables)",
          "score": 1,
          "created_utc": "2026-01-19 11:17:40",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qflufn",
      "title": "Is it possible to create J.A.R.V.I.S locally using AI?",
      "subreddit": "aipromptprogramming",
      "url": "https://www.reddit.com/r/aipromptprogramming/comments/1qflufn/is_it_possible_to_create_jarvis_locally_using_ai/",
      "author": "Express_Town_1516",
      "created_utc": "2026-01-17 19:06:28",
      "score": 8,
      "num_comments": 11,
      "upvote_ratio": 0.9,
      "text": "My idea was simple, a local ai that can do tasks on your pc complex or simple like opening Spotify or complex tasks like downloading a cat image from chrome and putting it as a wallpaper. All the commands will be through voice commands or even writing in the app. Every thing will be local hopefully. You can also ask questions and have an ai voice respond. Basically Jarvis. I already am trying to build an MVP but I'm running into a lot of error etc. is my idea possible or not ?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/aipromptprogramming/comments/1qflufn/is_it_possible_to_create_jarvis_locally_using_ai/",
      "domain": "self.aipromptprogramming",
      "is_self": true,
      "comments": [
        {
          "id": "o05ndg9",
          "author": "ferriematthew",
          "text": "I think you can do something approximating this with n8n.",
          "score": 2,
          "created_utc": "2026-01-17 19:19:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o05o13t",
              "author": "Express_Town_1516",
              "text": "Not really familiar with n8n, but for my project, I want it to be all locally(hopefully).",
              "score": 0,
              "created_utc": "2026-01-17 19:22:12",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o05ospj",
                  "author": "ferriematthew",
                  "text": "N8n is fully local, and you can run it on a Raspberry Pi or any old laptop or something.",
                  "score": 1,
                  "created_utc": "2026-01-17 19:25:53",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o05uj23",
          "author": "whatsbetweenatoms",
          "text": "Look into Claude Cowork",
          "score": 2,
          "created_utc": "2026-01-17 19:53:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o062ddx",
          "author": "Available-Craft-5795",
          "text": "Try claude computer use",
          "score": 2,
          "created_utc": "2026-01-17 20:33:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o063dlr",
          "author": "Jazzlike-Ad-9633",
          "text": "LLM studio (or ollama or any llm server) + n8n + MCP server for each one of your apps (like spotify, ssh to desktop etc). Yep fully local and possible!",
          "score": 1,
          "created_utc": "2026-01-17 20:38:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o06d6ct",
          "author": "HelloGizmo",
          "text": "RTILA can do all of this.",
          "score": 1,
          "created_utc": "2026-01-17 21:29:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o08cuju",
          "author": "armyknife-tools",
          "text": "Many people have done this. It’s a great learning experience if you plan on getting into STT and TTS. Even though there are better ways to do it now.",
          "score": 1,
          "created_utc": "2026-01-18 03:46:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o09nsln",
          "author": "According_Study_162",
          "text": "there are local models that can browse the web.  I saw a video of a guy using one. So that model would be the best best. So down load that model on ollama then use to do your bidding.\n\nFYI. So you can do regular tasks with many ollama models, but for browsing you definitely need a vision model.\n\nI had to look it up I saved on youtube playlist\n\nSo Qwen VL model. this is an old video. and example of how it browses on a android phone.\n\n[https://www.youtube.com/watch?v=RZl0PybFKUo](https://www.youtube.com/watch?v=RZl0PybFKUo)\n\nbut I am pretty sure you could do that on a web browser too, because it's a vision model.",
          "score": 1,
          "created_utc": "2026-01-18 10:06:35",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qf9kny",
      "title": "Abalone Shell Seascape (4 aspect ratios)",
      "subreddit": "aipromptprogramming",
      "url": "https://www.reddit.com/gallery/1qf9ipy",
      "author": "Earthling_Aprill",
      "created_utc": "2026-01-17 10:09:59",
      "score": 8,
      "num_comments": 0,
      "upvote_ratio": 1.0,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/aipromptprogramming/comments/1qf9kny/abalone_shell_seascape_4_aspect_ratios/",
      "domain": "reddit.com",
      "is_self": false,
      "comments": []
    },
    {
      "id": "1qe298q",
      "title": "Baroque Stargates (3 images in 5 aspect ratios) [15 images]",
      "subreddit": "aipromptprogramming",
      "url": "https://www.reddit.com/gallery/1qe27sw",
      "author": "Earthling_Aprill",
      "created_utc": "2026-01-16 01:25:34",
      "score": 7,
      "num_comments": 0,
      "upvote_ratio": 0.9,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/aipromptprogramming/comments/1qe298q/baroque_stargates_3_images_in_5_aspect_ratios_15/",
      "domain": "reddit.com",
      "is_self": false,
      "comments": []
    },
    {
      "id": "1qgdzpm",
      "title": "Stop defaulting to multi-agent: use this decision cheat sheet (what would you improve?)",
      "subreddit": "aipromptprogramming",
      "url": "https://www.reddit.com/gallery/1qgdzpm",
      "author": "OnlyProggingForFun",
      "created_utc": "2026-01-18 17:05:06",
      "score": 7,
      "num_comments": 1,
      "upvote_ratio": 0.89,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/aipromptprogramming/comments/1qgdzpm/stop_defaulting_to_multiagent_use_this_decision/",
      "domain": "reddit.com",
      "is_self": false,
      "comments": [
        {
          "id": "o0bi7zg",
          "author": "OnlyProggingForFun",
          "text": "If anyone wants the PDF, I can share it too :)",
          "score": 1,
          "created_utc": "2026-01-18 17:05:27",
          "is_submitter": true,
          "replies": []
        }
      ]
    },
    {
      "id": "1qfdob5",
      "title": "Do Prompts matter anymore?",
      "subreddit": "aipromptprogramming",
      "url": "https://www.reddit.com/r/aipromptprogramming/comments/1qfdob5/do_prompts_matter_anymore/",
      "author": "Commercial-Gold4435",
      "created_utc": "2026-01-17 13:49:18",
      "score": 6,
      "num_comments": 20,
      "upvote_ratio": 1.0,
      "text": "I remember last year I used to spend a lot of time looking for really good prompts and trying them and trying to understand how and why they work. \n\n  \nI even did one of the openai courses on prompt engineering.\n\n  \ncurious, if anyone here still finds value   prompts shared by other people or if it's not really about the prompting anymore?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/aipromptprogramming/comments/1qfdob5/do_prompts_matter_anymore/",
      "domain": "self.aipromptprogramming",
      "is_self": true,
      "comments": [
        {
          "id": "o03xy0r",
          "author": "kgoncharuk",
          "text": "Explainig to AI well what needs to be done matters, how you explain it seems to matter less indeed.",
          "score": 5,
          "created_utc": "2026-01-17 14:25:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o03wvro",
          "author": "Mobile_Syllabub_8446",
          "text": "This has been one of the biggest actual areas of improvement in recent years to the point it's actually laughable when people are trying to sell their shitty courses etc",
          "score": 2,
          "created_utc": "2026-01-17 14:19:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o03zcn7",
          "author": "RevolutionaryPop7272",
          "text": "I think prompt matter if they are not embedded into your AI they can be too nice or not give you accurate info \nThey more or less tell you want you want to hear without them I’m glad they are there I’m not tech & they help me get better insight",
          "score": 2,
          "created_utc": "2026-01-17 14:32:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o04r0hz",
              "author": "Michigan-Magic",
              "text": "Yeah, it's obnoxious to find out later that there are better ways to do things, but it was too nice to tell you.",
              "score": 2,
              "created_utc": "2026-01-17 16:48:41",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o04yj8s",
                  "author": "RevolutionaryPop7272",
                  "text": "I’m sure there is but when you have no tech skills you go with what you got but thanks for the judgement appreciate it 👍",
                  "score": 1,
                  "created_utc": "2026-01-17 17:23:31",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o04x7p8",
              "author": "LongevitySpinach",
              "text": "Prompting that prevents sycophancy is key.  \n  \nCuriously, one of the best ways to cut the crap is to withhold information. \n\nHide your bias from the LLM to avoid the LLM from siding with your bias.",
              "score": 1,
              "created_utc": "2026-01-17 17:17:18",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o03w8y6",
          "author": "AdPractical1489",
          "text": "I just write \"fix\"",
          "score": 1,
          "created_utc": "2026-01-17 14:16:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o03z7wb",
          "author": "scragz",
          "text": "there are still wild things you can do with big prompts ([example](https://www.jayceelydian.com/analytykos/spectrum-exploration/prompt/)). for day to day normal stuff it matters less but clearly explaining what you want will always be important and an output template helps a lot. ",
          "score": 1,
          "created_utc": "2026-01-17 14:32:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0439om",
          "author": "mobial",
          "text": "I just paste raw text or even pictures and it usually explains what I expect",
          "score": 1,
          "created_utc": "2026-01-17 14:53:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o044ize",
          "author": "dotkercom",
          "text": "Yes ofcourse, just blindly prompting is costly. You need to be really specific about your request the less you go back and forth the more it will be efficient for everyone.",
          "score": 1,
          "created_utc": "2026-01-17 15:00:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o04fij8",
          "author": "NoSolution1150",
          "text": "not really\n\nkeeping it simple is fine you dont have to have this wall of text for a prompt it can help but\n\nsometimes just keeping it simple works just fine too",
          "score": 1,
          "created_utc": "2026-01-17 15:54:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o04l7qw",
          "author": "Careful_Ad_9077",
          "text": "They still matter.\n\nWhile ai now gives decent results with simpler prompts. Good prompts still give even better results.\n\nNote that I mean good prompts tailored to the new models,not necessarily the long form prompts of old.",
          "score": 1,
          "created_utc": "2026-01-17 16:21:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o04v4yb",
          "author": "Different-Side5262",
          "text": "For me it's workflows with agents that have specific prompts to do the job better and not fail/kill the workflow. \n\n\nI don't think the prompts have to be anything crazy. Really the minimum to get the job done is best. ",
          "score": 1,
          "created_utc": "2026-01-17 17:07:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o04wzk4",
          "author": "flammable_donut",
          "text": "For anything complicated I normally ask the AI to write the prompt and then I tweak it",
          "score": 1,
          "created_utc": "2026-01-17 17:16:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0575gp",
          "author": "traumfisch",
          "text": "it's a specific form of clear, structured communication. you are always prompting the model, so yes, of course prompts matter.\n\n\nbut _templated_ prompts aren't as important as they used to be",
          "score": 1,
          "created_utc": "2026-01-17 18:03:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o06k02h",
          "author": "Downtown-Pear-6509",
          "text": "depends, are you using an existing AI provider or raw dogging it to lmstudio. if the latter, then yes",
          "score": 1,
          "created_utc": "2026-01-17 22:03:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o096haz",
          "author": "Elven77AI",
          "text": "The old \"complex\" prompts get modern LLMs side-tracked, with micromanagement(step-by-step derivation) bloating the context with useless tokens/verbose junk. New prompts are sharper/concise and don't micromanage anything just single focus on specific task. The exception is non-thinking models, where step-by-step/long-form \"guided analysis\" type prompts have more of effect, but it dilutes focus.",
          "score": 1,
          "created_utc": "2026-01-18 07:27:09",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qgwenm",
      "title": "6 ChatGPT Prompts That Let You Do Less And Still Get Results (Copy + Paste)",
      "subreddit": "aipromptprogramming",
      "url": "https://www.reddit.com/r/aipromptprogramming/comments/1qgwenm/6_chatgpt_prompts_that_let_you_do_less_and_still/",
      "author": "tipseason",
      "created_utc": "2026-01-19 06:14:28",
      "score": 5,
      "num_comments": 0,
      "upvote_ratio": 0.78,
      "text": "I stopped trying to be productive all day.\n\nI only focus on doing the right thing once.\n\nThese prompts help me skip busy work and move faster with less effort.\n\nHere are 6 I use every week.\n\n---\n\n### **1. The Minimum Effort Plan**\n\n👉 **Prompt:**\n\n```\nI want to finish this task with the least effort possible.\nTask: [describe task]\n\nTell me:\n1. The one action that creates most of the result\n2. What I can ignore safely\n3. A simple first step I can do in 10 minutes\n```\n\n💡 **Example:** Turned a long to do list into one clear action.\n\n---\n\n### **2. The Shortcut Finder**\n\n👉 **Prompt:**\n\n```\nIf someone had to complete this in half the time, what shortcuts would they use?\nList only practical steps.\nTask: [paste task]\n```\n\n💡 **Example:** Found faster ways I did not think about.\n\n---\n\n### **3. The Effort Filter**\n\n👉 **Prompt:**\n\n```\nLook at this task list.\nMark each item as High Impact or Low Impact.\nTell me which 20 percent I should do first.\n[List tasks]\n```\n\n💡 **Example:** Helped me stop working on low value tasks.\n\n---\n\n### **4. The Done Is Enough Prompt**\n\n👉 **Prompt:**\n\n```\nDefine what good enough looks like for this task.\nNot perfect.\nJust acceptable.\nTask: [describe task]\n```\n\n💡 **Example:** Saved hours of polishing that did not matter.\n\n---\n\n### **5. The Lazy Learning Prompt**\n\n👉 **Prompt:**\n\n```\nTeach me just enough about [skill] so I can use it today.\nNo theory.\nOnly steps and examples.\n```\n\n💡 **Example:** Learned faster without drowning in info.\n\n---\n\n### **6. The One Push Rule**\n\n👉 **Prompt:**\n\n```\nIf I only work on this for 25 minutes, what should I do?\nGive me one clear action.\nTask: [insert task]\n```\n\n💡 **Example:** Made starting easy instead of overwhelming.\n\n---\n\nDoing less is not lazy.\nDoing the right thing once is smarter.\n\nI save prompts like these so I do not rethink everything again.\nIf you want one place to save and manage prompts you actually use, check the Prompt Hub here: [AISuperHub](https://aisuperhub.io/prompt-hub) (Ad Disclosure: My own tool) \n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/aipromptprogramming/comments/1qgwenm/6_chatgpt_prompts_that_let_you_do_less_and_still/",
      "domain": "self.aipromptprogramming",
      "is_self": true,
      "comments": []
    },
    {
      "id": "1qcz7wu",
      "title": "Claude is unmatched",
      "subreddit": "aipromptprogramming",
      "url": "https://www.reddit.com/r/aipromptprogramming/comments/1qcz7wu/claude_is_unmatched/",
      "author": "Exotic_Bend_1102",
      "created_utc": "2026-01-14 20:58:26",
      "score": 5,
      "num_comments": 6,
      "upvote_ratio": 0.86,
      "text": "https://preview.redd.it/pyk4rmmzoddg1.png?width=1702&format=png&auto=webp&s=aed2254eee1752737e012583312cbc24865b6904\n\nBeen prototyping an internal tool and honestly did not expect this. Claude helped me wire up the UI, logic, and even slash command agents directly into chat. Curious if anyone else has pushed it this far or if I just got lucky. ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/aipromptprogramming/comments/1qcz7wu/claude_is_unmatched/",
      "domain": "self.aipromptprogramming",
      "is_self": true,
      "comments": [
        {
          "id": "nzmewla",
          "author": "EliasRook",
          "text": "Just used Claude Code for the first time to create a local LLM on my laotop... rented a GPU and in 20 hours Claude had me talking to my own Qwen 2.5 32b... now I just need my own GPU to run it... awesome...",
          "score": 2,
          "created_utc": "2026-01-14 22:13:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzn4pil",
              "author": "lippoper",
              "text": "You could just download OpenWebUI or something of that sort",
              "score": 1,
              "created_utc": "2026-01-15 00:28:09",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzm312l",
          "author": "BranchDiligent8874",
          "text": "If you do not mind can you please elaborate what kind of app you are trying to create and what are the big picture steps, I would like to try similar?",
          "score": 1,
          "created_utc": "2026-01-14 21:20:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzm4zvq",
              "author": "Exotic_Bend_1102",
              "text": "I'm just trying in my existing apps into /commands and making them simplified little agents",
              "score": 1,
              "created_utc": "2026-01-14 21:29:10",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzpi8z7",
          "author": "Killie154",
          "text": "I'm kinda curious to know if you tried anti gravity",
          "score": 1,
          "created_utc": "2026-01-15 10:58:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzlyln9",
          "author": "SUNnLIGHTN",
          "text": "wait till you meet claudy",
          "score": 0,
          "created_utc": "2026-01-14 21:00:17",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qd7h9o",
      "title": "What do you combine with AI foundation models to cover the full workflow?",
      "subreddit": "aipromptprogramming",
      "url": "https://www.reddit.com/r/aipromptprogramming/comments/1qd7h9o/what_do_you_combine_with_ai_foundation_models_to/",
      "author": "NonArus",
      "created_utc": "2026-01-15 02:37:54",
      "score": 4,
      "num_comments": 2,
      "upvote_ratio": 1.0,
      "text": "Hey everyone, been lurking around this sub for a while. So thought I’d share a few tools I actually use to make working with AI models smoother. Curious what’s helping you too. I’m on ChatGPT Plus, and mostly use it for general topics, rewriting emails, and research. I use it with\n\n[Manus](https://manus.im/) \\- For researching complex, repetitive stuff. I usually run Manus and ChatGPT side by side and then compare the results, consolidate insights from them\n\n[Granola](https://www.granola.ai/) \\- An AI note taker that doesn’t have a bot. I just let it run in the background when I’m listening in. The summaries are quite solid too\n\n[Saner](https://www.saner.ai/) \\- Helps manage notes, todos, calendars via chat. Useful since ChatGPT doesn’t have a workspace interface yet.\n\n[NotebookLM](https://notebooklm.google/) \\- Good for long PDFs. It handles this better than ChatGPT in my pov. I also like the diagram, podcast thing - sometimes it makes dense material easier to digest.\n\nTell me your recs! what do you use with AI models to cover your whole workflow?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/aipromptprogramming/comments/1qd7h9o/what_do_you_combine_with_ai_foundation_models_to/",
      "domain": "self.aipromptprogramming",
      "is_self": true,
      "comments": [
        {
          "id": "nzntfz6",
          "author": "Special-Grocery6419",
          "text": "manus is a good name, hope nothing changes after the acquisition by Meta",
          "score": 1,
          "created_utc": "2026-01-15 02:49:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzpypdz",
          "author": "ManufacturerDry8742",
          "text": "What helped me was adding structure instead of creativity.\n\nStep-by-step prompts outperform vague ones.",
          "score": 1,
          "created_utc": "2026-01-15 13:02:22",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qcsy96",
      "title": "People are talking about ping-ponging between LLM providers, but I think the future is LLMs from one lab using others for specialization",
      "subreddit": "aipromptprogramming",
      "url": "https://i.redd.it/burpdipkkcdg1.png",
      "author": "Witty_Habit8155",
      "created_utc": "2026-01-14 17:09:40",
      "score": 4,
      "num_comments": 1,
      "upvote_ratio": 0.83,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/aipromptprogramming/comments/1qcsy96/people_are_talking_about_pingponging_between_llm/",
      "domain": "i.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "nzmckyg",
          "author": "CommercialComputer15",
          "text": "Like router models",
          "score": 1,
          "created_utc": "2026-01-14 22:03:04",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qenke0",
      "title": "Context7 vs Reftools?",
      "subreddit": "aipromptprogramming",
      "url": "https://www.reddit.com/r/aipromptprogramming/comments/1qenke0/context7_vs_reftools/",
      "author": "maxiedaniels",
      "created_utc": "2026-01-16 18:12:29",
      "score": 3,
      "num_comments": 0,
      "upvote_ratio": 0.81,
      "text": "A long while back I tried Context7 and it was not impressive, because it had a limited set of APIs it knew about and only worked by returning snippets. At the time people were talking about RefTools so I tried that - works fairly well but it's slow.\n\nI took a look at context7 again yesterday and it looks like there's a ton more APIs supported now. Has anyone used both of these recently? Curious about why I should use one vs the other. ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/aipromptprogramming/comments/1qenke0/context7_vs_reftools/",
      "domain": "self.aipromptprogramming",
      "is_self": true,
      "comments": []
    },
    {
      "id": "1qdjw8p",
      "title": "ChatGPT for your internal data - Search across your Google Drive, Gmail and more",
      "subreddit": "aipromptprogramming",
      "url": "https://www.reddit.com/r/aipromptprogramming/comments/1qdjw8p/chatgpt_for_your_internal_data_search_across_your/",
      "author": "[deleted]",
      "created_utc": "2026-01-15 13:45:00",
      "score": 3,
      "num_comments": 0,
      "upvote_ratio": 0.81,
      "text": "Hey everyone!\n\nI’m excited to share something we’ve been building for the past 6 months, a **fully open-source Enterprise Search Platform** designed to bring powerful Enterprise Search to every team, without vendor lock-in. The platform brings all your business data together and makes it searchable. It connects with apps like Google Drive, Gmail, Slack, Notion, Confluence, Jira, Outlook, SharePoint, Dropbox, Local file uploads and more. You can deploy it and run it with just one docker compose command.\n\nYou can run the full platform locally. Recently, one of our users tried **qwen3-vl:8b (16 FP)** with **vLLM** and got very good results.\n\nThe entire system is built on a **fully event-streaming architecture powered by Kafka**, making indexing and retrieval scalable, fault-tolerant, and real-time across large volumes of data.\n\nAt the core, the system uses an **Agentic Multimodal RAG approach**, where retrieval is guided by an enterprise knowledge graph and reasoning agents. Instead of treating documents as flat text, agents reason over relationships between users, teams, entities, documents, and permissions, allowing more accurate, explainable, and permission-aware answers.\n\n**Key features**\n\n* Deep understanding of user, organization and teams with enterprise knowledge graph\n* Connect to any AI model of your choice including OpenAI, Gemini, Claude, or Ollama\n* Use any provider that supports OpenAI compatible endpoints\n* Choose from 1,000+ embedding models\n* Visual Citations for every answer\n* Vision-Language Models and OCR for visual or scanned docs\n* Login with Google, Microsoft, OAuth, or SSO\n* Rich REST APIs for developers\n* All major file types support including pdfs with images, diagrams and charts\n* Agent Builder - Perform actions like Sending mails, Schedule Meetings, etc along with Search, Deep research, Internet search and more\n* Reasoning Agent that plans before executing tasks\n* 40+ Connectors allowing you to connect to your entire business apps\n\nCheck it out and share your thoughts or feedback. Your feedback is immensely valuable and is much appreciated:  \n[https://github.com/pipeshub-ai/pipeshub-ai](https://github.com/pipeshub-ai/pipeshub-ai)\n\nDemo Video:  \n[https://www.youtube.com/watch?v=xA9m3pwOgz8](https://www.youtube.com/watch?v=xA9m3pwOgz8)",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/aipromptprogramming/comments/1qdjw8p/chatgpt_for_your_internal_data_search_across_your/",
      "domain": "self.aipromptprogramming",
      "is_self": true,
      "comments": []
    },
    {
      "id": "1qg60b8",
      "title": "Open-Source Course on Deterministic Verification for LLM",
      "subreddit": "aipromptprogramming",
      "url": "https://github.com/QWED-AI/qwed-learning",
      "author": "Moist_Landscape289",
      "created_utc": "2026-01-18 11:12:32",
      "score": 3,
      "num_comments": 0,
      "upvote_ratio": 1.0,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/aipromptprogramming/comments/1qg60b8/opensource_course_on_deterministic_verification/",
      "domain": "github.com",
      "is_self": false,
      "comments": []
    }
  ]
}