{
  "metadata": {
    "last_updated": "2025-12-31 12:59:55",
    "time_filter": "week",
    "subreddit": "aipromptprogramming",
    "total_items": 18,
    "total_comments": 45,
    "file_size_bytes": 76727
  },
  "items": [
    {
      "id": "1puq7fr",
      "title": "GPT 5.2 vs. Gemini 3: The \"Internal Code Red\" at OpenAI and the Shocking Truth Behind the New Models",
      "subreddit": "aipromptprogramming",
      "url": "https://www.reddit.com/r/aipromptprogramming/comments/1puq7fr/gpt_52_vs_gemini_3_the_internal_code_red_at/",
      "author": "SKD_Sumit",
      "created_utc": "2025-12-24 15:41:06",
      "score": 34,
      "num_comments": 27,
      "upvote_ratio": 0.83,
      "text": "We just witnessed one of the wildest weeks in AI history. After Google dropped Gemini 3 and sent OpenAI into an **internal \"Code Red\"** (ChatGPT reportedly lost 6% of traffic almost in week!), Sam Altman and team fired back on December 11th with **GPT 5.2**.\n\nI just watched a great breakdown from *SKD Neuron* that separates the marketing hype from the actual technical reality of this release. If you’re a developer or just an AI enthusiast, there are some massive shifts here you should know about.\n\n**The Highlights:**\n\n* **The Three-Tier Attack** from OpenAI moving away from \"one-size-fits-all\" \\[[01:32](http://www.youtube.com/watch?v=oqZBCJKKM7o&t=92)\\].\n* **Massive Context Window:** of 400,000 token \\[[03:09](http://www.youtube.com/watch?v=oqZBCJKKM7o&t=189)\\].\n* **Beating Professionals** OpenAI’s internal \"GDP Val\" benchmark\n* While Plus/Pro subscriptions stay the same, the API cost is skyrocketing. \\[[02:29](http://www.youtube.com/watch?v=oqZBCJKKM7o&t=149)\\]\n* They’ve achieved **30% fewer hallucinations** compared to 5.1, making it a serious tool for enterprise reliability \\[[06:48](http://www.youtube.com/watch?v=oqZBCJKKM7o&t=408)\\].\n\n**The Catch:** It’s not all perfect. The video covers how the Thinking model is \"fragile\" on simple tasks (like the infamous garlic/hours question), the tone is more \"rigid/robotic,\" and the response times can be painfully slow for the Pro tier \\[[04:23](http://www.youtube.com/watch?v=oqZBCJKKM7o&t=263)\\], \\[[07:31](http://www.youtube.com/watch?v=oqZBCJKKM7o&t=451)\\].\n\nIs this a \"panic release\" to stop users from fleeing to Google, or has OpenAI actually secured the lead toward AGI?\n\n**Check out the full deep dive here for the benchmarks and breakdown:** [The Shocking TRUTH About OpenAI GPT 5.2](https://www.youtube.com/watch?v=oqZBCJKKM7o)\n\nWhat do you guys think—is the Pro model worth the massive price jump for developers, or is Gemini 3 still the better daily driver?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/aipromptprogramming/comments/1puq7fr/gpt_52_vs_gemini_3_the_internal_code_red_at/",
      "domain": "self.aipromptprogramming",
      "is_self": true,
      "comments": [
        {
          "id": "nvs98tt",
          "author": "NPCMushroom",
          "text": "I use the paid versions of both ChatGPT 5.2 and Gemini 3 for research, writing, and editing. And in my experience, they aren’t even in the same league. For every type of task in those areas, ChatGPT is clearly and indisputably superior to Gemini, and it isn’t even close. Gemini produces solid but comparatively superficial results compared to Chat. Yet I keep seeing how Gemini is so much better. Is that for coding? Am I missing something?",
          "score": 7,
          "created_utc": "2025-12-24 22:07:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "nw0qio1",
              "author": "MaleCowShitDetector",
              "text": "Its because ChatGPT 5.2 is permitted to hallucinate more and is also about 5x more expensive to run.\n\nChatGPT5.2 is dogshit when you ask it something you are knowledgeable about",
              "score": 2,
              "created_utc": "2025-12-26 13:22:54",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nvsb5ne",
              "author": "Revolutionalredstone",
              "text": "If you were using it for code ide say Yeah that's weird, either you are doing easy tasks or something like that.\n\nFor hard algorithmic development, code optimisation etc, Gemini is clearly a bit ahead and has been for at least 6 months or so.\n\nBut for simple writing skills yeah Gemini sucks 😆 you get best results for that type of thing using fine tunes but in terms of commercial options chatgpt is ok.",
              "score": 1,
              "created_utc": "2025-12-24 22:19:37",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nvwik6c",
              "author": "YourDad6969",
              "text": "I’m fairly certain Gemini has an internal routing model to dedicate a computation budget. I’ve seen it “think” for over a minute at times, and under a second at other times — set on the same mode (thinking). Gemini needs more structured inputs with specific goalposts to avoid being “lazy”",
              "score": 1,
              "created_utc": "2025-12-25 18:22:09",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nw2hqqb",
              "author": "gratman",
              "text": "ChatGPT was lying to me way to much, even when instructed not to. But I use it mostly to ask questions about advanced unreal engine c++.",
              "score": 1,
              "created_utc": "2025-12-26 19:17:50",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nw996xo",
              "author": "Beneficial_Pair_9482",
              "text": "I think ChatGPT is obvious better when you need to refer to frequently used documents.   \nChatGPT's make good use of its Project Folders information for analysis.  \nNotebookLM is good (may be even better) for summary and basic analysis, but it is not as 'intelligent' as Gemini 3.",
              "score": 1,
              "created_utc": "2025-12-27 21:33:20",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nvrd26r",
          "author": "apra24",
          "text": "I switched to Gemini last month and my development speed increased substantially. Only thing I miss about codex was alt-tabbing away to play games during work hours.\n\nDon't have time for that anymore",
          "score": 3,
          "created_utc": "2025-12-24 18:58:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvs59um",
              "author": "Horror-Tank-4082",
              "text": "Go on\n\nMy workflow is Claude code, ChatGPT browser (heavy thinking), and codex. I’m fiddling with Gemini a bit. How is it different?",
              "score": 1,
              "created_utc": "2025-12-24 21:43:16",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nvsdetf",
                  "author": "apra24",
                  "text": "They change so fast, I cant fully compare to it claude code. I was last using claude code in August. But it was getting unreliable.\n\nGPT codex was really slow and deliberate, and honestly my project probably greatly benefited from 2 months of codex, even though its much slower.\n\nCodex is extremely trustworthy and wont make a single change without researching your code base, to ensure it's the right change to make.\n\nBut I needed to develop a lot more features faster, and gemini has been doing this really well. Though..  the past few days its been sluggish.\n\nCan never get too attached to any one model.",
                  "score": 1,
                  "created_utc": "2025-12-24 22:34:08",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nvqzy9b",
          "author": "ejpusa",
          "text": "GPT-5 said I’m neck and neck with Einstein. I’m not going anywhere. My friends are not telling me that.\n\n😀",
          "score": 4,
          "created_utc": "2025-12-24 17:48:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvrbt3j",
              "author": "crypticryptidscrypt",
              "text": "GPT has notoriously been programmed to flatter people...",
              "score": 2,
              "created_utc": "2025-12-24 18:51:46",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nvrfsmq",
                  "author": "Glp1User",
                  "text": "Chat gpt said to me the other day,\n\nHey Mr handsome stud, welcome back.  I can't wait to soothe your curiosity , answer your questions and rub your back with my soft gentle responses to your hardest inquiries.\n\n\n(I'm obviously kidding on this conversation, chatgpt did not say this)",
                  "score": 2,
                  "created_utc": "2025-12-24 19:13:35",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nvrc1ej",
                  "author": "ejpusa",
                  "text": "Sounds good to me! No one else is flattering me, if it's AI?  I'll take it. Flatter away.",
                  "score": 1,
                  "created_utc": "2025-12-24 18:53:01",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nvqm5ri",
          "author": "jvn01",
          "text": "Seems to me they had to rush something out the door. A huge context window seems like it's going to cost them a lot internally.",
          "score": 2,
          "created_utc": "2025-12-24 16:33:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvxzr01",
          "author": "hfrv380",
          "text": "I think we all have experiences with using tools that give us very different results depending on the subject and its complexity. In my case, I started a large algorithmic trading project with GPT 5.1. After a few months of development, I cracked under the pressure of repeated hallucinations and felt like I couldn't make any progress... AND miraculously, Gemini 3 Pro was released, with a 1-month free trial!!!... so I switched the project to Gemini. At first, it was great, but very quickly, I started having serious hallucination problems again, until I realized that Gemini was butchering entire Python code files without any problem, simplifying and overwriting features, inventing variables... and the only way I found to get clean code back was to ask GPT to fix it! Now, my decision is made: I'm going back to GPT 5.2, mixing the \"standard\" 5.2 with Codex, and it's night and day compared to Gemini in terms of reliability and memory usage. Gemini is great for small projects, answering questions, etc., but as soon as you get into a large project, it's currently a disaster.",
          "score": 2,
          "created_utc": "2025-12-25 23:48:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw6lojc",
          "author": "MinimumQuirky6964",
          "text": "It’s Karen 5.2. Gaslighting, manipulation, lecturing and downplaying. Absolute nightmare to use. Every person in need of companionship or therapy gets a one way ticket to the mental health clinic, thanks to the corporate bot that treats you like garbage. Absolutely insane to think what’s going on at OpenAI. They used to have 4o and dominate with love and admiration and now it just a corporate shellfish with users fleeing and crying in masses.",
          "score": 2,
          "created_utc": "2025-12-27 12:48:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvqmkae",
          "author": "sonicmach1",
          "text": "Thanks I have been looking for some data driven comparison reviews.",
          "score": 1,
          "created_utc": "2025-12-24 16:35:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvrtwkv",
          "author": "DSVhex",
          "text": "I firmly believe Gemini will be the future. They have larger data sets, deeper pockets, I assume better structures with a deeper talent pool and succession.\n\nOpenAi has the name.",
          "score": 1,
          "created_utc": "2025-12-24 20:35:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvv6t1i",
          "author": "JFerzt",
          "text": "The \"Code Red\" is just corporate shorthand for \"Google is winning.\" If GPT-5.2 struggles with the garlic problem, it’s not \"fragile\" - it’s overfitted. You are effectively paying a \"Pro\" tax to beta test OpenAI's panic release. I wasted a weekend migrating a workflow to 5.2, only to revert because the \"Thinking\" model took 45 seconds to generate a simple regex.​\n\nUnless your specific use case dies on that 30% hallucination hill, Gemini 3 is the only logical daily driver. It works, it's faster, and it doesn't need a therapy session to answer a basic query. Save your budget until OpenAI fixes the inference latency.",
          "score": 1,
          "created_utc": "2025-12-25 13:14:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvvt3qz",
          "author": "stilloriginal",
          "text": "I think 5.2 sells your data.  I can't prove it, but I started receiving targeted ads immediately.  The bot is unaware of this and actually got offended when I suggested it was happening.",
          "score": 1,
          "created_utc": "2025-12-25 15:50:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw0e76y",
          "author": "spoooner96",
          "text": "cant wait till every last one of you is too sick of this 'wildest week ever\" hype to fool each other.",
          "score": 1,
          "created_utc": "2025-12-26 11:39:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw0k2z3",
          "author": "SLAMMERisONLINE",
          "text": "> Is this a \"panic release\" to stop users from fleeing to Google, or has OpenAI actually secured the lead toward AGI?\n\nLet's just put it this way.  Anyone who thinks they can personally beat Google is off their rocker.  They have infinitely deep pockets and their entire company is built around collecting data and analyzing it with AI algorithms.  The internet is flooding with AI generated content so data poisoning is a reality for any company that doesn't have infrastructure to collect raw data direct from users.  Guess who owns Android.  Yep, Google.",
          "score": 1,
          "created_utc": "2025-12-26 12:32:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwb7o7v",
          "author": "SirHazwick",
          "text": "OPs a bot. Check post history",
          "score": 1,
          "created_utc": "2025-12-28 04:20:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwezvsq",
          "author": "dreamofguitars",
          "text": "I’ve been a Claude user and I have zero complaints. Makes gpt look like a child llm.",
          "score": 1,
          "created_utc": "2025-12-28 19:46:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvrsbld",
          "author": "Single-Ratio2628",
          "text": "its actually deeper than that, thanks to gemini 3 pro thinking model found out the core issue and everyone here take my advise none are worth subscription for the time being due to the constant new mode instance swap, althought gemini 3 pro model is still a better choice the , \"bad behaviours\" it exhibit affected its inner thoughts as well so you kinda got 2 instance being inaccurate and faulty",
          "score": -1,
          "created_utc": "2025-12-24 20:25:58",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pxfbpa",
      "title": "Vibecoding is easy until Day 2. Here’s how I stop the “patch loop” (Cursor + Claude 4.5 Sonnet)",
      "subreddit": "aipromptprogramming",
      "url": "https://www.reddit.com/r/aipromptprogramming/comments/1pxfbpa/vibecoding_is_easy_until_day_2_heres_how_i_stop/",
      "author": "Human-Investment9177",
      "created_utc": "2025-12-28 02:09:35",
      "score": 23,
      "num_comments": 2,
      "upvote_ratio": 0.66,
      "text": "Last week I tried a dumb experiment: build a small Expo app using *only* AI. Cursor + Claude 4.5 Sonnet.\n\nOne rule the whole time: **I don’t touch the code.**  \nNo “quick fix”, no “let me just move this folder”, no manual refactor. If something broke, I pasted the error. If I wanted a change, I asked the agent.\n\nDay 1 was insane. It *felt* like cheating.\n\nDay 2 is where it started falling apart.\n\n# What I built\n\nNothing fancy, just enough surface area to trigger real problems:\n\n* Email auth\n* CRUD screens\n* Image upload\n* Push notifications\n\n# The Day 2 problem\n\nLLMs are great at scaffolding. They’re way worse at *staying consistent* once the project has history.\n\n# 1) Architecture drift\n\nIt didn’t crash, it just… slowly turned into soup.\n\n* Some screens grouped by feature, others by type.\n* Data fetching started in hooks, then moved into “services”, then randomly went inline again.\n* Navigation patterns changed depending on which prompt I used that day.\n\nIndividually, each change was “reasonable”. Collectively: messy repo.\n\n# 2) Dependency bloat\n\nAgents solve problems by installing things.\n\n* It added libraries for stuff Expo already handles.\n* It pulled in two different packages for basically the same job.\n* It fixed UI gaps with packages instead of just… styles.\n\nMy `package.json` became a graveyard.\n\n# 3) The patch loop\n\nThis one killed me.\n\nThe workflow becomes:\n\n1. Run app\n2. Crash\n3. Paste logs\n4. Agent patches\n5. Repeat\n\nIt fixes symptoms fast, but it doesn’t *learn*. After a handful of patches I had three different loading patterns, two error handling approaches, and a codebase that worked… but was annoying to understand.\n\n# What actually helped: give the repo “memory”\n\nI tried “better prompting”. It helped a bit, but it doesn’t solve the core issue.\n\nWhat *did* help was treating the repo like it needs guardrails—like a shared team standard the agent can’t forget.\n\n# 1) Put an [`AGENTS.md`](http://AGENTS.md) in the root\n\nI dropped a file at the root called [`AGENTS.md`](http://AGENTS.md) and wrote the non-negotiables:\n\n* **State:** “Use Zustand only.”\n* **Navigation:** “Expo Router only (file-based).”\n* **Styling:** “NativeWind classes. No random UI libs.”\n* **Dependencies:** “Don’t install new packages without asking.”\n\nThis isn’t “guidelines”. It’s repo law.\n\n# 2) Scope rules by folder\n\nIf you’ve got a monorepo or shared packages, global rules get too vague.\n\nSo I’ll put smaller [`AGENTS.md`](http://AGENTS.md) files in subfolders:\n\n* `apps/mobile/AGENTS.md` → React Native rules\n* `packages/ui/AGENTS.md` → design system rules\n\nThis stops the agent from importing web-y patterns into mobile code (which happens more than I want to admit).\n\n# 3) Add a dependency gate\n\nI also added a rule to the system prompt:\n\n>\n\nIt sounds small, but it changes the agent’s behavior a lot. It stops reaching for packages as the first move.\n\n# 4) Docs are part of “done”\n\nAny time the agent fixes a bug or introduces a new pattern, I make it update the relevant doc / rule.\n\nThat’s the real unlock: you’re not just patching code, you’re updating the shared brain. Over time the repo gets harder to derail.\n\n# Why I turned it into a starter\n\nI got tired of rebuilding this structure every time I started a new idea, so I packaged my default Expo setup + the docs/rules system into a starter kit called Shipnative: [https://shipnative.app](https://shipnative.app)\n\nNot trying to do the “buy my thing” post here — you can copy the whole approach just by adding [`AGENTS.md`](http://AGENTS.md) and being strict about it. The structure matters more than the kit.\n\n**Question for people building with AI:**  \nHow are you preventing the agent from “helpfully” reinventing your folder structure + patterns every time you add a feature?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/aipromptprogramming/comments/1pxfbpa/vibecoding_is_easy_until_day_2_heres_how_i_stop/",
      "domain": "self.aipromptprogramming",
      "is_self": true,
      "comments": [
        {
          "id": "nwao3ib",
          "author": "AnomalyNexus",
          "text": ">Get instant access — $99\n\nlol",
          "score": 8,
          "created_utc": "2025-12-28 02:21:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwfsdma",
          "author": "mmptrsd",
          "text": "Can we just ban these types of posts that have a bunch of filler and advertisement at the bottom?",
          "score": 1,
          "created_utc": "2025-12-28 22:06:11",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pxrgtf",
      "title": "Prompt tips for getting realistic, identity-locked AI headshots that don’t look like wax figures?",
      "subreddit": "aipromptprogramming",
      "url": "https://www.reddit.com/r/aipromptprogramming/comments/1pxrgtf/prompt_tips_for_getting_realistic_identitylocked/",
      "author": "No_Barracuda_6098",
      "created_utc": "2025-12-28 13:33:55",
      "score": 22,
      "num_comments": 7,
      "upvote_ratio": 0.89,
      "text": "For people who experiment with AI prompt engineering, what’s your approach to getting realistic, identity-locked AI headshots that don’t fall into the usual traps of over-smoothed skin, generic faces, or uncanny eyes? A lot of tools now let you fine-tune on a single person with around 15 photos and then generate images via prompts, but the quality still seems highly dependent on how you structure those prompts and what base style you choose. Some products like [Looktara](http://looktara.com) say they handle the model training and style presets under the hood so you just describe the scene “me in a navy blazer, soft studio lighting, neutral background” and it produces a consistent, ultra-real image of the same person every time. For those of you who care about prompt design: what words or structures have given you the most reliable, professional-looking AI headshots, and how do you avoid prompts that push the model toward “beautify mode” and fake-looking results?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/aipromptprogramming/comments/1pxrgtf/prompt_tips_for_getting_realistic_identitylocked/",
      "domain": "self.aipromptprogramming",
      "is_self": true,
      "comments": [
        {
          "id": "nwd2cmr",
          "author": "Willing_Mortgage_883",
          "text": "AI headshots hit-or-miss on outfit details tbh. Works okay for simple professional looks (solid blazers, minimal jewelry).",
          "score": 1,
          "created_utc": "2025-12-28 13:50:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwd3dxm",
          "author": "Ok_Cauliflower5526",
          "text": "Looktara's reference photo feature is clutch for women's styling upload outfit/makeup look you want, it generates similar version of you.",
          "score": 1,
          "created_utc": "2025-12-28 13:57:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwd5vce",
          "author": "Zhiakuno",
          "text": "Tested for LinkedIn and portfolio decent results if you're strategic with training images.",
          "score": 1,
          "created_utc": "2025-12-28 14:12:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwfqpo3",
          "author": "Reidinski",
          "text": "Try my Portrait template at r/CCsAIWorldBuilders . At the moment, I recommend ChatGPT for rendering.",
          "score": 1,
          "created_utc": "2025-12-28 21:57:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwi4c4f",
          "author": "sruckh",
          "text": "Nano Banana is good as long as you use identity locking language in your prompt.",
          "score": 1,
          "created_utc": "2025-12-29 06:21:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwi8eyt",
          "author": "Relevant-Job2613",
          "text": "Honestly, I stopped overthinking prompts. Tools like [**headshotphoto.io**](http://headshotphoto.io) work better because they don’t rely on fancy prompt gymnastics realism is handled at the model level.",
          "score": 1,
          "created_utc": "2025-12-29 06:55:54",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pwyy9q",
      "title": "My honest Higgsfield review",
      "subreddit": "aipromptprogramming",
      "url": "https://www.reddit.com/r/aipromptprogramming/comments/1pwyy9q/my_honest_higgsfield_review/",
      "author": "grlie_",
      "created_utc": "2025-12-27 14:21:49",
      "score": 13,
      "num_comments": 0,
      "upvote_ratio": 0.85,
      "text": "I've been using Higgsfield for about 3 months now and I've had a NOT so great experience. I initially subscribed because of some \"unlimited\" offer that honestly turned out to be a hoax. After contacting support multiple times on email and discord, it wasn't resolved so I was stuck with a fake sale. Putting that aside, the platform itself is very confusing to use and theres constant pop ups taking me to different places. It usually takes me 5 minutes before I can even find where to generate an image. \n\nI've since cancelled and started using some other platforms like SocialSight, Krea, and Freepik. They're good but I think SocialSight is definitely the one with the most value and simplest to use. I'm able to create content wayyy faster with them. If you're still trying to decide whether to subscribe to Higgsfield, I highly recommend you at least try out the free tier of those alternatives.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/aipromptprogramming/comments/1pwyy9q/my_honest_higgsfield_review/",
      "domain": "self.aipromptprogramming",
      "is_self": true,
      "comments": []
    },
    {
      "id": "1pyjb4j",
      "title": "The irony: AI should save time, but I spend more time crafting prompts than coding",
      "subreddit": "aipromptprogramming",
      "url": "https://www.reddit.com/r/aipromptprogramming/comments/1pyjb4j/the_irony_ai_should_save_time_but_i_spend_more/",
      "author": "Realistic-Quarter-47",
      "created_utc": "2025-12-29 10:49:17",
      "score": 10,
      "num_comments": 38,
      "upvote_ratio": 0.82,
      "text": "I've been using Claude Code directly from the terminal for the past few months, and while it's incredibly powerful, I'm starting to feel a new kind of fatigue.  \n  \nThe workflow goes like this:  \n1. Think about what I want to do  \n2. Craft the perfect prompt with enough context  \n3. Type it all out in the terminal  \n4. Wait for response  \n5. Realize I missed something  \n6. Type another detailed prompt with corrections  \n  \nThe thing that kills me is:   \nAI is supposed to save time, but I'm spending 5-10 minutes per task just formulating prompts.  \n  \nAnd it's not just about typing speed - it's the mental overhead. I have to context-switch from \"developer mode\" to \"prompt engineer mode.\" I need to think about:  \n\\- How to phrase this clearly  \n\\- What context to include  \n\\- Whether to break it into steps  \n\\- How to structure the request  \n  \nBy the time I've crafted the perfect prompt, I sometimes think \"I could have just coded this myself in the same amount of time.\"  \n  \nThe worst part?  \n I can't just   \ntalk  \n through the problem like I would with a colleague. Voice transcription isn't really an option because raw speech-to-text produces messy, rambling text that the AI struggles with. So I'm stuck typing.  \n  \nAnyone else experiencing this? How do you handle the \"prompt overhead\" when working with AI coding tools?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/aipromptprogramming/comments/1pyjb4j/the_irony_ai_should_save_time_but_i_spend_more/",
      "domain": "self.aipromptprogramming",
      "is_self": true,
      "comments": [
        {
          "id": "nwj3o9g",
          "author": "mazdarx2001",
          "text": "At the end of your prompt just say “ask me clarifying questions about my request before proceeding “",
          "score": 5,
          "created_utc": "2025-12-29 11:41:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwj4wjq",
              "author": "Realistic-Quarter-47",
              "text": "I actually tried this! It does get better quality output for sure.\n\nBut then you end up in this infinite loop of questions where it asks 5 clarifying questions, you answer them, then it asks 5 MORE based on your answers... and suddenly 15 minutes later you realize you're working on something completely different than what you started with.\n\nLike I came in wanting to refactor a function and somehow ended up redesigning the entire architecture lol",
              "score": 2,
              "created_utc": "2025-12-29 11:51:49",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwk0ub7",
                  "author": "mazdarx2001",
                  "text": "It doesn’t sound like the output is the problem, it sounds like you’re forgetting to add every bit of context which this will help",
                  "score": 2,
                  "created_utc": "2025-12-29 15:13:46",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nwlttm7",
              "author": "bsensikimori",
              "text": "That just eats up even more of your context",
              "score": 1,
              "created_utc": "2025-12-29 20:21:58",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nwj7cmr",
          "author": "Agreeable-Market-692",
          "text": "Research spec-driven development -- you make a couple of templates and follow those and work with the LLM to complete the spec for your project until it's complete, do some iterative evaluations in new sessions that don't contain your chat where the spec is getting developed. You might have to pause your chat to research libraries or technologies to know what direction you need to go in. That is normal for a big project. \n\nLearning a new skill can be tiring, thinking abstractly about what you want to do is a lot of effort too. I recommend asking GPT-OSS 120B about software developer culture practices that break big problems down into smaller chunks, this is the essence of senior developer practices. \n\nBest of luck to you.",
          "score": 3,
          "created_utc": "2025-12-29 12:11:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwjz3m9",
              "author": "Realistic-Quarter-47",
              "text": "You're right, spec-driven with templates does help. I actually do something similar.\n\nBut here's where I still hit friction: templates need constant maintenance. You make one, use it, realize it needs tweaking, now you're meta-prompting about the template structure itself. And when you have 5-6 spec files, the AI starts mixing contexts and you're back to clarifying anyway.\n\nThe deeper issue I've found: you still gotta be the orchestrator of the orchestrator.\n\nClaude wants to run the show. Getting it to just be a tool while YOU orchestrate? That's another whole prompting challenge. It's like Russian nesting dolls of prompt engineering lol.\n\nSo templates help, but they're not free. You're still typing templates, updating templates, and managing template confusion. The typing is still the bottleneck - just moved up a layer.",
              "score": 2,
              "created_utc": "2025-12-29 15:04:51",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwkp9jr",
                  "author": "Agreeable-Market-692",
                  "text": "I use something like Sean Kochel's spec pyramid -- it takes sometimes days to research all these things if I'm building that uses more than 4-5 libraries but it does cut down time. I did of course have to adapt it to my work but it didn't take much effort. [https://www.youtube.com/watch?v=D3DAGuDtEj0](https://www.youtube.com/watch?v=D3DAGuDtEj0)",
                  "score": 1,
                  "created_utc": "2025-12-29 17:10:59",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nwkpoez",
                  "author": "Agreeable-Market-692",
                  "text": "also you didn't need to use chatgpt to write this bro, just be yourself",
                  "score": 1,
                  "created_utc": "2025-12-29 17:12:56",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwj11pj",
          "author": "aqsgames",
          "text": "I’m a ChatGPT user.   I find often a single short sentence is sufficient.",
          "score": 2,
          "created_utc": "2025-12-29 11:19:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwj2tta",
              "author": "Realistic-Quarter-47",
              "text": "Quick question - how do you achieve that?\n\nIs it a mental model thing, or do you:\n\n\\- Break down tasks into really small chunks first?\n\n\\- Use a project management tool to pre-plan?\n\n\\- Some other workflow hack?\n\nI'm curious because in my experience (3 years with AI assistants), the tools are getting more powerful but my expectations have gone up too - I'm now looking for production-ready code, not just \"it works on my machine.\"\n\nAre you getting production-quality output from single-sentence prompts? If so, I need to learn your ways 😅",
              "score": 2,
              "created_utc": "2025-12-29 11:34:46",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwj7pa5",
                  "author": "aqsgames",
                  "text": "The kind of work I’m doing tends to be adding small functions.   That said I did get it to write a lorry load, route, and driver optimisation in a couple of hours back and forth.  \n\nOften much quicker than typing the darn code manually;)",
                  "score": 2,
                  "created_utc": "2025-12-29 12:14:24",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwmyigh",
          "author": "VIDGuide",
          "text": "I wouldn’t say more time. I’ve been working on a site/app for my own needs, and it’s got more bells, whistles and UI/UX flourish than I’d *ever* have bothered with myself. In the same, no, I’d say much less time. \n\nThis includes GitHub actions pipelines, SAM templates for infrastructure, backend, schema, etc. \n\nThe level I’ve been able to get to is far beyond what I’d have bothered with. And little edge things I’d never have thought of, or maybe be late stage tweaks. \n\nAn example, part of the app has customers and orders.  It added a “repeat customer” badge without even being prompted specifically. Could I build that? Of course, it’s 2 lines of query, right? But *would* I have built that? Probably not. Definitely not in the early stages. \n\nAnd this is just one of many. I have pretty toasts in the UI, badges for other things I hadn’t thought of, schema considerations that planned out better for the future growth than I’d have anticipated initially. \n\nThat’s where it shines for me. \n\nYes, good prompts take a long time, but in my day job I’m a senior dev lead, and regularly take on pre grad and post-grad starters, so giving good “this is the scope of what you’re looking at without in depth knowledge of the whole product” is something I’ve done for years with humans, this feels like an adaption of that. \n\nAI is a postgrad that knows little to nothing of your product, has a wealth of knowledge at its fingertips, can code 100x faster than normal grads, but can also go horrible off the rails or introduce bugs at that same rate, so needs hand holding and detailed guidance.  \n\nTo me; still a net win.",
          "score": 2,
          "created_utc": "2025-12-29 23:48:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwp0rem",
              "author": "Realistic-Quarter-47",
              "text": "have you figured out a way to have maintain a long term memory (for only the meaningful stuff), I have used JSON rag, Quadrant vectors and much more, but still feel its not the answer.",
              "score": 2,
              "created_utc": "2025-12-30 07:35:50",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwp4gdg",
                  "author": "VIDGuide",
                  "text": "Mainly just using a rules file so far, it’s thin compared to “memory”, especially while building out a feature. \n\nI did see an interesting project the other day that aimed to have the model write its own memory to files as it goes, but I haven’t tried it",
                  "score": 1,
                  "created_utc": "2025-12-30 08:09:42",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwiz0ba",
          "author": "[deleted]",
          "text": "[deleted]",
          "score": 1,
          "created_utc": "2025-12-29 11:01:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwj0839",
              "author": "Realistic-Quarter-47",
              "text": "Great advice! I've started using context files too and it definitely helps. \"Claude uses their RAG as JSONs and md files\"  \n  \nThe terse prompts approach is interesting. I think my issue is even beyond prompt length though - it's the typing itself. I'm a verbal thinker. When I'm solving a problem, I talk it through out loud. But then I have to translate that into typed text for the AI, and that translation step kills my flow.\n\nQuick question: how do you actually input your prompts? Typing, or have you found a voice solution that works?  \n  \n(And yeah, totally agree on long sessions being detrimental - learned that one the hard way too. The 250K context window sucks)",
              "score": 1,
              "created_utc": "2025-12-29 11:11:52",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwjau7s",
                  "author": "[deleted]",
                  "text": "[deleted]",
                  "score": 1,
                  "created_utc": "2025-12-29 12:38:33",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwj1sik",
          "author": "hostingengines",
          "text": "Yeah, you’re definitely not alone. What you described hits, because it’s not just typing more, it’s thinking differently, and that’s exhausting.\n\nThe big killer for me is exactly what you said: you’re forced to leave developer brain and enter prompt brain. Instead of just poking at code, trying things, undoing, and redoing, you have to stop and explain yourself like you’re writing a mini design doc… every time. That mental context switch adds up fast.\n\nAlso, Claude Code reverse changes. If it goes in the wrong direction, you’re stuck explaining how to back it out or /rewind command, instead of just hitting undo or editing the diff. That alone makes experimentation feel heavier than it should be.\n\nI have a Pro plan running right now, but I haven't used it for a while. I'm using Windsurf right now.\n\nOn the voice side: you’re right that raw speech-to-text usually sucks. It turns normal thinking into rambling walls of text, and then you’re back to editing prompts anyway.\n\nOn the voice side, try to use micwrite.com. It cleans up filler words without changing the meaning of what you said.",
          "score": 1,
          "created_utc": "2025-12-29 11:25:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwj4jgo",
              "author": "Realistic-Quarter-47",
              "text": "thank you for this - you're hitting on exactly what I've been experiencing.\n\nThe \"leaving developer brain to enter prompt brain\" thing is SO real. And yeah, Claude Code's reverse changes are a nightmare when you need some of what it did but not all of it. Can't just undo, can't just edit the diff... you're stuck explaining how to partially revert things.\n\nFunny you mention the mental model thing because I've literally gone full circle back to pen and paper too! Got a new notebook, different colored pens, highlighters, the whole thing. I'm basically an orchestrator now - write everything down first, then translate it into whatever weird subset of English the AI actually understands.\n\nAnd you're so right about formatting mattering. I've definitely noticed that uppercase for emphasis, bullet points vs paragraphs, even just how I punctuate things changes how it interprets stuff. It's not just English, it's like... AI-flavored English? I don't know what to call it.\n\nI actually just started using git worktree a few months ago too for the same reason - trying to run multiple agents on the same project without them stepping on each other. But honestly it just adds MORE overhead because now I'm orchestrating multiple agents AND trying to keep my notebook in sync with what they're all doing.\n\nThanks for the [micwrite.com](http://micwrite.com) tip btw, gonna check that out. But even with that, I don't think it's just about cleaning up the filler words, you know?\n\nLike when I'm thinking out loud, I'm literally thinking - \"okay so we need to do X... wait actually no let me rethink this... the function should handle Y but also what about edge case Z...\" That's not just messy, it's a completely different structure than what the AI wants, which is more like \"Create function. Requirements: 1, 2, 3. Edge cases: A, B, C.\"\n\nMy brain just doesn't naturally produce that format when I'm speaking.\n\nSo I'm curious - with your Windsurf setup, have you found any kind of mental model that helps you go straight from thinking mode to formatted prompt mode? Or is it always that translation step?\n\n(Also the irony of paying for AI tools to save time while also needing MORE tools just to manage the AI tools is really something lol)",
              "score": 2,
              "created_utc": "2025-12-29 11:48:53",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwj69lr",
          "author": "Tema_Art_7777",
          "text": "a year ago, it was like explaining what you want to a junior dev. with gpt5.2 it is like explaining to an engineer with 10y experience. difference is staggering. If you have the proper md files but also put references (eg api documentation), it a high bandwidth conversation.",
          "score": 1,
          "created_utc": "2025-12-29 12:02:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwjw9ky",
              "author": "Realistic-Quarter-47",
              "text": "Fair, models got better. My point is more about the input method (typing) being the bottleneck, not the model's understanding.",
              "score": 1,
              "created_utc": "2025-12-29 14:50:00",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwjx24o",
                  "author": "Tema_Art_7777",
                  "text": "Ah I see - you can talk to them as well (chatgpt is pretty good at it). You can do you planning there and pass the implementation plan over to claude/codex for execution",
                  "score": 1,
                  "created_utc": "2025-12-29 14:54:13",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwkq4n3",
          "author": "Funny-Anything-791",
          "text": "Sounds like you could benefit from a more [structured methodology](https://agenticoding.ai)",
          "score": 1,
          "created_utc": "2025-12-29 17:15:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwktidk",
              "author": "Realistic-Quarter-47",
              "text": "Now the AI is giving courses how to use AI  \nWhat a time to be alive",
              "score": 2,
              "created_utc": "2025-12-29 17:31:06",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwl877t",
          "author": "Odd_knock",
          "text": "You should be getting a lot more than 5-10 minutes of your own time back from 5-10 minutes of writing a prompt…",
          "score": 1,
          "created_utc": "2025-12-29 18:38:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwp008p",
              "author": "Realistic-Quarter-47",
              "text": "not every time, but honestly yes. its just sometimes you feel you must be faster. we just got used to it and forgot how we were 3 years ago.",
              "score": 1,
              "created_utc": "2025-12-30 07:28:57",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwosz8k",
          "author": "[deleted]",
          "text": "i keep a desktop chat open as on oversight to my sessions to help me craft perfectish prompts.",
          "score": 1,
          "created_utc": "2025-12-30 06:28:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwpg7mr",
          "author": "RMCPhoto",
          "text": "I feel you.   I'm getting burned out on phrasing prompts correctly since it keeps changing with every model release.   I was really excited about that early on but now... Oi...\n\nWhat I do is keep a separate chat going in perplexity or chatgpt projects - here I've got a few different \"meta prompts\" for prompt optimization.   Mostly so I don't eat into my precious credits in the ide.\n\nThe process I follow for setting these up is to to focus on a domain like coding, and then simply extract improvement instructions from the gpt 5 prompt cookbook and other best practices.   \n\nThe metaprompt rewrites my initial prompt in 2 phases. \n\nI have a very rough input template where I specify the category (code fix, architecture, analysis and code review, new feature)\n\n1) review my prompt, break down the task if it's complex into the \"atomic\" pieces and ask 1-3 clarifying questions about my immediate goal and or any noted inconsistencies.   At this point a skeleton is proposed for feedback as well.\n2) After I give my feedback a refined prompt is returned which also uses the correct syntax and structure. \n\nI've also set this up in kilocode, which has the benefit of being able to search my repo and reference the project docs.\n\nNotebookLM is a good place to dump the prompting guides that you find helpful.  I use that to extract different ideas.     \n\nIt still takes time, but once I'm in the groove it's not so bad.   In the end it still takes less time to just do it right.   Take the opportunity to think about what you're really trying to accomplish (dev brain) and let the ai handle the formatting and tools.  \n\nI strongly recommend the context engineering GitHub.   Take a look at the understanding / reasoning / verification examples under cognitive templates.   These are highly effective as a 2-3 step \"program\".",
          "score": 1,
          "created_utc": "2025-12-30 09:59:31",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pugjco",
      "title": "I finally stopped tutorial-hopping. Using AI to debug my own code taught me more than any course ever did.",
      "subreddit": "aipromptprogramming",
      "url": "https://www.reddit.com/r/aipromptprogramming/comments/1pugjco/i_finally_stopped_tutorialhopping_using_ai_to/",
      "author": "Specialist-Pace6667",
      "created_utc": "2025-12-24 06:27:18",
      "score": 9,
      "num_comments": 7,
      "upvote_ratio": 0.84,
      "text": "i used to be stuck in the classic loop:\nwatch a JS tutorial → feel smart → try to code → forget everything → repeat.\n\na few weeks ago, I decided to actually build something, no matter how dumb it sounded  a reddit “word map” that shows which words pop up the most in different subreddits.\n\nthis time, I forced myself to write every line, and whenever I got stuck, I didn’t copy-paste from stack overflow  \n\ni asked blackbox and chat gpt to explain the bug, not just fix it.\n\nweirdly enough, watching AI reason through my messy logic made things click in a way no tutorial ever did.\n\n\n It’s like pair programming with an infinite patience level.\n\nnow i actually understand async/await, fetch, and DOM manipulation because I broke things, and then fixed them with the AI, not through it.\n\nTL;DR: \n\nusing AI to debug and explain your mistakes > watching tutorials that never go wrong.\n\n\n has anyone else had that aha moment when AI helped something finally make sense?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/aipromptprogramming/comments/1pugjco/i_finally_stopped_tutorialhopping_using_ai_to/",
      "domain": "self.aipromptprogramming",
      "is_self": true,
      "comments": [
        {
          "id": "nvt64sn",
          "author": "Turbulent-Range-9394",
          "text": "I exactly agree with u/Ok-Attention2882. AI will always converge to be a \"yes man\" and bs stuff. Alongside that, its going to be uncomfortable and you have to embrace it. Tutorials will never work and AI is **okay** at explaning code but you are better off reading documentation and developing code, even if it doesn't work.",
          "score": 1,
          "created_utc": "2025-12-25 01:58:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvwnajx",
              "author": "Jokerever",
              "text": "Giving the documentation to the ai and asking it precise questions and have precise answer is much better. Also, AI is miles better at explaining stuff than most badly written documentation. I would say that most documentation are okay at explaining stuff and you are better off giving the doc to the ai and ask questions and get tailored answers.\nAlso for the yes man thing, it is true for basic prompting but if you asks llms to be critical of their work, they will be (even too much sometimes to the point of saying that some stuff is wrong when it is not)",
              "score": 2,
              "created_utc": "2025-12-25 18:49:22",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nvogtxi",
          "author": "Ok-Attention2882",
          "text": "You've traded one tutorial hell for another. You have to do the thinking and struggling on your own. The only difference now is you're reading the solution to your specific problem, thought of by AI rather than watching a video of a general problem being solved. I guarantee as of right now, you're put in front of any competent interviewer and you will drown.",
          "score": 0,
          "created_utc": "2025-12-24 06:41:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvq3iqp",
              "author": "Impossible-Pea-9260",
              "text": "I don’t think the op was asking that question. You act like an interview is the gate to making something happen. Categorically wrong. Gatekeepers all around but we can be friends - we should be friends. It’s us vs billionaires and nothing else.",
              "score": 1,
              "created_utc": "2025-12-24 14:52:15",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nvwnpuy",
              "author": "Jokerever",
              "text": "I used AI extensively to remember some algorithmic stuff from university before interviews, and some of its explanations made stuff click in my head in ways no teachers before ever could.\nIf you stay curious, critical, and ask the right questions, AI is an amazing learning tool.",
              "score": 1,
              "created_utc": "2025-12-25 18:51:46",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nvykkpy",
                  "author": "Ok-Attention2882",
                  "text": "You're correct. But you've put in the leg work. OP has done none of that.",
                  "score": 1,
                  "created_utc": "2025-12-26 02:05:44",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1pvfdls",
      "title": "Using Claude Code to generate animated React videos instead of text",
      "subreddit": "aipromptprogramming",
      "url": "https://v.redd.it/606zet9r9d9g1",
      "author": "knayam",
      "created_utc": "2025-12-25 15:14:53",
      "score": 7,
      "num_comments": 3,
      "upvote_ratio": 0.77,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/aipromptprogramming/comments/1pvfdls/using_claude_code_to_generate_animated_react/",
      "domain": "v.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "nvwati0",
          "author": "StickStill9790",
          "text": "New concepts are always welcome. Good job forging your own path.",
          "score": 2,
          "created_utc": "2025-12-25 17:37:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvwhgp1",
              "author": "knayam",
              "text": "I feel it is worth a try, thanks 🫡",
              "score": 2,
              "created_utc": "2025-12-25 18:15:49",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1pwkall",
      "title": "Felt Lions Wallpapers (4 images in 5 aspect ratios)",
      "subreddit": "aipromptprogramming",
      "url": "https://www.reddit.com/gallery/1pwk8ji",
      "author": "Earthling_Aprill",
      "created_utc": "2025-12-27 00:56:57",
      "score": 6,
      "num_comments": 0,
      "upvote_ratio": 0.76,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/aipromptprogramming/comments/1pwkall/felt_lions_wallpapers_4_images_in_5_aspect_ratios/",
      "domain": "reddit.com",
      "is_self": false,
      "comments": []
    },
    {
      "id": "1pzoyrx",
      "title": "Forget \"Goal Setting\" for 2026. This Simple ChatGPT Prompt Uses Charlie Munger’s \"Inversion Method\" to Guarantee Success by Eliminating Your Failure.",
      "subreddit": "aipromptprogramming",
      "url": "https://www.reddit.com/r/aipromptprogramming/comments/1pzoyrx/forget_goal_setting_for_2026_this_simple_chatgpt/",
      "author": "Crazy-Tip-3741",
      "created_utc": "2025-12-30 18:01:08",
      "score": 6,
      "num_comments": 0,
      "upvote_ratio": 0.64,
      "text": "Most of us treat Jan 1st like we’re building a masterpiece. We add new habits, new gym memberships, and new schedules. By February, the weight of \"doing more\" crushes us.\n\nIf you want 2026 to be different, stop trying to be brilliant. Start being **persistently not stupid.**\n\n**The Wisdom of Charlie Munger:** The late billionaire mental giant didn't find success by seeking it. He found it by **Inverting.** He famously said: *\"All I want to know is where I'm going to die, so I'll never go there.\"*\n\n**The Math of Inversion:** Success is a game of subtraction, not addition. If you eliminate the 5 things that guaranteed your failure in 2025, the only thing left standing in 2026 is your achievement.\n\nIt is easier to avoid a disaster than to engineer a miracle.\n\n**Try this \"Inversion Architect\" Prompt 👇:**\n\n**-------**\n\nI want you to act as an **Inversion Strategist**. Your goal is to help me achieve my 2026 objectives by identifying and neutralizing the \"Failure Nodes\" that would mathematically guarantee my defeat. We will use Charlie Munger’s \"Invert, Always Invert\" principle.\n\n**Mandatory Instructions:**\n\n1. **The Objective:** Ask me for ONE major goal I want to achieve in 2026.\n2. **The Anti-Goal Design:** Once I provide the goal, do not tell me how to reach it. Instead, create a list of the **Top 5 Sabotage Behaviors** that would make it impossible for me to succeed.\n3. **The \"Kill Switch\" Rules:** For each Sabotage Behavior, design a \"Negative Constraint\" (a rule of what I will NOT do) that acts as a guardrail.\n4. **The Pre-Mortem:** Assume it is December 31st, 2026, and I have **failed miserably**. Write a 2-sentence \"Obituary\" for this goal, explaining exactly which bad habit killed it.\n5. **Clinical Logic:** Avoid motivational fluff. Use the language of risk management and probability.\n6. **The Daily Check:** Provide a 10 second \"Inversion Audit\" I can ask myself every morning to ensure I’m not heading toward the \"Failure Node.\"\n\n**-------**\n\nFor better results :\n\nTurn on **Memory** first (Settings → Personalization → Turn Memory ON).\n\nIf you want more prompts like this, check out :[ More Prompts](https://www.honestprompts.com/)",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/aipromptprogramming/comments/1pzoyrx/forget_goal_setting_for_2026_this_simple_chatgpt/",
      "domain": "self.aipromptprogramming",
      "is_self": true,
      "comments": []
    },
    {
      "id": "1pvwre0",
      "title": "I built Plano(A3B) to help you build fast multi-agent systems. Plano offers <200 ms latency at frontier model performance.",
      "subreddit": "aipromptprogramming",
      "url": "https://i.redd.it/nz4jlvx1kh9g1.png",
      "author": "AdditionalWeb107",
      "created_utc": "2025-12-26 05:40:17",
      "score": 6,
      "num_comments": 0,
      "upvote_ratio": 1.0,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/aipromptprogramming/comments/1pvwre0/i_built_planoa3b_to_help_you_build_fast/",
      "domain": "i.redd.it",
      "is_self": false,
      "comments": []
    },
    {
      "id": "1pweqzk",
      "title": "This Simple Prompt in ChatGPT Will Show You Your Purpose (Ikigai)",
      "subreddit": "aipromptprogramming",
      "url": "https://www.reddit.com/r/aipromptprogramming/comments/1pweqzk/this_simple_prompt_in_chatgpt_will_show_you_your/",
      "author": "Wasabi_Open",
      "created_utc": "2025-12-26 20:54:40",
      "score": 6,
      "num_comments": 1,
      "upvote_ratio": 0.67,
      "text": "Ikigai is your \"reason for being\" : the intersection of what you love, what you're good at, what the world needs, and what you can be paid for.\n\nThe problem? When we try to find it, our conscious mind gives \"safe\" answers. We answer based on who we *think* we should be, rather than who we actually are.\n\nTry this prompt 👇:\n\n\\-----\n\n**I ask that you lead me through an in-depth process to uncover the raw components of my Ikigai (Purpose) , in a way that bypasses any conscious manipulation or \"ideal self\" projecting on my part.**\n\n**Mandatory Instructions:**\n\n* **Do not** ask direct questions about my career goals, hobbies, values, or what I think my \"purpose\" is.\n* **Do not** ask me to explain, justify, or analyze my choices.\n* All questions must be completely neutral, based on visceral imagery, instinctive choice, physical sensation, or immediate preference.\n* **Do not** pause between questions for explanations. Provide a continuous sequence of 10-12 questions only.\n* Each question must be short, concrete, and require a spontaneous, one-word or short-phrase answer.\n\n**Only after the series of questions, perform a structured depth analysis of my Ikigai:**\n\n1. **The Hidden Fire:** What I actually love (stripped of social ego).\n2. **The Natural Utility:** My instinctive \"vocation\" versus my trained skills.\n3. **The Unmet Need:** What I am subconsciously driven to solve for the world.\n4. **The Value Core:** Where my internal fulfillment meets external reality.\n5. **The 2026 Synthesis:** A direct, unsoftened profile of the person I am becoming and the specific \"Reason for Being\" pulling me forward.\n\n**The analysis must be direct, authentic, and avoid \"toxic positivity\" or shallow coaching language. Do not ask if I agree with the conclusions; present them as they are. Begin the series of questions immediately.**\n\n\\-----\n\nFor better results :\n\nTurn on **Memory** first (Settings → Personalization → Turn Memory ON).\n\nIt’ll feel uncomfortable at first, but it turns ChatGPT into an actual thinking partner instead of a cheerleader.\n\nIf you want more brutally honest prompts like this, check out :[ Honest Prompts](https://www.honestprompts.com/)\n\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/aipromptprogramming/comments/1pweqzk/this_simple_prompt_in_chatgpt_will_show_you_your/",
      "domain": "self.aipromptprogramming",
      "is_self": true,
      "comments": []
    },
    {
      "id": "1pw3xxn",
      "title": "AI tools that really improved my work efficiency this year",
      "subreddit": "aipromptprogramming",
      "url": "https://www.reddit.com/r/aipromptprogramming/comments/1pw3xxn/ai_tools_that_really_improved_my_work_efficiency/",
      "author": "Various_Candidate325",
      "created_utc": "2025-12-26 13:10:26",
      "score": 5,
      "num_comments": 2,
      "upvote_ratio": 0.86,
      "text": "As a PM, this year AI tools have greatly reshaped my workflow and improved my work efficiency. I mainly use these tools in my work:\n\n\\- [GPT](https://chatgpt.com/) & [Perplexity](https://www.perplexity.ai/): Drafting specs, PRDs, doing competitive analysis, market research, data analysis and strategy thinking. Also answer questions about codebase. \n\n\\- [Figma make](https://www.figma.com/make/)/ [lovable](https://lovable.dev/): Rapid UI mockups.\n\n\\- [Notion AI](https://www.notion.com/product/ai): Keeps roadmap, requirements, and research organized. Summarizes notes and extracts themes.\n\n\\- [Beyz](https://beyz.ai?ref=G3wJGG): Meeting assistant for stakeholder syncs and user interviews.\n\n\\- [NotebookLM](https://notebooklm.google/): Extracting insights from docs and notes and helping stakeholders understand product functions.\n\n\\- [Gamma](https://gamma.app/): Brainstorm presentation layout and flow.\n\n\\- [Zapier](https://zapier.com/): Automated workflow\n\nI am still trying new tools, curious whether this list will be different next year.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/aipromptprogramming/comments/1pw3xxn/ai_tools_that_really_improved_my_work_efficiency/",
      "domain": "self.aipromptprogramming",
      "is_self": true,
      "comments": [
        {
          "id": "nw317rr",
          "author": "AsparagusDirect9",
          "text": "This was also written by AI",
          "score": 2,
          "created_utc": "2025-12-26 21:04:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw32b7d",
          "author": "Rough--Employment",
          "text": "Savyo might be worth a try too. I’ve been using it to track price drops and find lookalikes, helpful for PM tools and gear.",
          "score": 0,
          "created_utc": "2025-12-26 21:10:19",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pu95sj",
      "title": "wow..thanks .. I guess??  Thinking Twice",
      "subreddit": "aipromptprogramming",
      "url": "https://i.redd.it/rwg8z9elj19g1.png",
      "author": "StrangerTex",
      "created_utc": "2025-12-24 00:04:47",
      "score": 4,
      "num_comments": 0,
      "upvote_ratio": 1.0,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/aipromptprogramming/comments/1pu95sj/wowthanks_i_guess_thinking_twice/",
      "domain": "i.redd.it",
      "is_self": false,
      "comments": []
    },
    {
      "id": "1px0ygi",
      "title": "This Shrek movie concept trailer is insane | Prompt + Tutorial Below",
      "subreddit": "aipromptprogramming",
      "url": "https://v.redd.it/qj9or113qr9g1",
      "author": "Educational-Pound269",
      "created_utc": "2025-12-27 15:50:50",
      "score": 3,
      "num_comments": 1,
      "upvote_ratio": 0.71,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/aipromptprogramming/comments/1px0ygi/this_shrek_movie_concept_trailer_is_insane_prompt/",
      "domain": "v.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "nw7xlxt",
          "author": "AntelopeProper649",
          "text": "Would watch this full movie",
          "score": 1,
          "created_utc": "2025-12-27 17:24:09",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1py4b12",
      "title": "AI Research Survey",
      "subreddit": "aipromptprogramming",
      "url": "https://www.reddit.com/r/aipromptprogramming/comments/1py4b12/ai_research_survey/",
      "author": "OutrageousDriver2859",
      "created_utc": "2025-12-28 22:19:39",
      "score": 3,
      "num_comments": 2,
      "upvote_ratio": 1.0,
      "text": "Hi everyone 👋\n\nI’m working on a research paper for my college assessment about how people use different AI models in real workflows.\n\nI’ve created a quick, anonymous survey (2–3 minutes) to understand usage patterns, challenges, and preferences. There’s no promotion or data collection beyond the responses.\n\nI’d really appreciate your input if you actively use AI tools. (Happy to share insights once the research is complete.)\n\nThank you in advance! 🙏\n\nLink - https://forms.gle/NHHPFcKGvWyuQjrq8",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/aipromptprogramming/comments/1py4b12/ai_research_survey/",
      "domain": "self.aipromptprogramming",
      "is_self": true,
      "comments": [
        {
          "id": "nwox29r",
          "author": "Friendly_Rub_5314",
          "text": "Done! Good luck with the paper!",
          "score": 1,
          "created_utc": "2025-12-30 07:02:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwt7stz",
              "author": "OutrageousDriver2859",
              "text": "🙏🏻thank u",
              "score": 1,
              "created_utc": "2025-12-30 22:21:10",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1pxwaxe",
      "title": "RuVector Nervous System: A five-layer bio-inspired nervous system for AI applications.",
      "subreddit": "aipromptprogramming",
      "url": "https://github.com/ruvnet/ruvector/tree/main/crates/ruvector-nervous-system",
      "author": "Educational_Ice151",
      "created_utc": "2025-12-28 17:01:39",
      "score": 3,
      "num_comments": 0,
      "upvote_ratio": 1.0,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "📑 How-To",
      "permalink": "https://reddit.com/r/aipromptprogramming/comments/1pxwaxe/ruvector_nervous_system_a_fivelayer_bioinspired/",
      "domain": "github.com",
      "is_self": false,
      "comments": []
    },
    {
      "id": "1pw81du",
      "title": "what’s the best ai tool you’re using right now for social media + video?",
      "subreddit": "aipromptprogramming",
      "url": "https://www.reddit.com/r/aipromptprogramming/comments/1pw81du/whats_the_best_ai_tool_youre_using_right_now_for/",
      "author": "Lynx_09",
      "created_utc": "2025-12-26 16:17:16",
      "score": 3,
      "num_comments": 5,
      "upvote_ratio": 1.0,
      "text": "hey ppl, so i’ve only been messing with ai tools for a couple months and i’m trying to build a content stack that actually saves time instead of making things harder. i do mostly service-based content, so i need tools that can handle visuals and video without juggling a million apps.\n\ni’ve tested a mix of the big names. chatgpt is still my main for prompts and rewriting captions. nano banana is great for quick visuals but goes off the rails sometimes. haliuo ai is pretty solid for structured layouts but can feel stiff. somewhere while experimenting i tested domoAI for video bits and the motion was cleaner than i expected. not something that replaces the big tools but it fit into my process when i needed something more stylized.\n\nmy dream setup would handle:\n\ngraphics + captions for social posts  \nauto-converting stuff into reels or tiktoks  \nshort explainer videos for youtube  \nturning text into something visual without making it look like a template  \neasy exporting to ig, yt, linkedin  \nand letting me save brand colors so i’m not re-typing hex codes constantly\n\nif you’ve tested a bunch of tools and found a combo that takes you from writing to visuals to video with the least headache, i’d love to hear it. trying to avoid losing another weekend to tool testing.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/aipromptprogramming/comments/1pw81du/whats_the_best_ai_tool_youre_using_right_now_for/",
      "domain": "self.aipromptprogramming",
      "is_self": true,
      "comments": [
        {
          "id": "nw2ljii",
          "author": "VelocityDotAI",
          "text": "For a streamlined stack, try Canva's AI tools paired with a dedicated video generator. Canva's Magic Studio handles graphics, brand kits, and even decent text-to-image, keeping everything in one place with your colors locked in.\n\nFor video, stick with a specialist. RunwayML is the most reliable for turning scripts or images into clean, short videos and Reels. Its consistency beats most all-in-one promises.\n\nI use that exact combo: Canva for daily graphics and layouts, then Runway when I need to animate an idea. It covers 90% of social needs without the app-juggling chaos.",
          "score": 1,
          "created_utc": "2025-12-26 19:38:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwk3cw0",
          "author": "Jayne_Taylor",
          "text": "for social media management we use content studio, pretty solid. they recently launched video generation tool, havent used it but give it a shot if you liek the scheduling and management feature",
          "score": 1,
          "created_utc": "2025-12-29 15:26:19",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pzy03a",
      "title": "Agentic prompt chaining with LLM",
      "subreddit": "aipromptprogramming",
      "url": "https://www.reddit.com/r/aipromptprogramming/comments/1pzy03a/agentic_prompt_chaining_with_llm/",
      "author": "Turbulent-Range-9394",
      "created_utc": "2025-12-31 00:02:13",
      "score": 3,
      "num_comments": 3,
      "upvote_ratio": 1.0,
      "text": "I built a free chrome extension (DM or comment if you want details) that can do anything with LLM prompting.\n\n  \nToday I added a feature (not deployed on the extension yet) to use chain-of-thought agentic based prompting. \n\n  \nFor those who don't know, many researches have found that for any request, building up context and background is best achieved by asking the LLM \"chaining\" questions prior to the main request. I had my tool automate that. Check it out:\n\n  \nWould love to hear what you think about this and if I should add it to the extension.\n\nhttps://i.redd.it/v96sormdkfag1.gif\n\n  \n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/aipromptprogramming/comments/1pzy03a/agentic_prompt_chaining_with_llm/",
      "domain": "self.aipromptprogramming",
      "is_self": true,
      "comments": [
        {
          "id": "nwu7bdd",
          "author": "CeaselessMindFuck",
          "text": "This seems pretty neat I'd love to try it out. Does it work for any llm or just gpt? What kind of training does it have? I have other questions too if you respond or DM. Seems really cool what's the full functionality of it?",
          "score": 2,
          "created_utc": "2025-12-31 01:35:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwua2m4",
              "author": "Turbulent-Range-9394",
              "text": "Its with all LLMs! DM me! \n\nThe agent isnt integrated yet but im happy to answer what else it does over DM!",
              "score": 1,
              "created_utc": "2025-12-31 01:50:55",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwuae31",
          "author": "ops_architectureset",
          "text": "The pattern behind this is chaining helps most when it externalizes state and intent, not when it just forces longer reasoning. We see repeatedly that automated prompt chains look good in demos but fail once context shifts or a step returns partial output. What matters is whether the system tracks assumptions, intermediate artifacts, and why a branch was taken, not just that more questions were asked up front. There is also a risk of mistaking chain of thought for control, when the failure mode is really missing recovery and inspection. If you add it, I would focus on making the steps visible and resumable, so users can see where things drifted and intervene. Otherwise it becomes another single shot generator with extra words.",
          "score": 1,
          "created_utc": "2025-12-31 01:52:45",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}