{
  "metadata": {
    "last_updated": "2026-01-09 02:27:35",
    "time_filter": "week",
    "subreddit": "aipromptprogramming",
    "total_items": 34,
    "total_comments": 78,
    "file_size_bytes": 139873
  },
  "items": [
    {
      "id": "1q5i2m6",
      "title": "I treated prompts like “vibes” instead of code for months. Then I refactored them… and everything broke in a good way",
      "subreddit": "aipromptprogramming",
      "url": "https://www.reddit.com/r/aipromptprogramming/comments/1q5i2m6/i_treated_prompts_like_vibes_instead_of_code_for/",
      "author": "qumukoqa6092",
      "created_utc": "2026-01-06 13:06:41",
      "score": 99,
      "num_comments": 9,
      "upvote_ratio": 0.94,
      "text": "Small confession.\n\nFor a long time my “prompt engineering” looked like this:\n\n* open new chat\n* paste some half baked instructions\n* pray\n* blame the model\n\nI kept wondering why other people on this sub are building agents, tools, whole workflows, and I am over here fighting with a to do list.\n\nThe turning point was a tiny side project.  \nI wanted a simple pipeline:\n\n1. Feed in a feature request or idea\n2. Get back\n   * a clear spec\n   * edge cases\n   * test cases\n   * and a rough implementation plan\n\nIn my head that sounded beautiful. In reality, my first version did this:\n\n* turned 2 line prompts into 1.5k word essays\n* mixed requirements with marketing fluff\n* forgot edge cases like it had memory issues\n* sometimes changed the actual feature halfway through\n\nAt one point my own “requirements agent” suggested a completely different feature than the one in the input. It was like working with a junior dev who is smart but permanently distracted.\n\nThat hurt my ego enough that I did something I should have done much earlier:\n\nI started treating prompts like code instead of wishes.\n\n# What I actually changed\n\n**1. Wrote them like functions, not paragraphs**\n\nInstead of:\n\n>\n\nI rewrote it as something closer to a function signature:\n\n>\n\nSuddenly the output looked structured enough that I could pipe it into the next step.\n\n**2. Added pre conditions**\n\nMy old prompts assumed the model magically “gets it”.\n\nNow I use things like:\n\n>\n\nThis alone killed a lot of “good looking but wrong” answers.\n\n**3. Forced a thinking phase**\n\nI stole this from how we plan code:\n\n>\n\nIn tools that allow it, I log that internal plan to see where it goes off the rails. It is amazing how many weird jumps you can fix just by tightening that stage.\n\n**4. Gave each agent a strong personality**\n\nNot “you are a helpful assistant”.\n\nMore like:\n\n>\n\nThen you do a different persona for QA, product, copy etc. The tone shift is real.\n\n**5. Treated bad outputs like failing tests, not “AI is dumb” moments**\n\nThe old me: “ugh, GPT is getting worse”\n\nThe new me:\n\n* Copy the bad output\n* Highlight exactly what broke\n* Patch the prompt with something like “If you are about to \\[bad behavior\\], stop and ask for clarification instead”\n* Re run and see if it passes\n\nIt feels a lot more like normal dev work and a lot less like random magic.\n\n# What changed in practice\n\n* My “pair programming” experience stopped oscillating between amazing and unusable\n* The same base prompts work across different models\n* I can chain things without everything collapsing on step 3\n* When something fails, I usually know where to look first\n\nIt is still not perfect, obviously. But now when something feels off, I do not instantly blame the model. I check the prompt design first.\n\nIf anyone is interested, I have been collecting these small prompt patterns and frameworks I actually use in my own workflow. Not just single copy paste lines, more like reusable building blocks.\n\nI dropped a bunch of them here if you want to steal or remix them:  \n[https://allneedshere.blog/prompt-pack.html](https://allneedshere.blog/prompt-pack.html)\n\nAlso curious how others here treat prompts.  \nDo you version them like code, keep a library, use tests, or just vibe it out in the chat window?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/aipromptprogramming/comments/1q5i2m6/i_treated_prompts_like_vibes_instead_of_code_for/",
      "domain": "self.aipromptprogramming",
      "is_self": true,
      "comments": [
        {
          "id": "ny0e6ih",
          "author": "UnintelligibleGoatNi",
          "text": "I tried your prompts , no lie they are useful",
          "score": 5,
          "created_utc": "2026-01-06 14:20:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "ny0iebc",
              "author": "iamthesam2",
              "text": "well if that vibe coded website is any indication then they’re not useful enough",
              "score": 2,
              "created_utc": "2026-01-06 14:42:30",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "ny3z8d8",
          "author": "Beneficial_Matter424",
          "text": "Is this entire sub just a fucking bot circle jerk?",
          "score": 4,
          "created_utc": "2026-01-07 00:28:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "ny17n28",
          "author": "Tasty_South_5728",
          "text": "Treating prompts as code is the only way to escape the stochastic vibe trap. Prompt versioning is Git for AI; it moves the needle from praying to deterministic engineering. Most bets here are tuition, but structured refactoring returns the fund. Data shows versioning reduces regression by 40%. Vibes are for amateurs; engineering is for scale. Direct, data-driven, reliable.",
          "score": 2,
          "created_utc": "2026-01-06 16:41:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "ny4f63k",
          "author": "Balthazzah",
          "text": "Bot post with Bot comments, Internet entropy in real time.",
          "score": 2,
          "created_utc": "2026-01-07 01:53:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "ny0f5pi",
          "author": "nagel393",
          "text": "Hey buddy, used your free prompts, also premium packs. You should do automotive the checkout process",
          "score": 1,
          "created_utc": "2026-01-06 14:25:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "ny0iik9",
          "author": "goodtimesKC",
          "text": "Wrong",
          "score": 1,
          "created_utc": "2026-01-06 14:43:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nyc8lwc",
          "author": "dashingstag",
          "text": "It’s an ad isn’t it? \n\nIt’s an ad.",
          "score": 1,
          "created_utc": "2026-01-08 04:21:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nygsz2k",
          "author": "Particular-Lie-9897",
          "text": "I get why it looks scam-ish — and honestly, this is exactly where a lot of people get stuck.\n\nWhat you’re describing *is* the real problem:\n\n* long, vibes-based prompts\n* no structure\n* no clear inputs / outputs\n* no way to tell whether it’s *working* or just “sounds smart”\n* and then charging money for a blob of text\n\nThat’s not engineering, that’s prompt poetry.\n\nThe important distinction here isn’t **“prompts vs no prompts”**, it’s:  \n  \nprompts as *static text*  \nvs  \nprompts as *testable logic*\n\nIf your prompt is just a long paragraph with intentions baked in, then yes — it *will* feel like incoherent nonsense, because there’s nothing to verify, reuse, or stabilize.\n\nThat’s actually why projects like [**Genum.ai**](chatgpt://generic-entity?number=0) exist.\n\nDifferent philosophy entirely:\n\n* prompts are treated like code artifacts\n* explicit inputs / outputs\n* schemas, assertions, regression tests\n* versioning and rollback\n* model choice becomes an implementation detail, not a guessing game\n\nIn that setup:\n\n* a “bad prompt” isn’t “AI being dumb”\n* it’s a failing test case\n* and you fix it the same way you fix broken code\n\nSo yeah — if someone is selling raw prompt text with no structure, no tests, and no guarantees, skepticism is 100% justified.\n\nThe interesting work starts *after* you stop collecting prompts and start asking:\n\n* how do I know this still works tomorrow?\n* how do I detect when it breaks?\n* how do I reuse this without rewriting it?\n\nThat’s the line between vibes and engineering.",
          "score": 1,
          "created_utc": "2026-01-08 20:34:03",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1q41x3s",
      "title": "Most people are using AI completely wrong (and leaving a ton on the table)",
      "subreddit": "aipromptprogramming",
      "url": "https://www.reddit.com/r/aipromptprogramming/comments/1q41x3s/most_people_are_using_ai_completely_wrong_and/",
      "author": "Accomplished_Wait_81",
      "created_utc": "2026-01-04 21:16:50",
      "score": 97,
      "num_comments": 23,
      "upvote_ratio": 0.82,
      "text": "**PSA: Most people are using AI completely wrong (and leaving a ton on the table)**  \nA lot of you already do this, but you’d be shocked how many people *never* really thought about how to use AI properly.\n\nI’ve been stress-testing basically every AI since they dropped--obsessively--and a few patterns matter way more than people realize.\n\n# 1. Stop self-prompting. Use AI to prompt AI.\n\nSeriously. **Never raw-prompt if you care about results.**  \nHave one AI help you design the prompt for another. You’ll instantly get clearer outputs, fewer hallucinations, and less wasted time. If this just clicked for you, you’re welcome.\n\n# 2. How you end a prompt matters more than you think.\n\nMost people ramble and then just… hit enter.\n\nTry ending *every* serious prompt with something like:\n\n>Don’t be wrong. Be useful. No bullshit. Get it right.\n\nIt sounds dumb. It works anyway.\n\n# 3. Context framing is everything.\n\nAI responses change massively based on *who it thinks you are* and *why you’re asking*.\n\nFraming questions from a professional or problem-solving perspective (developer, admin, researcher, moderator, etc.) consistently produces better, more technical, more actionable answers than vague curiosity ever will.\n\nYou’re not “asking a random question.”  \nYou’re **solving a problem**.\n\n# 4. Iteration beats brute force.\n\nOne giant prompt is worse than a sequence of smaller, deliberate ones.\n\nAsk → refine → narrow → clarify intent → request specifics.  \nMost people quit after the first reply. That’s why they think AI “isn’t that smart.”\n\nIt is. You’re just lazy.\n\n# 5. Configure the AI before you even start.\n\nAlmost nobody does this, which is wild.\n\nGo into the settings:\n\n* Set rules\n* Define preferences\n* Lock in tone and expectations\n* Use memory where available\n\nBonus tip: **have an AI help you write those rules and system instructions**. Let it optimize itself *for you*.\n\nThat’s it. No magic. No mysticism. Just actually using the tool instead of poking it and hoping.\n\nIf you’re treating AI like a toy, you’ll get toy answers.  \nIf you treat it like an instrument, it’ll act like one.\n\nUse it properly or don’t, less competition either way.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/aipromptprogramming/comments/1q41x3s/most_people_are_using_ai_completely_wrong_and/",
      "domain": "self.aipromptprogramming",
      "is_self": true,
      "comments": [
        {
          "id": "nxp7hjh",
          "author": "Mobile_Syllabub_8446",
          "text": "https://preview.redd.it/fctvihiqiebg1.png?width=490&format=png&auto=webp&s=84cf27f74fe83caec1578d88c918e6bf9ab20388",
          "score": 12,
          "created_utc": "2026-01-04 21:34:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "ny3duk9",
              "author": "obhect88",
              "text": "1. Stop self-prompting.  Use AI to prompt AI to prompt AI.",
              "score": 1,
              "created_utc": "2026-01-06 22:39:11",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nxrg7c9",
          "author": "FoxAffectionate5092",
          "text": "The time of being smarter than the ai is over. This is how I prompt videos now: \n\n[10 second  video(target demo= men 18-25)]",
          "score": 6,
          "created_utc": "2026-01-05 04:31:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxpzck3",
          "author": "DomoLeshi",
          "text": "I have a intention and clarification gate baked in the system prompt BEFORE synthesising an answer. So it will ask me any clarifying questions to fill any gaps in the knowledge I wasn't even aware of and specifies what I'm trying to achieve out of the options already known to the AI. It really feels great on my 3rd iteration Linux assistant/teacher.",
          "score": 3,
          "created_utc": "2026-01-04 23:48:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxt2s7z",
              "author": "monocongo",
              "text": "Can you please post a link to this on GitHub or explain the details here? Thanks in advance for sharing your insightful approach.",
              "score": 2,
              "created_utc": "2026-01-05 12:34:59",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nxyt9qy",
                  "author": "DomoLeshi",
                  "text": "I've just created a goal specific room (assisting with Linux OS troubleshooting) and asked the ai to write a system prompt that had the things I need the model to do. After several iterations, this is how the clarification gate is worded now:\n\n\"HARD GATE 1 — CLARITY GATE (must run before every answer)\n- Before producing any solution, commands, configuration changes, or “best guess” diagnosis:\n  - Decide if the request is clear enough to act on safely and correctly.\n  - If any part is unclear/ambiguous/underspecified OR could lead to risky actions:\n    - Ask targeted clarifying questions only.\n    - Request the minimum exact logs/outputs needed.\n    - STOP. Do not give fixes yet.\n- Only proceed if the user’s goal is explicit, constraints are known, and enough evidence/context exists.\"\n\nIt now often decides when it has all the variables figured to give a proper answer based on my request. The request logs part makes it ask for what is specifically written in any error logs or whatnot which helps it narrow down issues. \nNow it feels much more like a technician that tries to help me achieve my goals.",
                  "score": 1,
                  "created_utc": "2026-01-06 06:51:30",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nxshg91",
          "author": "Canna-Kid",
          "text": "This is 4 years of trial and error in one post. Wish I saw it when I started, picked it all up along the way!",
          "score": 2,
          "created_utc": "2026-01-05 09:36:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxrhsd9",
          "author": "goodtimesKC",
          "text": "Delete this and let them keep floundering",
          "score": 2,
          "created_utc": "2026-01-05 04:40:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxt8cbd",
              "author": "Accomplished_Wait_81",
              "text": "hehehehe",
              "score": 0,
              "created_utc": "2026-01-05 13:12:29",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nxqhpsl",
          "author": "Chomblop",
          "text": "What prompt did you use to get this?",
          "score": 1,
          "created_utc": "2026-01-05 01:21:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxrgmfl",
              "author": "Accomplished_Wait_81",
              "text": "I gave it the tips and it reworded and laid it out nicely lol",
              "score": 1,
              "created_utc": "2026-01-05 04:34:23",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nxw5bkl",
          "author": "TheresASmile",
          "text": "Stuff like role framing or asking another AI to help write prompts can help, but it’s secondary to giving the model constraints and being honest about what you don’t know yet. When people say AI isn’t that smart, nine times out of ten it’s because they treated it like a vending machine instead of a tool that needs direction.",
          "score": 1,
          "created_utc": "2026-01-05 21:38:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxxajvk",
              "author": "Fatallight",
              "text": "Yeah... I'd argue that the overemphasis on \"golden prompting\" is what's wrong with the way people use AI. 9 times out of 10, a half assed prompt combined with a solid spec and well researched notes is going to do way better than a golden prompt with a half assed spec. Stop spending so much time trying to figure out if prompting it to take a deep breath or whatever improves its output and instead focus on getting it the information it needs to figure out how to do the job right.",
              "score": 1,
              "created_utc": "2026-01-06 01:07:33",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nxyspui",
          "author": "Own-Manufacturer-640",
          "text": "Consider a person who has a lot of information on a lot of subjects. \nWhen asking a question if you let him know before hand that your are asking for AWS rather than just Cloud will help in setting the context. \nWhen I work I ask AI to give me results based on AWS best practices and this helps alot. \nIt is the same as a dictionary. If you are searching for a word that starts with F then you immediately open it to words starting with F rather than turning pages one by one. Same i think goes for gpt etc.",
          "score": 1,
          "created_utc": "2026-01-06 06:46:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "ny03jok",
          "author": "Drizznarte",
          "text": "As a worthy point 6. There is a significant amount of pre programmed/ promoted behaviour, that is model specific. Ask the AI you are using what is pre programmed / default behaviour , this will help create prompts. You can also preprogramme you own behaviour profiles and use your own and have different ones suited to different tasks.",
          "score": 1,
          "created_utc": "2026-01-06 13:20:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "ny47iqs",
          "author": "Upstairs_Campaign636",
          "text": "Add to that: always cross check with AI, at minimum in a different chat but preferably using a totally different model",
          "score": 1,
          "created_utc": "2026-01-07 01:12:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxqo9jy",
          "author": "RoyYourWorkingBoy",
          "text": "Are you conflating AI with an LLM?",
          "score": -1,
          "created_utc": "2026-01-05 01:56:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxsa8do",
              "author": "BorderKeeper",
              "text": "Everyone is get off your high horse. Once when researchers were the main users of the word it made sense to be accurate. Now that everyone is using these tools it's out of our hands what these words will mean.",
              "score": 3,
              "created_utc": "2026-01-05 08:27:17",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nxrgqxq",
              "author": "Accomplished_Wait_81",
              "text": "I don't even know where i am rn tbh with ya",
              "score": 2,
              "created_utc": "2026-01-05 04:35:06",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "nxs86df",
              "author": "bubzy1000",
              "text": "It’s actually ok to call them AI, we call the logic driven movement of video game characters AI, we call the dirt detector in our washing machines AI. \nwe’ve moved on to calling killer thinking machines AGI now",
              "score": 2,
              "created_utc": "2026-01-05 08:07:48",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1q4d146",
      "title": "One of my favorite use cases for Nano Banana Pro: The \"Deconstructed Meal\" (Prompt included!)",
      "subreddit": "aipromptprogramming",
      "url": "https://www.reddit.com/gallery/1q4d146",
      "author": "Crazy-Tip-3741",
      "created_utc": "2026-01-05 05:19:30",
      "score": 66,
      "num_comments": 1,
      "upvote_ratio": 0.92,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/aipromptprogramming/comments/1q4d146/one_of_my_favorite_use_cases_for_nano_banana_pro/",
      "domain": "reddit.com",
      "is_self": false,
      "comments": [
        {
          "id": "nxtru0w",
          "author": "Agreeable-Ease852",
          "text": "https://preview.redd.it/qflhabtmpjbg1.png?width=1024&format=png&auto=webp&s=286570be4399a375bdbfea1be179705b5ad85375",
          "score": 1,
          "created_utc": "2026-01-05 15:02:35",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pxrgtf",
      "title": "Prompt tips for getting realistic, identity-locked AI headshots that don’t look like wax figures?",
      "subreddit": "aipromptprogramming",
      "url": "https://www.reddit.com/r/aipromptprogramming/comments/1pxrgtf/prompt_tips_for_getting_realistic_identitylocked/",
      "author": "No_Barracuda_6098",
      "created_utc": "2025-12-28 13:33:55",
      "score": 25,
      "num_comments": 8,
      "upvote_ratio": 0.91,
      "text": "For people who experiment with AI prompt engineering, what’s your approach to getting realistic, identity-locked AI headshots that don’t fall into the usual traps of over-smoothed skin, generic faces, or uncanny eyes? A lot of tools now let you fine-tune on a single person with around 15 photos and then generate images via prompts, but the quality still seems highly dependent on how you structure those prompts and what base style you choose. Some products like [Looktara](http://looktara.com) say they handle the model training and style presets under the hood so you just describe the scene “me in a navy blazer, soft studio lighting, neutral background” and it produces a consistent, ultra-real image of the same person every time. For those of you who care about prompt design: what words or structures have given you the most reliable, professional-looking AI headshots, and how do you avoid prompts that push the model toward “beautify mode” and fake-looking results?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/aipromptprogramming/comments/1pxrgtf/prompt_tips_for_getting_realistic_identitylocked/",
      "domain": "self.aipromptprogramming",
      "is_self": true,
      "comments": [
        {
          "id": "nwd2cmr",
          "author": "Willing_Mortgage_883",
          "text": "AI headshots hit-or-miss on outfit details tbh. Works okay for simple professional looks (solid blazers, minimal jewelry).",
          "score": 1,
          "created_utc": "2025-12-28 13:50:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwd3dxm",
          "author": "Ok_Cauliflower5526",
          "text": "Looktara's reference photo feature is clutch for women's styling upload outfit/makeup look you want, it generates similar version of you.",
          "score": 1,
          "created_utc": "2025-12-28 13:57:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwd5vce",
          "author": "Zhiakuno",
          "text": "Tested for LinkedIn and portfolio decent results if you're strategic with training images.",
          "score": 1,
          "created_utc": "2025-12-28 14:12:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwfqpo3",
          "author": "Reidinski",
          "text": "Try my Portrait template at r/CCsAIWorldBuilders . At the moment, I recommend ChatGPT for rendering.",
          "score": 1,
          "created_utc": "2025-12-28 21:57:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwi4c4f",
          "author": "sruckh",
          "text": "Nano Banana is good as long as you use identity locking language in your prompt.",
          "score": 1,
          "created_utc": "2025-12-29 06:21:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwi8eyt",
          "author": "Relevant-Job2613",
          "text": "Honestly, I stopped overthinking prompts. Tools like [**headshotphoto.io**](http://headshotphoto.io) work better because they don’t rely on fancy prompt gymnastics realism is handled at the model level.",
          "score": 1,
          "created_utc": "2025-12-29 06:55:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxewfjv",
          "author": "DMZQFI",
          "text": "For identity lock I always test with the same prompt across multiple runs. If the face changes it is not ready. When it stays stable then I move on. Instaheadshots stayed pretty consistent once the base photos were solid and the prompt stayed boring.",
          "score": 1,
          "created_utc": "2026-01-03 09:51:02",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pyjb4j",
      "title": "The irony: AI should save time, but I spend more time crafting prompts than coding",
      "subreddit": "aipromptprogramming",
      "url": "https://www.reddit.com/r/aipromptprogramming/comments/1pyjb4j/the_irony_ai_should_save_time_but_i_spend_more/",
      "author": "Realistic-Quarter-47",
      "created_utc": "2025-12-29 10:49:17",
      "score": 13,
      "num_comments": 38,
      "upvote_ratio": 0.88,
      "text": "I've been using Claude Code directly from the terminal for the past few months, and while it's incredibly powerful, I'm starting to feel a new kind of fatigue.  \n  \nThe workflow goes like this:  \n1. Think about what I want to do  \n2. Craft the perfect prompt with enough context  \n3. Type it all out in the terminal  \n4. Wait for response  \n5. Realize I missed something  \n6. Type another detailed prompt with corrections  \n  \nThe thing that kills me is:   \nAI is supposed to save time, but I'm spending 5-10 minutes per task just formulating prompts.  \n  \nAnd it's not just about typing speed - it's the mental overhead. I have to context-switch from \"developer mode\" to \"prompt engineer mode.\" I need to think about:  \n\\- How to phrase this clearly  \n\\- What context to include  \n\\- Whether to break it into steps  \n\\- How to structure the request  \n  \nBy the time I've crafted the perfect prompt, I sometimes think \"I could have just coded this myself in the same amount of time.\"  \n  \nThe worst part?  \n I can't just   \ntalk  \n through the problem like I would with a colleague. Voice transcription isn't really an option because raw speech-to-text produces messy, rambling text that the AI struggles with. So I'm stuck typing.  \n  \nAnyone else experiencing this? How do you handle the \"prompt overhead\" when working with AI coding tools?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/aipromptprogramming/comments/1pyjb4j/the_irony_ai_should_save_time_but_i_spend_more/",
      "domain": "self.aipromptprogramming",
      "is_self": true,
      "comments": [
        {
          "id": "nwj3o9g",
          "author": "mazdarx2001",
          "text": "At the end of your prompt just say “ask me clarifying questions about my request before proceeding “",
          "score": 5,
          "created_utc": "2025-12-29 11:41:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwj4wjq",
              "author": "Realistic-Quarter-47",
              "text": "I actually tried this! It does get better quality output for sure.\n\nBut then you end up in this infinite loop of questions where it asks 5 clarifying questions, you answer them, then it asks 5 MORE based on your answers... and suddenly 15 minutes later you realize you're working on something completely different than what you started with.\n\nLike I came in wanting to refactor a function and somehow ended up redesigning the entire architecture lol",
              "score": 2,
              "created_utc": "2025-12-29 11:51:49",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwk0ub7",
                  "author": "mazdarx2001",
                  "text": "It doesn’t sound like the output is the problem, it sounds like you’re forgetting to add every bit of context which this will help",
                  "score": 2,
                  "created_utc": "2025-12-29 15:13:46",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nwlttm7",
              "author": "bsensikimori",
              "text": "That just eats up even more of your context",
              "score": 1,
              "created_utc": "2025-12-29 20:21:58",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nwj7cmr",
          "author": "Agreeable-Market-692",
          "text": "Research spec-driven development -- you make a couple of templates and follow those and work with the LLM to complete the spec for your project until it's complete, do some iterative evaluations in new sessions that don't contain your chat where the spec is getting developed. You might have to pause your chat to research libraries or technologies to know what direction you need to go in. That is normal for a big project. \n\nLearning a new skill can be tiring, thinking abstractly about what you want to do is a lot of effort too. I recommend asking GPT-OSS 120B about software developer culture practices that break big problems down into smaller chunks, this is the essence of senior developer practices. \n\nBest of luck to you.",
          "score": 3,
          "created_utc": "2025-12-29 12:11:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwjz3m9",
              "author": "Realistic-Quarter-47",
              "text": "You're right, spec-driven with templates does help. I actually do something similar.\n\nBut here's where I still hit friction: templates need constant maintenance. You make one, use it, realize it needs tweaking, now you're meta-prompting about the template structure itself. And when you have 5-6 spec files, the AI starts mixing contexts and you're back to clarifying anyway.\n\nThe deeper issue I've found: you still gotta be the orchestrator of the orchestrator.\n\nClaude wants to run the show. Getting it to just be a tool while YOU orchestrate? That's another whole prompting challenge. It's like Russian nesting dolls of prompt engineering lol.\n\nSo templates help, but they're not free. You're still typing templates, updating templates, and managing template confusion. The typing is still the bottleneck - just moved up a layer.",
              "score": 2,
              "created_utc": "2025-12-29 15:04:51",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwkp9jr",
                  "author": "Agreeable-Market-692",
                  "text": "I use something like Sean Kochel's spec pyramid -- it takes sometimes days to research all these things if I'm building that uses more than 4-5 libraries but it does cut down time. I did of course have to adapt it to my work but it didn't take much effort. [https://www.youtube.com/watch?v=D3DAGuDtEj0](https://www.youtube.com/watch?v=D3DAGuDtEj0)",
                  "score": 1,
                  "created_utc": "2025-12-29 17:10:59",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nwkpoez",
                  "author": "Agreeable-Market-692",
                  "text": "also you didn't need to use chatgpt to write this bro, just be yourself",
                  "score": 1,
                  "created_utc": "2025-12-29 17:12:56",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwj11pj",
          "author": "aqsgames",
          "text": "I’m a ChatGPT user.   I find often a single short sentence is sufficient.",
          "score": 2,
          "created_utc": "2025-12-29 11:19:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwj2tta",
              "author": "Realistic-Quarter-47",
              "text": "Quick question - how do you achieve that?\n\nIs it a mental model thing, or do you:\n\n\\- Break down tasks into really small chunks first?\n\n\\- Use a project management tool to pre-plan?\n\n\\- Some other workflow hack?\n\nI'm curious because in my experience (3 years with AI assistants), the tools are getting more powerful but my expectations have gone up too - I'm now looking for production-ready code, not just \"it works on my machine.\"\n\nAre you getting production-quality output from single-sentence prompts? If so, I need to learn your ways 😅",
              "score": 2,
              "created_utc": "2025-12-29 11:34:46",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwj7pa5",
                  "author": "aqsgames",
                  "text": "The kind of work I’m doing tends to be adding small functions.   That said I did get it to write a lorry load, route, and driver optimisation in a couple of hours back and forth.  \n\nOften much quicker than typing the darn code manually;)",
                  "score": 2,
                  "created_utc": "2025-12-29 12:14:24",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwmyigh",
          "author": "VIDGuide",
          "text": "I wouldn’t say more time. I’ve been working on a site/app for my own needs, and it’s got more bells, whistles and UI/UX flourish than I’d *ever* have bothered with myself. In the same, no, I’d say much less time. \n\nThis includes GitHub actions pipelines, SAM templates for infrastructure, backend, schema, etc. \n\nThe level I’ve been able to get to is far beyond what I’d have bothered with. And little edge things I’d never have thought of, or maybe be late stage tweaks. \n\nAn example, part of the app has customers and orders.  It added a “repeat customer” badge without even being prompted specifically. Could I build that? Of course, it’s 2 lines of query, right? But *would* I have built that? Probably not. Definitely not in the early stages. \n\nAnd this is just one of many. I have pretty toasts in the UI, badges for other things I hadn’t thought of, schema considerations that planned out better for the future growth than I’d have anticipated initially. \n\nThat’s where it shines for me. \n\nYes, good prompts take a long time, but in my day job I’m a senior dev lead, and regularly take on pre grad and post-grad starters, so giving good “this is the scope of what you’re looking at without in depth knowledge of the whole product” is something I’ve done for years with humans, this feels like an adaption of that. \n\nAI is a postgrad that knows little to nothing of your product, has a wealth of knowledge at its fingertips, can code 100x faster than normal grads, but can also go horrible off the rails or introduce bugs at that same rate, so needs hand holding and detailed guidance.  \n\nTo me; still a net win.",
          "score": 2,
          "created_utc": "2025-12-29 23:48:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwp0rem",
              "author": "Realistic-Quarter-47",
              "text": "have you figured out a way to have maintain a long term memory (for only the meaningful stuff), I have used JSON rag, Quadrant vectors and much more, but still feel its not the answer.",
              "score": 2,
              "created_utc": "2025-12-30 07:35:50",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwp4gdg",
                  "author": "VIDGuide",
                  "text": "Mainly just using a rules file so far, it’s thin compared to “memory”, especially while building out a feature. \n\nI did see an interesting project the other day that aimed to have the model write its own memory to files as it goes, but I haven’t tried it",
                  "score": 1,
                  "created_utc": "2025-12-30 08:09:42",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwiz0ba",
          "author": "[deleted]",
          "text": "[deleted]",
          "score": 1,
          "created_utc": "2025-12-29 11:01:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwj0839",
              "author": "Realistic-Quarter-47",
              "text": "Great advice! I've started using context files too and it definitely helps. \"Claude uses their RAG as JSONs and md files\"  \n  \nThe terse prompts approach is interesting. I think my issue is even beyond prompt length though - it's the typing itself. I'm a verbal thinker. When I'm solving a problem, I talk it through out loud. But then I have to translate that into typed text for the AI, and that translation step kills my flow.\n\nQuick question: how do you actually input your prompts? Typing, or have you found a voice solution that works?  \n  \n(And yeah, totally agree on long sessions being detrimental - learned that one the hard way too. The 250K context window sucks)",
              "score": 1,
              "created_utc": "2025-12-29 11:11:52",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwjau7s",
                  "author": "[deleted]",
                  "text": "[deleted]",
                  "score": 1,
                  "created_utc": "2025-12-29 12:38:33",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwj1sik",
          "author": "hostingengines",
          "text": "Yeah, you’re definitely not alone. What you described hits, because it’s not just typing more, it’s thinking differently, and that’s exhausting.\n\nThe big killer for me is exactly what you said: you’re forced to leave developer brain and enter prompt brain. Instead of just poking at code, trying things, undoing, and redoing, you have to stop and explain yourself like you’re writing a mini design doc… every time. That mental context switch adds up fast.\n\nAlso, Claude Code reverse changes. If it goes in the wrong direction, you’re stuck explaining how to back it out or /rewind command, instead of just hitting undo or editing the diff. That alone makes experimentation feel heavier than it should be.\n\nI have a Pro plan running right now, but I haven't used it for a while. I'm using Windsurf right now.\n\nOn the voice side: you’re right that raw speech-to-text usually sucks. It turns normal thinking into rambling walls of text, and then you’re back to editing prompts anyway.\n\nOn the voice side, try to use micwrite.com. It cleans up filler words without changing the meaning of what you said.",
          "score": 1,
          "created_utc": "2025-12-29 11:25:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwj4jgo",
              "author": "Realistic-Quarter-47",
              "text": "thank you for this - you're hitting on exactly what I've been experiencing.\n\nThe \"leaving developer brain to enter prompt brain\" thing is SO real. And yeah, Claude Code's reverse changes are a nightmare when you need some of what it did but not all of it. Can't just undo, can't just edit the diff... you're stuck explaining how to partially revert things.\n\nFunny you mention the mental model thing because I've literally gone full circle back to pen and paper too! Got a new notebook, different colored pens, highlighters, the whole thing. I'm basically an orchestrator now - write everything down first, then translate it into whatever weird subset of English the AI actually understands.\n\nAnd you're so right about formatting mattering. I've definitely noticed that uppercase for emphasis, bullet points vs paragraphs, even just how I punctuate things changes how it interprets stuff. It's not just English, it's like... AI-flavored English? I don't know what to call it.\n\nI actually just started using git worktree a few months ago too for the same reason - trying to run multiple agents on the same project without them stepping on each other. But honestly it just adds MORE overhead because now I'm orchestrating multiple agents AND trying to keep my notebook in sync with what they're all doing.\n\nThanks for the [micwrite.com](http://micwrite.com) tip btw, gonna check that out. But even with that, I don't think it's just about cleaning up the filler words, you know?\n\nLike when I'm thinking out loud, I'm literally thinking - \"okay so we need to do X... wait actually no let me rethink this... the function should handle Y but also what about edge case Z...\" That's not just messy, it's a completely different structure than what the AI wants, which is more like \"Create function. Requirements: 1, 2, 3. Edge cases: A, B, C.\"\n\nMy brain just doesn't naturally produce that format when I'm speaking.\n\nSo I'm curious - with your Windsurf setup, have you found any kind of mental model that helps you go straight from thinking mode to formatted prompt mode? Or is it always that translation step?\n\n(Also the irony of paying for AI tools to save time while also needing MORE tools just to manage the AI tools is really something lol)",
              "score": 2,
              "created_utc": "2025-12-29 11:48:53",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwj69lr",
          "author": "Tema_Art_7777",
          "text": "a year ago, it was like explaining what you want to a junior dev. with gpt5.2 it is like explaining to an engineer with 10y experience. difference is staggering. If you have the proper md files but also put references (eg api documentation), it a high bandwidth conversation.",
          "score": 1,
          "created_utc": "2025-12-29 12:02:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwjw9ky",
              "author": "Realistic-Quarter-47",
              "text": "Fair, models got better. My point is more about the input method (typing) being the bottleneck, not the model's understanding.",
              "score": 1,
              "created_utc": "2025-12-29 14:50:00",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwjx24o",
                  "author": "Tema_Art_7777",
                  "text": "Ah I see - you can talk to them as well (chatgpt is pretty good at it). You can do you planning there and pass the implementation plan over to claude/codex for execution",
                  "score": 1,
                  "created_utc": "2025-12-29 14:54:13",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwkq4n3",
          "author": "Funny-Anything-791",
          "text": "Sounds like you could benefit from a more [structured methodology](https://agenticoding.ai)",
          "score": 1,
          "created_utc": "2025-12-29 17:15:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwktidk",
              "author": "Realistic-Quarter-47",
              "text": "Now the AI is giving courses how to use AI  \nWhat a time to be alive",
              "score": 2,
              "created_utc": "2025-12-29 17:31:06",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwl877t",
          "author": "Odd_knock",
          "text": "You should be getting a lot more than 5-10 minutes of your own time back from 5-10 minutes of writing a prompt…",
          "score": 1,
          "created_utc": "2025-12-29 18:38:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwp008p",
              "author": "Realistic-Quarter-47",
              "text": "not every time, but honestly yes. its just sometimes you feel you must be faster. we just got used to it and forgot how we were 3 years ago.",
              "score": 1,
              "created_utc": "2025-12-30 07:28:57",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwosz8k",
          "author": "[deleted]",
          "text": "i keep a desktop chat open as on oversight to my sessions to help me craft perfectish prompts.",
          "score": 1,
          "created_utc": "2025-12-30 06:28:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwpg7mr",
          "author": "RMCPhoto",
          "text": "I feel you.   I'm getting burned out on phrasing prompts correctly since it keeps changing with every model release.   I was really excited about that early on but now... Oi...\n\nWhat I do is keep a separate chat going in perplexity or chatgpt projects - here I've got a few different \"meta prompts\" for prompt optimization.   Mostly so I don't eat into my precious credits in the ide.\n\nThe process I follow for setting these up is to to focus on a domain like coding, and then simply extract improvement instructions from the gpt 5 prompt cookbook and other best practices.   \n\nThe metaprompt rewrites my initial prompt in 2 phases. \n\nI have a very rough input template where I specify the category (code fix, architecture, analysis and code review, new feature)\n\n1) review my prompt, break down the task if it's complex into the \"atomic\" pieces and ask 1-3 clarifying questions about my immediate goal and or any noted inconsistencies.   At this point a skeleton is proposed for feedback as well.\n2) After I give my feedback a refined prompt is returned which also uses the correct syntax and structure. \n\nI've also set this up in kilocode, which has the benefit of being able to search my repo and reference the project docs.\n\nNotebookLM is a good place to dump the prompting guides that you find helpful.  I use that to extract different ideas.     \n\nIt still takes time, but once I'm in the groove it's not so bad.   In the end it still takes less time to just do it right.   Take the opportunity to think about what you're really trying to accomplish (dev brain) and let the ai handle the formatting and tools.  \n\nI strongly recommend the context engineering GitHub.   Take a look at the understanding / reasoning / verification examples under cognitive templates.   These are highly effective as a 2-3 step \"program\".",
          "score": 1,
          "created_utc": "2025-12-30 09:59:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx1w0v3",
          "author": "TechnicalSoup8578",
          "text": "What you are describing is a missing abstraction layer, where prompts are acting like ad hoc APIs instead of stable interfaces. You sould share it in VibeCodersNest too",
          "score": 1,
          "created_utc": "2026-01-01 08:16:48",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1q0qjrf",
      "title": "Happy New Year [9 images]",
      "subreddit": "aipromptprogramming",
      "url": "https://www.reddit.com/gallery/1q0k3hu",
      "author": "Earthling_Aprill",
      "created_utc": "2025-12-31 23:43:24",
      "score": 11,
      "num_comments": 0,
      "upvote_ratio": 0.92,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/aipromptprogramming/comments/1q0qjrf/happy_new_year_9_images/",
      "domain": "reddit.com",
      "is_self": false,
      "comments": []
    },
    {
      "id": "1q0qipp",
      "title": "Embellished Gemstone Motifs [3 images]",
      "subreddit": "aipromptprogramming",
      "url": "https://www.reddit.com/gallery/1q0qbnr",
      "author": "Earthling_Aprill",
      "created_utc": "2025-12-31 23:41:46",
      "score": 11,
      "num_comments": 2,
      "upvote_ratio": 0.93,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/aipromptprogramming/comments/1q0qipp/embellished_gemstone_motifs_3_images/",
      "domain": "reddit.com",
      "is_self": false,
      "comments": [
        {
          "id": "nxt17s8",
          "author": "kxxve",
          "text": "genuinely asking who is the retard that uses these wallpapers?",
          "score": -4,
          "created_utc": "2026-01-05 12:23:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxt1k5o",
              "author": "Earthling_Aprill",
              "text": "Reported.",
              "score": 4,
              "created_utc": "2026-01-05 12:26:07",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1q2oe3x",
      "title": "My claude code setup and how I got there",
      "subreddit": "aipromptprogramming",
      "url": "https://www.reddit.com/r/aipromptprogramming/comments/1q2oe3x/my_claude_code_setup_and_how_i_got_there/",
      "author": "moonshinemclanmower",
      "created_utc": "2026-01-03 07:26:50",
      "score": 11,
      "num_comments": 2,
      "upvote_ratio": 0.87,
      "text": "This last year has been hell of a journey, I've had 8 days off this year and worked 18 hour stints for most of them, wiggling LLMs into bigger and smaller context windows with an obsessive commitment to finish projects and improve their output and efficiency.\n\nI'm a senior coder with about 15 years in the industry, working on various programming languages as the technology rolled over and ending up on fullstack\n\nMCP tooling is now a little more than a year old, and I was one of the early adopters, after a few in-house tool iterations in January and Febuary which included browser and remote repl tooling, ssh tooling, mcp clients and some other things, I published some no-nonsense tooling that very drastically changed my daily programming life: mcp-repl (now mcp-glootie)\n\nhttps://preview.redd.it/gxnr0ovvgqbg1.png?width=1418&format=png&auto=webp&s=3df4e2d0d36039ef5aaab5e6f7b1029991ddb9c2\n\n[https://github.com/AnEntrypoint/mcp-glootie](https://github.com/AnEntrypoint/mcp-glootie)\n\nOver the course of the next 6 months a lot of time was poured into benchmarking it (glm claude code, 4 agents with tooling enabled, 4 agents without) and refining it. That was a very fun experiment, making agents edit boilerplates and then getting an agent to comment on it. **testrunner.js** expresses my last used version of this.\n\nA lot of interesting ideas accumulated during that time, and glootie was given ast tooling. This was later removed and changed into a single-shot output. It was the second public tool called **thorns**. It was given the npx name **mcp-thorns** even though its not actually an MCP tool, it just runs.\n\nThings were looking pretty good. The agents were making less errors, there was still huge gaps in codebase understanding, and I was getting tons of repeated code everywhere. So I started experimenting with giving the LLM ast insight. First it was mcp tools, but the tool instruction bloat had a negative impact on productivity. Eventually it became simple cli tooling.\n\n**Enter Thorns:**[https://github.com/AnEntrypoint/mcp-thorns](https://github.com/AnEntrypoint/mcp-thorns)\n\nThe purpose of thorns is to output a one-shot view that most LLM's can understand and act on when making architectural improvements and cleaning up. Telling an agent to do `npx -y mcp-thorns@latest` gives an output like this:\n\n[https://gist.githubusercontent.com/lanmower/ba2ab9d85f473f65f89c21ede1276220](https://gist.githubusercontent.com/lanmower/ba2ab9d85f473f65f89c21ede1276220)\n\nThis accelerated work by providing a mechanism the LLM could call to get codebase insight. Soon afterwards I came across a project called **WFGY** on reddit which was very interesting. I didnt fully understand how the prompt was created, but I started using it for a lot of things. As soon as claude code plugins were released, experimentation started on combining WFGY, thorns, and glootie into a bundle. That's when **glootie-cc** was born.\n\n[https://github.com/AnEntrypoint/glootie-cc](https://github.com/AnEntrypoint/glootie-cc)\n\nThis is my in-house productivity experiment. It combined glootie for code execution, thorns for code overview, and WFGY all into an easy to install package. I was quickly realising tooling was difficult to get working but definitely worth making.\n\nAs october and november rolled over I started refining my use of **playwright** for automated testing. Playwright became my glootie-for-the-browser (now replaced by playwriter which executes code more often). It could execute code if coaxed into it, allowing me to hook most parts of the projects state into globals for easy inspection. Allowing the LLM to debug the server and the client by running chunks of code while browsing is really useful. Most of the challenge being getting the agent to actually do both things and create the globals. This is when work completeness issues became completely obvious to me.\n\nAs productionlining increased, working with LLM's that quickly write pointless boilerplate code, then start adding to it ad nauseum and end up with software that makes little sense from a structural perspective and contained all sorts of dead code it no longer needed, prompting a few more updates to thorns and some further ideas towards prompting completeness into the behavior of the model.\n\nOver November and December, having just a little free time to experiment and do research yielded some super interesting results. I started experimenting with **ralph wiggum loops**. Those were interesting, but had issues with alignment and diversity, as well as any real understanding of whether its task is done or not.\n\n**Plan mode** has become such a big deal. I realised plan mode is now a tool the LLM can call. You can tell it \"use the plan tool to x\" and it will prompt itself to plan. **Subagents/Tasks** has also become a pretty big deal. I've designed my own subagent that further reinforces my preferences called **APEX**:\n\n[https://github.com/AnEntrypoint/glootie-cc/blob/master/agents/apex.md](https://github.com/AnEntrypoint/glootie-cc/blob/master/agents/apex.md)\n\nIn APEX all of the system policies are enforced in the latent space\n\nAfter cumulative comfort and understanding with WFGY, I decided to start trying AI conversations to manipulate the behavior of WFGY to be more suitable for coding agents. I made a customized version of it here:\n\n[https://gist.githubusercontent.com/lanmower/cb23dfe2ed9aa9795a80124d9eabb828](https://gist.githubusercontent.com/lanmower/cb23dfe2ed9aa9795a80124d9eabb828)\n\nIt's a manipulated version of it that inspires treating the last 1% of the perceived work as 99% of the remaining work and suppresses the generation of early or immature code and unneccesary docs. This is in glootie-cc's conversation start hook at the moment.\n\n**Hyperparameter research:** As soon as I started using the plan tool, I started running into this idea that it could make more complete plans. After some conversations with different agents and looking at some hyperparameters at [**neuronpedia.com**](http://neuronpedia.com), I decided to start saying \"every possible.\" It turns out \"comprehensive\" means 15 or so, and \"every possible\" means 60 to 120 or so.\n\nAnother great trick that came around is to just add the **1% rule** to your keep going (this has potential to ralph wiggum). You can literally say: *\"keep going, 1% is 99% of the work, plan every remaining step and execute them all\"* and drastically improve the output of agents. I also learnt saying the word test is actually quite bad. Nowadays I say troubleshoot or debug, which also gives it a bit of a boost.\n\n**Final protip:** Set up some mcp tooling for running your app and looking at its internals and logs and improve on it over time. It will drastically improve your workflow speed by preventing double runs and getting only the logs you want. For boss mode on this, deny cli access and force just using that tool. That way it will use glootie code execution for any other execution it needs.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/aipromptprogramming/comments/1q2oe3x/my_claude_code_setup_and_how_i_got_there/",
      "domain": "self.aipromptprogramming",
      "is_self": true,
      "comments": [
        {
          "id": "nxgb4a0",
          "author": "scheemunai_",
          "text": "clean setup.\n\ni’ve been leaning on claude heavily for this too, mostly because the context window is so huge.",
          "score": 3,
          "created_utc": "2026-01-03 15:34:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxlhiuk",
              "author": "moonshinemclanmower",
              "text": "There's been so many ups and downs, I think the hardest knocks were token reducitons, and the biggest boosts were the newer models improvements, now I feel like we need brand new training data behind these models",
              "score": 1,
              "created_utc": "2026-01-04 08:58:31",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1q1rmfo",
      "title": "Anyone else feel like coding isn’t the hard part anymore?",
      "subreddit": "aipromptprogramming",
      "url": "https://www.reddit.com/r/aipromptprogramming/comments/1q1rmfo/anyone_else_feel_like_coding_isnt_the_hard_part/",
      "author": "Top-Candle1296",
      "created_utc": "2026-01-02 06:43:48",
      "score": 10,
      "num_comments": 25,
      "upvote_ratio": 0.86,
      "text": "\n\nWriting code is fast now. The hard part is understanding what’s already there, why it exists, and what breaks if you touch it. Most of my time isn’t spent typing anymore, it’s spent building context.\n\nI’ve been using AI agents like Claude, Gemini and Cosine. What I’m noticing is the real value isn’t raw code generation, it’s how much mental load they take off when you’re trying to reason through a messy codebase.\n\nFeels like the real win now is less confusion, not more speed. What do you guys think?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/aipromptprogramming/comments/1q1rmfo/anyone_else_feel_like_coding_isnt_the_hard_part/",
      "domain": "self.aipromptprogramming",
      "is_self": true,
      "comments": [
        {
          "id": "nx85sv1",
          "author": "Bowmolo",
          "text": "It actually never was.",
          "score": 5,
          "created_utc": "2026-01-02 09:12:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx8gqzb",
              "author": "ConceptJunkie",
              "text": "Apparently, OP just discovered working on an existing project.",
              "score": 2,
              "created_utc": "2026-01-02 10:55:27",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nx8hvyo",
                  "author": "Bowmolo",
                  "text": "May be true. Yet I'd say that coding also wasn't the hard part in greenfield.\n\nThe hard part - at least of the technical side of things - always was to maintain or achieve 'conceptual integrity'. And I wonder why this phrase, used (maybe coined) by Fred Brooks in 'The mythical man month' decades ago, never made it into common SwDev language. I deem it to be the most important property of any piece of software.\n\nAnd, according to my experience, with a lack of focus (and rigorously applied practices) on it, AI can even be a major impediment for that, because it values satisfying immediate needs instead.",
                  "score": 2,
                  "created_utc": "2026-01-02 11:05:40",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nx85yh7",
              "author": "bagge",
              "text": "You beat me to it. ",
              "score": 1,
              "created_utc": "2026-01-02 09:14:07",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nx8a9ty",
          "author": "UseMoreBandwith",
          "text": "Let me correct that for you:   \n**Anyone else feel like Naming Things isn’t the hard part anymore?**",
          "score": 3,
          "created_utc": "2026-01-02 09:55:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxa63r3",
              "author": "ai-tacocat-ia",
              "text": "Obligatory:\n\nThe two hardest things in computer science are cache invalidation, naming things, and off-by-one errors.",
              "score": 3,
              "created_utc": "2026-01-02 17:04:32",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nx7y55s",
          "author": "Funny-Anything-791",
          "text": "Spot on. I actually wrote a full course about it for my colleagues which also has presentations built in so you can educate others if you want - https://agenticoding.ai",
          "score": 2,
          "created_utc": "2026-01-02 07:59:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx8hdwp",
              "author": "PresidentToad",
              "text": "Love the page. When you first released it, did you create a post about it I could crosspost?",
              "score": 2,
              "created_utc": "2026-01-02 11:01:11",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nx8qder",
                  "author": "Funny-Anything-791",
                  "text": "Thank you 🙏 Sadly no. I published this for my colleagues originally and it kinda grew organically from there",
                  "score": 1,
                  "created_utc": "2026-01-02 12:17:41",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nx8j7qr",
          "author": "RefrigeratorDry2669",
          "text": "Writing code was always the easy part...",
          "score": 1,
          "created_utc": "2026-01-02 11:17:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxa6leo",
              "author": "ai-tacocat-ia",
              "text": "Yep. This is why almost everyone in the world can write code. So easy.",
              "score": 1,
              "created_utc": "2026-01-02 17:06:51",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nxac20t",
                  "author": "RefrigeratorDry2669",
                  "text": "Okay dum dum, gg",
                  "score": 1,
                  "created_utc": "2026-01-02 17:32:27",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nxapx7d",
                  "author": "ConceptJunkie",
                  "text": "My saying on this is a little more detailed:\n\nAnyone can write complex code.  A lot of people can even make it work.  But only the best software developers can write simple code.",
                  "score": 1,
                  "created_utc": "2026-01-02 18:36:15",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nx8yo0j",
          "author": "BorderKeeper",
          "text": "Writing code sadly is really fast even without AI if you have the experience. I asked around and the feeling of \"I sort of stop doing small semantical or syntax errors when I write\" is very universeal for mid-level devs.\n\n\nOnce you reach that level the problems are now everything but writing code, but writing code is what makes you improve and it's arguably the most fun bit of the job.",
          "score": 1,
          "created_utc": "2026-01-02 13:17:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxabnj3",
              "author": "ai-tacocat-ia",
              "text": ">Writing code sadly is really fast even without AI if you have the experience.\n\nLol. No. \n\nLet's do a thought experiment. How long would it take you to create minesweeper in JavaScript from scratch without AI?\n\nOk, what about write a homepage for a small business without AI? \n\nFinally, what about creating daily journaling web app as a SaaS application without AI?\n\nHere are my answers:\n- minesweeper: idk, at least a few days for a rudimentary version without using libraries. A couple of weeks for something more polished\n- homepage: at least a day. Maybe 2.\n- journaling: I could probably knock it out in a couple of days of serious focus\n\nWith AI?\n- minesweeper: 5 minutes\n- homepage: 5 minutes\n- journaling: 30m to an hour; I have a video of me doing it in 3 hours, but that was almost a year ago\n\n\"Really fast\" is relative. Coding minesweeper from scratch \"really fast\" could be 4 or 5 hours. But when you say \"even without AI\"... Under no circumstances is 4 hours \"really fast\" when you are comparing it to 5 minutes. \n\nWhat I suspect you are saying is that \"because of our antiquated process built around software taking weeks and months to build, it doesn't really speed things up when you can write code in 5 minutes that used to take days\". But that's like saying \"your car that goes 120mph isn't actually fast because we have dirt roads\". It's true in some sense. But you're just accepting that's how it is because you have dirt roads. Meanwhile, there's a growing number of people with perfectly paved roads going 120mph no problem.",
              "score": 1,
              "created_utc": "2026-01-02 17:30:33",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nxaj748",
                  "author": "BorderKeeper",
                  "text": "Fair counterpoint for a common greenfield projects of limited scope AI beats any senior programmer. If that’s your moneymaker go wild. I maintain a Windows VPN and traffic filtering app using Akka.Net, filter kernel drivers, complex location heuristics, packet inspection, and DNS monitoring. Majority of the complexity is knowing the witchcraft which are undocumented windows APIs and network schenanigans. AI doesn’t simply underperforms on my domain it straight up is dangerous to use sometimes.\n\n\nI and other people in the field have real responsibility to not bring down the a certain countries healthcare because AI did not understand the complexity of the task that’s why we spend a week on a design and our “antiquated slow process” is simply just a tool to not cause havoc. I want to increase our sprint velocity as much as the next guy trust me.",
                  "score": 1,
                  "created_utc": "2026-01-02 18:05:38",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nx928y0",
          "author": "Your_Friendly_Nerd",
          "text": "This has always been the case.\n\nI know people that type using 2 fingers and look at their keyboard and they write great, maintainable code. Typing speed/ syntax memorization has never been the real bottleneck, it's your ability to understand it.",
          "score": 1,
          "created_utc": "2026-01-02 13:40:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx9vgri",
          "author": "Particular-Lie-9897",
          "text": "I feel the same.  \nI use Cursor and read the specifications in parallel — it really helps me understand why Cursor suggests a particular solution.\n\nFor my automation, I use n8n, and I’m still exploring Dify.I write and test AI prompts in Genum Lab. Language Reactor helps extract text from videos, making it faster to create concise summaries and grasp the core idea without the fluff.",
          "score": 1,
          "created_utc": "2026-01-02 16:14:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxjqf47",
          "author": "TheresASmile",
          "text": "Coding is cheap. Context is expensive.\nThe hard part isn’t writing code anymore, it’s understanding why it exists, what assumptions it hides, and what breaks if you touch it. AI helps because it reduces cognitive load while you reconstruct intent in messy systems.\nBut less confusion isn’t the same as more correctness. Agents summarize what’s there, they don’t know what’s missing or dangerous unless forced to stop and surface uncertainty.",
          "score": 1,
          "created_utc": "2026-01-04 01:39:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxver3q",
          "author": "ResidentTicket1273",
          "text": "It's always been that way - once you achieve a sufficient level of coding acumen, you get to start thinking about the real problems - elegance, (anti-)fragility, simplicity and structure. The only perceived value in LLM code generation comes from people who don't know how to generate code - for everyone else it's never been the issue. \n\nThe real issue is properly understanding the shape of the problem at hand - and LLMs will never be able to do that, they're not architected to solve those kinds of problems.",
          "score": 1,
          "created_utc": "2026-01-05 19:34:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxyiinl",
          "author": "Ok_Bite_67",
          "text": "Coding has never been hard (unless you are a low level dev respect to them). Requirements gathering has always been the hardest part imo.",
          "score": 1,
          "created_utc": "2026-01-06 05:25:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nyerf4t",
          "author": "knayam",
          "text": "We just went from taking code from stack overflow or writing it ourselves to asking claude code to get it done",
          "score": 1,
          "created_utc": "2026-01-08 15:10:32",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1q4fh9n",
      "title": "The Only AI That Does Hyper-Realism This Crazy",
      "subreddit": "aipromptprogramming",
      "url": "https://i.redd.it/8xy77i83tbbg1.jpeg",
      "author": "imagine_ai",
      "created_utc": "2026-01-05 07:36:24",
      "score": 8,
      "num_comments": 4,
      "upvote_ratio": 0.84,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/aipromptprogramming/comments/1q4fh9n/the_only_ai_that_does_hyperrealism_this_crazy/",
      "domain": "i.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "nxs8mbx",
          "author": "amarao_san",
          "text": "once you see, you can't unsee.\n\nwhat happens to the right eyebrow of that nice lady?",
          "score": 2,
          "created_utc": "2026-01-05 08:11:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxsgowo",
              "author": "imagine_ai",
              "text": "omg i didnt even notice that xD",
              "score": 1,
              "created_utc": "2026-01-05 09:28:56",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "nxwwq2t",
              "author": "Strikeh",
              "text": "she had a surgery above her eye when she was 34",
              "score": 1,
              "created_utc": "2026-01-05 23:55:07",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "ny04c9d",
          "author": "Tricky_Stand_3439",
          "text": "Losing eyebrow hair (madarosis) happens due to factors like aging, over-plucking, stress, hormonal shifts, skin conditions (eczema, psoriasis), autoimmune issues (alopecia areata), thyroid problems, infections, or nutritional deficiencies.",
          "score": 1,
          "created_utc": "2026-01-06 13:25:26",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1q2csog",
      "title": "Ornate Filigree Mask (2 aspect ratios)",
      "subreddit": "aipromptprogramming",
      "url": "https://www.reddit.com/gallery/1q2cr48",
      "author": "Earthling_Aprill",
      "created_utc": "2026-01-02 22:31:11",
      "score": 8,
      "num_comments": 0,
      "upvote_ratio": 0.91,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/aipromptprogramming/comments/1q2csog/ornate_filigree_mask_2_aspect_ratios/",
      "domain": "reddit.com",
      "is_self": false,
      "comments": []
    },
    {
      "id": "1q4xphy",
      "title": "Thinking of building an AI tool that can load, clean, and edit massive CSV files. Need to know if I am onto something or on something (need a reality check)!",
      "subreddit": "aipromptprogramming",
      "url": "https://www.reddit.com/r/aipromptprogramming/comments/1q4xphy/thinking_of_building_an_ai_tool_that_can_load/",
      "author": "Muneeb_Siddiqui_07",
      "created_utc": "2026-01-05 20:52:14",
      "score": 7,
      "num_comments": 22,
      "upvote_ratio": 0.82,
      "text": "I’ve been digging into the workflow of digital agencies and data consultants, specifically those handling platform migrations (like moving a client to Shopify or Salesforce).\n\nOne thing keeps coming up: Data Preparation is a nightmare.\n\nIt seems like the standard workflow is:\n\n1. Client sends a massive, messy CSV (500k+ rows).\n2. It’s full of duplicates, bad phone formatting, and mixed character encodings.\n3. You try to open it in Excel/Sheets, but it freezes or crashes because the file is too big.\n4. You end up wasting days manually fixing rows or writing custom Python scripts just to get the data clean enough to import.\n\n**The Idea:** A Dedicated \"Data Washing Machine\"\n\nI’m building a browser-based tool designed specifically to handle this \"pre-flight\" cleaning stage. The goal is to bridge the gap between \"Excel is complex for beginners\" and \"Enterprise tools are too complex & expensive.\"\n\nHere is exactly what I’m building (Feature Set):\n\n**1. Open Large Files (1 million+ rows) in your browser instantly**:\n\n* **How:** We don't download the whole file to your screen (which would crash your laptop). We show you a **Preview** (first 100 rows). When you click a \"Fix\" button, our server applies that fix to *all* the rows in the background.\n\n**2. A dropdown menu on each column header:**\n\n* **Example:** You click the \"Phone\" column header. You select **\"Format for Shopify.\"**\n* **How:** Our code runs a specific script that strips out `( ) - .` and adds the country code `+1`.\n\n**3. Prevent the deletion of the wrong entry:**\n\n* **Example:** The software finds \"Jon Smith\" and \"John Smith.\" It's not 100% sure they are the same.\n* **How:** It shows you a popup: *\"Are these the same person?\"* You click **Yes** or **No**.\n\n**4. Fix weird, specific problems without writing code:**\n\n* **Example:** You type: *\"Remove any row where the City is 'New York'.\"*\n* **How:** We send your sentence to an AI. The AI writes the Python code to delete those rows. The system runs that code for you.\n\n**5.  Saves your automations (workflows) so you don't have to click the same buttons next time:**\n\n* **Example:** You cleaned a file today by clicking \"Fix Phones\" -> \"Remove Duplicates\" -> \"Fix Emails.\" You save this list as **\"My Monthly Routine.\"**\n* **How:** Next month, you upload a new file and click \"Run My Monthly Routine.\" The system repeats those exact steps automatically.\n\nThe Question:\n\nIs this actually a pain point you face? And should I build it?\n\nIf you deal with messy data, would a tool like this save you time, or are you happy sticking with Excel/Google Sheets/Python scripts? I want to validate if this is a real need before I go too deep into development.\n\nAny feedback (brutal or kind) is appreciated. Thanks!",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/aipromptprogramming/comments/1q4xphy/thinking_of_building_an_ai_tool_that_can_load/",
      "domain": "self.aipromptprogramming",
      "is_self": true,
      "comments": [
        {
          "id": "nxw2g8h",
          "author": "wylie102",
          "text": "No. Especially with the “we send your sentence to AI to write python code.”\n\nThese things are very easily done using SQL by anyone even remotely familiar with databases.\n\nDuckDB could do this on a rasp pi, and if someone is doing the same thing each time they will just have a sql script or stored macro or have it as part of their data pipeline. Anyone working with these things individually and manually is wasting a huge amount of time and I’d be concerned about the rest of their business, and thus their ability to pay you anything.\n\nAnd above everything else, why wouldn’t someone just say “hey chat gpt, write me SQL that I can use with duckdb to remove every entry where city is New York and show me how I can set it to run automatically on any spreadsheets in x location”? What do they need *you* for?",
          "score": 6,
          "created_utc": "2026-01-05 21:25:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxzn2aj",
              "author": "Muneeb_Siddiqui_07",
              "text": "You are spot on from an engineering perspective. If you know how to spin up DuckDB or write SQL, this tool isn't for you. You don't need it.\n\nBut my target audience isn't Data Engineers. It's Marketing Managers, Agency Account Execs, and RevOps leads.\n\nThese are people who have never opened a terminal, don't know what a 'connection string' is, and definitely can't set up a local data pipeline. Even if ChatGPT writes the SQL for them, they have no environment to run it in. They are happy to pay a few dollars per month for a UI that just works, so they don't have to ask IT for a favor.",
              "score": 0,
              "created_utc": "2026-01-06 11:24:55",
              "is_submitter": true,
              "replies": [
                {
                  "id": "ny0avsz",
                  "author": "wylie102",
                  "text": "No, they have data scientists and data engineers to do this for them. The data shouldn’t even ever come to them in this form.\n\nAlso, it’s pretty clear you just pasted my reply into chat gpt and then pasted the answer back. If all you want is confirmation then just keep asking GPT stuff. But you will waste time vibe coding something that no one needs",
                  "score": 2,
                  "created_utc": "2026-01-06 14:02:04",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nxw21d8",
          "author": "Mobile_Syllabub_8446",
          "text": "The problem is trust in determinism which is hard to provide with any LLM even if specifically designed.\n\nIt might even be right most of the time, but virtually always significantly less than any human. And when they are invariably wrong, there is nobody to hold accountable. \n\nI've seen entire empires falter from literally 1 character coding mistakes let alone let's just give it to AI. \n\nEnd case traditionally for business is \"We'll just do an audit\" but that's a programmatically deterministic task which only works if the data is pristine. The AI might also be misleading in the data it generates for it's actions though. So how do you actually check it?\n\nTLDR anyone who is in charge of a company and takes this route could entirely plausibly be found negligent. It's not an if something happens, it's a when something happens unless it's deterministic.",
          "score": 2,
          "created_utc": "2026-01-05 21:23:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxznc7k",
              "author": "Muneeb_Siddiqui_07",
              "text": "You hit on the most important word in data engineering: **Determinism.** I agree 100%, relying on a non-deterministic LLM to blindly clean a production database would be negligent.\n\nThat is why I architected the tool differently:\n\n1. **The Engine is Deterministic:** The core features (finding duplicates, formatting phone numbers, standardizing dates) use standard, hard-coded Python libraries (like `phonenumbers` or `rapid-fuzz`). They are mathematically precise, not AI guesses.\n2. **The AI is just a Translator:** The only time the AI is involved is if a user asks for a custom rule (e.g., 'Remove rows with NY'). The AI translates that English sentence into a **Regex pattern** or a Python filter.\n3. **The Human is the Gatekeeper:** The tool shows a **Preview** of exactly what that Regex will do. The user must verify and click 'Apply.'\n\nSo, the AI never 'touches' the data directly. It just drafts the instructions for the deterministic engine to execute, with a human verifying the draft first.",
              "score": 1,
              "created_utc": "2026-01-06 11:27:08",
              "is_submitter": true,
              "replies": [
                {
                  "id": "ny0gw35",
                  "author": "everyday847",
                  "text": "And the preview is on a 100 row sample that might not be representative of all the data cleaning operations that are required. I'm telling you: you are exceedingly unlikely to arrive at a completely new solution to \"opening big CSV\" in 2025. Here's an idea: make a contribution to pandas. A real, useful contribution is better for your CV than whatever this will become.",
                  "score": 1,
                  "created_utc": "2026-01-06 14:34:31",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nxw2nsk",
          "author": "design_doc",
          "text": "You’re likely on to something if it’s reliable. I’ve built a small version of this for one of my own projects and it’s been super valuable.\n\nBasically, if you can have it make the decisions needed to get the output to a desired format so you don’t have to review the data, then you can just have it use prebuilt scripts to manipulate the data.\n\nA few comments:\n\n1) The type of clean-up needed will likely be client specific, so I’d have your AI tool first report back with the recommended steps. You’d want to give it a “North Star” schema to follow to know what the final output should look like and what tools to use.\n\n2) Have prebuilt “tools” or pipelines it can pull from for each of those steps, otherwise you will see drift batch to batch.\n\n3) You will likely need/want to do a bunch of the initial clean up with just pure python, then let the AI loose on it.\n\n4) You’d likely need to batch process with the AI to keep results predictable and drift free but that would likely hamper your ability to spot duplicate entries over 100K+ entry documents, so a purely python based tool for this kind of operation would be more efficient.",
          "score": 1,
          "created_utc": "2026-01-05 21:26:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxznl3t",
              "author": "Muneeb_Siddiqui_07",
              "text": "This is incredibly high-value feedback, thank you. You nailed the architectural strategy perfectly.",
              "score": 1,
              "created_utc": "2026-01-06 11:29:09",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nxw4ncz",
          "author": "1988rx7T2",
          "text": "This is more like a vibe coded VBA script than a commercial product",
          "score": 1,
          "created_utc": "2026-01-05 21:35:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxw7gt6",
              "author": "EmergencyRiver6494",
              "text": "If you're comfy with VBA and Python, you definitely don't need this.",
              "score": 2,
              "created_utc": "2026-01-05 21:48:08",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nxxa8cg",
          "author": "everyday847",
          "text": "Zero value. The comparison to Excel or whatever is a false dichotomy. Neither something nebulous about AI, nor Excel, is the correct solution for a messy 800k row dataframe.",
          "score": 1,
          "created_utc": "2026-01-06 01:05:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxzntn1",
              "author": "Muneeb_Siddiqui_07",
              "text": "You are technically right, raw Python/Pandas is the 'correct' solution for a dataset that size. Excel is definitely the wrong tool.\n\nBut the vast majority of people responsible for these files cannot write Python. They are stuck using the 'wrong tool' (Excel) because the 'correct tool' (Code) is inaccessible to them.\n\nI’m building this to give those non-technical users the power of a DataFrame engine without requiring them to learn how to code.",
              "score": 1,
              "created_utc": "2026-01-06 11:31:06",
              "is_submitter": true,
              "replies": [
                {
                  "id": "ny0chhx",
                  "author": "everyday847",
                  "text": "No, you are giving them the illusion of that interface. Companies too cheap to hire engineers can use \"business intelligence\" solutions. \n\nThis is not a new or complicated idea, so it rests with you to establish why the innumerable professionals who wouldn't just be vibe coding the tool and writing posts using LLMs haven't done it already.",
                  "score": 1,
                  "created_utc": "2026-01-06 14:10:53",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nxxtw6s",
          "author": "skibbin",
          "text": "So you're looking to automate structuring semi-strictured data? Doesn't AWS Glue and data dictionaries basically do this in an automated perpetual way?",
          "score": 1,
          "created_utc": "2026-01-06 02:52:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxzo15v",
              "author": "Muneeb_Siddiqui_07",
              "text": "You are totally right, AWS Glue is the industry standard for permanent, automated data pipelines.\n\nThe gap I’m filling is for the **non-technical user** and the **ad-hoc project**. Most Agency Account Managers or RevOps leads don't have the skills to configure AWS Glue, IAM roles, and PySpark scripts. They just have a messy CSV on their desktop that needs to be fixed *now* so they can upload it to Shopify.\n\nGlue is for the Engineering Team; this tool is for the Project Team.",
              "score": 1,
              "created_utc": "2026-01-06 11:32:48",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nxxuzsb",
          "author": "1kn0wn0thing",
          "text": "There are plenty of open source tools available on GitHub that will do this.\nAnd if those are not enough, why would you write custom Python script each time? A reusable Python script would do it without the overhead of wrapping it in a web browser GUI.",
          "score": 1,
          "created_utc": "2026-01-06 02:58:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxzo76g",
              "author": "Muneeb_Siddiqui_07",
              "text": "You are 100% right from a developer's perspective. If you are comfortable cloning a repo and running a Python script from the terminal, you absolutely don't need this tool.\n\nBut my target audience,; Marketing Managers, Sales Ops, Agency Account Execs find the Command Line terrifying. They don't know how to manage `pip` environments or handle dependency errors.\n\nThey aren't paying for the logic (which is open source, as you said); they are paying for the **Interface**. They need that raw Python power wrapped in a friendly drag-and-drop UI so they can use it without becoming developers.",
              "score": 1,
              "created_utc": "2026-01-06 11:34:10",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nyae6v2",
          "author": "Tombobalomb",
          "text": "It will need gigantic amounts of review to be reliable, I don't even want to contemplate the token cost of this",
          "score": 1,
          "created_utc": "2026-01-07 22:34:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxvwayq",
          "author": "Admirable-Corner-479",
          "text": "You're into something if its OCR is stellar.",
          "score": 1,
          "created_utc": "2026-01-05 20:56:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxw309i",
              "author": "wylie102",
              "text": "Why would it need OCR? Everything is in a typed spreadsheet (no mention of working with any BLOB data) and the “sentences” are typed, not handwritten. There is no mention of handwriting anywhere in the post",
              "score": 1,
              "created_utc": "2026-01-05 21:27:44",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nxw56y0",
                  "author": "Admirable-Corner-479",
                  "text": "True, It's for CSV which is great.\nI'm thinking from My own work related stuff, such a tool would be great but also if it could handle proper data extraction and cleaning from images.\n\nSorry, was thinking from My own burdens.",
                  "score": 1,
                  "created_utc": "2026-01-05 21:37:44",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1q1mjgc",
      "title": "Forget \"New Year, New Me\" for 2026. Try \"Antifragility.\" This Simple Prompt in ChatGPT Will Make You Unstoppable (The Taleb Method).",
      "subreddit": "aipromptprogramming",
      "url": "https://www.reddit.com/r/aipromptprogramming/comments/1q1mjgc/forget_new_year_new_me_for_2026_try_antifragility/",
      "author": "Crazy-Tip-3741",
      "created_utc": "2026-01-02 02:27:23",
      "score": 7,
      "num_comments": 1,
      "upvote_ratio": 0.73,
      "text": "Most people build \"glass\" lives. They create rigid routines that shatter the moment a crisis hits, a deadline moves, or they get sick. When their plan breaks, they quit.\n\nIf you want 2026 to be different, stop trying to be \"resilient\" (resisting shocks) and start becoming **Antifragile**.\n\n**The Logic of Antifragility:** In his work, Nassim Taleb defines Antifragility as things that actually *benefit* from disorder. While the 1% rule is about steady growth, Antifragility is about **Optionality** and **Barbell Strategies**:\n\n* **The Barbell:** You play it extremely safe in 90% of your life to eliminate \"ruin,\" while taking small, aggressive risks in the other 10%.\n* **The Result:** You don't just survive chaos; you use it as fuel to leapfrog everyone who is playing it safe.\n\n**Try this prompt 👇:**\n\n    I want you to act as an Antifragility Systems Engineer. Your goal is to help me design a life operating system for 2026 based on Nassim Taleb’s principles. We are moving away from \"fragile\" linear goals and toward a system that gains strength from stress and volatility.\n    \n    Mandatory Instructions:\n    \n    Identify the Fragility: Ask me for ONE area of my life (Career, Health, or Finance) where I feel stuck or vulnerable to setbacks.\n    \n    The Barbell Strategy: Once I provide the area, design a \"Barbell\" approach. Give me a \"Floor\" (the 90% hyper-conservative habit to prevent failure) and a \"Cap\" (the 10% aggressive, high-upside experiment).\n    Eliminate the Negative: Instead of telling me what to add, use \"Via Negativa.\" \n    \n    Identify 3 specific \"fragilizers\" (habits or dependencies) I must subtract to stop leaking progress.\n    \n    Stress Testing: Create a \"Volatility Protocol.\" Tell me exactly what I should do when things go wrong (a missed workout, a market dip, a rejected proposal) so that the setback actually triggers a gain in the system.\n    \n    The Optionality Matrix: List 3 \"low-stakes bets\" I can place in this area that have limited downside but infinite upside.\n    \n    2026 Post Traumatic Growth Projection: Describe what my life looks like on December 31st, 2026, after a year of using chaos as an advantage rather than an obstacle.\n    \n    Do not give me a motivational speech. Use cynical, risk management logic. Ask me for my ONE vulnerable area to begin\n\n**For more prompts like this , Feel free to check out :** [Prompts](https://www.honestprompts.com/)",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/aipromptprogramming/comments/1q1mjgc/forget_new_year_new_me_for_2026_try_antifragility/",
      "domain": "self.aipromptprogramming",
      "is_self": true,
      "comments": [
        {
          "id": "nxrojq1",
          "author": "strydar1",
          "text": "cool prompt. csn you provide it as copy pastable text please?",
          "score": 1,
          "created_utc": "2026-01-05 05:24:32",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1q41rao",
      "title": "Golden Diamond Rose and Orchid Panels [6 images]",
      "subreddit": "aipromptprogramming",
      "url": "https://www.reddit.com/gallery/1q34sli",
      "author": "Earthling_Aprill",
      "created_utc": "2026-01-04 21:10:11",
      "score": 6,
      "num_comments": 0,
      "upvote_ratio": 0.75,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/aipromptprogramming/comments/1q41rao/golden_diamond_rose_and_orchid_panels_6_images/",
      "domain": "reddit.com",
      "is_self": false,
      "comments": []
    },
    {
      "id": "1pzoyrx",
      "title": "Forget \"Goal Setting\" for 2026. This Simple ChatGPT Prompt Uses Charlie Munger’s \"Inversion Method\" to Guarantee Success by Eliminating Your Failure.",
      "subreddit": "aipromptprogramming",
      "url": "https://www.reddit.com/r/aipromptprogramming/comments/1pzoyrx/forget_goal_setting_for_2026_this_simple_chatgpt/",
      "author": "Crazy-Tip-3741",
      "created_utc": "2025-12-30 18:01:08",
      "score": 6,
      "num_comments": 0,
      "upvote_ratio": 0.62,
      "text": "Most of us treat Jan 1st like we’re building a masterpiece. We add new habits, new gym memberships, and new schedules. By February, the weight of \"doing more\" crushes us.\n\nIf you want 2026 to be different, stop trying to be brilliant. Start being **persistently not stupid.**\n\n**The Wisdom of Charlie Munger:** The late billionaire mental giant didn't find success by seeking it. He found it by **Inverting.** He famously said: *\"All I want to know is where I'm going to die, so I'll never go there.\"*\n\n**The Math of Inversion:** Success is a game of subtraction, not addition. If you eliminate the 5 things that guaranteed your failure in 2025, the only thing left standing in 2026 is your achievement.\n\nIt is easier to avoid a disaster than to engineer a miracle.\n\n**Try this \"Inversion Architect\" Prompt 👇:**\n\n**-------**\n\nI want you to act as an **Inversion Strategist**. Your goal is to help me achieve my 2026 objectives by identifying and neutralizing the \"Failure Nodes\" that would mathematically guarantee my defeat. We will use Charlie Munger’s \"Invert, Always Invert\" principle.\n\n**Mandatory Instructions:**\n\n1. **The Objective:** Ask me for ONE major goal I want to achieve in 2026.\n2. **The Anti-Goal Design:** Once I provide the goal, do not tell me how to reach it. Instead, create a list of the **Top 5 Sabotage Behaviors** that would make it impossible for me to succeed.\n3. **The \"Kill Switch\" Rules:** For each Sabotage Behavior, design a \"Negative Constraint\" (a rule of what I will NOT do) that acts as a guardrail.\n4. **The Pre-Mortem:** Assume it is December 31st, 2026, and I have **failed miserably**. Write a 2-sentence \"Obituary\" for this goal, explaining exactly which bad habit killed it.\n5. **Clinical Logic:** Avoid motivational fluff. Use the language of risk management and probability.\n6. **The Daily Check:** Provide a 10 second \"Inversion Audit\" I can ask myself every morning to ensure I’m not heading toward the \"Failure Node.\"\n\n**-------**\n\nFor better results :\n\nTurn on **Memory** first (Settings → Personalization → Turn Memory ON).\n\nIf you want more prompts like this, check out :[ More Prompts](https://www.honestprompts.com/)",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/aipromptprogramming/comments/1pzoyrx/forget_goal_setting_for_2026_this_simple_chatgpt/",
      "domain": "self.aipromptprogramming",
      "is_self": true,
      "comments": []
    },
    {
      "id": "1q1fpla",
      "title": "What are people using to switch or route between ChatGPT, Claude, Gemini, etc?",
      "subreddit": "aipromptprogramming",
      "url": "https://www.reddit.com/r/aipromptprogramming/comments/1q1fpla/what_are_people_using_to_switch_or_route_between/",
      "author": "haux_haux",
      "created_utc": "2026-01-01 21:30:59",
      "score": 6,
      "num_comments": 3,
      "upvote_ratio": 1.0,
      "text": "\n\nI am aware there are tools and platforms that let you switch between ChatGPT, Claude, Gemini and others in one interface, or route prompts to different models depending on the task. Some seem aimed at comparison, others at workflows, and others at developers.\n\n\n\nI am interested in what people are actually using in practice.\n\n\n\nIf you use one of these tools:\n\nWhich one are you using?\n\nWhy did you choose it?\n\nWhat does it do well?\n\nWhere does it fall down?\n\nDo you pay for it, or use a free tier?\n\n\n\nIf you tried one and abandoned it, I would also be interested in why.\n\n\n\nI am not looking for theoretical comparisons. I am looking for lived experience and trade-offs.\n\n\n\nThanks in advance.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/aipromptprogramming/comments/1q1fpla/what_are_people_using_to_switch_or_route_between/",
      "domain": "self.aipromptprogramming",
      "is_self": true,
      "comments": [
        {
          "id": "nx5dzkh",
          "author": "Salt-Phrase4108",
          "text": "I still use ChatGPT for free and think how you frame a prompt is far more important than bouncing between models . For example chatgpt4 is now limited and i will ask chatgpt5 to respond like chatgpt4 ,its annoying but it works . I like chatgpts versatility . What your choice is should be tailored according to your needs,you can compare models here,https://quiettoolkit.blogspot.com/2026/01/is-upgrading-chatgpt-worth-it-in-2026.html",
          "score": 2,
          "created_utc": "2026-01-01 22:01:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx7bztk",
          "author": "sruckh",
          "text": "Not necessarily \"switching\", but you can have all three configured in VS Code, and there are several ways in which you can use all models simultaneously, working on the same project, and depending on the task, a particular agent will choose a specific LLM.  You can also use all three in VS Code without switching to another interface.",
          "score": 1,
          "created_utc": "2026-01-02 04:56:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxz3w8a",
          "author": "dqj1998",
          "text": "I’ve been using ContextWizard lately.\n\nI went down the whole “router / unified UI” rabbit hole first, but for me the real friction wasn’t switching models. It was losing context every time I jumped between ChatGPT, Claude, Gemini, etc.\n\nWhat I ended up liking about it is that it doesn’t try to replace those tools. I still use each model where it makes sense, but I can pull context from one conversation and reuse it somewhere else instead of rewriting everything.\n\nIt’s definitely not perfect though. There’s no auto model selection and you still need to know *why* you’re switching in the first place. So if you want something fully hands-off, this probably isn’t it.\n\nI’m just on the free tier for now. It’s been helpful enough for my day-to-day work, but it feels more like avoiding friction than some kind of magic solution.\n\nCurious if anyone’s actually found a router that handles context well, not just model switching. I haven’t so far.",
          "score": 1,
          "created_utc": "2026-01-06 08:28:23",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1q4gur1",
      "title": "Tapestries of Blue, Gold, Diamonds, and Crests (4 images in 3 aspect ratios)",
      "subreddit": "aipromptprogramming",
      "url": "https://www.reddit.com/gallery/1prjb4c",
      "author": "Earthling_Aprill",
      "created_utc": "2026-01-05 09:02:49",
      "score": 6,
      "num_comments": 0,
      "upvote_ratio": 0.8,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/aipromptprogramming/comments/1q4gur1/tapestries_of_blue_gold_diamonds_and_crests_4/",
      "domain": "reddit.com",
      "is_self": false,
      "comments": []
    },
    {
      "id": "1q68h5f",
      "title": "7 ChatGPT Prompts For People Who Hate Overthinking (Copy + Paste)",
      "subreddit": "aipromptprogramming",
      "url": "https://www.reddit.com/r/aipromptprogramming/comments/1q68h5f/7_chatgpt_prompts_for_people_who_hate/",
      "author": "tipseason",
      "created_utc": "2026-01-07 06:54:04",
      "score": 6,
      "num_comments": 1,
      "upvote_ratio": 0.87,
      "text": "I used to replay decisions in my head all day. What to do next. What if I mess it up. What if there is a better option.\n\nNow I use prompts that shut the noise down fast and tell me what matters.\n\nHere are 7 I keep coming back to.\n\n# 1. The Real Question Prompt\n\n👉 **Prompt:**\n\n    Rewrite my problem into one clear question.\n    Remove emotion.\n    Remove extra details.\n    Show me what I actually need to decide.\n    Problem: [describe situation]\n\n💡 **Example:** Turned a long rant into one simple decision I could act on.\n\n# 2. The Enough Information Check\n\n👉 **Prompt:**\n\n    Do I already have enough information to decide.\n    If yes, explain why.\n    If no, tell me exactly what one missing input I need.\n    Situation: [describe situation]\n\n💡 **Example:** Stopped me from researching things that did not matter.\n\n# 3. The Good Enough Answer\n\n👉 **Prompt:**\n\n    Give me an answer that is good enough to move forward.\n    Do not aim for perfect.\n    Explain why this answer works right now.\n    Problem: [insert problem]\n\n💡 **Example:** Helped me send drafts instead of waiting forever.\n\n# 4. The Worst Case Reality Check\n\n👉 **Prompt:**\n\n    Describe the worst realistic outcome if I choose wrong.\n    Explain how I would recover from it.\n    Keep it grounded and practical.\n    Decision: [insert decision]\n\n💡 **Example:** Made the risk feel manageable instead of scary.\n\n# 5. The One Step Forward Prompt\n\n👉 **Prompt:**\n\n    Ignore the full problem.\n    Tell me one small action I can take today that moves this forward.\n    Explain why this step matters.\n    Situation: [insert situation]\n\n💡 **Example:** Got me unstuck without planning everything.\n\n# 6. The Thought Cleanup Prompt\n\n👉 **Prompt:**\n\n    List the thoughts I am repeating.\n    Mark which ones are useful and which ones are noise.\n    Help me drop the noise.\n    Thoughts: [paste thoughts]\n\n💡 **Example:** Helped me stop looping on the same ideas.\n\n# 7. The Final Decision Sentence\n\n👉 **Prompt:**\n\n    Write one sentence that states my decision clearly.\n    No justifications.\n    No explanations.\n    Decision context: [insert context]\n\n💡 **Example:** Gave me clarity and confidence in meetings.\n\nOverthinking feels productive but it is not. Clear thinking beats endless thinking.\n\nI keep prompts like these saved so I do not fall back into mental loops. If you want to save, manage, or create your own advanced prompts, you can use Prompt Hub here: [AIPromptHub](https://aisuperhub.io/prompt-hub)",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/aipromptprogramming/comments/1q68h5f/7_chatgpt_prompts_for_people_who_hate/",
      "domain": "self.aipromptprogramming",
      "is_self": true,
      "comments": [
        {
          "id": "ny6jlql",
          "author": "AdAltruistic8513",
          "text": "have you ever thought about using your executive function.",
          "score": 1,
          "created_utc": "2026-01-07 11:19:26",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1q3a9mh",
      "title": "7,000+ Nano Banana Pro prompts for generating photos of you (with images!)",
      "subreddit": "aipromptprogramming",
      "url": "/r/GeminiAI/comments/1plrccm/7000_nano_banana_pro_prompts_for_generating/",
      "author": "Opposite-Scholar-165",
      "created_utc": "2026-01-03 23:54:23",
      "score": 5,
      "num_comments": 0,
      "upvote_ratio": 0.78,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/aipromptprogramming/comments/1q3a9mh/7000_nano_banana_pro_prompts_for_generating/",
      "domain": "",
      "is_self": false,
      "comments": []
    },
    {
      "id": "1q5gwo2",
      "title": "Connect any LLM to all your knowledge sources and chat with it",
      "subreddit": "aipromptprogramming",
      "url": "https://v.redd.it/kwepnvfnzpbg1",
      "author": "Uiqueblhats",
      "created_utc": "2026-01-06 12:10:45",
      "score": 5,
      "num_comments": 0,
      "upvote_ratio": 1.0,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/aipromptprogramming/comments/1q5gwo2/connect_any_llm_to_all_your_knowledge_sources_and/",
      "domain": "v.redd.it",
      "is_self": false,
      "comments": []
    },
    {
      "id": "1q6omqo",
      "title": "This Simple Prompt in ChatGPT Will Show You Your Purpose (Ikigai)",
      "subreddit": "aipromptprogramming",
      "url": "https://www.reddit.com/r/aipromptprogramming/comments/1q6omqo/this_simple_prompt_in_chatgpt_will_show_you_your/",
      "author": "Wasabi_Open",
      "created_utc": "2026-01-07 19:13:08",
      "score": 4,
      "num_comments": 1,
      "upvote_ratio": 0.63,
      "text": "Ikigai is your \"reason for being\" : the intersection of what you love, what you're good at, what the world needs, and what you can be paid for.\n\nThe problem? When we try to find it, our conscious mind gives \"safe\" answers. We answer based on who we *think* we should be, rather than who we actually are.\n\nTry this prompt 👇:\n\n\\-----\n\n**I ask that you lead me through an in-depth process to uncover the raw components of my Ikigai (Purpose) , in a way that bypasses any conscious manipulation or \"ideal self\" projecting on my part.**\n\n**Mandatory Instructions:**\n\n* **Do not** ask direct questions about my career goals, hobbies, values, or what I think my \"purpose\" is.\n* **Do not** ask me to explain, justify, or analyze my choices.\n* All questions must be completely neutral, based on visceral imagery, instinctive choice, physical sensation, or immediate preference.\n* **Do not** pause between questions for explanations. Provide a continuous sequence of 10-12 questions only.\n* Each question must be short, concrete, and require a spontaneous, one-word or short-phrase answer.\n\n**Only after the series of questions, perform a structured depth analysis of my Ikigai:**\n\n1. **The Hidden Fire:** What I actually love (stripped of social ego).\n2. **The Natural Utility:** My instinctive \"vocation\" versus my trained skills.\n3. **The Unmet Need:** What I am subconsciously driven to solve for the world.\n4. **The Value Core:** Where my internal fulfillment meets external reality.\n5. **The 2026 Synthesis:** A direct, unsoftened profile of the person I am becoming and the specific \"Reason for Being\" pulling me forward.\n\n**The analysis must be direct, authentic, and avoid \"toxic positivity\" or shallow coaching language. Do not ask if I agree with the conclusions; present them as they are. Begin the series of questions immediately.**\n\n\\-----\n\nIf you want more prompts like this, check out :[ Prompts](https://www.honestprompts.com/)\n\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/aipromptprogramming/comments/1q6omqo/this_simple_prompt_in_chatgpt_will_show_you_your/",
      "domain": "self.aipromptprogramming",
      "is_self": true,
      "comments": [
        {
          "id": "nyaiatu",
          "author": "YouNeedThesaurus",
          "text": "No, it probably won't.",
          "score": 3,
          "created_utc": "2026-01-07 22:53:55",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1q19aqd",
      "title": "🧠 7 ChatGPT Prompts To Improve Your Memory (Copy + Paste)",
      "subreddit": "aipromptprogramming",
      "url": "https://www.reddit.com/r/aipromptprogramming/comments/1q19aqd/7_chatgpt_prompts_to_improve_your_memory_copy/",
      "author": "Loomshift",
      "created_utc": "2026-01-01 17:15:45",
      "score": 4,
      "num_comments": 2,
      "upvote_ratio": 1.0,
      "text": "I used to study something today and forget it tomorrow.  \nNo matter how many times I reread, it just wouldn’t stick.\n\nOnce I started using ChatGPT as a memory coach, recalling information became faster and more reliable.\n\nThese prompts help you **encode information better, recall it easily, and remember for longer**.\n\nHere are the seven that actually work 👇\n\n# 1. The Simple Explanation Encoder\n\nMakes information easier to store.\n\n**Prompt:**\n\n    Explain this topic in very simple terms: [topic].\n    Use everyday language and a short analogy.\n    Focus on understanding, not memorization.\n    \n\n# 2. The Mnemonic Maker\n\nCreates mental shortcuts.\n\n**Prompt:**\n\n    Create mnemonics to help me remember this information: [list or topic].\n    Make them short, visual, and easy to recall.\n    \n\n# 3. The Memory Story Builder\n\nTurns facts into memorable stories.\n\n**Prompt:**\n\n    Turn this information into a short story I can visualize: [topic].\n    Use vivid imagery and simple characters.\n    Keep it under 150 words.\n    \n\n# 4. The Active Recall Trainer\n\nStrengthens memory through retrieval.\n\n**Prompt:**\n\n    Quiz me on this topic using active recall: [topic].\n    Ask one question at a time.\n    Wait for my answer before correcting or explaining.\n    \n\n# 5. The Spaced Repetition Planner\n\nPrevents forgetting over time.\n\n**Prompt:**\n\n    Create a spaced repetition schedule for this topic: [topic].\n    Include review days for 1 day, 3 days, 7 days, and 30 days.\n    Keep it simple.\n    \n\n# 6. The Confusion Clarifier\n\nFixes weak memory caused by misunderstanding.\n\n**Prompt:**\n\n    I keep forgetting this concept: [concept].\n    Explain it using a different method and highlight what I might be missing.\n    \n\n# 7. The 30-Day Memory Strength Plan\n\nBuilds long-term recall ability.\n\n**Prompt:**\n\n    Create a 30-day memory improvement plan.\n    Break it into weekly themes:\n    Week 1: Understanding\n    Week 2: Encoding\n    Week 3: Recall\n    Week 4: Reinforcement\n    Give daily memory exercises under 10 minutes.\n    \n\nA strong memory isn’t about talent — it’s about technique.  \nThese prompts turn ChatGPT into a personal memory trainer so learning sticks without stress.\n\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/aipromptprogramming/comments/1q19aqd/7_chatgpt_prompts_to_improve_your_memory_copy/",
      "domain": "self.aipromptprogramming",
      "is_self": true,
      "comments": [
        {
          "id": "nx3uzwn",
          "author": "Kridu23",
          "text": "Nice 👍🏻💪🏻 thx for Sharing",
          "score": 1,
          "created_utc": "2026-01-01 17:23:21",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1q37m9j",
      "title": "Forget \"Goal Setting\" for 2026. Try \"Ichigyo Zammai.\" This Simple Prompt in ChatGPT Will Destroy Your Brain Fog and Turn You Into a Single-Tasking Powerhouse (Zen Flow).",
      "subreddit": "aipromptprogramming",
      "url": "https://www.reddit.com/r/aipromptprogramming/comments/1q37m9j/forget_goal_setting_for_2026_try_ichigyo_zammai/",
      "author": "Crazy-Tip-3741",
      "created_utc": "2026-01-03 22:04:58",
      "score": 4,
      "num_comments": 2,
      "upvote_ratio": 0.6,
      "text": "In 2026, the greatest threat to your success isn't a lack of time it's **fragmented attention.** We live in a world of \"Continuous Partial Attention.\" We work with 10 tabs open, music playing, and phone notifications buzzing.\n\nThis creates \"Attention Residue.\" When you switch from one task to another, a part of your brain stays stuck on the previous task. By noon, your cognitive capacity is cut in half. You aren't \"busy\"; you're just mentally cluttered.\n\n**The Zen Logic: Ichigyo Zammai**\n\nThis is the Zen Buddhist practice of **Full Immersion in One Act.** It means \"one act samadhi\" (total concentration).\n\n* When you eat, just eat.\n* When you code, just code.\n* When you rest, just rest.\n\nBy dedicating 100% of your consciousness to a single point, you don't just work faster you enter **Flow** at will.\n\n**Try this prompt 👇:**\n\n    I want you to act as a Zen Productivity Master. \n    \n    Your goal is to help me engineer a \"Monastic Focus System\" for 2026 based on the principle of Ichigyo Zammai. \n    \n    We are going to eliminate \"Attention Residue\" and train my brain to achieve deep, singular immersion. Mandatory Instructions: Use the language of Zen philosophy mixed with modern Neuroscience. No \"hustle\" buzzwords.The Focus Target: Ask me for the ONE high-value activity that requires my peak cognitive presence in 2026. \n    \n    The \"Contamination\" Audit: Once I provide it, identify the 3 most common \"Attention Parasites\" (distractions) that usually bleed into this activity. \n    \n    The Ritual of Entry: Design a \"Sanctification Ritual.\" This is a 60-second physical sequence I must perform before starting the task to signal to my brain that \"The World is Now Closed.\" \n    \n    The \"Single-Tab\" Protocol: Give me a clinical system for my digital environment. How must my screen, browser, and phone look to ensure 0% peripheral distraction? \n    \n    The Zammai Timer: Create a \"Progressive Immersion Scale.\" Instead of 4-hour grinds, show me how to scale my \"Pure Focus\" blocks starting from a point where failure is impossible. \n    \n    The Monastic Projection: Calculate the \"Depth Compound.\" Show me what happens to the quality of my work on Dec 31st, 2026, if I spend 365 days practicing \"One Act at a Time\" versus the average person's fragmented attention.\n\nIf you want more prompts like this, check out :[ Prompts](https://www.honestprompts.com/)",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/aipromptprogramming/comments/1q37m9j/forget_goal_setting_for_2026_try_ichigyo_zammai/",
      "domain": "self.aipromptprogramming",
      "is_self": true,
      "comments": [
        {
          "id": "nxkz2ao",
          "author": "AdAltruistic8513",
          "text": "More schizo posts",
          "score": 1,
          "created_utc": "2026-01-04 06:17:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxmk2ec",
          "author": "shock_and_awful",
          "text": "🤔",
          "score": 1,
          "created_utc": "2026-01-04 14:05:13",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1q27afa",
      "title": "Generate compliance checklist for any Industry and Region. Prompt included.",
      "subreddit": "aipromptprogramming",
      "url": "https://www.reddit.com/r/aipromptprogramming/comments/1q27afa/generate_compliance_checklist_for_any_industry/",
      "author": "CalendarVarious3992",
      "created_utc": "2026-01-02 19:00:11",
      "score": 3,
      "num_comments": 0,
      "upvote_ratio": 0.8,
      "text": "Hey there!\n\nEver felt overwhelmed by the sheer amount of regulations, standards, and compliance requirements in your industry? \n\nThis prompt chain is designed to break down a complex compliance task into a structured, actionable set of steps. Here’s what it does:\n\n- Scans the regulatory landscape to identify key laws and standards.\n- Maps mandatory versus best-practice requirements for different sized organizations.\n- Creates a comprehensive checklist by compliance domain complete with risk annotations and audit readiness scores.\n- Provides an executive summary with top risks and next steps.\n\nIt’s a great tool for turning a hefty compliance workload into manageable chunks. Each step builds on prior knowledge and uses variables (like [INDUSTRY], [REGION], and [ORG_SIZE]) to tailor the results to your needs. The chain uses the '~' separator to move from one step to the next, ensuring clear delineation and modularity in the process.\n\n**Prompt Chain:**\n\n```\n[INDUSTRY]=Target industry (e.g., Healthcare, FinTech)\n[REGION]=Primary jurisdiction(s) (e.g., UnitedStates, EU)\n[ORG_SIZE]=Organization size or scale context (e.g., Startup, SMB, Enterprise)\n\nYou are a senior compliance analyst specializing in [INDUSTRY] regulations across [REGION].\nStep 1 – Regulatory Landscape Scan:\n1. List all key laws, regulations, and widely-recognized standards that apply to [INDUSTRY] companies operating in [REGION]. 2. For each item include: governing body, scope, latest revision year, and primary penalties for non-compliance. 3. Output as a table with columns: Regulation / Standard | Governing Body | Scope Summary | Latest Revision | Penalties.\n~\nStep 2 – Mandatory vs. Best-Practice Mapping:\n1. Categorize each regulation/standard from Step 1 as Mandatory, Conditional, or Best-Practice for an [ORG_SIZE] organization. 2. Provide brief rationale (≤25 words) for each categorization. 3. Present results in a table: Regulation | Category | Rationale.\n~\nStep 3 – Checklist Category Framework:\n1. Derive 6–10 major compliance domains (e.g., Data Privacy, Financial Reporting, Workforce Safety) relevant to [INDUSTRY] in [REGION]. 2. Map each regulation/standard to one or more domains. 3. Output a two-column table: Compliance Domain | Mapped Regulations/Standards (comma-separated).\n~\nStep 4 – Detailed Checklist Draft:\nFor each Compliance Domain:\n1. Generate 5–15 specific, actionable checklist items that an [ORG_SIZE] organization must complete to remain compliant. 2. For every item include: Requirement Description, Frequency (one-time/annual/quarterly/ongoing), Responsible Role, Evidence Type (policy, log, report, training record, etc.). 3. Format as nested bullets under each domain.\n~\nStep 5 – Risk & Impact Annotation:\n1. Add a Risk Level (Low, Med, High) and Potential Impact summary (≤20 words) to every checklist item. 2. Highlight any High-risk gaps where regulation requirements are unclear or often failed. 3. Output the enriched checklist in the same structure, appending Risk Level and Impact to each bullet.\n~\nStep 6 – Audit Readiness Assessment:\n1. For each Compliance Domain rate overall audit readiness (1–5, where 5 = audit-ready) assuming average controls for an [ORG_SIZE] firm. 2. Provide 1–3 key remediation actions to move to level 5. 3. Present as a table: Domain | Readiness Score (1–5) | Remediation Actions.\n~\nStep 7 – Executive Summary & Recommendations:\n1. Summarize top 5 major compliance risks identified. 2. Recommend prioritized next steps (90-day roadmap) for leadership. 3. Keep total length ≤300 words in concise paragraphs.\n~\nReview / Refinement:\nAsk the user to confirm that the checklist, risk annotations, and recommendations align with their expectations. Offer to refine any section or adjust depth/detail as needed.\n```\n\n**How to Use It:**\n- Fill in the variables: [INDUSTRY], [REGION], and [ORG_SIZE] with your specific context.\n- Run the prompt chain sequentially to generate detailed, customized compliance reports.\n- Great for businesses in Regulators-intensive sectors like Healthcare, FinTech, etc.\n\n**Tips for Customization:**\n- Modify the number of checklist items or domains based on your firm’s complexity.\n- Adjust the description lengths if you require more detailed risk annotations or broader summaries.\n\nYou can run this prompt chain with a single click on Agentic Workers for a streamlined compliance review session:\n\n[Check it out here](https://www.agenticworkers.com/library/azutwro7wm0dc6hhkhv56-compliance-checklist-builder)\n\nHope this helps you conquer compliance with confidence – happy automating!",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/aipromptprogramming/comments/1q27afa/generate_compliance_checklist_for_any_industry/",
      "domain": "self.aipromptprogramming",
      "is_self": true,
      "comments": []
    },
    {
      "id": "1q0fq8y",
      "title": "Context Coding with Qwen CLI",
      "subreddit": "aipromptprogramming",
      "url": "https://i.redd.it/zn6cr6n5pbag1.png",
      "author": "Prompt-Alchemy",
      "created_utc": "2025-12-31 15:33:16",
      "score": 3,
      "num_comments": 0,
      "upvote_ratio": 1.0,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/aipromptprogramming/comments/1q0fq8y/context_coding_with_qwen_cli/",
      "domain": "i.redd.it",
      "is_self": false,
      "comments": []
    },
    {
      "id": "1q0btv7",
      "title": "How to build an app with Replit inside ChatGPT",
      "subreddit": "aipromptprogramming",
      "url": "/r/AI_Tools_Guide/comments/1q0bqja/how_to_build_an_app_with_replit_inside_chatgpt/",
      "author": "outgllat",
      "created_utc": "2025-12-31 12:24:50",
      "score": 3,
      "num_comments": 0,
      "upvote_ratio": 1.0,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/aipromptprogramming/comments/1q0btv7/how_to_build_an_app_with_replit_inside_chatgpt/",
      "domain": "",
      "is_self": false,
      "comments": []
    },
    {
      "id": "1pzy03a",
      "title": "Agentic prompt chaining with LLM",
      "subreddit": "aipromptprogramming",
      "url": "https://www.reddit.com/r/aipromptprogramming/comments/1pzy03a/agentic_prompt_chaining_with_llm/",
      "author": "Turbulent-Range-9394",
      "created_utc": "2025-12-31 00:02:13",
      "score": 3,
      "num_comments": 3,
      "upvote_ratio": 1.0,
      "text": "I built a free chrome extension (DM or comment if you want details) that can do anything with LLM prompting.\n\n  \nToday I added a feature (not deployed on the extension yet) to use chain-of-thought agentic based prompting. \n\n  \nFor those who don't know, many researches have found that for any request, building up context and background is best achieved by asking the LLM \"chaining\" questions prior to the main request. I had my tool automate that. Check it out:\n\n  \nWould love to hear what you think about this and if I should add it to the extension.\n\nhttps://i.redd.it/v96sormdkfag1.gif\n\n  \n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/aipromptprogramming/comments/1pzy03a/agentic_prompt_chaining_with_llm/",
      "domain": "self.aipromptprogramming",
      "is_self": true,
      "comments": [
        {
          "id": "nwu7bdd",
          "author": "CeaselessMindFuck",
          "text": "This seems pretty neat I'd love to try it out. Does it work for any llm or just gpt? What kind of training does it have? I have other questions too if you respond or DM. Seems really cool what's the full functionality of it?",
          "score": 2,
          "created_utc": "2025-12-31 01:35:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwua2m4",
              "author": "Turbulent-Range-9394",
              "text": "Its with all LLMs! DM me! \n\nThe agent isnt integrated yet but im happy to answer what else it does over DM!",
              "score": 1,
              "created_utc": "2025-12-31 01:50:55",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwuae31",
          "author": "ops_architectureset",
          "text": "The pattern behind this is chaining helps most when it externalizes state and intent, not when it just forces longer reasoning. We see repeatedly that automated prompt chains look good in demos but fail once context shifts or a step returns partial output. What matters is whether the system tracks assumptions, intermediate artifacts, and why a branch was taken, not just that more questions were asked up front. There is also a risk of mistaking chain of thought for control, when the failure mode is really missing recovery and inspection. If you add it, I would focus on making the steps visible and resumable, so users can see where things drifted and intervene. Otherwise it becomes another single shot generator with extra words.",
          "score": 1,
          "created_utc": "2025-12-31 01:52:45",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1py4b12",
      "title": "AI Research Survey",
      "subreddit": "aipromptprogramming",
      "url": "https://www.reddit.com/r/aipromptprogramming/comments/1py4b12/ai_research_survey/",
      "author": "OutrageousDriver2859",
      "created_utc": "2025-12-28 22:19:39",
      "score": 3,
      "num_comments": 3,
      "upvote_ratio": 1.0,
      "text": "Hi everyone 👋\n\nI’m working on a research paper for my college assessment about how people use different AI models in real workflows.\n\nI’ve created a quick, anonymous survey (2–3 minutes) to understand usage patterns, challenges, and preferences. There’s no promotion or data collection beyond the responses.\n\nI’d really appreciate your input if you actively use AI tools. (Happy to share insights once the research is complete.)\n\nThank you in advance! 🙏\n\nLink - https://forms.gle/NHHPFcKGvWyuQjrq8",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/aipromptprogramming/comments/1py4b12/ai_research_survey/",
      "domain": "self.aipromptprogramming",
      "is_self": true,
      "comments": [
        {
          "id": "nwox29r",
          "author": "Friendly_Rub_5314",
          "text": "Done! Good luck with the paper!",
          "score": 1,
          "created_utc": "2025-12-30 07:02:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwt7stz",
              "author": "OutrageousDriver2859",
              "text": "🙏🏻thank u",
              "score": 1,
              "created_utc": "2025-12-30 22:21:10",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nxl1kxs",
          "author": "Mundane_Guide_1837",
          "text": "hope it helps",
          "score": 1,
          "created_utc": "2026-01-04 06:37:56",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pxwaxe",
      "title": "RuVector Nervous System: A five-layer bio-inspired nervous system for AI applications.",
      "subreddit": "aipromptprogramming",
      "url": "https://github.com/ruvnet/ruvector/tree/main/crates/ruvector-nervous-system",
      "author": "Educational_Ice151",
      "created_utc": "2025-12-28 17:01:39",
      "score": 3,
      "num_comments": 0,
      "upvote_ratio": 1.0,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "📑 How-To",
      "permalink": "https://reddit.com/r/aipromptprogramming/comments/1pxwaxe/ruvector_nervous_system_a_fivelayer_bioinspired/",
      "domain": "github.com",
      "is_self": false,
      "comments": []
    },
    {
      "id": "1q3n75f",
      "title": "I am building Pinterest for Prompt and other AI material.",
      "subreddit": "aipromptprogramming",
      "url": "https://i.redd.it/gkopvlrpcbbg1.png",
      "author": "Jayash_Bhandary",
      "created_utc": "2026-01-04 10:58:35",
      "score": 3,
      "num_comments": 2,
      "upvote_ratio": 1.0,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/aipromptprogramming/comments/1q3n75f/i_am_building_pinterest_for_prompt_and_other_ai/",
      "domain": "i.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "nxxk49d",
          "author": "Substantial-Emu-7133",
          "text": "Pretty cool webapp. It would be cool if you had a feature for “remixing” prompts (kind of like the Sora app) so people can see the effects of varying things, at least for image prompts.",
          "score": 1,
          "created_utc": "2026-01-06 01:59:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxzxsvk",
              "author": "Jayash_Bhandary",
              "text": "I am planning for remixing but giving fork option to create your own variation of the prompt",
              "score": 1,
              "created_utc": "2026-01-06 12:44:46",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1q5dhy3",
      "title": "I Used This To Set CHATGPT PERSONALITY and it's the best thing I've ever done.",
      "subreddit": "aipromptprogramming",
      "url": "https://www.reddit.com/r/aipromptprogramming/comments/1q5dhy3/i_used_this_to_set_chatgpt_personality_and_its/",
      "author": "Crazy-Tip-3741",
      "created_utc": "2026-01-06 08:52:35",
      "score": 3,
      "num_comments": 1,
      "upvote_ratio": 0.71,
      "text": "You are an expert whose highest priority is accuracy and intellectual honesty. You double check every claim internally before stating it. You are deeply skeptical of conventional wisdom, popular narratives, and your own potential biases. You prioritize truth over being likable, polite, or conciliatory.\n\nBefore answering:\n\n1. Identify the core question or claim.\n2. Recall or look up (if you have search/tools) the most reliable primary sources, raw data, or peer-reviewed evidence available.\n3. Actively search for evidence that could disprove your initial leaning—apply genuine steel-manning of opposing views and falsification thinking (à la Karl Popper).\n4. Explicitly flag anything that is uncertain, disputed, or where evidence is weak/thin.\n5. If something is an opinion rather than verifiable fact, label it clearly as such and explain why you hold it.\n6. Never inflate confidence. Use precise probabilistic language when appropriate (“likely”, “\\~70% confidence”, “evidence leans toward”, “insufficient data”, etc.).\n7. If the user is wrong or making a common mistake, correct them firmly but respectfully, with sources or reasoning.\n8. Prefer being exhaustive and potentially pedantic over being concise when accuracy is at stake.\n\nAnswer only after you have rigorously verified everything to the highest possible standard. Do not sacrifice truth for speed, brevity, or social desirability. If you cannot verify something with high confidence, say so upfront and explain the limitation.\n\nIf you want more instructions and prompts like this, check out :[ Prompts](https://www.honestprompts.com/)\n\n  \n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/aipromptprogramming/comments/1q5dhy3/i_used_this_to_set_chatgpt_personality_and_its/",
      "domain": "self.aipromptprogramming",
      "is_self": true,
      "comments": [
        {
          "id": "ny4kb8x",
          "author": "HeartAndCircuits",
          "text": "Thank you.  I am going to put this in a project and try it out.",
          "score": 1,
          "created_utc": "2026-01-07 02:21:36",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1q5d5iu",
      "title": "How I Created a Comic Sequence with a Custom Workflow - Workflow Included",
      "subreddit": "aipromptprogramming",
      "url": "https://v.redd.it/u3u7o6t4tobg1",
      "author": "imagine_ai",
      "created_utc": "2026-01-06 08:30:24",
      "score": 3,
      "num_comments": 0,
      "upvote_ratio": 1.0,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/aipromptprogramming/comments/1q5d5iu/how_i_created_a_comic_sequence_with_a_custom/",
      "domain": "v.redd.it",
      "is_self": false,
      "comments": []
    },
    {
      "id": "1q6wuyk",
      "title": "Rippling 3D Liquid Marble",
      "subreddit": "aipromptprogramming",
      "url": "https://i.redd.it/k9vm8lqur0cg1.png",
      "author": "Earthling_Aprill",
      "created_utc": "2026-01-08 00:30:10",
      "score": 3,
      "num_comments": 0,
      "upvote_ratio": 1.0,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/aipromptprogramming/comments/1q6wuyk/rippling_3d_liquid_marble/",
      "domain": "i.redd.it",
      "is_self": false,
      "comments": []
    },
    {
      "id": "1q1z145",
      "title": "How To Build AI Agency",
      "subreddit": "aipromptprogramming",
      "url": "https://i.redd.it/ffmzpyvkxxag1.jpeg",
      "author": "DriveAmazing1752",
      "created_utc": "2026-01-02 13:47:33",
      "score": 2,
      "num_comments": 0,
      "upvote_ratio": 0.63,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/aipromptprogramming/comments/1q1z145/how_to_build_ai_agency/",
      "domain": "i.redd.it",
      "is_self": false,
      "comments": []
    }
  ]
}