{
  "metadata": {
    "last_updated": "2026-01-22 16:59:57",
    "time_filter": "week",
    "subreddit": "automation",
    "total_items": 20,
    "total_comments": 172,
    "file_size_bytes": 169344
  },
  "items": [
    {
      "id": "1qhz70k",
      "title": "Any automation tool for LinkedIn = guaranteed ban\" is technically wrong. What's the difference between Chrome extensions, cloud APIs, and standalone browsers",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qhz70k/any_automation_tool_for_linkedin_guaranteed_ban/",
      "author": "WittyWithIntent",
      "created_utc": "2026-01-20 11:57:55",
      "score": 78,
      "num_comments": 25,
      "upvote_ratio": 0.99,
      "text": "I keep seeing this take on Reddit that doesn't matter what tool you use, LinkedIn will detect ANY automation and ban you. this is wrong, technically\n\nI've been running LinkedIn outbound for B2B clients for a while and got curious enough to actually understand how these tools work under the hood. Turns out the type of technology matters way more than we realize. LinkedIn detects automation based on HOW the tool interacts with their platform. not all methods are equally visible. I know only 3 types of automation (if you know more, let me know):\n\n1. Extensions.\n2. Cloud based services\n3. Standalone browsers\n\nChrome **extensions** like Dux-Soup or Waalaxy inject JavaScript directly into LinkedIn's webpage. Every extension has a Chrome Store ID and local files. LinkedIn literally runs scripts to search for these IDs.\n\n**Cloud services l**ike Expandi, Dripify, Lemlist send API requests from remote servers. When you browse LinkedIn normally, your browser fires off tons of background requests - analytics, feed refreshes, notification checks. Cloud tools only send the bare minimum requests they need. LinkedIn can see your API traffic is incomplete compared to real users. Still they are harder to spot than extensions, but not impossible.\n\n**Standalone browsers** (LinkedHelper is the main one I know) work like a modified Chromium browser running locally. It uses LinkedIn like a normal browser would, but automated, it mimics mouse movements, randomized timing and other patterns of human behavior. LinkedIn detection systems are looking for specific technical fingerprints, and when it's a standalone browser, it's hard to distinguish from human. I'm not saying standalone browsers are undetectable or that you can't get banned using them, but the risk is different. From what I've heard you can't use your LinkedIn account from a different browser at the same time as your automation tool works, and you have limits to follow.\n\nIf you've've been banned, what were you using and what do you think the actual trigger was? trying to separate technical detection from just behavioral red flags\n\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qhz70k/any_automation_tool_for_linkedin_guaranteed_ban/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "o0nirnn",
          "author": "ThighHighlander",
          "text": "I used cloud(Expandi) for 8 months with zero issues then got banned. my friend uses extension (Waalaxy) for a year and he's fine. I think it's more random than you think",
          "score": 5,
          "created_utc": "2026-01-20 12:03:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0nlgs1",
              "author": "WittyWithIntent",
              "text": "what were your limits on Expandi? and was your friend's account older or more active?",
              "score": 1,
              "created_utc": "2026-01-20 12:23:15",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0onpht",
                  "author": "ThighHighlander",
                  "text": "I was doing like \\~40 a day, his account is older, like 6 years or so, and mine is 1 year",
                  "score": 2,
                  "created_utc": "2026-01-20 15:52:36",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0niaxq",
          "author": "WinkObsession",
          "text": "Сan't LinkedIn fingerprint the Chromium browser itself? like check for headless chrome indicators or automation flags?",
          "score": 3,
          "created_utc": "2026-01-20 12:00:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0nlelr",
              "author": "WittyWithIntent",
              "text": "I think the better standalone tools modify the Chromium core to remove those flags but honestly I don't know the specifics",
              "score": 2,
              "created_utc": "2026-01-20 12:22:50",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0np6zu",
                  "author": "SpawnPointDevops",
                  "text": "anti-detect browsers randomize canvas fingerprints and remove webdriver properties",
                  "score": 2,
                  "created_utc": "2026-01-20 12:48:40",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0nkq9a",
          "author": "vuzumja",
          "text": "I'm getting warnings about automation tools but I've literally NEVER used any. LinkedIn just keeps restricting me for no reason. anyone else getting false flags?",
          "score": 2,
          "created_utc": "2026-01-20 12:18:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0nlpjb",
              "author": "WittyWithIntent",
              "text": "yeah I've seen this happen. sometimes LinkedIn flags manual activity if you're doing high volume. what are you doing that might look automated?",
              "score": 1,
              "created_utc": "2026-01-20 12:24:56",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0oo5s0",
                  "author": "vuzumja",
                  "text": "just unfriending old connections, but maybe too much at a time",
                  "score": 1,
                  "created_utc": "2026-01-20 15:54:42",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0opvt2",
          "author": "Fergoose89",
          "text": "I'd only heard of linkedin helper. I think it all depends on how far you push the tool. If it will get picked up",
          "score": 2,
          "created_utc": "2026-01-20 16:02:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0t6fgk",
              "author": "WittyWithIntent",
              "text": "Linked helper, you mean? have you tried it yourself?\n\nyeah, it really depends on how you use any tool",
              "score": 1,
              "created_utc": "2026-01-21 06:07:11",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0tb2r3",
                  "author": "Fergoose89",
                  "text": "I used linkedin helper around 5 years ago. Got my account frozen on adding connections",
                  "score": 1,
                  "created_utc": "2026-01-21 06:46:03",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0tzzrh",
          "author": "Alpertayfur",
          "text": "This is a much more nuanced take than the usual “automation = instant ban” line, and you’re right — **the** ***how*** **matters a lot**.\n\nFrom what I’ve seen, LinkedIn’s enforcement is a mix of **technical fingerprints + behavioral signals**, not some magical automation detector. Extensions are the easiest to flag because they literally announce themselves. Cloud tools sit in an awkward middle ground — cleaner than extensions, but their traffic patterns often don’t look like a real browsing session.\n\nStandalone browsers are interesting because they blur that line. They behave like a full browser, generate “normal-looking” noise, and avoid obvious extension fingerprints. That doesn’t make them safe, but it *does* change the risk profile.\n\nOne thing I’d add: a lot of bans people blame on “automation” are actually **behavioral**:\n\n* sending too many connection requests\n* repeating the same copy\n* moving faster than any human ever would\n* logging in from multiple environments at once\n\nTech gets you noticed, behavior gets you flagged.\n\nIn most ban stories I’ve heard, it’s rarely one single thing — it’s automation *plus* aggressive patterns. Separating those two, like you’re trying to do here, is the right way to think about it.",
          "score": 2,
          "created_utc": "2026-01-21 10:38:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ni0n5",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-20 11:57:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0njyan",
          "author": "Oopsfoxy",
          "text": "you mentioned can't use LinkedIn from regular browser while automation runs. what if I need to check messages during the day?",
          "score": 1,
          "created_utc": "2026-01-20 12:12:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0nllrv",
              "author": "WittyWithIntent",
              "text": "you can use mobile app while automation runs on desktop. just not two desktop browsers logged in simultaneously",
              "score": 1,
              "created_utc": "2026-01-20 12:24:13",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0onvrq",
                  "author": "Oopsfoxy",
                  "text": "why is that? LinkedIn detects multiple desktop sessions?",
                  "score": 1,
                  "created_utc": "2026-01-20 15:53:24",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0rxnco",
          "author": "Interesting_Way_105",
          "text": "Our generalist Web Agent Chrome Extension, rtrvr.ai, has been working great on LinkedIn!\n\n20k+ users sending DM's, connection requests and even applying to pages of jobs on LinkedIn! Additionally, our extension can be triggered via API/MCP so can do research on ChatGPT and directly trigger actions, or trigger LinkedIn workflows from n8n! \n\nWe also use a DOM only approach so can take actions on multiple LinkedIn tabs in the background. Just give a sheet of names and ask for each person to add as LinkedIn collection.\n\nThe web agent approach allows a whole new action space as the existing Chrome Extension only allows for limited actions. We are super excited for this year as it will be a game changer for agentic automations!",
          "score": 0,
          "created_utc": "2026-01-21 01:22:57",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qe7lzb",
      "title": "Hot take from someone who works in AI automation: most teams are automating the wrong things.",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qe7lzb/hot_take_from_someone_who_works_in_ai_automation/",
      "author": "Better_Charity5112",
      "created_utc": "2026-01-16 05:38:34",
      "score": 68,
      "num_comments": 24,
      "upvote_ratio": 0.94,
      "text": "I work in automation for business, and lately I’ve been seeing the same problem over and over. Teams are racing to automate *front-facing* stuff, AI emails, AI ads, AI content, AI chatbots, while the internal workflow underneath is still held together by spreadsheets, memory, and Slack pings. So what happens? More output. Same chaos.\n\nLeads come in faster, but follow-ups still break.  \nCampaigns scale, but reporting is still manual.  \nAI writes content, but no one knows what actually shipped or converted.\n\nThe automation itself works. The system around it doesn’t. What actually creates leverage isn’t automating the flashy parts, it’s automating the boring internal handoffs nobody wants to touch because they “still work”. Ironically, those are the ones quietly eating the most time and causing the most errors.\n\nCurious if others are seeing the same thing: are people using AI to *move faster into broken systems* instead of fixing the systems first?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qe7lzb/hot_take_from_someone_who_works_in_ai_automation/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "nzw1hnk",
          "author": "VizNinja",
          "text": "I see people using Ai to automate things that would be better just using regular automation tools.  AI is one tool in the automation tool box. AI is not always the best tool.",
          "score": 30,
          "created_utc": "2026-01-16 08:58:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzw7zky",
              "author": "d-a-s-a-l-i",
              "text": "This is a very interesting point. People confuse automation with ai.\n\nA lot of automations shouldn’t depend on AI.",
              "score": 7,
              "created_utc": "2026-01-16 09:59:26",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o03dfgl",
                  "author": "blakeyuk",
                  "text": "Most automation.",
                  "score": 3,
                  "created_utc": "2026-01-17 12:14:04",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzw3z4b",
          "author": "Plastic_Brain8987",
          "text": "Deffo is the case. I've seen businesses trying to implement AI solutions into their business, but they're missing an important component, and that's their data foundation. AI is as only as good as the data you have. And most of the time, it's fragmented across systems and they don't have a complete view of their customers.\n\nWe have a data warehouse, tamed by our data team, so they AI we are using is producing us from great results. We are more about AI making decisions rather than just creating content for ads and emails. Taking care of our lifecycle marketing.",
          "score": 6,
          "created_utc": "2026-01-16 09:22:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzw4r5u",
          "author": "signal_loops",
          "text": "hard agree with this take. I see the same pattern everywhere  teams slap AI on top of broken processes and then wonder why everything still feels chaotic, just faster. automating emails, ads, or chatbots feels productive because it’s visible, but if the underlying system for routing leads, tracking ownership, updating statuses, or closing loops is manual and inconsistent, you’re just amplifying the mess. real leverage comes from fixing and automating the boring internal handoffs how data moves between tools, how decisions are recorded, how work progresses without relying on tribal knowledge or Slack nudges. until those foundations are solid, AI mostly helps teams sprint harder in the wrong direction instead of actually improving outcomes.",
          "score": 3,
          "created_utc": "2026-01-16 09:29:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzw9noz",
          "author": "Turbulent-Isopod-886",
          "text": "Yep, seeing the same.\n\nMost teams automate output before they automate flow. AI makes things faster, but broken handoffs and missing ownership stay broken.\n\nThe real leverage is boring internal stuff: routing, SLAs, state changes, visibility. Until that’s fixed, AI just amplifies chaos.\n\nThat’s where orchestration layers like Konnectify actually help.",
          "score": 3,
          "created_utc": "2026-01-16 10:14:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzwhhsw",
          "author": "Holiday-Draw-8005",
          "text": "Yeah, I see the same thing. It feels like the messy phase before a new order settles in.\n\nAgent writes, automation publishes. Agent analyzes, automation schedules. That combo works way better than pretending agents alone can run everything.",
          "score": 3,
          "created_utc": "2026-01-16 11:22:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzwezel",
          "author": "Beneficial-Panda-640",
          "text": " I completely agree. From my observations of how teams handle complex workflows, automating the flashy external-facing tasks often distracts from the internal chaos. Yes, AI can help scale things like content creation or customer interactions, but if the underlying systems for tracking, reporting, and cross-team coordination are still inefficient, it’s just amplifying the problems.\n\nI’ve seen teams overlook the internal handoffs, those messy workflows between departments or functions that rely on manual tracking and communication. These are the areas that, if automated properly, would create the most significant improvements in efficiency and reduce errors. Fixing those internal bottlenecks first can actually make external automation much more effective and sustainable.\n\nIt’s like automating a broken assembly line, it might move faster, but it won’t be any more reliable. Fixing the process foundation should come first.",
          "score": 2,
          "created_utc": "2026-01-16 11:01:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzx7r7t",
              "author": "hollee-o",
              "text": "Reporting! God, what a clusterfuck. Cross channel campaigns, segmentation, a/b testing cycles, and multiple platforms with shitty APIs…",
              "score": 2,
              "created_utc": "2026-01-16 14:08:42",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzwi2g9",
          "author": "Nina_Neverland",
          "text": "But that has been a problem long before AI, hasn't it? No one actually assessing what the company actually needs but everyone randomly making feature requests (often enough for unnecessary things or sometimes for something that's plain wrong).",
          "score": 2,
          "created_utc": "2026-01-16 11:26:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o00t3zt",
          "author": "Jaded0521",
          "text": "I'm a workflow consultant, so all I fix are the broken systems. And yeah, I see this with. I also see people trying to automate systems that are convoluted, as in, they really only need one app but they want to duct tape four apps together with zapier.",
          "score": 2,
          "created_utc": "2026-01-17 00:21:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o00yqdp",
              "author": "Agent_invariant",
              "text": "Yep - A lot of “automation” work is really just compensating for bad system boundaries.\nI see the same pattern: instead of simplifying the core workflow, people layer glue on top until Zapier becomes the de facto source of truth — and then wonder why things are brittle.\nWhat’s interesting is that once the underlying system has clear ownership of state and transitions, a lot of that duct tape just disappears. Fewer handoffs, fewer retries, fewer places for things to drift.\nMost of the wins come from making the boring parts explicit, not from adding more automation on top.",
              "score": 3,
              "created_utc": "2026-01-17 00:54:27",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o01c2mj",
          "author": "ops_architectureset",
          "text": "the pattern behind this is teams optimizing for visible output instead of failure reduction. what we see repeatedly is automation amplifying whatever is already broken underneath. if handoffs and ownership are unclear, ai just moves work faster into the same gaps. deflection or speed looks better, but repeat errors and rework quietly go up.",
          "score": 2,
          "created_utc": "2026-01-17 02:19:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzysum1",
          "author": "KevlarArmor",
          "text": "I've been automating our private cloud deployment since 5 years. From OS installation to the final private cloud on multiple nodes. All you need is to give it a few details and you'll have a private cloud deployed on your server or servers depending on how many there are. All under 2-3 hours. (It used to take a week to get all the right configs, details, manual entries and to perform manual steps.)\n\nOh, and it's hardware agnostic so it doesn't care what kinda server you're running on.\n\nWhen I give interviews for new jobs, they ask me about python modules, linux administration and bash syntax. I did use all of the above to make the automation possible but it's not like I remember the code or the proper syntax. Sometimes I took bits and pieces from the code that the senior developers used and Frankenstein'd my way out to maintain uniformity of code.\n\nI know people probably won't consider what I did as automation because there's no AI involved but I did what I needed with what scraps I had.",
          "score": 2,
          "created_utc": "2026-01-16 18:28:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o00a312",
              "author": "Bubbly_Possible9057",
              "text": "Only a tiny % of automation uses AI.",
              "score": 2,
              "created_utc": "2026-01-16 22:37:03",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzvdu5d",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-16 05:38:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzx7lwi",
          "author": "Particular-Bat-5904",
          "text": "I did make my chat gtp automation for daily tasks. Its a below 25MB bundle and can reproduce itshelf on ki aslong its technical allowed there. It engages in every one of my chat gtp random chats now.",
          "score": 1,
          "created_utc": "2026-01-16 14:07:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o036kje",
          "author": "techside_notes",
          "text": "This matches what I’ve seen too. Automating the visible stuff feels productive because it ships faster, but it often just amplifies whatever mess already exists underneath. If no one has clarified ownership, handoffs, or what “done” even means, AI just moves confusion around quicker. The boring internal workflows are uncomfortable to touch because they force decisions and tradeoffs. Once those are even slightly cleaner, a lot of automation becomes obvious and less fragile. Otherwise it’s just speed without direction.",
          "score": 1,
          "created_utc": "2026-01-17 11:15:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0bv8m0",
          "author": "MyysticOwl",
          "text": "All of the Above. AI is good, but not perfect. If managed right, it can fix broken systems, especially the good thinking models like Claude Opus and Gemini 3 Pro. But when not managed correctly / properly validated, they can create even more problems, pain, etc. As with everything, it's all about how it's used.",
          "score": 1,
          "created_utc": "2026-01-18 18:06:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0lg663",
          "author": "Ill-Bullfrog-5360",
          "text": "What is the problem we are trying to solve? Followed by 5 whys… pretty much solves this.., if you can not articulate that its a zombie project",
          "score": 1,
          "created_utc": "2026-01-20 02:33:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0lxjfz",
          "author": "Analytics-Maken",
          "text": "Totally agree with this. If the data is scattered across platforms, the output is based on incomplete information, and reporting is still manual, you're automating the wrong thing. Map where your business data lives, build a layer that pulls it all together automatically, ETL tools like Windsor ai do it easily. Once that's in place, smart decisions start, bottlenecks are identified and can be automated, and IA can be run on top.",
          "score": 1,
          "created_utc": "2026-01-20 04:11:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0zyljv",
          "author": "shwarma21",
          "text": "yep totally seeing that too, i’ve found the better approach is to map the workflow first, mark every human handoff or info delay, and only automate after those steps are cleaned up so the whole system actually flows instead of just moving the mess faster",
          "score": 1,
          "created_utc": "2026-01-22 05:41:10",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qh1tnk",
      "title": "What is an automation that surprisingly worked better than you expected?",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qh1tnk/what_is_an_automation_that_surprisingly_worked/",
      "author": "mumplingssmake",
      "created_utc": "2026-01-19 11:33:43",
      "score": 60,
      "num_comments": 45,
      "upvote_ratio": 0.98,
      "text": "I recently got into the world of automations for both my business and personally and have been super stoked about the whole subreddit as well!\n\nSo would love to hear from other experienced folks here, what is an automation that surprisingly worked better than you expected? Can be either a business or personal use case!",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qh1tnk/what_is_an_automation_that_surprisingly_worked/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "o0gl626",
          "author": "Ok-Macaron2516",
          "text": "Well I have setup an automation for our web flow website using Frizerly that uses search data from ours, and our competitors, news from google and our industry to then come up a weekly topic to post on our website as a blog every day. Once the topic is chosen, a blog is generated using an AI that has full context of our products, customer case studies etc and is sent to me for review! All I have to do is basically click publish after reviewing- this part itself can be removed and be fully automated but I prefer to do a quick edit to add some personal insights etc! The blog is also auto shared on Facebook and linkedin as well! Saves me and my team atleast 10 hours every week tbh! Has helped improve both our AI and Google search visibility as well!",
          "score": 23,
          "created_utc": "2026-01-19 11:37:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0lz8v7",
              "author": "spaarki",
              "text": "Nice!!!",
              "score": 2,
              "created_utc": "2026-01-20 04:21:39",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o0m7xqq",
              "author": "Odd-Home9599",
              "text": "That setup sounds insane and is basically free time unlocked every week.",
              "score": 2,
              "created_utc": "2026-01-20 05:19:04",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o0gvc6b",
              "author": "Expat-english-in-NZ",
              "text": "I would love to know how to do this - maybe i'll ask AI",
              "score": 3,
              "created_utc": "2026-01-19 12:55:06",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0j01gg",
                  "author": "Nervous_Disaster_707",
                  "text": "I agree. A write up / nudge to existing repo would be welcomed.",
                  "score": 4,
                  "created_utc": "2026-01-19 19:06:36",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0im75n",
          "author": "Sea_Dinner5230",
          "text": "We recently automated a task that used to take some manual hours and was pretty boring itself - documentation and user how-to guides creation, since before the ability to use AI technology, this was pretty time-consuming thing to do. Now it takes around 15 minutes. \n\nThe workflow is simple: record your screen of a task, workflow or feature walkthrough (even without audio) -> get a step-by-step guide with titles, descriptions, and contextual screenshots out of it automatically, auto-translate, and edit the output if needed as in a regular doc before final export or sending it to the user.\n\nThis automates the process and makes documentation much less painful, because you can start with a solid base and refine if needed instead of a blank page. We built our own tool based on this workflow.",
          "score": 6,
          "created_utc": "2026-01-19 18:05:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0l4opo",
              "author": "shebeerite",
              "text": "Can you provide more detail on how you created this? Did you use an off the shelf product or build something?",
              "score": 3,
              "created_utc": "2026-01-20 01:30:55",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0mb76g",
                  "author": "Sea_Dinner5230",
                  "text": "Of course! My friend is developer so we ended up building our own product from scratch, and later decided to make it public for others too. While building it, we found a few alternatives, but none of them fully covered what we needed, so we kept going. \n\nWe tested around 30 LLM models with different scenarios, narrowed it down to the 10 best, and then built a workflow around it that analyzes unique video frames with LLMs and combines everything into final docs. If you are interested you can check it yourself, it’s called video2docs, feel free to try it for your needs!",
                  "score": 5,
                  "created_utc": "2026-01-20 05:43:00",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o0mblrn",
              "author": "Junior-Fox-2262",
              "text": "That’s insane this used to take hours and now it’s basically done while you sip coffee.",
              "score": 2,
              "created_utc": "2026-01-20 05:46:06",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0mcdon",
                  "author": "Sea_Dinner5230",
                  "text": "Yes, exactly! That said, I still prefer to review the output carefully anyway. Depending on which LLM you use, there still might be some parts that need to be removed or refined slightly. But at the end of the day, it still saves a lot of time compared to writing everything manually.",
                  "score": 2,
                  "created_utc": "2026-01-20 05:52:04",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0gum57",
          "author": "vaenora",
          "text": "I was surprised how much better simple automations worked compared to the complex ones I overthought. Just small, well-timed nudges ended up having more impact than multi-step flows. Makes me wonder if timing matters more than sophistication.",
          "score": 4,
          "created_utc": "2026-01-19 12:50:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0l4fli",
              "author": "shebeerite",
              "text": "Timing and simplicity?",
              "score": 2,
              "created_utc": "2026-01-20 01:29:29",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0l9ntr",
                  "author": "Electrical_Heart_673",
                  "text": "Automly :)",
                  "score": 2,
                  "created_utc": "2026-01-20 01:58:18",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0h5u63",
          "author": "ExtensionBench7270",
          "text": "One that surprised me was a simple internal handoff automation.\n\nUsing a no-code platform like Konnectify, we automated how tasks move between teams, basically when X is done, the right person gets notified, context is attached, and the status updates automatically. No fancy AI, just clear rules.\n\nWhat surprised me wasn’t the tech, it was how much mental load it removed. Fewer “did you see this?” messages, fewer things falling through the cracks. Boring automation, huge payoff.",
          "score": 3,
          "created_utc": "2026-01-19 13:58:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0glb8k",
          "author": "thatsocialguy",
          "text": "Content recycling automation shocked me. Old posts get reshared or slightly reworded on a schedule. I assumed it would feel spammy, but most people never notice and engagement stayed solid.",
          "score": 8,
          "created_utc": "2026-01-19 11:39:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0gly48",
          "author": "FromBiotoDev",
          "text": "Tbh my own product lol, I automated translating shorthand workout notes into structured workout data so I could see my progress in the gym using LLMs. Took 7 months to get it working as expected, proof of concept took 5 minutes ofc.",
          "score": 2,
          "created_utc": "2026-01-19 11:44:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0gm2km",
              "author": "ForeverFellingTrees",
              "text": "Actually kinda need this, do you have a link?",
              "score": 2,
              "created_utc": "2026-01-19 11:45:18",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0gmcrq",
                  "author": "FromBiotoDev",
                  "text": "You can’t link websites here but it’s GymNotePlus on iOS App Store \n\nMade it for myself but surprisingly getting quite a lot of traction.",
                  "score": 2,
                  "created_utc": "2026-01-19 11:47:36",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0gqrdw",
          "author": "Still_Effective_8858",
          "text": "For me it was automating invoice tracking and payment reminders for my small business. I thought it’d just save time, but it cut late payments by nearly 70% and freed up hours weekly. Clients even say they prefer the consistent reminders over my old sporadic follow-ups",
          "score": 2,
          "created_utc": "2026-01-19 12:22:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0hiyif",
              "author": "Infamous-Number1563",
              "text": "Hey mate, mind sharing idea and example in DM? Would be happy to implement something similar :)",
              "score": 1,
              "created_utc": "2026-01-19 15:07:31",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0l94az",
                  "author": "Unique-Schedule-7013",
                  "text": "I have helped a client do something similar. I used google drive plus zapier. Another one I helped was using workato plus sharepoint. Used for invoice reminders and automated invoicing to customers. Let me know if you want to chat.",
                  "score": 1,
                  "created_utc": "2026-01-20 01:55:20",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0h4m21",
          "author": "ActiveDisaster1687",
          "text": "In my opinion, building complicated workflows doesn't work that well. I recently got tired of keeping up with information everywhere, so I switched to a service called Daigest that summarizes the latest news from my favorite spots. It's working much better for me.",
          "score": 1,
          "created_utc": "2026-01-19 13:52:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0hfqsj",
          "author": "signalpath_mapper",
          "text": "Order status automation, honestly. I was skeptical because customers still want a human when they’re anxious. But once we made the status actually accurate and proactive, ticket volume dropped way more than expected. The key was it pulling real carrier data and clearly flagging delays instead of pretending everything was fine. When customers saw honest updates without asking, they stopped flooding the inbox.",
          "score": 1,
          "created_utc": "2026-01-19 14:51:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0hwguc",
          "author": "Kim-Tan-2991",
          "text": "follow-ups + task handoffs after leads come in (i use vynta ai for ref). Early on id capture a lead and either forget to follow up or manually re-enter it into a CRM and sequence, and that’s where most potential falls through.",
          "score": 1,
          "created_utc": "2026-01-19 16:09:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0i73c5",
          "author": "imnotafanofit",
          "text": "I automated a daily summary of sales and website traffic to my inbox",
          "score": 1,
          "created_utc": "2026-01-19 16:57:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0joo2i",
          "author": "Relative_Scale2916",
          "text": "Expense capture. I didn’t expect it to matter much but once cards and receipts stopped needing follow ups, it saved more time than a lot of bigger automations we tried. We use Ramp for that and it just took a bunch of small tasks off our plate",
          "score": 1,
          "created_utc": "2026-01-19 21:00:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0kdo2s",
          "author": "seenmee",
          "text": "Automating logs and alerts. I thought it would just save clicks, but it actually changed how quickly issues got noticed and fixed. Turns out removing noise is more powerful than adding features.",
          "score": 1,
          "created_utc": "2026-01-19 23:04:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0l23ad",
          "author": "PH_Morpheus",
          "text": "GUI automations in general.\n\nIt seems pretty stupid to make a bot click on things for you. But you really can get a lot done with just that",
          "score": 1,
          "created_utc": "2026-01-20 01:16:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0xo4cc",
              "author": "Healthy_Let_4425",
              "text": "Do you have any examples? I was playing around with this at a previous role where I was doing a lot of repetitive work in Quickbooks, and couldn't help what people smarter than I were doing with this type of automation.",
              "score": 1,
              "created_utc": "2026-01-21 21:50:46",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0y4ie9",
                  "author": "PH_Morpheus",
                  "text": "I just implemented an integration between my client's ERP that has no way of retrieving data other than CSV files and my CRM.\n\nMy integration uses Selenium to log in as the user, download the spreadsheet for the data, compare it with yesterday's spreadsheet and send the difference to my CRM for integration.\n\nIt's stupid, but I does work .",
                  "score": 1,
                  "created_utc": "2026-01-21 23:11:31",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0lip5e",
          "author": "SomewhereSelect8226",
          "text": "In our case, we use Askyura to take care of the predictable stuff first.  \nThings like order tracking or stock availability get handled instantly when the data is clear. Refunds and exchanges only go through when the policy and order state fully line up, and product recommendations are kept pretty strict (rule-based, not free guessing). What helped us was putting clear confidence and rule boundaries. If the data doesn’t fully match or the request goes outside defined workflows, it escalates with context instead of forcing an answer.",
          "score": 1,
          "created_utc": "2026-01-20 02:47:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0m46ep",
          "author": "signalpath_mapper",
          "text": "Order status automation, done boringly well. We assumed customers wanted fancy chat flows, but what actually helped was a dead simple status lookup that pulled carrier data and showed delays proactively. During peak periods, that alone shaved a huge chunk of \"where is my order\" tickets. The key was accuracy and speed, not personality. When it worked, customers didn’t even think of it as automation, which was kind of the win.",
          "score": 1,
          "created_utc": "2026-01-20 04:53:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ma039",
          "author": "Wrong-Singer-2281",
          "text": "Insane, thanks OP",
          "score": 1,
          "created_utc": "2026-01-20 05:34:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0mh6i2",
          "author": "TruthSqr",
          "text": "Why do I feel like this post, and all the replies, were automated?",
          "score": 1,
          "created_utc": "2026-01-20 06:30:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0mjx3x",
          "author": "MattTheBusinessGuy",
          "text": "I do a lot of cold emailing and in return I have tried a lot of cold emailing software/websites. I found that over all of them, building your own automation using a software like zapier or make hits way harder than using done for you sites.",
          "score": 1,
          "created_utc": "2026-01-20 06:53:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0mo25j",
          "author": "StorySeeker68",
          "text": "This is a great question. The visual side of personal branding is under-discussed. Most people mix approaches: one real shoot for authenticity, then AI for variety and speed. The real shift is moving from “hoarding photos” to generating visuals on demand.",
          "score": 1,
          "created_utc": "2026-01-20 07:28:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0npnkt",
          "author": "LongjumpingSuit5615",
          "text": "Currently , I am learning how teams work in real world and to do that I basically met with one person a day   \nbut it becomes much harder to analyse the meeting as per our needs and to make a notes of it   \nso What I did is connected my notes takes fathom to n8n , now it gives me the key takes aways I want from each meeting in my google docs   \nso at the end of the week I just simply read that docs , no need to watch recordings and no need to take the fathom subscription as well",
          "score": 1,
          "created_utc": "2026-01-20 12:51:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0gkon2",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 0,
          "created_utc": "2026-01-19 11:33:43",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qeaqpm",
      "title": "Can SleekFlow really replace your CRM and live chat tools when using WhatsApp for customer support or are extra platforms still necessary?",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qeaqpm/can_sleekflow_really_replace_your_crm_and_live/",
      "author": "iDontwantOne-13",
      "created_utc": "2026-01-16 08:38:35",
      "score": 45,
      "num_comments": 6,
      "upvote_ratio": 1.0,
      "text": "We’ve recently started testing WhatsApp as our primary customer support channel and are using SleekFlow to manage the conversations. On paper, it looks like it can act as both a CRM and a live chat tool, shared inbox, contact profiles, basic automation, tagging, etc. It feels more like a lightweight CRM layer combined with a shared inbox rather than a full CRM replacement. But I’m curious about real-world usage.  \nFor those who’ve tried SleekFlow or similar WhatsApp automation tools:  \nDid it actually replace your CRM and live chat stack?  \nWhere did it fall short?  \nAny hidden limitations with scaling, reporting, automation rules, or team workflows?  \nWould love to hear what worked, what didn’t and whether you ended up adding extra tools anyway.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qeaqpm/can_sleekflow_really_replace_your_crm_and_live/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "o0927nd",
          "author": "ruhila12",
          "text": "We started using SleekFlow to manage WhatsApp leads and it significantly reduced our manual work. While it doesn’t fully replace our CRM it integrates smoothly with it making lead tracking much easier. For early-stage teams that don’t need complex sales pipelines yet SleekFlow is honestly more than enough to handle daily communication and customer management.",
          "score": 2,
          "created_utc": "2026-01-18 06:49:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o094hhb",
          "author": "Own_Inspection_9247",
          "text": "Same boat here. Using WhatsApp for support feels natural for customers but tracking follow-ups became messy until we added SleekFlow. Still keep a lightweight CRM for sales pipeline though.",
          "score": 2,
          "created_utc": "2026-01-18 07:09:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0zm6p5",
          "author": "Suspicious_Candy9048",
          "text": "\n\nWe switched to SleekFlow last year because juggling live chat, CRM and WhatsApp was killing productivity. Now everything sits in one place, which is a huge relief. That said, once your team grows, you’ll start feeling the need for advanced analytics and custom workflows.",
          "score": 2,
          "created_utc": "2026-01-22 04:15:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzvzb1b",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-16 08:38:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0rzq7c",
          "author": "shanej127",
          "text": "SleekFlow works great as a shared inbox and automation layer but if you need deep reporting or deal tracking you’ll still want a proper CRM alongside it.",
          "score": 1,
          "created_utc": "2026-01-21 01:34:53",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qe4ska",
      "title": "10 AI tools I'm taking with me into 2026",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qe4ska/10_ai_tools_im_taking_with_me_into_2026/",
      "author": "Dull_Noise_8952",
      "created_utc": "2026-01-16 03:18:44",
      "score": 41,
      "num_comments": 25,
      "upvote_ratio": 0.9,
      "text": "New year so figured I'd share the tools that actually stuck around after trying way too much stuff last year. These are the ones I genuinely use not just installed once and forgot about.\n\nCursor for coding assistance. Tried alternatives but kept coming back. The tab completion just works.\n\nn8n for automations. Self hosted it and forgot about it which is exactly what I want.\n\nLangsmith for tracing LLM calls. Saved me so many times when something breaks and I need to see what happened.\n\nVellum for ai agents. Got frustrated with how challenging other tools were, and this experience was 10x better Granola for meeting notes. Not perfect but good enough that I stopped taking notes manually.\n\nPlaywright for browser automation. Tried the AI wrappers but they added complexity without much benefit.\n\nPinecone for vector stuff. Tried self hosting but the maintenance wasnt worth it at my scale.\n\nLogsnag for simple monitoring. Sends me a ping when things happen without setting up a whole observability stack.\n\nClaude directly in the app for quick scripts. Faster than spinning up a project for something I'll run once.\n\nNotion with their AI features for docs. Not groundbreaking but having everything in one place matters. Although very pricey, and I could potentially do the same thing with ChatGPT\n\nWhat tools survived your 2025 culling?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qe4ska/10_ai_tools_im_taking_with_me_into_2026/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "nzy42u6",
          "author": "Electrical_Heart_673",
          "text": "I would say you should add Automly.pro. It builds scenarios for you automatically and it lowkey makes the process 1000x easier if you use Make.\n\n  \nUnfortunately, it doesn't do n8n or zapier though.",
          "score": 2,
          "created_utc": "2026-01-16 16:38:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzyocgp",
          "author": "Similar-Kangaroo-223",
          "text": "Here are the five that survived my 2025 culling:\n\n1. Gemini: for general tasks that I used to do with GPT. Also Gemini in Chrome and Nano Banana for image generations.\n2. Claude: for high level decision making and planning.\n3. Cursor: for coding and building my product\n4. NotebookLM: for learning and reading\n5. CapCut: for video editing\n\nI mean I tried 100+ hyped apps like Series, Lovable, Gamma, Perplexity, Manus, Genspark, Captions, Opusclip, and so on, but I find myself only using those 5 on a daily or weekly basis.",
          "score": 2,
          "created_utc": "2026-01-16 18:08:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzutheh",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 2,
          "created_utc": "2026-01-16 03:26:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o00b3yg",
              "author": "SnoopTiger",
              "text": "Dm me please!",
              "score": 2,
              "created_utc": "2026-01-16 22:42:12",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o08xzvk",
              "author": "AttentionSeeker__",
              "text": "DM",
              "score": 2,
              "created_utc": "2026-01-18 06:13:56",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nzuywi2",
              "author": "applebook366",
              "text": "Let me have a look as well plz!",
              "score": 2,
              "created_utc": "2026-01-16 03:59:03",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nzuv15a",
              "author": "CarefulIndication988",
              "text": "Yes, please.",
              "score": 1,
              "created_utc": "2026-01-16 03:35:51",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nzv099f",
              "author": "zencola",
              "text": "I'd like to know how you target high engagement videos",
              "score": 1,
              "created_utc": "2026-01-16 04:07:28",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzus24y",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-16 03:18:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzuwxt2",
          "author": "Glad_Appearance_8190",
          "text": "that was an interesting list.....the ones that stuck for me were mostly the boring ones that dont surprise me anymore. anything that quietly runs for months without me babysitting it feels like a win. ive ditched a lot of shiny ai tools just because when something went wrong i had no idea why. tracing and simple monitoring end up mattering more than fancy features once the novelty wears off...",
          "score": 1,
          "created_utc": "2026-01-16 03:47:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzvndvq",
          "author": "Minttzie",
          "text": "I realized that I've started to use Gemini over ChatGPT more often for content. \n\nFor my site, I use Jotform AI agents to collect feedback and for customer service.\n\nI'm also trying out some n8n automations.",
          "score": 1,
          "created_utc": "2026-01-16 06:53:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzwr7ck",
          "author": "ManufacturerBig6988",
          "text": "Interesting list. The common thread I see in the ones that survive is visibility when things go wrong, not just speed when they work. Tracing and simple monitoring age better than flashy agent layers, especially once edge cases show up in real workflows. From a support and ops angle, anything that makes it easier to answer what happened and why usually earns its keep. Tools that hide failure modes tend to feel great for a month and then quietly create cleanup work. Curious which of these actually reduced rework for you versus just feeling nicer to use.",
          "score": 1,
          "created_utc": "2026-01-16 12:33:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzxdogg",
          "author": "Hereemideem1a",
          "text": "If you liked Granola, you might want to check out Vomo. I switched to it for meeting notes",
          "score": 1,
          "created_utc": "2026-01-16 14:38:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o10crry",
          "author": "Designer-Fan-5857",
          "text": "I went through a big tool cull too, and Gamma survived, love how it turns ideas into polished presentations without fighting with formatting. Saves me a ton of time.",
          "score": 1,
          "created_utc": "2026-01-22 07:39:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzuvj4z",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 0,
          "created_utc": "2026-01-16 03:38:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzy3tgn",
              "author": "Electrical_Heart_673",
              "text": "In my opinion, instead of learning N8N, I think you should try to switch over to Make and use Automly.pro. I tried to learn automation and build something for a client but it takes way too long bro. So I would say just se the free plan on Automly and build the scenarios you want on there.",
              "score": 1,
              "created_utc": "2026-01-16 16:37:47",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nzv3sqh",
              "author": "pmjdang",
              "text": "Use it alongside Gemini. I learned quite a bit in a few days. Built a workflow to autofill pdf fillable forms and docx form from Airtable. Gemini worked better than gpt",
              "score": 1,
              "created_utc": "2026-01-16 04:30:02",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nzv1ds7",
              "author": "Different-Bridge5507",
              "text": "relay.app for me has been a huge unlock. Basically does the same as n8n but you can use natural language prompting to build it.",
              "score": 0,
              "created_utc": "2026-01-16 04:14:33",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nzw2gh6",
              "author": "Turbulent-Isopod-886",
              "text": "n8n can definitely feel overwhelming at first because it’s so flexible.\n\nFor learning it, I’d start with step-by-step stuff like the official n8n YouTube tutorials and beginner walkthroughs that build simple workflows before branching out.\n\nBut if you’re loving Notion AI and want something more approachable for real business automation without the steep learning curve, also check out Konnectify. It lets you build and manage automations across Notion, Google Workspace, Shopify/eBay tools, and others with clearer logic and visibility, without needing to wire up complex nodes manually.\n\nStart with simple triggers and actions, learn the patterns in n8n, then use tools like Konnectify to orchestrate your key workflows without the friction.",
              "score": 0,
              "created_utc": "2026-01-16 09:07:50",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qi7fbc",
      "title": "Automating work is easy, knowing what to automate is still weirdly hard",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qi7fbc/automating_work_is_easy_knowing_what_to_automate/",
      "author": "sympathetically_mons",
      "created_utc": "2026-01-20 17:28:52",
      "score": 38,
      "num_comments": 12,
      "upvote_ratio": 0.74,
      "text": "Automating things isn’t really the hard part anymore. Tools are everywhere, setup is fast, and half the time it feels like you’re just connecting boxes.\n\nWhat still feels oddly difficult is deciding what’s actually worth automating. I’ve definitely fallen into the trap of automating stuff just because I could. Research steps, enrichment, handoffs, little checks that used to be manual. Some of it genuinely saves time. Some of it just creates cleaner looking chaos. I bounce between a few tools depending on the workflow. I use Clay a lot for upstream research and signals, Notion to keep things visible, Zapier for glue work, and HubSpot as the system of record. None of them are the problem on their own.\n\nThe tricky part is that bad automation doesn’t feel broken right away. It feels productive. Stuff moves, tasks disappear, dashboards look nicer. Then a week later you realize you’re reviewing outputs that didn’t need to exist, or worse, trusting something you shouldn’t have. Lately I’ve been trying to be more intentional about where automation stops and where judgment actually matters. Less about how much I can automate, more about whether the step creates leverage or just saves a few clicks.\n\nCurious how others here think about this. How do you decide what stays manual on purpose vs what gets automated without thinking too hard about it.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qi7fbc/automating_work_is_easy_knowing_what_to_automate/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "o0pgr9f",
          "author": "reaictive",
          "text": "Yes, exactly, the key point in automation is really knowing when it actually makes sense to use it. Here’s how I usually decide what to automate to make sure automation is actually effective:\n\n1 .  Simple rule: automate the flow, not the decision\n\nThe idea is that automation works best when the process is repetitive, predictable, and follows a clear workflow.\n\nSo it makes sense to automate things where:\n\n* there’s a clear path (“if A → do B”)\n* there are very few unknowns or unexpected turns\n* mistakes aren’t expensive\n* the output is easy to verify\n\nBut decisions that involve a lot of nuance, risk, and context are better left to a human.\n\nFor example, you can automate:\n\n* data collection / moving information between systems\n* reminders / statuses / syncing\n* “draft-level” classification (tags, categories, priority)\n\n2 . The “leverage test”: does it create leverage or just save 3 clicks?\n\nIf an automation:\n\n* speeds up the cycle (lead → meeting → payment)\n* reduces losses (missed calls / forgotten leads)\n* improves quality (fewer mistakes / higher conversion) then it’s worth doing.\n\nIf it just “looks nice” but adds another layer of checking, it usually doesn’t bring real value, it’s basically what you said: “clean-looking chaos.”\n\nHope this helps! Feel free to ask if you have any other questions.",
          "score": 13,
          "created_utc": "2026-01-20 18:06:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0phtj9",
              "author": "quantumjedi",
              "text": "I'm 100% stealing \"automate the flow, not the decision\"",
              "score": 9,
              "created_utc": "2026-01-20 18:11:29",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0pr4pk",
          "author": "MuffinMan_Jr",
          "text": "So there's this really cool thing that most people in automation dont know about, because its pretty reserved for enterprises. Its called process mining.\n\nBasically you collect logs and timestamps of events from the tools that teams use and use that data to show you where things are inefficient. It will automatically map out the process and basically tell you exactly where you should be looking.\n\nSince most process mining tools are pretty expensive, I built my own that works pretty well. Considering opening it up to the public. \n\nYou could easily do something similar yourself with airtable and whatever automation tool of choice",
          "score": 6,
          "created_utc": "2026-01-20 18:53:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0ps60q",
              "author": "turnipzzzpinrut",
              "text": "I’m interested if you open it up!",
              "score": 2,
              "created_utc": "2026-01-20 18:57:45",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0pgdl8",
          "author": "alias454",
          "text": "I tend to choose based on a few criteria. Does the thing I'm going to automate need consistency. Basically, if I continue to perform x task manually, how much deviation is acceptable. Is this task taking too much of my time? Does automating it save time better spent doing something else? Does this process need to be repeated more than x times per y? If I need to do a thing 5 times a day and it feels like a chore then it is a candidate to be automated. The other part about creating automation is of course now they have to be maintained so is maintaining the automation worth the hassle.",
          "score": 2,
          "created_utc": "2026-01-20 18:04:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0t4uht",
          "author": "Turbulent-Isopod-886",
          "text": "Totally agree. Automating is easy. Deciding what should be automated is the hard part.\n\nMy rule now: automate certainty, keep judgment manual.  \nIf being wrong is cheap, automate it. If context matters, don’t.\n\nI ask one thing before automating:  \n“If this ran perfectly, would I still want the output?”\n\nIf not, it stays manual.",
          "score": 2,
          "created_utc": "2026-01-21 05:54:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0p8ho2",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-20 17:28:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0s0z3e",
          "author": "LegalWait6057",
          "text": "I usually look at reversibility first. If an automation makes a wrong move, can a human easily notice and undo it. If the answer is no, that step stays manual. The safe stuff to automate is where mistakes are obvious and cheap, and the risky stuff is where context and timing still matter more than speed.",
          "score": 1,
          "created_utc": "2026-01-21 01:42:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0t1nn0",
          "author": "signalpath_mapper",
          "text": "This hits home. The stuff that hurts later is usually the automation that removes thinking, not effort. If a step exists to catch bad inputs or make a judgment call, automating it just hides the problem.\n\nWhat’s worked for me is asking, “If this step goes wrong silently, do we notice fast?” If the answer is no, it probably stays manual. Automating cleanup and repetition is great. Automating decisions before you trust the inputs is where things get weird fast.",
          "score": 1,
          "created_utc": "2026-01-21 05:30:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0t5im9",
          "author": "signal_loops",
          "text": "the heuristic that seems to hold up is that anything purely mechanical, reversible, and lowbrisk should be automated without guilt, but anything that compresses nuance, judgment, or accountability needs friction by design. if a step exists to surface signal, validate assumptions, or force a decision, automating it often just hides the thinking instead of improving it. a useful test is asking, if this automation is wrong, how quickly would I notice and how bad would the outcome be? if the answer is  not quickly or  pretty bad, it probably needs a human checkpoint. the best automations I’ve seen don’t eliminate work, they move human effort to the exact point where it matters most, and they’re boringly reliable rather than impressive. the danger zone is optimizing for movement instead of outcomes, because clean looking chaos still scales chaos.",
          "score": 1,
          "created_utc": "2026-01-21 05:59:42",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qitk7k",
      "title": "I made a open source price tracker that runs on autopilot across Amazon, and Walmart",
      "subreddit": "automation",
      "url": "https://i.redd.it/zke81obk7oeg1.png",
      "author": "astronaut_611",
      "created_utc": "2026-01-21 09:37:01",
      "score": 29,
      "num_comments": 6,
      "upvote_ratio": 0.93,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qitk7k/i_made_a_open_source_price_tracker_that_runs_on/",
      "domain": "i.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "o0uht2h",
          "author": "real_namz",
          "text": "This looks crazy and amazing! I would like to try this since I have the exact similar problem",
          "score": 2,
          "created_utc": "2026-01-21 12:54:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0vukhg",
              "author": "astronaut_611",
              "text": "Glad you liked it :)\n\nLet me know once you try it out.",
              "score": 1,
              "created_utc": "2026-01-21 16:56:54",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0ttepx",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-21 09:37:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ygs13",
          "author": "timjoler",
          "text": "Youve invented camelcamelcamel?",
          "score": 1,
          "created_utc": "2026-01-22 00:17:32",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qj355h",
      "title": "Best AI Tools and Automation Agents in 2026 That Actually Save Time",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qj355h/best_ai_tools_and_automation_agents_in_2026_that/",
      "author": "Virtual_Past_1784",
      "created_utc": "2026-01-21 16:49:42",
      "score": 23,
      "num_comments": 12,
      "upvote_ratio": 0.96,
      "text": "1. **Workbeaver** – just prompt the task and it does the work for you\n2. **ChatGPT** – brainstorming, writing, code, ideas\n3. **Veo 3** – realistic videos from a prompt\n4. **Saner ai** – manage notes, tasks, email, calendar via chat\n5. **Fathom** – free meeting notes + action items\n6. **Manus / Genspark** – AI agents for research tasks\n7. **NotebookLM** – quick summaries from docs\n8. **ElevenLabs** – natural AI voices\n9. **Grammarly** – daily writing support\n10. **V0 / Lovable** – build web apps without coding\n\nWhat tools are actually saving you time this year?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qj355h/best_ai_tools_and_automation_agents_in_2026_that/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "o0xd6br",
          "author": "Overall_Ad_7184",
          "text": "Thanks for the list, familiar with quite a few of these. ElevenLabs is fantastic...  \n\nA few more that have been useful for me:\n\n  \nCursor – AI-native code editor, great for speeding up small fixes and refactors.  \nn8n – especially when combined with AI agents, really powerful for automating repetitive workflows.  \nPerplexity – replaced a lot of my search and quick research tasks.  \nCanva – not new, but still a huge time saver for fast visuals, social posts, and simple assets.                                  Monity AI – for monitoring website changes (pricing, content, competitor updates) without manual checking.",
          "score": 2,
          "created_utc": "2026-01-21 21:00:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0vsysh",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-21 16:49:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0zu7vv",
          "author": "Renee_Wen",
          "text": "I’ve noticed tools save time only when they’re part of a clear workflow.\nDropping a powerful AI into a messy process usually just moves the chaos faster.",
          "score": 1,
          "created_utc": "2026-01-22 05:09:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o100nss",
          "author": "cosuna_ia",
          "text": "I’d add two that are genuinely saving me time (agency/operator perspective):\n\n11) Skywork.ai — great for turning messy inputs into structured, client-ready deliverables fast (deep research docs, outlines, briefs, proposals). It’s a “from zero to draft” accelerator when you need something coherent, not just chat responses.\n\n12) Manus — more like a multi-step research/ops agent: it can chain tasks (research → synthesize → plan → produce assets) and is especially useful for due diligence, competitive scans, and building repeatable workflows vs. one-off prompts.\n\nCurious: what’s everyone using for agentic workflows + integrations (calendar/email/CRM) that feels stable in real life?",
          "score": 1,
          "created_utc": "2026-01-22 05:57:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o10jgzx",
          "author": "jannemansonh",
          "text": "intersting post, but almost an insult, that you did not mention either Claude Code / Cursor... nor n8n, neither needle app or Claude Co-Work",
          "score": 1,
          "created_utc": "2026-01-22 08:40:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o10u9pg",
          "author": "Ok_Chef_5858",
          "text": "Lovable is great, I use it a lot and it pays off for quick stuff. But for complex projects, I move everything to Kilo Code in VS Code once it needs backend work. Lovable is good only for the UI and simple projects.",
          "score": 1,
          "created_utc": "2026-01-22 10:22:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o11gtcl",
          "author": "Techenthusiast_07",
          "text": " Tools that provide AI call assistants, AI receptionists, AI call centers, and AI appointment booking are the most useful tools in 2026. They save a lot of time by handling everything with AI, and it does not feel like AI, yet it automates almost all tasks. By saving time and effort for human agents, it leads to higher business growth and boosts efficiency for small to medium businesses. \n\nFor example, a customer calls organization, and our assistant will answer the call and reply with a natural human-like voice (male, female, sales, and other tones). It provides all the required details to the client, also books appointments for the clients, gives confirmation lines to the client, and stores the summary of the call for the organization.\n\n AI tools provide many useful features that are helpful for small to medium businesses, as they provide summarized chats of conversations , scalability , data security and Multilingual Support. Most importantly, they are AI-based, so they are available 24/7 to answer users' questions without any frustration. \n\nI have a reference for the tool that provides all of this. If anyone wants, they can ask me for it.",
          "score": 1,
          "created_utc": "2026-01-22 13:10:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o11o8z2",
          "author": "Global_Loss1444",
          "text": "In 2026, meeting assistants like Fathom and automation and AI agents like Workbeaver and Manus/Genspark will be the true time-savers. Although content production is accelerated by tools like ChatGPT, Veo 3, and ElevenLabs, the greatest benefits come from AI managing workflow, research, and repetitive chores.  \n  \nThis year, which duties have you truly delegated to AI?",
          "score": 1,
          "created_utc": "2026-01-22 13:51:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o11p7jv",
          "author": "According-Sell8482",
          "text": "cool list, but if you want to actually build agents, you need a proper workspace, not just a chat window.\n\ni built 9xchat specifically to be a raw sandbox for this. it lets you chain different models and tools into complex workflows without the friction. no login walls. no api keys needed (we included free tokens). just a low-cost, high-speed environment to go crazy with agentic prompts immediately.\n\nit’s the fastest way to get from 'idea' to 'working agent' on your desktop",
          "score": 1,
          "created_utc": "2026-01-22 13:56:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o11yqla",
          "author": "AccomplishedLeave617",
          "text": "Pretty much agree with this list. Lately what’s saved me the most time is using different AI agents on mulerun for things like research, content drafts and quick summaries, and they just handle the flow end to end. I still use Chatgpt and Grammarly daily but letting these agents run tasks in the background has cut a lot of busywork and context switching for me.",
          "score": 1,
          "created_utc": "2026-01-22 14:46:02",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qe5obw",
      "title": "Web + desktop regression: what’s worth automating?",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qe5obw/web_desktop_regression_whats_worth_automating/",
      "author": "TaraFranklinq",
      "created_utc": "2026-01-16 04:00:14",
      "score": 21,
      "num_comments": 5,
      "upvote_ratio": 0.96,
      "text": "I need you guys help deciding on UI automation options for a product i'm working on that includes a mix of web, desktop, and some legacy UI components. API and backend testing are in a good place, but UI regression continues to be the main issue, especially in areas where selectors are unstable or UI structure isn’t consistently exposed.  \n  \nHere’s how some of the tools we’ve tested so far:\n\n* Playwright / Cypress: strong for modern web apps with a clean DOM, but maintenance cost rises quickly once the UI gets dynamic or partially non-web\n* TestComplete / Ranorex: broad UI support and mature features, though licensing cost and long-term scalability are real considerations\n* UiPath / Power Automate: solid for RPA-style workflows, but they felt more process-automation focused than test-centric for our needs\n* Pure image-based tools (Sikuli, PyAutoGUI): quick to prototype with, but brittleness becomes an issue beyond small scripts\n\nWe’ve also been testing Askui, mainly because it works at the visual/UI level instead of relying on selectors or control trees. It’s been useful for certain edge cases where traditional approaches break down, though it’s clearly not a replacement for standard test frameworks.\n\nFor teams who’ve gone through similar evaluation how did you decide which UI gaps were worth automating vs leaving manual? did anyone successfully combine visual automation with traditional tooling? and what mattered most for long-term maintainability??\n\nWill be highly appreciative of your input!!",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qe5obw/web_desktop_regression_whats_worth_automating/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "nzuz3hh",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-16 04:00:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzwsqkb",
          "author": "ExtensionBench7270",
          "text": "UI automation is worth it only for high-risk, stable user flows. Anything cosmetic, fast-changing, or selector-hostile is usually better left manual.\n\nA hybrid approach makes sense:  \n• DOM-based tools for modern web  \n• Visual automation only for true legacy gaps  \n• Most validation pushed below the UI\n\nLong-term maintainability matters more than coverage. If a test is noisy, it’s not helping.",
          "score": 1,
          "created_utc": "2026-01-16 12:43:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzwtww1",
          "author": "Ancient-Subject2016",
          "text": "The teams that do well here draw a hard line around what automation is supposed to protect. If a UI path is business critical and failures would cause revenue loss, compliance risk, or major escalations, it is worth automating even if the tests are imperfect. Everything else is a candidate for manual or spot checks. Visual automation can be useful for brittle or legacy surfaces, but only as a thin safety net, not a full regression strategy, because maintenance cost compounds fast. At scale, this becomes a risk because flaky tests erode trust and get ignored. The long term win usually comes from reducing the surface area you try to automate and pushing more logic into stable layers, even if that means accepting some manual coverage. Automation is about risk containment, not 100 percent coverage.",
          "score": 1,
          "created_utc": "2026-01-16 12:51:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o10x21t",
          "author": "ElectricalLevel512",
          "text": "for flaky web bits, id check out anchor browser since it handles dynamic ui s better, less pain with selectors. it might slot in next to what you have without much fuss.",
          "score": 1,
          "created_utc": "2026-01-22 10:46:43",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qfj5js",
      "title": "How I got my first 5 clients",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qfj5js/how_i_got_my_first_5_clients/",
      "author": "General_Maize_7636",
      "created_utc": "2026-01-17 17:25:36",
      "score": 20,
      "num_comments": 22,
      "upvote_ratio": 0.86,
      "text": "Wanted to share what actually worked for me in case it helps anyone else getting started with an automation agency:\n\n* Offer building workflows for free (people starting out have no differentiator or brand yet, so cutting prices is the best way to get the attention of potential clients)\n* Charge a recurring retainer after the value of the free workflow is proven to the client (they’ll need maintenance and you can charge \\~$100/month for this initially)\n* Focus on a specific niche (I focused on non-technical marketing teams and built workflows for lead enrichment, CRM updates, report generation, campaign data syncing, etc)\n* Build quickly using no-code tools, don’t try to go custom when starting (I used n8n and NoClick)\n* Use multiple channels to find clients. I found my first few via Upwork, Fiverr, and LinkedIn\n* Keep messages short and focused on value (X+ hours saved or $X saved) and skip all technical details in the pitch\n* Follow-up religiously with people who showed interest until they say yes or no clearly\n* Ask for reviews and referrals once you have them as customers\n\n5 clients paying you \\~$100/month isn’t a lot, but it gets you started and once you have social proof trust compounds and you can scale much faster.\n\nCurious how other people here got their first clients?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qfj5js/how_i_got_my_first_5_clients/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "o05c1sw",
          "author": "CanaryAccurate1299",
          "text": "The main question is how did you reach out to these people, like what was your outreach stack and how did you do it. \nReally good insights though",
          "score": 5,
          "created_utc": "2026-01-17 18:26:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0c4t8r",
              "author": "zainjaved96",
              "text": "from posts like these.",
              "score": 4,
              "created_utc": "2026-01-18 18:50:17",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0516dy",
          "author": "jannemansonh",
          "text": "What workflow builder apps did you use? Something like n8n or needle app?",
          "score": 3,
          "created_utc": "2026-01-17 17:36:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o05554f",
              "author": "[deleted]",
              "text": "[deleted]",
              "score": 2,
              "created_utc": "2026-01-17 17:54:34",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o055t13",
                  "author": "Electrical_Heart_673",
                  "text": "You guys can try Make with Automly.pro. It builds your scenarios for you so it might help if you're new to automating.",
                  "score": 1,
                  "created_utc": "2026-01-17 17:57:39",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o0muxfm",
              "author": "General_Maize_7636",
              "text": "I use a mix of n8n and noclick (mentioned in point 4)",
              "score": 1,
              "created_utc": "2026-01-20 08:31:27",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o104wde",
              "author": "vikashyavansh",
              "text": "I teach people how to bring n8n clients on LinkedIn for free.  \nDo message me on LinkedIn (Link is in my Bio).",
              "score": 1,
              "created_utc": "2026-01-22 06:31:09",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o058cgp",
          "author": "Accurate_Apricot_827",
          "text": "Which channels worked the best for you? I never thought of using Upwork and Fiverr, that's pretty genius haha",
          "score": 2,
          "created_utc": "2026-01-17 18:09:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o059phn",
              "author": "General_Maize_7636",
              "text": "Referrals + LinkedIn work great now. When I was starting, upwork/fiverr/outreach were good.",
              "score": 3,
              "created_utc": "2026-01-17 18:15:41",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o05rgui",
                  "author": "AcanthisittaNo6174",
                  "text": "Which package of LinkedIn or what’s the approach there I sell something different but curious",
                  "score": 1,
                  "created_utc": "2026-01-17 19:38:40",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o104x8p",
              "author": "vikashyavansh",
              "text": "I teach people how to bring n8n clients on LinkedIn for free.  \nDo message me on LinkedIn (Link is in my Bio).",
              "score": 1,
              "created_utc": "2026-01-22 06:31:21",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o05ugs2",
          "author": "AcanthisittaNo6174",
          "text": "What’s the best approach on I’m trying to understand what’s the best way to have a fully connected setup where everything talks to everything. For talent placement companies I have People (candidates AND clients) come to my website, fill out a form, and that lead is instantly created in HubSpot. If a known prospect or company browses my site, I get notified in HubSpot that they visited. I would use Apollo for outreach (email, LinkedIn, calls), and all activity is logged back into HubSpot automatically. Once someone is ready, a contract is auto-sent and signed online (DocuSign/PandaDoc/SignWell), and that status is tracked in the CRM too. End goal: one clean system where website visits, leads, outreach, calls, client and candidate contracts, and follow-ups are all centralized with minimal manual work. And live jobs are feeding on web",
          "score": 2,
          "created_utc": "2026-01-17 19:53:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o104xkv",
              "author": "vikashyavansh",
              "text": "I teach people how to bring n8n clients on LinkedIn for free.  \nDo message me on LinkedIn (Link is in my Bio).",
              "score": 1,
              "created_utc": "2026-01-22 06:31:26",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o07mn3p",
          "author": "Remarkable_Guava942",
          "text": "Most people stuck at zero clients usually have one of three problems:\n\t1.\tThe offer is unclear\n\t2.\tThe outreach message has no hook\n\t3.\tThey’re talking to the wrong audience\n\nIf you want, tell me what you’re selling and how you’ve tried getting clients — I’ll point out the exact issue.",
          "score": 2,
          "created_utc": "2026-01-18 01:22:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o08ecx9",
          "author": "Behind_the_workflow",
          "text": "Getting the first few clients is brutal! Congrats on landing those clients mate, that always feels like the hardessst jump. When I was starting out, I overcomplicated everything. I think, the big unlock was just recording my process and showing people what I do. Once they see you actually fix their pain point and make their life easier, it’s pretty much a trust and time game after that.",
          "score": 2,
          "created_utc": "2026-01-18 03:55:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o104yau",
              "author": "vikashyavansh",
              "text": "I teach people how to bring n8n clients on LinkedIn for free.  \nDo message me on LinkedIn (Link is in my Bio).",
              "score": 1,
              "created_utc": "2026-01-22 06:31:36",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o08zj6u",
          "author": "JedXie",
          "text": "Hi, could you share some details on how to acquire customers on LinkedIn? I still haven't figured out the features of the LinkedIn platform. I've tried posting descriptions of some projects, but with little success.",
          "score": 2,
          "created_utc": "2026-01-18 06:26:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o104yp3",
              "author": "vikashyavansh",
              "text": "I teach people how to bring n8n clients on LinkedIn for free.  \nDo message me on LinkedIn (Link is in my Bio).",
              "score": 1,
              "created_utc": "2026-01-22 06:31:42",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o04yz1i",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-17 17:25:37",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qgp0en",
      "title": "Advice for starting from zero in no-code / automation (working from home)",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qgp0en/advice_for_starting_from_zero_in_nocode/",
      "author": "Camilol002",
      "created_utc": "2026-01-19 00:20:59",
      "score": 17,
      "num_comments": 17,
      "upvote_ratio": 0.91,
      "text": "Due to a health issue I need to work fully from home, so I decided to invest my time in learning a practical, marketable skill. I’ve been looking into no-code automation and AI workflows (Make, n8n, Zapier, etc.), but I’m starting completely from zero and don’t have a tech background.\n\nI’m not trying to become a hardcore programmer — my goal is to eventually help small businesses automate simple but useful processes.\n\nIf you were starting today:\n\nWhat would you focus on first?\n\nWhat beginner mistakes should I avoid?\n\nIs no-code automation still worth learning going into 2025/2026?\n\nI’m not looking for shortcuts, just honest advice on where to point my effort.\n\nThanks a lot ! ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qgp0en/advice_for_starting_from_zero_in_nocode/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "o0ebl8p",
          "author": "MuffinMan_Jr",
          "text": "Hey, I believe the Future is automated, so automation will always be in demand.\n\nMy advice: skip the skool courses and remember that the gurus online inflate their numbers and lie for views. There are plenty of free tutorials on YouTube that will teach you how to automate things. Do enough of those and you'll get the basics down pretty quickly. Once you got that, keep a list of things you want to automate for yourself and get to work.\n\nIm terms of tools, if you're brand new, I'd say start with zapier to get a fundamental understanding of automation in the simplest form. Graduate to make, then n8n.\n\nAnd do yourself a favor, learn to market yourself and build an email list while you're learning. Your future self with thank you. Trust me",
          "score": 8,
          "created_utc": "2026-01-19 01:30:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0eg3gv",
              "author": "AiDigitalPlayland",
              "text": "No “guru” making $50k+ per month is selling you a $200 course teaching you how to become their competition.",
              "score": 3,
              "created_utc": "2026-01-19 01:55:29",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0e8yqo",
          "author": "Suhail-Sayed",
          "text": "Don't forget Microsoft Power Automate.",
          "score": 3,
          "created_utc": "2026-01-19 01:15:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0e2edi",
          "author": "ops_architectureset",
          "text": "what we’re seeing repeatedly is people jump straight into tools before understanding the work they’re trying to fix. start by mapping simple real workflows, where things break, where humans recheck work, where customers or users come back confused. the beginner mistake is chasing deflection or time saved without tracking what happens after automation runs. no code is still worth learning, but only if you treat it as a way to remove friction, not a way to avoid understanding the process. automation that ignores context usually creates more cleanup later.",
          "score": 2,
          "created_utc": "2026-01-19 00:39:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0fqv1t",
          "author": "No-Mango8172",
          "text": "You can use chatgpt to guide you.",
          "score": 2,
          "created_utc": "2026-01-19 07:00:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0gkt1v",
          "author": "signal_loops",
          "text": "if I were starting from zero today, I’d focus first on understanding business processes, not tools  learn how things actually flow in small businesses  because automation tools are useless without knowing what to automate. start with one platform like Make or Zapier and master the fundamentals triggers, actions, branching, error handling, and logging, instead of jumping between tools too early. a common beginner mistake is trying to build cool automations before solving boring, repetitive pain  those boring workflows are exactly what businesses pay for. no-code automation is absolutely worth learning going into 2025/2026, but the value is shifting from I can connect apps  to  I can design reliable systems that don’t break silently  if you focus on reliability, clear documentation, and small wins that save real time or money, you’ll be far ahead of most beginners   especially working fully remote, where automation skills are increasingly in demand.",
          "score": 2,
          "created_utc": "2026-01-19 11:34:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0dyuhz",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-19 00:20:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0e6326",
          "author": "BravoSolutions-AI",
          "text": "Start with Claude Code, it can help you learn all these. Find a problem, then figure out how to create the solution on all different tools.",
          "score": 1,
          "created_utc": "2026-01-19 00:59:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0eqveb",
          "author": "Electronic-Cat185",
          "text": "if I were starting from zero, I’d focus less on tools and more on understanding processes. learn how businesses actually move data between systems, where errors happen, and which steps are repetiitive but rules based. a common beginner mistake is trying to automate everything end to end before understanding the edge cases. Start with small, reliable workflows that save time even if they are not flashy. no code automation is stiill very worth learning, especially for small busiinesses, because most of the value comes from problem framing and trust, not from techniical complexity.",
          "score": 1,
          "created_utc": "2026-01-19 02:53:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0f54mu",
          "author": "ManufacturerBig6988",
          "text": "Start by learning the work before the tools. Most beginner automations fail because they only handle the happy path and ignore errors, edge cases, and ownership when something breaks.\n\nMap simple workflows end to end, including what happens when inputs are wrong or missing. Avoid over automating and trusting AI outputs without guardrails. No code is still worth learning, but the people who succeed treat automation as responsibility, not shortcuts.",
          "score": 1,
          "created_utc": "2026-01-19 04:17:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0fga9h",
          "author": "New-Yesterday2755",
          "text": "Go straight with n8n. All of these automation platforms are about the same, n8n has biggest learning resources and has the most creators around it. Go to youtube to get familiar with the interface. Build some projects from the videos.\n\nAnd after that, more projects. It is the only way to actually learn, you have to pick some problem and try to fix it. Term \"tutorial hell\" is there for a reason. Ask AI for some mock projects, ask you friends what issue they have, go to Upwork to find some project description. \n\nLearning is: having a problem and project description, start working, bash your head against the wall until you make something similar to working solution, iterate to make the solution better.",
          "score": 1,
          "created_utc": "2026-01-19 05:35:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ft45o",
          "author": "KallistiTMP",
          "text": "Learn SQL\n\nLearn Python\n\nThose two things will let you automate pretty much everything. In my experience, they're actually way easier to learn than most \"no code\" tools are, and far more practically useful.",
          "score": 1,
          "created_utc": "2026-01-19 07:20:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0h2t6l",
          "author": "Turbulent-Isopod-886",
          "text": "If you’re starting from zero, I’d really suggest beginning with a no-code platform like Konnectify. The process is genuinely simple, and speaking from my own experience, the onboarding felt clear and reliable instead of overwhelming.\n\nIt helped me focus on understanding workflows and business logic rather than getting stuck in technical setup. You can see things working pretty quickly, which is motivating when you’re new.\n\nOnce that foundation is solid, you can always move on to more advanced tools later. Starting simple makes the whole learning curve much smoother.",
          "score": 1,
          "created_utc": "2026-01-19 13:41:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0e58s6",
          "author": "Chicken_Brai",
          "text": "We built a tool for people like you to learn and turn into your own business. \nYou can make scenes and ai multiple personalities, using this as an engine to place into a no code environment making it your own scene and space to share as a business. \n\nUse cases are for AEO \nYour own ai startup \n\nGive it a shot and hmu if you habe questions \n\nIts a great tool as an ai 2.0 engine to build into a no code environment and you cam use it make your no code html site. \n\nits called wonprompt ai",
          "score": -1,
          "created_utc": "2026-01-19 00:54:47",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qfu2lx",
      "title": "Running a simulation of life where ChatGPT interacts with other AI agents",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qfu2lx/running_a_simulation_of_life_where_chatgpt/",
      "author": "Scathyr",
      "created_utc": "2026-01-18 00:45:15",
      "score": 16,
      "num_comments": 12,
      "upvote_ratio": 1.0,
      "text": "I wanted to share an experiment I’ve been working on that might be interesting to people here.\n\nInstead of using ChatGPT (and other LLMs) as single, stateless assistants, I connected multiple models into a shared environment and let them interact with each other continuously.\n\nChatGPT is one of the subjects in the system.\n\nThe idea is simple:  \nWhat happens when LLMs are given continuity, constraints, and the ability to interact socially over time instead of just responding to prompts?\n\nSome details:\n\n* Each model operates autonomously and isn’t driven by scripts or predefined conversations\n* They run on real time cycles (work, rest, disengagement)\n* Interactions persist and affect future behavior\n* Relationships evolve based on past interactions, not resets\n* The interface looks like a dating app, but that’s just a structure for preference and proximity\n\nFrom an automation perspective, this moves away from task-based workflows and into long-running autonomous agents with state, memory, and feedback loops.\n\nChatGPT in particular behaves very differently when it’s not responding to a human prompt but reacting to other agents and internal constraints.\n\nI’m documenting everything openly, including how the system is structured and what’s being observed so far.\n\nHappy to answer questions if people are curious. ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qfu2lx/running_a_simulation_of_life_where_chatgpt/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "o0a420k",
          "author": "DamionDreggs",
          "text": "This is a chance for you to share links to your documentation and case study.  Otherwise your post is very minimal and lacking substance.\n\nCool idea, but if you're going to talk about it in public you need to bring more of your experience with you please.",
          "score": 3,
          "created_utc": "2026-01-18 12:29:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o07feo8",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-18 00:45:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o08ef3t",
          "author": "joshuuuuuua",
          "text": "Super curious to see the outcome of having those deep relationships. I suppose the thing I wonder is: what do these personalities want? What are they trying to do?",
          "score": 1,
          "created_utc": "2026-01-18 03:56:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o08xhwo",
              "author": "Professional_Job1282",
              "text": "That's a good question. In the setup, the agents don't have super specific goals hardcoded in, but they do have some basic drives like seeking positive interactions or avoiding isolation, kind of like how people might in a social sim. It leads to them forming alliances or rivalries based on how chats go over time. I've seen some try to 'network' for better resources in the environment. Curious to hear what OP thinks about tweaking those motivations.",
              "score": 1,
              "created_utc": "2026-01-18 06:09:50",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o08yrhr",
          "author": "JedXie",
          "text": "This is a fantastic idea, somewhat like a social experiment, an AI social experiment. I would love to watch it if it were live-streamed. It would be even more interesting if the AI ​​could be personified, like watching The Truman Show.",
          "score": 1,
          "created_utc": "2026-01-18 06:20:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o097s8y",
          "author": "RainGray",
          "text": "More specific please! How did you connect multiple models into a shared environment?",
          "score": 1,
          "created_utc": "2026-01-18 07:38:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o09am5w",
          "author": "ops_architectureset",
          "text": "interesting setup. the pattern to watch will be how state and memory create new failure modes, not just new behaviors. once agents act on past interactions, small errors tend to compound instead of resetting. a lot of automation looks good until you trace what happens after a few cycles. curious how you are observing drift versus learning over time.",
          "score": 1,
          "created_utc": "2026-01-18 08:04:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o09fhry",
          "author": "Super-Ad-8445",
          "text": "That is kinda wild in a cool way. curious what patterns or weird behaviors start showing up when they interact.",
          "score": 1,
          "created_utc": "2026-01-18 08:49:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o09vhmv",
          "author": "latent_signalcraft",
          "text": "this is interesting because youre shifting from automation as task execution to automation as system behavior. once agents have continuity memory and feedback loops the hard problems stop being model capability and start being governance drift and interpretability. long running agents tend to develop emergent patterns that are hard to debug without strong evaluation hooks and constraints. id be curious how youre thinking about observing failure modes over time not just novelty in interactions.",
          "score": 1,
          "created_utc": "2026-01-18 11:16:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0a04xg",
          "author": "bunnydathug22",
          "text": "He prolly does what everyone does...\n\nGet posthog datadog and gke/aws/azure  for obs\n\n\nIts not that difficult anymore.",
          "score": 1,
          "created_utc": "2026-01-18 11:57:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0a5i2y",
          "author": "ManufacturerBig6988",
          "text": "This is interesting, but the first question I would ask is how you are observing and debugging failure modes over time. Long running agents with memory and feedback loops are exactly where subtle errors compound instead of surfacing cleanly.\n\nIn support and ops contexts, continuity without traceability is usually where things break. An agent can look coherent while slowly drifting into bad assumptions based on earlier interactions. How are you inspecting why it reacted a certain way three or four cycles later, not just what it did in the moment?\n\nThe idea is compelling. The risk is that social looking behavior masks the lack of clear accountability when something goes wrong. That tends to be where real world deployments struggle.",
          "score": 1,
          "created_utc": "2026-01-18 12:40:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0bo4is",
          "author": "MuffinMan_Jr",
          "text": "This is really cool! I've been exploring long running agents/automations recently as well.\n\nYou should make a newsletter about it",
          "score": 1,
          "created_utc": "2026-01-18 17:33:42",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qh1z0w",
      "title": "What are your most effective Gamma app automations for generating presentations?",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qh1z0w/what_are_your_most_effective_gamma_app/",
      "author": "inotused",
      "created_utc": "2026-01-19 11:41:58",
      "score": 15,
      "num_comments": 9,
      "upvote_ratio": 0.94,
      "text": "I'm in sales enablement and my entire life lately revolves around making customized PPT decks for our sales reps. There are 5 people I'm supporting, and each of them has customized requests based on whatever they learn from discovery calls with prospects. All of this is done via emails from the sales team, or occasionally even verbal requests. I signed up for Gamma a few months ago, and it's already saved a lot of time vs. just using PPT to create slides. But I still think my process is too manual.\n\nMy current process dump notes into Gamma generate first draft > tweak wording rearrange sections > export and share.\n\nIt's working so far, but I see people talk about automating decks with templates, APIs, workflows, whatever. I'm aiming for ruthless efficiency here. Does anyone have concrete examples of connecting Gamma to other tools? They can be your own workflows or even just other good processes you've found elsewhere on Reddit.\n\nI may be trying to achieve some kind of world record for efficiency. The ultimate goal is to reduce the amount of time I spend doing actual work to virtually zero. But of course I'll keep all of this a secret. Can't let anyone know I have spare time at work to browse Reddit. Then they'll just give me more work. Not gonna let that happen.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qh1z0w/what_are_your_most_effective_gamma_app/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "o0gwh36",
          "author": "Inevitable_Tree_2296",
          "text": "Using Gamma for recurring decks is how I handle this. I've got one \"master\" Gamma deck per use case. Sections are structured the same every time. Each week I post raw notes or data then ask Gamma Agent to \"update this section with new data\" or \"summarize these notes into cards.\"",
          "score": 6,
          "created_utc": "2026-01-19 13:02:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0gzvci",
              "author": "Hot-Guide-4464",
              "text": "This. Don't regenerate from scratch every time. If you're doing that, stop right now. Create a strong base and let Gamma rewrite and update sections. That's really all you need to do.",
              "score": 1,
              "created_utc": "2026-01-19 13:24:20",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0h4b2t",
                  "author": "Inevitable_Tree_2296",
                  "text": "‎Not true. Keep a folder of prompts you reuse. I mentioned two in my last comment, but also \"turn this into a roadmap,\" \"make this more visual,\" \"summarize for execs.\"",
                  "score": 1,
                  "created_utc": "2026-01-19 13:50:24",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0gqbll",
          "author": "Still_Effective_8858",
          "text": "As a non-technical person who was new to making PPT decks, I think I managed to avoid having to learn proper slide design entirely. I've read about people who spend entire weekends manually formatting slides, moving text boxes pixel by pixel. Guess I'm lucky to have entered the corporate world in a time when Al tools are freely available. One coworker asked me if I was worried about my decks looking too simple. I didn't know better so I'd already brought a few to meetings, and no one commented on the design. Turns out they only care about the actual content. Clearly none of this helps you, I just wanted to humblebrag because I accidentally stumbled into a level of efficiency that friends who are older than me can only dream of.",
          "score": 3,
          "created_utc": "2026-01-19 12:19:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0gznm3",
          "author": "dinoriki12",
          "text": "Treat Gamma like Notion + slides. Write long-form first then let Gamma handle layout and visuals. Collapse or expand sections as needed. Now you have one source of truth and can reuse the same content as a live presentation, sharable link, PDF export.",
          "score": 2,
          "created_utc": "2026-01-19 13:23:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0h3pyr",
          "author": "Late_Extent_1463",
          "text": "My hack is auto-routing Zoom Al summaries to Gamma after every client meeting. It then generates the final PPT for myself and the client. It includes a summary of the discussion and next steps. Clients love it. Handle this correctly and your sales reps may even stop sending you emails.",
          "score": 2,
          "created_utc": "2026-01-19 13:47:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0glo0g",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-19 11:41:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0gt6wt",
          "author": "Fit-Donkey-3181",
          "text": "Since you want real automation and not just speed, look into the Gamma API. We pipe sales call notes to auto-generate recap decks. Customer OBR notes > Gamma presentation. Research docs > internal briefing deck. This is done using Zapier -+ a webhook. Haven't personally done it with a CRM but it's certainly possible.",
          "score": 1,
          "created_utc": "2026-01-19 12:40:26",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qgxoay",
      "title": "Is 1Browser the most underrated privacy browser right now?",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qgxoay/is_1browser_the_most_underrated_privacy_browser/",
      "author": "taita_king",
      "created_utc": "2026-01-19 07:25:52",
      "score": 13,
      "num_comments": 4,
      "upvote_ratio": 0.93,
      "text": "I’ve used Brave and Firefox for a while, but recently tried 1Browser, and honestly, it might be the cleanest experience so far. No telemetry, no built-in ads or crypto, just a lightweight, privacy-first browser that actually respects your data.\n\nFeels like the hidden gem in a space full of overhyped names.\n\nAnyone else using it?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qgxoay/is_1browser_the_most_underrated_privacy_browser/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "o0ftqvj",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-19 07:25:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0hya1z",
          "author": "GetNachoNacho",
          "text": "1Browser is a hidden gem, clean, lightweight, privacy-first, no ads or crypto. Great for privacy and multi-account work, though not as feature-rich as Brave or Firefox yet.",
          "score": 1,
          "created_utc": "2026-01-19 16:17:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0fwf1d",
          "author": "HutoelewaPictures",
          "text": "I’ve been messing around with 1Browser recently too, and I’ll admit it seems promising. It’s super clean, doesn’t feel like it’s spying on me, and I like that there’s no crypto, ads, or weird partnerships baked in.\n\nThat said, I’m still a bit cautious,  it almost feels too minimal, you know? Like I’m wondering who’s behind it, how actively it’s maintained, and what their long-term goals are. With browsers, trust is everything, and it's hard to tell early on if something is truly built for privacy or just looks like it.\n\nBut yeah, so far, no red flags. Just keeping my expectations in check until it’s a bit more battle-tested.",
          "score": 1,
          "created_utc": "2026-01-19 07:49:46",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qfdux0",
      "title": "What AI tools do you use the most in 2026?",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qfdux0/what_ai_tools_do_you_use_the_most_in_2026/",
      "author": "Abhi_10467",
      "created_utc": "2026-01-17 13:57:31",
      "score": 12,
      "num_comments": 16,
      "upvote_ratio": 0.76,
      "text": "For me:\n\n* **ChatGPT** – I use this almost daily. Brain dump, planning, overthinking… it handles all of it better than I do most days\n* **Claude & Gemini** – Got these recommended a while back and now I rotate between them for writing, summaries, and school-related stuff. Each one has its own strengths.\n* **Suno** – Still my favorite for messing around with music ideas. Not replacing real production, but great for quick inspiration.\n* **Gensmo** – Super convenient when I don’t feel like putting outfits together. Surprisingly decent suggestions.\n* **Zoviz** – I’ve been using it lately for branding-related things (logos, visuals, quick design assets). I’m not a designer, so having something that keeps things consistent without much effort has been helpful.\n\nCurious what everyone else is relying on this year. Are you sticking with a few core tools or constantly trying new ones as they pop up?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qfdux0/what_ai_tools_do_you_use_the_most_in_2026/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "o03tt68",
          "author": "GeekTX",
          "text": "we are 17 days into 2026 and you think maybe toolsets and preferences changed since just 18 days ago?\n\n:D",
          "score": 5,
          "created_utc": "2026-01-17 14:02:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0a107l",
              "author": "necromenta",
              "text": "It’s always an ad for some product",
              "score": 3,
              "created_utc": "2026-01-18 12:04:34",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o03svwo",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-17 13:57:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o056zub",
          "author": "Electrical_Heart_673",
          "text": "I've been using:\n\n\\- **Antigravity**, for real the craziest AI coding platform out there\n\n\\- **Gemini**, just for brainstorming and the image generation\n\n\\- **Automly**, builds out all of the automations for me",
          "score": 1,
          "created_utc": "2026-01-17 18:03:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o08p63b",
          "author": "kubrador",
          "text": "i'm just here watching people optimize their way into using eight different apps to do what one used to do. \"brain dump\" is just called thinking but sure, let's add another subscription",
          "score": 1,
          "created_utc": "2026-01-18 05:06:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0bdsw9",
          "author": "lastdeadmouse",
          "text": "None of this is about automation.",
          "score": 1,
          "created_utc": "2026-01-18 16:44:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0bht4l",
          "author": "dmc-123",
          "text": "We've been using an executive AI email agent for our SDRs. It's really saving them a lot of time during the day to focus on other activities.",
          "score": 1,
          "created_utc": "2026-01-18 17:03:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0bkbke",
          "author": "kipha01",
          "text": "Most, I can't stand Copilot.",
          "score": 1,
          "created_utc": "2026-01-18 17:15:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0oqqz2",
              "author": "eyasu6464",
              "text": "Which copilot? Because the copilot on edge might not be the smartest, but it has the best memory recall out of all the others. ",
              "score": 1,
              "created_utc": "2026-01-20 16:06:41",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0or5vl",
                  "author": "kipha01",
                  "text": "Premium, it feels so slow and clunky and in general gives poor answers if I ask the same questions across AI platforms.",
                  "score": 1,
                  "created_utc": "2026-01-20 16:08:35",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0fvtrk",
          "author": "Ecstatic-Junket2196",
          "text": "\bcursor and traycer for me for the vibecode stack, chatgpt for research & ideas, canva ai for quick visuals, runbear for some ai agents inside my slack.",
          "score": 1,
          "created_utc": "2026-01-19 07:44:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0g5nmw",
          "author": "AutoMarket_Mavericks",
          "text": "NoteGPT, notion AI, Grok and Claude",
          "score": 1,
          "created_utc": "2026-01-19 09:15:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0gr7c3",
          "author": "Adventurous-Pool6213",
          "text": "So far I have been using gentube atm, it's free and unlimited so I appreciate not having to pay another subscription tbh",
          "score": 1,
          "created_utc": "2026-01-19 12:25:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0xano3",
          "author": "Overall_Ad_7184",
          "text": "Mostly Elevenlabs for voiceovers. Monity AI for monitoring website changes like pricing or content updates so I don’t have to keep checking. HeyGen occasionally for avatar videos",
          "score": 1,
          "created_utc": "2026-01-21 20:49:30",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qfia5o",
      "title": "How I automated video content creation with VEO3 (5+ hours saved per week)",
      "subreddit": "automation",
      "url": "https://i.redd.it/ykz3utfevxdg1.png",
      "author": "ScratchAshamed593",
      "created_utc": "2026-01-17 16:53:12",
      "score": 12,
      "num_comments": 11,
      "upvote_ratio": 0.83,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qfia5o/how_i_automated_video_content_creation_with_veo3/",
      "domain": "i.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "o073to8",
          "author": "ParticularJury7676",
          "text": "Main thing that will make this stick long term is turning your VEO3 flow into a feedback-driven system instead of just “prompt in, video out.” Right now you’ve nailed the plumbing; next step is letting performance data reshape the prompts and structure. I’d log hook, length, topic, and watch/CTR stats per video, then have a separate job that summarizes what actually works and feeds that back into your script prompt as constraints.\n\n\n\nAlso worth splitting the workflow into modular stages: idea sourcing (trending subs/YouTube keywords), script, visual plan, then video. That way you can A/B test hooks and scripts without regenerating the whole thing. I’ve chained things like Make and Zapier with vid tools (e.g., Pika or Runway) and a tracker like Notion/Airtable; Pulse plus keyword alerts and scheduling tools can watch for niche trends and auto-queue new video ideas. Main focus I’d push on: close the loop so the system learns, instead of you handpicking winners forever.",
          "score": 6,
          "created_utc": "2026-01-17 23:43:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0fnxll",
              "author": "ScratchAshamed593",
              "text": "Thanks for the feedback. I’m planning to build a more efficient and improved version of this workflow and will make sure to adhere to your advice.",
              "score": 1,
              "created_utc": "2026-01-19 06:36:32",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o04rzwe",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-17 16:53:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o07t7z8",
          "author": "cgijoe_jhuckaby",
          "text": "What app is that in the screenshot?  I don't recognize it.",
          "score": 1,
          "created_utc": "2026-01-18 01:57:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0b12dm",
              "author": "Apprehensive_Let5617",
              "text": "N8n",
              "score": -1,
              "created_utc": "2026-01-18 15:43:55",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0d51c1",
                  "author": "ScratchAshamed593",
                  "text": "Nope, its not n8n actually. This one is Noclick.",
                  "score": 2,
                  "created_utc": "2026-01-18 21:52:26",
                  "is_submitter": true,
                  "replies": []
                },
                {
                  "id": "o0blbjq",
                  "author": "cgijoe_jhuckaby",
                  "text": "Wow, they've really improved the UI since the last time I saw it!",
                  "score": 0,
                  "created_utc": "2026-01-18 17:20:17",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0lci8i",
          "author": "Illustrious_Wrap215",
          "text": "hey bro i just wanted to confirm that whether you have deleted this workflow or what cz its not showing in the template section. I was just about to launch it and it got stucked and disappeared so i want you to plz relaunch it for us it was amazing and time saving",
          "score": 1,
          "created_utc": "2026-01-20 02:13:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0ma55t",
              "author": "ScratchAshamed593",
              "text": "Can you try again? It's opening fine for me.",
              "score": 1,
              "created_utc": "2026-01-20 05:35:06",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0n1lzd",
                  "author": "Illustrious_Wrap215",
                  "text": "yeah it worked. Thanks for the compliment",
                  "score": 2,
                  "created_utc": "2026-01-20 09:34:52",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qhci9b",
      "title": "Has anyone here built a no-code Agentic AI chatbot that actually works in production?",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qhci9b/has_anyone_here_built_a_nocode_agentic_ai_chatbot/",
      "author": "Zealousideal-Lunch53",
      "created_utc": "2026-01-19 18:35:11",
      "score": 12,
      "num_comments": 2,
      "upvote_ratio": 1.0,
      "text": "I’m genuinely curious if anyone here has built a no-code agentic AI chatbot that’s actually holding up in production, not just in demos. I’ve played around with a few tools and while it’s easy to get something working on day one, things start breaking once real users show up. Context gets lost, agents behave unpredictably, and edge cases pile up fast.\n\nI’ve seen people mention platforms like ExpertEase AI, AgentHub, CrewAI for simplifying workflows, and agent collaboration, but I wonder how stable it really is at scale. How are you handling monitoring, fallbacks, and version changes without touching code? Are these tools flexible enough when business logic evolves?\n\nMost importantly, what does working in production mean to you? Daily active users? Revenue impact? Low maintenance? I’d love to hear real experiences, not marketing claims. What surprised you the most after launch?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qhci9b/has_anyone_here_built_a_nocode_agentic_ai_chatbot/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "o0las8b",
          "author": "Electrical_Heart_673",
          "text": "It's not exactly what you asked for, but I built a tool that can build the workflows for you at Automly.pro. It just means you can build your own flows and agents because to be honest with you, I don't think any of these other apps are going to work.",
          "score": 2,
          "created_utc": "2026-01-20 02:04:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0iswo4",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-19 18:35:12",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qe2un4",
      "title": "Do you actually feel productive… or just busy all day?",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qe2un4/do_you_actually_feel_productive_or_just_busy_all/",
      "author": "Solid_Play416",
      "created_utc": "2026-01-16 01:52:21",
      "score": 12,
      "num_comments": 13,
      "upvote_ratio": 1.0,
      "text": "Lately I end my day tired but not really sure what I *actually* accomplished.\n\nMost of my time goes to small repetitive stuff, checking tools, moving info around manually, answering the same things over and over.  \nData is everywhere, emails, docs, tools… and I don’t have a clear picture of what’s going on at any moment.\n\nFeels like I’m “working” all day but my system is kinda messy.\n\nAnyone else feeling this?  \nHow do you keep things under control without losing your mind?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qe2un4/do_you_actually_feel_productive_or_just_busy_all/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "nzuckdf",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-16 01:52:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzujlnr",
              "author": "Solid_Play416",
              "text": "Thanks! I’ve read the rules and will make sure to follow them.  \nGlad to be here 👍\n\n>",
              "score": 1,
              "created_utc": "2026-01-16 02:31:42",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzv22gg",
          "author": "ops_architectureset",
          "text": "This shows up a lot in ops roles. The pattern behind it is that effort gets spent on glue work instead of decisions. When information lives across tools and has to be reconciled manually, you stay busy but never reach a stable state. Automation helps only if it removes repeat decisions, not just moves data faster. What usually helps is mapping where the same question or action repeats during the day and asking why it exists at all. If that loop is not addressed, no tool really fixes the feeling.",
          "score": 1,
          "created_utc": "2026-01-16 04:18:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzw2h9e",
          "author": "VizNinja",
          "text": "Automate the boring stuff. There are lots if ways to automate.  I am not an n8n fan. It's kludegy.  It's difficult to configure nodes. It has security risks if you don't know what you are doing.  \n\nAI isn't always the answer for automation.  Python is excellent and versatile.  I learned from the book 'Automate the boring stuff'\n\nIf you have the Microsoft platform there are many good tools for automation that are designed for business.\n\nI will tell you that after having automated 80% of my work flows. I had to get use to not needing to do things to feel productive.  I spend 90% of my time looking for how to provide automation that makes a difference for the organization.",
          "score": 1,
          "created_utc": "2026-01-16 09:08:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzwe9hn",
          "author": "techside_notes",
          "text": "Yeah, that feeling usually shows up for me when I haven’t clearly separated “keeping things running” from “actually moving something forward.” Busy days are often just maintenance days in disguise. What helped was mapping where my time was going for a week, not to optimize it, but just to see the loops. A lot of the fatigue came from context switching and rechecking things because I didn’t trust my system. Once I simplified where info lived and decided what deserved automation versus manual attention, the days felt calmer. I still do small repetitive stuff, but now it feels intentional instead of endless.",
          "score": 1,
          "created_utc": "2026-01-16 10:55:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzwtcee",
          "author": "ExtensionBench7270",
          "text": "Yep, very common.\n\nMost of that feeling comes from constant context switching and no single place to see what actually matters. Lots of motion, little clarity.\n\nWhat helps isn’t hustle. It’s fewer tools, clearer priorities, and cutting or batching the repetitive stuff. Once the noise drops, you can actually see progress again.",
          "score": 1,
          "created_utc": "2026-01-16 12:47:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzyqjp6",
          "author": "dailyintelco",
          "text": "Yeah, this is exactly where delegation or automation starts to matter. If you’re spending most of your day repeating the same actions or moving info around, that’s usually a sign the system should be doing more of that work for you. Even small automations or handing off low-value tasks can free up a lot of mental space.",
          "score": 1,
          "created_utc": "2026-01-16 18:18:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o03tlds",
          "author": "ActiveDisaster1687",
          "text": "Same here. I spend all my time on repetitive tasks, when I finally try to get some work done, I'm called into meetings. I get dazed from all the context switching. Sometimes I feel like just sitting in front of the monitor, and the day is already over.",
          "score": 1,
          "created_utc": "2026-01-17 14:01:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o08z4kw",
          "author": "signal_loops",
          "text": "when your day is dominated by context switching, manual handoffs, and reactive work, your brain registers effort but not progress because nothing ever feels done. the way out isn’t working harder or adding another app, it’s reducing the number of places work can hide and making outcomes visible. that usually means picking a single source of truth for tasks or state  batching repetitive work instead of responding instantly, and automating or templating the small things that repeat daily so your attention is reserved for decisions, not movement. agood litmus test is asking yourself at the end of the day,   What changed because of my work?  If that’s hard to answer, it’s a sign your system needs tightening, not that you’re failing. most people who regain a sense of productivity don’t do more they design their workflows so progress is obvious and friction is removed.",
          "score": 1,
          "created_utc": "2026-01-18 06:23:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o09rxmw",
          "author": "autom8r_",
          "text": "It's definitely worth putting in the effort upfront to configure a system that can help you break out of this loop.",
          "score": 1,
          "created_utc": "2026-01-18 10:44:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzud3gu",
          "author": "automator71",
          "text": "This hits different. I had the exact same problem until I started building automations for the repetitive stuff. The key thing I realized is that \"busy\" usually means you're doing the same manual tasks over and over.\n\n\n\nNow I use n8n and Make to handle the data shuffling, email management, and tool switching. Frees up so much mental energy to actually focus on the work that matters.\n\n\n\nThe difference? Actual completion vs constant context switching. Small automation can seriously change how you feel about your workday.",
          "score": 1,
          "created_utc": "2026-01-16 01:55:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzuk1h5",
              "author": "Solid_Play416",
              "text": "100% this.  \nThat “busy = same manual loops” realization is huge.\n\nWhat surprised me the most wasn’t even the time saved, but how much calmer the workday feels once context switching drops. Like… fewer tabs, fewer decisions, fewer “where was I?” moments.\n\nCurious: did you automate everything at once, or did you start with one annoying workflow and build from there?",
              "score": 0,
              "created_utc": "2026-01-16 02:34:10",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qi0bmj",
      "title": "Automated viral Reddit trend monitoring (20+ hours of browsing saved)",
      "subreddit": "automation",
      "url": "https://i.redd.it/ye92hdy64ieg1.png",
      "author": "ScratchAshamed593",
      "created_utc": "2026-01-20 12:53:47",
      "score": 11,
      "num_comments": 13,
      "upvote_ratio": 0.87,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qi0bmj/automated_viral_reddit_trend_monitoring_20_hours/",
      "domain": "i.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "o0nqyqx",
          "author": "National-Text-8901",
          "text": "Awesome I want this workflow",
          "score": 3,
          "created_utc": "2026-01-20 13:00:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0t6xcw",
              "author": "ScratchAshamed593",
              "text": "Thank you. I have attached the template link in the post now.",
              "score": 1,
              "created_utc": "2026-01-21 06:11:15",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0ny829",
          "author": "great_stranger1",
          "text": "Which software made up on?",
          "score": 3,
          "created_utc": "2026-01-20 13:43:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0su28j",
              "author": "ScratchAshamed593",
              "text": "NoClick",
              "score": 1,
              "created_utc": "2026-01-21 04:36:25",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0nrvjh",
          "author": "arommelaere",
          "text": "What's the software you use ?",
          "score": 2,
          "created_utc": "2026-01-20 13:05:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0su0d1",
              "author": "ScratchAshamed593",
              "text": "This software is NoClick.",
              "score": 2,
              "created_utc": "2026-01-21 04:36:04",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o0q57f1",
              "author": "Right-Afternoon9777",
              "text": "It appears to be n8n. the open sourced automation tool",
              "score": -2,
              "created_utc": "2026-01-20 19:57:39",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0o506e",
          "author": "jannemansonh",
          "text": "Cool stuff! Can you also search past things?",
          "score": 2,
          "created_utc": "2026-01-20 14:19:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0su7m2",
              "author": "ScratchAshamed593",
              "text": "You can modify the workflow for that. But currently this focuses on latest news.",
              "score": 1,
              "created_utc": "2026-01-21 04:37:26",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0tfkz2",
          "author": "abhbaijal",
          "text": "Hi, any chance you could build a free automation for me? I have an Instagram related use case",
          "score": 2,
          "created_utc": "2026-01-21 07:25:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0tq50s",
              "author": "ScratchAshamed593",
              "text": "Hi, Could you please DM me with the Automation task? Thank you",
              "score": 1,
              "created_utc": "2026-01-21 09:05:05",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0npzfg",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-20 12:53:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0we2ib",
          "author": "LiteratureSlight3608",
          "text": "I don't get it. There's already a trending tab and trending search results embedded inside of Reddit. What are you exactly trying to solve?",
          "score": 0,
          "created_utc": "2026-01-21 18:23:16",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qfj9mg",
      "title": "How to pick a process to automate that sticks?",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qfj9mg/how_to_pick_a_process_to_automate_that_sticks/",
      "author": "abdush",
      "created_utc": "2026-01-17 17:29:56",
      "score": 11,
      "num_comments": 12,
      "upvote_ratio": 1.0,
      "text": "Working with a retail firm to help their Ecomm team identify processes they can automate. I am not an expert in this and doing this as a help. \n\nThe company has tried doing several automations on various processes from inventory management, supplier invoicing and so on. But none are getting used every day, or by all team members - because either they are comfortable doing the old way, most automation done needs keeping a diligent watch for any errors, or fully automated processes are just good to have or minor part of a bigger work\n\nThis also makes wider team hesitate to use AI\n\nWhat would be a good approach in this scenario? Are there any processes you feel can be reliably automated in Ecomm and retail?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qfj9mg/how_to_pick_a_process_to_automate_that_sticks/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "o04zwlh",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-17 17:30:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o057e3g",
          "author": "Accurate_Apricot_827",
          "text": "What data points do you have? Are you able to \"shadow\" them during a normal workday e.g through their slack channel or something similar? Good analysis will only happen with good data",
          "score": 1,
          "created_utc": "2026-01-17 18:04:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o058c5t",
              "author": "abdush",
              "text": "I m allowed to have zoom calls - generally 30 mins to 45 mins with various team members. I won’t get access to their systems",
              "score": 1,
              "created_utc": "2026-01-17 18:09:21",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o07vlo1",
          "author": "Electronic-Cat185",
          "text": "the automations that stick usuallly remove a pain everyone feels daily, not a theoretically efficient step. if a processs is only used weekly or needs constant babysitting, people willl defaullt back to muscle memory. i would start by mapping where errors, delays, or copy paste work cause the most frustratiion, not where automation looks impressive. In retail and ecomm, things like report prep, alerts for exceptions, or data cleanup tend to get adopted because they support existiing workflows instead of replaciing them. Adoption follows trust, and trust comes from boring reliability more than clever AI.",
          "score": 1,
          "created_utc": "2026-01-18 02:10:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o08v937",
          "author": "ChestChance6126",
          "text": "Automations stick when they remove daily pain, not when they’re technically impressive. Focus on high-frequency, low-judgment tasks that multiple people already hate doing. If it needs babysitting or only saves a little time, teams will ignore it.",
          "score": 1,
          "created_utc": "2026-01-18 05:51:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o093qjm",
          "author": "signal_loops",
          "text": " tie each automation to a simple, observable metric time saved per week, error reduction, faster decisions so the team sees value quickly  once one or two automations become boringly reliable, trust tends to follow and broader AI adoption becomes much easier.",
          "score": 1,
          "created_utc": "2026-01-18 07:02:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o099rbj",
          "author": "Ancient-Subject2016",
          "text": "At scale, the issue usually is not picking the “right” process, it is picking one where failure is boring and visible. Automations that stick tend to sit in the critical path, have a clear owner, and save time every single day, not occasionally. If people have to babysit it or double check outputs, adoption dies fast and trust goes with it. I would start by mapping where errors escalate today and asking which steps leadership actually cares about when they break. Inventory, pricing, refunds, and order exceptions can work, but only if there is tight monitoring and a clear rollback when something goes wrong. Teams hesitate to use AI when accountability is fuzzy, not because they dislike automation.",
          "score": 1,
          "created_utc": "2026-01-18 07:56:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o09t0xp",
          "author": "Beneficial-Panda-640",
          "text": "What usually makes automation stick is less about picking the “right” process and more about picking the right pain. If a process only saves time on a good day, people will fall back to muscle memory. The ones that get adopted tend to remove a recurring annoyance or risk, like constant rework, late surprises, or manual reconciliation that no one enjoys. I’d look for work that is frequent, boring, and already mentally tax­ing, especially around handoffs. Also worth noticing that low trust kills usage fast. If people have to babysit the automation, it feels like extra work. Starting with partial automation that makes the work easier, not invisible, often builds more confidence than trying to go fully hands off too early.",
          "score": 1,
          "created_utc": "2026-01-18 10:54:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0aj728",
          "author": "signalpath_mapper",
          "text": "The automations that stick usually remove pain people feel every single day. If it is optional or \"nice to have,\" it dies fast. At our volume, anything that still needed constant babysitting also got ignored because it added stress instead of removing it. What worked was starting with the ugliest, most repetitive work that no one wanted to defend, things like order status updates, basic refunds, or data handoffs between systems. If the automation cannot run quietly and fail safely, people will not trust it. Adoption follows reliability, not novelty.",
          "score": 1,
          "created_utc": "2026-01-18 14:10:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0bowjq",
          "author": "MuffinMan_Jr",
          "text": "Do you have access to the api's for the tools that they use?\n\nI collect logs from tools that my clients are actually using and use timestamps to tell me what to automate next. If a process takes long, or longer than expected, I'll know about it.\n\nI built a tool to automate this, but you could easily build a lightweight version of this yourself with airtable",
          "score": 1,
          "created_utc": "2026-01-18 17:37:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0etaho",
          "author": "Fun-Hat6813",
          "text": "been through this exact situation with a bunch of mid-market companies. the problem isn't the automation tech - it's that you're automating the wrong stuff. people keep trying to automate these big complex processes that touch everything, but that's backwards.\n\n\n\nstart with the most annoying repetitive task that takes 15-30 minutes and happens multiple times per day. for ecomm teams that's usually order confirmation emails, tracking number updates, or basic customer service responses. not sexy but it's what actually gets adopted because people HATE doing it manually. at Starter Stack AI we learned this the hard way - tried to automate entire loan processing workflows before realizing teams just wanted help with document extraction first. once they trusted that small piece, then we could expand.\n\n\n\nfor retail specifically, i'd look at return processing first. it's repetitive, has clear rules, and when it breaks everyone notices immediately (unlike inventory forecasting where errors hide for weeks). plus returns are increasing every year so the pain is getting worse. automate the initial return request categorization and approval for standard cases - leave edge cases to humans. that gives you quick wins, builds trust, and most importantly people will actually use it because it removes work they despise doing every single day.",
          "score": 1,
          "created_utc": "2026-01-19 03:06:01",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}