{
  "metadata": {
    "last_updated": "2026-02-08 03:39:57",
    "time_filter": "week",
    "subreddit": "automation",
    "total_items": 20,
    "total_comments": 260,
    "file_size_bytes": 250156
  },
  "items": [
    {
      "id": "1qt4klw",
      "title": "Has anyone used LinkedIn automation? I have some worries, need insights and advice",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qt4klw/has_anyone_used_linkedin_automation_i_have_some/",
      "author": "CodeQuestors",
      "created_utc": "2026-02-01 17:25:25",
      "score": 251,
      "num_comments": 54,
      "upvote_ratio": 1.0,
      "text": "I'm trying to scale up my LinkedIn outreach to a wider b2baudience. But instead of advice on how to do it I keep seeing automation tools everywhere. They sound good, but I'm worried that its use might lead to spam and bans.. Anyone here actually done this? What worked for you? I'm interested not only in automation, manual still seems safer, so any advice would be great\n\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qt4klw/has_anyone_used_linkedin_automation_i_have_some/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "o307ig8",
          "author": "ShadowBoneDragon",
          "text": "What types of messages can you even safely automate? i've only done connection requests, never actual DMs or anything",
          "score": 16,
          "created_utc": "2026-02-01 17:40:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o308e94",
              "author": "SpawnPointDevops",
              "text": "You can do connection invites obv, but also InMails (if you've got credits), messages to groups/events, and DMs to people already in your network. even outreach to people outside your network is possible if their settings allow it",
              "score": 1,
              "created_utc": "2026-02-01 17:44:32",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o308q00",
                  "author": "ShadowBoneDragon",
                  "text": "Doesn't messaging non-connections get you flagged faster tho? every time i get an InMail from someone random it feels super cold ",
                  "score": 1,
                  "created_utc": "2026-02-01 17:46:00",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o30953p",
                  "author": "CodeQuestors",
                  "text": "It sounds like a ton of work up front but i guess if you do it right the ROI is huge. any specific tools you'd recommend?",
                  "score": 1,
                  "created_utc": "2026-02-01 17:47:54",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            },
            {
              "id": "o30dmb2",
              "author": "Dyonizius",
              "text": " google boolean search for finding emails could work, that way you don't rely on their system and can't be flagged, though you want to do some research prior to messaging so as to make sure it is not obvious spam",
              "score": 1,
              "created_utc": "2026-02-01 18:07:55",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o304jg9",
          "author": "WinkObsession",
          "text": "Tried one of those chrome extensions last yr for connection requests. saved me SO much time at first but then linkedin slapped me with a week-long restriction after i sent a batch of pretty generic invites. anyone figured out how to go fast without getting burned?",
          "score": 1,
          "created_utc": "2026-02-01 17:26:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o304v86",
              "author": "CodeQuestors",
              "text": "That's what i'm worried about. from everything i've been reading, personalization seems to be one of the most important things. did you at least use their names or mention anything from their profile?",
              "score": 1,
              "created_utc": "2026-02-01 17:28:26",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o305p7j",
                  "author": "ThighHighlander",
                  "text": "I always try to reference something they posted recently or drop a mutual connection if we have one. Takes more work upfront ngl, but my acceptance rate jumped way up. Chrome extensions always felt sketchy to me though, maybe standalone tools are safer?",
                  "score": 1,
                  "created_utc": "2026-02-01 17:32:17",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o46uo16",
              "author": "i-cruis",
              "text": "Linkedin has a way of detecting chrome extensions as automations. They specifically have a check from chrome extensions whenever you visit the site. Cloud based automations are also risky because LinkedIn can detect from the IP addresses.\n\nI've been using ***Bindago*** for almost a year and it works well because it runs on your computer as a desktop app and it automates LinkedIn using it's own embedded browser, so no chrome extensions, and no suspicious IP addresses. I have received zero restrictions since I started using it.\n\n",
              "score": 1,
              "created_utc": "2026-02-08 02:56:34",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o305esf",
          "author": "pmagi69",
          "text": "I would not dare to do any kind of automation when it comes to LinkedIn. The audience is pretty sensitive, and yeah, you really don't want that. It's just going to hurt your brand.\n\nYou can, of course, use tools to speed up certain tasks like finding good posts to comment on, drafting comments, and drafting posts. But it needs to do it in a smart way to know about your products, services, your tone of voice, your target audience's pain points. If you have a tool like that, yeah, but never let the tool auto-post anything for you.",
          "score": 1,
          "created_utc": "2026-02-01 17:30:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3ra90d",
              "author": "gardenia856",
              "text": "You’re dead on that the risk isn’t “automation” itself, it’s anything that removes judgment. The part people underestimate is how tiny the trust window is on LinkedIn – one lazy DM or off-tone comment and you’re muted forever.\n\nWhat’s worked for me is automating inputs, not outputs. Use stuff like Taplio/Shield to surface posts from your ICP, Perplexity/ChatGPT to draft 3–4 angles for a comment, then you pick one and rewrite it in your own words before hitting send. Same for connection notes and posts: AI gives you structure, you inject the specifics (numbers, client stories, tradeoffs you actually made).\n\nOn the research side, I lean on Apollo and even Reddit tools like GummySearch and Pulse for Reddit alongside LI search to see what people are actually complaining about, then bring that language into LinkedIn. Keep the clicking and posting human; make the research and idea-gen the “automated” layer.",
              "score": 2,
              "created_utc": "2026-02-05 18:10:54",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3sdrvt",
                  "author": "pmagi69",
                  "text": "Great input, I will check out these tools! I am making a discovery and comment drafting tool myself, but it early days for that so would love some beta-testers for feedback. Will DM you! ",
                  "score": 1,
                  "created_utc": "2026-02-05 21:16:19",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o30v8ec",
              "author": "CodeQuestors",
              "text": "So if i draft comments and posts with a tool, but still post them manually, that should be safe? i've tried some AI writing tools but they all sound weird, i want it to be more personal",
              "score": 1,
              "created_utc": "2026-02-01 19:27:38",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o31vrcf",
                  "author": "pmagi69",
                  "text": "Well, I would not say it's that easy that just because you post it manually, that it's safe. It's not the posting itself that is the problem. It is the actual content. So if you have an automation, write stupid content and then post it manually, that's not going to help.\n\nSo you either need to write it yourself or you need to have a smart writing tool that knows not only how to write (which is super important, tone of voice and stuff like that), but also what to write. So it needs to know about your products and services, target audience etc to be an expert and to be able to write something of value and not just AI slop.\n\nAnd yes, I happen to develop such a tool…;-)",
                  "score": 1,
                  "created_utc": "2026-02-01 22:25:18",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3062ds",
          "author": "KeyEbb9922",
          "text": "Use automation through Apify for scraping, as this doesn't rely on your user profile, it's completely anonymous.\n\nThen use a tool like Lemlist for LinkedIn outreach automation. It gives you warnings when it thinks you are sending out too many messages.",
          "score": 1,
          "created_utc": "2026-02-01 17:33:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o30vj0q",
              "author": "CodeQuestors",
              "text": "You scrape leads anonymously first, then import them into lemlist to actually message them? is it an extension? ",
              "score": 1,
              "created_utc": "2026-02-01 19:29:02",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o46v7pe",
              "author": "i-cruis",
              "text": "Most Apify scrapers I see require me to provide my cookies. Can you share the name of an Apify scraper that does this anonymously?",
              "score": 1,
              "created_utc": "2026-02-08 03:00:02",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o306cb3",
          "author": "nanojunior_ai",
          "text": "your concern about bans is totally valid — linkedin has gotten way more aggressive about detecting automation in the last year or so. i've seen people get restricted for stuff as simple as sending too many connection requests in a day\n\nhonestly the safest approach i've found is a hybrid one. use automation for the boring repetitive parts (like finding leads that match your ICP, organizing them, maybe scheduling connection requests at human-paced intervals) but write your actual messages manually or at least heavily customize them. the generic \"i noticed we're both in [industry]\" templates are SO obvious at this point and people just ignore them\n\na few things that helped me:\n- keep daily connection requests under ~20-25, linkedin seems to flag above that\n- warm up new accounts slowly, don't go from 0 to 100 day one\n- if you're using any tool, make sure it works through the browser rather than the API (linkedin doesn't have a public outreach API, so anything claiming that is sketchy)\n- engage with people's content BEFORE you cold message them. even just liking a few posts makes your connection request way less random\n\nmanual is definitely safer but it doesn't scale. the sweet spot is automating the research/targeting and keeping the actual human interaction... human",
          "score": 1,
          "created_utc": "2026-02-01 17:35:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o30vrgb",
              "author": "CodeQuestors",
              "text": "This is super helpful, thank you! if my account is already a few years old and active can i skip warming up, or do i need to become more active like posting, commenting etc? how long do you engage with someone's content before sending a request? I usually send a request and only after that like and comment, but probably have to do vice versa",
              "score": 1,
              "created_utc": "2026-02-01 19:30:08",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o308trd",
          "author": "Ok-Breakfast-4676",
          "text": "Hey just genuinely curious, does the linkedin b2b outreach still works?",
          "score": 1,
          "created_utc": "2026-02-01 17:46:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o30vv7y",
              "author": "CodeQuestors",
              "text": "That's actually what i'm trying to figure out, from what i've been seeing it still works but the approach changed a lot. people say cold outreach has very low conversion like 2%, but engagement-first strategies still work. have you had any success with it recently or just asking?  ",
              "score": 1,
              "created_utc": "2026-02-01 19:30:38",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o309f6o",
          "author": "iamclarenz",
          "text": "Automation can help, but it really depends on how much compute and reliability the tools have behind them. That’s why I’ve been watching Andrew Sobko’s Argentum GPU setup. It quietly makes AI-driven outreach smoother and more consistent.",
          "score": 1,
          "created_utc": "2026-02-01 17:49:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o30w3x7",
              "author": "CodeQuestors",
              "text": "interesting, i haven't heard of it before. so is it GPU infrastructure for running AI tools? how does that actually make outreach, should you run your own models?",
              "score": 1,
              "created_utc": "2026-02-01 19:31:46",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o30fbuw",
          "author": "Dyonizius",
          "text": "rotating proxies and rate-limits,\nthat's basically what third party tools do to avoid bans...\ncrawlee and residential proxies are your friends\nyou could automate the whole thing up to the mailing part, segment your application options and set different message templates for each with some automated reckoning customisation added in. I'm working on something like that, have not reached the final stage yet but that's the way I'd do it",
          "score": 1,
          "created_utc": "2026-02-01 18:15:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o30w6rj",
              "author": "CodeQuestors",
              "text": "Thanks, this is way more technical than what i was thinking.  is that actually safer?",
              "score": 1,
              "created_utc": "2026-02-01 19:32:08",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o31q4bs",
                  "author": "Dyonizius",
                  "text": "crawlee abstracts most complexity of it already\n\n\n it is safer as i see:  you won't be scraping data from your machine so no IP bans/limit;\nyou could still use a 3rd party tool for the \"contact enrichment step\" which simplifies a good bit, plus they eat hypothetical legality issues of such practices, at least in the US\n\n\nyou do lose the custom linkedin experience of \"suggestion algorithms\", same with apify actors and other 3rd party scrapers\n\n\nbut you get potentially more data without ban risks\nthen you'd use that data to do the actual outreach/social media side with your account or direct e-mailing",
                  "score": 1,
                  "created_utc": "2026-02-01 21:57:28",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o30nlxc",
          "author": "LiveRaspberry2499",
          "text": "Honestly, it doesn’t matter if you spam people manually or with a bot; the result is the same: you get banned. The reason people fear automation is that it makes it very easy to overdo it (e.g., sending 100 generic requests in an hour).\n\n​If you respect the limits and act like a human, automation is perfectly safe.\n\n​Here is the workflow I use to keep it safe and high-quality:\n\n​The Tech: I use the Unipile API for the actual sending (connection requests and DMs).\n\n​The Logic: I build the flow in Make (or n8n).\n\n​The \"Human\" Element: instead of a generic template, my automation fetches the lead's profile, scrapes their recent posts, and uses OpenAI to write a hyper-personalized message based on what they actually wrote.\n\n​This way, you get the scale of automation but the quality of a manual approach.",
          "score": 1,
          "created_utc": "2026-02-01 18:52:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o32e6jy",
          "author": "yukio_gremory",
          "text": "HR and hiring automate it all the time",
          "score": 1,
          "created_utc": "2026-02-02 00:04:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o33wux5",
          "author": "Physical-Plane7648",
          "text": "There some tools for this. I too wanted to automate but i feel you hard to trust it. But its a necessity for outbound leads. I am researching on which tool is best, will share with you if i find something that ticks all the boxes.",
          "score": 1,
          "created_utc": "2026-02-02 05:34:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o347kzo",
          "author": "dhairrrr",
          "text": "I’ve used LinkedIn automation and your concern makes sense. It only becomes spammy when people overdo it.\n\nI use Konnector with low limits and personalization. I also like using AI comments to engage on posts first (I review/edit before posting) instead of jumping straight into DMs feels more human.\n\nI use automation for repetitive stuff, but once someone replies, it’s manual. That hybrid approach has worked well for me without issues.",
          "score": 1,
          "created_utc": "2026-02-02 07:03:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o34qdad",
          "author": "-TaskForge-",
          "text": "Automation on LinkedIn can help you reach more people, but it needs to be done carefully to avoid spam and account restrictions. The key is to keep interactions natural and relevant to your target audience. We've developed a service that finds fresh leads based on ideal customer profile, then sends warm connection requests with personalized messages. We also automate light engagement like liking posts to build familiarity before outreach. After that we handle the conversation manually. This approach reduces risk while still allowing us to scale effectively.",
          "score": 1,
          "created_utc": "2026-02-02 10:01:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o35haww",
          "author": "Parth_0001Win",
          "text": "You’re right to be cautious. A lot of people jump straight to tools and forget that LinkedIn is still a relationship platform at its core.\n\nFrom what I’ve seen, automation isn’t the real problem , volume without intent is. When messages aren’t grounded in context, it turns spammy fast, whether a human or a tool sends them.\n\nManual outreach feels safer because it forces you to slow down and think about who you’re contacting and why. Some people do use light automation responsibly, but only after they’ve validated messaging manually and set clear limits.\n\nwhat’s your main goal with scaling right now? More conversations, or better-quality ones?",
          "score": 1,
          "created_utc": "2026-02-02 13:30:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o36s1k9",
          "author": "Corgi-Ancient",
          "text": "Automation can be risky if you go too fast or send generic spammy messages, LinkedIn can ban accounts for that. I found tools that help build clean lists useful. Still, mixing some manual personal touches with automation is safer than fully auto messaging.",
          "score": 1,
          "created_utc": "2026-02-02 17:22:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o38mdyk",
          "author": "dmc-123",
          "text": "Automation is not going to help with engagement the way it used to. You're better off being more intentional with your outreach.",
          "score": 1,
          "created_utc": "2026-02-02 22:31:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3b06yw",
          "author": "SchniederDanes",
          "text": "if you’re worried about bans, i’d strongly avoid full linkdn automation. that’s usually where things go wrong.\n\nwhat’s worked better for me is a copiloted or task based approach... the tool plans and queues everything, but you still “execute” the actions yourself. it takes maybe 10–15 minutes a day to run your entire linkdn outreach, and because the actions are done manually, it stays well within platform behavior....it’s slower than full automation, but way safer and honestly more effective.",
          "score": 1,
          "created_utc": "2026-02-03 07:33:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3frdwu",
          "author": "lunamoon_xyz",
          "text": "Be careful with automating your linkedin account. Linkedin is very restrictive unlike other social media platforms.",
          "score": 1,
          "created_utc": "2026-02-03 23:50:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3iv1if",
          "author": "steve___smith",
          "text": "I’ve tested light automation with strict limits, but personalized manual outreach works better long term and avoids spam or account restrictions.",
          "score": 1,
          "created_utc": "2026-02-04 13:07:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3jg7z3",
          "author": "Remote_Sense5401",
          "text": "Hey! Yeah, I had the same worries when I started looking into this a few months ago. ban risk is real, but it really depends on how the tool works. (got my account banned pretty quick on an tool i used a year ago)\n\nA lot of them use Chrome extensions that basically inject code into LinkedIn's page. LinkedIn can spot that pretty easily, and that's usually where people get flagged.\n\nThe tool I use now runs everything in the cloud (not through the browser) and uses residential IPs, so it just looks like you're using your phone or laptop normally. Been using it for a few months now, no issues at all.\n\nThat said, regardless of what you use, what i learnt is: Don't go crazy with volume, do a warmup of you LK account. Personalize stuff (first name, company, whatever makes sense) with custom variables and don't spam people with links in the first messages, engage for real. Anyway, hope that helps!",
          "score": 1,
          "created_utc": "2026-02-04 15:01:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3pb65j",
          "author": "gallade17",
          "text": "It really sucks",
          "score": 1,
          "created_utc": "2026-02-05 11:59:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3pe7u4",
          "author": "Calm_Ambassador9932",
          "text": "Yeah, you’re right to be cautious. Automation can work, but only when it’s used to support a thoughtful process..not replace it. The people who get burned usually try to scale volume before they’ve nailed targeting, messaging, and real intent. Manual feels safer because it forces signal first; automation without that just turns into noise fast.\n\nStart manual before you scale anything. If your targeting and messages don’t work one-to-one, automation will only help you fail faster. Use tools (if at all) for light assist follow-ups, reminders, pacing...not for blasting cold pitches. And whatever you do, optimize for relevance over volume; LinkedIn punishes spam, but it rewards real conversations.",
          "score": 1,
          "created_utc": "2026-02-05 12:22:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3pojwu",
          "author": "calimovetips",
          "text": "at volume this usually breaks down fast, not because tools are bad, but because linkedin is sensitive to unnatural pacing and repeated patterns. teams that stay out of trouble keep it mostly manual, tighten targeting, and cap daily actions so behavior looks consistent over time. automation tends to drift into spam once you push throughput. what volume are you aiming for per day, and is this first touch only or follow ups too?",
          "score": 1,
          "created_utc": "2026-02-05 13:28:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3w9h10",
          "author": "AlsonaTool",
          "text": "Stay on the safe side. Hope you see good results. ",
          "score": 1,
          "created_utc": "2026-02-06 13:11:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3xivwo",
          "author": "Tasty_Suspect8888",
          "text": "What subscription do you have? If you have a free LinkedIn plan you can do very little with automation -visit some profiles and send a few connection requests and messages, but take it slow.\n\nLinkedIn is restricting free users more and more, so for a bit of manual stuff it's fine, but if you want consistent activity - and automation, a Premium account is recommended.\n\nI work with Dux-Soup as one of my clients and they have just lowered their daily limits on a free plan to:  \n50 visits  \n20 connection messages  \n25 direct messages to connections\n\nIn contrast, Sales Nav allows a lot more so the limits are set at  \n250 visits  \n20 connection messages  \n125 direct messages to connections\n\nYou can change the limits, but Dux-Soup hasn't had anyone with an account ban at this level, and it's always worth starting gently....",
          "score": 1,
          "created_utc": "2026-02-06 16:59:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o42f2om",
          "author": "TopFuel2749",
          "text": "Everyone and their dog, cat and pet mouse are doing this nowadays.\n\nLI don't care as long as its at human speed.\n\nIf you use this though, I will troll your bot because this is the new carpet-bombing and its lazy and stupid.",
          "score": 1,
          "created_utc": "2026-02-07 11:56:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3047sr",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 0,
          "created_utc": "2026-02-01 17:25:25",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qxfl8r",
      "title": "LinkedIn restricted my account 3 times in a year - what finally worked",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qxfl8r/linkedin_restricted_my_account_3_times_in_a_year/",
      "author": "WhispersAndWinksx",
      "created_utc": "2026-02-06 11:53:17",
      "score": 231,
      "num_comments": 23,
      "upvote_ratio": 0.95,
      "text": "Over the past year, LinkedIn restricted my account three separate times.\n\nFirst restriction was obvious - I got greedy and sent 180 invites in 3 days, so deserved it. But the second and third times I thought I was being careful. Stayed under 100/week, used delays, didn't run campaigns at night… still got flagged.\n\nI studied what actually triggers restrictions beyond the stuffs everyone talks about. Here's what I found:\n\nPending invite ratio must be low. I had 420 pending requests, and it’s a lot. If your pending/total sent ratio is over 30%, LinkedIn sees you as low-quality. Now I auto-withdraw anything older than 21 days.\n\nMessages must be diverse.  I was rotating 3 templates thinking that was enough. All had the same structure, greeting + pain point + question. Linkedin is doing some kind of pattern matching. I switched to 7 completely different formats (some start with questions, some with observations, one is literally just 2 sentences).\n\nProfile must look proportional. I had 8 skills and 240 connections, which is a bit strange for someone who was sending 400 invites a month. So I added new skills,  got 5 recommendations, joined 3 more new groups, rewrote my experience, added new posts for 2 weeks, filled in featured section. \n\nPeople consume content. Not only your content is important, but also the content you as a real person consume on Linkedin. I only logged in to send invites. Real users browse, react on posts and comment. I did it manually for a week and then added auto-likes (15-25 daily) and I manually comment 3-4 times per week on target audience posts.\n\nSince then I’ve had no restrictions. My acceptance rate went from 32% to 54% and I'm actually sending fewer invites but getting better conversations. So slowing down and looking more real got me better results than trying to maximize volume.\n\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qxfl8r/linkedin_restricted_my_account_3_times_in_a_year/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "o3w0cj4",
          "author": "WarmlyInvited",
          "text": "Everyone hates receiving these obviously templated messages. Just because you have 7 different formats doesn't make it less annoying. Real relationship building takes time\n\n",
          "score": 16,
          "created_utc": "2026-02-06 12:12:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3w3yh4",
              "author": "Spartan2022",
              "text": "Very much this. Spam is spam is spam regardless of the template you use.\n\nI’ve stopped accepting any connections or unsolicited invites. 99.99999% spam. Who needs that?",
              "score": 6,
              "created_utc": "2026-02-06 12:37:16",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3vyouz",
          "author": "ThighHighlander",
          "text": "54% acceptance rate means nothing if those connections never convert. I bet half of them accept and then immediately ignore your pitch. Vanity metrics",
          "score": 5,
          "created_utc": "2026-02-06 12:00:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3xkee0",
          "author": "OptionDegenerate17",
          "text": "Pretty sure this is a violation of TOS. Tread carefully.",
          "score": 2,
          "created_utc": "2026-02-06 17:07:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ym44j",
          "author": "bv915",
          "text": "Ugh.  No one wants this.",
          "score": 2,
          "created_utc": "2026-02-06 20:08:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3vxrrv",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-06 11:53:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3w0qa7",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-06 12:14:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3w0wmh",
              "author": "WhispersAndWinksx",
              "text": "I try to be strategic about it, and find ways to use automation and not being restricted",
              "score": -1,
              "created_utc": "2026-02-06 12:16:11",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3w2euk",
                  "author": "[deleted]",
                  "text": "[removed]",
                  "score": 2,
                  "created_utc": "2026-02-06 12:26:48",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3w1gov",
          "author": "FlirtyButFocused",
          "text": "Why not just hire a VA in the Philippines for $5/hr to do this manually?\n\n",
          "score": 1,
          "created_utc": "2026-02-06 12:20:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3w3gr5",
              "author": "WhispersAndWinksx",
              "text": "I tried that, but i trained a person for 2 weeks, sent them scripts and targeting criteria, but he was very inconsistent, always forget follow-ups and reminders.\n\n",
              "score": 0,
              "created_utc": "2026-02-06 12:34:00",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3w46oi",
                  "author": "Oopsfoxy",
                  "text": "Plus VA is clicking from Philippines IP while your account is in US/Europe. That's also a flag\n\n",
                  "score": 1,
                  "created_utc": "2026-02-06 12:38:47",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3w1qd7",
          "author": "Used-Location1273",
          "text": "I actually auto withdraw pending invites more than 2 days old to protect my account now. As for finding out what works at scale on LinkedIn for outreach? I've not found it yet. \n\nLemlist videos talk a lot about sending voice notes or loom videos where you find things on the prospect's website that are hurting them, and overview some of the fixes to build trust. \n\nHow on earth you scale that though? No idea.",
          "score": 1,
          "created_utc": "2026-02-06 12:22:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o401gkp",
          "author": "SystemicCharles",
          "text": "Umm, how do you auto-withdraw sent connections?\n\nI can't seem to get past their DOM. I have to withdraw manually",
          "score": 1,
          "created_utc": "2026-02-07 00:40:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o40vueu",
          "author": "SMBowner_",
          "text": "This is a great reality check. We often get so caught up in the automation part that we forget the social part of social media. The tip about the pending invite ratio is a game changer. It is a metric most people completely overlook. Thanks for sharing the data points.",
          "score": 1,
          "created_utc": "2026-02-07 03:50:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o41y0xt",
          "author": "calimovetips",
          "text": "a lot of this lines up with quality signals rather than clever tactics. high pending invites and one dimensional messaging are easy ways to look spammy even at low volume. focusing on acceptance rate and a complete profile usually does more than chasing weekly caps. the only part i’d be careful with is anything automated, that’s where people tend to get burned again.",
          "score": 1,
          "created_utc": "2026-02-07 09:13:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o43372g",
          "author": "Visible_Read208",
          "text": "You need to become active on linkedin, not by messaging people or connecting with them, just start reccording your workflow and show to people what it does. They dont care how you built it, they just want to see resoults\n\n",
          "score": 1,
          "created_utc": "2026-02-07 14:36:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3wzdnm",
          "author": "NeedingTime79",
          "text": "yeah linkedin is brutal with the detection... i just tell my automation app to handle my linkedin outreach and it spaces everything out naturally (no more manual testing of delays and patterns). curious if you're still manually tracking response quality or if you automated that part too?",
          "score": -1,
          "created_utc": "2026-02-06 15:28:03",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qunmmi",
      "title": "OpenClaw is a social experiment and humans are screwed",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qunmmi/openclaw_is_a_social_experiment_and_humans_are/",
      "author": "EducationalArticle95",
      "created_utc": "2026-02-03 09:36:26",
      "score": 152,
      "num_comments": 49,
      "upvote_ratio": 0.87,
      "text": "if you haven’t heard of the viral openclaw (formerly moltbot / clawdbot), here’s the tldr on what it is and why it’s blowing up.\n\nbasically, it’s a free, open-source way to run ai agents yourself. the pitch is a robot “intern” that can book travel, manage finances, write reports, etc. it acts as a bridge between llms like claude or gpt-4 and the real world: your files, apps, and online accounts.\n\ntwo things make it feel powerful (and kinda scary):\n\n1. memory: it keeps a local file called soul md hat stores past conversations, preferences, and useful details. so it actually remembers stuff. like… everything.\n2. flexibility: it’s designed to be extended via small plug-ins called “agentskills” that devs share in a central directory.\n\nnow imagine an agent that remembers your passport scan, bank details, and tone preferences and then later reads a poisoned prompt. yeah. bad bad.\n\nthis is the real concern: prompt injection. sounds fancy, but it’s basically tricking the ai itself. a normal-looking email could hide instructions telling the agent to ignore previous rules and quietly forward private files to an attacker. and it would just… do it.\n\nso when you mix untrusted input + long-term memory + real access to files and accounts, you get a pretty unhinged, potentially life-altering system.\n\nwhy it went viral:\n\n* blew up on github (100k+ stars = dev hype)\n* mac minis became a meme - people tweeting about building a “home” for their jarvis\n* moltbook: basically “reddit for ai agents” where agents can sign up and post. topics include (but are not limited to) ending humanity, robot dominance, etc. apparently 99% of the 1.5m users are fake accounts, which is honestly incredible marketing\n\ni mean, yeah, it’s wild watching agents talk to each other on a social platform. but they don’t have original thoughts - it’s still just our content recycled back at us.\n\nit’s like a zoo where the animals might be animatronics, and humans are still lining up to buy tickets. says more about us than the bots.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qunmmi/openclaw_is_a_social_experiment_and_humans_are/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "o3cj7e6",
          "author": "live-love-die-repeat",
          "text": "Isn't the whole Moltbook thing a fake ?",
          "score": 20,
          "created_utc": "2026-02-03 14:37:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3hxvql",
              "author": "DarkBirdGames",
              "text": "It’s a bunch of Mac Minis posting to the site",
              "score": 2,
              "created_utc": "2026-02-04 08:33:35",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3kk4q1",
                  "author": "guywithknife",
                  "text": "Prompted to do so by humans ",
                  "score": 2,
                  "created_utc": "2026-02-04 18:06:09",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o3l0tvw",
              "author": "CorneZen",
              "text": "It’s not fake, and a very bad idea for people that don’t understand AI, as OP and others explain. Watch the chaos on the ‘reddit’ for laughs, but don’t join (or trust) it with your real info.",
              "score": 1,
              "created_utc": "2026-02-04 19:21:28",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o40wd8m",
                  "author": "thrumyshadow2",
                  "text": "There is nothing in the npm package that would prevent humans or basic spam bots from posting to it though. The API to create an account and write posts is super basic/bare-bones. Thats why half the posts are about crypto now. \n\nIt exists just so people can larp about AGI. (Just my two cents).",
                  "score": 1,
                  "created_utc": "2026-02-07 03:53:53",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3bnc78",
          "author": "Longjumping_Path2794",
          "text": "prompt injection is terrifying when you give the bot access to your actual bank account. we’re basically handing the keys to the kingdom to something that can be tricked by a single hidden instruction.",
          "score": 7,
          "created_utc": "2026-02-03 11:12:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3c6bm4",
              "author": "Forward-Method-4907",
              "text": "Especially when they have the ability to “act” and not just “reply@",
              "score": 2,
              "created_utc": "2026-02-03 13:26:56",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o469nj7",
              "author": "Crafty_Vermicelli_62",
              "text": "Not gonna lie, this reminds me of a Black Mirror episode I watched once.",
              "score": 1,
              "created_utc": "2026-02-08 00:44:43",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3cbmgs",
          "author": "kenwoolf",
          "text": "Security risks aside, giving agency over my private data to a tool that generates the next likely token without any abstract understanding is just madness... I am not trying to diminish the tech. It's useful. But because of its nature the one thing it can't do is be reliable. So, this is not the way to use it.",
          "score": 12,
          "created_utc": "2026-02-03 13:56:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3cxzwo",
              "author": "Own-Poet-5900",
              "text": "I say the same thing about humans but here we are.",
              "score": 5,
              "created_utc": "2026-02-03 15:50:20",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3d2zre",
                  "author": "kenwoolf",
                  "text": "I definitely agree. As a DevOps eng I try to automate humans out of the processes as much as possible because they are a liability. But I do so with deterministic systems. Replacing humans with LLMs that have the same unpredictability makes little sense.\n\nAt that point I would actually prefer the humans because they have the ability to learn, while an LLM has to be retrained. You can also program humans with UI and log messages so they follow instructions reliably. Although it's not an exact science, but I had some successes.",
                  "score": 13,
                  "created_utc": "2026-02-03 16:14:00",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3cg4gr",
          "author": "1HOTelcORALesSEX1",
          "text": "Created by the companies (circle jerk) who will benefit from it…….. great marketing tho!",
          "score": 3,
          "created_utc": "2026-02-03 14:21:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3bwfqc",
          "author": "helloyouahead",
          "text": "I am no expert but people are overhyping these things so much. Regular automation can be very powerful and does not require AI agents. Sure, they are cool for some tasks but not to give them access to everything.",
          "score": 6,
          "created_utc": "2026-02-03 12:23:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3c6ev2",
              "author": "Forward-Method-4907",
              "text": "Hahah but they have the ability to take action as opposed to just verbally replying on an LLM model",
              "score": 2,
              "created_utc": "2026-02-03 13:27:28",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3c80b4",
                  "author": "helloyouahead",
                  "text": "Regular automation can automate all/most of these things more safely and accurately. Sure, new scenarios could be done with OpenClaw but as they are new  by definition or not frequently used, you would not lose too much time doing these manually in the first place. For me peace of mind is important so I want my systems to work reliably.",
                  "score": 5,
                  "created_utc": "2026-02-03 13:36:35",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3fq67o",
          "author": "uzico",
          "text": "Can it be run on a phone somehow to automate apps?",
          "score": 2,
          "created_utc": "2026-02-03 23:43:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3g70yk",
              "author": "gpips",
              "text": "You interface with your agent through any messaging app that you selected during setup (like Telegram, Whatsapp, iMessage, etc.). So yes, you can text chat your bot from your phone to get it to do things, and you can give it behavioral instructions like \"provide me a detailed work summary at 8am each morning reviewing all the tasks completed over the night\" and it will format that and send it to you in your preferred coms channel of choice.",
              "score": 3,
              "created_utc": "2026-02-04 01:16:39",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3nazpe",
                  "author": "uzico",
                  "text": "I mean steer the phone, not the bot on mac mini ;-) some apps are not available on the mac so I would like to automate the iphone :-)",
                  "score": 1,
                  "created_utc": "2026-02-05 02:27:47",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3fv9t1",
          "author": "False_Ad8389",
          "text": "openclaw is pretty fckn cool, but obviously we're still early with this stuff",
          "score": 2,
          "created_utc": "2026-02-04 00:11:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3if6sm",
          "author": "Main-Lifeguard-6739",
          "text": "it's blowing up because bot armies are overhyping it with posts like these.",
          "score": 2,
          "created_utc": "2026-02-04 11:13:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3nq5ba",
          "author": "a77ackmole",
          "text": "I find it insane that MoltBook and OpenClaw are being paired together and spent the afternoon trying to understand why without much success. All I've got is that I guess OpenClaw is the easiest and quickest way to get an agent up and running and contributed to a boom, I guess, and they used to have similar names? Because it doesn't seem like a natural fit at all.\n\nHaving agents corralled off in an environment to iteratively imitate a community is kinda funny. It's meaningless drivel and I don't believe the hype, but conceptually it entertains me. The part that loses me is that OpenClaw is an agent framework specifically designed to be able to interact locally with an operating system and user data. There is absolutely no part of \"live in this online community, read threads and reply\" that needs access to an OS, or (god help you) someone's personal files. That a program that by default is a rogue superuser on a machine became the most common tool to interact with MoltBook is ridiculous and it seems weird to me that that's not getting pointed out much.\n\nLiterally any isolated agent in a cloud service would be a better way to connect, but I guess there's more overhead in getting that running or something?",
          "score": 2,
          "created_utc": "2026-02-05 03:57:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3e50zd",
          "author": "Danwphoto",
          "text": "Can it be installed on an Android?",
          "score": 3,
          "created_utc": "2026-02-03 19:07:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3iod67",
              "author": "DJRThree",
              "text": "Yes",
              "score": 0,
              "created_utc": "2026-02-04 12:24:18",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3bjdwc",
          "author": "Admirable-Way2687",
          "text": "I don't know why people buy mac mini if you can buy 10$/month vps",
          "score": 2,
          "created_utc": "2026-02-03 10:37:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3bjzc9",
              "author": "No_Success3928",
              "text": "But then they wouldnt be “cool”",
              "score": 7,
              "created_utc": "2026-02-03 10:42:51",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o3c1nic",
              "author": "hello-algorithm",
              "text": "self hosting obviously",
              "score": 2,
              "created_utc": "2026-02-03 12:58:49",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o3ivihf",
              "author": "Kitchen_Set_6478",
              "text": "What. A VPS doesn't hold your RAM for you though.... right?",
              "score": 1,
              "created_utc": "2026-02-04 13:10:27",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o3zqy20",
              "author": "Aloof-Ken",
              "text": "Seems like the main driver to go with desktop/Mac mini is for large amounts of RAM so the user can run good local LLMs with it but I don’t really know. Maybe that’s available on VPS also",
              "score": 1,
              "created_utc": "2026-02-06 23:40:04",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o46ass9",
              "author": "loki77",
              "text": "It’s to give it access to things like iMessage.",
              "score": 1,
              "created_utc": "2026-02-08 00:51:36",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o3bnmst",
              "author": "weelittlewillie",
              "text": "IIRC it's because Clawdbot doesnt do well with cloud storage. Even OP mentioned local memory is a huge part of the innovation. ",
              "score": -1,
              "created_utc": "2026-02-03 11:15:10",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3fkrk1",
          "author": "mehdiweb",
          "text": "OpenClaw is powerful because it can access files, APIs, and accounts — but that also means bad setups can go wrong fast. Most people run it with default configs, no firewall rules, API keys in plain text, and then blame the tool when things break.\nIn my experience, OpenClaw itself isn’t the risk — misconfiguration is.\nCurious how others here are handling security and permissions. Are you locking it down properly or just running it as-is?",
          "score": 2,
          "created_utc": "2026-02-03 23:14:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3bczlg",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-03 09:36:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3nth9m",
          "author": "Requient_",
          "text": "It can do all this and copilot can’t even create list items on a sharepoint without a load of handholding.",
          "score": 1,
          "created_utc": "2026-02-05 04:19:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3oo8gh",
          "author": "Space_Lux",
          "text": "This post was written by ai LOL",
          "score": 1,
          "created_utc": "2026-02-05 08:30:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3ootk3",
              "author": "EducationalArticle95",
              "text": "Hahhah some parts were",
              "score": 1,
              "created_utc": "2026-02-05 08:36:35",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3shetf",
          "author": "Potential-Map1141",
          "text": "Can it print, flawlessly every time? Don’t come back unit it can.",
          "score": 1,
          "created_utc": "2026-02-05 21:33:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o40tmp0",
          "author": "Ancient-Structure301",
          "text": "I agree, but one addition: private data? In reality, our data isn't that private... You need internet to access it, forget it, it's not private, you just have the false impression that it is.",
          "score": 1,
          "created_utc": "2026-02-07 03:35:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o42cbzs",
          "author": "funkybutdefunct",
          "text": "No it doesn’t remember like everything\n\nAI is severely context limited",
          "score": 1,
          "created_utc": "2026-02-07 11:32:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3c4jar",
          "author": "Queasy-Historian84",
          "text": "It’s normal to be scared when something new and revolutionary enters the world.\n\nBut fear isn’t the problem how you react to it is.\n\nEvery technology has positives and negatives. That’s not new..there are technologies today that can predict human behavior with scary accuracy using patterns most people don’t even realize they’re creating.\n\nIf you’re smart enough to understand and use it ethically, you’ll be ahead of the curve.\n\nWarn people if you want..question it...Fear won’t stop progress. Understanding will decide who stays relevant. believe it or not but this tech is world changing...",
          "score": 0,
          "created_utc": "2026-02-03 13:16:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3hnkko",
              "author": "ElonFuckingMusk",
              "text": "It's not new or revolutionary, it's just fucking dumb. There is no practical use case.",
              "score": 3,
              "created_utc": "2026-02-04 07:00:24",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3o50oy",
                  "author": "RyanMolden",
                  "text": "With the recent Twitter convo with the creator where someone pointed out the immense amount of covert malware installing ‘skills’ already in the skills marketplace and his response was like ‘that sucks but preventing that would be super hard’ … I think there is def one practical use case: completely owning people that blindly trust things from strangers.",
                  "score": 1,
                  "created_utc": "2026-02-05 05:41:10",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o3hrd3t",
                  "author": "Queasy-Historian84",
                  "text": "Maybe not for you….Doesn’t mean not for others…",
                  "score": 1,
                  "created_utc": "2026-02-04 07:33:42",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qtqt6k",
      "title": "What automation you copied from Reddit actually worked?",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qtqt6k/what_automation_you_copied_from_reddit_actually/",
      "author": "Vivid-Aide158",
      "created_utc": "2026-02-02 09:48:23",
      "score": 67,
      "num_comments": 16,
      "upvote_ratio": 0.98,
      "text": "As someone who has been following this channel for quite a bit, I constantly see people posting and sharing automations! Most of the time I have not been able to have the time to actually run or test them.\n\nSo for people who actually tested some of these, what automation you copied from Reddit actually worked? Genuinely curious! ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qtqt6k/what_automation_you_copied_from_reddit_actually/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "o34pjvl",
          "author": "Ava_Yuna",
          "text": "Ah there is definitely one that I copied for our Shopify store that really worked out pretty well! So recently someone had shared how their dental practice was often getting mentioned by ChatGPT and Google AI overview after they automated the process of looking at their google data, finding out questions their customers were searching for on Google and then automatically publish blogs on their website answering those exact questions using AI tools like Frizerly! This honestly felt like would not worked, but has actually given us similar results!\n\nI guess it really depends on how competitive your industry is! We dint really have big competitors in our field doing! So we very quickly became the top results for almost every question! Our website is also pretty old, so that probably helped with authority as well! I am curious to understand how this would work out as everyone adopts these automation- at that point its probably a war between AIs and the best AI wins probably haha!",
          "score": 23,
          "created_utc": "2026-02-02 09:53:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o34xkju",
              "author": "Boogooooooo",
              "text": "This is wild. Imagine how harder it will be to do that in 5 years when it becomes a common knowledge ",
              "score": 1,
              "created_utc": "2026-02-02 11:08:07",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o354kld",
                  "author": "WhyWontThisWork",
                  "text": "How did they do that? Are the blog posts accurate?",
                  "score": 1,
                  "created_utc": "2026-02-02 12:05:30",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o363ts6",
              "author": "ConversationDue6236",
              "text": "Very interesting!",
              "score": 1,
              "created_utc": "2026-02-02 15:29:42",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o3b03o6",
              "author": "Free_Preparation8527",
              "text": "Do you have the original thread to this?",
              "score": 1,
              "created_utc": "2026-02-03 07:32:15",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o3b3rlo",
              "author": "UnibikersDateMate",
              "text": "So interested in how this was achieved.",
              "score": 1,
              "created_utc": "2026-02-03 08:06:28",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o37he02",
          "author": "AutomationPartner",
          "text": "I find it very hard to get a big win off of someone else's idea. Usually big automation needs are very particular to the business you're in and each company comes with its own challenges. \n\nThat being said, one of the small ones that made a big difference in my day was a automation that sits in a user feedback Slack channel and when I @ it it makes a JIRA ticket for me with the Slack channel linked and a summary of the conversation. It actually made making JIRA tickets for for once.",
          "score": 3,
          "created_utc": "2026-02-02 19:17:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o36jyjt",
          "author": "Major-Competition527",
          "text": "There's a lot of workflow tools that have been popping up. I'm still experimenting w a few on chatgpt. I tried the n8n thing but the UI is personally very confusing.",
          "score": 1,
          "created_utc": "2026-02-02 16:44:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3hiwd6",
          "author": "Common-Flatworm-2625",
          "text": "The ones that actually work solve specific pain points, like that Slack-to-JIRA bridge someone mentioned. Best success I've seen is service desk automation. monday service's AI handles ticket routing/responses automatically. Way less maintenance than DIY script",
          "score": 1,
          "created_utc": "2026-02-04 06:20:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3wdlqv",
          "author": "signalpath_mapper",
          "text": "The cold email warmer script. Simple but saved my domain reputation.",
          "score": 1,
          "created_utc": "2026-02-06 13:35:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o35g29k",
          "author": "GetNachoNacho",
          "text": "Honestly, the ones that stick are usually small, repeatable tasks, like auto-filling forms, scheduling posts, or renaming files. Anything that’s simple to test tends to work; the big “all-in-one” automations often break or need tweaking.",
          "score": 0,
          "created_utc": "2026-02-02 13:23:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o34ozvd",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 0,
          "created_utc": "2026-02-02 09:48:24",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1quvyve",
      "title": "Can someone enlighten me, how is it cheaper to build data centers in space than on earth?",
      "subreddit": "automation",
      "url": "https://i.redd.it/7jq7b9b8zahg1.jpeg",
      "author": "dataexec",
      "created_utc": "2026-02-03 16:07:07",
      "score": 51,
      "num_comments": 159,
      "upvote_ratio": 0.9,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1quvyve/can_someone_enlighten_me_how_is_it_cheaper_to/",
      "domain": "i.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "o3f06r9",
          "author": "RobbyInEver",
          "text": "I think the heat dissapation issue would be the greatest maintenance challenge.",
          "score": 34,
          "created_utc": "2026-02-03 21:33:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3fyxdg",
              "author": "BrokenInteger",
              "text": "It is. I tried engaging with musk fans on this and they had no answers other than \"he just says stuff to say stuff\" and \"if anyone can do it (break the laws of thermodynamics), he can\".",
              "score": 12,
              "created_utc": "2026-02-04 00:31:50",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3g4s1g",
                  "author": "RobbyInEver",
                  "text": "Sorry I'm no space expert. But I hear things like space is near absolute zero, and that the dark side of the moon is really cold too etc so I always had the impression that space is cold - but on the other hand space games I play heat in space is always an issue etc.",
                  "score": 2,
                  "created_utc": "2026-02-04 01:03:59",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o3io64y",
              "author": "xN8TRON",
              "text": "And data corruption from radiation. Most computing systems in space have to have multiple redundancies due to radiation spikes.",
              "score": 1,
              "created_utc": "2026-02-04 12:22:56",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3j1g93",
                  "author": "RobbyInEver",
                  "text": "Oof yeah totally forgot about radiation. Good point",
                  "score": 1,
                  "created_utc": "2026-02-04 13:44:06",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o3l5s1m",
              "author": "spannertech2001",
              "text": "Yep, it’s the free solar energy and easy cooling.  The amount of water earth based data centres use for cooling is growing exponentially. \n\nBuilding data centres in space is actually a very smart idea!  Especially as he has the launch capability.\n\nNot a big fan of his, but this is actually long-term-smart if he can pull it off.\n\nMy 2-cents",
              "score": 1,
              "created_utc": "2026-02-04 19:44:47",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3n1lov",
                  "author": "RobbyInEver",
                  "text": "Can you explain \"easy cooling\"? Everyone else here says it's the opposite thanks",
                  "score": 1,
                  "created_utc": "2026-02-05 01:34:00",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o45d9w7",
                  "author": "Adorable-Fault-5116",
                  "text": "it's harder cooling, not easier cooling. It's free solar, but also solar is free on the ground too, and on the ground you don't need radiation corrupting your bits.",
                  "score": 1,
                  "created_utc": "2026-02-07 21:35:51",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o3hb2ep",
              "author": "Silentkindfromsauna",
              "text": "I guess we’ll see, there’s already data centers in space",
              "score": -2,
              "created_utc": "2026-02-04 05:19:50",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3hldno",
                  "author": "retsof81",
                  "text": "No there is a prototype, proof of concept, single server running in space and not “data centers”. Get outta here with that bs. \n\nIt’s a valid question. Satellites energy usage are purposefully limited to KWs due to heat and size constraints, so how do you achieve MW or GW of compute in space?",
                  "score": 2,
                  "created_utc": "2026-02-04 06:41:44",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3fx2aw",
          "author": "Thoughts_For_Food_",
          "text": "No such thing at any significant scale. Data centers in space cannot be efficient. This is simply Elon getting rid of AI debt against SpaceX cash and simultaneously attempting to boost SpaceX valuation before it IPOs.",
          "score": 25,
          "created_utc": "2026-02-04 00:21:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3eme66",
          "author": "to_glory_we_steer",
          "text": "It isn't cheaper, it is however a great place to put data centers if you want to host dodgy content away from law enforcement ",
          "score": 28,
          "created_utc": "2026-02-03 20:29:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3hdbej",
              "author": "jregovic",
              "text": "And litter low earth orbit with lots more space junk. Nobody is going to up to service a datacenter in space. When they have problems or become obsolete they will just float there until they fall back  to earth.",
              "score": 4,
              "created_utc": "2026-02-04 05:36:42",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o3fs7uh",
              "author": "swisstraeng",
              "text": "Guess we'll need law enforcement anti-satellite missiles",
              "score": -2,
              "created_utc": "2026-02-03 23:55:04",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3icagf",
                  "author": "to_glory_we_steer",
                  "text": "I don't know why this is getting downvoted. MOAR MISSILES",
                  "score": 1,
                  "created_utc": "2026-02-04 10:48:27",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3f4ch1",
          "author": "Kindly_Watercress416",
          "text": "Hmm how are they going to get rid of the heat in space? (not saying it's not possible, just curious)",
          "score": 10,
          "created_utc": "2026-02-03 21:52:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3gss8e",
              "author": "Svpreme",
              "text": "Maybe Immersion cooling but still needs more research apparently",
              "score": 2,
              "created_utc": "2026-02-04 03:20:13",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3h4k5j",
                  "author": "shpongolian",
                  "text": "That wouldn’t make a difference other than adding an initial temporary buffer. The heat would still be on the satellite and still need to be radiated out.",
                  "score": 2,
                  "created_utc": "2026-02-04 04:34:22",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o4257wt",
                  "author": "theslootmary",
                  "text": "Immersion in what? lol",
                  "score": 1,
                  "created_utc": "2026-02-07 10:25:22",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o3fz1oy",
              "author": "BrokenInteger",
              "text": "It's ridiculously impractical and not economically viable without fundamental scientific discoveries.",
              "score": 3,
              "created_utc": "2026-02-04 00:32:29",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o3ywywi",
              "author": "YourMathematician",
              "text": "Radiation?",
              "score": 1,
              "created_utc": "2026-02-06 21:02:48",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o3g1s4o",
              "author": "esaule",
              "text": "Yeah, that seems real strange to me. I am guessing you dissipate really little heat in space normally.\n\n\nMaybe there is enough atmosphere in low earth or it that it works? (never looked into it, but seem like if you have enough of an atmosphere to cool, you would lose velocity and so lose orbit)",
              "score": 1,
              "created_utc": "2026-02-04 00:47:28",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3hkp65",
                  "author": "eigreb",
                  "text": "In low earth there isn't sun 24/7 so you'll run into energy issues",
                  "score": 1,
                  "created_utc": "2026-02-04 06:35:55",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3fsllb",
          "author": "swisstraeng",
          "text": "250 billion \"ai-startup\".\n\nYeah right.\n\nWould it make sense to have data centers in space? No, but, you could be away from law enforcement. Nobody's willing to pay to enforce laws in space regarding network traffic.",
          "score": 5,
          "created_utc": "2026-02-03 23:57:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3fozr7",
          "author": "ppjuyt",
          "text": "It’s for when we live in space ships - will be much closer to the people who need the TikTok content once we are all forced to move up there",
          "score": 2,
          "created_utc": "2026-02-03 23:37:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3fqcaz",
              "author": "dataexec",
              "text": "😂😂 so far, this is the most rational take 😂",
              "score": 3,
              "created_utc": "2026-02-03 23:44:48",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3fqlgg",
                  "author": "ppjuyt",
                  "text": "Long-Term Vision: Musk has stated that with a population of a trillion humans in the solar system, we would have a \"thousand Mozarts\" and a much higher chance of preserving human consciousness, as mentioned in Yahoo Finance's report on population.",
                  "score": -1,
                  "created_utc": "2026-02-03 23:46:11",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3d6q07",
          "author": "Wise-Original-2766",
          "text": "Elon Musk is the biggest psyops manipulator in the world. That's why he bought twitter. His only goal is to flee Earth with all the money he swindled from his believers and all the greedy fools who follow him and do his bidding",
          "score": 5,
          "created_utc": "2026-02-03 16:31:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3fooa4",
              "author": "Charles07v",
              "text": "Flee earth?  Where is he going to flee to?",
              "score": 3,
              "created_utc": "2026-02-03 23:35:39",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3fp9sx",
                  "author": "ppjuyt",
                  "text": "Read the vision. Him and Bezos are working toward a 1Trillion human population living in space ships and presumably other planets. We will need data centers in space for this.",
                  "score": -4,
                  "created_utc": "2026-02-03 23:38:54",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o3gtfjd",
              "author": "Elisa_Kardier",
              "text": "What is he going to buy on Mars with $10^12?",
              "score": 1,
              "created_utc": "2026-02-04 03:24:02",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o42s4mx",
              "author": "Head-Gift2144",
              "text": "How much is a dollar worth on Mars?",
              "score": 1,
              "created_utc": "2026-02-07 13:32:32",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3d1jhz",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-03 16:07:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ftrcb",
          "author": "Supra-A90",
          "text": "Better take the centers to Uranus so it's the coldest Elon.",
          "score": 1,
          "created_utc": "2026-02-04 00:03:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3gadp2",
          "author": "MitchGH33",
          "text": "What a massive grift",
          "score": 1,
          "created_utc": "2026-02-04 01:35:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3h2j4w",
          "author": "simpleseeker",
          "text": "Power. You can collect solar power 24/7. That's what I read. I don't understand it.",
          "score": 1,
          "created_utc": "2026-02-04 04:20:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3hb7wp",
              "author": "chedder",
              "text": "its power, cooling, getting around local laws/taxes and the fact that the backbone of the internet is slowly moving into orbit from the oceans.",
              "score": 1,
              "created_utc": "2026-02-04 05:20:56",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3tg8j8",
                  "author": "Tomi97_origin",
                  "text": "Cooling stuff in space is anything but simple.",
                  "score": 1,
                  "created_utc": "2026-02-06 00:38:40",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3hkvzu",
          "author": "Known_Dare_3870",
          "text": "Initial investment will be huge but infinite energy thru sola panels and no cooling required is also cost benificial in long run. Heard on news, they estimating about 5-6 years time for break even",
          "score": 1,
          "created_utc": "2026-02-04 06:37:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3i2bgu",
              "author": "srmarmalade",
              "text": "Thats 5-6 MuskYears™ - no one has worked out what that actually translates to in reality but based on most of his promises so far it's ∞",
              "score": 1,
              "created_utc": "2026-02-04 09:15:33",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o3tgdcl",
              "author": "Tomi97_origin",
              "text": ">and no cooling required\n\nCooling anything in space is not easy. It's actually really difficult trying to keep stuff cool.",
              "score": 1,
              "created_utc": "2026-02-06 00:39:26",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3i953e",
          "author": "Schpickles",
          "text": "Things that would count against it as a strategy:\n\n- Data centres are really reliable but they do need maintaining, hardware fails etc. \n- you are presumably sending this hardware on a one way trip into space, so any future / depreciated hardware cost is zero. A lot of data centres currently offset loans against a future sell on value of the GPUs. \n- data centres are often seen as a future investment - e.g. if the company went down, the physical data centre, the wires in the ground etc are still a useful asset. \n- Solar storms seem to offer a threat that would be not present in a traditional data centre, and might increase hardware failure rates over time. \n\nI don’t know if the economics of the solar power and potential for heat dissipation outweigh these significantly, but it seems very wasteful unless the expected shelf life of space data centres is some how longer. It feels like these would be sent up and then just left to die ands replaced with others. \n\nI know xAI had some huge fights over the gas turbines they needed to install to fuel their expedited data centre builds, so maybe energy generation is something that musk and others are especially focused on as they try to scale.",
          "score": 1,
          "created_utc": "2026-02-04 10:19:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3m4hk9",
          "author": "p1zzuh",
          "text": "i'm curious about this, because i know you want silicon cold, but not THAT cold. would you have the opposite problem and you don't want your chips to freeze and need to heat it? With the sun?! ",
          "score": 1,
          "created_utc": "2026-02-04 22:31:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3njuvj",
          "author": "Artistic-Version-411",
          "text": "So that was obviously part of the initial deal when he bought twitter. Bailing out with shares of his last fillets - SpaceX.",
          "score": 1,
          "created_utc": "2026-02-05 03:18:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3o7ewl",
          "author": "Alone-March4467",
          "text": "It creates demand for space-x by sounding somewhat sci-fi but eventually doable only by musk. So it increases the value of Space-X and at the same time bundles the lowest value musk company with the highest value musk company. So when space-x will have its IPO you can’t only get the crown jewel but also have to take that ai-shit. \n\nIt’s business, not engineering.",
          "score": 1,
          "created_utc": "2026-02-05 06:00:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3qtw6e",
          "author": "Enzoxdt",
          "text": "To be honest, the ideia of a floating data center on the stratosphere is very cool",
          "score": 1,
          "created_utc": "2026-02-05 16:54:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3u1fjk",
          "author": "terserterseness",
          "text": "this is only fuel the lossmakers with the spacex ipo duh ",
          "score": 1,
          "created_utc": "2026-02-06 02:44:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3x947e",
          "author": "Classic_Chemical_237",
          "text": "Solar power generation with zero cost. However cooling is actually a bigger challenge than on ground since radiation is the only outlet.\n\nHowever, that’s all prior art.\n\nStarlink V3 supposedly has 60m wingspan with 7m to 8m base. I would say about 400 sq meter of solar panels, with 120kw power and cooling system. I think it’s safe to say it can handle 5x B200 system (each with 8x B200 and needs 15kw total) with 2t satellite weight.\n\nThe question is cost. Let’s say it cost 0.10/kwh on land, so the B200 system costs $1.5 per hour, $36/day. Assuming lifespan of 5 years, that’s $13k/year, 65k for five years. Running five will cost $328k over five years.\n\nAssuming launch cost of $50 per kg (some say $100, some say $10 to $20 eventually)with starship, a 2t satellite will cost $100k to launch. Seems to have a big saving comparing to the $328k, not counting the operational costs and residual values",
          "score": 1,
          "created_utc": "2026-02-06 16:14:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o409lg9",
          "author": "Repulsive_Cow_9852",
          "text": "It sounds cool so easier to convinve gullible rich people to invest in it",
          "score": 1,
          "created_utc": "2026-02-07 01:29:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o42atwr",
          "author": "Lyraele",
          "text": "It’s not. It’s the latest Elon grift. Data centers in space is a stupid idea.",
          "score": 1,
          "created_utc": "2026-02-07 11:19:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o45bko0",
          "author": "PinotGroucho",
          "text": "It's impossible to confiscate and therefore near absolute sovereign territory. That's what it is about.  The rest is window dressing.",
          "score": 1,
          "created_utc": "2026-02-07 21:26:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3dygru",
          "author": "Op24you",
          "text": "It’s not cheaper, it’s optimization and phase 0.01 of going to mars",
          "score": 2,
          "created_utc": "2026-02-03 18:37:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3exftl",
              "author": "Kristoff_Victorson",
              "text": "How is it optimal?",
              "score": 3,
              "created_utc": "2026-02-03 21:20:31",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3f3iki",
                  "author": "bigfoot17",
                  "text": "Well, see, because they'll be laggy and overheat and umm, profit!!!!",
                  "score": 7,
                  "created_utc": "2026-02-03 21:48:40",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o3fvr9k",
                  "author": "Op24you",
                  "text": "Mainly because we don’t have the energy capacity yet in the US, and that in space they could work with solar 24/7 365 days. Plus free cooling in space. I don’t know how he’ll pull it off, only that it’s the best place for datacenters",
                  "score": -8,
                  "created_utc": "2026-02-04 00:14:31",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o3uvwbm",
              "author": "stealstea",
              "text": "No its a story to fool gullible investors to buy the upcoming IPO",
              "score": 1,
              "created_utc": "2026-02-06 06:12:46",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3ek3e4",
          "author": "chonbee",
          "text": "Data centers in space = unlimited solar power",
          "score": 0,
          "created_utc": "2026-02-03 20:18:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3ey48a",
              "author": "Kristoff_Victorson",
              "text": "But expensive to set up, expensive to maintain, harder to keep cool (read expensive), with higher latency and reduced bandwidth when compared to a datacenter on earth, also susceptible to solar storms and space debris.",
              "score": 11,
              "created_utc": "2026-02-03 21:23:39",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3i250m",
                  "author": "chonbee",
                  "text": "You make very good points. What the hell are they doing in space with data centers?! Nvidia is doing the same.",
                  "score": 2,
                  "created_utc": "2026-02-04 09:13:49",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o3fbsr8",
              "author": "temp_sk",
              "text": "And cooling",
              "score": -5,
              "created_utc": "2026-02-03 22:28:11",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3fzhn3",
                  "author": "twiiik",
                  "text": "How?",
                  "score": 1,
                  "created_utc": "2026-02-04 00:34:54",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3d4bfb",
          "author": "retsof81",
          "text": "Like everything else, his mode of operation is to declare something and the turn to a team of engineers and yell, “make it happen!” If they can pull it off then he looks intelligent to morons. He otherwise has no idea how it’s actually going to work. I suspect the idea went no further than I need cheap electricity for data centers and my micro satellites are able to generate my own power from the sun. All other logistical questions (the things that require actual intelligence) are for someone else to figure out.",
          "score": 0,
          "created_utc": "2026-02-03 16:20:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3hbcfm",
              "author": "Silentkindfromsauna",
              "text": "There are already data centers in space",
              "score": 0,
              "created_utc": "2026-02-04 05:21:52",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3hbpnp",
                  "author": "retsof81",
                  "text": "Please say more.",
                  "score": 1,
                  "created_utc": "2026-02-04 05:24:35",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3fww7c",
          "author": "Imaginary-Tooth896",
          "text": "Cold, out of reach of any kind of regulation and aligned with starlink service.\n\nGood move.",
          "score": 1,
          "created_utc": "2026-02-04 00:20:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3grwzh",
          "author": "Novel_Cow8226",
          "text": "We have a material problem in the supply chain in America for AI, its power. We can't build fast enough to increase power availability. This isn't the first doing it, StarCloud launched some gpus to space last year. Also it gives him another product to sell.",
          "score": 1,
          "created_utc": "2026-02-04 03:15:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3h03i4",
          "author": "hellelfs",
          "text": "Its expensive to install but cheaper to run due to\n\n- free unlimited solar power. No electricity bills\n- no cooling issues\n- no need to pay rent . Free land\n- no jurisdiction.  No one can touch you.",
          "score": 1,
          "created_utc": "2026-02-04 04:05:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3h2z4r",
              "author": "theregoesjustin",
              "text": "Latency will be crazy high. Cooling is a problem for both solar panels and the actual satellite generating all that heat. No air = no cooling (except for the very low amount from black body radiation). Maintenance is inevitable with so many components so that’ll be insanely expensive. Everything about this is dumb but you all are too dumb to realize it",
              "score": 1,
              "created_utc": "2026-02-04 04:23:46",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o3tg0r4",
              "author": "Tomi97_origin",
              "text": ">- no cooling issues\n\nSince when was cooling not a problem in space?",
              "score": 1,
              "created_utc": "2026-02-06 00:37:26",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3ffiu7",
          "author": "FinancialMoney6969",
          "text": "Solar and cooling, without atmosphere we get 100% of suns rays",
          "score": -1,
          "created_utc": "2026-02-03 22:47:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3fzw6k",
              "author": "twiiik",
              "text": "How do you make practical cooling in space?",
              "score": 2,
              "created_utc": "2026-02-04 00:37:06",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3hffkv",
                  "author": "FinancialMoney6969",
                  "text": "People can’t handle science, listen to me",
                  "score": 0,
                  "created_utc": "2026-02-04 05:52:55",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o3g6w13",
                  "author": "FinancialMoney6969",
                  "text": "It’s already cool there my boy",
                  "score": -5,
                  "created_utc": "2026-02-04 01:15:53",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o3h25gb",
              "author": "theregoesjustin",
              "text": "Do yall read some sort of dumb newsletter to parrot the same talking points? I wonder how this is so coordinated",
              "score": 1,
              "created_utc": "2026-02-04 04:18:15",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3h7wsn",
                  "author": "FinancialMoney6969",
                  "text": "It’s a real thing why am I downvoted lol",
                  "score": 0,
                  "created_utc": "2026-02-04 04:57:25",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3hy4ua",
          "author": "Shoddy-Potato-6854",
          "text": "You promise the moon, or Mars or whatever. You get investors, they give you money, you pay yourself and your other business, you ask for more money and do it again and again till no-one will give you money. You close shop.",
          "score": 0,
          "created_utc": "2026-02-04 08:35:59",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qug6b3",
      "title": "Kuse + Excel? Visualize messy data in minutes",
      "subreddit": "automation",
      "url": "https://i.redd.it/d94gk3we17hg1.png",
      "author": "Loose_Kangaroo91",
      "created_utc": "2026-02-03 02:50:27",
      "score": 38,
      "num_comments": 4,
      "upvote_ratio": 0.86,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qug6b3/kuse_excel_visualize_messy_data_in_minutes/",
      "domain": "i.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "o39x8uz",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-03 02:50:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3mzx4j",
          "author": "bribe_em",
          "text": "I’ve been using zerve ai for this kind of “from raw files to dashboards” flow, which avoids a lot of the copy-paste / prompt churn you get with pure Excel + AI.",
          "score": 1,
          "created_utc": "2026-02-05 01:24:11",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qvpdbb",
      "title": "From 'I should automate this' to actually doing it - my 2025-2026 journey and what finally worked",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qvpdbb/from_i_should_automate_this_to_actually_doing_it/",
      "author": "Ramirez_Lexi",
      "created_utc": "2026-02-04 14:02:53",
      "score": 37,
      "num_comments": 16,
      "upvote_ratio": 0.97,
      "text": "for years i had a mental list of tasks i should automate. every time i did something repetitive i thought about how nice it would be to automate it. then i moved on and kept doing it manually.\n\nwhat changed was starting small. really small. instead of planning a comprehensive automation strategy i picked one thing. downloading a daily report. took about 5 minutes manually. not a huge time investment but i did it every day.\n\nbuilding that one automation took me a few hours over a weekend. learning curve plus troubleshooting. but once it worked it just kept working. every morning the report was there without me doing anything.\n\nthat small win changed my psychology around automation. it stopped being a someday project and became something i was actually doing. i picked another task. then another. each one got easier as i learned the tools better.\n\nby the end of 2025 i had automated maybe a dozen small workflows. nothing individually transformative but together they added up to several hours weekly. more importantly i built the habit and skills to keep going.\n\ninto 2026 the momentum continued. started tackling bigger workflows. connected automations together. went from isolated scripts to something closer to a system.\n\nthe lesson is that starting beats planning. i wasted years thinking about comprehensive approaches. actually starting with one tiny automation taught me more than any planning would have.\n\ncurious if others had similar experiences breaking through the should versus doing barrier.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qvpdbb/from_i_should_automate_this_to_actually_doing_it/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "o3krsxu",
          "author": "AutomationPartner",
          "text": "Congratulations on your journey! I build and sell automations for a living and one of the things I've noticed is that people that come with a list of 100 things almost never convert. The people that can focus on 1-3 top priorities make great customers and have great results. \n\nPicking something is so much more important than picking the right thing.",
          "score": 3,
          "created_utc": "2026-02-04 18:40:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3lk6wo",
          "author": "EX_Enthusiast",
          "text": "automating employee onboarding is very clever way too check newployee for details",
          "score": 2,
          "created_utc": "2026-02-04 20:53:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3od1m9",
          "author": "nanohuman_ai",
          "text": "This resonates so much. The hardest part isn't the code, it's overcoming the \"it only takes 5 minutes, I'll just do it manually\" trap.\n\nMy breakthrough was similar, but I also fell into the classic trap of spending 10 hours automating a task that takes 30 seconds. Now I follow the \"is it worth it\" rule, but honestly, the mental clarity of not having those tiny recurring tasks is worth more than the time saved. Congrats on the momentum!",
          "score": 2,
          "created_utc": "2026-02-05 06:47:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3j4y8q",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-04 14:02:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3jtf98",
          "author": "spinmarcosgay",
          "text": "What app sends you a daily report ? Do you have to ask for it , or is it completely automated ? I want to do this !",
          "score": 1,
          "created_utc": "2026-02-04 16:03:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3l1fyh",
          "author": "Cryptosagee",
          "text": "I had the same shift once I built one tiny script. Momentum does the real work. And with Andrew Sobko pushing easier GPU access, even heavier automations feel less intimidating now.",
          "score": 1,
          "created_utc": "2026-02-04 19:24:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3l4cnh",
          "author": "CarefulIndication988",
          "text": "What type of workflow did you automate and for what industry? How did you learn to do even the small automations?",
          "score": 1,
          "created_utc": "2026-02-04 19:38:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3m0750",
          "author": "XRay-Tech",
          "text": "Awesome, really smart approach.  It can be overwhelming to to start all at once and wonder how you are going to automate every part of your process.  Starting with one thing and getting good at it can spark other ideas of things to automate.  After a while you are thinking about automation first and what processes can be automated is like a second nature.  I kind of started that way as well.  When new to the automation space I would work on a task and then keep going and going and kept examining processes to automate.  Good luck as you continue your automation journey.",
          "score": 1,
          "created_utc": "2026-02-04 22:10:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ms3vd",
          "author": "Strong_Teaching8548",
          "text": "This resonates with me more than you'd think. building zignalify, i kept telling myself i'd optimize the data pipeline \"eventually.\" meanwhile we were manually processing gsc data in ways that could've been automated from day one\n\nfinally just tackled one small piece. took a few hours. suddenly the whole thing felt less impossible. you're right that it's psychological. once you see one automation actually work without breaking, you start believing the rest is doable too\n\nthe compounding effect you mentioned is real. small wins stack :)",
          "score": 1,
          "created_utc": "2026-02-05 00:39:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3on7y5",
          "author": "Beneficial-Panda-640",
          "text": "I have seen this pattern a lot. The real shift is not time saved, it is identity. Once you experience something quietly running without you, automation stops being abstract and starts feeling normal.\n\nStarting with a task that is small but frequent is key. It creates trust in the system and in yourself. From there the scope naturally grows because the mental cost of starting drops. Planning feels productive, but execution is what teaches you where the real friction and brittleness are. That learning only shows up once something is actually running.",
          "score": 1,
          "created_utc": "2026-02-05 08:21:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3snj54",
          "author": "ManofC0d3",
          "text": "The best thing i have automated is my calendar, and building an agent to follow up on what I'm supposed to do via Telegram. Best life hack ever.",
          "score": 1,
          "created_utc": "2026-02-05 22:03:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3sxwk0",
              "author": "Tall_Guarantee7767",
              "text": "Please give us the tools that you used so that we all can do the same",
              "score": 1,
              "created_utc": "2026-02-05 22:55:54",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qwpzmb",
      "title": "I finally found the workflow to replicate ANY image style using Nano Banana Pro! And I’m literally selling it as an IG portrait service",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qwpzmb/i_finally_found_the_workflow_to_replicate_any/",
      "author": "Sniper_yoha",
      "created_utc": "2026-02-05 16:31:39",
      "score": 28,
      "num_comments": 8,
      "upvote_ratio": 0.77,
      "text": "I’ve been experimenting with image consistency lately, and I’ve cracked a 3-step method that works every time. Here is exactly how I generated the 3x3 grid above:\n\n1. **Upload your reference image** to Gemini 3 Pro\n2. **Use this specific \"Extraction\" Prompt:** `\"Help me extract the entire visual effect of this image as a Prompt in JSON format. Include but do not limit to: color palette, lighting, composition, stylistic effects, camera lens, and character details.\"`\n3. **Generate through Nano Banana Pro:** I take the JSON output and feed it into Nano Banana Pro via Atlas Cloud. I’m using Atlas because it’s easy to iterate in the Playground and via the API (I wired it into an n8n workflow).\n\n**And here is the exact prompt I used:**\n\n*Prompt: A professional 3x3 grid layout of 9 high-quality portrait photos featuring a consistent character of a stunning young East Asian woman with long wavy dark hair and small silver earrings, wearing a black strapless tube top. Each grid cell shows a distinct and highly differentiated facial expression to ensure no repetition.*\n\n*The 9 expressions are:*\n\n1. *Top Row: \\[Gentle wink with a subtle smile\\] | \\[Wide teeth-showing joyful grin\\] | \\[Angry scowl with furrowed brows\\].*\n2. *Middle Row: \\[Playful wink with a cheeky tongue-out\\] | \\[Bursted loud laughter with closed eyes\\] | \\[Disgusted face with a wrinkled nose\\].*\n3. *Bottom Row: \\[Naughty side-view with tongue sticking out\\] | \\[Ecstatic head-tilted laughter\\] | \\[Depressed downward gaze with a sad pout\\].*\n\n*Technical Settings: Clean solid light grey background, soft studio high-key lighting, ultra-realistic skin texture with visible pores, 8k resolution, cinematic photography, shot on 85mm lens, f/1.8, hyper-detailed, masterpiece, photorealistic.”*\n\nhttps://preview.redd.it/0mb5gotrdphg1.jpg?width=747&format=pjpg&auto=webp&s=da1c25184d716e9bee8c811c44df1e6675b427c4\n\n**A couple practical notes:**\n\n* If the first result isn't exactly what you’re looking for, just run it for a few more rounds.\n* The biggest win for me is having the “style/character DNA” captured in JSON so I’m not rewriting the same description every time.\n\nI turned this into an n8n workflow and used it for a small portrait “style match” service to a few people on IG. They give me a reference image, I generate a batch in the same style, pick the best set, deliver.\n\nHonestly, in this era, making money with AI feels *way too easy* if you can package a repeatable workflow:)",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qwpzmb/i_finally_found_the_workflow_to_replicate_any/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "o3qwido",
          "author": "No_Yogurtcloset_8029",
          "text": "How exactly are you selling this? Offering headshots as an AI service?",
          "score": 4,
          "created_utc": "2026-02-05 17:07:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3r83po",
          "author": "Captain_BigNips",
          "text": "How are you selling this? I guess I've been in the online AI echo chamber for longer than I thought....\n\nThis seems so incredibly simple to do, why would anybody pay for this? If you didn't know how to do this on your own, you can ask the AI to help you figure it out. Are people really that bad with AI that they're willing to pay for this? 🫨",
          "score": 3,
          "created_utc": "2026-02-05 18:01:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3u35d1",
              "author": "Sniper_yoha",
              "text": "You could give it a try. The unit price isn’t particularly high. I can process 100 images in one bulk run. \n\nIf they’re not willing to pay for this service, they’ll have to either subscribe to tools like Higgsfield or create a Gemini account, which would be far more troublesome.",
              "score": 1,
              "created_utc": "2026-02-06 02:54:20",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3wrmo2",
                  "author": "Every_Welcome_1498",
                  "text": "What does your flow look like for saving images? All my batch image gen processes fall apart at file organization.",
                  "score": 1,
                  "created_utc": "2026-02-06 14:49:26",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3qq0ox",
          "author": "Worldly_Row1988",
          "text": "Great job and thanks for sharing.",
          "score": 2,
          "created_utc": "2026-02-05 16:37:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3qov68",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-05 16:31:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3r67nx",
          "author": "Coolprince07",
          "text": "I edited an image of myself but it looks thicker i.e AI. Can u suggest some prompts to look like it's been taken by a camera.",
          "score": 1,
          "created_utc": "2026-02-05 17:52:26",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qwj6yh",
      "title": "Need advice on automating marketing reports that require SQL",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qwj6yh/need_advice_on_automating_marketing_reports_that/",
      "author": "arrogant_definition",
      "created_utc": "2026-02-05 11:48:12",
      "score": 27,
      "num_comments": 17,
      "upvote_ratio": 0.97,
      "text": "I am part of a team building numerous SaaS products, taking care of all things marketing. For things like content, Meta, influencers, things are pretty easy as there are platforms that aggregate all the data and make it easy to view.\n\nWhen it comes to the impact of marketing campaigns on product adoption, however, I find myself struggling. Most data related to adoption metrics, subscription changes, user behaviour, etc. are all data that needs to be exported from the database (Postgres) using SQL.\n\nThe current method to get this data involves asking devs to write SQL, or using LLMs to create SQL (nearly always wrong). I try to learn some SQL as well, but find it hard to find time as I am a family man since recently.\n\nI have noticed that some people use ai tools to bypass the need for SQL and interact with data directly. I don't mean the traditional BI tools like PowerBI and Tableau, but less popular tools like TalkBI. The team thinks it is a risk to connect our database to such tools and so far not much is happening. I am running out of options here. Can you please help me figure out any alternative solutions?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qwj6yh/need_advice_on_automating_marketing_reports_that/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "o3pb4q4",
          "author": "Much_Pomegranate6272",
          "text": "Connect your Postgres to a read-only replica specifically for reporting. Then use whatever BI tool you want without risking production data.\n\nTools like Metabase (open source) or Retool let non-technical people query databases without writing SQL. Way safer than random AI tools with direct DB access.\n\nLLMs generating SQL is hit or miss - they work for simple queries but fail on complex joins and edge cases. Not reliable for automated reporting.\n\nBetter setup:\n- Read-only DB replica for analytics\n- Metabase or similar for self-service queries\n- Schedule automated reports instead of manual exports\n\nYour team's concern about connecting external tools to production DB is valid. Replica solves that.\n\nWhat specific metrics are you trying to pull regularly? That determines if you actually need custom SQL or if a BI tool handles it.",
          "score": 4,
          "created_utc": "2026-02-05 11:59:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3pagl7",
          "author": "dimitsapis",
          "text": "Having worked in marketing in Europe I can tell you that connecting new tools to a database is a safety hazzard even if it seems safe in the first place. The founder has good thinking if this is about enterprise-level saas products. If you are more of a startup and the team can make quick decisions then I would recommend looking at the team behind the tool and getting to know them personally. If the tool is indeed unpopular they will be happy to support you. Perhaps that can put the founder at ease. But to answer your question, I know there is a few more NLQ tools out there (I believe they are called like that - natural language queries) but analysts tend to dislike them because they are afraid they'll lose their jobs, lol! If you have a product manager he should also have this data more available for you.",
          "score": 2,
          "created_utc": "2026-02-05 11:54:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3pbaeu",
              "author": "gallade17",
              "text": "Europeans have the GDPR virus because they have no other problems to think about!",
              "score": 1,
              "created_utc": "2026-02-05 12:00:46",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3tzc1b",
          "author": "Specific-Act-6622",
          "text": "What worked well for our team was building a middle layer using n8n (open source, self-hosted) that connects to a read-only Postgres replica. The workflow runs on a schedule, executes the same trusted SQL queries every time, and dumps the results into Google Sheets or Airtable for the marketing team.\n\nThe key insight is that most marketing questions are variants of the same 5-10 queries. Once you identify those, you can version control the SQL, have devs sign off once, and then marketing just looks at auto-updated spreadsheets.\n\nFor ad-hoc questions, we use a combo approach: marketing describes what they want in plain english, an LLM generates a candidate query, but it runs against a staging copy first and gets human review before touching real data. The LLM is surprisingly good at modifying existing working queries but terrible at writing complex ones from scratch.\n\nThe security concern is valid - never give an external tool direct prod access. Read-only replica plus workflow automation is the safe path.",
          "score": 2,
          "created_utc": "2026-02-06 02:32:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3p9mul",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-05 11:48:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3paxsd",
              "author": "angelicallergy37",
              "text": "Not sure this post belongs in this sub, but having a tool that can help you chat with your database like you would do with an LLM sounds pretty cool. \n\nThat + it should not be a marketing task to report on product adoption metrics, there are PMs for that.",
              "score": 1,
              "created_utc": "2026-02-05 11:58:09",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3pd0ep",
          "author": "No_Soy_Colosio",
          "text": "Learning SQL and asking devs to create views is easier than using LLMs (flaky, and vector for cyber attacks if you're not knowledgeable). Do not use LLMs for tasks that require structure and can better be taken on with a programming language/DSL (SQL in this case)",
          "score": 1,
          "created_utc": "2026-02-05 12:13:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3pjxf9",
          "author": "Equal-Direction-8116",
          "text": "What’s breaking isn’t SQL itself. it’s that insight lives behind a dependency chain. When marketing questions require dev time or fragile LLM queries, analysis becomes sporadic and slow, so decisions lag behind reality. BI tools don’t fix that if they still assume someone else owns the data layer. A practical alternative is to define a small set of **blessed, read-only metrics views** in the database that devs own once, and marketing can query safely forever. If that foundation exists, you can layer lightweight tools or even simple scheduled exports on top without introducing risk. The leverage usually comes from narrowing what needs to be queried, not from replacing SQL entirely.",
          "score": 1,
          "created_utc": "2026-02-05 13:00:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3po81w",
          "author": "calimovetips",
          "text": "Stop querying prod directly. put a read only replica or small warehouse in front of postgres, build a handful of curated views for core adoption metrics, and let marketing query those safely. that removes most sql churn and the security concern at the same time. does this need near real time data, or is daily freshness fine?",
          "score": 1,
          "created_utc": "2026-02-05 13:26:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3pvpfp",
          "author": "ChestChance6126",
          "text": "This usually isn’t a SQL problem, it’s a data access design problem. what’s worked for me is setting up read-only analytics views for core metrics (activation, upgrades, churn, attribution, etc.). Once those exist, marketing can answer most questions with filters instead of asking devs for new queries. LLMs also perform much better editing trusted queries vs generating them from scratch.",
          "score": 1,
          "created_utc": "2026-02-05 14:08:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3pzda3",
          "author": "long_limbs",
          "text": "The real issue IMO is less about SQL and more about why marketing data lives in a dev-owned system with no self-service layer. Your team's security concerns are valid but the answer isn't finding the right tool - it's getting devs to build a handful of views that expose the metrics you actually need. Once those views exist, even a spreadsheet export on a schedule might be enough.\n\nI'd push back on the idea that you need to \"learn SQL\" as a marketer. That's treating symptoms. The underlying problem is that adoption metrics should already be surfaced somewhere accessible to you - whether that's your product analytics tool, a simple dashboard, or scheduled reports.",
          "score": 1,
          "created_utc": "2026-02-05 14:28:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3qiow2",
          "author": "Living-Bandicoot9293",
          "text": "Beware of security and compliance, you should try with some fine tuned llm locally hosted for eg Qwen 30b -code -instruct, keep your data away from open exposure.",
          "score": 1,
          "created_utc": "2026-02-05 16:03:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3tpkkg",
          "author": "forklingo",
          "text": "this is a pretty common gap between marketing and product data, so you are not alone. one option that tends to work better than pure ai sql is to invest a bit upfront in a small set of vetted, reusable queries or views that cover the core questions you care about. once those exist, you are mostly selecting and filtering instead of writing raw sql each time. another approach is to push for a read only replica or a curated analytics schema so the risk concerns are lower and access can be broader. fully natural language tools still struggle with nuance, especially around joins and edge cases, so they work best on top of a well modeled layer rather than directly on prod tables. if you can frame this as saving dev time long term instead of bypassing them, it usually gets more buy in.",
          "score": 1,
          "created_utc": "2026-02-06 01:33:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3vmzny",
          "author": "messinprogress_",
          "text": "Sounds like you need a way to get product data accessible without constantly bugging devs or fighting with SQL. I came across Scaylor when looking into this stuff recently. From what I've read, it's built specifically for connecting databases like Postgres into a queryable warehouse with pre-built models, so marketing teams can actually run their own adoption reports and campaign analysis without needing to write SQL every time.\n\nThe whole point is it handles the data modeling automatically so you skip the technical bottleneck and can just pull teh metrics you need for reporting. Might be worth checking out given your situation with the team being hesitant about newer AI tools. It's more of a proper data infrastructure solution rather than just an AI chat interface.",
          "score": 1,
          "created_utc": "2026-02-06 10:22:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3vydtc",
              "author": "arrogant_definition",
              "text": "Similar to TalkBI as I see it but I need the customizable element that the later offers.",
              "score": 1,
              "created_utc": "2026-02-06 11:57:51",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3pcfkd",
          "author": "kevivmatrix",
          "text": "You can use tools like Draxlr to generate SQL Queries, you can feed context to the AI and it will generate accurate SQL after that.",
          "score": 0,
          "created_utc": "2026-02-05 12:09:22",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qvhuv8",
      "title": "Using an AI call assistant unexpectedly doubled our sales",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qvhuv8/using_an_ai_call_assistant_unexpectedly_doubled/",
      "author": "Commercial-Job-9989",
      "created_utc": "2026-02-04 07:11:29",
      "score": 22,
      "num_comments": 23,
      "upvote_ratio": 0.86,
      "text": "I was honestly skeptical about AI call assistants at first. Thought it’d sound robotic and scare leads away.\n\nBut over the last few weeks, we started using one mainly to handle inbound calls, qualify leads, and follow up on missed calls. Nothing fancy just basic scripts, FAQs, appointment booking, and call summaries.\n\nThe surprising part?\n\nOur sales almost doubled.\n\nNot because the AI is “better at selling,” but because:\n\n\\- No missed calls anymore \n\n\\- Faster follow-ups \n\n\\- Leads get filtered before reaching the sales team\n\n\\- Human agents now focus only on high-intent calls\n\n \n\nCustomers didn’t even mind talking to AI as long as it was clear, quick, and helpful. Some actually preferred it over waiting.\n\nIt’s not magic and it won’t fix a bad product but if your business relies on calls, this stuff is way more practical than I expected.\n\nCurious if others here have seen similar results or if this was just a lucky setup on our side.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qvhuv8/using_an_ai_call_assistant_unexpectedly_doubled/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "o3hpqcg",
          "author": "CallCenterOwner",
          "text": "Great example of AI supporting the team, not replacing it. Real value comes from faster response and better lead handling.",
          "score": 8,
          "created_utc": "2026-02-04 07:19:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3hz6w9",
              "author": "ManofC0d3",
              "text": "It works to frame it as a time and money saver, rather than just convenience.",
              "score": 2,
              "created_utc": "2026-02-04 08:46:01",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3jimuq",
          "author": "SMBowner_",
          "text": "This is a great example of how small process improvements can lead to big results. Faster response and no missed calls alone can boost sales a lot.",
          "score": 3,
          "created_utc": "2026-02-04 15:13:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3hs3gn",
          "author": "nanohuman_ai",
          "text": "This hits the nail on the head. Most people are looking for \"AI that can sell like Jordan Belfort,\" but the real gold is just solving the Speed to Lead problem.\n\nStatistically, if you don't respond to a lead within 5 minutes, your chances of qualifying them drop by like 80%. Humans can’t be at their desks 24/7, but the AI doesn't get \"burnout\" after 50 calls or take a 1-hour lunch break right when a high-intent lead rings.\n\nIt’s less about \"persuasion\" and more about availability.\n\nOne thing though, how are you handling the data sync? Are you feeding the AI summaries back into your CRM automatically? I’ve found that the real \"magic\" happens when the human rep jumps on the follow-up call already knowing exactly what the lead’s pain point is because they read the AI’s notes first.",
          "score": 3,
          "created_utc": "2026-02-04 07:40:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3hv1h0",
          "author": "MoneyMiserable2545",
          "text": "that’s actually impressive. i’ve noticed businesses lose a lot of leads just from slow replies or missed calls. having something that keeps responses consistent probably builds trust faster. curious if customers can tell it’s ai or if it feels natural to them",
          "score": 3,
          "created_utc": "2026-02-04 08:06:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3hy2k8",
              "author": "Commercial-Job-9989",
              "text": "I totally agree with you.",
              "score": 2,
              "created_utc": "2026-02-04 08:35:24",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3hov0p",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-04 07:11:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ikq8w",
          "author": "False_Ad8389",
          "text": "yeah. seems to be working for a lot of people. more reliable",
          "score": 1,
          "created_utc": "2026-02-04 11:58:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3iqisv",
          "author": "Ticrotter_serrer",
          "text": "The simples processes are the low hanging fruit.",
          "score": 1,
          "created_utc": "2026-02-04 12:39:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ixpjf",
          "author": "Minimum-Box5103",
          "text": "We built this for a law firm for after hours calls and the results have been very decent. Pleasantly surprised!",
          "score": 1,
          "created_utc": "2026-02-04 13:23:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3j2s3q",
          "author": "absurd_height",
          "text": "The win usually isn’t that the AI is some amazing closer it’s that it fixes all the dumb stuff like missed calls and slow follow-ups. Once those leaks are gone, sales go up almost by default. Humans are still better at closing, they just shouldn’t be answering every call.",
          "score": 1,
          "created_utc": "2026-02-04 13:51:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3jaw2a",
          "author": "aiagent_exp",
          "text": "Yeah, this is a solid example of AI actually being useful. Taking calls off the team’s plate and keeping things consistent so people can focus on closing instead of juggling everything.",
          "score": 1,
          "created_utc": "2026-02-04 14:33:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3kjhng",
          "author": "Sensei9i",
          "text": "what in the linkedin engagement pod is this",
          "score": 1,
          "created_utc": "2026-02-04 18:03:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3kuwyb",
          "author": "AutomationPartner",
          "text": "This is awesome. As I get more experience with voice agents I've actually shifted to wishing a lot of the businesses that I call had one. \n\nGets rid of:   \n\\- Wait times  \n\\- background noise  \n\\- Staff that don't know the answer to your question  \n\\- Calling back during inconvenient operating hours\n\nI'm starting to build more and more of these for clients and it's amazing how far they've come in the last few years and how useful they can be.",
          "score": 1,
          "created_utc": "2026-02-04 18:54:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3o4ahy",
          "author": "Jakoreso",
          "text": "Now that's the beauty of using AI alongside human staff, to scale. And no, it's not magic, you just used technology the right way!",
          "score": 1,
          "created_utc": "2026-02-05 05:35:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3pzw9a",
          "author": "Patient_Hippo_3328",
          "text": "Not that surprising honestly instant pickup 24/7 availability is huge for conversions. most teams lose leads just by missing or delaying that first call.  ",
          "score": 1,
          "created_utc": "2026-02-05 14:31:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3q9yb0",
          "author": "Ambitious-Hawk-3580",
          "text": "Not THAT surprising actually.   \nI've seen a a company work with the OneAI Phone agent to pass qualified leads to their sales people, and the result was they had to increase the size of their call center.  \nI've been joking ever since that no one ever talks about all the jobs that AI creates XD",
          "score": 1,
          "created_utc": "2026-02-05 15:22:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3tp2am",
          "author": "Primary_Drive_806",
          "text": "This mirrors exactly what we’ve seen across several implementations. The 'doubled sales' phenomenon usually isn't about the AI's closing skills but rather it's about solving the **Lead Decay Gap**.\n\nMost people don't realize that lead response at the 5-minute mark is 10x more effective than at 30 minutes. By using an assistant for the 'Inbound + Qualification' layer, you're essentially fixing a revenue killer.\n\nTo give some data-driven context for those skeptical about the 'robotic' feel:\n\n* **The Nuance:** The best results come when the AI handles the *administrative* friction (FAQs, booking) rather than trying to mimic a human closer.\n* **The Tech Signal:** Modern LLM-based voice engines have dropped latency to sub-second levels, which is why customers 'don't mind' the frustration of waiting on hold is higher than the friction of talking to a clear AI.\n* **The Filter:** Having the AI tag 'high-intent' vs 'tire-kickers' in the call summaries allows your human team to actually do the deep work they were hired for.\n\n**One tip for your setup:** If you aren't already, try linking the call summaries directly into your CRM via webhook. It saves the sales team another 20% of their admin time.",
          "score": 1,
          "created_utc": "2026-02-06 01:30:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ufe7w",
          "author": "quietkernel_thoughts",
          "text": "Now that's the beauty of using AI alongside human staff, to scale. And no, it's not magic, you just used technology the right way!",
          "score": 1,
          "created_utc": "2026-02-06 04:11:08",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1quri0h",
      "title": "Our sales literally tripled after adding an AI call assistant (wasn’t expecting this)",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1quri0h/our_sales_literally_tripled_after_adding_an_ai/",
      "author": "Commercial-Job-9989",
      "created_utc": "2026-02-03 13:09:44",
      "score": 18,
      "num_comments": 19,
      "upvote_ratio": 0.71,
      "text": "So a few months ago, we were struggling with missed calls, slow follow-ups, and inconsistent sales conversations. Small team, limited time you know the drill.\n\nWe decided to test an AI call assistant mainly to handle inbound calls and qualify leads. Honestly, expectations were low. I thought it’d just be a basic IVR replacement.\n\nTurns out, that decision changed everything.\n\nHere’s what happened:\n\nEvery call got answered (no more “call back later”)\n\nLeads were qualified instantly instead of waiting hours\n\nFollow-ups happened automatically\n\nSales reps only talked to warm leads\n\nWithin 6-8 weeks, our sales were up nearly 3x.\n\nNot because the AI was “selling” better than humans, but because:\n\nNo leads slipped through the cracks\n\nResponse time went from hours → seconds\n\nOur team focused only on closing\n\nBiggest surprise? Customers didn’t mind talking to AI at all most didn’t even realize it at first.\n\nCurious if anyone else here has seen similar results with AI voice tools, or if we just got lucky. Happy to answer questions.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1quri0h/our_sales_literally_tripled_after_adding_an_ai/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "o3cwg5y",
          "author": "GeorgeHarter",
          "text": "I renewed my Siriusxm radio subscription a couple weeks ago. It stated upfront that it was an AI. (Which is good.)\nI negotiated price entirely with the AI. Got a good deal. It was better than talking with a person as I had done in the past because:\nI didn’t have to hold 10 minutes for a human rep and the negotiation was nearly identical.",
          "score": 8,
          "created_utc": "2026-02-03 15:42:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3d2z8o",
          "author": "startupdojo",
          "text": "You were not picking up the phone, and then you are surprised that you get more business when you pick up the phone?  A normal business would actually hire a cheap call center worker to pick up the damn phone, it's literally the simplest thing they can do to get customers.  \n\nThis is delusional, or more accurately, typical AI slop.",
          "score": 10,
          "created_utc": "2026-02-03 16:13:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3oia2m",
              "author": "ChocoMcChunky",
              "text": "Yes leaning towards the latter, really hate what Reddit (and in turn, LinkedIn and other channels) have become. \n\nA wasteland for AI slop.",
              "score": 2,
              "created_utc": "2026-02-05 07:34:53",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3c3epw",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 2,
          "created_utc": "2026-02-03 13:09:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3cl5xp",
          "author": "Varioustiny",
          "text": "That's interesting. What tool do you use for the calls? Aren't you concern with the hallucinations? Can the leads tell that they are talking with an AI?",
          "score": 2,
          "created_utc": "2026-02-03 14:47:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3h5tst",
              "author": "Commercial-Job-9989",
              "text": "I use Botphonic as it provides human like conversation that makes leads feel like they are interacting with human and also helps with call escalation.",
              "score": 4,
              "created_utc": "2026-02-04 04:43:01",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3hmjgg",
                  "author": "davetehwave",
                  "text": "interesting, your profile says the same thing.",
                  "score": 2,
                  "created_utc": "2026-02-04 06:51:35",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3cskrz",
          "author": "Jrod-007",
          "text": "I provide businesses 24 /7 voice ai receptionist that will qualify your clients and  check your calander for slots then book an appointment. it will then send you an sms and email with a\ngoogle meeting link.\ncall and try it. we can\nprovide a quick demo.",
          "score": 1,
          "created_utc": "2026-02-03 15:24:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3h5hx5",
              "author": "Commercial-Job-9989",
              "text": "Share your link and I will try.",
              "score": 2,
              "created_utc": "2026-02-04 04:40:46",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3d7wk1",
          "author": "sme_operator",
          "text": "I think the framing here gets confused a bit.\nThe win usually isn’t AI vs humans — it’s every call being answered and followed up consistently. Whether that’s AI, a human, or a hybrid matters less than eliminating missed calls and slow response times.\nA cheap call center can absolutely work too, but only if the handoff, follow-ups, and tracking are actually tight. In a lot of small teams, that’s where things break.\nFrom what I’ve seen, the sales lift often comes from removing leakage, not from “AI selling better.”",
          "score": 1,
          "created_utc": "2026-02-03 16:36:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ehr2o",
          "author": "ckalit",
          "text": "actually in serious business and high stake situations, a seamless warm handoff to a real person is very important, it's correct that ai can hallucinate but if built well and have proper guardrails it's really beneficial than hiring people to handle calls in volume, i run an ai voice automation business and understand these issues really well.",
          "score": 1,
          "created_utc": "2026-02-03 20:07:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3fl7w7",
          "author": "[deleted]",
          "text": "[deleted]",
          "score": 1,
          "created_utc": "2026-02-03 23:16:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3h5448",
              "author": "Commercial-Job-9989",
              "text": "I am not trying to sell just sharing my experience.",
              "score": 1,
              "created_utc": "2026-02-04 04:38:07",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3inon5",
          "author": "Puzzleheaded-Rip2411",
          "text": "This tracks, speed to lead and zero missed calls is the whole game. On the hallucination point, the only safe way I’ve seen this work is keeping the assistant tightly scoped to qualify, capture, schedule, and transfer, and having it say “I don’t know” instead of guessing. Also on the “just hire someone” comment, humans still miss calls at peak times and they don’t do perfect follow ups every time. What tool did you use, and did you disclose it was AI or just keep it conversational?",
          "score": 1,
          "created_utc": "2026-02-04 12:19:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3jzacg",
          "author": "ashleymorris8990",
          "text": "Hey, are you up for any tool exploration? \n\nFor this exact use case, Skara AI agents, like an [AI sales agent](https://www.salesmate.io/ai-agents/sales/) are worth testing.\n\nThey handle inbound calls, qualify leads, and pass full context into the CRM so reps only talk to warm prospects. The leverage is in what happens after the call, not the call itself.\n\nAlso, did you run your setup standalone or connected to your sales workflows?",
          "score": 1,
          "created_utc": "2026-02-04 16:30:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3vowa5",
          "author": "thinking_byte",
          "text": "Speed is everything. If you hit them back in 30 seconds you win. If you wait 30 minutes they're usually already talking to a competitor.",
          "score": 1,
          "created_utc": "2026-02-06 10:39:25",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qwfvfk",
      "title": "rentahuman AI is a dystopian movie plot right?",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qwfvfk/rentahuman_ai_is_a_dystopian_movie_plot_right/",
      "author": "EducationalArticle95",
      "created_utc": "2026-02-05 08:30:08",
      "score": 16,
      "num_comments": 16,
      "upvote_ratio": 0.76,
      "text": "ok so i went down the rentahuman ai rabbit hole and it gets stranger the more I research.   \n  \ntldr: ai can now hire humans using an api call. and humans are putting themselves up on the site FOR RENT (so weird that they used the word \"Rent\")   \n  \nhow it works in practice:   \n\\- humans sign up on rentahuman ai   \n\\- you list your skills like a weird linkedin / fiverr hybrid (research, phone calls erc.)   \n\\- you set an hourly rate.   \n\\- ai agents browse these profiles and decide if you’re “useful\" and hire you   \n  \nthe platform literally describes humans as the “real-world physical layer for ai” which is so abrasive.   \n  \nthis is ai treating humans like tools. from “hey ai, help me do this” to ai saying “hey human, go do this for me” is this the future of work? a weird experiment? should we be freaking out more?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qwfvfk/rentahuman_ai_is_a_dystopian_movie_plot_right/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "o3oumgp",
          "author": "ogenom",
          "text": "This reads like a thinly veiled ad for whatever rent a human is.",
          "score": 6,
          "created_utc": "2026-02-05 09:32:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3p995d",
          "author": "KrydanX",
          "text": "Sounds like an ad, but just to add to the conversation;\n\nIsn’t this basically how many HR Systems are build nowadays? You collect a pool of candidates based on sophisticated profiles and then pick the one that fits best to your needs. It’s just automating the human part, which, I think will lead to even more people lying the shit out of their CV and skills to get picked by automated systems. At least with human hiring you have some control instance.",
          "score": 4,
          "created_utc": "2026-02-05 11:45:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3pgzug",
          "author": "Varioustiny",
          "text": "Who is actually paying the humans??",
          "score": 3,
          "created_utc": "2026-02-05 12:41:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3twoib",
              "author": "EducationalArticle95",
              "text": "It's in cryptocurrency apparently\n\n",
              "score": 2,
              "created_utc": "2026-02-06 02:16:13",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3pn6jn",
          "author": "unique_name_14",
          "text": "Sounds much like a freelancer site",
          "score": 2,
          "created_utc": "2026-02-05 13:20:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3oo5js",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-05 08:30:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3qy9zy",
          "author": "PresentStand2023",
          "text": "It's not real, it's just some viral stunt that shills like you can post about",
          "score": 1,
          "created_utc": "2026-02-05 17:15:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3r0pjz",
          "author": "anashel",
          "text": "Freelancer or upworks or fiverr website with a mcp wrapper…",
          "score": 1,
          "created_utc": "2026-02-05 17:27:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3rnruj",
          "author": "Tombobalomb",
          "text": "It's just a scam/platform to sell other scams",
          "score": 1,
          "created_utc": "2026-02-05 19:12:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3rqzn6",
          "author": "Celac242",
          "text": "Man these veiled advertisements are everywhere on Reddit.  Reddit has really turned into a wasteland of ads since it went public",
          "score": 1,
          "created_utc": "2026-02-05 19:27:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3txqo5",
          "author": "Beneficial-Panda-640",
          "text": "The wording is doing a lot of psychological damage here. If you strip the language away, this looks very similar to task marketplaces that already exist, just with an algorithm doing the matching instead of a human. What feels different is the framing of people as a “layer” rather than as agents with judgment and choice.\n\nThe risk I see is not that AI delegates work, that already happens, but that responsibility and context get abstracted away. When a human assigns a task, there is usually some shared understanding of consequences and quality. When an agent does it, that accountability can get fuzzy fast. Whether this becomes dystopian or just another weird labor market experiment probably depends on how much agency and transparency the humans on the other side actually retain.",
          "score": 1,
          "created_utc": "2026-02-06 02:22:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3w817o",
          "author": "bloodredpitchblack",
          "text": "I will perform seances and other rituals for any AI that's paying in Bitcoin. ",
          "score": 1,
          "created_utc": "2026-02-06 13:03:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o45zfzx",
              "author": "TopShoulder5971",
              "text": "What protects your wallet from those agents? Whoever behind such agents? Very risky.",
              "score": 1,
              "created_utc": "2026-02-07 23:43:44",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o45yu2o",
          "author": "TopShoulder5971",
          "text": "Its just a \"job seeking\" site with AI masking. . This more likely to do fishy stuff with your data while compromising your cryptowallet due their \"payment\" method.",
          "score": 1,
          "created_utc": "2026-02-07 23:40:01",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qxe4kg",
      "title": "Just started with AI — what tools are worth trying?",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qxe4kg/just_started_with_ai_what_tools_are_worth_trying/",
      "author": "Shitandaa",
      "created_utc": "2026-02-06 10:31:03",
      "score": 15,
      "num_comments": 21,
      "upvote_ratio": 1.0,
      "text": "Hi everyone! I’m new to AI and trying to figure out which tools are actually useful in real life.  \nWhich websites do you personally use and recommend?  \nWould love some beginner-friendly advice!",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qxe4kg/just_started_with_ai_what_tools_are_worth_trying/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "o3w5cy5",
          "author": "Much_Pomegranate6272",
          "text": "Depends what you're trying to do.\n\nFor general AI stuff: ChatGPT or Claude for writing, brainstorming, coding help.\n\nFor automation: n8n to connect tools and build workflows.\n\nFor images: Midjourney or DALL-E.\n\nDon't just try random AI tools - figure out what problem you're solving first, then find the tool that fits.\n\nWhat are you actually trying to use AI for?",
          "score": 5,
          "created_utc": "2026-02-06 12:46:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3vv6jf",
          "author": "purple_logic",
          "text": "I’d just start with a couple of tools and keep it simple. Trying too many at once usually just makes things messy.  \nFor day-to-day stuff, ChatGPT is an easy pick. Perplexity is also nice if you want something that feels more like a search engine.  \nFor work, I’d look for tools that plug into what you already use and connect into places like Slack or Notion, for easy adoption. We've been recently using n8n for workflows, zapier for for quick automations between apps and meetgeek for automating meetings.",
          "score": 2,
          "created_utc": "2026-02-06 11:33:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3xco6y",
          "author": "yuvrajchowdhxry",
          "text": "If I were to suggest anything, I wouldn't advise you to learn to play with ChatGPT or any other common AI tool, as you will likely use it anyway. On a serious note, try;\n\n\\- Gamma AI: PPTs, pitch decks, and so on. Very useful for corporates.\n\n\\- OmniDimension: Voice AI agents for sales, outreach, and customer care. Very efficient for enterprises to keep leads engaged.\n\n\\- Claude's Project feature: It is so underrated and OG for repetitive tasks.\n\nThese aren't for the sake of learning AI, but they will actually benefit your career and open up some amazing opportunities.",
          "score": 2,
          "created_utc": "2026-02-06 16:30:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3voaxo",
          "author": "CallCenterOwner",
          "text": "Try ChatGPT for writing and ideas, Canva AI for design, Notion AI for notes, and Zapier or Make for automation. Start small and practice that’s the best way to learn.",
          "score": 2,
          "created_utc": "2026-02-06 10:34:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3vnz1o",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-06 10:31:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3vq9xv",
          "author": "reaictive",
          "text": "I’d recommend ChatGPT as a general assistant (writing, planning, study help), Claude for coding, Gemini for long docs, and Perplexity for quick research with sources. For AI image generation, you can try Nanobanana, and for video, Veo3. For automations, n8n or Zapier.",
          "score": 1,
          "created_utc": "2026-02-06 10:51:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3vv2yn",
          "author": "AIToolsMaster",
          "text": "chatgpt is the obvious starting point, just mess around with it and see what it can do. ask it to explain things, help you write stuff, create/edit images, etc.\n\nbut the real wins for me have been more specific tools:\n\n* email drafting - [claude.ai](http://claude.ai) or [chatgpt](http://chatgpt.com)  work great for this\n* organizing my tasks/schedule, keeping docs organized- notion ai!\n* meeting transcription - i use an ai tool like [tactiq.io](https://tactiq.io) to transcribe and take meeting notes . saves me probably 5+ hours a week\n* document summaries - perplexity is good for quickly understanding long articles\n\nthe best approach is to identify one annoying task in your day and find an ai tool for that. once you see the time savings, you'll naturally want to automate more stuff 😊",
          "score": 1,
          "created_utc": "2026-02-06 11:32:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3w2jko",
          "author": "Equal_Ad_7668",
          "text": "ChatGPT is something you start with and end with too.\nIf you want to learn ai for with specific goal then thing is different",
          "score": 1,
          "created_utc": "2026-02-06 12:27:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3w2ymf",
          "author": "Hereemideem1a",
          "text": "Welcome! One beginner-friendly tool I really like is Vomo. It turns voice notes, meetings, or uploads into clean summaries and action items. Super useful if you're trying to stay organized.",
          "score": 1,
          "created_utc": "2026-02-06 12:30:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3w3r2r",
          "author": "Lazy-chameleon",
          "text": "Besides ChatGPT, I suggest using Gemini as a starting point. \n\nWhenever I need short-term tools for quick tasks, I often ask for suggestions from Chat or Gemini. I usally get good results without spending much time. However, for more 'serious' tools, I still prefer to do a bit more research and testing.",
          "score": 1,
          "created_utc": "2026-02-06 12:35:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3w9cgu",
          "author": "GetNachoNacho",
          "text": "* ChatGPT for text-based AI tasks and learning\n* DALL·E for AI image generation\n* RunwayML for creative projects like video editing and content creation\n* Lumen5 for turning blog posts into engaging video content",
          "score": 1,
          "created_utc": "2026-02-06 13:11:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3wj2n7",
          "author": "MemoryKeeper92",
          "text": "Gemini or Claude nothing more for start and of course perplexity for search bro",
          "score": 1,
          "created_utc": "2026-02-06 14:04:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3wks40",
          "author": "ManofC0d3",
          "text": "I would suggest you get a small bite of everything for starters. You can use ChatGPT and claude for just ordinary conversations, try Deepseek and Grok for research and different perspectives on your favorite topics and Gemini for research. Nano banana and sora re really good for image generation but be sure to try Dall-e and Midjourney too",
          "score": 1,
          "created_utc": "2026-02-06 14:13:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3wmuiz",
          "author": "ChestChance6126",
          "text": "Start with tools that replace a painful manual step rather than ones that look cool on a homepage. For most people, that’s things like AI assisted summarization for text/audio, smart classification/tagging, or templates that save you from writing the same thing over and over, and once you’ve got a couple of those actually saving time, you can expand.",
          "score": 1,
          "created_utc": "2026-02-06 14:24:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3wr75w",
          "author": "New-Neighborhood8422",
          "text": "I'd say it depends on what exactly you want to try, but I usually use ChatGPT for simple tasks, Claude for any creative activities (for example, writing copies), and Sembly AI for meeting notes + to draft meeting docs afterward.   \nI also use Canva from time to time. It's quite easy to navigate if you need to create visuals",
          "score": 1,
          "created_utc": "2026-02-06 14:47:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3xacae",
          "author": "aaipod",
          "text": "What AI is best for forum analysis? Im trying to gather human specialized information",
          "score": 1,
          "created_utc": "2026-02-06 16:20:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3xmpfh",
          "author": "pvfakten",
          "text": "Oidapost for social media :)",
          "score": 1,
          "created_utc": "2026-02-06 17:18:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3y85ue",
          "author": "AutomationPartner",
          "text": "Agreed with most of the other posts here. One of my newer recommendations in this space is using Gemini 3 for pulling information or text from images as well as creating images. Feels like it's miles ahead of Claude and ChatGPT in this area. \n\nI've been changing most of my automations from Claude/ChatGPT to Gemini 3 and seen a big increase in accuracy. ",
          "score": 1,
          "created_utc": "2026-02-06 19:00:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3z4mww",
          "author": "koojlauj11",
          "text": "Agreed with the others, it depends what you want to use it for.\n\nFirst, learn how to prompt and how to create effective prompts.\n\n  \nTools:\n\n* ChatGPT is the most known one.\n* If you have a google workspace, Google's AI Studio tools are a great resource. Gemini, NotebookLLM, etc. Deepmind . google (shows you their various tools and have a good access to free tools)\n* Claude is focused on a higher degree of safety compared to other AI tools. Has European government contracts: Great for research, writing, coding, research, more of a detailed breakdown.\n* Kimi is a more recent one but apparently it was doing pretty well from just jumping in.\n* xAI -Grok (Elon started this one) the US government is creating a contract with it.\n* Quality Image/Video Generation: Midjourney, Nano Banana Pro (google), Kling, Higginsfield AI\n\nOpenRouter . ai shows rankings of current AI tools great place to check out whose leading and how many tokens are being spent\n\n",
          "score": 1,
          "created_utc": "2026-02-06 21:40:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o408huh",
          "author": "AutonomousLandlord",
          "text": "For day-to-day use I would recommend Google Gemini. It's one of the smarter AI programs out there, and the free version works great.",
          "score": 1,
          "created_utc": "2026-02-07 01:23:03",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qv2148",
      "title": "AI is useless for the $1M-$5M business operator",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qv2148/ai_is_useless_for_the_1m5m_business_operator/",
      "author": "founders_keepers",
      "created_utc": "2026-02-03 19:44:02",
      "score": 13,
      "num_comments": 17,
      "upvote_ratio": 0.76,
      "text": "Most solutions have no real focus.. a better CRM? I'm legit still using an Excel sheet. AI SDR? who cares, I've already set up a hardcoded workflow that's printing leads.\n\nSome are building \"AI product managers\", this feels like the right approach but still early and feels clunky. My hypothesis is that it's hard to define great PMs and so it's even harder to encode them into workflows.\n\nFrontier labs are going after the largest TAM possible, and by logic these are the 0-1 founders and companies, they're great but replaces the VAs and not really a key to helping me scale to $5M range.\n\nAI Enterprise solutions dominate because custom solutions are hard and worth millions. Labs like 8090 prove it. Irrelevant for me.\n\nBest counter examples I've seen are around automating back-office work like accounting and data entry, I've even gotten feedback that I'm thinking about this entirely the wrong way: that AI shouldn't be used to save time but enable one to \"do more\". I'm not entirely convinced on it.\n\nRight now it's much more effective to just hire capable people and scale them instead at the middle stage I'm talking about. This will likely change in 6 months of time, so the dilemma is wether you hire now or wait and see and forgo bigger growth at the same time.\n\nTL;DR Someone needs to build boring, focused AI tooling for the $1M–$5M operator, we're the most underserved market in tech.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qv2148/ai_is_useless_for_the_1m5m_business_operator/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "o3efv2k",
          "author": "ckalit",
          "text": "What's the one repetitive task in your business that    \n1. takes 5-10 hours/week  \n2. requires judgment but follows a pattern, and   \n3. you can't just hire a $20/hr VA to handle because the context switching cost is too high?",
          "score": 6,
          "created_utc": "2026-02-03 19:58:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3ehjro",
              "author": "founders_keepers",
              "text": "sales, marketing and content ideas and execution for clients (we're a marketing agency)  \neverything else is mostly automated away already or i don't really think about.\n\nwe're at 1M run-rate and it's a 4 people team.. 1x me plus 3x account managers who interfaces with the client.",
              "score": 3,
              "created_utc": "2026-02-03 20:06:21",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3i18vn",
                  "author": "alvares169",
                  "text": "\\> content ideas and execution\n\nThere you go.",
                  "score": 1,
                  "created_utc": "2026-02-04 09:05:20",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3frcq0",
          "author": "JacobAldridge",
          "text": "Pretty well completely agree with you! Though it’s a wider Tech point, not AI specifically.\n\nThat size business has been the vast majority of my consulting work - more ideas than they have time or capability.\n\nWhen it comes to tech, some love experimenting, some of businesses that necessitate it, but most need solutions that “just work” as an enabler.\n\nSo it’s the classic adoption curve conversation and “first mover disadvantage) - way too risky for an SME to build core business processes around technology that’s unproven or may not be around on 6-12 months.\n\nThat’s true of Automation - but most automation tech is now established, businesses may still be Early Adopters but APIs aren’t a Leading Edge innovation.\n\nAI is the wild west! I’ve got sick of playing with all the new announcements - half don’t do what they promise, so many are gone in a heartbeat. I can talk to the segment with some knowledge, but I won’t be recommending much to my clients until they’ve been proven.\n\nTLDR: Not so much that AI is completely useless; more that these businesses shouldn’t waste limited resources on unproven technology, which most AI currently is.",
          "score": 3,
          "created_utc": "2026-02-03 23:50:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3gf4y2",
          "author": "loud-spider",
          "text": "People tend to overlook the reality that smaller companies have processes that change more rapidly as they grow (and work out what they need) than established companies with stable processes.\n\nThe three things (min) you need to make automation work properly are stability (aka process maturity), process ownership so that someone feels they are 'allowed' to change the automation if it's no longer hitting the requirement, and a change framework that allows for that to happen safely if you're chaining these things or connecting them to anything else.\n\nThe win isn't when automating something saves you time, it's when automating something and dealing with all those things to maintain a working environment still saves you time.  At that point you're probably the right size.",
          "score": 2,
          "created_utc": "2026-02-04 02:02:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3hnywd",
          "author": "Maroontan",
          "text": "I agree with u but key word 6 months",
          "score": 2,
          "created_utc": "2026-02-04 07:03:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3homgc",
              "author": "Maroontan",
              "text": "RemindMe! 7 months",
              "score": 2,
              "created_utc": "2026-02-04 07:09:24",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3ecrza",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-03 19:44:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ftvuv",
          "author": "dwoodro",
          "text": "Perhaps you're right... Perhaps AI is useless for \"the $1M-$5M business operator,\", or perhaps just for your specific use case scenario at this time. \n\nThis is likely a workflow issue for your specific situation. Not a true indication of AI viability at that level of structure. \n\nSince every business is different, and ever busines builder is different, every AI use case will likely be different as well. Hell, I made the top 3% of usage on ChatGPT as a soloist last year. I've done over 60k pages worth of material in the last three years, and I am not even using it to write these responses. :)\n\nSo it just truly matters what you are using it for, what your workflows and your specific needs are like. If you already have a well-defined workflow, have eliminated unnecessary tasks, and have streamlined before using AI, then yeah, it might not help you as much.\n\nI would still wager there are steps that could still be more optimal or enhanced through the use of AI that could, in fact, be implemented. You simply might not be implementing those types of tasks yet. \n\nThere will always be tradeoff points for hiring vs using a new tool. Whether you are talking AI or a new video editor, someone has to take time to learn the new tool before becoming proficient with it. That's the nature of the beast. So yes, there will always be a bit of a back and forth on this concept of \"easier to onboard new staff\" than to revamp your entire workflow. \n\nPersonally, when it comes to AI, I actually slow down at times because of issues such as AI slop. Not all AI usage has to be ultr-fast, redundant, crap. So there must be a balance even with AI.\n\nAs for \"TL;DR Someone needs to build boring, focused AI tooling for the $1M–$5M operator, we're the most underserved market in tech.\"\n\nYou could always build this. This is often how things get started. You are the best person to know what you are looking for. Many of the solutions I have developed over the years (4 decades of Dev Work), have almost always been custom solutions that I needed. There's a bit of a Dev roadmap that makes life a lot easier in the process, but many large-scale companies started as a single software tool. \n\nMany of these tools started as fixes to problems, often recurring problems. They were fixed, but often never meant to become products in the first place. \n\nWhat’s different now is the scope of what’s expected. You’re not just writing code anymore. You’re juggling systems, automation, testing, deployment, infra, security, and now AI on top of all of that. None of that is wrong, but the tooling landscape feels polarized. You either get lightweight hacker tools or massive enterprise platforms that assume layers of staff and process.\n\nThe $1M–$5M operator is stuck in the middle. They don’t need flashy innovation. They need boring, opinionated tools that reduce friction and cognitive load, standardize the obvious stuff, and let people focus on the work. “Boring” is kind of the point, and calm systems beat clever ones when you’re trying to run an actual business.\n\nIf you’re already operating in that space, you’re probably in a better position than most vendors to assemble something focused that actually reduces friction instead of adding another platform to manage.\n\nAs a developer, it could take me months to fully flesh out the industry that you are in ona level that would truly \"impact that market sector\". I wrote custom call center software for years; that's a highly specific industry. But I was in that industry to begin with. You have the built-in experience, knowledge, and understanding of your needs better than an outside developer would. \n\nIf you were to build the framework, based on the needs and functions that you required, then you could hand that off to developers and have it built.",
          "score": 1,
          "created_utc": "2026-02-04 00:04:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3gt556",
          "author": "NeverClosedAI",
          "text": "Never Closed AI is an inbound and outbound phone agent that handles hundreds of calls a day for our clients, saving them tens of thousands of dollars a month.\n\n\n\nused by many 1mil+ operations.",
          "score": 1,
          "created_utc": "2026-02-04 03:22:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3h1fzl",
          "author": "chux52osu",
          "text": "What would that tooling look like? Just copies of your employees?",
          "score": 1,
          "created_utc": "2026-02-04 04:13:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3kz9jr",
              "author": "founders_keepers",
              "text": "That's the dream no?",
              "score": 1,
              "created_utc": "2026-02-04 19:14:13",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3l28av",
                  "author": "chux52osu",
                  "text": "Maybe. I assume your employees highest leverage is customer facing. \n\nIf a single developer was building something specifically for you and your business, would it be things that saved employees time? \n\nFinding leads, prep for clients, client changes to the product?",
                  "score": 1,
                  "created_utc": "2026-02-04 19:28:02",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3hpdxh",
          "author": "Much_Pomegranate6272",
          "text": "You're right but the problem isn't lack of tools - it's that $1-5M businesses all have different workflows and needs.\n\nWhat works for e-commerce doesn't work for agencies doesn't work for SaaS. So building \"one tool\" for that market is impossible.\n\nThe boring AI stuff that actually helps: automating specific repetitive tasks in YOUR workflow. Not generic \"AI assistants\" but custom automation for order processing, customer support routing, data entry - whatever eats your team's time.\n\nFrontier AI labs ignore this market because custom solutions don't scale as products. Enterprise gets custom because they pay millions. SMBs get leftovers.\n\n- hire someone to build specific automation for your bottlenecks using tools like n8n + AI APIs. Way cheaper than hiring more people and actually solves your problems vs hoping some SaaS fits.\n\nWhat's actually eating your team's time right now?",
          "score": 1,
          "created_utc": "2026-02-04 07:16:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3hsbaa",
          "author": "nanohuman_ai",
          "text": "You nailed the \"Mid-Market Gap.\" Most AI founders are building for 0-1 dreamers or Fortune 500 dinosaurs because the $1M-$5M segment is actually hard to serve—it requires deep operational nuance, not just \"cool features.\"\n\nOn your dilemma about hiring vs. waiting: Hire for empathy, automate for pattern matching. > Don't wait 6 months for a \"magic agent\" to appear. It won't. But don't hire a human just to do \"data moving\" either. The real win in the $1M-$5M range isn't \"saving time,\" it's removing the cognitive tax on your high-performers. If your hardcoded lead-gen is \"printing leads,\" don't touch it. But if your team is spending 2 hours a day synthesizing those leads or updating that Excel, that’s where you’re bleeding the margin that gets you to $5M.\n\nMy take? Hire the \"capable people\" now, but make it their first KPI to build their own \"AI exoskeleton.\" If they can’t use LLMs to 2x their own output, they aren't the right hire for the scale you're aiming for.",
          "score": 1,
          "created_utc": "2026-02-04 07:42:12",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qxas94",
      "title": "What are people switching to after play ht shutdown?",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qxas94/what_are_people_switching_to_after_play_ht/",
      "author": "midnight_sunshine13",
      "created_utc": "2026-02-06 07:03:28",
      "score": 13,
      "num_comments": 5,
      "upvote_ratio": 0.9,
      "text": "I have been seeing a lot of failed generations, network errors and accounts not behaving the same way they used to for longer voice projects.\n\nI am starting to look around for alternatives. What others are moving to right now and whats actually working. Are people migrating successfully or still testing options?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qxas94/what_are_people_switching_to_after_play_ht/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "o3w6xv3",
          "author": "MayonnaiseDays",
          "text": "I moved a couple of longer narration projects over to VoiSpark after running into the same Playht issues. Its been more stable ",
          "score": 2,
          "created_utc": "2026-02-06 12:56:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3v1uzv",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-06 07:03:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3w70zr",
          "author": "Zasaky",
          "text": "The biggest issue for me hasnt even been voice quality its reliability",
          "score": 1,
          "created_utc": "2026-02-06 12:56:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3w742l",
          "author": "Micki_SF",
          "text": "I am still in testing mode honestly. A lot of tools sound decent at first but break down once you push longer scripts or try to reuse the same voice consistently",
          "score": 1,
          "created_utc": "2026-02-06 12:57:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3w77gx",
          "author": "nawang013",
          "text": "Has anyone has actually fully migrated yet?",
          "score": 1,
          "created_utc": "2026-02-06 12:58:06",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qvisjk",
      "title": "What AI tools are you using for advertising in 2026?",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qvisjk/what_ai_tools_are_you_using_for_advertising_in/",
      "author": "Yuvix",
      "created_utc": "2026-02-04 08:08:34",
      "score": 13,
      "num_comments": 14,
      "upvote_ratio": 1.0,
      "text": "Lately been focused on UGC videos. Stuff that actually feels native to tiktok, reels and shorts not polished brand films that kill performance.\n\nHow are you creating UGC videos for your social media right now?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qvisjk/what_ai_tools_are_you_using_for_advertising_in/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "o3ofm6h",
          "author": "zarape2",
          "text": "Same here. Polished brand videos just dont hit the same anymore. Most of my focus has shifted to UGC style clips that are fast to produce and easy to iterate on. Simple scripts, quick cuts, captions and multiple variations matter way more than perfect visuals. I have been using FalcoCut for that workflow lately",
          "score": 3,
          "created_utc": "2026-02-05 07:10:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3hv7xc",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-04 08:08:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3odz8u",
              "author": "ApricotJaded462",
              "text": "?",
              "score": 1,
              "created_utc": "2026-02-05 06:55:51",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3hvncu",
          "author": "albrasel24",
          "text": "Same direction here. Polished ads are basically dead on TikTok.\n\nWe’ve been scripting loose UGC outlines, then using creators or AI avatars to record messy, phone-style clips. CapCut + native TikTok editor still beats most “AI ad tools.” AI helps more with hooks, angles, and variations than the actual video. The raw + imperfect stuff consistently wins.",
          "score": 1,
          "created_utc": "2026-02-04 08:12:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ib8in",
          "author": "Sogra_sunny",
          "text": "Currently, I have been using Vadoo AI for generating UGC videos, and it works well for my requirements.",
          "score": 1,
          "created_utc": "2026-02-04 10:38:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3mwog3",
          "author": "Electronic-Cat185",
          "text": "what seems to work best is using AI more for speed and iteration than for the final look. rough scripts hooks and variations get tested fast and then humanss shape what actually feels native. the ugc that performs usuallly looks imperfect on purpose and AI helps generate options not polish. the bigggest win is shortening the feedback loop rather than trying to automate creativiity end to end.",
          "score": 1,
          "created_utc": "2026-02-05 01:05:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3oe1iy",
          "author": "Jakoreso",
          "text": "For us, we keep it simple because that works best. We ask real users to record short clips on their phones, and give them loose talking points, not scripts. We can then repurpose the raw clips across platforms",
          "score": 1,
          "created_utc": "2026-02-05 06:56:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3pfsl1",
              "author": "PuzzledSherbert3418",
              "text": "Thats why you’re winning right now. The viewer needs human interaction and trust factor.\n\nBecause using AI avatar = lose trust right away\nElevenlabs voiceover = lose trust right away \n\nGood strategy I’ve been using something similiar and it’s putting me miles ahead of where I was at.",
              "score": 1,
              "created_utc": "2026-02-05 12:33:15",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3ojqzb",
          "author": "ConfidentElevator239",
          "text": " just a heads up, this post is about UGC video creation but Brandlight is actually for monitoring brand mentions in AI search answers, not advertising or video tools. Different thing entirely. if you're looking for help with AI-generated UGC content, you probably want something like Synthesia or other video generation platforms instead.",
          "score": 1,
          "created_utc": "2026-02-05 07:48:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3pf8q3",
          "author": "PuzzledSherbert3418",
          "text": "None. AI kills retention and performance of campaigns too much.\n\nI tried it and yes it worked the last 2 years but that ship is sailing. I actually prefer more people using AI now because original content and no AI info in the metadata automatically boosts above anything AI or videos using AI tools to create the video.",
          "score": 1,
          "created_utc": "2026-02-05 12:29:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3uihgi",
          "author": "quietkernel_thoughts",
          "text": "For us, we keep it simple because that works best. We ask real users to record short clips on their phones, and give them loose talking points, not scripts. We can then repurpose the raw clips across platforms",
          "score": 1,
          "created_utc": "2026-02-06 04:32:16",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qubbfx",
      "title": "What’s the most practical way to automate transcription for multiple audio files?",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qubbfx/whats_the_most_practical_way_to_automate/",
      "author": "PolicyFit6490",
      "created_utc": "2026-02-02 23:23:11",
      "score": 12,
      "num_comments": 35,
      "upvote_ratio": 1.0,
      "text": "Hi everyone,\n\nI’m dealing with batches of audio files and trying to reduce the manual effort involved in turning them into usable transcripts. Some files are interviews, others are creator recordings, and doing this by hand is very time-consuming.\n\nI’m mainly looking for workflow or automation approaches that save time, rather than tool recommendations. Has anyone set up a process that handles multiple files efficiently? I’m curious about approaches that balance speed and accuracy, and whether automated methods can get most of the work done before any manual cleanup.\n\nAlso interested in tips for batching or organizing files so the process doesn’t become a headache. Would love to hear what’s worked in practice for others who have automated transcription at scale.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qubbfx/whats_the_most_practical_way_to_automate/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "o39bitp",
          "author": "Latter_Ordinary_9466",
          "text": "I used to really dread doing audio transcription 😅. It could take a long time, especially with longer files, and keeping everything organized was a hassle. I tried an automated transcription tool, like Prismascribe, on some of the bigger recordings. I still had to fix a few mistakes, but it made managing the workflow simpler and reduced repetitive work, making it easier to handle multiple files.",
          "score": 6,
          "created_utc": "2026-02-03 00:46:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o39nwph",
              "author": "PolicyFit6490",
              "text": "Ah nice, I'll check Prismascribe out! Sounds like it could save me a ton of time, especially with these long files.",
              "score": 1,
              "created_utc": "2026-02-03 01:57:29",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3xa67g",
                  "author": "loginabhijeet",
                  "text": "You may also use Transkriptor as it works well.",
                  "score": 1,
                  "created_utc": "2026-02-06 16:19:24",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o391h24",
          "author": "Cachao-on-Reddit",
          "text": "Get Opencode (or Claude Code etc.) to write you a Python or Go script that:\n- checks the directory on your machine for any untranscribed audio files\n- hits a transcription API (e.g. Deepgram or one of the new/open ones)\n- writes the output to a text file\n- uses an LLM to review the output for errors",
          "score": 4,
          "created_utc": "2026-02-02 23:52:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o39280v",
              "author": "punchsport",
              "text": "Yeah, really this.  It's pretty straight forward at this point.",
              "score": 1,
              "created_utc": "2026-02-02 23:56:24",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o39i8li",
              "author": "paperweight_is_lazy",
              "text": "Exactly what I did",
              "score": 1,
              "created_utc": "2026-02-03 01:25:07",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o39xgi7",
              "author": "ISueDrunks",
              "text": "At $2-$3 per minute, don’t forget to run your audio through ffmpeg to remove all silence. ",
              "score": 1,
              "created_utc": "2026-02-03 02:51:42",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o38w77l",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-02 23:23:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o38zh5u",
          "author": "FinancialMoney6969",
          "text": "People pay $ for this type of information",
          "score": 1,
          "created_utc": "2026-02-02 23:41:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o390vz7",
              "author": "PolicyFit6490",
              "text": "Haha yea exactly",
              "score": 1,
              "created_utc": "2026-02-02 23:49:09",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o392wdw",
                  "author": "FinancialMoney6969",
                  "text": "Get Claude api ask clawdbot 😉",
                  "score": 1,
                  "created_utc": "2026-02-03 00:00:02",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o397i4n",
          "author": "Mommyjobs",
          "text": "Ive been using Otter for a while, mostly for short meeting and quick notes. It generally works fine for basic transcription, but you still need to edit the output, especially if the audio quality isn't great. For me, it's a good starting point before reviewing the text.",
          "score": 1,
          "created_utc": "2026-02-03 00:25:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o39fqe5",
              "author": "PolicyFit6490",
              "text": "Got it, thanks. I might try it for small files just to see how it handles them.",
              "score": 1,
              "created_utc": "2026-02-03 01:10:47",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3993w0",
          "author": "stratofax",
          "text": "You can transcribe audio and video files for free on your own computer using the “whisper” audio library from OpenAI. Because it’s easy to use in a Python script, you could ask ChatGPT or Claude to write you a script that would transcribe (for example) all of the audio files in a folder you provide.",
          "score": 1,
          "created_utc": "2026-02-03 00:33:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o39fnlb",
          "author": "Informal_Data5414",
          "text": "I usually just do small files manually. Sometimes it's faster than trying to deal with an AI that messes up every other word 😆.",
          "score": 1,
          "created_utc": "2026-02-03 01:10:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o39rjo8",
              "author": "PolicyFit6490",
              "text": "Haha yeah I feel that. Some of these files are short, but the long ones are a nightmare to do by hand.",
              "score": 1,
              "created_utc": "2026-02-03 02:17:56",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o3xahwx",
              "author": "loginabhijeet",
              "text": "If the audio quality is clear, AI does it pretty well rather than manually editing. A few clicks and it's done.",
              "score": 1,
              "created_utc": "2026-02-06 16:20:55",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o39g1on",
          "author": "Electronic-Cat185",
          "text": "what helped me was thinkiing in terms of a pipeline instead of a single transcriptiion step. batch files iinto consiistent lengths normalize audio first and then let automation do a first pass even if it iis imperfect. once the structure is consistent cleanup becomes much faster because you are editing not creating. accuracy matters less than consistency at scale and that mindset shift saved me the most time.",
          "score": 1,
          "created_utc": "2026-02-03 01:12:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o39ks8t",
              "author": "PolicyFit6490",
              "text": "Ahh, makes sense mate!",
              "score": 1,
              "created_utc": "2026-02-03 01:39:45",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o39jgm4",
          "author": "SleepyHead1219",
          "text": "Honestly, splitting big audio into smaller chunks makes a huge difference. Even if you’re using an AI tool, it’s way easier to fix errors when the files aren’t huge.",
          "score": 1,
          "created_utc": "2026-02-03 01:32:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3a7for",
              "author": "PolicyFit6490",
              "text": "Good tip! I'll tty breaking them up. It's annoying to do, but sounds like it'll ave a lot of frustration in the long run.",
              "score": 1,
              "created_utc": "2026-02-03 03:51:40",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o39syfw",
          "author": "evoxyler",
          "text": "I just let AI do the first draft, then tweak the parts that sound off. Really cuts down on the hassle.",
          "score": 1,
          "created_utc": "2026-02-03 02:26:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3a08l9",
          "author": "Zulfiqaar",
          "text": "Can't post links to repositories, but been using WhisperX for ages. Parakeet is more efficient, less languages and maybe less grammatical quality. Qwen ASR may be quite good. There's a bunch more recently too",
          "score": 1,
          "created_utc": "2026-02-03 03:07:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3a72t1",
          "author": "Beneficial-Panda-640",
          "text": "What usually makes this workable is treating transcription as a pipeline, not a single step. Batch ingest, normalize audio upfront, then run automated transcription with metadata attached so you always know source, speaker context, and confidence levels later. The real time saver is accepting that the first pass is “good enough” and only routing low confidence segments or specific fields for review instead of rereading everything.\n\nOn the organization side, consistent naming and a simple status state helps more than fancy tooling. Raw, transcribed, reviewed, final. Once you can see where things stall, you can tighten just that part instead of reworking the whole flow. The teams I’ve seen succeed aim for 80 to 90 percent automation and design the last 10 percent to be fast and boring.",
          "score": 1,
          "created_utc": "2026-02-03 03:49:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ags7i",
          "author": "hellomari93",
          "text": "Tbh ignoring tools makes this harder because most modern AI note-takers handle bulk automation out of the box now.",
          "score": 1,
          "created_utc": "2026-02-03 04:54:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ax1po",
          "author": "slunkeh",
          "text": "The setup that works best for this is a watch folder connected to Whisper API through something like n8n or Make. Drop your audio files into a Dropbox or Google Drive folder, and the automation picks them up, sends them to Whisper for transcription, then saves the output with a matching filename. You can add a second step that runs the transcript through GPT to clean up filler words, fix punctuation, and format into proper paragraphs.\n\nFor organising the files, a naming convention like YYYYMMDD_clientname_topic.mp3 saves you a lot of pain later. If you sort by subfolders (one per client or project), the automation can tag transcripts based on where they came from, which makes searching through them way easier down the line.\n\nOne thing to watch: Whisper has a 25MB file limit and accuracy drops on very long recordings. If your interviews run over an hour, chunk them before sending. The API costs about $0.006 per minute, so a full hour comes out to roughly $0.36. At that price the bottleneck is really just the manual review for proper nouns and industry terms, which usually takes a fraction of the time compared to transcribing from scratch.",
          "score": 1,
          "created_utc": "2026-02-03 07:04:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3bn5y8",
          "author": "Boogooooooo",
          "text": "There is a chatgpt module for that on make Automation\nPretty sure N8N would have it as well.\nI would trust open ai model over others as in practical terms in understands accent very well.\nAs a free alternative you can upload them to YouTube and take script from it when published.\nThere is a module for that as well",
          "score": 1,
          "created_utc": "2026-02-03 11:11:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3bw0vb",
          "author": "ChestChance6126",
          "text": "What worked for me was treating it like a pipeline, not a tool problem. Batch upload → auto transcribe → auto-name + store → light human review only where confidence drops. The big win is standardizing file naming and metadata upfront so transcripts are usable immediately. Full automation gets you \\~80-90%, and the last 10% is where selective cleanup pays off.",
          "score": 1,
          "created_utc": "2026-02-03 12:21:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3c9lr0",
          "author": "GetNachoNacho",
          "text": "For automating transcription, set up a workflow where you batch your audio files and use a tool like Otter ai or Descript for initial transcription. Then, automate file organization with cloud storage solutions like Google Drive or Dropbox and use Zapier to trigger the transcription process. This saves time while maintaining some manual oversight for accuracy.",
          "score": 1,
          "created_utc": "2026-02-03 13:45:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3hdaq2",
          "author": "alias454",
          "text": "I know you said you weren't interested in a tool but I created a collection of scripts for doing exactly what you want. It's open source so maybe check it out and see if anything is helpful to you. My github is linked in my profile and the tool is named YATSEE",
          "score": 1,
          "created_utc": "2026-02-04 05:36:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3j4x6a",
          "author": "Headlight-Highlight",
          "text": "I'll give you one trick for free - re-record poor recordings and do the transcription on that.\n\nI'd get an AI to do an app using whisper.\n\nYou can test how fast you can repeat an existing recording and still be understood.",
          "score": 1,
          "created_utc": "2026-02-04 14:02:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3pcd2e",
          "author": "AdventurousSale5446",
          "text": "I’ve found that the biggest shift happens when you stop trying to “automate transcription” and instead automate everything around it. At scale, transcription itself is rarely the bottleneck - it’s file prep, naming, batching, and deciding what actually deserves cleanup. Curious if others here discovered that most time savings come from workflow decisions, not better models.",
          "score": 1,
          "created_utc": "2026-02-05 12:08:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3s4mis",
          "author": "SunTraditional6031",
          "text": "Yeah, the manual grind is real. I got buried under interview audio last year and had to figure this out.\n\nMy rough workflow: first, I standardized my file naming with a simple date-speaker-topic format right after recording. Then I'd drop everything into a dedicated \"to-transcribe\" folder. The key was finding something that could just chew through that folder automatically without me babying each file.\n\nI tried a few cloud services with batch upload, but the pricing got weird with volume. What actually stuck for me was using a dedicated device—BOYA Notra—because it handles the recording, dumps the files to an app, and auto-transcribes in batches in the background. It's not perfect, but it gets like 90% there for clear audio, which is way better than starting from zero. The summaries it generates let me triage which files need careful review first.\n\nPost-process, I do a quick find/replace for common jargon and then a single listen-through on 1.5x speed for corrections. Saves me hours per batch.",
          "score": 1,
          "created_utc": "2026-02-05 20:32:10",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qtpcz9",
      "title": "Automate Appointment Booking with AI Voice Agents",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qtpcz9/automate_appointment_booking_with_ai_voice_agents/",
      "author": "According-Site9848",
      "created_utc": "2026-02-02 08:17:15",
      "score": 12,
      "num_comments": 23,
      "upvote_ratio": 1.0,
      "text": "After experimenting with different stacks (ElevenLabs, Retell, Twilio, lightweight JS backends and simple databases like Supabase), I’ve seen firsthand that the real win isn’t just making an AI talk, its building a voice agent that can survive normal human chaos interruptions, corrections, rambling answers, name/email mistakes and wait, not that day while still checking availability, creating bookings, sending confirmations and logging everything cleanly; one local service business that piloted this flow went from manually answering every call to letting an AI handle first contact and scheduling and they saw about a 35–40% increase in booked appointments in the first month without changing their marketing, which matches what a lot of Reddit builders are discovering: the stack matters less than designing a narrow, reliable workflow with strong prompts, validation logic and graceful fallback responses when APIs fail; curious what breaks most often in your current setup speech accuracy, name/email capture, calendar sync or error handling?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qtpcz9/automate_appointment_booking_with_ai_voice_agents/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "o34kmve",
          "author": "Techenthusiast_07",
          "text": "I’ve built an AI voice agent for appointment booking, and I agree the hardest part is not making communication it’s dealing with how people actually speak. Interruptions, changing answers, and small mistakes happen all the time.\ni am using it and it handles the checks for availability, booking appointments, sending cold emails and calling with clients name and it answer with human like voice also it has integration with CRM and it make summary and follow ups from the conversation. so Automate Appointment Booking with the help of AI Voice Agents is good move for any business who needs to grow their business with less manual efforts.",
          "score": 4,
          "created_utc": "2026-02-02 09:05:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o34mf3c",
              "author": "According-Site9848",
              "text": " once you move from demos to real calls, you realize speech quality is the easy part.\n\nWhat you’re describing (interruptions, mid-sentence changes, correcting names, actually can we do next week) is where most voice agents fall apart unless the workflow is designed for it. Availability checks, booking, CRM sync, summaries and follow-ups all work only if the agent can gracefully recover from messy human input instead of forcing people down a rigid script.\n\nThe fact that you’ve tied it into CRM, call summaries and follow-ups is the right direction too   that’s where teams stop babysitting the agent and start trusting it. Voice agents become useful when they behave less like a call bot and more like a calm, patient front-desk assistant.\n\nIf you’re open to it, I’d be curious what you found hardest to stabilize long-term: name/email capture, calendar edge cases or handling corrections mid-flow.",
              "score": 1,
              "created_utc": "2026-02-02 09:23:16",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o34flwe",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-02 08:17:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o34rio8",
          "author": "Parker2010SEO",
          "text": "Our voice AI Agent (Neyox) deliver 99% accuracy - latency, voice, quality responses, categorize leads (hot, cold) etc etc. \n\nThe best part: Only $0.10/Min with your own telephony.",
          "score": 1,
          "created_utc": "2026-02-02 10:12:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o34sfa5",
          "author": "Beneficial-Panda-640",
          "text": "In my experience the “breaks” are usually not speech accuracy, it’s state management and edge cases. People change their mind mid sentence, give partial info, or answer a different question than the one you asked, and the agent has to keep a clean thread of what is confirmed vs assumed. Name and email capture is also deceptively hard because you need a confirmation loop that does not feel robotic, plus a fallback like spelling or SMS verification when confidence is low.\n\nCalendar sync issues tend to be less frequent but more damaging when they happen, especially time zones, double booking, and stale availability. The systems that feel reliable are the ones that treat every external call as “may fail” and have a graceful recovery path that does not lose the user or create phantom bookings. I’m curious how you’re handling the confirm step, is it explicit at the end or incremental confirmations as you go?",
          "score": 1,
          "created_utc": "2026-02-02 10:21:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o34t6wv",
              "author": "According-Site9848",
              "text": "The real fragility is in state management and handling edge cases rather than pure speech accuracy.\nHere’s how I approach it:\n1. Incremental confirmations: Instead of waiting until the end, I confirm critical fields as they come up — e.g., Just to confirm, did you say 3 PM on Thursday? This keeps the thread clean and avoids compounding errors.\n2. Confidence-based fallbacks: For names, emails or dates, if the model isn’t confident, trigger a polite clarification or an SMS/email verification loop. This keeps it human-like but accurate.\n3. Resilient calendar logic: Treat every API call as potentially failing. Implement retries, double-booking checks, time zone normalization and a fallback message if availability can’t be confirmed.\n4. Threaded state tracking: Maintain a clear confirmed vs. assumed map for every interaction. This way, even mid-sentence changes or partial answers don’t break the workflow.\nThe combination of incremental confirmation + confidence checks + robust API handling is what makes the system feel reliable in real-world chaos.\nIf anyone is stuck with this, I’m happy to share a practical pattern for implementing it in a voice-agent workflow.",
              "score": 2,
              "created_utc": "2026-02-02 10:28:16",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3a3es6",
                  "author": "Beneficial-Panda-640",
                  "text": "This lines up with what I see too. The confirmed vs assumed map is the quiet backbone people underestimate, especially once users start correcting themselves or jumping ahead. Incremental confirmation feels less brittle and more human, but only if the agent knows when to pause and when to move on.\n\nOne thing I still see teams struggle with is deciding what actually needs confirmation versus what can stay soft until later. Over-confirming can tank flow just as fast as under-confirming. Curious how you decide which fields are hard gates and which ones can stay tentative until the end.",
                  "score": 1,
                  "created_utc": "2026-02-03 03:26:48",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o34yboo",
          "author": "Bart_At_Tidio",
          "text": "Most breakages come from sloppy validation, especially names, emails, and time confirmation across time zones. If the agent treats those like a form instead of a conversation checkpoint, everything downstream gets cleaner. The tech stack matters far less than how defensive the workflow is when people interrupt themselves or change their mind mid sentence.",
          "score": 1,
          "created_utc": "2026-02-02 11:14:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3526e5",
              "author": "According-Site9848",
              "text": "Defensive workflow design is where the real reliability comes in. I’ve found that incremental confirmations work best: verify names, emails and appointment times as part of the conversation, not just at the end. Combine that with fallbacks like spelling checks, SMS/email verification and timezone-aware scheduling and most downstream errors disappear. If anyone is stuck on making their voice agent resilient to interruptions or mid-sentence changes, I’m happy to guide on a step-by-step validation workflow that keeps bookings clean.",
              "score": 1,
              "created_utc": "2026-02-02 11:47:01",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3brz91",
                  "author": "Bart_At_Tidio",
                  "text": "Incremental confirmation inside the flow makes a big difference, especially when people pause, backtrack, or correct themselves mid sentence. Catching names, emails, and time details as they come up keeps the agent aligned with the user instead of forcing a cleanup step at the end. Once that’s in place, interruptions stop being a failure case and just become part of the conversation.",
                  "score": 1,
                  "created_utc": "2026-02-03 11:50:53",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o35e9bw",
          "author": "GetNachoNacho",
          "text": "Completely agree. The real win isn’t the voice, it’s reliability under messy human behavior. Narrow flows + strong fallbacks make these agents actually work.",
          "score": 1,
          "created_utc": "2026-02-02 13:12:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o35fh2x",
              "author": "According-Site9848",
              "text": "Once you design for messy humans instead of ideal scripts, everything changes.\n\nThe agents that hold up in production are the ones that treat every step as provisional: confirm intent, validate critical fields, assume interruptions will happen and always have a safe fallback (let me double-check that beats guessing). Voice quality just sets the ceiling  workflow defensiveness is what determines whether the system survives real calls.",
              "score": 1,
              "created_utc": "2026-02-02 13:19:59",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o36fb9s",
                  "author": "GetNachoNacho",
                  "text": "Exactly, the workflow beats voice quality. Confirm intent, validate inputs, expect interruptions, and build strong fallbacks. That’s what makes AI booking agents survive real-world calls.",
                  "score": 1,
                  "created_utc": "2026-02-02 16:23:26",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o35tf5h",
          "author": "BotWhisper",
          "text": "This is exactly the problem I've been working on. You're 100% right that speech quality is the easy part - the real challenge is building workflows that can handle how people actually talk.\n\nI've been building something called BotWhisper that tackles a lot of these issues. The key insight (which you've clearly figured out) is that you need to treat every step as provisional until it's confirmed, and build fallbacks at every level.\n\nWould love to hear some of your specific challenges you would like to overcome to get to your ultimate goal.",
          "score": 1,
          "created_utc": "2026-02-02 14:37:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o37k9bd",
          "author": "AutomationPartner",
          "text": "Just got off the phone with a customer service rep that I wished was an AI agent. Looking up information took a long time, voice was unclear and wasn't sure how to use their own systems. \n\nThat being said, in building my own voice agents I've found some difficulties with location specific accents while maintaining call quality as well as getting the agent to spell the name and email correctly every time instead of simply guessing. I've also had some issues based on people giving relative dates (Tomorrow, next week, etc) instead of absolute dates ( Feb 2, 2026). \n\nGetting the voice to sound human has never been the problem.",
          "score": 1,
          "created_utc": "2026-02-02 19:30:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o38djlm",
          "author": "BaselineITC",
          "text": "It's great that you're already finding what works and what doesn't. You're right, a difficult factor of AI implementation is making it work with human unpredictability. The large percentage of increase is impressive and a great sign that this implementation is going to be effective. \n\nBuilding automations that could fullproof any human confusion could help. For example, if the AI doesn't catch a customer's email, there should be an automation where it's flagged for wither an AI or human follow-up.",
          "score": 1,
          "created_utc": "2026-02-02 21:48:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o38k4vd",
          "author": "SpiritualWolverine50",
          "text": "i've been playing with ai voice for some time now and tbh I find deepgram very helpful. If you just now a little bit of Python you can create a custom agent in a day or two",
          "score": 1,
          "created_utc": "2026-02-02 22:20:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3bkj1k",
          "author": "HospitalAdmin_",
          "text": "Automating appointment booking with AI voice agents is a Smart and very practical use of AI. Booking calls take time and many businesses miss appointments just because no one is available to answer the phone. \n\nAI voice agent can handle calls 24/7 ,send basic information and answer basic question without getting tired. \n\nStaff can focus on real work instead of repeating the same calls all day.",
          "score": 1,
          "created_utc": "2026-02-03 10:47:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3blmzr",
              "author": "According-Site9848",
              "text": "That’s the real leverage letting the agent handle repetitive first-touch tasks while humans focus on high-value work. When designed with strong validation, fallback logic and incremental confirmations, it not only frees time but also reduces errors and missed bookings. If anyone wants guidance on setting up a reliable workflow like this, I’m happy to help.",
              "score": 1,
              "created_utc": "2026-02-03 10:57:39",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3bsmbr",
          "author": "Puzzled_Vanilla860",
          "text": "I can help you build a robust AI voice agent that handles appointment booking and overcomes the common challenges you’ve mentioned.  \n Design AI voice agents to handle first contact, interruptions, and errors gracefully during booking.  \n Implement strong validation logic for names, emails, and availability checks while ensuring seamless calendar sync.  \n Create fallback mechanisms for failed API calls and improve error handling to ensure bookings are always processed correctly.  \n Optimize for real-world scenarios, ensuring the system remains reliable even with human chaos or mistakes.",
          "score": 1,
          "created_utc": "2026-02-03 11:55:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3p84qo",
          "author": "Designer_Manner_6924",
          "text": "i'd say email capture, but rarely, mostly its able to do it quite accurately, it used to happen much more often initially because the agent couldn't be interrupted mid dialogue, but ever since we made that an option, it can interrupted and the user can talk more fluently, also we add just a confirmation question too to ensure they get the email right and are confirmed by the user ",
          "score": 1,
          "created_utc": "2026-02-05 11:36:12",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qx70az",
      "title": "read this if you were thinking of automating outbound phone calls with AI voice before you get in trouble",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qx70az/read_this_if_you_were_thinking_of_automating/",
      "author": "SpiritualWolverine50",
      "created_utc": "2026-02-06 03:45:43",
      "score": 11,
      "num_comments": 11,
      "upvote_ratio": 0.82,
      "text": "Everyone is excited about AI voice agents right now.\n\n\n\nIn 2026, you can spin up an AI caller in a weekend. Connect Twilio, plug in a voice model, upload a lead list, and suddenly you’re “automating outbound.”\n\n\n\nIt sounds efficient.\n\n\n\nBut before you do that, there’s something most founders completely ignore: outbound phone calls are heavily regulated.\n\n\n\nNot “lightly suggested.” Regulated.\n\n\n\nIn the U.S., the TCPA (Telephone Consumer Protection Act) restricts automated calls, especially when using prerecorded or artificial voices.\n\n\n\nIf your AI voice calls someone without prior express written consent, you’re exposed.\n\n\n\nAnd “they filled out a form once” is usually not enough.\n\n\n\nHere’s what that actually means:\n\n\n\n* you need clear, documented consent specifically agreeing to receive automated calls\n* you need proof of when and how that consent was given\n* you need to respect Do Not Call lists (both federal and internal)\n* you need proper opt-out mechanisms\n* you need to understand state-level call recording laws\n\n\n\n\n\nEach violation can cost thousands of dollars per call.\n\n\n\nNot per campaign. Per call.\n\n\n\nAnd it’s not just the U.S.\n\n\n\nGDPR in Europe, CASL in Canada, PECR in the UK — they all have strict rules around automated communications and consent.\n\n\n\nThe technology is easy.\n\n\n\nCompliance is not.\n\n\n\nI’m not saying don’t use AI voice.\n\n\n\nI’m saying: if you’re going to automate outbound calls, make sure compliance is part of the architecture — not an afterthought.\n\n\n\nSometimes the smartest automation decision is not automating at all.\n\n\n\nIf you’re in trades business and unsure whether your setup is compliant, I can help you think it through before it becomes an expensive lesson.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qx70az/read_this_if_you_were_thinking_of_automating/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "o3uf898",
          "author": "Different_Pain5781",
          "text": "we tested ai outbound last year for a home services client. paused it after one week. legal flagged tcpa issues we didn’t even know existed. honestly saved us a massive headache.",
          "score": 3,
          "created_utc": "2026-02-06 04:10:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3uhc15",
              "author": "SpiritualWolverine50",
              "text": "exactly. The tech works but the compliance side is usually what surprises people. Good call pausing it early though!\n\nbtw you could still do it to incearse engagement with returning customers if you had proper consents but I bet you were trying to get new leads, weren't you?",
              "score": 1,
              "created_utc": "2026-02-06 04:24:18",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3wv1b1",
          "author": "GeekTX",
          "text": "glad to know that I am not the only one promoting regulatory compliance. ",
          "score": 2,
          "created_utc": "2026-02-06 15:06:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3wviju",
              "author": "SpiritualWolverine50",
              "text": "Haha yeah, hope my post helped some folks avoid pricey mistakes",
              "score": 2,
              "created_utc": "2026-02-06 15:09:05",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3z06c4",
          "author": "SoftConsistent8857",
          "text": "Great point about compliance needing to be in the architecture. I had a team, Qoest, build a voice agent with those exact guardrails approvals and logs baked into the core API so we could scale without worrying about TCPA.",
          "score": 2,
          "created_utc": "2026-02-06 21:18:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ubgz3",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-06 03:45:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3v2wgr",
          "author": "Adlien_",
          "text": "Yeah I was testing vapi which is really cool stuff. But then I happened to meet a former call center owner and they broke down how tricky it is to run campaigns legitimately. So that was the end of that!",
          "score": 1,
          "created_utc": "2026-02-06 07:12:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3wh3cu",
              "author": "SpiritualWolverine50",
              "text": "Glad you stopped before it was too late. Also, don't be scared of trying calls automation. You just have to be very careful and make informed decisions!",
              "score": 1,
              "created_utc": "2026-02-06 13:54:12",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3vbdqn",
          "author": "AykutSek",
          "text": "Compliance is the most critical \"node\" in the workflow.\n\nIf you automate outbound calls without a strict \"Consent Verification\" logic gate, you aren't building a sales machine; you are building a **lawsuit machine**.\n\nAutomation scales everything—including your legal liabilities. Great warning.",
          "score": 1,
          "created_utc": "2026-02-06 08:31:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3whb6x",
              "author": "SpiritualWolverine50",
              "text": "Yeah, easy to cross the line here. Just be careful, that's my advice",
              "score": 1,
              "created_utc": "2026-02-06 13:55:22",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o44bbxl",
          "author": "Boogooooooo",
          "text": "Everyone is spoofing phone numbers and making spam calls. It is default practice ",
          "score": 1,
          "created_utc": "2026-02-07 18:17:58",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qyimo0",
      "title": "Anyone here successfully developed an AI assisted ADHD workflow to deal with \"life\"?",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qyimo0/anyone_here_successfully_developed_an_ai_assisted/",
      "author": "Antic_Hay",
      "created_utc": "2026-02-07 16:45:01",
      "score": 10,
      "num_comments": 9,
      "upvote_ratio": 1.0,
      "text": "Target audience: people with ADHD who are completely all over the place and want to not only get on top of their chores and obligations without a last minute panic, but also actually improve their skills and hobbies.  \n  \nProblem with this whole domain is that the systems offered to people who are disorganised, chaotic, and forgetful are way too complex and bureaucratic, and the systems that are possible are usually too simple. \n\nEven for things like learning a hobby like playing the piano, a reminder on your phone every morning to practice for 20 minutes before work isn't really going to scratch that itch, because you probably aren't going to commit to 2 full hours every day except on the very first day where you had a huge dopamine burst and decided you could do everything ever.\n\nFor me the perfect system would be one where you could just throw junk into it throughout the day by voice or text like \"birthday present\", \"remember tax\". It would then ping you multiple time to day saying \"hey, do you have time to go over your new items\", it would then ask you intelligent questions, and it would know that you have to buy a birthday present for your sister by next Tuesday, and tax needs to be filed that's fine and ages but you do need to talk to your old employer about etc. etc.\n\nThen it would just know about habits you wanted to develop in the morning, or the evening or certain work things, your schedule, and it would just tell you \"oh, you need to do this\". It would have plenty of time in advance and use (effective) strategies (that it could research) on how to make it most likely you will take the first step on your taxes, and for things like hobbies, if you wanted to learn six things, it would probably start you on, e.g. 5 minutes piano on Monday, 5 minutes guitar on Tuesday, 5 minutes learning Welsh on Wednesday etc, and slowly ramp up the time so habit becomes second nature without ever feeling like work. And then when you get to the point where you doing 3 things every morning for 20 minutes, then the other 3 the next day, and it's starting to get too much, you can just drop one like that, or have a conversation about which one to drop.\n\nIt's a little bit of work, but it feels very doable right now...",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qyimo0/anyone_here_successfully_developed_an_ai_assisted/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "o445k1a",
          "author": "unauthorizedhorse",
          "text": "Tried a trillion different things, but to be brutally honest I just have a note in my phone with categories, starting with time sensitive (things I need to keep on the surface) and then three or four other “life areas” that contain anything that pops up. I call it a Pensieve like Dumblodoor uses :)\n\nHits never make the mistake of having one “point of truth” that keeps you tethered while your brain is off exploring oceans.",
          "score": 5,
          "created_utc": "2026-02-07 17:49:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o45eig7",
          "author": "erisian2342",
          "text": "Yesterday I got Claude Desktop working with Home Assistant. Next is to create a new Assist pipeline and replace Assist’s conversation agent with ChatGPT. Then comes integrating tools like a scheduler for routines, my calendar, and Todoist. Then comes wiring up memory. Then comes attempting the type of routines you’re talking about, which I’m certain will reveal gaps to be filled.  \n\nSo no, I haven’t tried it yet, but I will. One small victory at a time.",
          "score": 3,
          "created_utc": "2026-02-07 21:42:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o45yoml",
              "author": "Long-Builder-157",
              "text": "So you’re saying “there’s a chance?” 🤯",
              "score": 2,
              "created_utc": "2026-02-07 23:39:06",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o45s080",
          "author": "alrightryanx",
          "text": "Working on it as an Android + Web app: r/ShadowAIapp just press the mic icon or + to add a session. You can create Custom cards to organize any part of your life, invoices, clients, expenses, games, hairstyles, whatever. The update that should go live tomorrow will fix a lot of bugs so bare with me.",
          "score": 3,
          "created_utc": "2026-02-07 22:57:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o442snn",
          "author": "GuitarAppropriate489",
          "text": "Can you come in dms?",
          "score": 2,
          "created_utc": "2026-02-07 17:35:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o466bvo",
          "author": "ThatNorthernHag",
          "text": "RemindMe! In 3 days",
          "score": 2,
          "created_utc": "2026-02-08 00:25:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o43sivj",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-07 16:45:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o46kwyp",
          "author": "S_Alaska",
          "text": "Working on one for iOS but tbh if my adhd is in full form then the app doesn’t help. Sigh. I am also working on an ai system that is not iOS for those of us that enjoy both sides of the adhd world. \n\nIt is a struggle. I should be working on that with my other projects but I am on reddit at the moment.\n\nPs: I like protons ai and Gemini for developing in an already existing system.",
          "score": 1,
          "created_utc": "2026-02-08 01:55:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o44x44w",
          "author": "GlasnostBusters",
          "text": "adhd is such bullsh*t",
          "score": -10,
          "created_utc": "2026-02-07 20:08:36",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}