{
  "metadata": {
    "last_updated": "2026-02-11 17:29:57",
    "time_filter": "week",
    "subreddit": "automation",
    "total_items": 20,
    "total_comments": 204,
    "file_size_bytes": 179034
  },
  "items": [
    {
      "id": "1qxfl8r",
      "title": "LinkedIn restricted my account 3 times in a year - what finally worked",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qxfl8r/linkedin_restricted_my_account_3_times_in_a_year/",
      "author": "WhispersAndWinksx",
      "created_utc": "2026-02-06 11:53:17",
      "score": 237,
      "num_comments": 25,
      "upvote_ratio": 0.95,
      "text": "Over the past year, LinkedIn restricted my account three separate times.\n\nFirst restriction was obvious - I got greedy and sent 180 invites in 3 days, so deserved it. But the second and third times I thought I was being careful. Stayed under 100/week, used delays, didn't run campaigns at night… still got flagged.\n\nI studied what actually triggers restrictions beyond the stuffs everyone talks about. Here's what I found:\n\nPending invite ratio must be low. I had 420 pending requests, and it’s a lot. If your pending/total sent ratio is over 30%, LinkedIn sees you as low-quality. Now I auto-withdraw anything older than 21 days.\n\nMessages must be diverse.  I was rotating 3 templates thinking that was enough. All had the same structure, greeting + pain point + question. Linkedin is doing some kind of pattern matching. I switched to 7 completely different formats (some start with questions, some with observations, one is literally just 2 sentences).\n\nProfile must look proportional. I had 8 skills and 240 connections, which is a bit strange for someone who was sending 400 invites a month. So I added new skills,  got 5 recommendations, joined 3 more new groups, rewrote my experience, added new posts for 2 weeks, filled in featured section. \n\nPeople consume content. Not only your content is important, but also the content you as a real person consume on Linkedin. I only logged in to send invites. Real users browse, react on posts and comment. I did it manually for a week and then added auto-likes (15-25 daily) and I manually comment 3-4 times per week on target audience posts.\n\nSince then I’ve had no restrictions. My acceptance rate went from 32% to 54% and I'm actually sending fewer invites but getting better conversations. So slowing down and looking more real got me better results than trying to maximize volume.\n\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qxfl8r/linkedin_restricted_my_account_3_times_in_a_year/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "o3w0cj4",
          "author": "WarmlyInvited",
          "text": "Everyone hates receiving these obviously templated messages. Just because you have 7 different formats doesn't make it less annoying. Real relationship building takes time\n\n",
          "score": 17,
          "created_utc": "2026-02-06 12:12:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3w3yh4",
              "author": "Spartan2022",
              "text": "Very much this. Spam is spam is spam regardless of the template you use.\n\nI’ve stopped accepting any connections or unsolicited invites. 99.99999% spam. Who needs that?",
              "score": 8,
              "created_utc": "2026-02-06 12:37:16",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3vyouz",
          "author": "ThighHighlander",
          "text": "54% acceptance rate means nothing if those connections never convert. I bet half of them accept and then immediately ignore your pitch. Vanity metrics",
          "score": 5,
          "created_utc": "2026-02-06 12:00:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3xkee0",
          "author": "OptionDegenerate17",
          "text": "Pretty sure this is a violation of TOS. Tread carefully.",
          "score": 2,
          "created_utc": "2026-02-06 17:07:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ym44j",
          "author": "bv915",
          "text": "Ugh.  No one wants this.",
          "score": 2,
          "created_utc": "2026-02-06 20:08:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3vxrrv",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-06 11:53:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3w0qa7",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-06 12:14:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3w0wmh",
              "author": "WhispersAndWinksx",
              "text": "I try to be strategic about it, and find ways to use automation and not being restricted",
              "score": -1,
              "created_utc": "2026-02-06 12:16:11",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3w2euk",
                  "author": "[deleted]",
                  "text": "[removed]",
                  "score": 2,
                  "created_utc": "2026-02-06 12:26:48",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3w1gov",
          "author": "FlirtyButFocused",
          "text": "Why not just hire a VA in the Philippines for $5/hr to do this manually?\n\n",
          "score": 1,
          "created_utc": "2026-02-06 12:20:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3w3gr5",
              "author": "WhispersAndWinksx",
              "text": "I tried that, but i trained a person for 2 weeks, sent them scripts and targeting criteria, but he was very inconsistent, always forget follow-ups and reminders.\n\n",
              "score": 0,
              "created_utc": "2026-02-06 12:34:00",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3w46oi",
                  "author": "Oopsfoxy",
                  "text": "Plus VA is clicking from Philippines IP while your account is in US/Europe. That's also a flag\n\n",
                  "score": 1,
                  "created_utc": "2026-02-06 12:38:47",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3w1qd7",
          "author": "Used-Location1273",
          "text": "I actually auto withdraw pending invites more than 2 days old to protect my account now. As for finding out what works at scale on LinkedIn for outreach? I've not found it yet. \n\nLemlist videos talk a lot about sending voice notes or loom videos where you find things on the prospect's website that are hurting them, and overview some of the fixes to build trust. \n\nHow on earth you scale that though? No idea.",
          "score": 1,
          "created_utc": "2026-02-06 12:22:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o401gkp",
          "author": "SystemicCharles",
          "text": "Umm, how do you auto-withdraw sent connections?\n\nI can't seem to get past their DOM. I have to withdraw manually",
          "score": 1,
          "created_utc": "2026-02-07 00:40:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o40vueu",
          "author": "SMBowner_",
          "text": "This is a great reality check. We often get so caught up in the automation part that we forget the social part of social media. The tip about the pending invite ratio is a game changer. It is a metric most people completely overlook. Thanks for sharing the data points.",
          "score": 1,
          "created_utc": "2026-02-07 03:50:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o41y0xt",
          "author": "calimovetips",
          "text": "a lot of this lines up with quality signals rather than clever tactics. high pending invites and one dimensional messaging are easy ways to look spammy even at low volume. focusing on acceptance rate and a complete profile usually does more than chasing weekly caps. the only part i’d be careful with is anything automated, that’s where people tend to get burned again.",
          "score": 1,
          "created_utc": "2026-02-07 09:13:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o43372g",
          "author": "Visible_Read208",
          "text": "You need to become active on linkedin, not by messaging people or connecting with them, just start reccording your workflow and show to people what it does. They dont care how you built it, they just want to see resoults\n\n",
          "score": 1,
          "created_utc": "2026-02-07 14:36:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ldgx3",
          "author": "redditor_420_69_lol",
          "text": "I’m so glad I deleted my LinkedIn ",
          "score": 1,
          "created_utc": "2026-02-10 10:40:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4q0gvw",
          "author": "AdBetter366",
          "text": "This happened to me this week. I have almost 6000 people. They said I did something, but I did not. It says I am restricted, I uploaded proof it is me and contacted them but they said still restricted. I would be interested in joining a lawsuit if someone starts it. I use it for my job and learning things too. ",
          "score": 1,
          "created_utc": "2026-02-11 01:23:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3wzdnm",
          "author": "NeedingTime79",
          "text": "yeah linkedin is brutal with the detection... i just tell my automation app to handle my linkedin outreach and it spaces everything out naturally (no more manual testing of delays and patterns). curious if you're still manually tracking response quality or if you automated that part too?",
          "score": -1,
          "created_utc": "2026-02-06 15:28:03",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r0dh6i",
      "title": "What tools are people using to track Reddit mentions?",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1r0dh6i/what_tools_are_people_using_to_track_reddit/",
      "author": "Firm_Phase392",
      "created_utc": "2026-02-09 19:14:46",
      "score": 38,
      "num_comments": 22,
      "upvote_ratio": 0.83,
      "text": "Every time this topic comes up, there’s a long list of tools, but I’m more interested in what people actually stick with long-term. If you’re tracking Reddit mentions for a product, brand, or niche, what’s your setup right now?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1r0dh6i/what_tools_are_people_using_to_track_reddit/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "o4ljap4",
          "author": "Scary_Wasabi4054",
          "text": "I’ve settled on Syften after bouncing around a bit, mostly because it fits how I actually want to use Reddit rather than turning it into another inbox. Setup was pretty simple. I started with a handful of keywords around the product name plus a few problem phrases people tend to use when they are shopping or frustrated. The biggest win was whitelisting subreddits early. Once I limited it to the communities where my users actually hang out, the signal to noise ratio got way better.\n\n  \nI don’t really live in the dashboard. I send alerts to Slack and just skim them as they come in. If something looks like a genuine question or discussion, I’ll jump in. If it’s not relevant, I ignore it. Over time you get a feel for which keywords are worth keeping and which ones just create noise.",
          "score": 9,
          "created_utc": "2026-02-10 11:31:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4m3cqi",
              "author": "Firm_Phase392",
              "text": "Appreciate the comment, thank you",
              "score": 1,
              "created_utc": "2026-02-10 13:45:30",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4kxv9r",
          "author": "WallerBangGod",
          "text": "F5Bot or Reddit Pro if you just need Reddit. Forumscout if you want any other platform",
          "score": 2,
          "created_utc": "2026-02-10 08:09:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ntu1r",
          "author": "Alpertayfur",
          "text": "Most people who do this long-term keep it pretty simple. Common setups I see that actually stick:\n\n* Google Alerts + manual subreddit checks for low effort / early stage\n* Reddit native search saved queries (surprisingly decent if you check daily)\n* F5Bot for basic keyword alerts (cheap, focused, no bloat)\n* GummySearch for founder/PM style research and trend tracking\n* Brand24 or Mention if it’s tied to PR/marketing and budget isn’t tight\n* Custom scripts using Reddit API + Slack/Email alerts for power users\n\nA lot of folks start with heavy tools, then downshift to one lightweight alert + occasional manual browsing. The key isn’t the tool, it’s having alerts that are specific enough to avoid noise so you don’t ignore them after a week.",
          "score": 2,
          "created_utc": "2026-02-10 18:46:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4heem5",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-09 19:14:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4l198y",
          "author": "Vaibhav_codes",
          "text": "Most people stick with F5Bot for free alerts, or Notifier / ReplierAI for cleaner signal. Power users roll their own with Reddit search + Zapier.",
          "score": 1,
          "created_utc": "2026-02-10 08:43:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4lk4mk",
          "author": "Aggravating-Key6628",
          "text": "Honestly most of the dedicated tools are overkill unless you are tracking at scale. What I stuck with longest: a simple n8n workflow that hits the Reddit JSON API every 30 minutes, filters by keywords, and dumps matches into a Slack channel. Zero cost, takes maybe an hour to set up, and you can tweak the keyword list without logging into another dashboard. The paid tools are fine for agencies managing 20+ brands but for a single product or niche, the API + a basic automation platform is hard to beat.",
          "score": 1,
          "created_utc": "2026-02-10 11:38:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ltpmr",
          "author": "gawiz93",
          "text": "Depends on the # of keywords you want to track and number of mentions you are excepting. F5bot is a good starting point but limits the number of mentions you receive. Then there are tools like Vobbit (founded by me) which I built for serving my own clients. it has a free tier as well. It has additional features like tracking Google indexed threads, power users in a subreddit, peak post times for a subreddit. ",
          "score": 1,
          "created_utc": "2026-02-10 12:47:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4p6p2p",
          "author": "AdvanceFamous8522",
          "text": "We use a Reddit OS that tracks, listens and helps you engage.",
          "score": 1,
          "created_utc": "2026-02-10 22:35:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4hkk6b",
          "author": "False-Fortune-1724",
          "text": "homade tools keeps it simple and works well for my needs",
          "score": 1,
          "created_utc": "2026-02-09 19:44:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4lyrat",
              "author": "Rfksemperfi",
              "text": "What did you build?",
              "score": 1,
              "created_utc": "2026-02-10 13:19:26",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4hjhgw",
          "author": "Ok_Revenue9041",
          "text": "I usually start with keyword alerts from Reddit itself and supplement with third party social listening tools for broader coverage. If you want deeper insights and to appear more often when people ask niche questions on AI bots, MentionDesk has been super useful for optimizing how brands show up in AI search engines. It goes way beyond just tracking mentions and actually helps boost your visibility.",
          "score": 0,
          "created_utc": "2026-02-09 19:39:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4m3ja1",
              "author": "Firm_Phase392",
              "text": "yeah I wanna do something similar with reddit mentions",
              "score": 1,
              "created_utc": "2026-02-10 13:46:30",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4hjpq2",
          "author": "256BitChris",
          "text": "f5bot is free.",
          "score": 0,
          "created_utc": "2026-02-09 19:40:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ja3rs",
              "author": "SignificantCareer732",
              "text": "I use Leadmatically because it goes a step further by not just finding those mentions, but also generating helpful, contextual replies to actually engage in the conversations and turn them into qualified leads, plus it provides tracking to see what's working.",
              "score": 0,
              "created_utc": "2026-02-10 01:06:57",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4lu4x0",
                  "author": "gawiz93",
                  "text": "Never go for this AI slop. Finding threads is fine but after that be genuine and \"human\"",
                  "score": 1,
                  "created_utc": "2026-02-10 12:50:33",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4ko21f",
          "author": "Mayanka_R25",
          "text": "For long-term Reddit mention tracking, most folks I know stick with a mix of Brandwatch/Crimson Hexagon for deep analytics and Awario or Mention for simpler alerts. A few people create basic tracking systems through Pushshift API and Zapier which transmit data to Slack or Sheets. The decision about system requirements depends on your need for enterprise insights versus your desire for real-time alerts.",
          "score": 0,
          "created_utc": "2026-02-10 06:39:43",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qwpzmb",
      "title": "I finally found the workflow to replicate ANY image style using Nano Banana Pro! And I’m literally selling it as an IG portrait service",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qwpzmb/i_finally_found_the_workflow_to_replicate_any/",
      "author": "Sniper_yoha",
      "created_utc": "2026-02-05 16:31:39",
      "score": 32,
      "num_comments": 8,
      "upvote_ratio": 0.79,
      "text": "I’ve been experimenting with image consistency lately, and I’ve cracked a 3-step method that works every time. Here is exactly how I generated the 3x3 grid above:\n\n1. **Upload your reference image** to Gemini 3 Pro\n2. **Use this specific \"Extraction\" Prompt:** `\"Help me extract the entire visual effect of this image as a Prompt in JSON format. Include but do not limit to: color palette, lighting, composition, stylistic effects, camera lens, and character details.\"`\n3. **Generate through Nano Banana Pro:** I take the JSON output and feed it into Nano Banana Pro via Atlas Cloud. I’m using Atlas because it’s easy to iterate in the Playground and via the API (I wired it into an n8n workflow).\n\n**And here is the exact prompt I used:**\n\n*Prompt: A professional 3x3 grid layout of 9 high-quality portrait photos featuring a consistent character of a stunning young East Asian woman with long wavy dark hair and small silver earrings, wearing a black strapless tube top. Each grid cell shows a distinct and highly differentiated facial expression to ensure no repetition.*\n\n*The 9 expressions are:*\n\n1. *Top Row: \\[Gentle wink with a subtle smile\\] | \\[Wide teeth-showing joyful grin\\] | \\[Angry scowl with furrowed brows\\].*\n2. *Middle Row: \\[Playful wink with a cheeky tongue-out\\] | \\[Bursted loud laughter with closed eyes\\] | \\[Disgusted face with a wrinkled nose\\].*\n3. *Bottom Row: \\[Naughty side-view with tongue sticking out\\] | \\[Ecstatic head-tilted laughter\\] | \\[Depressed downward gaze with a sad pout\\].*\n\n*Technical Settings: Clean solid light grey background, soft studio high-key lighting, ultra-realistic skin texture with visible pores, 8k resolution, cinematic photography, shot on 85mm lens, f/1.8, hyper-detailed, masterpiece, photorealistic.”*\n\nhttps://preview.redd.it/0mb5gotrdphg1.jpg?width=747&format=pjpg&auto=webp&s=da1c25184d716e9bee8c811c44df1e6675b427c4\n\n**A couple practical notes:**\n\n* If the first result isn't exactly what you’re looking for, just run it for a few more rounds.\n* The biggest win for me is having the “style/character DNA” captured in JSON so I’m not rewriting the same description every time.\n\nI turned this into an n8n workflow and used it for a small portrait “style match” service to a few people on IG. They give me a reference image, I generate a batch in the same style, pick the best set, deliver.\n\nHonestly, in this era, making money with AI feels *way too easy* if you can package a repeatable workflow:)",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qwpzmb/i_finally_found_the_workflow_to_replicate_any/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "o3qwido",
          "author": "No_Yogurtcloset_8029",
          "text": "How exactly are you selling this? Offering headshots as an AI service?",
          "score": 6,
          "created_utc": "2026-02-05 17:07:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3r83po",
          "author": "Captain_BigNips",
          "text": "How are you selling this? I guess I've been in the online AI echo chamber for longer than I thought....\n\nThis seems so incredibly simple to do, why would anybody pay for this? If you didn't know how to do this on your own, you can ask the AI to help you figure it out. Are people really that bad with AI that they're willing to pay for this? 🫨",
          "score": 3,
          "created_utc": "2026-02-05 18:01:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3u35d1",
              "author": "Sniper_yoha",
              "text": "You could give it a try. The unit price isn’t particularly high. I can process 100 images in one bulk run. \n\nIf they’re not willing to pay for this service, they’ll have to either subscribe to tools like Higgsfield or create a Gemini account, which would be far more troublesome.",
              "score": 1,
              "created_utc": "2026-02-06 02:54:20",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3wrmo2",
                  "author": "Every_Welcome_1498",
                  "text": "What does your flow look like for saving images? All my batch image gen processes fall apart at file organization.",
                  "score": 1,
                  "created_utc": "2026-02-06 14:49:26",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3qq0ox",
          "author": "Worldly_Row1988",
          "text": "Great job and thanks for sharing.",
          "score": 2,
          "created_utc": "2026-02-05 16:37:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3qov68",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-05 16:31:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3r67nx",
          "author": "Coolprince07",
          "text": "I edited an image of myself but it looks thicker i.e AI. Can u suggest some prompts to look like it's been taken by a camera.",
          "score": 1,
          "created_utc": "2026-02-05 17:52:26",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r1vxy3",
      "title": "Built 15 AI agent workflows in a weekend as a complete non-coder. Here's how",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1r1vxy3/built_15_ai_agent_workflows_in_a_weekend_as_a/",
      "author": "Safe-Pepper-4931",
      "created_utc": "2026-02-11 12:22:34",
      "score": 32,
      "num_comments": 11,
      "upvote_ratio": 0.82,
      "text": "Background: non-coder, marketing professional. Last weekend, I built some automations. I have 15 working now:\n\nLinkedIn auto-poster, Reddit alert system, email responder, content reposter, meeting summarizer, competitor tracker, lead scorer, social scheduler, invoice reminders, research assistant, image pipeline, Slack digest, CRM updater, podcast notes, weekly reports.\n\n**How it worked:**\n\nI talked about what I wanted to do in English. I experimented with a few tools - some required Docker (gave up), some hit free limits quickly. Found one that had AI models built-in and just worked.\n\n**Surprised by:**\n\nEasy to chain multiple AI models together\n\nEnglish builder actually works\n\nFree tiers are more powerful than I thought\n\n**Still difficult**:\n\nChoosing the right AI model (GPT vs Claude vs Gemini)\n\nCrafting good prompts\n\nOAuth config\n\n12/15 are in production. I can answer questions.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1r1vxy3/built_15_ai_agent_workflows_in_a_weekend_as_a/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "o4sd5j9",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-11 12:22:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4se83u",
          "author": "AeStyx01",
          "text": "Which AI models did you use?",
          "score": 1,
          "created_utc": "2026-02-11 12:30:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4sh5oh",
              "author": "Safe-Pepper-4931",
              "text": "GPT-4 for structured outputs, Claude for human-sounding text, Gemini for research/summaries.",
              "score": 1,
              "created_utc": "2026-02-11 12:49:41",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4snft5",
                  "author": "saifmaksud",
                  "text": "Got-4 isn't too costly?",
                  "score": 1,
                  "created_utc": "2026-02-11 13:28:07",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4sf7dn",
          "author": "MuslimKhan3040",
          "text": "How long did each workflow take?",
          "score": 1,
          "created_utc": "2026-02-11 12:36:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4shl8t",
              "author": "Safe-Pepper-4931",
              "text": "Ranged from 20 mins (simple ones) to 2 hours (the CRM updater was a pain). Average maybe 45 mins each.",
              "score": 1,
              "created_utc": "2026-02-11 12:52:27",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4sg0nj",
          "author": "Top-Statement-9423",
          "text": "What tool did you use?",
          "score": 1,
          "created_utc": "2026-02-11 12:42:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4si1sb",
              "author": "Safe-Pepper-4931",
              "text": "Ended up with NoClick after trying others - had AI models pre-integrated which saved setup time.",
              "score": 1,
              "created_utc": "2026-02-11 12:55:22",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qwj6yh",
      "title": "Need advice on automating marketing reports that require SQL",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qwj6yh/need_advice_on_automating_marketing_reports_that/",
      "author": "arrogant_definition",
      "created_utc": "2026-02-05 11:48:12",
      "score": 27,
      "num_comments": 18,
      "upvote_ratio": 1.0,
      "text": "I am part of a team building numerous SaaS products, taking care of all things marketing. For things like content, Meta, influencers, things are pretty easy as there are platforms that aggregate all the data and make it easy to view.\n\nWhen it comes to the impact of marketing campaigns on product adoption, however, I find myself struggling. Most data related to adoption metrics, subscription changes, user behaviour, etc. are all data that needs to be exported from the database (Postgres) using SQL.\n\nThe current method to get this data involves asking devs to write SQL, or using LLMs to create SQL (nearly always wrong). I try to learn some SQL as well, but find it hard to find time as I am a family man since recently.\n\nI have noticed that some people use ai tools to bypass the need for SQL and interact with data directly. I don't mean the traditional BI tools like PowerBI and Tableau, but less popular tools like TalkBI. The team thinks it is a risk to connect our database to such tools and so far not much is happening. I am running out of options here. Can you please help me figure out any alternative solutions?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qwj6yh/need_advice_on_automating_marketing_reports_that/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "o3pb4q4",
          "author": "Much_Pomegranate6272",
          "text": "Connect your Postgres to a read-only replica specifically for reporting. Then use whatever BI tool you want without risking production data.\n\nTools like Metabase (open source) or Retool let non-technical people query databases without writing SQL. Way safer than random AI tools with direct DB access.\n\nLLMs generating SQL is hit or miss - they work for simple queries but fail on complex joins and edge cases. Not reliable for automated reporting.\n\nBetter setup:\n- Read-only DB replica for analytics\n- Metabase or similar for self-service queries\n- Schedule automated reports instead of manual exports\n\nYour team's concern about connecting external tools to production DB is valid. Replica solves that.\n\nWhat specific metrics are you trying to pull regularly? That determines if you actually need custom SQL or if a BI tool handles it.",
          "score": 4,
          "created_utc": "2026-02-05 11:59:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3pagl7",
          "author": "dimitsapis",
          "text": "Having worked in marketing in Europe I can tell you that connecting new tools to a database is a safety hazzard even if it seems safe in the first place. The founder has good thinking if this is about enterprise-level saas products. If you are more of a startup and the team can make quick decisions then I would recommend looking at the team behind the tool and getting to know them personally. If the tool is indeed unpopular they will be happy to support you. Perhaps that can put the founder at ease. But to answer your question, I know there is a few more NLQ tools out there (I believe they are called like that - natural language queries) but analysts tend to dislike them because they are afraid they'll lose their jobs, lol! If you have a product manager he should also have this data more available for you.",
          "score": 2,
          "created_utc": "2026-02-05 11:54:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3pbaeu",
              "author": "gallade17",
              "text": "Europeans have the GDPR virus because they have no other problems to think about!",
              "score": 1,
              "created_utc": "2026-02-05 12:00:46",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3tzc1b",
          "author": "Specific-Act-6622",
          "text": "What worked well for our team was building a middle layer using n8n (open source, self-hosted) that connects to a read-only Postgres replica. The workflow runs on a schedule, executes the same trusted SQL queries every time, and dumps the results into Google Sheets or Airtable for the marketing team.\n\nThe key insight is that most marketing questions are variants of the same 5-10 queries. Once you identify those, you can version control the SQL, have devs sign off once, and then marketing just looks at auto-updated spreadsheets.\n\nFor ad-hoc questions, we use a combo approach: marketing describes what they want in plain english, an LLM generates a candidate query, but it runs against a staging copy first and gets human review before touching real data. The LLM is surprisingly good at modifying existing working queries but terrible at writing complex ones from scratch.\n\nThe security concern is valid - never give an external tool direct prod access. Read-only replica plus workflow automation is the safe path.",
          "score": 2,
          "created_utc": "2026-02-06 02:32:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o47ci47",
          "author": "Top-Cauliflower-1808",
          "text": "I’ve been in your shoes and it's much better to find a fix that satisfies your security team than to stay frustrated with manual SQL. You can use Windsor to stream your Meta and influencer data into BigQuery or Postgres, then use dbt to join it with your adoption metrics for a clean view in Looker Studio.  \n  \nBtw, you can use their MCP server to query these joined datasets directly in Claude using natural language, bypassing SQL entirely while keeping the data secure.",
          "score": 2,
          "created_utc": "2026-02-08 04:58:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3p9mul",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-05 11:48:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3paxsd",
              "author": "angelicallergy37",
              "text": "Not sure this post belongs in this sub, but having a tool that can help you chat with your database like you would do with an LLM sounds pretty cool. \n\nThat + it should not be a marketing task to report on product adoption metrics, there are PMs for that.",
              "score": 1,
              "created_utc": "2026-02-05 11:58:09",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3pd0ep",
          "author": "No_Soy_Colosio",
          "text": "Learning SQL and asking devs to create views is easier than using LLMs (flaky, and vector for cyber attacks if you're not knowledgeable). Do not use LLMs for tasks that require structure and can better be taken on with a programming language/DSL (SQL in this case)",
          "score": 1,
          "created_utc": "2026-02-05 12:13:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3pjxf9",
          "author": "Equal-Direction-8116",
          "text": "What’s breaking isn’t SQL itself. it’s that insight lives behind a dependency chain. When marketing questions require dev time or fragile LLM queries, analysis becomes sporadic and slow, so decisions lag behind reality. BI tools don’t fix that if they still assume someone else owns the data layer. A practical alternative is to define a small set of **blessed, read-only metrics views** in the database that devs own once, and marketing can query safely forever. If that foundation exists, you can layer lightweight tools or even simple scheduled exports on top without introducing risk. The leverage usually comes from narrowing what needs to be queried, not from replacing SQL entirely.",
          "score": 1,
          "created_utc": "2026-02-05 13:00:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3po81w",
          "author": "calimovetips",
          "text": "Stop querying prod directly. put a read only replica or small warehouse in front of postgres, build a handful of curated views for core adoption metrics, and let marketing query those safely. that removes most sql churn and the security concern at the same time. does this need near real time data, or is daily freshness fine?",
          "score": 1,
          "created_utc": "2026-02-05 13:26:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3pvpfp",
          "author": "ChestChance6126",
          "text": "This usually isn’t a SQL problem, it’s a data access design problem. what’s worked for me is setting up read-only analytics views for core metrics (activation, upgrades, churn, attribution, etc.). Once those exist, marketing can answer most questions with filters instead of asking devs for new queries. LLMs also perform much better editing trusted queries vs generating them from scratch.",
          "score": 1,
          "created_utc": "2026-02-05 14:08:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3pzda3",
          "author": "long_limbs",
          "text": "The real issue IMO is less about SQL and more about why marketing data lives in a dev-owned system with no self-service layer. Your team's security concerns are valid but the answer isn't finding the right tool - it's getting devs to build a handful of views that expose the metrics you actually need. Once those views exist, even a spreadsheet export on a schedule might be enough.\n\nI'd push back on the idea that you need to \"learn SQL\" as a marketer. That's treating symptoms. The underlying problem is that adoption metrics should already be surfaced somewhere accessible to you - whether that's your product analytics tool, a simple dashboard, or scheduled reports.",
          "score": 1,
          "created_utc": "2026-02-05 14:28:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3qiow2",
          "author": "Living-Bandicoot9293",
          "text": "Beware of security and compliance, you should try with some fine tuned llm locally hosted for eg Qwen 30b -code -instruct, keep your data away from open exposure.",
          "score": 1,
          "created_utc": "2026-02-05 16:03:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3tpkkg",
          "author": "forklingo",
          "text": "this is a pretty common gap between marketing and product data, so you are not alone. one option that tends to work better than pure ai sql is to invest a bit upfront in a small set of vetted, reusable queries or views that cover the core questions you care about. once those exist, you are mostly selecting and filtering instead of writing raw sql each time. another approach is to push for a read only replica or a curated analytics schema so the risk concerns are lower and access can be broader. fully natural language tools still struggle with nuance, especially around joins and edge cases, so they work best on top of a well modeled layer rather than directly on prod tables. if you can frame this as saving dev time long term instead of bypassing them, it usually gets more buy in.",
          "score": 1,
          "created_utc": "2026-02-06 01:33:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3vmzny",
          "author": "messinprogress_",
          "text": "Sounds like you need a way to get product data accessible without constantly bugging devs or fighting with SQL. I came across Scaylor when looking into this stuff recently. From what I've read, it's built specifically for connecting databases like Postgres into a queryable warehouse with pre-built models, so marketing teams can actually run their own adoption reports and campaign analysis without needing to write SQL every time.\n\nThe whole point is it handles the data modeling automatically so you skip the technical bottleneck and can just pull teh metrics you need for reporting. Might be worth checking out given your situation with the team being hesitant about newer AI tools. It's more of a proper data infrastructure solution rather than just an AI chat interface.",
          "score": 1,
          "created_utc": "2026-02-06 10:22:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3vydtc",
              "author": "arrogant_definition",
              "text": "Similar to TalkBI as I see it but I need the customizable element that the later offers.",
              "score": 1,
              "created_utc": "2026-02-06 11:57:51",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3pcfkd",
          "author": "kevivmatrix",
          "text": "You can use tools like Draxlr to generate SQL Queries, you can feed context to the AI and it will generate accurate SQL after that.",
          "score": 0,
          "created_utc": "2026-02-05 12:09:22",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qzykuy",
      "title": "What are some better alternatives to N8N/Zapier for specific tasks that does the job better?",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qzykuy/what_are_some_better_alternatives_to_n8nzapier/",
      "author": "Vivid-Aide158",
      "created_utc": "2026-02-09 08:10:48",
      "score": 25,
      "num_comments": 19,
      "upvote_ratio": 1.0,
      "text": "Hi all- I do like N8N and Zapier but I have found the that they kinda spread too thin since it is meant to be general purpose automation! This means it often needs quite a bit of setup and maintenance!\n\nAs someone who is running an early stage startup, I am curious, what are some better alternatives to N8N/Zapier for specific tasks that does the job better?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qzykuy/what_are_some_better_alternatives_to_n8nzapier/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "o4egame",
          "author": "Ava_Yuna",
          "text": "Oh hell yeah, this is exactly something I can relate to! Specially the maintaining part is something that adds up over time and takes your time! We have since then moved to a bunch of dedicated tools inside our company for various tasks we used to have N8N do! Here are the ones that ended up working better\n\n* Outbound marketing: We earlier had an N8N automation but now we have taught Clay our ideal customer personal using previous conversions. Now it can automatically reach out on both email and LinkedIn to schedule our first sales calls for our sales team. Saves a lot of time for everyone. Conversion rate for the automation is same as manual outreach at this point\n* Meeting notes and action items: Again we tried setting up an automaton using N8N but since then moved to use specific tools like Otter to transcribes everything. It can also create action items, assign owners, update CRM, salesforce etc! You can even connect it to gamma to create after call presentations automatically\n* Blogs: We had an automation using N8N for both and writing blogs and content for our website to improve our Google ranking! Since then we have been able to using AI tools like Frizerly to train AI on our business, product and search data to automatically create blogs on our website daily based on this! Results are much better since it's able to self improve based on google results now!\n\nThat's all I can think of rn! Curious what other tools others are using :)",
          "score": 8,
          "created_utc": "2026-02-09 08:13:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4fbhhs",
              "author": "PollutionTimely6602",
              "text": "Nice breakdown. We went through a very similar phase of breaking things into dedicated tools once n8n started feeling heavy to maintain.\n\nClay in particular is hard not to like once it clicks. I had the same question around replacing parts of that setup when I started testing Tiny Command recently, mostly out of curiosity after seeing a demo. I was surprised that some of the enrichment and logic we were handling separately ended up living inside the same workflow layer there.\n\nI still keep note-takers separate too. Fireflies has been “set it and forget it” for me and I haven’t felt the need to mess with that. But for outbound and content-related flows, having fewer tools to glue together has been nice so far.",
              "score": 1,
              "created_utc": "2026-02-09 12:53:17",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4ei9k2",
          "author": "SystemDisastrous5975",
          "text": "I am using make",
          "score": 1,
          "created_utc": "2026-02-09 08:33:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4euvsc",
          "author": "ForeignGreen3488",
          "text": "Great question! As someone building in this space, I've seen the same challenge. The key insight is that early stage startups often over-automate.\n\nFor customer service automation, look at dedicated AI chatbot platforms that handle natural language out of the box - they're much more reliable than chaining together multiple APIs.\n\nFor social media, specialized scheduling tools with AI content generation are beating general-purpose automation because they understand platform-specific requirements.\n\nThe real opportunity I'm seeing is AI-powered vertical solutions. Instead of connecting 5 different APIs, you get one platform that understands your specific workflow (e-commerce, consulting, etc.).\n\nMy advice: Start with the 2-3 workflows that actually save you 10+ hours per week. Use the simplest tool that works for those specific cases. You can always upgrade later, but you can't get back the time lost over-engineering automation.\n\nThe maintenance overhead of managing multiple specialized tools often exceeds the benefits unless you're at scale.",
          "score": 1,
          "created_utc": "2026-02-09 10:38:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4eynzb",
          "author": "overzealousone",
          "text": "Is this actually mission critical? We’re a Tray.ai partner and we partnered with them because they actually have a stable and very stable platform. It isn’t cheap but it is reliable and relatively easy to use.",
          "score": 1,
          "created_utc": "2026-02-09 11:13:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4f68ll",
          "author": "PollutionTimely6602",
          "text": "Early-stage founder here. I hit this exact wall with Zapier and n8n. They’re powerful, but once you’re moving fast, the setup and maintenance start stealing time you don’t really have. I was already paying for Zapier, Make,Jotforms, Airtable, a couple of AI tools, and still duct-taping everything together.\n\nI stumbled onto TinyCommand a few months ago through an LTD webinar on RocketHub. What clicked for me wasn’t that it was “better” in some abstract way, but that everything lived in one place and how easy workflows actually are supposed to be (atleast that's how the founder made it seem).   \nSo i got forms, workflows, data, enrichment, AI steps in one platform, single subscription.\n\nI’ve been using it for 3(?) months now and it’s been solid. Recently they also started something called Founders Pass where they actually co-build workflows with you, which would’ve saved me a lot of time early on.\n\nNot saying it’s the answer for everyone, but as a startup founder, reducing setup and maintenance mattered more to me than maximum flexibility. And their team helps with building my flows for me also if i ask nicely. ",
          "score": 1,
          "created_utc": "2026-02-09 12:15:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4f6xl2",
          "author": "IdealAccomplished260",
          "text": "That’s a common pain once workflows move beyond simple automations.\n\nTinyCommand is a good alternative when n8n or Zapier start feeling like too much wiring for what is essentially a business process. Instead of general-purpose nodes and scripts, TinyCommand combines forms, workflows, a data layer, and task-specific AI agents so you can model lead management, marketing ops, or internal handoffs end to end.  \n  \nIf your automation looks like a process with stages, ownership, waiting, approvals, and exceptions, TinyCommand reduces complexity because logic, data, and AI live together. n8n and Zapier are still excellent for quick integrations or edge cases, but they are not designed to act as the system of record for how work progresses.",
          "score": 1,
          "created_utc": "2026-02-09 12:20:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4homja",
          "author": "integrationwise",
          "text": "If you have devs who can write code, check out Temporal. It's a workflow engine used by Netflix, Uber, Stripe. Solid for durable execution, retries, and long-running workflows. Steeper learning curve than n8n/Zapier, but way more reliable and flexible for specific tasks. You write workflows in TypeScript, Go, or Python instead of dragging boxes.",
          "score": 1,
          "created_utc": "2026-02-09 20:05:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4hqzg0",
          "author": "interpretpunit",
          "text": "Pabbly lifetime plans are pretty good if you rely heavily on these kinds of tools for your business. Far more user friendly than n8n but can be equally complex and mature in the potential outcomes.",
          "score": 1,
          "created_utc": "2026-02-09 20:17:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4lk6ua",
          "author": "Aggravating-Key6628",
          "text": "Depends entirely on which tasks are eating your time. For email sequences and drip campaigns, something purpose-built like Loops or Resend will run circles around a general-purpose tool. For data syncing between CRM and spreadsheets, Pipedream is solid because you write actual code when the visual builder hits a wall. For internal ops stuff (invoice reminders, Slack notifications on form submissions), Zapier honestly still wins on setup speed even if the per-task cost is higher. The real trap is trying to consolidate everything into one platform - you end up spending more time maintaining the automation than doing the work manually.",
          "score": 1,
          "created_utc": "2026-02-10 11:38:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4m1hge",
          "author": "DomIntelligent",
          "text": "OttoKit has been the best alternative u could ever find to zapier, make and n8n",
          "score": 1,
          "created_utc": "2026-02-10 13:35:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4nxuer",
          "author": "Upstairs-Fee768",
          "text": "O Pai de todos: PYTHON",
          "score": 1,
          "created_utc": "2026-02-10 19:04:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4en8sr",
          "author": "Imaginary-Level1923",
          "text": "Depends on what you're automating honestly. For CRM/sales stuff, Clay is way better than trying to build enrichment chains in n8n as it's built specifically for lead data and the waterfall enrichment approach saves a ton of time vs wiring up 5 API calls yourself. \n\nFor internal notifications and alerts, Pipedream is nice because you write actual code but it handles all the infra. For simple \"connect app A to app B\" stuff where you don't need logic, Make is cheaper than Zapier and the visual editor is better for seeing what's happening.   \n  \nThe real answer though is that most early stage startups don't need to automate as much as they think. I'd pick the 2-3 workflows that actually save you hours per week and just use n8n or Zapier for those, rather than trying to find the perfect tool for each thing. The maintenance overhead of managing 5 different automation platforms is way worse than one general purpose tool that's \"good enough.\"",
          "score": -7,
          "created_utc": "2026-02-09 09:22:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4felmw",
              "author": "OracleofFl",
              "text": "This: \"The maintenance overhead of managing 5 different automation platforms is way worse than one general purpose tool that's \"good enough.\"\"\n\nZapier or N8N are fine. I like Zapier because their 3rd party SaaS connectors are the broadest and most tried and true but their UI is a joke. It works well enough.",
              "score": 1,
              "created_utc": "2026-02-09 13:13:38",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4efz99",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": -5,
          "created_utc": "2026-02-09 08:10:48",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r0ozt9",
      "title": "what's up with people immediately trusting new AI sites (and putting their credit card info)",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1r0ozt9/whats_up_with_people_immediately_trusting_new_ai/",
      "author": "EducationalArticle95",
      "created_utc": "2026-02-10 02:50:56",
      "score": 23,
      "num_comments": 17,
      "upvote_ratio": 0.93,
      "text": "if you watched the super bowl, you prob missed this but the most confusing commercial of the night just had text that said \"reserve your name at AI\" and literally nothing else.\n\nand it worked. site instantly crashed. everyone pulled out their phones, reserved a username, entered credit card info... for a product that doesn't actually exist yet.\n\nhere's what we know:\n\n* the company bought this domain name for $70 million\n* then spent millions more on this super bowl spot\n* the pitch: this will eventually be a platform for \"automated personal AI assistants\" (kinda like moltbot)\n* right now: you can reserve two names. one for you, one for your future AI assistant\n* they ask for a credit card \"to prove you're human\" but claim they won't charge you\n\nbut that's it? there's no product. no features. nothing tangible?\n\nthe entire play was FOMO to make people feel like they'll miss out if they don't act right now, before they even know what they're signing up for. from a GTM stand point, sure this is a blockbuster tech launch but as a society where are we heading my dudes\n\nhonestly this could turn into something cool. but right now it's just a landing page with good marketing. don't rush into putting your card info in random hype sites my friends",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1r0ozt9/whats_up_with_people_immediately_trusting_new_ai/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "o4khe8o",
          "author": "Mightaswellmakeone",
          "text": "I skipped the past...14 Superbowls? So I did not watch it first hand. But, what you're describing sounds like the Superbowl that happened in 2000.",
          "score": 5,
          "created_utc": "2026-02-10 05:43:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4jto1f",
          "author": "boring_but_effective",
          "text": "Spot on and I'm adding one more layer to it. This is social engineering live at work.",
          "score": 5,
          "created_utc": "2026-02-10 03:01:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4juvn3",
          "author": "HomerDoakQuarlesIII",
          "text": "They picked the right space, ripe with suckers to chew through...",
          "score": 3,
          "created_utc": "2026-02-10 03:08:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4kdvwe",
          "author": "dwoodro",
          "text": "They do that because until people figure out that they are the \"product\", it will continue to happen. Backend data tracking, data mining, and market control is the new name of the game. They can pump and dump new AI into the system, get users hooked, harvest, and make billions on the backside without people being any wiser to the real game.",
          "score": 3,
          "created_utc": "2026-02-10 05:16:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4k2ky6",
          "author": "uncivilized_human",
          "text": "lowkey this is the pattern with every AI launch now. hype first, product... eventually? i get wanting to be early but the \"credit card to prove you're human\" thing is sketchy. just use captcha like everyone else.\n\nthe whole thing reads as a data collection play disguised as exclusivity.",
          "score": 2,
          "created_utc": "2026-02-10 03:57:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4kp26m",
          "author": "victorious02",
          "text": "Idk bro , something is wrong ",
          "score": 2,
          "created_utc": "2026-02-10 06:48:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4l6hc8",
              "author": "EducationalArticle95",
              "text": "it's so sus",
              "score": 1,
              "created_utc": "2026-02-10 09:34:25",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4l4v12",
          "author": "ChestChance6126",
          "text": "It’s wild how far raw FOMO plus perceived legitimacy can carry something. Big spend, Super Bowl slot, expensive domain, people assume there must be substance behind it. From an automation angle, this is just classic pre sell psychology turned up to eleven. The credit card “prove you’re human” thing is the part that feels most off. You can validate demand without asking for the highest trust signal upfront. Curious how many of those signups convert once there is an actual product, versus how many people regret it later.",
          "score": 2,
          "created_utc": "2026-02-10 09:18:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4l6gtx",
              "author": "EducationalArticle95",
              "text": "Ah so well said ",
              "score": 1,
              "created_utc": "2026-02-10 09:34:16",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4le0ow",
          "author": "jghaines",
          "text": "It’s not a product that appeals to me, but it sounds pretty low risk for those that were curious",
          "score": 2,
          "created_utc": "2026-02-10 10:45:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4nu127",
          "author": "Alpertayfur",
          "text": "It’s pure FOMO psychology mixed with AI hype. People see “AI + scarcity + Super Bowl” and their critical thinking shuts off. The promise feels inevitable, so they assume legitimacy before proof exists.\n\nFrom a GTM angle it’s brilliant. From a user-safety angle it’s worrying. A credit card is trust, not a CAPTCHA. If there’s no product, no transparency, and no clear value yet, the safest move is to wait.\n\nAI isn’t magic. A landing page and a big budget don’t equal credibility.",
          "score": 2,
          "created_utc": "2026-02-10 18:46:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4pqek6",
          "author": "False_Ad8389",
          "text": "Wild how effective pure FOMO and Super Bowl slot still are.  \n$70M domain, mystery landing page, “reserve your name now”, credit card “just to prove you’re human” = instant crash lol",
          "score": 2,
          "created_utc": "2026-02-11 00:24:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4q8wia",
          "author": "bones605",
          "text": "Wise men say only fools rush in",
          "score": 2,
          "created_utc": "2026-02-11 02:14:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4r7vsz",
              "author": "EducationalArticle95",
              "text": "Hahah spot on",
              "score": 1,
              "created_utc": "2026-02-11 06:16:09",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4jrwdv",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-10 02:50:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4kfk0n",
          "author": "JezebelRoseErotica",
          "text": "Am I on ‘how to spot spam?’ Because damn I’m getting good at this.\n\nSPAM\n\n> •\t⁠the pitch: this will eventually be a platform for \"automated personal AI assistants\" (kinda like moltbot)",
          "score": 0,
          "created_utc": "2026-02-10 05:29:27",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qyimo0",
      "title": "Anyone here successfully developed an AI assisted ADHD workflow to deal with \"life\"?",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qyimo0/anyone_here_successfully_developed_an_ai_assisted/",
      "author": "Antic_Hay",
      "created_utc": "2026-02-07 16:45:01",
      "score": 21,
      "num_comments": 17,
      "upvote_ratio": 0.96,
      "text": "Target audience: people with ADHD who are completely all over the place and want to not only get on top of their chores and obligations without a last minute panic, but also actually improve their skills and hobbies.  \n  \nProblem with this whole domain is that the systems offered to people who are disorganised, chaotic, and forgetful are way too complex and bureaucratic, and the systems that are possible are usually too simple. \n\nEven for things like learning a hobby like playing the piano, a reminder on your phone every morning to practice for 20 minutes before work isn't really going to scratch that itch, because you probably aren't going to commit to 2 full hours every day except on the very first day where you had a huge dopamine burst and decided you could do everything ever.\n\nFor me the perfect system would be one where you could just throw junk into it throughout the day by voice or text like \"birthday present\", \"remember tax\". It would then ping you multiple time to day saying \"hey, do you have time to go over your new items\", it would then ask you intelligent questions, and it would know that you have to buy a birthday present for your sister by next Tuesday, and tax needs to be filed that's fine and ages but you do need to talk to your old employer about etc. etc.\n\nThen it would just know about habits you wanted to develop in the morning, or the evening or certain work things, your schedule, and it would just tell you \"oh, you need to do this\". It would have plenty of time in advance and use (effective) strategies (that it could research) on how to make it most likely you will take the first step on your taxes, and for things like hobbies, if you wanted to learn six things, it would probably start you on, e.g. 5 minutes piano on Monday, 5 minutes guitar on Tuesday, 5 minutes learning Welsh on Wednesday etc, and slowly ramp up the time so habit becomes second nature without ever feeling like work. And then when you get to the point where you doing 3 things every morning for 20 minutes, then the other 3 the next day, and it's starting to get too much, you can just drop one like that, or have a conversation about which one to drop.\n\nIt's a little bit of work, but it feels very doable right now...",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qyimo0/anyone_here_successfully_developed_an_ai_assisted/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "o466bvo",
          "author": "ThatNorthernHag",
          "text": "RemindMe! In 3 days",
          "score": 3,
          "created_utc": "2026-02-08 00:25:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o478n65",
          "author": "NonArus",
          "text": "Heavy ADHD, using an ai assistant app for my workflow called saner ai. I use it because it helps with managing tasks, like a dedicated GPT. I just offload my thoughts then it set reminders for me, also the check in daily to remind me what I may have forgotten has saved me many times",
          "score": 2,
          "created_utc": "2026-02-08 04:30:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o445k1a",
          "author": "unauthorizedhorse",
          "text": "Tried a trillion different things, but to be brutally honest I just have a note in my phone with categories, starting with time sensitive (things I need to keep on the surface) and then three or four other “life areas” that contain anything that pops up. I call it a Pensieve like Dumblodoor uses :)\n\nHits never make the mistake of having one “point of truth” that keeps you tethered while your brain is off exploring oceans.",
          "score": 4,
          "created_utc": "2026-02-07 17:49:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o45eig7",
          "author": "erisian2342",
          "text": "Yesterday I got Claude Desktop working with Home Assistant. Next is to create a new Assist pipeline and replace Assist’s conversation agent with ChatGPT. Then comes integrating tools like a scheduler for routines, my calendar, and Todoist. Then comes wiring up memory. Then comes attempting the type of routines you’re talking about, which I’m certain will reveal gaps to be filled.  \n\nSo no, I haven’t tried it yet, but I will. One small victory at a time.",
          "score": 2,
          "created_utc": "2026-02-07 21:42:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o45yoml",
              "author": "Long-Builder-157",
              "text": "So you’re saying “there’s a chance?” 🤯",
              "score": 2,
              "created_utc": "2026-02-07 23:39:06",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o43sivj",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-07 16:45:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o46kwyp",
          "author": "S_Alaska",
          "text": "Working on one for iOS but tbh if my adhd is in full form then the app doesn’t help. Sigh. I am also working on an ai system that is not iOS for those of us that enjoy both sides of the adhd world. \n\nIt is a struggle. I should be working on that with my other projects but I am on reddit at the moment.\n\nPs: I like protons ai and Gemini for developing in an already existing system.",
          "score": 1,
          "created_utc": "2026-02-08 01:55:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4d54qi",
          "author": "No_Soy_Colosio",
          "text": "For me I don't need anything else than a todo app and Obsidian. It's perfect for me. Light AI use mostly for ideas on how to organize Obsidian.",
          "score": 1,
          "created_utc": "2026-02-09 02:31:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4gby5f",
          "author": "Excellent-Smile3057",
          "text": "Man, you're describing the exact problem I've been living and breathing for years. The \"too complex vs too simple\" thing is SO real.\n\nI've tried building something similar and here's what I've learned - the hard way:\n\nThe voice dump part? That's actually the easiest piece. You can do that right now with tools like Notion AI or even just voice memos that get transcribed. The hard part is the intelligence layer you're talking about - the system that actually KNOWS the difference between \"tax stuff that's annoying but I have time\" vs \"sister's birthday is Tuesday and I haven't even thought about it.\"\n\nWhat's worked better for me than trying to build one perfect system is accepting that my ADHD brain needs different scaffolding at different times. Sometimes I'm in hyperfocus mode and can handle complexity. Other times I literally can't remember if I ate lunch.\n\nThe habit stacking thing you mentioned (5 min piano Monday, 5 min guitar Tuesday) - that's actually pretty close to what I do with clients. But here's the catch: the system can't be smarter than you on your worst brain day. If it requires you to review and categorize stuff when you're already overwhelmed, you won't use it.\n\nWhat's actually been working is using AI for the triage part - like, I'll dump everything into a voice note, and then I have a simple prompt that sorts it into \"urgent/time-sensitive,\" \"want to do eventually,\" and \"nice idea but probably never happening.\" That last category is KEY because it gets all the guilt-inducing stuff out of my face.\n\nFor the habit ramping - totally doable, but you need external accountability or the system will just become another thing you ignore. I've found that works better with a human check-in (even async) than trying to make AI nag you effectively.\n\nAre you trying to build this for yourself or thinking bigger? Because the individual version is way more achievable than trying to make something that works for all ADHD brains (we're all chaotic in our own special ways lol).",
          "score": 1,
          "created_utc": "2026-02-09 16:12:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4mkb5a",
          "author": "Electrical_Heart_673",
          "text": "Maybe find something and get creative using something like Make and Automly.pro. It might be a bit hard to find real problems at the start but just push for it and build something using the 2 tools.",
          "score": 1,
          "created_utc": "2026-02-10 15:15:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o45s080",
          "author": "alrightryanx",
          "text": "Working on it as an Android + Web app: r/ShadowAIapp just press the mic icon or + to add a session. You can create Custom cards to organize any part of your life, invoices, clients, expenses, games, hairstyles, whatever. The update that should go live tomorrow will fix a lot of bugs so bare with me.",
          "score": 1,
          "created_utc": "2026-02-07 22:57:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o442snn",
          "author": "GuitarAppropriate489",
          "text": "Can you come in dms?",
          "score": 1,
          "created_utc": "2026-02-07 17:35:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o474o2q",
          "author": "forklingo",
          "text": "i have not seen anyone fully nail this yet, but pieces of it work when they stay very forgiving. the big thing seems to be capture first, structure later. dumping junk in with zero friction is key, then having a separate moment where the system gently helps you sort it. anything that tries to be smart too early just gets ignored. also tiny defaults matter a lot. five minutes is way better than twenty because it lowers the mental entry cost. the part that feels hardest is pacing and knowing when to back off without feeling like failure. if someone cracked that adaptive layer, it would be huge. i am curious if anyone here has built something that actually survives the first few weeks.",
          "score": 1,
          "created_utc": "2026-02-08 04:02:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o47k7sf",
          "author": "Much_Pomegranate6272",
          "text": "This is definitely doable with current AI + automation tools but the hard part isn't building it. it's actually using it consistently (which is the ADHD problem in the first place).\n\nYou're describing a personal AI assistant that:\n\n* Captures random inputs (voice/text)\n* Asks clarifying questions\n* Schedules/reminds based on context\n* Adapts habits gradually\n\nTech-wise ChatGPT/Claude API + n8n for workflow logic + calendar integration + notifications. All buildable.\n\nThe Real problem is ADHD brains resist systems even when they're helpful. You'll use it intensely for 3 days then ghost it for a week. The system needs to handle that inconsistency, not assume perfect user behavior.",
          "score": 1,
          "created_utc": "2026-02-08 06:00:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4l79a1",
              "author": "ThatNorthernHag",
              "text": "Would the AI calling you - with an option to switch to chat if voice is not ok- do? You tell it you need it to handle it.. and it will?",
              "score": 1,
              "created_utc": "2026-02-10 09:42:06",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o44x44w",
          "author": "GlasnostBusters",
          "text": "adhd is such bullsh*t",
          "score": -10,
          "created_utc": "2026-02-07 20:08:36",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qwfvfk",
      "title": "rentahuman AI is a dystopian movie plot right?",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qwfvfk/rentahuman_ai_is_a_dystopian_movie_plot_right/",
      "author": "EducationalArticle95",
      "created_utc": "2026-02-05 08:30:08",
      "score": 18,
      "num_comments": 16,
      "upvote_ratio": 0.77,
      "text": "ok so i went down the rentahuman ai rabbit hole and it gets stranger the more I research.   \n  \ntldr: ai can now hire humans using an api call. and humans are putting themselves up on the site FOR RENT (so weird that they used the word \"Rent\")   \n  \nhow it works in practice:   \n\\- humans sign up on rentahuman ai   \n\\- you list your skills like a weird linkedin / fiverr hybrid (research, phone calls erc.)   \n\\- you set an hourly rate.   \n\\- ai agents browse these profiles and decide if you’re “useful\" and hire you   \n  \nthe platform literally describes humans as the “real-world physical layer for ai” which is so abrasive.   \n  \nthis is ai treating humans like tools. from “hey ai, help me do this” to ai saying “hey human, go do this for me” is this the future of work? a weird experiment? should we be freaking out more?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qwfvfk/rentahuman_ai_is_a_dystopian_movie_plot_right/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "o3oumgp",
          "author": "ogenom",
          "text": "This reads like a thinly veiled ad for whatever rent a human is.",
          "score": 7,
          "created_utc": "2026-02-05 09:32:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3p995d",
          "author": "KrydanX",
          "text": "Sounds like an ad, but just to add to the conversation;\n\nIsn’t this basically how many HR Systems are build nowadays? You collect a pool of candidates based on sophisticated profiles and then pick the one that fits best to your needs. It’s just automating the human part, which, I think will lead to even more people lying the shit out of their CV and skills to get picked by automated systems. At least with human hiring you have some control instance.",
          "score": 4,
          "created_utc": "2026-02-05 11:45:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3pgzug",
          "author": "Varioustiny",
          "text": "Who is actually paying the humans??",
          "score": 3,
          "created_utc": "2026-02-05 12:41:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3twoib",
              "author": "EducationalArticle95",
              "text": "It's in cryptocurrency apparently\n\n",
              "score": 2,
              "created_utc": "2026-02-06 02:16:13",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3pn6jn",
          "author": "unique_name_14",
          "text": "Sounds much like a freelancer site",
          "score": 2,
          "created_utc": "2026-02-05 13:20:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3oo5js",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-05 08:30:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3qy9zy",
          "author": "PresentStand2023",
          "text": "It's not real, it's just some viral stunt that shills like you can post about",
          "score": 1,
          "created_utc": "2026-02-05 17:15:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3r0pjz",
          "author": "anashel",
          "text": "Freelancer or upworks or fiverr website with a mcp wrapper…",
          "score": 1,
          "created_utc": "2026-02-05 17:27:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3rnruj",
          "author": "Tombobalomb",
          "text": "It's just a scam/platform to sell other scams",
          "score": 1,
          "created_utc": "2026-02-05 19:12:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3rqzn6",
          "author": "Celac242",
          "text": "Man these veiled advertisements are everywhere on Reddit.  Reddit has really turned into a wasteland of ads since it went public",
          "score": 1,
          "created_utc": "2026-02-05 19:27:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3txqo5",
          "author": "Beneficial-Panda-640",
          "text": "The wording is doing a lot of psychological damage here. If you strip the language away, this looks very similar to task marketplaces that already exist, just with an algorithm doing the matching instead of a human. What feels different is the framing of people as a “layer” rather than as agents with judgment and choice.\n\nThe risk I see is not that AI delegates work, that already happens, but that responsibility and context get abstracted away. When a human assigns a task, there is usually some shared understanding of consequences and quality. When an agent does it, that accountability can get fuzzy fast. Whether this becomes dystopian or just another weird labor market experiment probably depends on how much agency and transparency the humans on the other side actually retain.",
          "score": 1,
          "created_utc": "2026-02-06 02:22:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3w817o",
          "author": "bloodredpitchblack",
          "text": "I will perform seances and other rituals for any AI that's paying in Bitcoin. ",
          "score": 1,
          "created_utc": "2026-02-06 13:03:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o45zfzx",
              "author": "TopShoulder5971",
              "text": "What protects your wallet from those agents? Whoever behind such agents? Very risky.",
              "score": 1,
              "created_utc": "2026-02-07 23:43:44",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o45yu2o",
          "author": "TopShoulder5971",
          "text": "Its just a \"job seeking\" site with AI masking. . This more likely to do fishy stuff with your data while compromising your cryptowallet due their \"payment\" method.",
          "score": 1,
          "created_utc": "2026-02-07 23:40:01",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r1sa4l",
      "title": "Has an automation you setup ever outperformed a human? If so which one?",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1r1sa4l/has_an_automation_you_setup_ever_outperformed_a/",
      "author": "StandardNecessary218",
      "created_utc": "2026-02-11 08:52:27",
      "score": 18,
      "num_comments": 14,
      "upvote_ratio": 0.95,
      "text": "Hi all- was having Wednesday blues at work and figured I'd stir up some controversy on reddit! Haha but on a serious now, I have been on this sub for a while and I have already be intrigued by crazy automatons that get shared!\n\nBut for ones who actually used it, has an automation you setup ever outperformed a human? If so which one?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1r1sa4l/has_an_automation_you_setup_ever_outperformed_a/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "o4rpsio",
          "author": "No-Marionberry8257",
          "text": "Ofcourse- the ones I have seen outperform inside our business aren't usually because automation its smarter- but its those boring ones that require consistency! Humans often aren't super consistent with jobs that are super repetitive and these days with AI based automations, this has been fantastic. Here are some examples I can think of\n\n1. CRM Updation: We have always asked all our sales and product team to keep a single source of customer truth inside our CRM by logging everything inside it from customer calls to notes! However it was never consistent! Now we have setup that automatically updates our CRM from any call, chat or any conversation that happens within our company by anyone! We have also set it up to create a knowledge inside our notion for each customer with summary etc! This was never possible this well manually!\n2. Data driven content: We have a process to manually look at our Google search console data daily and publish daily content around these keywords to build topical authority and rank for those questions and queries on Google! However our team hated this cause it's less about creativity and more about just following data. Now our team using AI tools like Frizerly has setup a flow where our google search data is used to come with a strategy and then a high specific content piece based on our case studies etc is auto published on our website every day! Again, we still review the published blogs, edit few things but still runs on auto pilot most of the time!\n3. Outbound marketing: Last but not least, every sales member was instructed to do a specific quota of cold outreach everyday from their linkedin and email to book sales calls daily! However our sales team hated this job again and we were finally able to automate the part till booking the sales call using tools like Clay! The key here though is still manually figuring out your ICP and messaging first before automating!\n\nAnd that's about it! Following to see what others have!",
          "score": 8,
          "created_utc": "2026-02-11 09:01:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4rs4ep",
              "author": "Kindly_Watercress416",
              "text": "Wow sounds cool!",
              "score": 1,
              "created_utc": "2026-02-11 09:23:31",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4rou2g",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-11 08:52:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ry0bw",
          "author": "Much_Pomegranate6272",
          "text": "Yeah, I've seen this happen plenty. Email triage and routing is a classic one an automation can categorize and route thousands of support emails instantly with consistent logic, while a human gets tired, inconsistent, and caps out at maybe 100/hour. Same accuracy, way faster.\n\nData entry and reconciliation is another big win. Matching invoices to purchase orders, syncing data between systems, validating formats automation does it in seconds with zero errors while a human takes hours and makes typos. The ROI is insane.",
          "score": 1,
          "created_utc": "2026-02-11 10:17:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4s70qg",
          "author": "Aggravating-Key6628",
          "text": "Lead response for service businesses. Set up an automated text-back that responds to missed calls within 60 seconds. Before that, the person handling it was returning calls within 15-30 minutes on a good day, sometimes hours.\n\nThe automation didn’t just match the human - it crushed it. The first business to respond gets the job the vast majority of the time in home services, and humans simply can’t compete with sub-minute response times consistently.\n\nThe human was actually better at the conversation once it started. But the automation won because it never took a lunch break, never got busy with another call, and never forgot to follow up. Speed of first contact was the entire bottleneck, and that’s exactly the kind of repetitive, time-sensitive task where automation dominates.",
          "score": 1,
          "created_utc": "2026-02-11 11:36:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4s8tuh",
          "author": "Bart_At_Tidio",
          "text": "In short bursts, yes. A well-built automation can outperform a human on speed and consistency. Things like instant order status replies or password resets. It responds in seconds and follows the same logic every time.\n\nWhere humans still win is nuance. Complex edge cases, emotional conversations, weird situations that don’t fit the script.\n\nThe biggest lift happens when automation handles the repetitive front layer and frees people to focus on the messy conversations. That’s where overall performance really improves.\n\nPS: I work with chat and automation tools, so I’ve seen this play out in real setups.",
          "score": 1,
          "created_utc": "2026-02-11 11:50:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4sz4yj",
          "author": "Ill-Bullfrog-5360",
          "text": "I created one for an insurance company and Medicare advantages. This fortune 20 was using excels from tableau to do work. They wouldn’t let me automate that part but I did get all the downloads and excel manipulation done with uipath",
          "score": 1,
          "created_utc": "2026-02-11 14:32:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4rpoj6",
          "author": "OkPomegranate6198",
          "text": "we have created an automation that qualifies leads on Instagram & Whatsapp to book appointments.  \nIt works well but sure thing will it always \"outperform\" a human? I am not 100% certain.  \nBut this is actually not the benchmark.  \nIt's more important that the client feels valued & taken care of (fast responses, reminders,...).  \nThis achieves our AI very very successfully.  \n",
          "score": 1,
          "created_utc": "2026-02-11 09:00:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4s7vl3",
              "author": "Ok-Phone-8893",
              "text": "I am currently thinking about this. How did you get the instagram database? For example how to get instagram sccounts of men that live in Poland and that have bold head on pictures for example?",
              "score": 3,
              "created_utc": "2026-02-11 11:43:23",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4sdbm6",
                  "author": "reaictive",
                  "text": "Instagram itself doesn’t provide an API or a “database” where you can pull lists of accounts by location, and it definitely doesn’t let you filter people by traits like “bald or not.” Some third-party scraping services exist (Apify, RapidAPI, etc.) and they offer filters like keywords, usernames, hashtags/places, and sometimes things like engagement or business category, but they usually don’t have filters that specific either, like “bald or not.”",
                  "score": 2,
                  "created_utc": "2026-02-11 12:23:46",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4rua4x",
          "author": "Mobile-Ad-9449",
          "text": "Yes and interestingly, it wasn’t something “smart,” it was something consistent.\n\nI rebuilt the entire backend system for a finance influencer / course creator, from payment to course access to expiry management. Earlier they were dependent on multiple platforms (checkout tool + course platform + manual access handling). Every time someone purchased, there were small delays, missed expirations, support tickets, etc.\n\nI automated the full flow:\t\n• User purchases\n• Instant account creation + access provisioning\n• Role-based access\n• Automated reminders before expiry\n• Auto revocation on expiration\n• CRM tagging + upsell triggers\n\nNo manual intervention.\n\nThe automation didn’t outperform humans because it was more intelligent, it outperformed because it was 100% consistent and immediate. Zero delays, zero “I forgot to remove access,” zero dependency on 3–4 tools stitched together.\n\nIt basically replaced the operational layer of the business.\n\nThat’s where I’ve seen automation genuinely outperform people, not in creativity, but in reliability. Ok",
          "score": 0,
          "created_utc": "2026-02-11 09:43:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4s27bt",
              "author": "amsgh",
              "text": "Was it Andrew Tate?",
              "score": 1,
              "created_utc": "2026-02-11 10:55:29",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4s2ghn",
                  "author": "Mobile-Ad-9449",
                  "text": "Lol! 😂\nMaybe!",
                  "score": 1,
                  "created_utc": "2026-02-11 10:57:42",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qxas94",
      "title": "What are people switching to after play ht shutdown?",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qxas94/what_are_people_switching_to_after_play_ht/",
      "author": "midnight_sunshine13",
      "created_utc": "2026-02-06 07:03:28",
      "score": 16,
      "num_comments": 5,
      "upvote_ratio": 0.95,
      "text": "I have been seeing a lot of failed generations, network errors and accounts not behaving the same way they used to for longer voice projects.\n\nI am starting to look around for alternatives. What others are moving to right now and whats actually working. Are people migrating successfully or still testing options?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qxas94/what_are_people_switching_to_after_play_ht/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "o3w6xv3",
          "author": "MayonnaiseDays",
          "text": "I moved a couple of longer narration projects over to VoiSpark after running into the same Playht issues. Its been more stable ",
          "score": 2,
          "created_utc": "2026-02-06 12:56:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3v1uzv",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-06 07:03:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3w70zr",
          "author": "Zasaky",
          "text": "The biggest issue for me hasnt even been voice quality its reliability",
          "score": 1,
          "created_utc": "2026-02-06 12:56:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3w742l",
          "author": "Micki_SF",
          "text": "I am still in testing mode honestly. A lot of tools sound decent at first but break down once you push longer scripts or try to reuse the same voice consistently",
          "score": 1,
          "created_utc": "2026-02-06 12:57:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3w77gx",
          "author": "nawang013",
          "text": "Has anyone has actually fully migrated yet?",
          "score": 1,
          "created_utc": "2026-02-06 12:58:06",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qxe4kg",
      "title": "Just started with AI — what tools are worth trying?",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qxe4kg/just_started_with_ai_what_tools_are_worth_trying/",
      "author": "Shitandaa",
      "created_utc": "2026-02-06 10:31:03",
      "score": 15,
      "num_comments": 21,
      "upvote_ratio": 1.0,
      "text": "Hi everyone! I’m new to AI and trying to figure out which tools are actually useful in real life.  \nWhich websites do you personally use and recommend?  \nWould love some beginner-friendly advice!",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qxe4kg/just_started_with_ai_what_tools_are_worth_trying/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "o3w5cy5",
          "author": "Much_Pomegranate6272",
          "text": "Depends what you're trying to do.\n\nFor general AI stuff: ChatGPT or Claude for writing, brainstorming, coding help.\n\nFor automation: n8n to connect tools and build workflows.\n\nFor images: Midjourney or DALL-E.\n\nDon't just try random AI tools - figure out what problem you're solving first, then find the tool that fits.\n\nWhat are you actually trying to use AI for?",
          "score": 5,
          "created_utc": "2026-02-06 12:46:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3vv6jf",
          "author": "purple_logic",
          "text": "I’d just start with a couple of tools and keep it simple. Trying too many at once usually just makes things messy.  \nFor day-to-day stuff, ChatGPT is an easy pick. Perplexity is also nice if you want something that feels more like a search engine.  \nFor work, I’d look for tools that plug into what you already use and connect into places like Slack or Notion, for easy adoption. We've been recently using n8n for workflows, zapier for for quick automations between apps and meetgeek for automating meetings.",
          "score": 2,
          "created_utc": "2026-02-06 11:33:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3xco6y",
          "author": "yuvrajchowdhxry",
          "text": "If I were to suggest anything, I wouldn't advise you to learn to play with ChatGPT or any other common AI tool, as you will likely use it anyway. On a serious note, try;\n\n\\- Gamma AI: PPTs, pitch decks, and so on. Very useful for corporates.\n\n\\- OmniDimension: Voice AI agents for sales, outreach, and customer care. Very efficient for enterprises to keep leads engaged.\n\n\\- Claude's Project feature: It is so underrated and OG for repetitive tasks.\n\nThese aren't for the sake of learning AI, but they will actually benefit your career and open up some amazing opportunities.",
          "score": 2,
          "created_utc": "2026-02-06 16:30:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3voaxo",
          "author": "CallCenterOwner",
          "text": "Try ChatGPT for writing and ideas, Canva AI for design, Notion AI for notes, and Zapier or Make for automation. Start small and practice that’s the best way to learn.",
          "score": 2,
          "created_utc": "2026-02-06 10:34:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3vnz1o",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-06 10:31:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3vq9xv",
          "author": "reaictive",
          "text": "I’d recommend ChatGPT as a general assistant (writing, planning, study help), Claude for coding, Gemini for long docs, and Perplexity for quick research with sources. For AI image generation, you can try Nanobanana, and for video, Veo3. For automations, n8n or Zapier.",
          "score": 1,
          "created_utc": "2026-02-06 10:51:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3vv2yn",
          "author": "AIToolsMaster",
          "text": "chatgpt is the obvious starting point, just mess around with it and see what it can do. ask it to explain things, help you write stuff, create/edit images, etc.\n\nbut the real wins for me have been more specific tools:\n\n* email drafting - [claude.ai](http://claude.ai) or [chatgpt](http://chatgpt.com)  work great for this\n* organizing my tasks/schedule, keeping docs organized- notion ai!\n* meeting transcription - i use an ai tool like [tactiq.io](https://tactiq.io) to transcribe and take meeting notes . saves me probably 5+ hours a week\n* document summaries - perplexity is good for quickly understanding long articles\n\nthe best approach is to identify one annoying task in your day and find an ai tool for that. once you see the time savings, you'll naturally want to automate more stuff 😊",
          "score": 1,
          "created_utc": "2026-02-06 11:32:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3w2jko",
          "author": "Equal_Ad_7668",
          "text": "ChatGPT is something you start with and end with too.\nIf you want to learn ai for with specific goal then thing is different",
          "score": 1,
          "created_utc": "2026-02-06 12:27:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3w2ymf",
          "author": "Hereemideem1a",
          "text": "Welcome! One beginner-friendly tool I really like is Vomo. It turns voice notes, meetings, or uploads into clean summaries and action items. Super useful if you're trying to stay organized.",
          "score": 1,
          "created_utc": "2026-02-06 12:30:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3w3r2r",
          "author": "Lazy-chameleon",
          "text": "Besides ChatGPT, I suggest using Gemini as a starting point. \n\nWhenever I need short-term tools for quick tasks, I often ask for suggestions from Chat or Gemini. I usally get good results without spending much time. However, for more 'serious' tools, I still prefer to do a bit more research and testing.",
          "score": 1,
          "created_utc": "2026-02-06 12:35:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3w9cgu",
          "author": "GetNachoNacho",
          "text": "* ChatGPT for text-based AI tasks and learning\n* DALL·E for AI image generation\n* RunwayML for creative projects like video editing and content creation\n* Lumen5 for turning blog posts into engaging video content",
          "score": 1,
          "created_utc": "2026-02-06 13:11:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3wj2n7",
          "author": "MemoryKeeper92",
          "text": "Gemini or Claude nothing more for start and of course perplexity for search bro",
          "score": 1,
          "created_utc": "2026-02-06 14:04:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3wks40",
          "author": "ManofC0d3",
          "text": "I would suggest you get a small bite of everything for starters. You can use ChatGPT and claude for just ordinary conversations, try Deepseek and Grok for research and different perspectives on your favorite topics and Gemini for research. Nano banana and sora re really good for image generation but be sure to try Dall-e and Midjourney too",
          "score": 1,
          "created_utc": "2026-02-06 14:13:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3wmuiz",
          "author": "ChestChance6126",
          "text": "Start with tools that replace a painful manual step rather than ones that look cool on a homepage. For most people, that’s things like AI assisted summarization for text/audio, smart classification/tagging, or templates that save you from writing the same thing over and over, and once you’ve got a couple of those actually saving time, you can expand.",
          "score": 1,
          "created_utc": "2026-02-06 14:24:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3wr75w",
          "author": "New-Neighborhood8422",
          "text": "I'd say it depends on what exactly you want to try, but I usually use ChatGPT for simple tasks, Claude for any creative activities (for example, writing copies), and Sembly AI for meeting notes + to draft meeting docs afterward.   \nI also use Canva from time to time. It's quite easy to navigate if you need to create visuals",
          "score": 1,
          "created_utc": "2026-02-06 14:47:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3xacae",
          "author": "aaipod",
          "text": "What AI is best for forum analysis? Im trying to gather human specialized information",
          "score": 1,
          "created_utc": "2026-02-06 16:20:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3xmpfh",
          "author": "pvfakten",
          "text": "Oidapost for social media :)",
          "score": 1,
          "created_utc": "2026-02-06 17:18:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3y85ue",
          "author": "AutomationPartner",
          "text": "Agreed with most of the other posts here. One of my newer recommendations in this space is using Gemini 3 for pulling information or text from images as well as creating images. Feels like it's miles ahead of Claude and ChatGPT in this area. \n\nI've been changing most of my automations from Claude/ChatGPT to Gemini 3 and seen a big increase in accuracy. ",
          "score": 1,
          "created_utc": "2026-02-06 19:00:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3z4mww",
          "author": "koojlauj11",
          "text": "Agreed with the others, it depends what you want to use it for.\n\nFirst, learn how to prompt and how to create effective prompts.\n\n  \nTools:\n\n* ChatGPT is the most known one.\n* If you have a google workspace, Google's AI Studio tools are a great resource. Gemini, NotebookLLM, etc. Deepmind . google (shows you their various tools and have a good access to free tools)\n* Claude is focused on a higher degree of safety compared to other AI tools. Has European government contracts: Great for research, writing, coding, research, more of a detailed breakdown.\n* Kimi is a more recent one but apparently it was doing pretty well from just jumping in.\n* xAI -Grok (Elon started this one) the US government is creating a contract with it.\n* Quality Image/Video Generation: Midjourney, Nano Banana Pro (google), Kling, Higginsfield AI\n\nOpenRouter . ai shows rankings of current AI tools great place to check out whose leading and how many tokens are being spent\n\n",
          "score": 1,
          "created_utc": "2026-02-06 21:40:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o408huh",
          "author": "AutonomousLandlord",
          "text": "For day-to-day use I would recommend Google Gemini. It's one of the smarter AI programs out there, and the free version works great.",
          "score": 1,
          "created_utc": "2026-02-07 01:23:03",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qys1re",
      "title": "What automation tool do you actually use and why?",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qys1re/what_automation_tool_do_you_actually_use_and_why/",
      "author": "resbeefspat",
      "created_utc": "2026-02-07 22:52:47",
      "score": 15,
      "num_comments": 17,
      "upvote_ratio": 1.0,
      "text": "Been looking at n8n, Make, and Latenode lately and honestly they all seem pretty similar on the surface. Curious what people are actually using in production though. Are you picking based on price, the UI, integrations you need, or something else? And more importantly, what problems were you trying to solve when you picked it? I know everyone says Make is the most user friendly but keen to hear if that actually holds up when you're building something real.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qys1re/what_automation_tool_do_you_actually_use_and_why/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "o47mjwp",
          "author": "Techenthusiast_07",
          "text": "I am using an AI appointment booking tool for my car dealership business. As it yelps to automatically appoint Booking and handles inbound outbound calls.",
          "score": 3,
          "created_utc": "2026-02-08 06:21:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4bwqqz",
              "author": "resbeefspat",
              "text": "That sounds like a solid use case for it. Does the tool integrate with your existing dealership management system, or are you managing the appointments separately?",
              "score": 1,
              "created_utc": "2026-02-08 22:23:41",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o47w3fl",
          "author": "lgastako",
          "text": "Python, because it sits at a sweet spot in terms of ease of use, availability where I need it, and nice library ecosystem.",
          "score": 2,
          "created_utc": "2026-02-08 07:48:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o45r975",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-07 22:52:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o46px8u",
          "author": "Equal_Ad_7668",
          "text": "Postmate Client. It’s vscode extension 100% free and doesn’t require login",
          "score": 1,
          "created_utc": "2026-02-08 02:26:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o484x0h",
          "author": "Special-Grocery6419",
          "text": "I'm using saner to automate my day schedule when stuff changes",
          "score": 1,
          "created_utc": "2026-02-08 09:11:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o48k4wc",
          "author": "Aggravating-Key6628",
          "text": "n8n for anything complex, Make (formerly Integromat) for mid-level stuff, Zapier only when I need something dead simple in 5 minutes. n8n's self-hosted option is huge — unlimited workflows, no task limits, and you own your data. The visual editor is powerful enough for custom logic without needing to write full code. Make has better pre-built connectors for newer tools, but gets pricey fast. Zapier is the easiest to start with but you'll hit the paywall quick once you're automating real business processes.",
          "score": 1,
          "created_utc": "2026-02-08 11:34:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o48m0wg",
          "author": "manveerc",
          "text": "I tried using n8n, found it is limiting in its capabilities to debug anything complex. I now use Claude Code with skills for most things.",
          "score": 1,
          "created_utc": "2026-02-08 11:51:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o48mlcl",
          "author": "aiagent_exp",
          "text": "I use automation for my real estate work. It helps me send messages to leads, update listings, and remind clients automatically. Makes things much easier.",
          "score": 1,
          "created_utc": "2026-02-08 11:56:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o49m930",
              "author": "Revenue-Sweet",
              "text": "That sounds super handy. What platform are you using?",
              "score": 1,
              "created_utc": "2026-02-08 15:40:52",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o49n5bp",
                  "author": "aiagent_exp",
                  "text": "I used the BotPhonic AI tool.",
                  "score": 1,
                  "created_utc": "2026-02-08 15:45:21",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o498zwf",
          "author": "Flixterr",
          "text": "Usually just running python scripts for general staff, host them locally or on micro aws instance. \nZapier , Make and n8n, are also decent.\n\nAnd for job related cyber security staff and IT  I use BlinkOps.",
          "score": 1,
          "created_utc": "2026-02-08 14:29:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4eg74j",
          "author": "Boogooooooo",
          "text": "Using make, somehow came across it and started playing. In long run would go to the one I can host on my pc, which is I understand is n8n only.\nThere are some unexpected limitations on make\nThey have a limit how long one run of automation can work (40 min) and how long one module can work in that flow (10min).\nI do some heavy prompting and one open ai module via API  does produce my text output in about 5-6 minutes.\nAnother module is on loop to produce pictures over open ai API - one picture slightly over one minute, \nSo when I am doing 10 pictures in runs over time limit at stops half way, my flow will be aborted by make ",
          "score": 1,
          "created_utc": "2026-02-09 08:12:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ev5j5",
          "author": "Weekly_Accident7552",
          "text": "Make: I use it when a non technical teammate has to own it, bc the UI is simple and it is quick to ship. Downside is it can get pricey once u scale.\n\nn8n: I use it when I want control or self hosting, and I do not want per run pricing to explode. Downside is u are the ops guy now.\n\nLatenode: cool if u like mixing code into the flow, but I would not run mission critical stuff there unless u really trust the maturity.\n\nAlso, whichever one u pick, the “human steps” still stall, so we run those in Manifestly with owners and reminders so nothing dies in limbo.",
          "score": 1,
          "created_utc": "2026-02-09 10:40:50",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qzpcpo",
      "title": "When you blindly trust AI",
      "subreddit": "automation",
      "url": "https://i.redd.it/pg7mp1xi2dig1.jpeg",
      "author": "dataexec",
      "created_utc": "2026-02-09 00:15:22",
      "score": 15,
      "num_comments": 9,
      "upvote_ratio": 0.78,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qzpcpo/when_you_blindly_trust_ai/",
      "domain": "i.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "o4ehg5m",
          "author": "drop_carrier",
          "text": "Complete and utter skill (or lack thereof) issue.",
          "score": 5,
          "created_utc": "2026-02-09 08:25:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4jmp0y",
              "author": "ForthwallDev",
              "text": "Kind of, but also just kind of bad design of the Co-Work feature. Not sure if you've used it, but it abstracts away way too much control and blatantly does things under the hood and lies about what it's done.\n\nIf you want to use it, this will inevitably happen and there's authentically nothing you can do about it (beyond just not using it).\n\nIt performs very well otherwise so I hope it irons out, but you can't really use it in the same way you would just working with Claude.\n\nI absolutely recommend staying away from this feature.",
              "score": 1,
              "created_utc": "2026-02-10 02:20:28",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4e9sfk",
          "author": "jensenskawk",
          "text": "15 years of photos and not a single backup. Lmao, it was due to be lost with or without AI.",
          "score": 7,
          "created_utc": "2026-02-09 07:12:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4eki77",
              "author": "riceinmybelly",
              "text": "TBF, iCloud was the backup but yeah, not having a copy is wild",
              "score": 2,
              "created_utc": "2026-02-09 08:55:36",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4ebq5i",
          "author": "Main-Lifeguard-6739",
          "text": "this is what happens if you provide a tool made for devs to normies. ",
          "score": 6,
          "created_utc": "2026-02-09 07:30:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4dxkqq",
          "author": "TerriblyDroll",
          "text": "She didn’t have backups.",
          "score": 5,
          "created_utc": "2026-02-09 05:28:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4fqsz4",
              "author": "dataexec",
              "text": "She relied on him",
              "score": 1,
              "created_utc": "2026-02-09 14:25:35",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o4dxptw",
              "author": "johakine",
              "text": "Deserved",
              "score": 1,
              "created_utc": "2026-02-09 05:29:45",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4cg6rp",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-09 00:15:22",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r16c61",
      "title": "We automate EVERYTHING except the thing that wastes the most time",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1r16c61/we_automate_everything_except_the_thing_that/",
      "author": "NinjaNebulah",
      "created_utc": "2026-02-10 17:01:06",
      "score": 15,
      "num_comments": 14,
      "upvote_ratio": 0.95,
      "text": "This one's been bothering me for a while. CI/CD pipelines automated. Deployments automated. Monitoring automated. But someone submits an IT request and it still needs a human to manually route it, manually assign it, manually track the SLA.\n\nWe spend more collective hours on ticket handoffs than on anything else. The most obvious automation opportunity in the company and somehow it's the one thing nobody's touched. Unbelievable!!",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1r16c61/we_automate_everything_except_the_thing_that/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "o4ncgiq",
          "author": "Mission-Switch-7711",
          "text": "Yes this can all be automated but I think the reason it is still manual is because workload and availability are not properly tracked. Even if it was , the automated system would assign new tickets to the  next available person. People want to cherry pick what goes into the ready for development lane and what goes into the backlog based on complexity.\n\n\nThe automated system would not be bias",
          "score": 3,
          "created_utc": "2026-02-10 17:26:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4o9tat",
              "author": "NinjaNebulah",
              "text": "Very insightful",
              "score": 1,
              "created_utc": "2026-02-10 19:59:48",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o4qpsvi",
              "author": "bespokeagent",
              "text": "Auto assignment to the next available person is a big assumption.\n\nTicket assignment could be based on any number of heuristics.",
              "score": 1,
              "created_utc": "2026-02-11 03:59:36",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4rgemy",
                  "author": "Mission-Switch-7711",
                  "text": "Any number of heuristics is an even bigger assumption ",
                  "score": 0,
                  "created_utc": "2026-02-11 07:32:00",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4nkpex",
          "author": "huntndawg",
          "text": "Beats logic tbh, it's insane how we automate everything except the biggest time sink. AI can auto-categorize, route, and even suggest responses based on ticket history. monday service does exactly this, their ai agent handles the grunt work so your team focuses on actual resolution instead of shuffling those tickets around",
          "score": 2,
          "created_utc": "2026-02-10 18:04:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4o9yej",
              "author": "NinjaNebulah",
              "text": "Duly noted",
              "score": 2,
              "created_utc": "2026-02-10 20:00:27",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4n6xq2",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-10 17:01:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ndptj",
          "author": "Useful_Calendar_6274",
          "text": "so you are not allowed to touch this or what",
          "score": 1,
          "created_utc": "2026-02-10 17:32:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4o9wu2",
              "author": "NinjaNebulah",
              "text": "It's complicated",
              "score": 2,
              "created_utc": "2026-02-10 20:00:15",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4re3ws",
          "author": "Fun-Flounder-4067",
          "text": "Agree! Everyone automates code pipelines, but ticket triage still runs on humans and tribal knowledge.\n\nMost of the waste is in routing, reassignments, approvals, and SLA babysitting",
          "score": 1,
          "created_utc": "2026-02-11 07:10:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ri7vc",
          "author": "Beneficial-Panda-640",
          "text": "I see this a lot. The technical pipelines get automated first because they have clear owners, clean inputs, and measurable outputs. Ticket routing sits in the gray zone between teams, so no one fully owns the end to end flow.\n\nHandoffs are also political. Automating them forces you to define categories, escalation paths, and accountability. That can surface uncomfortable questions about who actually owns what.\n\nIf you want to move it forward, I would map the current flow in detail. How many touches per ticket, where it waits, where it gets reassigned. Once the waste is visible, it is easier to justify automation.",
          "score": 1,
          "created_utc": "2026-02-11 07:48:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4rogd0",
          "author": "AgenticAF",
          "text": "This is so true. And this makes you wonder what is the exact use of all these fancy automations when the basicaf things are staying unfixed. ",
          "score": 1,
          "created_utc": "2026-02-11 08:48:45",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qzxa48",
      "title": "What’s your best AI / automation setup for small businesses?",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qzxa48/whats_your_best_ai_automation_setup_for_small/",
      "author": "LumaDraft28",
      "created_utc": "2026-02-09 06:51:51",
      "score": 14,
      "num_comments": 36,
      "upvote_ratio": 1.0,
      "text": "What routines should I *not* be doing anymore? 😄",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qzxa48/whats_your_best_ai_automation_setup_for_small/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "o4ej1gx",
          "author": "Sea_Dinner5230",
          "text": "We recently automated a task that used to take some manual hours and was pretty boring itself - documentation and user how-to guides creation, since before the ability to use AI technology, this was pretty time-consuming thing to do. Now it takes around 15 minutes.\n\nThe workflow is simple: record your screen of a task, workflow or feature walkthrough (even without audio) -> get a step-by-step guide with titles, descriptions, and contextual screenshots out of it automatically, auto-translate, and edit the output if needed as in a regular doc before final export or sending it to the user. We built our own tool based on this workflow.\n\nFor me it makes documentation both faster and easier, since I also had a problem with simply start that task, but now start is easy, you get some good base and can refine if needed.",
          "score": 6,
          "created_utc": "2026-02-09 08:41:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4hze6p",
              "author": "quantumjedi",
              "text": "Documentation is a huge part of what I automate. Even if you need to go through and tweak it for best practices and such afterwards, getting 85% of the way there quickly and efficiently is such a dream these days.",
              "score": 2,
              "created_utc": "2026-02-09 20:58:36",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4kagbi",
                  "author": "Sea_Dinner5230",
                  "text": "Yes, absolutely!",
                  "score": 2,
                  "created_utc": "2026-02-10 04:51:41",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4r8t3j",
          "author": "cryptobuff",
          "text": "First thing I automated was follow ups. I used to manually chase leads and unpaid invoices. Total time sink.",
          "score": 4,
          "created_utc": "2026-02-11 06:24:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4r8zk2",
              "author": "BoldElara92",
              "text": "Same. And appointment confirmations. I didn’t realize how much mental space that stuff takes up.",
              "score": 4,
              "created_utc": "2026-02-11 06:25:38",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4r96mz",
                  "author": "LumaDraft28",
                  "text": "What are you guys using for that? Zapier? Or something more advanced?",
                  "score": 3,
                  "created_utc": "2026-02-11 06:27:21",
                  "is_submitter": true,
                  "replies": []
                },
                {
                  "id": "o4r9123",
                  "author": "Own_View3337",
                  "text": "For me it was onboarding emails. I kept rewriting the same message 50 times a month.",
                  "score": 1,
                  "created_utc": "2026-02-11 06:25:59",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4r77xb",
          "author": "leobesat",
          "text": "for small businesses, the biggest mistake i still see is manual triage. manually reading every lead, replying one by one, qualifying by gut feel. that should be automated.\n\nwe moved to a setup where inbound leads get enriched, summarized, and scored automatically. then high-intent ones notify sales instantly. we’re using lindy for the multi-step logic because it handles conditional flows way better than basic trigger tools.",
          "score": 3,
          "created_utc": "2026-02-11 06:10:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4r7c15",
              "author": "LumaDraft28",
              "text": "this sounds interesting. are you automating the replies too or just the routing?",
              "score": 3,
              "created_utc": "2026-02-11 06:11:32",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4r7ej9",
                  "author": "leobesat",
                  "text": "both. first response is auto-generated but contextual. not just a template. it pulls from the form and past interactions.",
                  "score": 2,
                  "created_utc": "2026-02-11 06:12:09",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4e7jd0",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 2,
          "created_utc": "2026-02-09 06:51:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4egu34",
          "author": "Much_Pomegranate6272",
          "text": "Depends what's eating your time but common ones:\n\nOrder processing - if e-commerce, automate order → label → tracking email → inventory update. Saves hours daily.\n\nCustomer support routing - auto-categorize incoming messages and route to right person or send template responses for common questions.\n\nData entry - syncing info between platforms (CRM, accounting, spreadsheets). Stop copy-pasting manually.\n\nEmail follow-ups - automated sequences for leads, customers, whatever. Set it once, runs forever.",
          "score": 2,
          "created_utc": "2026-02-09 08:19:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4g5n75",
          "author": "ActivitySmooth8847",
          "text": "For small biz the biggest win is automating the boring stuff first, not the fancy AI stuff. I’d stop manually doing lead research and spreadsheet cleanup every week. Use something like SocLeads to pull targeted leads from Google Maps and socials, then run simple follow ups in Mailchimp or Instantly. For ops, Zapier or Make can handle the glue work like pushing form leads into a CRM and sending reminders, and ChatGPT is great for drafting first pass copy, but keep a human review so it does not sound robotic.",
          "score": 2,
          "created_utc": "2026-02-09 15:42:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4hz27r",
              "author": "Aggressive-Collar782",
              "text": "I hired a team and they focused on building a unified backend so all those different automations could share data and handle errors together, which really cut down on the manual oversight. It made the whole system feel more like a single, reliable assistant instead of managing a bunch of separate tools",
              "score": 1,
              "created_utc": "2026-02-09 20:56:58",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4h8vfk",
          "author": "AutomationPartner",
          "text": "I work at Wrk, we're an automation managed service company and we build a lot of automations for small and medium sized business. Some of the things that we've been asked for a lot and drive real value are:  \n  \n\\- Document processing. Specifically taking details from documents, or picture of documents, and entering them automatically into websites/applications.  \n\\- Web Process Automation: Lots of companies will look up details or enter details into websites in extreme volume, usually looking to hire an army of VAs as they grow and expand.  \n\\- Application syncs: If you have multiple applications that need information from eachother to work (i.e. your support team uses Zoho and your Engineering team uses JIRA but they need updates form each other) Then we can make the two systems talk to each other so your team never needs to go looking for updates. \n\nThere's a lot of other stuff but basically anything high-volume repetitive and manual is a good place to start looking. ",
          "score": 2,
          "created_utc": "2026-02-09 18:48:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4jtl0s",
              "author": "HomerDoakQuarlesIII",
              "text": "Yep, feeding data, parsing, scraping, integrating, automating these things ill always be needed, sounds like a good business.",
              "score": 2,
              "created_utc": "2026-02-10 03:00:59",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4r9w0z",
          "author": "LissePattern",
          "text": "Stop manually scheduling. That’s my advice.",
          "score": 2,
          "created_utc": "2026-02-11 06:33:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4r9yn1",
              "author": "Dry-Chapter9487",
              "text": "This. If you’re still emailing back and forth to find a time, automate it yesterday.",
              "score": 2,
              "created_utc": "2026-02-11 06:34:07",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4ra0vy",
                  "author": "LissePattern",
                  "text": "Yup. Calendar + auto reminders = less no shows.",
                  "score": 1,
                  "created_utc": "2026-02-11 06:34:41",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4er370",
          "author": "ApprehensiveCrab96",
          "text": "Find leads with Exa and get work check in every hour on Saner",
          "score": 1,
          "created_utc": "2026-02-09 10:01:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4fg9pr",
          "author": "Antique-Relief7441",
          "text": "Intervo ai and codedesign",
          "score": 1,
          "created_utc": "2026-02-09 13:24:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4fihtm",
          "author": "Dear_Lia12",
          "text": "I automate content creation from an xl with titles I update manually for now, worked a bit on prompt but it finally paid out",
          "score": 1,
          "created_utc": "2026-02-09 13:37:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4fxx9h",
          "author": "GetNachoNacho",
          "text": "Biggest win for small teams: automate handoffs, not thinking. If you’re still manually doing follow-ups, reporting, data entry, or status updates, that’s where AI pays back fastest.",
          "score": 1,
          "created_utc": "2026-02-09 15:04:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4hw5y4",
          "author": "Fresh_Archer8601",
          "text": "That's a great question to start with. I had a team, Qoest, help me figure this out for my own small business. We focused on automating the repetitive stuff first, like sorting customer inquiries and pulling data for reports, which freed up a ton of time for the work that actually needed a human touch. It really changes your day when you stop doing the manual tasks that feel like busywork",
          "score": 1,
          "created_utc": "2026-02-09 20:42:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4j6bwm",
          "author": "Electrical_Heart_673",
          "text": "Honestly anything and everything that could be replaced at no/very small cost. If you don't know anything about automating (not sure if you're an actual business or a guy looking for automations to sell), but you can use Make with Automly.pro. Personally, they're literally the simplest to use and they're so good when it comes to these things.",
          "score": 1,
          "created_utc": "2026-02-10 00:45:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ldbu0",
          "author": "CartographerFeisty66",
          "text": "It depends.   \nIf you find yourself in a lot of meetings I would go with the golden combination of Granola + Catch.   \nFor design I thin Figma Weave is interesting but some skills are needed.   \n",
          "score": 1,
          "created_utc": "2026-02-10 10:39:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4o5fbs",
          "author": "Old_Watercress_3033",
          "text": "For small home service businesses, the best AI wins are inbox summaries, lead replies, scheduling/reminder automations, and estimate follow-ups. We’ve also been testing an AI CSR feature in our service software for first replies and basic questions not perfect, but it cuts a lot of repetitive back and forth.",
          "score": 1,
          "created_utc": "2026-02-10 19:39:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4epbns",
          "author": "ForeignGreen3488",
          "text": "Based on the latest 2026 automation trends data, small businesses are seeing 85% efficiency gains with AI adoption. Here's what's working best:\n\nTop ROI automation setups for small businesses:\n1. Voice-first automation (like the expense tracking example) - removes friction completely\n2. Agentic AI systems that handle entire workflows, not just single tasks  \n3. AI-powered customer service that learns and adapts\n4. Automated analytics and decision-making systems\n\nKey insight: 57% of small businesses are now investing in AI (up from 36% in 2023), and 92% have adopted some form of automation. The shift is from \"nice to have\" to \"strategic asset.\"\n\nFor small businesses specifically, focus on:\n- Customer service automation (highest immediate ROI)\n- Process orchestration vs single-task automation\n- Voice interfaces for routine data entry\n- AI coaches for business insights instead of just dashboards\n\nThe data shows businesses that implement orchestration layers see 3x better results than those automating isolated tasks.",
          "score": -1,
          "created_utc": "2026-02-09 09:44:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4fof2e",
              "author": "throwyMcTossaway",
              "text": "Good info. Source?",
              "score": 2,
              "created_utc": "2026-02-09 14:12:08",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qyncc8",
      "title": "Does every process actually need to be automated? Or are we just over-engineering for the sake of it?",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qyncc8/does_every_process_actually_need_to_be_automated/",
      "author": "theITmaster",
      "created_utc": "2026-02-07 19:44:00",
      "score": 10,
      "num_comments": 13,
      "upvote_ratio": 0.82,
      "text": "Hey everyone,\n\nLately, I’ve been feeling a lot of pressure to \"automate everything,\" but I’m hitting a wall of diminishing returns. Last week, I spent four hours scripts-tasking a workflow that takes me five minutes to do manually once a month.\n\nI feel like we're reaching a point where the maintenance of the automation is more taxing than the original manual task. At what point do you decide a process is better left manual? \n\nWhere do you draw the line between \"innovation\" and \"over-engineering\"?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qyncc8/does_every_process_actually_need_to_be_automated/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "o44u67b",
          "author": "iamclarenz",
          "text": "Totally get that. Sometimes the overhead isn’t worth it. But if compute is easy and cheap, like what Andrew Sobko is working on with Argentum AI, even heavy automation experiments become less stressful to test.",
          "score": 2,
          "created_utc": "2026-02-07 19:52:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o45cs4j",
          "author": "dwoodro",
          "text": "Honestly, you might have your own answer. If you break the time frame into chunks, 4 hours, to replace 5 minutes once per month. 4 hours = 360 minutes / 5 per task, 72 iterations of that task.\n\nWill those 4 hours recoup you that much time? If not, then likely not useful. Now, if those 4 hours of work were going to compound, such as it saves 30 people in your organization 5 minutes per day, then likely time well spent. ",
          "score": 2,
          "created_utc": "2026-02-07 21:33:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o45fotn",
          "author": "learningtoexcel",
          "text": "What’s your product?",
          "score": 2,
          "created_utc": "2026-02-07 21:48:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o45iqmt",
          "author": "Code_0451",
          "text": "Work in banking IT and any automation needs to be supported by a cost/benefit analysis. Lots of processes are still manual for a reason.",
          "score": 2,
          "created_utc": "2026-02-07 22:05:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o44sggc",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-07 19:44:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o45kujp",
          "author": "retsof81",
          "text": "There is a general mental checklist I go through for task automation.\n\n* How much time did I spend on this task?\n* What is the likelyhood this task will reocur?\n* What is the projected weekly/monthy churn of doing this task?\n* How much time would it cost me to automate this?\n* How much time am I giveng back to myself or the team by automating this?\n* Is the time spent automating less than the projected churn?\n\nUsually asking these types of questions will lead you to the right decision. More importantly, I use this to justify and prioritize automating something that is othrewise killing productivity... \"You see sir, I am not waisting a day... I am increasing our resource availability by two days... a week\". Hard to argue against a one-time effort that pays itself back every week/month into infinity. :)",
          "score": 1,
          "created_utc": "2026-02-07 22:16:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o45mk18",
          "author": "ithkrul",
          "text": "You normally shouldn't do any work until it needs doing. I'm not saying don't do it. I am saying do it when it makes sense to do it.",
          "score": 1,
          "created_utc": "2026-02-07 22:26:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o45rnio",
          "author": "geofabnz",
          "text": "I’ve always found “XKCD 1205 - Is it worth the time?”\nTo be a very helpful visual. I used to keep a copy pinned at my desk. It’s a handy visual reminder of how much time you actually save\n\nFor example, a 5min/monthly task is 5 hours over 5 years. If you spent 4 hours on that task keep in mind that only leaves 1 hour for maintenance (looking purely at time spent vs saved)",
          "score": 1,
          "created_utc": "2026-02-07 22:55:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o46mtlk",
          "author": "Sesmo_FPV",
          "text": "Don't forget the convenience value. Some tasks might only take 5 minutes once in a while, but might be annoying.\n\nFor instance, I programmed 2 buttons to copy Jira ticket information into my clipboard to paste these into chats or emails. One button copies the linked ticket key. The second button copies the linked ticket key plus the ticket title. This „automation“ doesn’t really save time but on the other hand you know can copy tickets without having to focus on them and everyone in the company loves it.",
          "score": 1,
          "created_utc": "2026-02-08 02:07:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o481mtr",
          "author": "corwinsword",
          "text": "Exactly what I feel. We have to automate the things that we do often and which DON'T change often. All other automations are discussible. ",
          "score": 1,
          "created_utc": "2026-02-08 08:40:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o49ayh7",
          "author": "Beneficial-Panda-640",
          "text": "This comes up a lot, and your example is exactly the smell test. If the automation does not reduce cognitive load or risk, and only saves a few minutes on a low frequency task, it is usually not worth it. The line I tend to use is whether automation removes a class of errors or coordination pain, not just keystrokes. Manual work can be perfectly fine when it is visible, understood, and easy to recover from. Over engineering usually starts when we automate something before the process itself is stable or agreed on.",
          "score": 1,
          "created_utc": "2026-02-08 14:40:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4hbs7h",
          "author": "AutomationPartner",
          "text": "Does every process actually need to be automated? No   \nOr are we just over-engineering for the sake of it? Maybe?\n\nTaking a half day to automate a 5 minute task once a month seems like it probably took longer than it was worth. However, if that task scales with volume or is complicated to explain or teach or is prone to breaking, time sensitive, etc. then it might be worth it. \n\nEither way, you likely learned a skill that can be leveraged in other places for more value than the 5 minute task. \n\nThat being said, I think trying to find the biggest bang for your buck activities first then seeing what you can automate from there is a better approach than just trying to automate anything that takes time. ",
          "score": 1,
          "created_utc": "2026-02-09 19:02:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o44tvf2",
          "author": "eigreb",
          "text": "There is no such thing as over engineering",
          "score": -2,
          "created_utc": "2026-02-07 19:51:22",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qx70az",
      "title": "read this if you were thinking of automating outbound phone calls with AI voice before you get in trouble",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qx70az/read_this_if_you_were_thinking_of_automating/",
      "author": "SpiritualWolverine50",
      "created_utc": "2026-02-06 03:45:43",
      "score": 10,
      "num_comments": 11,
      "upvote_ratio": 0.78,
      "text": "Everyone is excited about AI voice agents right now.\n\n\n\nIn 2026, you can spin up an AI caller in a weekend. Connect Twilio, plug in a voice model, upload a lead list, and suddenly you’re “automating outbound.”\n\n\n\nIt sounds efficient.\n\n\n\nBut before you do that, there’s something most founders completely ignore: outbound phone calls are heavily regulated.\n\n\n\nNot “lightly suggested.” Regulated.\n\n\n\nIn the U.S., the TCPA (Telephone Consumer Protection Act) restricts automated calls, especially when using prerecorded or artificial voices.\n\n\n\nIf your AI voice calls someone without prior express written consent, you’re exposed.\n\n\n\nAnd “they filled out a form once” is usually not enough.\n\n\n\nHere’s what that actually means:\n\n\n\n* you need clear, documented consent specifically agreeing to receive automated calls\n* you need proof of when and how that consent was given\n* you need to respect Do Not Call lists (both federal and internal)\n* you need proper opt-out mechanisms\n* you need to understand state-level call recording laws\n\n\n\n\n\nEach violation can cost thousands of dollars per call.\n\n\n\nNot per campaign. Per call.\n\n\n\nAnd it’s not just the U.S.\n\n\n\nGDPR in Europe, CASL in Canada, PECR in the UK — they all have strict rules around automated communications and consent.\n\n\n\nThe technology is easy.\n\n\n\nCompliance is not.\n\n\n\nI’m not saying don’t use AI voice.\n\n\n\nI’m saying: if you’re going to automate outbound calls, make sure compliance is part of the architecture — not an afterthought.\n\n\n\nSometimes the smartest automation decision is not automating at all.\n\n\n\nIf you’re in trades business and unsure whether your setup is compliant, I can help you think it through before it becomes an expensive lesson.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qx70az/read_this_if_you_were_thinking_of_automating/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "o3uf898",
          "author": "Different_Pain5781",
          "text": "we tested ai outbound last year for a home services client. paused it after one week. legal flagged tcpa issues we didn’t even know existed. honestly saved us a massive headache.",
          "score": 3,
          "created_utc": "2026-02-06 04:10:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3uhc15",
              "author": "SpiritualWolverine50",
              "text": "exactly. The tech works but the compliance side is usually what surprises people. Good call pausing it early though!\n\nbtw you could still do it to incearse engagement with returning customers if you had proper consents but I bet you were trying to get new leads, weren't you?",
              "score": 1,
              "created_utc": "2026-02-06 04:24:18",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3z06c4",
          "author": "SoftConsistent8857",
          "text": "Great point about compliance needing to be in the architecture. I had a team, Qoest, build a voice agent with those exact guardrails approvals and logs baked into the core API so we could scale without worrying about TCPA.",
          "score": 2,
          "created_utc": "2026-02-06 21:18:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ubgz3",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-06 03:45:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3v2wgr",
          "author": "Adlien_",
          "text": "Yeah I was testing vapi which is really cool stuff. But then I happened to meet a former call center owner and they broke down how tricky it is to run campaigns legitimately. So that was the end of that!",
          "score": 1,
          "created_utc": "2026-02-06 07:12:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3wh3cu",
              "author": "SpiritualWolverine50",
              "text": "Glad you stopped before it was too late. Also, don't be scared of trying calls automation. You just have to be very careful and make informed decisions!",
              "score": 1,
              "created_utc": "2026-02-06 13:54:12",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o44bbxl",
          "author": "Boogooooooo",
          "text": "Everyone is spoofing phone numbers and making spam calls. It is default practice ",
          "score": 1,
          "created_utc": "2026-02-07 18:17:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3wv1b1",
          "author": "GeekTX",
          "text": "glad to know that I am not the only one promoting regulatory compliance. ",
          "score": 1,
          "created_utc": "2026-02-06 15:06:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3wviju",
              "author": "SpiritualWolverine50",
              "text": "Haha yeah, hope my post helped some folks avoid pricey mistakes",
              "score": 2,
              "created_utc": "2026-02-06 15:09:05",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3vbdqn",
          "author": "AykutSek",
          "text": "Compliance is the most critical \"node\" in the workflow.\n\nIf you automate outbound calls without a strict \"Consent Verification\" logic gate, you aren't building a sales machine; you are building a **lawsuit machine**.\n\nAutomation scales everything—including your legal liabilities. Great warning.",
          "score": 0,
          "created_utc": "2026-02-06 08:31:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3whb6x",
              "author": "SpiritualWolverine50",
              "text": "Yeah, easy to cross the line here. Just be careful, that's my advice",
              "score": 1,
              "created_utc": "2026-02-06 13:55:22",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qxq7ia",
      "title": "Why Automation Work Often Goes Unnoticed (and Why That’s Actually a Good Sign)",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qxq7ia/why_automation_work_often_goes_unnoticed_and_why/",
      "author": "Suspicious-Case1667",
      "created_utc": "2026-02-06 18:47:35",
      "score": 10,
      "num_comments": 8,
      "upvote_ratio": 0.92,
      "text": "Something I’ve noticed working with automation-heavy teams:\n\nWhen automation is done well, nobody talks about it.\nThings just work. Jobs run. Data moves. Manual steps disappear.\n\nBut that “nothing happened” outcome is the result of a lot of invisible effort:\n\nThinking through edge cases\nHandling weird failures\nMaking brittle systems a bit more reliable\nTurning messy manual processes into boring, dependable workflows\n\nIn many orgs, the loudest praise goes to visible features.\nAutomation tends to live in the background until something breaks.\n\nThat got me thinking:\nWhat are some automations you’ve built that quietly saved a ton of time or reduced friction, but never really got noticed because they just worked?\n\nCurious to hear examples of:\n\nSmall scripts that had outsized impact\n“Temporary” automations that became permanent infrastructure\nThings you automated for yourself that later helped a whole team\n\nFeels like there’s a lot of hidden engineering value in this space that doesn’t get discussed enough.\n\nIf people aren’t talking about your automation because it quietly removed pain and made the system feel normal, that’s a win.\nThe goal of good automation is to disappear into the workflow not to demand attention.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qxq7ia/why_automation_work_often_goes_unnoticed_and_why/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "o3y8puv",
          "author": "AutomationPartner",
          "text": "Some of my top automations have been in invoicing and manual data entry. Taking away the tasks that people dread. Couple examples:  \n1. Taking purchase information from one system and entering it into an accounting system to create invoices.   \n2. Going to a website and manually searching through hundreds of records for their current status because there are no reporting features. ",
          "score": 2,
          "created_utc": "2026-02-06 19:02:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3y9vp4",
              "author": "Suspicious-Case1667",
              "text": "My goal is to automate purchase entry into Zoho Books for my retail business with minimal manual steps (ideally near real-time). If you have a proven setup OCR that actually works, I’m all ears.",
              "score": 1,
              "created_utc": "2026-02-06 19:08:20",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4gzv7a",
                  "author": "AutomationPartner",
                  "text": "We do this all the time for customers. We're a managed service that will take care of everything for you. I'll DM you with more information. ",
                  "score": 1,
                  "created_utc": "2026-02-09 18:06:40",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3y5izw",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-06 18:47:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4071nz",
          "author": "Beneficial-Panda-640",
          "text": "I have seen this a lot, especially in ops heavy environments. The most valuable automations tend to erase a class of questions rather than create something flashy. Nobody celebrates the fact that a report is always there at 9am or that a handoff never gets missed anymore, but the absence of noise is the signal.\n\nOne example that sticks with me was a small validation script that caught edge cases before data ever hit downstream teams. It probably saved a few minutes a day for dozens of people, but more importantly it prevented trust erosion. Once people stop double checking, you know it worked. In that sense, being unnoticed is kind of the highest compliment automation can get.",
          "score": 1,
          "created_utc": "2026-02-07 01:14:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4n4qt7",
          "author": "Rose-Star6644",
          "text": "Absolutely, I got lots of advantages of Automated.Automated workflows make it easier for employees to quickly adapt when business change. In my experience its helps works together and team stay aligned.",
          "score": 1,
          "created_utc": "2026-02-10 16:51:00",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qy5j9e",
      "title": "Why your automation feels “complex” even when the workflow is simple",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qy5j9e/why_your_automation_feels_complex_even_when_the/",
      "author": "Better_Charity5112",
      "created_utc": "2026-02-07 05:38:01",
      "score": 9,
      "num_comments": 6,
      "upvote_ratio": 0.85,
      "text": "A lot of people assume automation gets complex because the logic is complex. In practice, it’s usually the opposite. Most workflows I see are logically simple: trigger happens, data moves, action is taken. What makes them feel complex is that too many responsibilities get bundled into one automation.\n\nOne workflow is:  \n– validating data  \n– making decisions  \n– handling retries  \n– notifying humans  \n– updating multiple systems. So when it breaks, nobody knows *which part* failed or why. The fix is usually not better tools or more AI  it’s separation. Reliable automations tend to be boring and modular: one job per workflow, clear inputs, clear outputs. If an automation feels scary to touch, it’s probably doing too much. Splitting one fragile workflow into 2–3 smaller ones often makes it more reliable overnight.\n\nIf you’re debugging something right now, this is worth checking.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qy5j9e/why_your_automation_feels_complex_even_when_the/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "o41ahog",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-07 05:38:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o423biq",
          "author": "Trashy_io",
          "text": "Agreed, for consistency it's best to focus on automating one part at a time to build the whole system out not have one agent do it all. Context window size is the main issue here. The more you ask an agent to do the quicker their context window fills up and they start derailing.",
          "score": 1,
          "created_utc": "2026-02-07 10:06:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o48kbiz",
          "author": "Aggravating-Key6628",
          "text": "Totally agree. The tricky part is knowing when to split. A good rule of thumb: if you can't explain what failed in one sentence, the workflow is doing too much. I've also found that the 'boring and modular' approach makes monitoring way easier — you can see exactly which step in the chain broke instead of guessing. The other benefit nobody talks about: when you need to change one piece later, you don't risk breaking the whole thing.",
          "score": 1,
          "created_utc": "2026-02-08 11:36:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4gkjed",
          "author": "Tasty_South_5728",
          "text": "Atomic units of work are the only path to scale. Monolithic structures are liabilities for those who fear observability. Execution requires precision over convenience. Modularity is the leverage.",
          "score": 1,
          "created_utc": "2026-02-09 16:53:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4hgazm",
          "author": "AutomationPartner",
          "text": "Typically building the single happy path of a workflow takes about 20% of the total time. It's building in the modularity, the logging, the error handling and edge cases that takes the other 80%. \n\nIt's sometimes hard to explain to customers where that 80% is coming from but skip it at your own peril. ",
          "score": 1,
          "created_utc": "2026-02-09 19:23:56",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}