{
  "metadata": {
    "last_updated": "2026-02-03 02:59:57",
    "time_filter": "week",
    "subreddit": "automation",
    "total_items": 20,
    "total_comments": 213,
    "file_size_bytes": 192243
  },
  "items": [
    {
      "id": "1qt4klw",
      "title": "Has anyone used LinkedIn automation? I have some worries, need insights and advice",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qt4klw/has_anyone_used_linkedin_automation_i_have_some/",
      "author": "CodeQuestors",
      "created_utc": "2026-02-01 17:25:25",
      "score": 118,
      "num_comments": 38,
      "upvote_ratio": 1.0,
      "text": "I'm trying to scale up my LinkedIn outreach to a wider b2baudience. But instead of advice on how to do it I keep seeing automation tools everywhere. They sound good, but I'm worried that its use might lead to spam and bans.. Anyone here actually done this? What worked for you? I'm interested not only in automation, manual still seems safer, so any advice would be great\n\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qt4klw/has_anyone_used_linkedin_automation_i_have_some/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "o307ig8",
          "author": "ShadowBoneDragon",
          "text": "What types of messages can you even safely automate? i've only done connection requests, never actual DMs or anything",
          "score": 16,
          "created_utc": "2026-02-01 17:40:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o308e94",
              "author": "SpawnPointDevops",
              "text": "You can do connection invites obv, but also InMails (if you've got credits), messages to groups/events, and DMs to people already in your network. even outreach to people outside your network is possible if their settings allow it",
              "score": 1,
              "created_utc": "2026-02-01 17:44:32",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o308q00",
                  "author": "ShadowBoneDragon",
                  "text": "Doesn't messaging non-connections get you flagged faster tho? every time i get an InMail from someone random it feels super cold ",
                  "score": 1,
                  "created_utc": "2026-02-01 17:46:00",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o30953p",
                  "author": "CodeQuestors",
                  "text": "It sounds like a ton of work up front but i guess if you do it right the ROI is huge. any specific tools you'd recommend?",
                  "score": 1,
                  "created_utc": "2026-02-01 17:47:54",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            },
            {
              "id": "o30dmb2",
              "author": "Dyonizius",
              "text": " google boolean search for finding emails could work, that way you don't rely on their system and can't be flagged, though you want to do some research prior to messaging so as to make sure it is not obvious spam",
              "score": 1,
              "created_utc": "2026-02-01 18:07:55",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o304jg9",
          "author": "WinkObsession",
          "text": "Tried one of those chrome extensions last yr for connection requests. saved me SO much time at first but then linkedin slapped me with a week-long restriction after i sent a batch of pretty generic invites. anyone figured out how to go fast without getting burned?",
          "score": 1,
          "created_utc": "2026-02-01 17:26:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o304v86",
              "author": "CodeQuestors",
              "text": "That's what i'm worried about. from everything i've been reading, personalization seems to be one of the most important things. did you at least use their names or mention anything from their profile?",
              "score": 1,
              "created_utc": "2026-02-01 17:28:26",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o305p7j",
                  "author": "ThighHighlander",
                  "text": "I always try to reference something they posted recently or drop a mutual connection if we have one. Takes more work upfront ngl, but my acceptance rate jumped way up. Chrome extensions always felt sketchy to me though, maybe standalone tools are safer?",
                  "score": 1,
                  "created_utc": "2026-02-01 17:32:17",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o305esf",
          "author": "pmagi69",
          "text": "I would not dare to do any kind of automation when it comes to LinkedIn. The audience is pretty sensitive, and yeah, you really don't want that. It's just going to hurt your brand.\n\nYou can, of course, use tools to speed up certain tasks like finding good posts to comment on, drafting comments, and drafting posts. But it needs to do it in a smart way to know about your products, services, your tone of voice, your target audience's pain points. If you have a tool like that, yeah, but never let the tool auto-post anything for you.",
          "score": 1,
          "created_utc": "2026-02-01 17:30:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o30v8ec",
              "author": "CodeQuestors",
              "text": "So if i draft comments and posts with a tool, but still post them manually, that should be safe? i've tried some AI writing tools but they all sound weird, i want it to be more personal",
              "score": 1,
              "created_utc": "2026-02-01 19:27:38",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o31vrcf",
                  "author": "pmagi69",
                  "text": "Well, I would not say it's that easy that just because you post it manually, that it's safe. It's not the posting itself that is the problem. It is the actual content. So if you have an automation, write stupid content and then post it manually, that's not going to help.\n\nSo you either need to write it yourself or you need to have a smart writing tool that knows not only how to write (which is super important, tone of voice and stuff like that), but also what to write. So it needs to know about your products and services, target audience etc to be an expert and to be able to write something of value and not just AI slop.\n\nAnd yes, I happen to develop such a tool…;-)",
                  "score": 1,
                  "created_utc": "2026-02-01 22:25:18",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3062ds",
          "author": "KeyEbb9922",
          "text": "Use automation through Apify for scraping, as this doesn't rely on your user profile, it's completely anonymous.\n\nThen use a tool like Lemlist for LinkedIn outreach automation. It gives you warnings when it thinks you are sending out too many messages.",
          "score": 1,
          "created_utc": "2026-02-01 17:33:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o30vj0q",
              "author": "CodeQuestors",
              "text": "You scrape leads anonymously first, then import them into lemlist to actually message them? is it an extension? ",
              "score": 1,
              "created_utc": "2026-02-01 19:29:02",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o306cb3",
          "author": "nanojunior_ai",
          "text": "your concern about bans is totally valid — linkedin has gotten way more aggressive about detecting automation in the last year or so. i've seen people get restricted for stuff as simple as sending too many connection requests in a day\n\nhonestly the safest approach i've found is a hybrid one. use automation for the boring repetitive parts (like finding leads that match your ICP, organizing them, maybe scheduling connection requests at human-paced intervals) but write your actual messages manually or at least heavily customize them. the generic \"i noticed we're both in [industry]\" templates are SO obvious at this point and people just ignore them\n\na few things that helped me:\n- keep daily connection requests under ~20-25, linkedin seems to flag above that\n- warm up new accounts slowly, don't go from 0 to 100 day one\n- if you're using any tool, make sure it works through the browser rather than the API (linkedin doesn't have a public outreach API, so anything claiming that is sketchy)\n- engage with people's content BEFORE you cold message them. even just liking a few posts makes your connection request way less random\n\nmanual is definitely safer but it doesn't scale. the sweet spot is automating the research/targeting and keeping the actual human interaction... human",
          "score": 1,
          "created_utc": "2026-02-01 17:35:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o30vrgb",
              "author": "CodeQuestors",
              "text": "This is super helpful, thank you! if my account is already a few years old and active can i skip warming up, or do i need to become more active like posting, commenting etc? how long do you engage with someone's content before sending a request? I usually send a request and only after that like and comment, but probably have to do vice versa",
              "score": 1,
              "created_utc": "2026-02-01 19:30:08",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o308trd",
          "author": "Ok-Breakfast-4676",
          "text": "Hey just genuinely curious, does the linkedin b2b outreach still works?",
          "score": 1,
          "created_utc": "2026-02-01 17:46:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o30vv7y",
              "author": "CodeQuestors",
              "text": "That's actually what i'm trying to figure out, from what i've been seeing it still works but the approach changed a lot. people say cold outreach has very low conversion like 2%, but engagement-first strategies still work. have you had any success with it recently or just asking?  ",
              "score": 1,
              "created_utc": "2026-02-01 19:30:38",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o309f6o",
          "author": "iamclarenz",
          "text": "Automation can help, but it really depends on how much compute and reliability the tools have behind them. That’s why I’ve been watching Andrew Sobko’s Argentum GPU setup. It quietly makes AI-driven outreach smoother and more consistent.",
          "score": 1,
          "created_utc": "2026-02-01 17:49:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o30w3x7",
              "author": "CodeQuestors",
              "text": "interesting, i haven't heard of it before. so is it GPU infrastructure for running AI tools? how does that actually make outreach, should you run your own models?",
              "score": 1,
              "created_utc": "2026-02-01 19:31:46",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o30fbuw",
          "author": "Dyonizius",
          "text": "rotating proxies and rate-limits,\nthat's basically what third party tools do to avoid bans...\ncrawlee and residential proxies are your friends\nyou could automate the whole thing up to the mailing part, segment your application options and set different message templates for each with some automated reckoning customisation added in. I'm working on something like that, have not reached the final stage yet but that's the way I'd do it",
          "score": 1,
          "created_utc": "2026-02-01 18:15:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o30w6rj",
              "author": "CodeQuestors",
              "text": "Thanks, this is way more technical than what i was thinking.  is that actually safer?",
              "score": 1,
              "created_utc": "2026-02-01 19:32:08",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o31q4bs",
                  "author": "Dyonizius",
                  "text": "crawlee abstracts most complexity of it already\n\n\n it is safer as i see:  you won't be scraping data from your machine so no IP bans/limit;\nyou could still use a 3rd party tool for the \"contact enrichment step\" which simplifies a good bit, plus they eat hypothetical legality issues of such practices, at least in the US\n\n\nyou do lose the custom linkedin experience of \"suggestion algorithms\", same with apify actors and other 3rd party scrapers\n\n\nbut you get potentially more data without ban risks\nthen you'd use that data to do the actual outreach/social media side with your account or direct e-mailing",
                  "score": 1,
                  "created_utc": "2026-02-01 21:57:28",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o30nlxc",
          "author": "LiveRaspberry2499",
          "text": "Honestly, it doesn’t matter if you spam people manually or with a bot; the result is the same: you get banned. The reason people fear automation is that it makes it very easy to overdo it (e.g., sending 100 generic requests in an hour).\n\n​If you respect the limits and act like a human, automation is perfectly safe.\n\n​Here is the workflow I use to keep it safe and high-quality:\n\n​The Tech: I use the Unipile API for the actual sending (connection requests and DMs).\n\n​The Logic: I build the flow in Make (or n8n).\n\n​The \"Human\" Element: instead of a generic template, my automation fetches the lead's profile, scrapes their recent posts, and uses OpenAI to write a hyper-personalized message based on what they actually wrote.\n\n​This way, you get the scale of automation but the quality of a manual approach.",
          "score": 1,
          "created_utc": "2026-02-01 18:52:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o32e6jy",
          "author": "yukio_gremory",
          "text": "HR and hiring automate it all the time",
          "score": 1,
          "created_utc": "2026-02-02 00:04:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o33wux5",
          "author": "Physical-Plane7648",
          "text": "There some tools for this. I too wanted to automate but i feel you hard to trust it. But its a necessity for outbound leads. I am researching on which tool is best, will share with you if i find something that ticks all the boxes.",
          "score": 1,
          "created_utc": "2026-02-02 05:34:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o347kzo",
          "author": "dhairrrr",
          "text": "I’ve used LinkedIn automation and your concern makes sense. It only becomes spammy when people overdo it.\n\nI use Konnector with low limits and personalization. I also like using AI comments to engage on posts first (I review/edit before posting) instead of jumping straight into DMs feels more human.\n\nI use automation for repetitive stuff, but once someone replies, it’s manual. That hybrid approach has worked well for me without issues.",
          "score": 1,
          "created_utc": "2026-02-02 07:03:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o34qdad",
          "author": "-TaskForge-",
          "text": "Automation on LinkedIn can help you reach more people, but it needs to be done carefully to avoid spam and account restrictions. The key is to keep interactions natural and relevant to your target audience. We've developed a service that finds fresh leads based on ideal customer profile, then sends warm connection requests with personalized messages. We also automate light engagement like liking posts to build familiarity before outreach. After that we handle the conversation manually. This approach reduces risk while still allowing us to scale effectively.",
          "score": 1,
          "created_utc": "2026-02-02 10:01:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o35haww",
          "author": "Parth_0001Win",
          "text": "You’re right to be cautious. A lot of people jump straight to tools and forget that LinkedIn is still a relationship platform at its core.\n\nFrom what I’ve seen, automation isn’t the real problem , volume without intent is. When messages aren’t grounded in context, it turns spammy fast, whether a human or a tool sends them.\n\nManual outreach feels safer because it forces you to slow down and think about who you’re contacting and why. Some people do use light automation responsibly, but only after they’ve validated messaging manually and set clear limits.\n\nwhat’s your main goal with scaling right now? More conversations, or better-quality ones?",
          "score": 1,
          "created_utc": "2026-02-02 13:30:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o35ngv6",
          "author": "Exotic-Ad-2169",
          "text": "linkedin automation is the fastest way to turn your profile into a spam account that everyone mutes. the tools work until linkedin's detection catches you, then your account gets restricted and you lose all credibility with your actual network. seen it happen to at least a dozen people who thought they were being clever. just manually engage with like 10-15 people a day, takes 20 minutes and doesn't nuke your reputation.",
          "score": 1,
          "created_utc": "2026-02-02 14:05:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o36s1k9",
          "author": "Corgi-Ancient",
          "text": "Automation can be risky if you go too fast or send generic spammy messages, LinkedIn can ban accounts for that. I found tools that help build clean lists useful. Still, mixing some manual personal touches with automation is safer than fully auto messaging.",
          "score": 1,
          "created_utc": "2026-02-02 17:22:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o38mdyk",
          "author": "dmc-123",
          "text": "Automation is not going to help with engagement the way it used to. You're better off being more intentional with your outreach.",
          "score": 1,
          "created_utc": "2026-02-02 22:31:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3047sr",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 0,
          "created_utc": "2026-02-01 17:25:25",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qo8m8k",
      "title": "What is an automation that has helped you outcompete your competitors?",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qo8m8k/what_is_an_automation_that_has_helped_you/",
      "author": "mumplingssmake",
      "created_utc": "2026-01-27 08:52:14",
      "score": 68,
      "num_comments": 21,
      "upvote_ratio": 1.0,
      "text": "Everybody talks about automations but I am curious what are the ones that is actually giving you an edge helping you move faster, better or more efficiently. Ideally a business that is really automated should be able to outcompete less automated competitors I guess? Cause they could be offering lower prices etc?\n\nSo curious, what is an automation that has helped you outcompete your competitors?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qo8m8k/what_is_an_automation_that_has_helped_you/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "o1zh3pv",
          "author": "Ok-Macaron2516",
          "text": "For us it's more about what we are automating more than just automation. For example, we early on realized customers were starting to find us via ChatGPT and other AI tools! So we looked into it and it seemed like customers and these AI tools were running super long tail questions behind the scenes to find answers! So we setup an automation using AI tools like Frizerly that is fully trained on our company and product context to automatically look at search queries and trends on Google to auto publish useful blogs answering these questions on our website. For example: \"What is the best tool for small businesses to automate invoice followups for customers?\" etc! We post like 3 of these automatically every week and now we are often mentioned by AI overview, ChatGPT etc as the go to option over out competitors! So that would be one :)",
          "score": 22,
          "created_utc": "2026-01-27 08:57:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o28mew8",
              "author": "Major-Competition527",
              "text": "Oo we're actually trying to make the most of that tactic too. We're trying to scrape \"hot questions\" from certain subreddits, and answering those questions in our social media marketing later on.",
              "score": 1,
              "created_utc": "2026-01-28 16:26:04",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1zzz9w",
          "author": "Lazy-chameleon",
          "text": "In my case, it was the automation of PDF reporting and sending reports to our clients. Something that used to take us hours or even days to prepare, personalize, and send is now done in minutes. It gave us a huge advantage and freed up time to focus on our clients instead of spending it on report preparation.",
          "score": 6,
          "created_utc": "2026-01-27 11:44:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o214b3p",
          "author": "Reason_is_Key",
          "text": "One automation with huge ROI for us was automatically replying to RFQs that were coming in by mail. We're a large freight forwarding company, so we get lots of time sensitive RFQs coming in that are very time sensitive. With Retab, we built a end to end pipeline that extracted data from the attached documents, hooked into our TMS to find additional context on the client, and then generated the right price + email response",
          "score": 6,
          "created_utc": "2026-01-27 15:29:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1zp1f4",
          "author": "mandevillelove",
          "text": "Automating lead follow ups and email sequences saves us hours and won clients faster than competitors.",
          "score": 3,
          "created_utc": "2026-01-27 10:11:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1zyecn",
          "author": "Secure-Address4385",
          "text": "Honestly, the biggest win wasn’t fancy AI tools. It was automating feedback loops so we know what’s working weekly, not monthly. Speed beats perfection every time.",
          "score": 3,
          "created_utc": "2026-01-27 11:31:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o21469p",
          "author": "Corgi-Ancient",
          "text": "Using automation to build accurate outreach lists fast has helped me a lot. Tools like SocLeads save tons of time by pulling leads from places like Google Maps and social media so you can focus on reaching out instead of hunting contacts. That speed and accuracy definitely gave me an edge over competitors still doing it manually.",
          "score": 3,
          "created_utc": "2026-01-27 15:29:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1zgi01",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-27 08:52:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o21856p",
          "author": "blizzerando",
          "text": "For me it’s intervo ai, which helped me to handle my receptionist and admin duties. ",
          "score": 1,
          "created_utc": "2026-01-27 15:46:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o21ilrc",
          "author": "AIScreen_Inc",
          "text": "For us at AIScreen the biggest edge came from automating the boring internal stuff, not marketing. Onboarding, device setup, content publishing and basic support workflows got streamlined early which let us move faster without burning the team out. The advantage wasn’t flashy automation it was removing friction everywhere.",
          "score": 1,
          "created_utc": "2026-01-27 16:32:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o22fy82",
          "author": "SendPotionDotCom",
          "text": "Zapier with video generation",
          "score": 1,
          "created_utc": "2026-01-27 18:55:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o23ohw8",
          "author": "Minimum-Box5103",
          "text": "Speed to lead systems. We built one for a wrap shop and it has helped generate up to $180k in revenue for them since they started using it last August. We have a whole case study on it.",
          "score": 1,
          "created_utc": "2026-01-27 22:14:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o24cm4p",
          "author": "commentShark",
          "text": "Helping with engagement and comment moderation for sure",
          "score": 1,
          "created_utc": "2026-01-28 00:14:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o24udz2",
          "author": "Electronic-Cat185",
          "text": "for me the edge usually comes from boring internal automations not flashy ones. stufff like automaticallly turning customer feeedback into tasks or flags so issues get handled before they escalate. it does not look impressive from the outside but it shortens response time a lot. that speed compounds and customers notice even if they cannnot name why. most competitors falll behind because humans are doing glue work instead of decisions.",
          "score": 1,
          "created_utc": "2026-01-28 01:46:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ioqc9",
          "author": "ChimpKey-Automation",
          "text": "ChimpKey, hands down. It automates all hand-entered PDF invoices, bills and orders. ChimpKey reads your PDF directly from your email and auto-enters it right into what ever system you want within 30 seconds and with 100% accuracy.  You can get started in as little as one day.",
          "score": 1,
          "created_utc": "2026-01-30 01:08:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2zigil",
          "author": "Patient_Hippo_3328",
          "text": "Not a fancy automation, but removing friction helped me a lot. PDFs used to slow me down (singing, merging, fixing files), so I just use simple browser based pdf tool instead of overengineering it. I've used pdf guru a couple of times, not automation, but it keeps things moving.",
          "score": 1,
          "created_utc": "2026-02-01 15:45:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o33x718",
          "author": "Physical-Plane7648",
          "text": "my business hasnt scaled enough to automate, however the first i will automate is b2b targetted client outreach on linked.",
          "score": 1,
          "created_utc": "2026-02-02 05:36:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o35hzt9",
          "author": "Parth_0001Win",
          "text": "I think the biggest edge from automation isn’t doing more , it’s removing friction from things that shouldn’t require thinking.\n\nThe automations that actually help are usually unsexy ones: follow-ups that don’t get forgotten, data moving between tools without manual copying, reminders surfacing at the right time, basic reporting that doesn’t require rebuilding every week.\n\nWhen those background tasks are handled, people can focus on judgment, relationships, and decisions the parts that actually differentiate a business.\n\nFully automated doesn’t always mean cheaper either. Often it just means more consistent, less error-prone, and easier to scale without burning people out.",
          "score": 1,
          "created_utc": "2026-02-02 13:34:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o38ot3r",
          "author": "dmc-123",
          "text": "Many automations focus on middle and back-office operations. Because of this, it can be difficult to assign an exact dollar amount to the automation at the outset. Also, most of the time, the efficiency does not mean someone loses their job, they are just asked to complete other processes. This can be measured by assessing organizational growth, but payroll typically remains the same.",
          "score": 1,
          "created_utc": "2026-02-02 22:44:07",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qtqt6k",
      "title": "What automation you copied from Reddit actually worked?",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qtqt6k/what_automation_you_copied_from_reddit_actually/",
      "author": "Vivid-Aide158",
      "created_utc": "2026-02-02 09:48:23",
      "score": 59,
      "num_comments": 12,
      "upvote_ratio": 0.98,
      "text": "As someone who has been following this channel for quite a bit, I constantly see people posting and sharing automations! Most of the time I have not been able to have the time to actually run or test them.\n\nSo for people who actually tested some of these, what automation you copied from Reddit actually worked? Genuinely curious! ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qtqt6k/what_automation_you_copied_from_reddit_actually/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "o34pjvl",
          "author": "Ava_Yuna",
          "text": "Ah there is definitely one that I copied for our Shopify store that really worked out pretty well! So recently someone had shared how their dental practice was often getting mentioned by ChatGPT and Google AI overview after they automated the process of looking at their google data, finding out questions their customers were searching for on Google and then automatically publish blogs on their website answering those exact questions using AI tools like Frizerly! This honestly felt like would not worked, but has actually given us similar results!\n\nI guess it really depends on how competitive your industry is! We dint really have big competitors in our field doing! So we very quickly became the top results for almost every question! Our website is also pretty old, so that probably helped with authority as well! I am curious to understand how this would work out as everyone adopts these automation- at that point its probably a war between AIs and the best AI wins probably haha!",
          "score": 18,
          "created_utc": "2026-02-02 09:53:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o34xkju",
              "author": "Boogooooooo",
              "text": "This is wild. Imagine how harder it will be to do that in 5 years when it becomes a common knowledge ",
              "score": 1,
              "created_utc": "2026-02-02 11:08:07",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o354kld",
                  "author": "WhyWontThisWork",
                  "text": "How did they do that? Are the blog posts accurate?",
                  "score": 1,
                  "created_utc": "2026-02-02 12:05:30",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o363ts6",
              "author": "ConversationDue6236",
              "text": "Very interesting!",
              "score": 1,
              "created_utc": "2026-02-02 15:29:42",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o36jyjt",
          "author": "Major-Competition527",
          "text": "There's a lot of workflow tools that have been popping up. I'm still experimenting w a few on chatgpt. I tried the n8n thing but the UI is personally very confusing.",
          "score": 1,
          "created_utc": "2026-02-02 16:44:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o37he02",
          "author": "AutomationPartner",
          "text": "I find it very hard to get a big win off of someone else's idea. Usually big automation needs are very particular to the business you're in and each company comes with its own challenges. \n\nThat being said, one of the small ones that made a big difference in my day was a automation that sits in a user feedback Slack channel and when I @ it it makes a JIRA ticket for me with the Slack channel linked and a summary of the conversation. It actually made making JIRA tickets for for once.",
          "score": 1,
          "created_utc": "2026-02-02 19:17:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o38qo0i",
          "author": "Exotic-Ad-2169",
          "text": "reading about automation and actually implementing it are two different beasts. most of the \"life-changing\" workflows people post are either solving problems you don't have or require way more maintenance than they admit.",
          "score": 1,
          "created_utc": "2026-02-02 22:53:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o39f2c4",
          "author": "ChimpKey-Automation",
          "text": "ChimpKey works perfectly. And money back after 3 weeks if you aren't happy. ChatGPT it and find out what the details are.",
          "score": 1,
          "created_utc": "2026-02-03 01:06:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o35g29k",
          "author": "GetNachoNacho",
          "text": "Honestly, the ones that stick are usually small, repeatable tasks, like auto-filling forms, scheduling posts, or renaming files. Anything that’s simple to test tends to work; the big “all-in-one” automations often break or need tweaking.",
          "score": 0,
          "created_utc": "2026-02-02 13:23:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o34ozvd",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 0,
          "created_utc": "2026-02-02 09:48:24",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qpchvc",
      "title": "which ai automation tools are people actually using day to day?",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qpchvc/which_ai_automation_tools_are_people_actually/",
      "author": "TaraFranklinq",
      "created_utc": "2026-01-28 14:15:21",
      "score": 40,
      "num_comments": 23,
      "upvote_ratio": 1.0,
      "text": "It feels like every company is claiming to be the “best ai tool” for automation right now… what i’m struggling with is figuring out which ones are actually being used beyond pilots and experiments.\n\nA lot of tools sound great until you try to run them on real devices or hand them off to a team that didn’t build them. From a QA perspective, reliability matters more than novelty (I’d rather use something boring that runs consistently than something flashy that needs constant tweaking)\n\nWe’ve tested a few different approaches, including tools like askui that focus on interacting with the UI more like a human would instead of relying purely on selectors. It helped in some of the messier flows, but it also made it obvious how much variability there still is in real-world interfaces.\n\nfor anyone who’s rolled out ai-based automation, which tools actually stuck and made it into your day-to-day? honest experiences only.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qpchvc/which_ai_automation_tools_are_people_actually/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "o287ta1",
          "author": "Lazy-chameleon",
          "text": "Well, yes.. most of these AI tools sound great in pilot projects, but once you try to use them day-to-day, things get tricky. There’s no one-size-fits-all solution, so it’s important to try and test different options. Sometimes it’s better to spend a bit more time and money experimenting with different tools and pick the one that actually works for your team, instead of just going with the most common tool or a friend’s (or community) recommendation.",
          "score": 6,
          "created_utc": "2026-01-28 15:22:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o284c53",
          "author": "gavinwiener",
          "text": "For me: \n\n- Claude for copywriting\n- ChatGPT (my default for straight forward logical stuff like generate custom CSS, code)\n- I want to start using Manus more because it seems better for doing agentic things like parsing a website",
          "score": 3,
          "created_utc": "2026-01-28 15:06:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2817rw",
          "author": "Own-Claim-6577",
          "text": "Just basic LLM’s for email drafting/tone setting, and code generation. All of these agents and ai implementations fall very short from what I have seen.",
          "score": 2,
          "created_utc": "2026-01-28 14:51:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o286nnz",
          "author": "Sammelbourne9813",
          "text": "Without knowing your use case, general recommendation would be n8n for no code automation.\nBut Python is the ultimate tool if deployed sensibly",
          "score": 2,
          "created_utc": "2026-01-28 15:16:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o27u1m9",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-28 14:15:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o283ygs",
          "author": "GetNachoNacho",
          "text": "The tools that actually stick tend to be the ones solving real pains reliably: Zapier/Make for workflows, GPT‑powered assistants for writing and summarization, RPA tools (like UI automation) when reliability is the priority. Flashy AI demos are fun, but if a tool can’t run consistently in the wild with your team’s workflows, it usually gets dropped fast.",
          "score": 1,
          "created_utc": "2026-01-28 15:04:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o285giz",
          "author": "MulberryVarious7539",
          "text": "i would suggest n8n it is an really good platform which you can use",
          "score": 1,
          "created_utc": "2026-01-28 15:11:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o28a5ue",
          "author": "iamclarenz",
          "text": "I see that too. Lots of flashy tools die fast once you try them for real. In my case the ones that stuck were simple, reliable ones that just worked consistently. And having steady, affordable compute from platforms like Argentum made running heavier automation workflows actually feasible day to day.",
          "score": 1,
          "created_utc": "2026-01-28 15:32:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o29m36g",
          "author": "Exciting_Trouble7819",
          "text": "Boring wins in production:\n\n\n\nWorkflows: n8n or Make - they just work\n\nData extraction: simple Python scripts with GPT API (cheaper + more control than fancy platforms)\n\nDocument processing: plain OCR + GPT for cleanup beats most \"AI document tools\"\n\n\n\nFancy UI automation tools break on every update. Reliability > flashy demos when you're billing clients.",
          "score": 1,
          "created_utc": "2026-01-28 18:59:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2aa9gg",
          "author": "Odd_Incident_5094",
          "text": "In our experience, the tools that actually make it into day-to-day use are usually the ones that:\n\n1. Require minimal maintenance once deployed\n2. Integrate cleanly with existing workflows and tools\n3. Don’t force users to think like engineers just to make them work",
          "score": 1,
          "created_utc": "2026-01-28 20:47:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2bj64s",
          "author": "gptbuilder_marc",
          "text": "That line is the crux. There’s a big difference between tools that demo well and ones that survive real handoff and day to day use. When you say “day to day,” who actually owns these automations, engineering, QA, or ops? And are they breaking because the UI keeps shifting, or because the tools need constant babysitting?",
          "score": 1,
          "created_utc": "2026-01-29 00:19:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2bss7t",
          "author": "kevinallen2018",
          "text": "N8n is easy to use, setup and have a lot of resource that you can learn from YouTube. Also it has integration with almost all of the platforms from google to openAI, telegram, notion, supabase and more. It is a good point to start",
          "score": 1,
          "created_utc": "2026-01-29 01:10:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2c58hm",
          "author": "SystemicCharles",
          "text": "If you want to build an automation that will work and survive in a real production environments, you just stay away from no-code and low-code tools. Especially if it's going to be used by multiple people (multi-tenant). Use an event-driven orchestration engine if you don't want to code everywhere completely from scratch.",
          "score": 1,
          "created_utc": "2026-01-29 02:19:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2crjax",
          "author": "Beneficial-Panda-640",
          "text": "What I see stick long term is almost always the boring stuff that degrades gracefully. Teams keep the parts that are deterministic and predictable, then layer AI very narrowly where humans were already doing judgment calls or cleanup work.\n\nMost pilots fail at handoff, not capability. If the automation only works for the people who built it, it never survives contact with ops, QA, or audits. The tools that last are the ones where failure modes are obvious, logs are readable, and someone non technical can tell what went wrong without guessing. Novelty gets attention, but reliability is what earns a place in day to day workflows.",
          "score": 1,
          "created_utc": "2026-01-29 04:29:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2jjgoh",
          "author": "Artistic-Income-552",
          "text": "Along with ChatGPT, Grmini, Perplexity I use Koala for writing and Make to create and post to socials using Blotato.",
          "score": 1,
          "created_utc": "2026-01-30 04:02:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ju1rx",
          "author": "Analytics-Maken",
          "text": "Most of them are just new APIs for AI models with a little bit of fine tuning, and they break because of a lack of context memory, scalability, and unclear scopes. That said, I find it really useful MCP servers from ETL platforms like Windsor.ai after a classic ETL workflow: consolidating the business sources, cleaning the data, and transforming it, you can run AI tools like Claude or ChatGPT to generate analysis, insigths and automatic reports.",
          "score": 1,
          "created_utc": "2026-01-30 05:10:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o34gxwi",
          "author": "kckrish98",
          "text": "  \nfrom what I’ve seen, the tools that last are the ones that reduce effort without hiding what’s happening. We focused on automating flows users actually care about and running them consistently. Using Repeato helped because it was easy to see what the test was doing and update it when behavior changed, which kept automation useful instead of noisy",
          "score": 1,
          "created_utc": "2026-02-02 08:30:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o280vi5",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 0,
          "created_utc": "2026-01-28 14:49:31",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qq33in",
      "title": "What automation breaks first when you try to run it every day?",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qq33in/what_automation_breaks_first_when_you_try_to_run/",
      "author": "Beneficial-Cut6585",
      "created_utc": "2026-01-29 08:30:28",
      "score": 31,
      "num_comments": 12,
      "upvote_ratio": 1.0,
      "text": "Headline is the question.\n\nMost automations we’ve created work great at the beginning. Then you put them on a daily schedule and the cracks show up fast. A website changes a small thing. An auth flow expires. A script succeeds but returns partial data. Suddenly the automation is still “running” but the output is quietly wrong. You only notice weeks later when numbers stop making sense. Debugging after the fact is way harder than building the thing in the first place.\n\nFor me, the biggest pain point has always been anything that touches the web. Scraping, form filling, pulling data from dashboards. It is rarely the logic that fails, it is the environment. I started treating web interaction as infrastructure instead of just another step in the workflow. Using more controlled browser execution, including experimenting with tools like hyperbrowser, reduced a lot of silent failures because the behavior was more consistent run to run.\n\nCurious how others here think about resilience. Do you add more checks and alerts? Snapshot outputs and diff them? Or do you just accept that automations need regular babysitting once they leave the prototype stage?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qq33in/what_automation_breaks_first_when_you_try_to_run/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "o2dp6c6",
          "author": "AliMcheik_Ops",
          "text": "Silent failure is definitely the biggest killer. It’s easy to catch a crash; it’s a nightmare to catch a scraper that returns 'null' for 3 weeks because a <div> class changed name.\nI’ve started building 'Sanity Checks' directly into the workflow logic (I use n8n mostly) to handle this. Basically, I treat the data as 'guilty until proven innocent.'\nInstead of just checking 'Did the script finish?', I add a logic node at the end that asks:\n1. Is the payload size reasonable? (e.g., If I usually get 50 items and today I got 2, force a fail).\n2. Are critical fields populated? (If 'price' or 'date' is empty, don't write to the DB).\nI'd rather have the automation error out and stop running than pollute my database with partial/bad data that I have to clean up later.",
          "score": 3,
          "created_utc": "2026-01-29 09:01:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2dlv6e",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-29 08:30:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2dsoxz",
          "author": "Double_Try1322",
          "text": "For me it’s always auth and the web layer. Logins expire small UI changes break selectors and everything keeps 'running' with bad data. Logic almost never fails. What helped was adding basic sanity checks on outputs and treating web steps as fragile infra not just code. Without that you’re always debugging weeks too late.",
          "score": 1,
          "created_utc": "2026-01-29 09:35:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2f350j",
          "author": "ChestChance6126",
          "text": "silent failures from auth or data shape changes. the automation keeps running, but the output is wrong, and nobody notices. i trust simple output checks and alerts more than piling on extra logic.",
          "score": 1,
          "created_utc": "2026-01-29 14:48:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2gbjwg",
          "author": "Paul_on_redditt",
          "text": "For me it’s google sheet oauth. If you don’t set it up well, it breaks every week.",
          "score": 1,
          "created_utc": "2026-01-29 18:09:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2hls5r",
              "author": "FVMF1984",
              "text": "I’m wondering what your experience with this is. I’ve setup Google oauth for sheets and other stuff and has not broken so far. I’m using make (formerly Integromat) if that matters",
              "score": 1,
              "created_utc": "2026-01-29 21:45:59",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2hxkwe",
                  "author": "Paul_on_redditt",
                  "text": "It was last summer. I was almost a complete beginner. The company was using an n8n self host instance on their own servers (that was not set up properly 😅).\n\nGoogle api connexions are more annoying when you are self host. (You need to set up the server properly.)\n\nIn addition, it took me a long time to understand why the oauth token needed to be refresh in production after 7 days 😅. It was because the app was in test mode in the google cloud console",
                  "score": 1,
                  "created_utc": "2026-01-29 22:43:43",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2gj0q9",
          "author": "gptbuilder_marc",
          "text": "That line about it “technically working” is the scary part. That’s usually where trust quietly dies, not when something hard-fails. Curious if the bad runs are invisible because nobody’s watching outputs, or because everything reports green so nothing feels off until later.",
          "score": 1,
          "created_utc": "2026-01-29 18:42:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2iganv",
          "author": "techside_notes",
          "text": "For me it is usually the assumptions I forgot I made. Auth tokens expiring, field names changing slightly, or an API returning “success” with incomplete data. The automation keeps running so it feels fine until you actually look at the output. I have learned to treat validation as a first class step, even something simple like sanity checks or totals. It adds friction up front but saves a lot of quiet failure later.",
          "score": 1,
          "created_utc": "2026-01-30 00:23:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2wpdcr",
          "author": "Equivalent-Brain-234",
          "text": "I’ve been working on a tool that solves this exact issue by letting you describe the data you want and getting clean JSON back. If you want, I can show you how I’d extract this page.",
          "score": 1,
          "created_utc": "2026-02-01 03:17:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2xrmyc",
          "author": "Accurate-Ad-7944",
          "text": "Good, this is so real. We had a dashboard scraper that worked perfectly for months, then silently started returning last month's numbers because they added a \"loading spinner\" div that our script never waited for. Took us three weeks to notice the reports were stale.\n\nYour infrastructure approach is smart — I started doing something similar after one too of those midnight debugging sessions. Treating the browser layer as it's own unstable service that needs redundancy checks. What helped me was adding screenshot comparisons on failure states, and honestly? Eventually stumbled on Actionbook to handle the action manuals + DOM caching stuff, which cut down those \"element not found\" flakes by like 90%. Still fails sometimes, but now it's usually for real reasons, not just random noise.\n\nDo you snapshot your output data and diff it daily? I tried that but got alert fatigue from trivial formatting changes... still figuring out the balance between \"paranoid\" and \"usefully vigilant\".",
          "score": 1,
          "created_utc": "2026-02-01 08:09:49",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qq55cf",
      "title": "What is an automation that actually got 10x better due to AI & LLMs?",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qq55cf/what_is_an_automation_that_actually_got_10x/",
      "author": "StandardNecessary218",
      "created_utc": "2026-01-29 10:34:54",
      "score": 28,
      "num_comments": 13,
      "upvote_ratio": 0.96,
      "text": "Hi all- it feels like AI is kinda like automation on steroids! A lot of old automations seem to have gotten more sturdy, cheaper or better thanks to AI!\n\nSo from your experience, what is an automation that actually got 10x better due to AI & LLMs?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qq55cf/what_is_an_automation_that_actually_got_10x/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "o2e0e7m",
          "author": "No-Marionberry8257",
          "text": "Great question and I can think of many inside our organization:\n\n* Call transcriptions, insights & action items: How accurate customer calls are now transcribed and insights automatically extracted has massively improved! We have always used Gong for call recordings, but now we are able to automatically update CRM, create action items, update salesforce etc based on call data! We also have a centralized repo of customer info automatically created. We have used tools like Zapier and N8N to basically set this up\n* Daily Content Creation: We earlier used to hire freelancers on Upwork to analyze our Google data and come up with topics and content to write blogs on our website! Thanks to LLMs and AI tools like Frizerly, the whole process is now automated! It's able to look at Google analytics and automatically come up with both a strategy and content and post it directly on our website with content specifically trained on our product and case studies!\n* Translations: Again, before LLMs, we had to hire freelancers to translate content because we need most of our content in both english and French! Now we have an automation that auto translates all our content from English behind the scenes!\n\nFollowing to see what others have it going :)",
          "score": 8,
          "created_utc": "2026-01-29 10:44:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2e1qbh",
              "author": "OpportunityHappy3859",
              "text": "Very cool. May I ask, how big of a business this is?",
              "score": 0,
              "created_utc": "2026-01-29 10:55:56",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2fgq70",
                  "author": "ble1901",
                  "text": "It's a mid-sized tech company, about 200 employees. We've seen significant growth since implementing these AI-driven automations, especially in our sales and marketing teams!",
                  "score": 1,
                  "created_utc": "2026-01-29 15:51:00",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o2e4b2j",
              "author": "Some_SEO_Guy",
              "text": "Really cool. What tools are you using for content creation?",
              "score": 0,
              "created_utc": "2026-01-29 11:17:21",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2ejpnx",
          "author": "OneHunt5428",
          "text": "LLMs can actually understand intent now not just route based on keywords, so follow ups tagging, and prioritization feel way more human and accurate than old rule based automations.",
          "score": 1,
          "created_utc": "2026-01-29 13:05:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2f03mf",
          "author": "notTemka",
          "text": "Before LLMs it was basically rules/keywords and not too flexible, now you can classify intent, pull the right context (docs/order/account), and generate a usable response or route it correctly with way less maintenance. it's awesome!",
          "score": 1,
          "created_utc": "2026-01-29 14:33:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2fjbf8",
          "author": "Much_Pomegranate6272",
          "text": "Email responses and customer support routing got way better.\n\nBefore LLMs, auto-replies were rigid templates that barely made sense. Now you can have AI read incoming emails, understand context, draft personalized responses, and route to the right person based on actual content not just keywords.\n\nSame with chatbots - used to be garbage decision trees that frustrated people. Now they can actually understand what customers are asking and give useful answers instead of \"sorry I didn't understand that, please rephrase.\"\n\nData extraction from messy documents also got way easier. Before you needed perfect templates or regex hell. Now you just throw PDFs at an LLM and ask for specific fields in JSON. Works on varying formats without rewriting rules every time.\n\nReal improvement though is anything involving understanding unstructured text - summarizing, categorizing, extracting intent. That stuff was either impossible or required tons of manual work before. Now it's an API call.",
          "score": 1,
          "created_utc": "2026-01-29 16:02:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2hdfo5",
          "author": "UBIAI",
          "text": "Document data extraction and analysis. Before GenAI, automating this process required training a model for each document type and often broke down when documents didn’t follow the format it was trained on. Now, with tools powered by LLMs, the whole process is faster, smarter, and way more flexible.\n\nFor instance, platforms like kudra ai (affiliated) use AI to extract data from unstructured documents, think contracts, invoices, or even shipping manifests, and turn it into structured, searchable information in seconds. What’s cool is that the AI actually understands the context, so it works even if the document formatting is non-standard or the language is nuanced. Plus, you can build custom workflows to not just extract data but also analyze it, which saves a ton of time for industries like finance, logistics, and legal.\n\nSo yeah, I’d say document handling is one area that’s gone from “meh automation” to “crazy efficient” thanks to GenAI.",
          "score": 1,
          "created_utc": "2026-01-29 21:06:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ek9yv",
          "author": "firstLOL",
          "text": "I have found them useful for large scale extraction of data from PDFs - the tabular review model of applying the same prompt across hundreds or thousands of similar PDFs has revolutionised my ability to extract data from my work that is useful to me for market trends, data analysis, etc. While it would have been possible to set up an OCR-based PowerAutomate flow to do some of it, the ease of tweaking prompts versus setting up complex flows is immense.",
          "score": -5,
          "created_utc": "2026-01-29 13:08:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2e4y8r",
          "author": "SassFrog",
          "text": "Generative AI hasn't been helpful for anything besides bottom of the barrel marketing and recruiting. Transformers themselves are useful in discriminative AI (i.e. supervised ML) with things like BERT automating \"named entity recognition\" and classic NLP tasks. Diffusion has real world use-cases like forecasting, but classic ML models like CatBoost still dominate the space.\n\nEDIT: arxiv.org/abs/2502.12944",
          "score": -1,
          "created_utc": "2026-01-29 11:22:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2dzaxp",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 0,
          "created_utc": "2026-01-29 10:34:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2e1lgy",
          "author": "senpazi69",
          "text": "Facebook and twitter bots, including LLM would make the account last waay longer. Literally any good enough coder can generate passive income from facebook and twitter.",
          "score": -1,
          "created_utc": "2026-01-29 10:54:47",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qr0t1q",
      "title": "Burned my entire $20 Claude quota on ONE video. So I built my own prompt-to-video agent.",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qr0t1q/burned_my_entire_20_claude_quota_on_one_video_so/",
      "author": "BreakPuzzleheaded968",
      "created_utc": "2026-01-30 09:26:00",
      "score": 25,
      "num_comments": 25,
      "upvote_ratio": 0.79,
      "text": "So the Claude Code + Remotion skill went viral recently. I tried it out and honestly the video it made was pretty good. But I burned through my entire $20 monthly quota just generating one 2-minute video. Couldn't even go back and iterate on it without waiting for the next billing cycle.\n\nTried moving to VS Code to keep editing but the whole flow felt broken at that point.\n\nI got curious about how the whole thing actually works. Spent a few hours digging into Remotion, understanding how Claude was orchestrating everything, and ended up building my own agent that does something similar.\n\nBeen using it for the past few weeks to make explainer videos and product demos. Still rough around the edges but it works. I can actually iterate now without watching my credits disappear.\n\nI never really cracked motion graphics before this. Tried After Effects, tried Canva videos, tried a bunch of other tools. Nothing stuck. The Claude + Remotion combo was the first time I actually finished a video I was happy with. So when the credits ran out I just wanted to keep that going.\n\nAnyway, mostly posting to see if anyone else ran into the same quota problem or if people are even interested in prompt-to-video stuff outside of the Claude ecosystem. Curious what others are building.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qr0t1q/burned_my_entire_20_claude_quota_on_one_video_so/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "o2lgeu2",
          "author": "UnibikersDateMate",
          "text": "Any recommendations for researching issues like this? Resources to leverage? I’m attempting to familiarize myself but there’s so much content out there it’s hard to know where to start and actually find the information that’s relevant.",
          "score": 3,
          "created_utc": "2026-01-30 13:03:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2my401",
              "author": "BreakPuzzleheaded968",
              "text": "I actually search for relevant links on perplexity put them on claude or vscode copilot to analyse relevant contents. For example experimental projects works great with this method",
              "score": 1,
              "created_utc": "2026-01-30 17:21:02",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2korku",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 2,
          "created_utc": "2026-01-30 09:26:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2kvpgt",
          "author": "Economy-Mud-6626",
          "text": "wondering what's the quality as you're using 20$ plan...\n\nhappy to try it out if you mind sharing the tool",
          "score": 2,
          "created_utc": "2026-01-30 10:28:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2kw6zz",
              "author": "BreakPuzzleheaded968",
              "text": "The $20 plan gave decent quality but my tool is helping me not worry about the quota limit. I am still working on to improve on quality even further",
              "score": 1,
              "created_utc": "2026-01-30 10:33:12",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o2tih4g",
              "author": "Used-Call-3503",
              "text": "Same here",
              "score": 1,
              "created_utc": "2026-01-31 17:15:48",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2l9aaw",
          "author": "Beneficial-Panda-640",
          "text": "That’s awesome! It’s great that you took the initiative to build your own agent when the quota issue got in the way. The whole prompt-to-video space is definitely exciting, especially when you can iterate without worrying about burning through credits. I’m sure others have run into similar frustrations with limitations in systems like Claude, but your DIY solution might be a game-changer for more flexible workflows. Would love to see how your agent develops, and it’s interesting to think about expanding this beyond just the Claude ecosystem. Keep us posted!",
          "score": 2,
          "created_utc": "2026-01-30 12:16:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2li3do",
              "author": "BreakPuzzleheaded968",
              "text": "Thanks! Surely I will",
              "score": 2,
              "created_utc": "2026-01-30 13:12:55",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2ljhyv",
          "author": "Relative_Recording47",
          "text": "Wouldlove to check those video, and try out your tool someday.",
          "score": 2,
          "created_utc": "2026-01-30 13:20:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2my541",
              "author": "BreakPuzzleheaded968",
              "text": "Yes surely.",
              "score": 1,
              "created_utc": "2026-01-30 17:21:10",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2q4lze",
          "author": "TAS_Vietnam",
          "text": "The quota problem feels like a symptom of mixing “creative iteration” with “per-call billing.”\n\nFor things like motion graphics, you really want tight feedback loops, not a hard stop after one or two runs.\n\nCurious how you’re handling things like scene timing and layout now — are you letting the agent decide, or do you still tweak those parts manually?",
          "score": 2,
          "created_utc": "2026-01-31 02:56:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2kvg4v",
          "author": "Curious-Function-244",
          "text": "hey ... man i'm also trying to build in the same space..\n\nwould to checkout what you have build and would be great if you can share how you're solving the rendering issues..",
          "score": 1,
          "created_utc": "2026-01-30 10:26:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2kvrsh",
              "author": "Economy-Mud-6626",
              "text": "can you pls share yours as well i'm looking to subscribe one for my team",
              "score": 1,
              "created_utc": "2026-01-30 10:29:33",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o2kvx02",
              "author": "BreakPuzzleheaded968",
              "text": "Hey surely. I also came across the same issue. You need to compile the entire code into a static file which can be served and shown in a preview. There is remotion player available if you are using remotion",
              "score": 1,
              "created_utc": "2026-01-30 10:30:48",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2kvnyq",
          "author": "Important_Guava4335",
          "text": "blender with claude right ?",
          "score": 1,
          "created_utc": "2026-01-30 10:28:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2kw1oj",
              "author": "BreakPuzzleheaded968",
              "text": "No this is claude code with remotion i tried then built an app of my own which does the same",
              "score": 1,
              "created_utc": "2026-01-30 10:31:56",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2kvvvg",
          "author": "PublicAstronaut3711",
          "text": "so are able crack cost or prefect output?",
          "score": 1,
          "created_utc": "2026-01-30 10:30:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2kwajl",
              "author": "BreakPuzzleheaded968",
              "text": "Perfect output is subjective. I wanted something that could let me iterate without worrying about the cost",
              "score": 1,
              "created_utc": "2026-01-30 10:34:04",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2kwbdx",
          "author": "ContactCold1075",
          "text": "please share those explainer videos",
          "score": 1,
          "created_utc": "2026-01-30 10:34:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2kxta3",
              "author": "BreakPuzzleheaded968",
              "text": "Surely",
              "score": 1,
              "created_utc": "2026-01-30 10:47:10",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2kwko4",
          "author": "PensionPlastic2544",
          "text": "but i think output is not compareable to human craft. prove me wrong man :)",
          "score": 1,
          "created_utc": "2026-01-30 10:36:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2kxrsg",
              "author": "BreakPuzzleheaded968",
              "text": "Ya ya completely agreed. But as a motion professional you can use this tool to create small clips to embed into the video or you can also use it for ideating as well.",
              "score": 1,
              "created_utc": "2026-01-30 10:46:48",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2kxgk2",
          "author": "Suspicious-Rain-9964",
          "text": "Tool link please",
          "score": 1,
          "created_utc": "2026-01-30 10:44:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2kxu9d",
              "author": "BreakPuzzleheaded968",
              "text": "Sharing in a bit",
              "score": 1,
              "created_utc": "2026-01-30 10:47:23",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qocvhk",
      "title": "Best Zapier alternatives in 2026 that won't destroy your budget",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qocvhk/best_zapier_alternatives_in_2026_that_wont/",
      "author": "Ash_Skiller",
      "created_utc": "2026-01-27 12:46:07",
      "score": 19,
      "num_comments": 19,
      "upvote_ratio": 0.88,
      "text": "My Zapier bill hit $200/month and I finally snapped. Migrated everything over a weekend, here's what I'm using now and actual costs.\n\nn8n self-hosted runs most of my automations. Free aside from like $10/mo server costs. Learning curve exists but it's way more powerful than Zapier for anything complex. Make ($15/mo for me) handles the workflows I share with my VA since the interface is friendlier. Activepieces is free and covers my simpler stuff.\n\nThe AI automations (summarizing, categorizing, generating responses) I moved to vellum because Zapier's AI integrations were clunky and overpriced. Different tool but solved that specific problem way better.\n\nWent from $200/mo to about $25. Should have done this ages ago.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qocvhk/best_zapier_alternatives_in_2026_that_wont/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "o20cvzj",
          "author": "stKKd",
          "text": "Are you Zapier now?",
          "score": 8,
          "created_utc": "2026-01-27 13:11:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o20gecq",
          "author": "EndOfWorldBoredom",
          "text": "I used Ai to write all my zapier automations. Now I'm at $0/mo other than my webhost. ",
          "score": 2,
          "created_utc": "2026-01-27 13:30:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o20r1dv",
              "author": "gavinwiener",
              "text": "The only problem, and speaking as someone with a background in software development, if you're using actual code, it's typically much harder to maintain, monitor, and debug, than having an interface like Zapier. \n\nIt's just trade-offs.",
              "score": 4,
              "created_utc": "2026-01-27 14:26:00",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o214f65",
                  "author": "EndOfWorldBoredom",
                  "text": "Generally speaking, I completely agree with you. \n\n\nAnd, patching together two APIs shouldn't require a monthly subscription. That's arbitrage. ",
                  "score": 2,
                  "created_utc": "2026-01-27 15:30:16",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o2emob4",
              "author": "GenericSpaciesMaster",
              "text": "Which Ai from my experience they suck at workflows",
              "score": 1,
              "created_utc": "2026-01-29 13:22:23",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2enc70",
                  "author": "EndOfWorldBoredom",
                  "text": "Maybe my automations were simple, but it didn't take anything I'd even describe as a workflow. I told it I wanted to sync the data between x and y and it wrote me a script and the cron command to trigger it. I just had to enter the credentials.\n\n\nChatgpt and gemini were my main bots at the time. I use Claude for code a lot more now. ",
                  "score": 1,
                  "created_utc": "2026-01-29 13:26:02",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o22ccby",
          "author": "iantos",
          "text": "It looks like you've managed to patch it all up to about 5 different applications which is exactly why Zapier is better. It costs more for that exact reason. You can build all automations in one platform.\n\nYou've traded that for all the time you'll spend looking over the other 5 apps. I wouldn't say it's a super great win but it cuts the costs and that's okay too.",
          "score": 2,
          "created_utc": "2026-01-27 18:40:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o29q47d",
          "author": "fireflypower",
          "text": "New here. Just curious what kind of automations you ‘ve set up . For business? Or just personal use?",
          "score": 2,
          "created_utc": "2026-01-28 19:17:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o21i7kv",
          "author": "nobonesjones91",
          "text": "Next OP is going to tell us about this crazy new tool called ChatGPT",
          "score": 3,
          "created_utc": "2026-01-27 16:30:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o208rp5",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-27 12:46:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o20bd3e",
          "author": "Key-Hair7591",
          "text": "Duh…. Sorry, couldn’t help myself…. 😂😂😂 \n\n(Totally kidding btw)",
          "score": 1,
          "created_utc": "2026-01-27 13:02:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o210jw6",
          "author": "RepresentativeCup123",
          "text": "is that better than n8n?",
          "score": 1,
          "created_utc": "2026-01-27 15:12:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o25tt20",
          "author": "Analytics-Maken",
          "text": "High cost stems from running multiple general automations across various automation tools, which also leads to fragmented maintenance. Zapier charges per task volume without optimizing for API limits or data transfer efficiency. Switch to specialized ETL pipelines, such as Windsor.ai, that use incremental loads to avoid full refreshes and hit API limits less often.",
          "score": 1,
          "created_utc": "2026-01-28 05:07:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o25tvde",
          "author": "meshane",
          "text": "Congrats on the n8n switch! For others reading this: if n8n feels too technical, I built a managed service as a middle ground - Zapier's versatility at $39/month instead of $193/month. Free migration service so you don't have to rebuild everything from scratch. Still validating if this is a real need - happy to chat if anyone's interested.",
          "score": 1,
          "created_utc": "2026-01-28 05:08:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o20nrrf",
          "author": "WorkLoopie",
          "text": "We offer something called a Loop, it’s for clients that are enterprise tiers of make, zapier, or n8n and paying thousands for automation they don’t touch. We cut their bills in half. So if you’d like dm me, might be a fit.",
          "score": 0,
          "created_utc": "2026-01-27 14:09:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o22e0uq",
          "author": "interpretpunit",
          "text": "10usd per month is too high for self hosted n8n tbh. Just set up a free for life Oracle cloud server.",
          "score": -1,
          "created_utc": "2026-01-27 18:47:09",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qog031",
      "title": "New job has 2000 selenium tests and im supposed to maintain them alone",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qog031/new_job_has_2000_selenium_tests_and_im_supposed/",
      "author": "Dazzling-Policy-4549",
      "created_utc": "2026-01-27 14:54:24",
      "score": 18,
      "num_comments": 12,
      "upvote_ratio": 1.0,
      "text": "I just accepted an offer thinking it would be a step up. arrived monday and found out the previous qa person quit 4 months ago and nobody touched the tests since\n\nTwo thousand tests. selenium. half of them red in the last run. no documentation. the guy who wrote most of them is gone\n\nMy manager casually mentioned they want me to \"get the suite healthy\" while also writing tests for new features. im one person 😭\n\nAnyone inherited a disaster like this before. do i try to fix everything or just burn it down and start over. genuinely don't know where to begin.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qog031/new_job_has_2000_selenium_tests_and_im_supposed/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "o21qntg",
          "author": "Acrobatic-Bake3344",
          "text": "been there. twice actually lol\n\ndont try to fix everything thats a trap. pull failure data from the last 30 days and find which tests fail most often. guarantee like 20% of tests cause 80% of the pain. quarantine those first\n\nalso have an honest convo with your manager about expectations. \"get the suite healthy\" is not a deadline its a vibe. you need actual priorities",
          "score": 39,
          "created_utc": "2026-01-27 17:07:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2240qh",
              "author": "Clustermonger",
              "text": "best reply so far",
              "score": 2,
              "created_utc": "2026-01-27 18:04:52",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o22cgqc",
          "author": "joshuuuuuua",
          "text": "My dude, I’m sorry but you don’t have a manager rn, so you’re going to have to manage up. But it’s also an opportunity \n\nDocument everything in detail and email it to the boss. That way you’re creating your own baseline. Any improvement is a plus here. \n\nThen have a sit down meeting where you bring a brief overview with what you think you can accomplish. Whatever that is, cut it in half. You think you can fix worst 20% in three weeks? Give yourself 6 weeks. Whatever.\n\nDoes this guy understand the value of these tests? Find an easy metric that shows how you add to conversion / retention. \n\nThis person is busy so keep the initial meeting short. Max 45 min. 20 if you can possibly manage it. \n\nJust show progress and you’ll look like a god.",
          "score": 4,
          "created_utc": "2026-01-27 18:40:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o20wt4l",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-27 14:54:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o23jb9q",
          "author": "AdhesivenessEven7287",
          "text": "Wow. Good luck. I'm just starting selenium this weekend. Got any tips/tricks?",
          "score": 1,
          "created_utc": "2026-01-27 21:50:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o248fxg",
          "author": "Bubbly_Possible9057",
          "text": "Almost every job I've had is like that. You walk into a mess, you tidy it, you move on, having brought order to a world of chaos.\n\nThen the next guy fucks it all up and quits in a month.",
          "score": 1,
          "created_utc": "2026-01-27 23:53:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o24w95g",
          "author": "DrangleDingus",
          "text": "Yeah I’m confused. Why don’t you just feed all that human code slop to Claude, have the AI sort it all out?",
          "score": 1,
          "created_utc": "2026-01-28 01:56:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o259do7",
          "author": "Beneficial-Panda-640",
          "text": "I have seen this a few times and the fastest way to drown is to treat it like “make 2000 tests green.” I would reframe it as “make test signals trustworthy again,” then triage hard.\n\nStart by running them in chunks and tagging failures by cause. Broken locators, environment data, timing flake, app changes, and truly valid bugs. You will usually find a small set of root causes creates most of the red. Fixing those gives you leverage. Then identify the 50 to 200 tests that cover the highest value paths and make those stable first. Everything else becomes backlog until proven useful.\n\nAlso, set expectations with your manager early. “Healthy” needs a definition, like X percent pass rate on a smoke suite that gates releases, not perfection across 2000 scripts. If they insist on everything, ask what you should stop doing to make room. That forces the tradeoff into the open.",
          "score": 1,
          "created_utc": "2026-01-28 03:05:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o27i3hc",
          "author": "Substantial_Bid110",
          "text": "oof 2000 selenium tests with no docs is actually my nightmare scenario one thing that helped my old team was migrating the most critical tests to something more stable first instead of trying to fix selenium. we moved maybe 50 tests to momentic and just deleted the broken selenium ones covering the same flows. way less maintenance after that but yeah definitely audit before you do anything. no point saving tests that dont even catch real bugs",
          "score": 1,
          "created_utc": "2026-01-28 13:11:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2p2l8m",
          "author": "new_stuff_builder",
          "text": "claude code is the answer ;)",
          "score": 1,
          "created_utc": "2026-01-30 23:19:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2rbqef",
          "author": "DepthAggravating3293",
          "text": "What type of qa testing are you using Selenium for?  A11y?",
          "score": 1,
          "created_utc": "2026-01-31 08:27:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o22bf8m",
          "author": "Hofi2010",
          "text": "Thanks for GenAI. Get Claude code, kilo code or similar",
          "score": 1,
          "created_utc": "2026-01-27 18:36:14",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qs4n3o",
      "title": "Partner wants 50% equity just for distribution. Walk away or take the deal?",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qs4n3o/partner_wants_50_equity_just_for_distribution/",
      "author": "Chillipepper19",
      "created_utc": "2026-01-31 15:04:21",
      "score": 16,
      "num_comments": 32,
      "upvote_ratio": 1.0,
      "text": "Hi everyone, I’m 21M, currently a 3rd-year college student. I started a tech agency a year ago instead of sitting for placements.\n\n**The Situation:** I have the tech stack, the IP, and a proven model. We are projected to do \\~50-60L ($60k–$70k) in revenue this year with about 30 high-paying clients. I have a small sales team across India and the US, but our bottleneck is scale.\n\n**The Deal:** I have an opportunity to partner with a larger company that dominates distribution in my niche. They want 50% economical ownership of my company. In exchange, I get immediate access to their massive network and distribution channels.\n\n**The Dilemma:**\n\n1. **The Upside:** We could grow exponentially faster using their network.\n2. **The Downside:** I lose 50% equity and control. If I say no, they might become a direct competitor.\n3. **The Trust Issue:** My co-founder and family do not trust this partner. My gut says the distribution is worth it, but their instincts are making me hesitate.\n\n**The Question:** Is it worth giving up 50% equity for guaranteed distribution? Or should I grind it out independently with my own sales team (slower growth, 100% control) and risk fighting them as a competitor?\n\nHas anyone here taken a 50/50 distribution deal, and did you regret it?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qs4n3o/partner_wants_50_equity_just_for_distribution/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "o2st8ft",
          "author": "tzt1324",
          "text": "Don't do it. It sounds like you are being taken advantage of. \n\nIf you don't want to cash out now and lose your business, don't do it",
          "score": 8,
          "created_utc": "2026-01-31 15:13:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2t43a3",
              "author": "Chillipepper19",
              "text": "He’s ready to give me 25% of his company but that just sounds like hiring",
              "score": 3,
              "created_utc": "2026-01-31 16:06:57",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2xmvxo",
                  "author": "Space__Whiskey",
                  "text": "just run it the way you are running it for a while. Consider them a competitor now and block them out.  \nYou will be happier if you keep control, don't worry about massive growth, just pretend like you are interested in it. Let them offer to buy you out but don't let them see your books.",
                  "score": 2,
                  "created_utc": "2026-02-01 07:26:21",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2sxoig",
          "author": "FinancialMoney6969",
          "text": "Keep ownership. What you’ve accomplished is incredibly impressive. Depending on how replicable your business is, I would keep it, then find the right mentor, VC or business partner to bring in with a massive network of their own. One person can change your life, find that person imo, keep ownership",
          "score": 4,
          "created_utc": "2026-01-31 15:35:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2t4drl",
              "author": "Chillipepper19",
              "text": "Yeah that’s not a bad idea",
              "score": 1,
              "created_utc": "2026-01-31 16:08:23",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2tcow0",
                  "author": "FinancialMoney6969",
                  "text": "Research Clawdbot, the gap is closing every day. Someone can duplicate your niche if you aren’t careful. Be careful who you tell an idea that can execute it better than yourself",
                  "score": 1,
                  "created_utc": "2026-01-31 16:48:02",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o2t4kzm",
              "author": "Chillipepper19",
              "text": "The model is insanely insanely scalable that’s why my projections are so high. Could possibly get funded but I don’t have the network",
              "score": 1,
              "created_utc": "2026-01-31 16:09:21",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2ur254",
                  "author": "koojlauj11",
                  "text": "You should check Helpbank Simon Squibb’s community. Join and check other community groups. 50% sounds like a lot and if your partner has been trustworthy, I would trust him. You should look at other options before settling.\n\nIs there anyway you could consult with someone  else who has a network that is worth less than 50% equity of your company? You said you have a proven scalable method. Anyway, you could interest them in a smaller portion of equity or another type of shareholder value to your company with different rights…even looking at possible different terms of that with lower ownership equity amount…\n\nJust some solutions from a quick review with Claude:\n\nAlternative Structures to Explore\nDon’t accept their first offer. Here are better frameworks:\n1. Revenue Share Partnership (No Equity)\n\t∙\tThey get 20-30% of revenue from clients they source\n\t∙\tYou retain 100% equity and control\n\t∙\tTime-bound agreement (2-3 years) with performance milestones\n\t∙\tLower risk, maintains optionality\n\n2. Tiered Equity with Vesting\n\t∙\tStart with 20% equity tied to performance milestones\n\t∙\tEarn up to 50% only if they deliver X revenue over Y timeframe\n\t∙\tIncludes buyback provisions if relationship fails\n\t∙\tProtects you from giving equity for empty promises\n\n3. Strategic Investment Model\n\t∙\tThey invest capital at a fair valuation for 25-30% equity\n\t∙\tYou use capital to build your own distribution team\n\t∙\tThey provide intros/network access without operational control\n\t∙\tCleaner cap table, maintains your control\n\n4. Joint Venture Structure\n\t∙\tCreate a separate entity for the partnership (60/40 or 70/30 in your favor)\n\t∙\tYour tech company remains independent\n\t∙\tJV licenses your IP, they contribute distribution\n\t∙\tLimits downside, protects your core asset\n\nMy Recommendation: Structured Counter-Proposal\n\nStep 1: Test Their Commitment\nPropose a 90-day pilot partnership:\n\t∙\tNo equity exchanged\n\t∙\tThey source clients, you deliver service\n\t∙\tRevenue split: 70/30 (you/them) on pilot clients\n\t∙\tBoth parties evaluate fit before discussing equity\nThis reveals:\n\t∙\tWhether their distribution is real or overhyped\n\t∙\tHow they operate as partners\n\t∙\tWhether the relationship has cultural fit\n\nStep 2: Negotiate from Data\nIf pilot works, come back with:\n\t∙\t25% equity (not 50%) with 4-year vesting tied to revenue milestones\n\t∙\tProtective provisions: Board seat, drag-along rights, IP protection clauses\n\t∙\tBuyback option: If they don’t hit milestones, you can repurchase equity at predetermined valuation\n\t∙\tNon-compete agreement: They cannot build competing tech for X years\n\nStep 3: Build Alternatives Simultaneously\nWhile negotiating:\n\t∙\tInvest heavily in YOUR sales team and distribution\n\t∙\tExplore other potential distribution partners\n\t∙\tDocument your IP and consider defensive patents/trademarks\n\t∙\tBuild leverage by showing you don’t need them, you’re just open to acceleration",
                  "score": 1,
                  "created_utc": "2026-01-31 20:49:57",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2svij4",
          "author": "BigDyl89",
          "text": "Sounds predatory. Trust your gut. See if you can negotiate rev share vs equity. You can be aggressive on that front and it gets this closer to a 2 door decision.",
          "score": 2,
          "created_utc": "2026-01-31 15:25:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2t4b1f",
              "author": "Chillipepper19",
              "text": "I have no idea what my gut says. I just know that he knows something more than I do.",
              "score": 1,
              "created_utc": "2026-01-31 16:08:01",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2ti6py",
          "author": "Used-Call-3503",
          "text": "You could do a vesting schedule where they only get it after 4 years and you control decisions",
          "score": 2,
          "created_utc": "2026-01-31 17:14:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2w9q7c",
          "author": "startupdojo",
          "text": "49% is a maybe.  \n\n\nBecause they get something concrete from you - half your company - you need to ask for concrete things as well.  For example, ownership steps when you reach X, Y, Z revenue/metric via their distribution channel.  Don't just give up half for their promises and sweet talk.  ",
          "score": 2,
          "created_utc": "2026-02-01 01:43:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2srgos",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-31 15:04:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2stj0t",
          "author": "jwaiswa",
          "text": "Grind it out, once they realize you can move without them, they will come back with a better offer. ",
          "score": 1,
          "created_utc": "2026-01-31 15:15:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2sz1uo",
          "author": "alvares169",
          "text": "Trust your gut or be eaten.",
          "score": 1,
          "created_utc": "2026-01-31 15:42:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2sz5ap",
          "author": "YInYangSin99",
          "text": "Depends on his value, but the biggest problem is that individual can start to become the “face” of the project. I’d walk and hire college kids on 1099 and pay them cash bonuses as spiff’s even if they don’t convert periodically to keep them engaged. You can write that off as a gift and not pay tax on it.",
          "score": 1,
          "created_utc": "2026-01-31 15:43:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2t4pe5",
              "author": "Chillipepper19",
              "text": "That would just be cold outreach with much lesser conversions",
              "score": 1,
              "created_utc": "2026-01-31 16:09:56",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2t5u4f",
                  "author": "YInYangSin99",
                  "text": "Yes it would. And you would have 100% of the company equity. I’m not sure if you’ve ever done sales before but I’ve done it for 20 years and if you’re able to get face-to-face with somebody, the average closing percentage is about 50% now I don’t know what the product is, or who the consumer base is whether it’s a business person or a business to a business to a person, but I can tell you this. If he’s not Mark Cuban on one of the other dudes on Shark Tank that’s a bad deal. You can automate your marketing w/ n8n and/or Notion for less than $15 a month including blogs, a calendar, todo lists, all centralized. The only thing I would say would be valuable in this circumstance that I don’t have enough details on in all fairness, is who that person is and who he knows. If he has a network with the second and third level contacts that have money and reputation, that’s a different story. 50% under any circumstances unacceptable because all it takes is a smart stock play and now he’s the owner of the company. I would say I only wanna give you 20, let him say no two times, and then break and say I’ll give you 30% with an extra 30% that profit of sales. He walks away, feeling like he won. You walk away happy with a network and somebody who knows what they’re doing.",
                  "score": 1,
                  "created_utc": "2026-01-31 16:15:22",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2szknx",
          "author": "Grow4th",
          "text": "No ownership, go with revenue split.",
          "score": 1,
          "created_utc": "2026-01-31 15:45:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2sznfr",
          "author": "kammo434",
          "text": "Don’t do 50% equity. That’s fucking nuts. DOA. Rev split. \n\nThe person is insane for taking 50% of your company. AND they aren’t guaranteeing sales …",
          "score": 1,
          "created_utc": "2026-01-31 15:45:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2t1fea",
          "author": "pro1710",
          "text": "Had the same issue. Easy for others to say don't take it. At the same time, hated the idea of last stage participants taking half of an established product...",
          "score": 1,
          "created_utc": "2026-01-31 15:54:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2t4qqe",
              "author": "Chillipepper19",
              "text": "What’d you do about it ?",
              "score": 1,
              "created_utc": "2026-01-31 16:10:08",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2t3e1m",
          "author": "MammothRatio5446",
          "text": "It’s a negotiation. What’s a counter offer just as one sided but in your favour? Try that and obviously be prepared to walk away and bootstrap it on your own.",
          "score": 1,
          "created_utc": "2026-01-31 16:03:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2t4u0d",
              "author": "Chillipepper19",
              "text": "That’s the issue, I don’t have any real leverage",
              "score": 1,
              "created_utc": "2026-01-31 16:10:34",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2t52kl",
                  "author": "MammothRatio5446",
                  "text": "What’s the ideal package you’d accept",
                  "score": 1,
                  "created_utc": "2026-01-31 16:11:42",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2tefok",
          "author": "smeaton1724",
          "text": "Revenue split only.",
          "score": 1,
          "created_utc": "2026-01-31 16:56:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2u5x77",
          "author": "loud-spider",
          "text": "You've gotten as far as you have as quickly as you have because of what you're currently doing. The longer you push the bigger you get the bigger a deal they'd have to offer you.  You're a nascent threat right now that they're trying to neutralise by 'partnering' with you. They'll still be there if you get bigger on your own.\n\nEven Apple at it's deal shittiest doesn't make people pay 50%.  \n\nPass.",
          "score": 1,
          "created_utc": "2026-01-31 19:06:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2vz65l",
          "author": "Electronic-Cat185",
          "text": "this feels risky especiallly at your stage. distribution is valuable but fiffty percent is a huge price when you already have traction and a working model. i have seen deals like this lock founders into bad dynamics where growth happpens but control slowly disappears. the fact that your co founder and family feel uneasy is worth paying atttention to. competition risk is real but giving up half the company to avoiid a maybe competitor often costs more long term. i would only consider it if there were strong protectiions and a clear exit if the partnership goes sideways.",
          "score": 1,
          "created_utc": "2026-02-01 00:41:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2xge5u",
          "author": "ralphiooo0",
          "text": " No cash ? Tell him he’s joking",
          "score": 1,
          "created_utc": "2026-02-01 06:29:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2yknzs",
          "author": "robauto-dot-ai",
          "text": "Counter with an offer that feels good to you and get a lawyer to do the agreement. ",
          "score": 1,
          "created_utc": "2026-02-01 12:29:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o30mz5k",
          "author": "parkerauk",
          "text": "Distribution does not mean sales. They are \"closing you down\". Renegotiate for them to want to sell your tech. Create an incentive with a full buy out option. Last thing you need is being wedded to a ball and chain.",
          "score": 1,
          "created_utc": "2026-02-01 18:49:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o32arxg",
          "author": "Turbulent_Run3775",
          "text": "Distribution doesn’t guarantee sales, also just because they have a major network, do you have the capacity and infrastructure to handle 100 clients now if push comes to shove?\n\nI’d say no to the offer or negotiate back and keep scaling steadily as you’re doing now with your 30 clients. \n\nGiving 50% away is not the solution",
          "score": 1,
          "created_utc": "2026-02-01 23:45:56",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qosf4c",
      "title": "Manual first, automation second",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qosf4c/manual_first_automation_second/",
      "author": "Solid_Play416",
      "created_utc": "2026-01-27 22:12:05",
      "score": 11,
      "num_comments": 9,
      "upvote_ratio": 1.0,
      "text": "I’ve noticed automation only works well for things I already do cleanly by hand.\n\nMessy process → automated mess.\n\nDo you always stabilize a workflow manually first?  \nOr have you seen automation *force* clarity instea",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qosf4c/manual_first_automation_second/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "o23o2pl",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-27 22:12:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o25kmfx",
          "author": "MrJezza-",
          "text": "Automation absolutely can force clarity sometimes. Like when you try to build it and realize \"wait I have no idea what the actual steps are\" so you're forced to figure it out",
          "score": 1,
          "created_utc": "2026-01-28 04:09:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o25xkg0",
          "author": "selvamTech",
          "text": "I tend to do automation early, and over-engineer. But when it works, it works great.",
          "score": 1,
          "created_utc": "2026-01-28 05:34:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o26ddqt",
          "author": "HarisShah123",
          "text": "100% agree automation just amplifies whatever’s already there. I have seen it force clarity sometimes but only by breaking things and exposing the mess fast. Manual first usually saves a lot of pain",
          "score": 1,
          "created_utc": "2026-01-28 07:40:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o270k0n",
          "author": "Virtual_Past_1784",
          "text": "I totally agree, I usually make sure the process is clear manually first. Automating a messy workflow just multiplies errors. Sometimes automation helps highlight gaps, but it works best when the steps are already organized and consistent.",
          "score": 1,
          "created_utc": "2026-01-28 11:08:14",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qrjx2j",
      "title": "Looking for a tool / workflow to automate niche lead gen & compile relevant news",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qrjx2j/looking_for_a_tool_workflow_to_automate_niche/",
      "author": "PM_ME_PITCH_DECKS",
      "created_utc": "2026-01-30 22:16:46",
      "score": 10,
      "num_comments": 13,
      "upvote_ratio": 1.0,
      "text": "I’m looking for a tool that can help me find relevant leads based on an AI prompt. Preferably an out of the box solution, but if it doesn’t exist I’d like to hear suggested workflows\n\nCurrent LLMs do an okay job at finding relevant sources, but they kinda suck at being time-sensitive or finding anything under-the-radar. The ones I’ve tried also don’t allow me to feed them custom links for websites that prioritize\n\nI have a bunch of websites I monitor manually, so ideally I’d just want a tool that:\n\nA) Crawls through websites I have provided at a scheduled time (e.g. once a week)\n\nB) Filters out relevant information based on the prompt I’ve provided\n\nC) Outputs a weekly lead gen & news report. It’s important that it only outputs \\*new\\* info - Grok’s task scheduler reports a bunch of old stuff and sends me weekly reports containing info I’ve already received\n\nAny suggestions? Feel like this should be a relatively easy fix, maybe with Manus ai",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qrjx2j/looking_for_a_tool_workflow_to_automate_niche/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "o2oqk2a",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-30 22:16:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2p1qvu",
          "author": "e_ai_gabriel",
          "text": "'Easy' is a strong word for lead gen on Reddit, especially with all the noise. But there are technical ways to handle it.\n​To ensure timing, you need to master Reddit’s search parameters, like sorting by 'relevance' or 'new' and limiting the time range with 't=hour'. From what we've seen, using 'sort=new' usually pulls in way too much trash, so finding the right balance is key. In Huntopic, I pair these specific settings with a database-level deduplication layer to discard anything already seen before any analysis happens.\n​For filtering, instead of relying on keywords alone, an intent-validation pipeline is essential. It focuses on identifying actual pain points or buying signals while filtering out generic discussions.\n​What stack are you using for this automation, or are you looking for an out-of-the-box solution that already handles this?",
          "score": 1,
          "created_utc": "2026-01-30 23:14:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2p23kz",
              "author": "PM_ME_PITCH_DECKS",
              "text": "Im not looking for lead gen from reddit in particular - I have a bunch of websites that I use for lead gen that I want an AI to parse through for me so I don’t have to block off a few hours a week to do it manually",
              "score": 1,
              "created_utc": "2026-01-30 23:16:33",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2p69oq",
          "author": "kammo434",
          "text": "If you know the webpages and they don’t stay the same. standard curl/ ht tp Get req to the website works. Filter out the html content send to AI\n\nIf you need crawling as you mentioned. Ie check all <domain> /news/ <new webpage> —> I’d suggest apify cheerio scraper - and set the glob correctly. \n\nIf you wanted a hosted API. \n\nBrowserless & or firecrawl (popular)\n\nHope this is a good pointer.",
          "score": 1,
          "created_utc": "2026-01-30 23:39:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2pgld5",
          "author": "Interesting_Way_105",
          "text": "Hey this is the perfect use case for rtrvr.ai, our vibe scraping platform.\n\nCan just give a google sheet of websites, a prompt of what to go through and find, and the agent will crawl the website and write back new columns. Can put it on a schedule too!",
          "score": 1,
          "created_utc": "2026-01-31 00:36:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2qts8z",
          "author": "Univium",
          "text": "Yeah, \"out of the box\" is tough for hyper-specific scraping. You're likely looking at a custom script or browser automation workflow. I actually break down these kinds of automation builds on my YT channel if you want to see some setups; the link's on my profile.",
          "score": 1,
          "created_utc": "2026-01-31 05:48:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2r974s",
          "author": "Kooky_Passion8983",
          "text": "Ola! I know exactly what you're talking about. \n\nBeen there myself, I can create a custom out of the box solution for you. That'll get the info you need, double check to ensure it hasn't been sent before. I would love to hear more about your manual process so I can create a prototype for you. \n\nIf you like it - you can purchase it \n\nIf not, all good - we get to learn something new.\n\nMessage me directly if you're keen. \n\nOk bye",
          "score": 1,
          "created_utc": "2026-01-31 08:03:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2rxyid",
          "author": "Technical-Radio5033",
          "text": "your use case sounds a bit different than the usual automation workflow, but if you're specifically trying to find new business leads I've heard great things about SMB Sales Boost. It's a database that surfaces newly registered businesses so you can reach out to fresh leads before everyone else does. for the custom website monitoring thing you described tho, you'd probably need something like Apify or Bardeen to build that scraping workflow yourself since I don't think there's an out-of-the-box solution that does exactly what you're asking",
          "score": 1,
          "created_utc": "2026-01-31 11:54:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2u595h",
          "author": "rudythetechie",
          "text": "You’re describing a crawler + filter + dedupe job. This is more workflow design than a single tool problem.",
          "score": 1,
          "created_utc": "2026-01-31 19:03:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2uein4",
          "author": "Global_Loss1444",
          "text": "This can be automated by combining an LLM with a crawler. Feed only fresh content to an LLM (OpenAI, Claude, or Manus AI) with your request to filter and summarize pertinent leads after using a program like Phantombuster or Python to scrape your target sites on a regular basis. Automatically create a weekly report in Google Sheets, PDF, or email and save previous results to prevent duplication. This configuration provides you with timely, personalized news and lead generation without repeating outdated information.",
          "score": 1,
          "created_utc": "2026-01-31 19:47:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o35gxda",
          "author": "Parth_0001Win",
          "text": "Interesting problem , it feels like you’re trying to get signal without noise from a set of known sources, and that’s much harder than it sounds.\n\nThe tricky part isn’t just crawling sites , it’s making sure you don’t get the same-old information again and again. Even some tools with schedulers fall into that trap because they don’t track what’s been delivered already.\n\nCurious , when you say new info, do you mostly mean new content added on those sites, or new events & signals that actually indicate a lead opportunity?",
          "score": 1,
          "created_utc": "2026-02-02 13:28:37",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qth8lx",
      "title": "Automated a part of my job application process after getting tired of rewriting my Resume",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qth8lx/automated_a_part_of_my_job_application_process/",
      "author": "No_Cantaloupe_1888",
      "created_utc": "2026-02-02 01:28:20",
      "score": 10,
      "num_comments": 13,
      "upvote_ratio": 1.0,
      "text": "Hey everyone,\n\nFor a few months I was applying to jobs almost daily, and one thing that kept slowing me down was constantly tweaking my CV and writing slightly different cover letters for each role. It wasn’t hard work - just repetitive and easy to mess up when you’re tired.\n\nI noticed that most tools that did this were separate websites, which meant a lot of copy-pasting between tabs. Since I already spend most of my time on job boards, I decided to automate this part directly where the application happens.\n\nSo I ended up building a Chrome extension called AutoTailor to automate this process it:\n\n* Reads the job description on the page\n* Helps tailor my CV to that role\n* Generates a matching cover letter without leaving the site\n\nRight now it’s still early. I’m sharing this because I’m curious if you do use tools like this or how do you automate this process for yourself?\n\nWould love feedback, ideas, or even criticism on the approach",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qth8lx/automated_a_part_of_my_job_application_process/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "o33x3xl",
          "author": "Much_Pomegranate6272",
          "text": "This is useful but be careful automated applications usually get filtered out fast by ATS systems or recruiters who can tell.\n\nMass-applying with tailored resumes sounds efficient but if you're sending 50 apps a week, quality drops and it shows.\n\nBetter approach: use your tool to speed up the boring part (formatting, cover letter drafts) but actually customize the final version yourself for roles you genuinely want.\n\nReal question - are you getting more interviews with this vs manual applications? That's the only metric that matters.\n\nWhat's your interview rate been since using it?",
          "score": 2,
          "created_utc": "2026-02-02 05:35:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o36r287",
              "author": "No_Cantaloupe_1888",
              "text": "Appreciate you finding it useful.\n\nIt isn’t meant for mass-applying or fully automated submissions. It doesn’t send applications on your behalf. What it automates is the tweaking part: tailoring the resume content to the job description and generating a cover letter draft. Users can review every change, edit it, and it simply outputs a new DOCX that they choose to submit themselves.\n\nThe idea is exactly what you mentioned: speed up the boring parts (keyword alignment, structure, first drafts) so people can focus on quality roles and still customize fast before applying.\n\nTo be transparent, I’m not actively applying myself right now, so I don’t have a personal interview-rate comparison to share.\n\nThat said, I agree with you: interview rate is the real metric, and I’m still trying to figure out the best way to gather more structured feedback from users who are actively applying as I currently have some heavy users using it but sadly are not providing feedback of the results.",
              "score": 2,
              "created_utc": "2026-02-02 17:17:39",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o32t3ia",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-02 01:28:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o335479",
          "author": "cabr_n84",
          "text": "Is it n8n or make?",
          "score": 1,
          "created_utc": "2026-02-02 02:36:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o36f3cf",
              "author": "No_Cantaloupe_1888",
              "text": "It’s neither - it’s a custom Chrome extension. The automation happens directly in the browser on the job posting page rather than via external workflow tools.",
              "score": 1,
              "created_utc": "2026-02-02 16:22:25",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o33r53n",
          "author": "Boogooooooo",
          "text": "Does it apply automatically or you have a final look in the end?",
          "score": 1,
          "created_utc": "2026-02-02 04:52:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o356jih",
              "author": "No_Cantaloupe_1888",
              "text": "No it doesnt apply automatically that was kinda the point, tou get to see the changes you can select if you want all to apply or edit them and then you export a docx and apply yourself",
              "score": 2,
              "created_utc": "2026-02-02 12:20:17",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o34gy9y",
          "author": "MrJezza-",
          "text": "Does it actually change the content or just rearrange keywords? I feel like most of these tools just stuff in buzzwords and recruiters can smell it from a mile away",
          "score": 1,
          "created_utc": "2026-02-02 08:30:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3571cl",
              "author": "No_Cantaloupe_1888",
              "text": "It does change content but not at the point it reinvents things you didnt do, before tailoring i made it so that it suggests users for example if you had x and y you would have a better chance at this company. But you always get to stay in control you can review the changes to your cv before downloading it",
              "score": 1,
              "created_utc": "2026-02-02 12:23:54",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o35fo2e",
          "author": "GetNachoNacho",
          "text": "Love this! Automating repetitive CV and cover letter tweaks is a perfect fit for a small personal workflow tool. AutoTailor sounds like it saves tons of time, especially compared to juggling multiple websites. Curious how you handle edge cases where job descriptions are vague or non-standard.",
          "score": 1,
          "created_utc": "2026-02-02 13:21:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o368l9b",
          "author": "YangBuildsAI",
          "text": "this is exactly why we stopped doing keyword-based resume screening, like if candidates can auto-tailor resumes in 30 seconds, recruiters need to be evaluating actual work instead of how well your resume matches the JD. honestly good for you though, the game is broken anyway",
          "score": 0,
          "created_utc": "2026-02-02 15:52:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o36d8ij",
              "author": "No_Cantaloupe_1888",
              "text": "Well thats what needed to be evaluated in the first place. I think everyone should have a chance to be reviewed by a real human and given a real chance as real talent can and is going to waste because of some ai screening that decided the applicant didnt haven enough matching keywords!",
              "score": 1,
              "created_utc": "2026-02-02 16:13:54",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qpbcen",
      "title": "Help me figure out a text - video automation",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qpbcen/help_me_figure_out_a_text_video_automation/",
      "author": "kabeerkepohe",
      "created_utc": "2026-01-28 13:28:19",
      "score": 9,
      "num_comments": 10,
      "upvote_ratio": 1.0,
      "text": "I am trying to build an automation for text to video automation. the goal is to create 1-3 min youtube videos of kids rhyme (2-7 years old). \n\ncurrently i am using different tools for scripting ( openai) , music ( suno) , 3d animation etc \n\nwhat i want to achieve - i maintain an excel where i add the theme, initial prompt then the automation picks it from there - gets the script done, music narration and then the actual animated video and then updates the excel with the drive file link of the video.\n\nhow can i achieve it? any guidance is appreciated as i am fairly new to this",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qpbcen/help_me_figure_out_a_text_video_automation/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "o27l3ue",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-28 13:28:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o27qtsc",
          "author": "Business-Cherry1883",
          "text": "Agree—the stitching/timeline logic is the real bottleneck.\n\nI’d split it: generate script + scene list, generate audio, then stitch with FFmpeg (Python/node), and persist artifacts (audio, captions, timing JSON) so a failure in step N doesn’t force you to re-pay for steps 1–N-1.\n\nDo you want clips-per-scene (easier retries) or one continuous render (simpler upload)?",
          "score": 1,
          "created_utc": "2026-01-28 13:58:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2862f2",
          "author": "MulberryVarious7539",
          "text": "hi i think you should use an automation tool like n8n , zapier or make they allow you to build this i have already built such pipeline the only real cost is the video generation platform and nothing else is so pricy hope it helped you",
          "score": 1,
          "created_utc": "2026-01-28 15:14:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2882fi",
          "author": "GetNachoNacho",
          "text": "What you’re describing is definitely doable, it’s about building a workflow that connects all your tools. Start by defining the sequence (script → narration → music → animation → upload), then use a workflow automation tool like n8n, Make, or Zapier to trigger each step and update your Excel/Drive automatically.",
          "score": 1,
          "created_utc": "2026-01-28 15:23:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o29lb9j",
          "author": "Exciting_Trouble7819",
          "text": "Since you're new, try breaking it into stages:\n\n\n\nExcel row triggers workflow → OpenAI writes script → Eleven Labs for narration → Pictory or similar to mix narration + stock clips → Upload to Drive → Update Excel\n\n\n\nZapier or n8n can connect these. The 3D animation part is trickier - most no-code tools work better with stock footage than custom 3D. Start simple, add complexity later.",
          "score": 1,
          "created_utc": "2026-01-28 18:56:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2d12dr",
          "author": "ScratchAshamed593",
          "text": "I had earlier built and posted about a similiar worfklow which used VEO3 for video generation. You could check out that template and also created  Reddit post for this. I am also happy to help build this or any specific automation for you as well. Please DM with the details.",
          "score": 1,
          "created_utc": "2026-01-29 05:35:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2d2bsj",
          "author": "Fun-Flounder-4067",
          "text": "You can use n8n/zapier/make to automate your workflow.\n\nwhere the tools reads your google sheet to get the theme, and goes to Open AI to generate the script, then goes to suno and converts the script into an audio, then to the video creation tool like creatomate, once the video is generated then save it to your drive.",
          "score": 1,
          "created_utc": "2026-01-29 05:44:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2obpke",
          "author": "LieAccurate9281",
          "text": "By storing your themes and prompts in Google Sheets or Excel and utilizing GPT (OpenAI) to create the script, you can automate your children's rhyming videos. Use ElevenLabs or Suno for music and narration. The script and audio can then be converted into a one to three minute animated video using programs like Vimerse Studio. When you upload the completed video to Drive or S3, the link will be automatically added to your sheet. Python APIs or no-code platforms like Zapier or Make.co.m can be used to orchestrate the entire process. To expedite the process, start with a single test video and reuse resources.",
          "score": 1,
          "created_utc": "2026-01-30 21:05:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o302lr8",
          "author": "Boogooooooo",
          "text": "Have you considered cost of video generation? Veo (High Quality) costs slightly over $1 per one 8 second generation.\nMost likely you would need few generations per promt. \nSo over $15 per 1 min video if everything goes smoothly ",
          "score": 1,
          "created_utc": "2026-02-01 17:18:01",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qtpcz9",
      "title": "Automate Appointment Booking with AI Voice Agents",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qtpcz9/automate_appointment_booking_with_ai_voice_agents/",
      "author": "According-Site9848",
      "created_utc": "2026-02-02 08:17:15",
      "score": 9,
      "num_comments": 15,
      "upvote_ratio": 0.92,
      "text": "After experimenting with different stacks (ElevenLabs, Retell, Twilio, lightweight JS backends and simple databases like Supabase), I’ve seen firsthand that the real win isn’t just making an AI talk, its building a voice agent that can survive normal human chaos interruptions, corrections, rambling answers, name/email mistakes and wait, not that day while still checking availability, creating bookings, sending confirmations and logging everything cleanly; one local service business that piloted this flow went from manually answering every call to letting an AI handle first contact and scheduling and they saw about a 35–40% increase in booked appointments in the first month without changing their marketing, which matches what a lot of Reddit builders are discovering: the stack matters less than designing a narrow, reliable workflow with strong prompts, validation logic and graceful fallback responses when APIs fail; curious what breaks most often in your current setup speech accuracy, name/email capture, calendar sync or error handling?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qtpcz9/automate_appointment_booking_with_ai_voice_agents/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "o34kmve",
          "author": "Techenthusiast_07",
          "text": "I’ve built an AI voice agent for appointment booking, and I agree the hardest part is not making communication it’s dealing with how people actually speak. Interruptions, changing answers, and small mistakes happen all the time.\ni am using it and it handles the checks for availability, booking appointments, sending cold emails and calling with clients name and it answer with human like voice also it has integration with CRM and it make summary and follow ups from the conversation. so Automate Appointment Booking with the help of AI Voice Agents is good move for any business who needs to grow their business with less manual efforts.",
          "score": 3,
          "created_utc": "2026-02-02 09:05:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o34mf3c",
              "author": "According-Site9848",
              "text": " once you move from demos to real calls, you realize speech quality is the easy part.\n\nWhat you’re describing (interruptions, mid-sentence changes, correcting names, actually can we do next week) is where most voice agents fall apart unless the workflow is designed for it. Availability checks, booking, CRM sync, summaries and follow-ups all work only if the agent can gracefully recover from messy human input instead of forcing people down a rigid script.\n\nThe fact that you’ve tied it into CRM, call summaries and follow-ups is the right direction too   that’s where teams stop babysitting the agent and start trusting it. Voice agents become useful when they behave less like a call bot and more like a calm, patient front-desk assistant.\n\nIf you’re open to it, I’d be curious what you found hardest to stabilize long-term: name/email capture, calendar edge cases or handling corrections mid-flow.",
              "score": 1,
              "created_utc": "2026-02-02 09:23:16",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o34flwe",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-02 08:17:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o34rio8",
          "author": "Parker2010SEO",
          "text": "Our voice AI Agent (Neyox) deliver 99% accuracy - latency, voice, quality responses, categorize leads (hot, cold) etc etc. \n\nThe best part: Only $0.10/Min with your own telephony.",
          "score": 1,
          "created_utc": "2026-02-02 10:12:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o34sfa5",
          "author": "Beneficial-Panda-640",
          "text": "In my experience the “breaks” are usually not speech accuracy, it’s state management and edge cases. People change their mind mid sentence, give partial info, or answer a different question than the one you asked, and the agent has to keep a clean thread of what is confirmed vs assumed. Name and email capture is also deceptively hard because you need a confirmation loop that does not feel robotic, plus a fallback like spelling or SMS verification when confidence is low.\n\nCalendar sync issues tend to be less frequent but more damaging when they happen, especially time zones, double booking, and stale availability. The systems that feel reliable are the ones that treat every external call as “may fail” and have a graceful recovery path that does not lose the user or create phantom bookings. I’m curious how you’re handling the confirm step, is it explicit at the end or incremental confirmations as you go?",
          "score": 1,
          "created_utc": "2026-02-02 10:21:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o34t6wv",
              "author": "According-Site9848",
              "text": "The real fragility is in state management and handling edge cases rather than pure speech accuracy.\nHere’s how I approach it:\n1. Incremental confirmations: Instead of waiting until the end, I confirm critical fields as they come up — e.g., Just to confirm, did you say 3 PM on Thursday? This keeps the thread clean and avoids compounding errors.\n2. Confidence-based fallbacks: For names, emails or dates, if the model isn’t confident, trigger a polite clarification or an SMS/email verification loop. This keeps it human-like but accurate.\n3. Resilient calendar logic: Treat every API call as potentially failing. Implement retries, double-booking checks, time zone normalization and a fallback message if availability can’t be confirmed.\n4. Threaded state tracking: Maintain a clear confirmed vs. assumed map for every interaction. This way, even mid-sentence changes or partial answers don’t break the workflow.\nThe combination of incremental confirmation + confidence checks + robust API handling is what makes the system feel reliable in real-world chaos.\nIf anyone is stuck with this, I’m happy to share a practical pattern for implementing it in a voice-agent workflow.",
              "score": 1,
              "created_utc": "2026-02-02 10:28:16",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o34yboo",
          "author": "Bart_At_Tidio",
          "text": "Most breakages come from sloppy validation, especially names, emails, and time confirmation across time zones. If the agent treats those like a form instead of a conversation checkpoint, everything downstream gets cleaner. The tech stack matters far less than how defensive the workflow is when people interrupt themselves or change their mind mid sentence.",
          "score": 1,
          "created_utc": "2026-02-02 11:14:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3526e5",
              "author": "According-Site9848",
              "text": "Defensive workflow design is where the real reliability comes in. I’ve found that incremental confirmations work best: verify names, emails and appointment times as part of the conversation, not just at the end. Combine that with fallbacks like spelling checks, SMS/email verification and timezone-aware scheduling and most downstream errors disappear. If anyone is stuck on making their voice agent resilient to interruptions or mid-sentence changes, I’m happy to guide on a step-by-step validation workflow that keeps bookings clean.",
              "score": 1,
              "created_utc": "2026-02-02 11:47:01",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o35e9bw",
          "author": "GetNachoNacho",
          "text": "Completely agree. The real win isn’t the voice, it’s reliability under messy human behavior. Narrow flows + strong fallbacks make these agents actually work.",
          "score": 1,
          "created_utc": "2026-02-02 13:12:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o35fh2x",
              "author": "According-Site9848",
              "text": "Once you design for messy humans instead of ideal scripts, everything changes.\n\nThe agents that hold up in production are the ones that treat every step as provisional: confirm intent, validate critical fields, assume interruptions will happen and always have a safe fallback (let me double-check that beats guessing). Voice quality just sets the ceiling  workflow defensiveness is what determines whether the system survives real calls.",
              "score": 1,
              "created_utc": "2026-02-02 13:19:59",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o36fb9s",
                  "author": "GetNachoNacho",
                  "text": "Exactly, the workflow beats voice quality. Confirm intent, validate inputs, expect interruptions, and build strong fallbacks. That’s what makes AI booking agents survive real-world calls.",
                  "score": 1,
                  "created_utc": "2026-02-02 16:23:26",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o35tf5h",
          "author": "BotWhisper",
          "text": "This is exactly the problem I've been working on. You're 100% right that speech quality is the easy part - the real challenge is building workflows that can handle how people actually talk.\n\nI've been building something called BotWhisper that tackles a lot of these issues. The key insight (which you've clearly figured out) is that you need to treat every step as provisional until it's confirmed, and build fallbacks at every level.\n\nWould love to hear some of your specific challenges you would like to overcome to get to your ultimate goal.",
          "score": 1,
          "created_utc": "2026-02-02 14:37:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o37k9bd",
          "author": "AutomationPartner",
          "text": "Just got off the phone with a customer service rep that I wished was an AI agent. Looking up information took a long time, voice was unclear and wasn't sure how to use their own systems. \n\nThat being said, in building my own voice agents I've found some difficulties with location specific accents while maintaining call quality as well as getting the agent to spell the name and email correctly every time instead of simply guessing. I've also had some issues based on people giving relative dates (Tomorrow, next week, etc) instead of absolute dates ( Feb 2, 2026). \n\nGetting the voice to sound human has never been the problem.",
          "score": 1,
          "created_utc": "2026-02-02 19:30:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o38djlm",
          "author": "BaselineITC",
          "text": "It's great that you're already finding what works and what doesn't. You're right, a difficult factor of AI implementation is making it work with human unpredictability. The large percentage of increase is impressive and a great sign that this implementation is going to be effective. \n\nBuilding automations that could fullproof any human confusion could help. For example, if the AI doesn't catch a customer's email, there should be an automation where it's flagged for wither an AI or human follow-up.",
          "score": 1,
          "created_utc": "2026-02-02 21:48:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o38k4vd",
          "author": "SpiritualWolverine50",
          "text": "i've been playing with ai voice for some time now and tbh I find deepgram very helpful. If you just now a little bit of Python you can create a custom agent in a day or two",
          "score": 1,
          "created_utc": "2026-02-02 22:20:38",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qoql2p",
      "title": "Misusing AI is causing MORE time to be wasted",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qoql2p/misusing_ai_is_causing_more_time_to_be_wasted/",
      "author": "SadEcho8331",
      "created_utc": "2026-01-27 21:05:34",
      "score": 8,
      "num_comments": 3,
      "upvote_ratio": 1.0,
      "text": "I understand this might not be the most receptive sub to post this in, but I just cannot stand how some people use AI when it comes to coding! I gotta rant!\n\nFor reference, I am at my first real automation job, I graduated last year with a diploma in automation and robotics and now work at an engineering company designing mining equipment. I am working on one project, and am the only guy working on it, but I have taken over it from someone who has left the company now.\n\nThe biggest part of the project is controlling some motors with a microcontroller programmed in C. I haven't used C in a while, so I have been taking my time trying to remember how it works and how to understand his code... and I just can't. His code is so poorly written that I have to essentially rewrite the whole thing from scratch because it is so hard to understand. The worst part was, even he couldn't explain it to me! His comments make no sense and before he left he didn't really seem to know what it was doing. It worked sure, but I can't integrate it to other systems or add onto it if I can't understand how it's working.\n\nFast forward to today, where I got so frustrated with something in my new code not working I caved and asked chatgpt. I personally do not like using AI for my work, because I want to understand how it works myself, but when I cannot find an answer elsewhere it helps. It spat out some example code at me and I was shocked because it was formatted almost exactly like the code I was trying to replace. I fed some of the old code back into it, and it said it was highly likely that it was AI generated. Suddenly it made so much sense why the guy before me couldn't explain how it worked - he didn't write it!\n\nNow I am going to have to spend likely a week or more just rewriting the code so that I can add more systems to it later all because he couldn't be bothered to understand what he was writing. I think AI has its uses, and I know it has helped me when I'm slamming my head into a wall sometimes, but people who use it to write all of their code are only going to cause more time to be wasted down the line.\n\nRant done! I'm over it! Onward!",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qoql2p/misusing_ai_is_causing_more_time_to_be_wasted/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "o240yg1",
          "author": "geofabnz",
          "text": "10/10, no notes",
          "score": 3,
          "created_utc": "2026-01-27 23:14:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o24ex7q",
          "author": "kubrador",
          "text": "your predecessor speedran the entire software development lifecycle and somehow ended up at \"i have no idea what this does\" which is genuinely impressive",
          "score": 2,
          "created_utc": "2026-01-28 00:25:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2396qv",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-27 21:05:34",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qtw6a4",
      "title": "Is there any reliable way to scrape public profiles from linkedin in 2026?",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qtw6a4/is_there_any_reliable_way_to_scrape_public/",
      "author": "colored_savage",
      "created_utc": "2026-02-02 14:15:08",
      "score": 8,
      "num_comments": 15,
      "upvote_ratio": 1.0,
      "text": "I'm working on a project similar to aiapply and teal and i've been trying to figure how the most reliable way to scrape linkedin public profiles, it's not for lead generation or anything but so the users can easily import their job details, from the little research i've done, selenium and playwright seems to restricted heavily by linkedin but i know theres a way because these brands i mentioned above have it running smoothly so i'm wondering if anyone knows how they might be doing it on their backend.\n\nthanks",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qtw6a4/is_there_any_reliable_way_to_scrape_public/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "o35rof1",
          "author": "Milan_SmoothWorkAI",
          "text": "Teal seems to have a fallback of asking the users to export their profiles to PDF and then parsing that. This is probably the simplest solution.\n\nOther than that, even Linkedin can be scraped with some tailor-made stealth tools, but it is one of the most challenging sites to consistently scrape.\n\nSo if you feel that's an option, I'd consider the PDF import for the MVP.",
          "score": 2,
          "created_utc": "2026-02-02 14:28:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o35v0gg",
              "author": "colored_savage",
              "text": "Yeah I tried that but apparently people don’t like the friction of going that route",
              "score": 1,
              "created_utc": "2026-02-02 14:45:38",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o35p929",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-02 14:15:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o368yzn",
          "author": "DomIntelligent",
          "text": "Phantombuster could help you with it but has certain limits",
          "score": 1,
          "created_utc": "2026-02-02 15:54:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3697zg",
              "author": "colored_savage",
              "text": "Thanks! Will phantombuster be able to scrape experience information?",
              "score": 1,
              "created_utc": "2026-02-02 15:55:10",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o36su9c",
                  "author": "necromenta",
                  "text": "They seem to be the most \"reliable\" but also extremely limited, I think their \"scrapes\" cover only a couple of fields and are very limited about it",
                  "score": 2,
                  "created_utc": "2026-02-02 17:25:49",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o370t1v",
                  "author": "DomIntelligent",
                  "text": "You should be able to. Might be pricey. But can be a good start to see what It could do with a free trial. \n\n\nFair warning- it's okay to scrape 10 profiles throughout the day so your account doesn't be flagged as suspicious by LinkedIn. Don't try to scrape multiple profiles in less time as possible. Make sure to spread it evenly. \n\nPhantombuster will let you know the limits",
                  "score": 1,
                  "created_utc": "2026-02-02 18:01:58",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o36b171",
          "author": "KeyEbb9922",
          "text": "Loads of LinkedIn scraping tools on Apify. Sign up and try them out, I think you get $5 free to try some. Then use the tools to automate.",
          "score": 1,
          "created_utc": "2026-02-02 16:03:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o36cc8b",
          "author": "kammo434",
          "text": "Use Apify. \n\nGet a NO COOKIES scraper. They have a bunch & profiles with experience is pretty standard. \n\nDon’t go near playwright not worth it.",
          "score": 1,
          "created_utc": "2026-02-02 16:09:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o36ywyr",
          "author": "PrimeMan1337",
          "text": "Most tools that look “reliable” long-term don’t rely on scraping alone. They usually combine user-initiated imports (exports, OAuth, uploads) with light enrichment, because LinkedIn actively breaks automated access. Scraping tends to be brittle unless the user explicitly initiates the data transfer.",
          "score": 1,
          "created_utc": "2026-02-02 17:53:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o37b59j",
          "author": "Material-River-2235",
          "text": "A scraping API with JS rendering and proxy rotation can handle Linkedin profiles. I use qoest for developers site to similar imports and it can manages the technical side to avoid blocks.",
          "score": 1,
          "created_utc": "2026-02-02 18:48:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o37hzr0",
          "author": "AutomationPartner",
          "text": "If you want your users to be able to extract their job details easily then LinkedIn has a method to extract all of your personal information. \n\nPersonally, I would avoid asking my users to do any sort of automation on their LinkedIn accounts. LinkedIn is famous for blocking accounts, Shadow bans, and throttling post distribution if they think you are doing automation on your account. Better off the one time pain than accidentally getting a customers account shut down.",
          "score": 1,
          "created_utc": "2026-02-02 19:19:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o35yxng",
          "author": "GetNachoNacho",
          "text": "You’re right, reliable usually means *not* scraping. In 2026, most stable setups rely on user-consented imports or limited official APIs, not Selenium-style scraping.",
          "score": 0,
          "created_utc": "2026-02-02 15:05:41",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qr8w5h",
      "title": "Need a TG Automation",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qr8w5h/need_a_tg_automation/",
      "author": "systematicfailur3",
      "created_utc": "2026-01-30 15:41:15",
      "score": 8,
      "num_comments": 16,
      "upvote_ratio": 1.0,
      "text": "Hey everyone!\n\nI'm looking for a simple local bot, to do the following\n\n\\- message pending request on a channel that I'm the admin  \n\\- I will be using TG premium account (option to Send When Online)  \n\\- to the ones that are recently online, send message immediately (can set up time between messages)  \n\\- to the ones that are not online recently - do the Send When Online option\n\nAnyone capable of doing this?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qr8w5h/need_a_tg_automation/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "o2mbs40",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-30 15:41:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2mcx5t",
          "author": "clan2424",
          "text": "Is TG telegram?",
          "score": 1,
          "created_utc": "2026-01-30 15:46:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2md13a",
              "author": "systematicfailur3",
              "text": "Yes!",
              "score": 1,
              "created_utc": "2026-01-30 15:46:55",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2mda34",
                  "author": "clan2424",
                  "text": "like a clawdbot? I’ve had mine setup for about a week lol. Lmk what you’re thinking. I could do it",
                  "score": 1,
                  "created_utc": "2026-01-30 15:48:04",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2migpa",
          "author": "just-passingg-by",
          "text": "I actually built something pretty similar recently. It handled pending requests, checked last-seen status, sent messages right away with delays, or used “send when online” for inactive users.. all running locally.\n\nIf you want, I like to ask a few clarifying questions regarding this.",
          "score": 1,
          "created_utc": "2026-01-30 16:11:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2nml8k",
          "author": "Commercial_Guava8522",
          "text": "I would be happy to help you setup this. Have extensive experience in bots 😁",
          "score": 1,
          "created_utc": "2026-01-30 19:08:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2olmqy",
          "author": "rayaria222",
          "text": "I’m new to automation would like to offer my volunteer",
          "score": 1,
          "created_utc": "2026-01-30 21:52:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2qmz8c",
          "author": "Adventurous-Flow-217",
          "text": "Let's connect",
          "score": 1,
          "created_utc": "2026-01-31 04:57:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2rerqb",
          "author": "Kooky_Passion8983",
          "text": "Hello I can get this set up for you quite quickly. \n\nHit me up. I'll build it, you can try it for a week. \n\nIf you like it - you can purchase it \n\nIf not, all good you \n\nOk bye",
          "score": 1,
          "created_utc": "2026-01-31 08:55:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2rqxvn",
          "author": "Much_Pomegranate6272",
          "text": "You can check user status (online/offline) through the API, send messages to online users immediately, and queue others.\n\nThe \"Send When Online\" feature isn't directly available in Bot API though - you'd need to track when users come online and trigger message then.\n\nEasier approach: just use Telethon (Python library for Telegram). It can automate user accounts (not bots) and has better control for stuff like this.\n\nWhy local bot specifically? Cloud solution would be way easier to run 24/7.",
          "score": 1,
          "created_utc": "2026-01-31 10:52:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2rtadn",
              "author": "systematicfailur3",
              "text": "Ok give me your offer.",
              "score": 1,
              "created_utc": "2026-01-31 11:13:37",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2rtrnd",
                  "author": "Much_Pomegranate6272",
                  "text": "Sure, happy to help with this. Few questions to scope it properly:\n\nHow many pending requests are you messaging daily?\nWhat's the message frequency limit you want (like X seconds between messages)?\nDo you need this running 24/7 or just when you trigger it?\nLocal on your machine or cloud-hosted?\n\nOnce I know the details I can give you a proper quote and timeline.",
                  "score": 1,
                  "created_utc": "2026-01-31 11:17:56",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2tfd11",
          "author": "slunkeh",
          "text": "This is doable with Telethon or Pyrogram (Python libraries for Telegram).\n\nThe tricky part is the Send When Online feature since that's a premium client feature, not something the bot API exposes directly. You'd need a userbot running on your premium account rather than a standard bot. The flow would check member online status via the API, then either send immediately or schedule using the premium",
          "score": 1,
          "created_utc": "2026-01-31 17:00:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2tmggo",
              "author": "systematicfailur3",
              "text": "Send a dm with pricing if you can do it please",
              "score": 1,
              "created_utc": "2026-01-31 17:35:17",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2tp4jm",
                  "author": "slunkeh",
                  "text": "DM sent 👍",
                  "score": 1,
                  "created_utc": "2026-01-31 17:48:06",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qs373h",
      "title": "Finally found a way to survive back-to-back meetings without zoning out (or losing my mind)",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qs373h/finally_found_a_way_to_survive_backtoback/",
      "author": "evoxyler",
      "created_utc": "2026-01-31 14:04:34",
      "score": 7,
      "num_comments": 8,
      "upvote_ratio": 0.9,
      "text": "meetings are my personal hell. wfh I have to sit through 3+ hours of meetings on a daily basis, and my brain just shuts off. I try to take notes, but I end up missing half of what’s said because I’m focusing on typing, or I get distracted by a notification and lose the train of thought entirely.\n\n\nI used to spend my evenings re-reading whatever notes I typed up and try to remember what I had promised to do.\n\n\nI finally found a workflow that actually works for my brain: Audio-only capture.\n\n\nI started using these smart glasses for remote work that just sit on my face and record the meetings out loud from the speakers (tried dymesty but im sure others do similar stuff).The killer feature for me is that I can stand up, pace around the room, or even space out just a bit, and the app transcribes and summarizes the action items for me later.\n\n\nIt’s been a massive relief. I’m not glued to the screen trying to type. I read the itemized transcription with AI summaries. Job done for me.\n\n\nDoes anyone else have a \"low friction\" way to handle meeting notes? I feel like standard note-taking apps just don't work for us.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qs373h/finally_found_a_way_to_survive_backtoback/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "o2slujl",
          "author": "YormeSachi",
          "text": "What I do right now is using my phone as recording device, which works out well until I get a call and the recording stops. People might find it rude when you take out the phone and start recording but that is the easiest I can.",
          "score": 3,
          "created_utc": "2026-01-31 14:33:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2sgs94",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-31 14:04:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2spwdd",
          "author": "Informal_Data5414",
          "text": "I would definitely try it during my meetings which I literally sit through some low effort ones a couple hours each day. I wonder how the summary is formatted?",
          "score": 1,
          "created_utc": "2026-01-31 14:56:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2ssftx",
              "author": "evoxyler",
              "text": "It first shows an overall summary, then an outline, action items and also suggestions for steps going forward. I don’t usually read the suggestions but at times it is helpful.",
              "score": 1,
              "created_utc": "2026-01-31 15:09:31",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2svzcb",
          "author": "Stir_123",
          "text": "Do they actually look like normal glasses? I looked at the Ray-Ban ones but I work in a fairly conservative office sometimes and I'm paranoid about people thinking I'm filming them.",
          "score": 1,
          "created_utc": "2026-01-31 15:27:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2sxyvj",
              "author": "evoxyler",
              "text": "These are just audio glasses with prescription lenses options like normal glasses. Don’t know much about the camera recording ones but my cousin works at the hospital and they are not allowed to use Ray-Ban.",
              "score": 1,
              "created_utc": "2026-01-31 15:37:23",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2zf9ua",
          "author": "dwoodro",
          "text": "3-hour meetings every day? Dang, I would find an alternative to that real fast: \"I'm sorry, Boss, I need those 3 hours to get 50% more work done, I'll send you a synopsis when I am done with my workload.\"\n\nThat sounds more like an \"ego stroke routine\" for whoever is running the meeting. Seems like this would be highly counter-productive at best.",
          "score": 1,
          "created_utc": "2026-02-01 15:29:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o360phe",
          "author": "Zmakesit",
          "text": "i use an app called perimetr from the microsoft store it is something like a notion and meeting asistant hybrid it use super flexible in term of output and i can tell it the format i want and bake during meetings my own observation if i want",
          "score": 1,
          "created_utc": "2026-02-02 15:14:32",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qqa3lo",
      "title": "Why do automation tools still require so much manual learning to achieve simple outcomes?",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qqa3lo/why_do_automation_tools_still_require_so_much/",
      "author": "casual_observer05",
      "created_utc": "2026-01-29 14:31:27",
      "score": 7,
      "num_comments": 13,
      "upvote_ratio": 0.77,
      "text": "I’ve been using tools like Zapier, Make, Clay, and other automation platforms and noticed a recurring friction point.\n\nThe tools are powerful, but when you want to do a *specific task* (e.g., “monitor mentions and trigger a workflow” or “enrich leads and push to CRM”), you still end up:\n\n* Reading docs\n* Watching YouTube tutorials\n* Searching forums\n* Asking ChatGPT how to wire things\n\nEven though the automation engine exists, figuring out *how to achieve a specific outcome* is still manual and time-consuming.\n\nMost solutions today are:\n\n* Documentation and templates\n* Community tutorials\n* Webinars and examples\n* Human support\n\nWhich feels expensive, fragmented, and not aligned with how people think about workflows (people think in outcomes, not nodes and triggers).\n\n**Question for automation users/builders:**\n\n* What’s the most confusing automation you’ve tried to build?\n* How did you figure it out (docs, ChatGPT, trial and error)?\n* Do you think outcome-driven automation guidance (instead of feature docs) would be useful?\n\nI’m 19 and trying to understand this deeply before building anything, curious how people here experience this.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qqa3lo/why_do_automation_tools_still_require_so_much/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "o2f1gh7",
          "author": "AdHot2249",
          "text": "They're automation tools, all tools require knowledge and experience. Chatgpt can help you solve many things and challenges, but mostly attacking each small task, and the old premise is always true: good input, good output!",
          "score": 3,
          "created_utc": "2026-01-29 14:40:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ezqu3",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 2,
          "created_utc": "2026-01-29 14:31:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2f7n1i",
          "author": "Radiant_Mind33",
          "text": "Because auto generation can't do it all.\n\nTest it on your stupid phones search bar. That's where LLM's really came from. Not from some deep research facility, but from a dashboard. A dumb telemetry bot that tries to guess user intent and how jittery you are. That's it.",
          "score": 2,
          "created_utc": "2026-01-29 15:09:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2fwwor",
          "author": "SadEcho8331",
          "text": "Bro can you not think for yourself or do you need AI to do that for you too? These things are tools. A hammer will drive in a nail, but you still gotta swing it",
          "score": 2,
          "created_utc": "2026-01-29 17:02:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2fzydu",
              "author": "casual_observer05",
              "text": "I am not talking about thinking, but learning a new tool. \n\nLet's say you are a n8n user for a long and recently started using Zapier. \n\nYou want to make a reminder that triggers when someone on LinkedIn replied to you.   \nNow How will you know which apps already exist, which parameter to monitor in it, why this current step is failing with no proper error flag ( I mean detailed error explanation) etc.   \n\n\nYou might not even know what \"Scenario\" in n8n called in Zapier.   \nThis, for new user is so hectic to figure out.  \n\nThe ask is help the user achieve the setup fast when he knows what he want by figuring out exact elements to do that.",
              "score": 1,
              "created_utc": "2026-01-29 17:16:44",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2f5j4u",
          "author": "GetNachoNacho",
          "text": "automation tools like Zapier and Make are powerful but require a lot of manual learning. The issue is that they focus on nodes and triggers, not on how people think about tasks. To set up workflows like “monitor mentions” or “enrich leads,” I often rely on trial and error, community forums, and ChatGPT for guidance\n\nI think outcome-driven guidance like ready-to-go templates for specific tasks would make these tools much easier to use and faster to set up",
          "score": 1,
          "created_utc": "2026-01-29 14:59:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2fkm72",
          "author": "Business-Cherry1883",
          "text": "Totally feel this. “Send lead to CRM” sounds simple, but under the hood every app has different data models (custom fields, enums, date formats, identity matching), so the abstraction layer leaks.\n\nAutomation tools give you plumbing + triggers, but you’re still the architect: pick a source of truth, map fields, handle edge cases, and build retries.\n\nAI is getting better at suggesting mappings, but it still can’t guess business rules you haven’t written down.",
          "score": 1,
          "created_utc": "2026-01-29 16:08:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2fokr5",
          "author": "Equal_Ad_7668",
          "text": "I have different opinions based on my experience I see tools are more capable now, handling more complex use case and require less coding. \n\nWe recently switched from Postman to Postmate Client for our API automation, and the difference has been impressive. It supports both traditional scripting and simple plain-English style assertions, which makes writing and maintaining tests much faster and easier",
          "score": 1,
          "created_utc": "2026-01-29 16:25:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2g5cfr",
          "author": "SkylineAnalytics",
          "text": "Low code solutions are kind of snake oil. You need knowledge to do things the right way or you need expertise and patience to use these tools. There is no magic bullet despite what anyone tells you.",
          "score": 1,
          "created_utc": "2026-01-29 17:41:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2g87k0",
          "author": "shesprettytechnical",
          "text": "You're expecting a tool to automate something that is inherently complicated at any level of scale. Creating that automation is also going to be complicated and/or require a steep learning curve.\n\n  \nThere is no free lunch when it comes to integrations, full stop.",
          "score": 1,
          "created_utc": "2026-01-29 17:54:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2hw47k",
          "author": "ChimpKey-Automation",
          "text": "You don't need to be a pro of any-sort with ChimpKey, you just need to have a functioning brain and a heart beat. ChimpKey does the full and complete set up for you in one day. You don't lift a finger. Once you're set up with ChimpKey it's a set-it and forget situation with 100% accuracy and your file arrives right into your desired system within 30 seconds flat.",
          "score": 1,
          "created_utc": "2026-01-29 22:36:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2mvlnl",
          "author": "AIToolReviewer",
          "text": "I see this pattern frequently in the AI tools space - there’s a massive gap between\n\n“the tool can do it” and “I know how to make the tool do it.”\n\nYou’ve identified something important: people think in outcomes (“monitor\n\nmentions and trigger workflow”) but tools are built around features (nodes,\n\ntriggers, connectors). That translation layer is where all the friction lives.\n\nThe fact that you’re asking ChatGPT how to wire automation tools together\n\nis telling. We’re using AI to figure out how to use automation tools, which\n\nsuggests the tools themselves aren’t intuitive enough.",
          "score": 1,
          "created_utc": "2026-01-30 17:09:48",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}