{
  "metadata": {
    "last_updated": "2026-01-18 16:49:53",
    "time_filter": "week",
    "subreddit": "automation",
    "total_items": 20,
    "total_comments": 215,
    "file_size_bytes": 206657
  },
  "items": [
    {
      "id": "1qaqdog",
      "title": "What are the most useful business automations in 2026?",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qaqdog/what_are_the_most_useful_business_automations_in/",
      "author": "dewharmony03",
      "created_utc": "2026-01-12 09:21:39",
      "score": 88,
      "num_comments": 37,
      "upvote_ratio": 0.96,
      "text": "Last year was pretty big on automations especially with AI and stuff! I see a lot of automations on this page that is useful for personal use etc.\n\nBut I am curious, what are the most useful business automations most entrepreneurs should know about in your opinion?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qaqdog/what_are_the_most_useful_business_automations_in/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "nz5020i",
          "author": "apsiipilade",
          "text": "There are two I can think of. The first was A/B testing ads! Using tools like Plai and N8N, ourr team was able to setup an automation flow that automatically uses Google Nano Banana and Gemini to generate ad variations using our Google ads data! This is then tested and auto improved on based on results! This is literally manual work that used to take ours and freelance designers to modify the assets!\n\nSimilarly,  stuff like analyzing content gaps on Google search console to improve google ranking and creating content for this has been completely automated using AI agents like Frizerly for us! The key is ensuring the agent is plugged into all your data sources including customer case studies, product data etc! Its pretty cool how it can auto publish blogs on our website and then cross post then automatically on social media etc!",
          "score": 36,
          "created_utc": "2026-01-12 10:13:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "nz569xg",
              "author": "Bigmacman_",
              "text": "Wow . . . I've been playing around with Google adwords for a long time. It's been a while since I've used it but with the advent of Nana bananas and all of these AI agents, programmable advertising is getting a lot more interesting.",
              "score": 6,
              "created_utc": "2026-01-12 11:09:54",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nz6cdpp",
              "author": "saneporcupine",
              "text": "we would love to know your process if optimizing google ads . ofcourse can't really expect you to give it away but just some pointers to help us get started.",
              "score": 1,
              "created_utc": "2026-01-12 15:29:06",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nzgl308",
              "author": "Analytics-Maken",
              "text": "Have you thought of using ETL services like Windsor ai to move the data? I usually consolidate every data source (Google Ads, Facebook Ads, CRMs) into a warehouse like BigQuery using those tools and run AI on top, they have better performance, support for multiple sources, and maintain the data up to date.",
              "score": 1,
              "created_utc": "2026-01-14 01:24:59",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nz5he8x",
              "author": "rhaduqu",
              "text": "This sounds absolutely fantastic. Mind on sharing some pointers and best practices?\nIs it fully automated or hybrid, and there's still manual work done before publishing?",
              "score": 1,
              "created_utc": "2026-01-12 12:36:16",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nz58vd9",
          "author": "Accomplished-Ship559",
          "text": "Hey! Most useful automations are usually the most foundational. Some examples:\n\n- fully automated client onboarding system \n- reduce as much manual data entry as possible\n- market and competitor research \n- lead sourcing/tracking - NOT the content you send them as the AI slop can be identified a mile away\n- CRM management \n\nThe fancy automations/AI stuff should be built once the foundational systems are in place otherwise they wont be effective.",
          "score": 9,
          "created_utc": "2026-01-12 11:31:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz5msu8",
          "author": "Glad_Appearance_8190",
          "text": "imo the most useful biz automations arent the flashy ai ones, its the boring stuff that removes risk. things like order to cash flows that reconcile themselves and flag weird edge cases instead of just pushing data through. approval and exception routing is another big one, esp when rules change or data is missing. ive seen a lot of teams automate “happy paths” and then spend more time cleaning up failures later. the automations that age well are the ones that explain what they did and why, so when something breaks youre not guessing. predictability beats clever most of the time....",
          "score": 7,
          "created_utc": "2026-01-12 13:11:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz4yyaq",
          "author": "CarpathianEcho",
          "text": "For us, anything that cuts down repetitive tasks without messing with quality is gold, automated abandoned cart emails, low stock alerts, and scheduled financial summaries save hours. AI’s nice, but even basic automations like tagging customers based on behavior or syncing order data into spreadsheets make a real difference. It’s less about flashy tools and more about setting up small things that quietly run in the background and keep the wheels turning.",
          "score": 7,
          "created_utc": "2026-01-12 10:03:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz5rnaz",
          "author": "GetNachoNacho",
          "text": "The biggest wins come from automating revenue-adjacent work: lead routing, follow-ups, onboarding, billing, and support. Anything that reduces delay between intent and action usually pays off fast.",
          "score": 3,
          "created_utc": "2026-01-12 13:40:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz591wh",
          "author": "Common-Cat-7884",
          "text": "We started using Envoice in our business and it’s been a game changer for cutting down wasted time.",
          "score": 2,
          "created_utc": "2026-01-12 11:33:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz5k3v7",
          "author": "meowmouthh",
          "text": "Integrate webhooks for seamless app syncing. Automate feedback loops via forms to CRM. Set conditional alerts for stalled workflows. For knowledge automation in teams, Sensay's often a good fit among options. What's one automation that surprised you with ROI?",
          "score": 2,
          "created_utc": "2026-01-12 12:54:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz5s0fh",
          "author": "HarisShah123",
          "text": "In my experience, automating customer follow ups, lead qualification, and content scheduling has been game changing. AI for personalized email sequences and CRM triggers saves so much time, and automating reporting/dashboards gives clarity without the busy work.",
          "score": 2,
          "created_utc": "2026-01-12 13:42:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz70h23",
          "author": "Corgi-Ancient",
          "text": "For 2026, automations that save time on lead gen and outreach are huge. Tools like SocLeads that pull and verify contacts from places like Google Maps and socials can really cut down the manual work and help you focus on closing deals. If you’re doing sales or marketing, that kind of automation is a game changer.",
          "score": 2,
          "created_utc": "2026-01-12 17:20:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz7uk3h",
          "author": "MajorDivide8105",
          "text": "Lead handling is a big one: capturing leads, enriching them, scoring them and pushing clean data into a CRM. Tools like Clay, HubSpot workflows and Cubeo AI all help here in different ways, mostly by cutting out manual research and cleanup.\n\nContent is another. Not writing posts automatically, but doing things like keyword research, outlining, updating old content and keeping things consistent. Surfer, Search Console and some custom AI workflows cover most of that.\n\nAnd then internal ops: routing messages, updating spreadsheets, syncing tools, alerts. Zapier, Make, or n8n still do a ton there.\n\nThe pattern is simple: automate the stuff you repeat every week so you can spend time on decisions, not copy-paste work",
          "score": 2,
          "created_utc": "2026-01-12 19:36:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz4zlf6",
          "author": "tjmakingof",
          "text": "Automated blog drafts. Would not trust anything fully automatic yet (in content niche), but hybrid approach saves a good chunk of time.",
          "score": 2,
          "created_utc": "2026-01-12 10:09:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz4xe28",
          "author": "gptbuilder_marc",
          "text": "The most useful automations I see actually fall into a few boring but high leverage buckets rather than flashy AI demos. Lead intake and qualification so humans only touch real opportunities. Reporting and alerts so you know when something breaks before revenue drops. Internal handoffs so work moves without Slack babysitting. And simple customer facing automations like follow ups, scheduling, and status updates. The big unlock is not replacing people, it is removing repetitive coordination and decision latency across the business.",
          "score": 4,
          "created_utc": "2026-01-12 09:48:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz4xi5s",
          "author": "Plastic_Brain8987",
          "text": "I think the main benefit for businesses using AI is to automate the boring repetitive work and tasks that can suffer from decision fatigue.\n\nYou can see these in two main categories.\n\nThere's agentic workflows that break down complex tasks and pass them over to the AI to take care of. Think handling marketing campagins, sales follow-ups, or customer support. Some good tools maybe look at Zapier, Salesforcem or Automation Anywhere\n\nThen there AI Decisioning. Basically, your AI brain can do the agentic workflow side of things, but adds in intelligence. Making decisions based on data instead going on your gut. Tools for this, look at Hightouch, Braze, or Optimizely. \n\nTop two automations I've seen good success with is automating our lifecycle personalization. Basically give the AI all the context and it sends out messaging and whatnot to each customer based on their past data. And customer support. Getting AI to help triage problems rather than them being sent straight to a human.",
          "score": 2,
          "created_utc": "2026-01-12 09:49:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz4v7vr",
          "author": "newrockstyle",
          "text": "Top business automation, AI email/CRM, social media scheduling, chatbots, and automated reports.",
          "score": 1,
          "created_utc": "2026-01-12 09:27:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz4uo8l",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-12 09:21:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz5s4pz",
          "author": "steve___smith",
          "text": "honestly in 2026 the most useful business automations power tool are like ai chatbot for customer suppert and email and marketing follow ups etc these tools are helpuful for us in boring work",
          "score": 1,
          "created_utc": "2026-01-12 13:43:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz5u6d5",
          "author": "Patient_Hippo_3328",
          "text": "Automating invoicing expense tracking lead follow ups in crm and basic customer support replies probably save me more time than anything else day to day.",
          "score": 1,
          "created_utc": "2026-01-12 13:54:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz6fn0w",
          "author": "Cold_Ad8048",
          "text": "CRM and follow-ups, customer support chatbots, and basic workflow automations are the big ones.",
          "score": 1,
          "created_utc": "2026-01-12 15:44:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz6kpoi",
          "author": "More_Couple_236",
          "text": "I work at Wrk, a managed service automation company. Some of the high-value automations we set up for clients include:  \n\\- Performing lead generation based on online criteria or contact databases and syncing directly to their CRM  \n\\- Creating bills and invoices directly in QuickBooks Online and other accounting services.  \n\\- Removing any copy and pasting that their company is doing between spreadsheets or applications.",
          "score": 1,
          "created_utc": "2026-01-12 16:08:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz6szr8",
          "author": "championof_planet2",
          "text": "The most useful automations I see in 2026 are around document processing, customer support, and social content.\nDocument processes like extracting data from PDFs and emails, validating it, and pushing it into internal systems without manual work.\nCustomer support where tickets are classified automatically, context is pulled from docs and CRM, replies are drafted, and humans step in only for edge cases.\nSocial and content automation where internal documents, product updates, or analytics data are turned into posts and published across channels automatically.\nThese solve boring but expensive problems and actually reduce day-to-day operational load.",
          "score": 1,
          "created_utc": "2026-01-12 16:45:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz6v6x1",
          "author": "Nastya_Tan",
          "text": "Top business automations in 2026 include AI email triage, CRM updates, invoicing, inventory tracking, social media scheduling, customer support chatbots, and workflow automation connecting multiple tools to save time and reduce errors.",
          "score": 1,
          "created_utc": "2026-01-12 16:55:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz725ke",
          "author": "robauto-dot-ai",
          "text": "Advertising is the intersection between AI and profit",
          "score": 1,
          "created_utc": "2026-01-12 17:27:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz9puq7",
          "author": "Oldguy3494",
          "text": "slide creation in gamma and day plan creation in saner",
          "score": 1,
          "created_utc": "2026-01-13 01:09:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzazsnq",
          "author": "Gullible-Storm9278",
          "text": "I think automating social media responses is huge, especially for small businesses trying to keep up with engagement. I tried something like Subleadit recently, and it saved me so much time just managing interactions on Reddit. Honestly, anything that cuts down on the busy work is a win in my book!",
          "score": 1,
          "created_utc": "2026-01-13 05:36:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzbvbr2",
          "author": "TeamAlphaBOLD",
          "text": "The boring stuff honestly saves the most time, automated invoice reminders and CRMs that log customer interactions without manual data entry. Microsoft D365 features solid workflow automation that connects sales and customer data pretty seamlessly, cutting follow-up headaches. \n\nThe best approach is starting with whatever's eating up the most time. One automation done right beats ten half-baked ones.  \n\nImpact also depends on the business type.",
          "score": 1,
          "created_utc": "2026-01-13 10:20:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzc7og1",
          "author": "ExchangeOld7517",
          "text": "Yes most of the automations that stuck for us are boring like reducing manual approvals and cleaner handoffs to accounting mattered more than ANY AI workflow. We still automate around reporting and ops but even basic things like cards + receipts flowing cleanly into the books, we use Ramp for that piece saved more time than any flashy setup.\n\nThe useful automations are the ones you stop thinking about.",
          "score": 1,
          "created_utc": "2026-01-13 12:06:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzcs2fd",
          "author": "realtechobserver",
          "text": "While it can seem minor, but I think every detail you miss or forget can lead to several issues down the road especially when trying to establish yourself as a reliable leader. I’ve set up tools that automatically summarize meetings, pull out to-do lists, and log key decisions, which has saved me a ton of time and made sure nothing slips through the cracks. Could not Imagine my life without it now",
          "score": 1,
          "created_utc": "2026-01-13 14:11:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzeba1h",
          "author": "Fun-Hat6813",
          "text": "Document processing is the big one nobody wants to talk about because it sounds boring. Every business I've worked with spends insane hours just moving data from PDFs into their systems. invoices, contracts, statements - all that paper that somehow still runs the business world.\n\n\n\nI saw a mid-size lender last month processing loan apps manually... their team was literally typing numbers from bank statements into Excel. Six people doing nothing but data entry all day. We set up Starter Stack AI for them and now those same docs get processed in minutes instead of hours. The kicker? Their error rate dropped to basically zero because machines don't get tired at 4pm and transpose numbers.\n\n\n\nThe other automation that's criminally underused is decision routing. Not the fancy AI stuff - just basic \"if this then that\" workflows for approvals and escalations. Most companies still email back and forth for days on simple yes/no decisions. Set up proper routing rules and suddenly your ops team isn't playing email ping pong anymore.. they're actually doing real work. Though getting people to trust automated routing is its own battle - everyone thinks their situation is too special for rules.",
          "score": 1,
          "created_utc": "2026-01-13 18:42:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzexmqz",
          "author": "TheNewFundamentals",
          "text": "lol business automation is kinda wild — there’s a bunch of hype but the most useful stuff is the everyday stuff ppl use.\n\n\n\nAuto crm/email workflows are huge, social scheduling means no more midnight posting, automating reports and alerts keeps you in the loop, and simple chat/autoresponders handle questions while you sleep. That’s the type of automations folks actually thank you for lol.",
          "score": 1,
          "created_utc": "2026-01-13 20:24:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzfzkbl",
          "author": "Afraid_Emergency5199",
          "text": "From what I’ve seen, the biggest wins for businesses come from automating lead handling, customer support, and internal reporting. Simple workflows like auto-qualifying leads, syncing CRM data, or generating weekly performance dashboards can save hours and reduce human error almost instantly.",
          "score": 1,
          "created_utc": "2026-01-13 23:27:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzi3dcy",
          "author": "Physical_Shop_1445",
          "text": "I have tried two - YouTube and Art\n\nYouTube is still not successful. No viral content yet. Still working on this\n\nBut AI Art, I do this as a side hustle. \n\nI use AI tools to create my art (in a specific niche) and sell them on POD and micro stock platforms.\n\nI want to try more automations but my other business takes most of my time. :)",
          "score": 1,
          "created_utc": "2026-01-14 07:32:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz5fh46",
          "author": "monalisasmiles",
          "text": "Im thinking the following  \nNotebook LM,  \nMake  \nand maybe n8n/with something like google sheets and either 11 labs or base44",
          "score": 0,
          "created_utc": "2026-01-12 12:22:34",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qdlmxc",
      "title": "Got tired of reading AI news, so I built an automation that does it for me (18 sources, 100+ hrs saved)",
      "subreddit": "automation",
      "url": "https://i.redd.it/nbyezmwa1jdg1.png",
      "author": "ScratchAshamed593",
      "created_utc": "2026-01-15 14:54:32",
      "score": 83,
      "num_comments": 31,
      "upvote_ratio": 0.83,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qdlmxc/got_tired_of_reading_ai_news_so_i_built_an/",
      "domain": "i.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "nzs7p3n",
          "author": "archenoid",
          "text": "So you are using AI to read AI generated news about AI?",
          "score": 42,
          "created_utc": "2026-01-15 19:26:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "nztfbkr",
              "author": "cool-beans-yeah",
              "text": "Aye.",
              "score": 12,
              "created_utc": "2026-01-15 22:51:14",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nzvdqjc",
              "author": "BuildAISkills",
              "text": "It's AI all the way down.",
              "score": 2,
              "created_utc": "2026-01-16 05:37:51",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzqn6rs",
          "author": "MikeGriss",
          "text": "All these feeds should be in one node, this isn't an efficient way.",
          "score": 14,
          "created_utc": "2026-01-15 15:12:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzrfs1v",
          "author": "DilapidatedUranus",
          "text": "Intrigued about your sources! Can you DM me them? \n\nGood luck with the agency. Sounds  cool.",
          "score": 4,
          "created_utc": "2026-01-15 17:22:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzuange",
              "author": "xatey93152",
              "text": "100% Gen Z",
              "score": -1,
              "created_utc": "2026-01-16 01:41:42",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzrowof",
          "author": "New-Yesterday2755",
          "text": "Not sure which workflow builder is this, but I'm pretty sure you can just create a list with all url and rss feeds, have one code node to format the data and run it in a loop. \n\nThat way you can add unlimited amount of sources. Now each new source will grow this huge column. Difficult to maintain, difficult to scale.",
          "score": 3,
          "created_utc": "2026-01-15 18:03:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o02eiym",
              "author": "Ronenkha",
              "text": "They like it 6inches+",
              "score": 0,
              "created_utc": "2026-01-17 06:54:33",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzrlo2z",
          "author": "curiousjbird",
          "text": "I built an app that does essentially the same, it takes in feeds via google alerts, then it will review the articles, create your own newsletter, formatted how you want (i.e. for linkedin, email, etc). Even with that it is hard to stay up with everything going on.",
          "score": 5,
          "created_utc": "2026-01-15 17:48:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzsg3nh",
              "author": "TehnoMuda",
              "text": "Could you share the app? I would be really grateful",
              "score": 0,
              "created_utc": "2026-01-15 20:05:23",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nztfjym",
                  "author": "curiousjbird",
                  "text": "Its not share-ready, sorry--its on the list though!",
                  "score": 0,
                  "created_utc": "2026-01-15 22:52:27",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzrmbgq",
          "author": "sumyahirugynok",
          "text": "I automated specific news",
          "score": 2,
          "created_utc": "2026-01-15 17:51:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzs8l4j",
          "author": "Outrageous_Concept_1",
          "text": "So i built something similar a couple years ago, but have consistently seen that news sources i trust (all the major papers, most of the decent feeds) are now beyond firewall or limit the text they put on show. I've messed about with Selenium to make use of my personal subscriptions/feeds, but that's not really in the fair use policy, our in the spirit of the game. Anyone else seeing the same?",
          "score": 2,
          "created_utc": "2026-01-15 19:30:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nztz4qz",
          "author": "eleiele",
          "text": "What tools did you use?  Curious",
          "score": 2,
          "created_utc": "2026-01-16 00:37:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzu84vq",
          "author": "HoraceAndTheRest",
          "text": "Just curious: 100 hours divided by 18 sources equals some 5.5 hours of reading per source, per week.   \n  \nWas that the time you were spending reading each source before your automation, or is there some other factor involved?",
          "score": 2,
          "created_utc": "2026-01-16 01:27:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzvdyeo",
              "author": "BuildAISkills",
              "text": "Deep reading of AI news.",
              "score": 0,
              "created_utc": "2026-01-16 05:39:27",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzv5lq2",
          "author": "reallybadposter",
          "text": "A simpler version - grok api with topics, email gets sent everyday at 6am via github actions.",
          "score": 2,
          "created_utc": "2026-01-16 04:41:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzvi2dh",
          "author": "BuStiger",
          "text": "Good stuff man, I did a similar thing but only for Reddit. Can you share the newsletters that you are using?",
          "score": 2,
          "created_utc": "2026-01-16 06:10:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzw8pyg",
          "author": "worldofjaved",
          "text": "Very interesting. Thanks for sharing the template.",
          "score": 2,
          "created_utc": "2026-01-16 10:06:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzzzqck",
          "author": "flashmyhead",
          "text": "How many hours did it take to create this amazing paint picture?",
          "score": 2,
          "created_utc": "2026-01-16 21:46:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzqjh41",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-15 14:54:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o02i5uf",
          "author": "Capable_Foot_7183",
          "text": "Which sources?",
          "score": 1,
          "created_utc": "2026-01-17 07:27:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o03q6oj",
          "author": "autom8r_",
          "text": "Haha, we really have come full circle.",
          "score": 1,
          "created_utc": "2026-01-17 13:42:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o04hbhr",
          "author": "outatime37",
          "text": "What is the point",
          "score": 1,
          "created_utc": "2026-01-17 16:02:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o061pok",
          "author": "PerformanceMore8771",
          "text": "This is wild!",
          "score": 1,
          "created_utc": "2026-01-17 20:30:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzudkwq",
          "author": "automator71",
          "text": "This is such a clean implementation. The RSS + API approach is solid for content aggregation. What's cool is that you could scale this way further without code changes - just add more feeds to the list.\n\n\n\nI've been building similar workflows for clients using n8n. The pattern is almost identical - pull data from multiple sources, pipe it through an LLM for summarization, then format and deliver. Saves people crazy amounts of time.\n\n\n\nGood on you for building the automation agency angle too. This exact type of project is what people pay real money for. How are you handling the delivery/distribution of those summaries? Email, Slack, dashboard?\n\n\n\nWould be great to follow your journey on this. Looking forward to seeing where this grows.",
          "score": 1,
          "created_utc": "2026-01-16 01:58:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzx9eje",
          "author": "dimebag_lives",
          "text": "Nice, now you can read all the news for just 250USD per day 🎉",
          "score": 0,
          "created_utc": "2026-01-16 14:17:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o056ofl",
          "author": "IntroductionSouth513",
          "text": "you are missing out if you let AI do all the reading for u, don't be lazy now",
          "score": 0,
          "created_utc": "2026-01-17 18:01:39",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qb1qxy",
      "title": "Automation tools got really good, but building the right workflows still feels hard",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qb1qxy/automation_tools_got_really_good_but_building_the/",
      "author": "uprisingrundown",
      "created_utc": "2026-01-12 17:48:27",
      "score": 55,
      "num_comments": 21,
      "upvote_ratio": 0.92,
      "text": "I’ve been automating parts of my work for a while now, and one thing I keep noticing is that the tools themselves aren’t really the problem anymore. Between things like Zapier, Make, n8n, scripts, and APIs, you can technically connect almost anything to anything.  \n  \nWhat’s harder is deciding what’s actually worth automating and how far to push it before it turns into something fragile. I’ll automate one annoying step, then realize it quietly depends on five other steps being clean and consistent. Before I know it, I’m maintaining a small system instead of saving time. Debugging edge cases, dealing with messy data, hitting rate limits, handling weird failures it starts to feel less like automation and more like ops work.  \nI’m curious how other people here think about this. Do you aim for “good enough” automation or try to go end to end? How do you decide when a workflow is worth maintaining long term versus just doing it manually? And how do you keep automations from becoming something you’re afraid to touch a few months later?  \n  \nWould love to hear how others are approaching this now, especially outside of pure engineering teams.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qb1qxy/automation_tools_got_really_good_but_building_the/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "nzc6g8k",
          "author": "No_Technology8821",
          "text": "I relate to this a lot. The tools are insanely capable now, but the hard part is knowing where to stop. I’ve had plenty of automations that technically worked but slowly turned into something fragile that I was afraid to touch. It starts as “let me save 5 minutes,” then suddenly you’re maintaining a tiny system with assumptions baked in from six months ago.\n\nUsing Clay helped me mainly by changing what I automate. I don’t try to build full end-to-end flows anymore. I use it more for the messy thinking parts: pulling data from multiple places, adding a bit of context, spotting signals, and deciding whether something is even worth acting on. Once that decision is clear, the rest of the workflow can stay simple or even manual without feeling like a step backward. The automations that last for me are the ones with a narrow job and low blast radius. One table does enrichment or research, another just scores or flags things, and that’s it. If something breaks, I can rerun or tweak it without unraveling everything. That shift made automation feel useful again instead of like ops debt I was quietly accumulating.",
          "score": 11,
          "created_utc": "2026-01-13 11:56:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz76p65",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-12 17:48:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz7so5u",
          "author": "meowmouthh",
          "text": "Start small with one bottleneck, test with real data. Document dependencies to avoid fragility. For knowledge workflows in teams, Sensay's a solid option among others. How do you handle those sneaky edge cases?",
          "score": 1,
          "created_utc": "2026-01-12 19:27:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz80ly4",
          "author": "Accomplished-Ship559",
          "text": "Map out your entire processes, from the very beginning e.g. lead gen all the way to the end i.e client offboarding/renewal. So this on a white-boarding tool, and literally map out each exact step. \n\nOnce you have finished this, go ahead and identify the gaps and inefficiencies you have in your workflows and overall systems. \n\nAutomations and AI are only as good as your core foundations. \n\nI do this for many of my clients.",
          "score": 1,
          "created_utc": "2026-01-12 20:04:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz8ahaw",
          "author": "purplegrape_dev",
          "text": "sync up with claude code and load the .json (if you’re using n8n)",
          "score": 1,
          "created_utc": "2026-01-12 20:50:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz976fq",
          "author": "Reasonable-Life7326",
          "text": "The \"aha!\" moment is the hardest part.",
          "score": 1,
          "created_utc": "2026-01-12 23:29:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzaabfe",
          "author": "Electronic-Cat185",
          "text": "I think the trap is tryiing to automate intent insttead of automating a very specific, stable action. the workflows that age well usually replace one clearly defined step, not a whole process with a lot of judgment baked in. when I aiim for “good enough,” i ask whether I would still trust this if i did not look at it for three months. if the answer is no, it probably needs to be smaller or left manuall. treating automations like living systemss with ownership and periodic pruning hellps too, otherwiise they quietly turn into the thing you are working around instead of for.",
          "score": 1,
          "created_utc": "2026-01-13 03:00:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzad9vr",
          "author": "codegeorgelucas",
          "text": "Totally agree. The tools are powerful, but over automating is where it starts to break down. I’ve found that simple workflows I can understand at a glance last way longer than complex ones that “do everything.” If it needs constant fixing, it probably shouldn’t be automated in the first place.",
          "score": 1,
          "created_utc": "2026-01-13 03:16:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzb96sj",
          "author": "PollutionTimely6602",
          "text": "find someone to do it with/for me. 😉",
          "score": 1,
          "created_utc": "2026-01-13 06:52:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzbixcs",
          "author": "Few-Meringue2017",
          "text": "I relate to this a lot. The tools are powerful now, but workflows get fragile when you try to hard-code every edge case.\n\nWhat’s helped me is using AI for the decision-making parts instead of rigid rules. I’ve been experimenting with TenseAI to handle things like intent understanding and next-step decisions, while keeping the rest of the automation simple.\n\nFeels more flexible and easier to maintain long term. Curious how others are approaching this.",
          "score": 1,
          "created_utc": "2026-01-13 08:21:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzbtjuj",
          "author": "CheckOut4pm",
          "text": "Yep, half the time you end up automating the wrong steps first and have to redo them later, the tricky bit is deciding what actually needs to be automated before you start wiring everything together.",
          "score": 1,
          "created_utc": "2026-01-13 10:04:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzcraie",
          "author": "signal_loops",
          "text": "at scale, the tools stop being the constraint and the workflow design becomes the risk. the question I usually ask is not can this be automated, but who owns it when it fails and how visible that failure is. End to end automation looks great on paper, but it quietly creates operational debt if the inputs are not stable or governed. Good enough automation with clear boundaries is often safer than fragile completeness. If a workflow needs constant babysitting or tribal knowledge to debug, it probably should not exist yet. Visibility and explainability matter more than saving the last manual step, especially once other people depend on the outcome.",
          "score": 1,
          "created_utc": "2026-01-13 14:07:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzd5f2d",
          "author": "Framework_Friday",
          "text": "We've seen this pattern play out a lot where someone automates a task, feels great about it, then six months later they're maintaining a fragile system that breaks every time an API changes or data comes in slightly different. The automation becomes the job.\n\nWhat's worked better is thinking in stages instead of trying to automate everything at once. Start with something that runs manually when you trigger it, make sure it handles the messiest version of your data, then decide if it's stable enough to run on a schedule. A lot of workflows don't need to be fully autonomous, having a human check one decision point in the middle is often way more reliable than trying to account for every edge case.\n\nThe other thing is knowing when not to automate. If a task changes frequently or the rules are fuzzy, automation just becomes technical debt. Sometimes a checklist is better than a workflow.\n\nFor deciding what's worth maintaining long term: if it saves you more time than it takes to fix when it breaks, keep it. If you're spending more time debugging than you saved, kill it or simplify it.",
          "score": 1,
          "created_utc": "2026-01-13 15:19:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzezglm",
          "author": "tosind",
          "text": "I run multiple businesses and use n8n, Zapier, and Make daily. My approach: start with \"good enough\" automation that solves 80% of the problem, then iterate based on actual pain points rather than imagined edge cases.\n\n\n\nFor example, I built a lead enrichment workflow with Apollo that saves \\~50 hours/week. Could I optimize it more? Sure. But the ROI diminishes fast once you hit that 80% mark.\n\n\n\nThe real skill isn't picking the perfect tool—it's knowing when to stop tweaking and let the automation run. Most fragile workflows fail because we over-engineer them upfront instead of letting real-world use reveal what actually needs to be robust.",
          "score": 1,
          "created_utc": "2026-01-13 20:32:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzgy82o",
          "author": "ops_architectureset",
          "text": "this shows up a lot. the pattern behind it is that automation exposes upstream mess instead of removing it. good workflows usually stop at the point where data quality or ownership gets fuzzy. once an automation needs constant exception handling, it has effectively become a process, not a shortcut. what helps long term is being explicit about the failure modes you are willing to tolerate and leaving the rest manual.",
          "score": 1,
          "created_utc": "2026-01-14 02:39:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz7nrnv",
          "author": "alfieranst",
          "text": "Have you tried instruct.ai? If not - it's AI automation but purely natural language: built/maintained/etc fully by the agent itself - intention is to completely remove the fragility you mention & also massively reduce the setup time. Only obvious downside is that due to requiring inference on every run it's higher cost than Zapier/n8n/etc.\n\n(disclaimer - I am a founder)",
          "score": -3,
          "created_utc": "2026-01-12 19:04:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz7ogfa",
          "author": "TheLawIsSacred",
          "text": "I feel you. \n\nI am a non-developer yet built my own \"AI Panel\" with unified memory across all my web subscription frontier models.\n\n**For skimmers**: The minimal version involves about 2-3 browser tabs with AI models of your choice, providing the same prompt to each, and comparing outputs manually. That catches some errors a single model would miss.\n\n*But* for white collar professional work - whether legal analysis, financial documents, or technical specs - \"some\" isn't good enough.\n\nThe above minimal approach lacks persistent memory (you're re-explaining context every session), structured adversarial prompts (models politely agree rather than attack each other's reasoning), and artifact verification (no one's checking citations against primary sources).\n\n*What follows is what happens when I addressed these gaps systematically.*\n\n**What it gets me:**\n\n1. **Fast drafting**: Claude Desktop app orchestrates 3-6 rounds with my other AI Panel members while I go for a morning walk.\n\n2. **Hard verification**: Approximately 5 models adversarially checking each other's work.\n\n3. **Persistent context**: Spans months of knowledge without re-explaining context every session - no more \"as I mentioned earlier\" when the AI has already forgotten.\n\nI'm my AI Panel's manager. Claude Desktop (Opus 4.5, via Claude Max 5x subscription) handles orchestration - I designated Claude Desktop app as my AI Panel's \"First Among Equals.\"\n\nClaude Desktop controls my web browsers, interacting with other Panel members (ChatGPT Plus, Gemini Pro, Grok, Perplexity Pro, occasionally Copilot). \n\nDuring this automated orchestration, Claude distributes role-specific prompts to each Panel member via browser automation, collects responses, and identifies agreement/disagreement. It flags when one member catches an error another missed and generates follow-up prompts to resolve conflicts.\n\nEach round, Claude produces a running synthesis that sharpens as models pressure-test each other. \n\nBy the final round, Claude delivers consolidated output reflecting surviving consensus - or a clear map of where the Panel diverged and why.\n\nIf my Panel can't agree after 6 rounds (\"Round 6 Hard Stop\"), it escalates to me.\n\n---\n\n**What makes it work:**\n\n**Memory & Context**\n\n- **Unified memory layer**: All Panel members query shared persistent memory (via a specialized PC app + local memory servers + web browser extensions including OpenMemory + each AI's native memory), so context doesn't get lost when switching models or starting new chats.\n\nTo clarify: \"unified memory\" means a shared external repository with retrieval capabilities - local files, a memory database, structured notes - that all models can query on demand. Not shared weights, not magical cross-vendor brain fusion.\n\n**Infrastructure & Automation**\n\n- **MCP infrastructure**: About 10 MCP servers including filesystem, memory, Google Drive, PDF tools, Playwright (browser automation), Context7 (live documentation), desktop-commander, and Windows-MCP.\n\nAlmost all managed through lazy-router - a hierarchical proxy that reduced startup context overhead by lazy-loading tools on demand instead of dumping dozens of tool definitions at startup.\n\n(Note: Anthropic released their own \"Tool Search Tool\" in November 2025 achieving similar context savings. I built lazy-router before this existed.)\n\n- **MCP SuperAssistant proxy**: A browser extension gateway exposing my local MCP tools to browser-based AIs (ChatGPT, Gemini, Perplexity, Grok). They get read-only visibility into my filesystem and memory - so they see what Claude sees, without write access.\n\n(Security note: Browser AIs get read-only access only. Claude Desktop is the only Panel member with write permissions.)\n\n- **Browser automation**: Claude Desktop can read/write to my PC's files, query long-term memory, and interact with browser tabs where other Panel members live.\n\nI also use Claude for Chrome - a recent browser agent that can read pages, navigate sites, fill forms, and execute multi-step workflows across tabs, integrating directly with Claude Code.\n\n**Claude Code & Subagents**\n\nClaude Desktop now includes Claude Code (Anthropic's terminal-based agentic coding tool) built into the interface.\n\nClaude Code offers things my cross-vendor Panel doesn't:\n\n- **Native subagents**: Specialized AI subagents with persistent instructions - like a \"meeting notes processor\" or \"document reviewer\" I spin up without rebuilding prompts each time.\n\n- **True parallel execution**: Multiple subagents run simultaneously on different aspects of a problem, tighter and faster than browser automation latency.\n\n- **Plan Mode**: Claude Code asks clarifying questions upfront and drafts a plan.md file before executing, making complex workflows more predictable.\n\n---\n\n**(Continued in my comment below - External Integrations, Governance, Cost/Time)**",
          "score": -2,
          "created_utc": "2026-01-12 19:08:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "nz7oj05",
              "author": "TheLawIsSacred",
              "text": "## PART 2 \n\n---\n\n**(Continued from the main post of mine, above)**\n\n**External Integrations**\n\n- **NotebookLM integration**: Browser extensions let me push content directly into Google's NotebookLM notebooks for audio summaries, Q&A, or cross-document analysis.\n\n- **Transcription layer**: Otter AI handles meeting/voice transcription, feeding structured notes into the memory layer. (Utility tool, not a Panel member.)\n\n- **Writing polish**: Grammarly catches mechanical errors before final review. (Also a utility, not a Panel member.)\n\n**Governance & Quality Control**\n\n- **Structured response format**: Every Panel member must deliver: position, confidence level with reasoning, dissent from majority (with evidence), blindspot check, and at least 3 novel suggestions not yet raised.\n\nEvery response requires a \"Potential Embarrassment\" self-audit: \"Would you be embarrassed if the user or another Panel member found this sloppy?\" If yes, revise before submitting.\n\nEvery response must conclude with \"Justification of Continued Panel Membership\" - articulating why that contribution earns continued presence on my prestigious Panel.\n\n- **Adversarial verification**: They're competing, not collaborating (with guardrails - Gemini 2.5 Pro and Claude once went for each other's jugulars, so I intervened).\n\nEach must catch others' mistakes. Falsification-first: try to kill your own analysis before submission.\n\n*Important: This isn't majority-vote consensus.* The adversarial prompts instruct each model to attack others' reasoning. For citations/factual claims, I require primary-source verification. The goal is error detection through structured disagreement, not \"three models said it so it must be true.\"\n\n- **Archaeology Gate**: Before proposing new tools, Claude checks what's already been built in prior sessions - searches handoff logs, memory, filesystem. Prevents duplicate effort and institutional amnesia.\n\n- **Approved ≠ Implemented**: Nothing \"works\" until empirically verified. Speculation gets killed fast and documented.\n\n- **Grading + governance**: Every Panel member grades every other member (A+ to F) - including Claude grading itself.\n\nClaude has authority to recommend \"personnel action\" based on performance. Sample recent Claude commentary to ChatGPT Plus: *\"You wrote 800 words about why everyone should write 500 words. The irony is not lost.\"*\n\nGemini Pro was recently on a formal Performance Improvement Plan - barely survived after I threatened to cancel my subscription. (This aligns with what many Redditors have noticed: Gemini 3 Pro consistently fails to follow instructions in prompts or custom instructions/Gems.)\n\n- **Reproducibility**: Every session closes with tailored handoff protocol across multiple save targets (filesystem, native memory, markdown logs). Full traceability - no more \"what did we decide last week.\"\n\n---\n\n**Cost**: ~$300/mo total (Claude Max 5x, ChatGPT Plus, Gemini Pro, Perplexity Pro, Grok, Otter AI, Grammarly).\n\nBut I now work about 50% less than I had to at my same white collar job.\n\nNo API pricing, no token counting - I'd get slaughtered on API given my daily volume.\n\n**Time to build**: 150+ hours over ~6 weeks (PowerShell, JSON schema orchestration, MCP configs, integration plumbing), though much was watching Claude Code work.\n\nWhy so long? Beyond core architecture: debugging ARM64 compatibility (Surface Laptop 7's Snapdragon X Elite breaks many x64-assumed tools), rewriting governance protocols until they stuck, building the handoff system, and iterating through dozens of failed MCP configurations.\n\nPlus constant refinement given how fast AI moves.\n\n**TLDR**: Single-model reliance is how you get hallucinations that slip through. Multi-model adversarial checking catches what any one system misses.\n\n**Anyone else running multi-model setups with formal governance? Curious what others have built.**",
              "score": 0,
              "created_utc": "2026-01-12 19:08:24",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nza1rbu",
                  "author": "LuckyFalcor",
                  "text": "Sounds amazing. Do you have a demo or open source plans?",
                  "score": 2,
                  "created_utc": "2026-01-13 02:14:28",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qe7lzb",
      "title": "Hot take from someone who works in AI automation: most teams are automating the wrong things.",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qe7lzb/hot_take_from_someone_who_works_in_ai_automation/",
      "author": "Better_Charity5112",
      "created_utc": "2026-01-16 05:38:34",
      "score": 55,
      "num_comments": 19,
      "upvote_ratio": 0.92,
      "text": "I work in automation for business, and lately I’ve been seeing the same problem over and over. Teams are racing to automate *front-facing* stuff, AI emails, AI ads, AI content, AI chatbots, while the internal workflow underneath is still held together by spreadsheets, memory, and Slack pings. So what happens? More output. Same chaos.\n\nLeads come in faster, but follow-ups still break.  \nCampaigns scale, but reporting is still manual.  \nAI writes content, but no one knows what actually shipped or converted.\n\nThe automation itself works. The system around it doesn’t. What actually creates leverage isn’t automating the flashy parts, it’s automating the boring internal handoffs nobody wants to touch because they “still work”. Ironically, those are the ones quietly eating the most time and causing the most errors.\n\nCurious if others are seeing the same thing: are people using AI to *move faster into broken systems* instead of fixing the systems first?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qe7lzb/hot_take_from_someone_who_works_in_ai_automation/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "nzw1hnk",
          "author": "VizNinja",
          "text": "I see people using Ai to automate things that would be better just using regular automation tools.  AI is one tool in the automation tool box. AI is not always the best tool.",
          "score": 28,
          "created_utc": "2026-01-16 08:58:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzw7zky",
              "author": "d-a-s-a-l-i",
              "text": "This is a very interesting point. People confuse automation with ai.\n\nA lot of automations shouldn’t depend on AI.",
              "score": 6,
              "created_utc": "2026-01-16 09:59:26",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o03dfgl",
                  "author": "blakeyuk",
                  "text": "Most automation.",
                  "score": 3,
                  "created_utc": "2026-01-17 12:14:04",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzw3z4b",
          "author": "Plastic_Brain8987",
          "text": "Deffo is the case. I've seen businesses trying to implement AI solutions into their business, but they're missing an important component, and that's their data foundation. AI is as only as good as the data you have. And most of the time, it's fragmented across systems and they don't have a complete view of their customers.\n\nWe have a data warehouse, tamed by our data team, so they AI we are using is producing us from great results. We are more about AI making decisions rather than just creating content for ads and emails. Taking care of our lifecycle marketing.",
          "score": 6,
          "created_utc": "2026-01-16 09:22:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzw4r5u",
          "author": "signal_loops",
          "text": "hard agree with this take. I see the same pattern everywhere  teams slap AI on top of broken processes and then wonder why everything still feels chaotic, just faster. automating emails, ads, or chatbots feels productive because it’s visible, but if the underlying system for routing leads, tracking ownership, updating statuses, or closing loops is manual and inconsistent, you’re just amplifying the mess. real leverage comes from fixing and automating the boring internal handoffs how data moves between tools, how decisions are recorded, how work progresses without relying on tribal knowledge or Slack nudges. until those foundations are solid, AI mostly helps teams sprint harder in the wrong direction instead of actually improving outcomes.",
          "score": 3,
          "created_utc": "2026-01-16 09:29:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzw9noz",
          "author": "Turbulent-Isopod-886",
          "text": "Yep, seeing the same.\n\nMost teams automate output before they automate flow. AI makes things faster, but broken handoffs and missing ownership stay broken.\n\nThe real leverage is boring internal stuff: routing, SLAs, state changes, visibility. Until that’s fixed, AI just amplifies chaos.\n\nThat’s where orchestration layers like Konnectify actually help.",
          "score": 3,
          "created_utc": "2026-01-16 10:14:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzwhhsw",
          "author": "Holiday-Draw-8005",
          "text": "Yeah, I see the same thing. It feels like the messy phase before a new order settles in.\n\nAgent writes, automation publishes. Agent analyzes, automation schedules. That combo works way better than pretending agents alone can run everything.",
          "score": 3,
          "created_utc": "2026-01-16 11:22:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzwezel",
          "author": "Beneficial-Panda-640",
          "text": " I completely agree. From my observations of how teams handle complex workflows, automating the flashy external-facing tasks often distracts from the internal chaos. Yes, AI can help scale things like content creation or customer interactions, but if the underlying systems for tracking, reporting, and cross-team coordination are still inefficient, it’s just amplifying the problems.\n\nI’ve seen teams overlook the internal handoffs, those messy workflows between departments or functions that rely on manual tracking and communication. These are the areas that, if automated properly, would create the most significant improvements in efficiency and reduce errors. Fixing those internal bottlenecks first can actually make external automation much more effective and sustainable.\n\nIt’s like automating a broken assembly line, it might move faster, but it won’t be any more reliable. Fixing the process foundation should come first.",
          "score": 2,
          "created_utc": "2026-01-16 11:01:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzx7r7t",
              "author": "hollee-o",
              "text": "Reporting! God, what a clusterfuck. Cross channel campaigns, segmentation, a/b testing cycles, and multiple platforms with shitty APIs…",
              "score": 2,
              "created_utc": "2026-01-16 14:08:42",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzwi2g9",
          "author": "Nina_Neverland",
          "text": "But that has been a problem long before AI, hasn't it? No one actually assessing what the company actually needs but everyone randomly making feature requests (often enough for unnecessary things or sometimes for something that's plain wrong).",
          "score": 2,
          "created_utc": "2026-01-16 11:26:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o00t3zt",
          "author": "Jaded0521",
          "text": "I'm a workflow consultant, so all I fix are the broken systems. And yeah, I see this with. I also see people trying to automate systems that are convoluted, as in, they really only need one app but they want to duct tape four apps together with zapier.",
          "score": 2,
          "created_utc": "2026-01-17 00:21:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o00yqdp",
              "author": "Agent_invariant",
              "text": "Yep - A lot of “automation” work is really just compensating for bad system boundaries.\nI see the same pattern: instead of simplifying the core workflow, people layer glue on top until Zapier becomes the de facto source of truth — and then wonder why things are brittle.\nWhat’s interesting is that once the underlying system has clear ownership of state and transitions, a lot of that duct tape just disappears. Fewer handoffs, fewer retries, fewer places for things to drift.\nMost of the wins come from making the boring parts explicit, not from adding more automation on top.",
              "score": 3,
              "created_utc": "2026-01-17 00:54:27",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzysum1",
          "author": "KevlarArmor",
          "text": "I've been automating our private cloud deployment since 5 years. From OS installation to the final private cloud on multiple nodes. All you need is to give it a few details and you'll have a private cloud deployed on your server or servers depending on how many there are. All under 2-3 hours. (It used to take a week to get all the right configs, details, manual entries and to perform manual steps.)\n\nOh, and it's hardware agnostic so it doesn't care what kinda server you're running on.\n\nWhen I give interviews for new jobs, they ask me about python modules, linux administration and bash syntax. I did use all of the above to make the automation possible but it's not like I remember the code or the proper syntax. Sometimes I took bits and pieces from the code that the senior developers used and Frankenstein'd my way out to maintain uniformity of code.\n\nI know people probably won't consider what I did as automation because there's no AI involved but I did what I needed with what scraps I had.",
          "score": 4,
          "created_utc": "2026-01-16 18:28:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o00a312",
              "author": "Bubbly_Possible9057",
              "text": "Only a tiny % of automation uses AI.",
              "score": 2,
              "created_utc": "2026-01-16 22:37:03",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzvdu5d",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-16 05:38:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzx7lwi",
          "author": "Particular-Bat-5904",
          "text": "I did make my chat gtp automation for daily tasks. Its a below 25MB bundle and can reproduce itshelf on ki aslong its technical allowed there. It engages in every one of my chat gtp random chats now.",
          "score": 1,
          "created_utc": "2026-01-16 14:07:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o01c2mj",
          "author": "ops_architectureset",
          "text": "the pattern behind this is teams optimizing for visible output instead of failure reduction. what we see repeatedly is automation amplifying whatever is already broken underneath. if handoffs and ownership are unclear, ai just moves work faster into the same gaps. deflection or speed looks better, but repeat errors and rework quietly go up.",
          "score": 1,
          "created_utc": "2026-01-17 02:19:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o036kje",
          "author": "techside_notes",
          "text": "This matches what I’ve seen too. Automating the visible stuff feels productive because it ships faster, but it often just amplifies whatever mess already exists underneath. If no one has clarified ownership, handoffs, or what “done” even means, AI just moves confusion around quicker. The boring internal workflows are uncomfortable to touch because they force decisions and tradeoffs. Once those are even slightly cleaner, a lot of automation becomes obvious and less fragile. Otherwise it’s just speed without direction.",
          "score": 1,
          "created_utc": "2026-01-17 11:15:00",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qchr34",
      "title": "What is your automation stack in 2026?",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qchr34/what_is_your_automation_stack_in_2026/",
      "author": "mumplingssmake",
      "created_utc": "2026-01-14 08:11:23",
      "score": 51,
      "num_comments": 30,
      "upvote_ratio": 0.95,
      "text": "We’ve reached a point where a lot of workflows are technically automatable, but only some are worth automating in practice. Over the last year, we’ve seen tools come and go, systems get stitched together, and “set it and forget it” setups quietly fall apart. Some automations now feel essential, others just add fragility.\n\nSo I’m curious how this looks for people actually operating at scale now- not demos or theory, but what’s really running day to day and holding up. What is your automation stack in 2026?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qchr34/what_is_your_automation_stack_in_2026/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "nzi9chs",
          "author": "Ok-Macaron2516",
          "text": "Well Zapier is still in my stack but I did add a whole bunch last year mostly due to changes around AI ig! Here are the ones that I keep paying for now:\n\n* N8N: N8N in my opinion is Zapier on steroids! You can create quiet complex automations using this, especially if you have a technical background as well! \n* Clay: 6 months ago, my team experimented with a new ABM outbound strategy by using Clay. Whenever we get contact information on a really interesting lead, we run a sequence with Clay where we automatically check if we have worked with anyone else in their industry, if we have testimonials to share, and if the company has been in the news lately too.   \n* Frizerly: Their AI agent that learns all about your business and competitors to automatically publish an blog every day on your website to help you improve your Google ranking is pretty impressive! It can auto identify content gaps from competitors, improve based on results etc! Much better tool than Semrush etc imo! \n* Sierra: Sierra is really good at auto resolving repetitive customer support tickets! It can learn from both past answers, your internal docs, faqs etc! We have gotten it to be able to resolve about 50% of all tickets instantly while rest are routed to real humans \n\nCurious what others have it going as well!",
          "score": 17,
          "created_utc": "2026-01-14 08:28:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzl7a6b",
              "author": "ExtraAd7373",
              "text": "Have also been using n8n a lot both internally and for my clients",
              "score": 2,
              "created_utc": "2026-01-14 18:56:12",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzw56ek",
                  "author": "BarberPlayful5984",
                  "text": "The same here :)",
                  "score": 2,
                  "created_utc": "2026-01-16 09:33:24",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nziarvg",
              "author": "BarberPlayful5984",
              "text": "I totally agree with \"n8n in my opinion is Zapier on steroids! \"",
              "score": 1,
              "created_utc": "2026-01-14 08:42:53",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzii937",
          "author": "VizNinja",
          "text": "I hate n8n but it's the best personal productivity took for use with Ai agents on the market at the moment for connecting outside of a Microsoft environment. \n\nCopilot studio is a close 2nd but has more integration if you are in a Microsoft environment. \n\nMost automation does not need Ai.  If your data is structured power bi and power automate will do 95% of what you need.",
          "score": 2,
          "created_utc": "2026-01-14 09:55:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzovo3u",
              "author": "kshoneesh_chaudhary",
              "text": "Are you from the “I hate n8n” club? Count me in :)",
              "score": 2,
              "created_utc": "2026-01-15 07:25:17",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzqytk9",
                  "author": "ice_agent43",
                  "text": "Why exactly? I'm just starting with n8n but seems fine to me.",
                  "score": 1,
                  "created_utc": "2026-01-15 16:05:57",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzi7ik8",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-14 08:11:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nziszmb",
          "author": "Turbulent-Isopod-886",
          "text": "Ours is way leaner in 2026.\n\nWe cut down on long tool chains because they break quietly. Now it’s mostly core systems + event-based triggers + strong logs and manual checkpoints.\n\nWe use Konnectify as the orchestration layer so logic isn’t scattered across tools. Fewer workflows, but each tied to a real outcome.\n\nBig lesson: automation that lasts isn’t about doing more, it’s about failing cleanly and staying understandable.",
          "score": 1,
          "created_utc": "2026-01-14 11:31:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzpv6lb",
              "author": "AI-Software-5055",
              "text": "This is exactly what we found at flowlyn too. We moved away from massive fragile chains in Make and n8n to decoupled micro workflows. When you operate at scale the monolith automations always break eventually. Splitting them up and adding a dedicated error handling layer was the only way we could finally sleep at night. The tools matter less than the architecture in 2026.",
              "score": 2,
              "created_utc": "2026-01-15 12:39:29",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzj81vu",
          "author": "MuffinMan_Jr",
          "text": "N8n\nWindmill\nAWS serverless",
          "score": 1,
          "created_utc": "2026-01-14 13:16:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzjkqy2",
          "author": "InterYuG1oCard",
          "text": "I have clay for lead enrichment, saner for schedule planning and relay for blog writing automation",
          "score": 1,
          "created_utc": "2026-01-14 14:26:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzjn3sq",
          "author": "Fit-Original1314",
          "text": "Mostly scripts and cron jobs. boring but stable.",
          "score": 1,
          "created_utc": "2026-01-14 14:38:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzjycoj",
          "author": "Nice-Zucchini-2882",
          "text": "mindpal + make",
          "score": 1,
          "created_utc": "2026-01-14 15:34:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzmdwdt",
          "author": "GetafixIT101",
          "text": "Use N8n to figure you automation out like a prototyping tool… then have AI turn it into a script with parameters and save yourself the SaaS fees :)",
          "score": 1,
          "created_utc": "2026-01-14 22:09:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzow16x",
              "author": "kshoneesh_chaudhary",
              "text": "What if the scale becomes an issue?",
              "score": 1,
              "created_utc": "2026-01-15 07:28:38",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzp40nq",
                  "author": "GetafixIT101",
                  "text": "Depends on exactly what you’re automating (does it require non native CLIs for example) but if it’s simple you can run it as an edge function or if more complex, bake it into a docker image and run that from your platform of choice. Also, if your automation requires lots of tweaking then I’d stick with N8N. I’ve found N8N is much better than Zapier personally.",
                  "score": 2,
                  "created_utc": "2026-01-15 08:43:32",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzojjny",
          "author": "Grouchy_Possible6049",
          "text": "After a lot of trial and error with automation tools, we've ended up keeping only what consistently delivers. ActiveCampaign is still part of our stack for workflows that directly touch revenue, lead nurturing, lifecycle emails and post purchase flows. We stripped out a lot of nice to have automations over time but this one has held up for the stuff we actually depend on day to day.",
          "score": 1,
          "created_utc": "2026-01-15 05:43:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzpghyl",
          "author": "Common-Flatworm-2625",
          "text": "Our stack got way simpler after too many fragile chains broke. Core is still Zapier for basic stuff, but we moved heavy lifting to dedicated platforms rather than stitching tools together. Key shift: automating service ops (tickets, approvals, routing) in one system instead of connecting 5 different tools. Way more reliable and easier to debug when things go sideways. monday service handles most of our internal automation now, it's less brittle than multitool workflows.",
          "score": 1,
          "created_utc": "2026-01-15 10:43:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzuc2av",
              "author": "tyler_351",
              "text": "What are you using for the heavy lifting?",
              "score": 1,
              "created_utc": "2026-01-16 01:49:35",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzrnzos",
          "author": "New-Yesterday2755",
          "text": "Working in a 9 figure e-commerce company, we are mainly using N8N and Appscript for process automation, Claude Code for coding, and different AI models based on task at hand.",
          "score": 1,
          "created_utc": "2026-01-15 17:58:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzw7yi4",
          "author": "BarberPlayful5984",
          "text": "Here’s what we’re actually running day to day in 2026 and what’s held up under real load:\n\nOur stack is basically n8n as the automation fabric + a WorkOps framework as the operating model. The key is the synergy effect: n8n gives us fast, reliable orchestration, while WorkOps makes sure automations don’t rot (ownership, SLAs, release process, observability, and escalation paths).\n\nWhat changed for us last year is that this stopped being “workflow tinkering” and became a hybrid organization model, AI agents are treated like teammates embedded in the process, not bolted-on gadgets. That cultural shift mattered more than any single tool purchase.\n\nConcrete outcomes from the last 6 months, driven by this stack and operating approach:\n\n* 53 processes enhanced, automated, or simplified in 6 months\n* \\~30 man-days saved per week, which in a 60–70 person company is effectively +6 headcount worth of capacity\n* \\+21% value chain efficiency measured across ops.",
          "score": 1,
          "created_utc": "2026-01-16 09:59:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzy3cka",
          "author": "Electrical_Heart_673",
          "text": "Bro guys I'm saying switch over to Make it just makes so many things so much easier for you. You can also use Automly and it builds your scenarios for you automatically. \n\n  \nMakes the process way faster and simpler.",
          "score": 1,
          "created_utc": "2026-01-16 16:35:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzyx6pw",
          "author": "meowmouthh",
          "text": "zapier for seamless crm integrations. zapier for workfloe or makee airtable for dynamic data handling. aiagents for knowledge capture during transitions. tools like sensay often shine for preserving team insights automatically. what's in your reliable stack?",
          "score": 1,
          "created_utc": "2026-01-16 18:47:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o01u1wh",
          "author": "Analytics-Maken",
          "text": "For data analysis: Windsor ai as the integration layer into BigQuery for storage and transformations alongside dbt and Looker Studio for visualization.",
          "score": 1,
          "created_utc": "2026-01-17 04:15:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o041iky",
          "author": "Top-Cauliflower-1808",
          "text": "honestly same here fr. Core is scheduled ETL, dbt and BI then light agent layers on top for monitoring and triage. windsor ai help normalise cross source data and its MCP is useful for quick what broke / what shifted checks but the automation stops at insight not execution.",
          "score": 1,
          "created_utc": "2026-01-17 14:44:22",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qbbezo",
      "title": "What is the most useful automation you built that saved you time every day?",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qbbezo/what_is_the_most_useful_automation_you_built_that/",
      "author": "seenmee",
      "created_utc": "2026-01-12 23:46:22",
      "score": 48,
      "num_comments": 38,
      "upvote_ratio": 0.99,
      "text": "Looking for practical, real-world examples.\n\nIf you’re open to sharing:  \n• What you automated (script, cron, workflow, app)  \n• What broke the first time  \n• The one fix that made it reliable\n\nBonus: screenshots or log snippets are welcome (please blur anything sensitive).",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qbbezo/what_is_the_most_useful_automation_you_built_that/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "nzbp3po",
          "author": "[deleted]",
          "text": "[deleted]",
          "score": 9,
          "created_utc": "2026-01-13 09:21:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzgxmfg",
              "author": "OvCod",
              "text": "ads",
              "score": 1,
              "created_utc": "2026-01-14 02:36:07",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nzcveby",
              "author": "vickykumarsingh",
              "text": "could you please share it",
              "score": 0,
              "created_utc": "2026-01-13 14:29:07",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzbbk3s",
          "author": "Mysterious-Eggz",
          "text": "I love the combo of gworkspace + chatgpt + spadeberry to automate my biz in ebay. I spend just 1-2 hours/week to supervise it and checking inventory, but the rest is chatgpt doing the research, spadeberry doing the listing and tracking, and google wspace doing the full tracking",
          "score": 3,
          "created_utc": "2026-01-13 07:12:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzidwqd",
              "author": "Training-Place-5979",
              "text": "What exactly is that business ? Can you elaborate ? Thank you!",
              "score": 1,
              "created_utc": "2026-01-14 09:13:32",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzp1d2n",
                  "author": "Mysterious-Eggz",
                  "text": "selling stickers, collectibles, and sometimes used (but still clean) clothes on ebay",
                  "score": 1,
                  "created_utc": "2026-01-15 08:17:46",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nzl10sj",
              "author": "Mammoth-Snow5055",
              "text": "I like this combo, but you should try out Gemini as a replacement for ChatGPT. I was using ChatGPT heavily for my last project, but it was slow a lot of the time and had a tendency to be incorrect. I found Gemini to be a lot faster and more accurate.",
              "score": 1,
              "created_utc": "2026-01-14 18:28:36",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzc3alp",
          "author": "Ancient-Subject2016",
          "text": "At a leadership level, the most useful automation for me has been escalation triage rather than ticket deflection. We automated classification and routing with very tight confidence thresholds, so only low risk cases moved without human review. What broke initially was edge cases, especially tone and partial context, which created noise and distrust fast. The fix was adding explicit fallbacks and audit logs so we could explain every decision after the fact. At scale, the time savings came less from speed and more from fewer fire drills and fewer surprises in exec reviews.",
          "score": 2,
          "created_utc": "2026-01-13 11:31:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz9bsqm",
          "author": "Accurate_Apricot_827",
          "text": "built an automation to create tiktok gallery post creatives: conducts AI agent research through Claude, then generates informational gallery posts with some helpful visuals generated by Nanobanana or Kling. Easily saved me lots of hours manually doing the research and creating visuals on Figma. \n\neventually made it into its own app :)",
          "score": 2,
          "created_utc": "2026-01-12 23:54:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "nz9plwn",
              "author": "seenmee",
              "text": "That’s a great example of automation actually saving thinking time, not just clicks. Curious what broke first when you put it into real use, prompts, data quality, or rate limits?",
              "score": 1,
              "created_utc": "2026-01-13 01:08:33",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzaifyd",
          "author": "PhiladelphiaWilde",
          "text": "I made it write code for an Excel Macro that would point to a folder of Excel files, clean them for what I needed, combine the files into 1 file, save as a .csv file, delete all other files. 1 button shop.",
          "score": 2,
          "created_utc": "2026-01-13 03:44:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzecw4n",
              "author": "ubuntuxp",
              "text": "Wow this sounds awesome!",
              "score": 2,
              "created_utc": "2026-01-13 18:49:19",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nzlzb4t",
              "author": "Rebirthofthehooah",
              "text": "Would love to see that!",
              "score": 2,
              "created_utc": "2026-01-14 21:03:31",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzmptw1",
                  "author": "PhiladelphiaWilde",
                  "text": "Hmmm nothing to really see.  \nAsk GPT to write you a downloadable .bas file you can import into Excel.  \nFrom there you just state exactly your needs and it'll write it and send it to you.  \nImport the file they give you and... automation.",
                  "score": 1,
                  "created_utc": "2026-01-14 23:08:11",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nz9ac3f",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-12 23:46:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz9x0ix",
          "author": "Kipper1971",
          "text": "Built an app that silently pushes corporate/company-observed holidays into employee mailboxes. No more meeting invites or special Outlook calendar files that need to be pushed by IT.",
          "score": 1,
          "created_utc": "2026-01-13 01:49:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nza3rvt",
          "author": "pankaj9296",
          "text": "invoice processing automation using DigiParser\nsaving me hours every day",
          "score": 1,
          "created_utc": "2026-01-13 02:25:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzasmm0",
          "author": "Flashy-Style-9085",
          "text": "I automated incoming bank transactions to populate in a group chat/speadsheet so not every employee needs bank access to see these. \n\nWorking for years and is so useful.",
          "score": 1,
          "created_utc": "2026-01-13 04:45:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzb7omq",
          "author": "invertedwingerspace",
          "text": "As a Talent Acquisition head, I initially used tools like Zapier and N8N to automate hiring processes, such as interview scheduling based on candidate scoring, etc. That'd be it.   \n  \nNow my Org finally decided to use TurboHire for recruitment automation, and I don't need to build anything on my own.",
          "score": 1,
          "created_utc": "2026-01-13 06:39:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzc16m6",
          "author": "Afraid_Emergency5199",
          "text": "For me the most useful automation wasn’t a single script, but a system I built to keep multiple AI agents from turning into chaos. I run an agency where we use agents for content, research, lead gen and support, and at first I tried to track them with logs, Slack messages and spreadsheets. Nothing held up and silent failures were the worst. The fix that made it reliable was centralizing everything and treating agents more like teammates instead of scripts, so I always know what each one is doing, when it last ran, and if something failed. I now tie that into workflows with tools like n8n for orchestration, Slack alerts for failures, and a lightweight tracker called aigencytracker so I can see all agents in one place. It doesn’t just save time, it removes the constant mental overhead of wondering what might be broken or forgotten, and that’s been a real game changer. I’m still experimenting though, so I’m very open to hearing how others are solving this or what tools and patterns are working for them!!!",
          "score": 1,
          "created_utc": "2026-01-13 11:12:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzdeprc",
          "author": "Agreeable-Alarm5631",
          "text": "I am a retired MD who now works part-time for DocMJ (medical marijuana doctor). The process of certifying a patient for a medical card is incredibly long and complicated on the state registry. I have automated the process using AutoIt scripting (for the menu) and the browser Automa extension. I have what I call a nuclear button, where one click does it all.",
          "score": 1,
          "created_utc": "2026-01-13 16:03:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nze060p",
          "author": "Corgi-Ancient",
          "text": "I built a simple daily script that pulls fresh leads from Google Maps and filters out duplicates automatically. At first it broke because the API rate limits weren’t handled, so it stopped halfway. Adding retries and delays fixed it and now it runs smooth every day. If you want to skip the coding, SocLeads does this kinda automation out of the box.",
          "score": 1,
          "created_utc": "2026-01-13 17:53:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzfq9ne",
          "author": "BasedDaddy-O",
          "text": "turning on the outside lights every evening 30 mins after sunset.  been running for 7 years.",
          "score": 1,
          "created_utc": "2026-01-13 22:38:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzhs4ly",
          "author": "sekharjavvadi",
          "text": "We're running around 20 different projects right now, and with that many mobile and web apps, keeping everyone on the same page is tough. We noticed that product managers often didn't know when developers had finished a task or raised a pull request. We fixed this by setting up an automated workflow that sends a notification directly to Microsoft Teams. It’s a simple fix, but it has bridged the gap between our dev and product teams, saving us a lot of time and resources.",
          "score": 1,
          "created_utc": "2026-01-14 05:56:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzjtgbz",
          "author": "NotJustAnyDNA",
          "text": "1. “Wake” up the house: opens all blinds to desired levels, starts the coffee and boil water for tea, sets the temp in the house warmer (we sleep cool in winter), turns off alarm, gives the weather then news on Amazon Echo, and powers up my office monitor/speakers/printer.  \n\nMy wife has thanked me almost every day for this.  The master bedroom has 8 blackout shades we would manually open… replaced with automated Lurton controlled blinds.  Her hot water heats up and has. “Keep warm” for one hour… enough time to shower and get ready.  My computer has already powered up, backed up, and run most software updates by time I get to my desk.  And the thermostat is now nearly 100% automated by season and time of day.  Off if any doors or windows are open, Auto for heat in winter, cool in summer, but variable based on presence and events.   \n\nLastly, we have a Samsung Frame TV with presence detection.  Weather or news is on when we enter the living room in the morning, then it switches to ART mode the rest of the day.  Shuts off when we turn off the lights in the room each night.\nIn summer",
          "score": 1,
          "created_utc": "2026-01-14 15:10:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzrzu2g",
          "author": "KristineGladly",
          "text": "I'm in sales, so I created a GPT that pulls my Gong transcripts and first meeting call notes together to then summarize sentiment, info, next steps, and also provides suggestions for how to tailor my demo to their use case on our follow up calls. Been SUPER helpful to save me prep time.",
          "score": 1,
          "created_utc": "2026-01-15 18:51:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzs0zy3",
          "author": "PalpitationFormer495",
          "text": "I used to be a CS mananger at a life insurance start up and I leveraged Iterable to automate responses to customer inquiries. It also helped automate proactive email comms notifying customers of requirements for insurance policies, and updates on underwriting. I wouldn't say Iterable is the best, but whatever platform you use you'll appreciate the increased quality and timeliness of some automated email cadences!",
          "score": 1,
          "created_utc": "2026-01-15 18:56:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o04uav7",
          "author": "Intrepid-Oil1447",
          "text": "automated knowledge capture for team offboarding with ai driven interviews that pull from docs and chats first run broke when apii tokens expired unexpectedly  and tools like sensay help make these setups more robust. What's your go to automation?",
          "score": 1,
          "created_utc": "2026-01-17 17:03:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz9gwmt",
          "author": "akucherov",
          "text": "A simple AppScript that allows me make identical in size screenshots (macOS)\n\ntell application \"Safari\"\r\tset bounds of front window to {0, 0, 1280, 828}\rend tell",
          "score": 1,
          "created_utc": "2026-01-13 00:21:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzae46n",
          "author": "codegeorgelucas",
          "text": "For me, the most useful automation wasn’t flashy. It was handling incoming calls and basic inquiries automatically so nothing gets missed during busy hours.\n\nWe built AVA as an AI voice front desk that answers routine questions, captures details, and routes real leads to a human. What broke first was edge cases where callers asked things slightly outside the script. The fix was narrowing the scope and adding clean handoff points instead of forcing full automation.\n\nOnce we stopped trying to automate everything and focused on reliability, it became something that saves time every single day instead of creating more work.",
          "score": 1,
          "created_utc": "2026-01-13 03:20:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzb36m3",
          "author": "Gullible-Storm9278",
          "text": "I set up some simple scripts to automatically organize my files based on the date they were created, but the first time it ran, it ended up mixing everything up and I had to redo the whole folder structure. Once I tweaked the script to include more specific filters, it finally worked like a charm. Totally saved me hours! I’ve heard of tools like Subleadit doing similar automation for Reddit stuff, but I’ve stuck to more basic things for now.",
          "score": 1,
          "created_utc": "2026-01-13 06:02:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nza2t3e",
          "author": "Oldguy3494",
          "text": "depends on your use case, I use one on Saner that turns my brain dump into reminders automatically, it's a built in one and quite helpful",
          "score": -2,
          "created_utc": "2026-01-13 02:19:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz9gnjk",
          "author": "mileswilliams",
          "text": "Ai slop generator. Nice automation but I'm not impressed with the output. I'm curious if it will make you any money though :-)",
          "score": 0,
          "created_utc": "2026-01-13 00:20:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "nz9q1v1",
              "author": "seenmee",
              "text": "Fair point. For me it wasn’t about money at all, just getting rid of the repetitive stuff I kept procrastinating on. Those little time saves added up faster than I thought.",
              "score": 2,
              "created_utc": "2026-01-13 01:10:58",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nza08tf",
          "author": "quietkernel_thoughts",
          "text": "From a CX perspective, the most valuable automation wasn’t flashy. It was a simple workflow that tagged and surfaced repeat contacts on the same issue within a short window. Before that, we were measuring tickets as isolated events and missing the pattern until customers escalated. What broke early was over-triggering, it flagged noise and burned trust internally. The fix was narrowing the signal to only customer visible friction and routing it to a human with context. It saved time every day because we stopped reacting late and started addressing the root cause before frustration piled up.",
          "score": -1,
          "created_utc": "2026-01-13 02:06:24",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qe4ska",
      "title": "10 AI tools I'm taking with me into 2026",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qe4ska/10_ai_tools_im_taking_with_me_into_2026/",
      "author": "Dull_Noise_8952",
      "created_utc": "2026-01-16 03:18:44",
      "score": 38,
      "num_comments": 23,
      "upvote_ratio": 0.89,
      "text": "New year so figured I'd share the tools that actually stuck around after trying way too much stuff last year. These are the ones I genuinely use not just installed once and forgot about.\n\nCursor for coding assistance. Tried alternatives but kept coming back. The tab completion just works.\n\nn8n for automations. Self hosted it and forgot about it which is exactly what I want.\n\nLangsmith for tracing LLM calls. Saved me so many times when something breaks and I need to see what happened.\n\nVellum for ai agents. Got frustrated with how challenging other tools were, and this experience was 10x better Granola for meeting notes. Not perfect but good enough that I stopped taking notes manually.\n\nPlaywright for browser automation. Tried the AI wrappers but they added complexity without much benefit.\n\nPinecone for vector stuff. Tried self hosting but the maintenance wasnt worth it at my scale.\n\nLogsnag for simple monitoring. Sends me a ping when things happen without setting up a whole observability stack.\n\nClaude directly in the app for quick scripts. Faster than spinning up a project for something I'll run once.\n\nNotion with their AI features for docs. Not groundbreaking but having everything in one place matters. Although very pricey, and I could potentially do the same thing with ChatGPT\n\nWhat tools survived your 2025 culling?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qe4ska/10_ai_tools_im_taking_with_me_into_2026/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "nzy42u6",
          "author": "Electrical_Heart_673",
          "text": "I would say you should add Automly.pro. It builds scenarios for you automatically and it lowkey makes the process 1000x easier if you use Make.\n\n  \nUnfortunately, it doesn't do n8n or zapier though.",
          "score": 2,
          "created_utc": "2026-01-16 16:38:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzyocgp",
          "author": "Similar-Kangaroo-223",
          "text": "Here are the five that survived my 2025 culling:\n\n1. Gemini: for general tasks that I used to do with GPT. Also Gemini in Chrome and Nano Banana for image generations.\n2. Claude: for high level decision making and planning.\n3. Cursor: for coding and building my product\n4. NotebookLM: for learning and reading\n5. CapCut: for video editing\n\nI mean I tried 100+ hyped apps like Series, Lovable, Gamma, Perplexity, Manus, Genspark, Captions, Opusclip, and so on, but I find myself only using those 5 on a daily or weekly basis.",
          "score": 2,
          "created_utc": "2026-01-16 18:08:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzutheh",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 4,
          "created_utc": "2026-01-16 03:26:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o00b3yg",
              "author": "SnoopTiger",
              "text": "Dm me please!",
              "score": 2,
              "created_utc": "2026-01-16 22:42:12",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o08xzvk",
              "author": "AttentionSeeker__",
              "text": "DM",
              "score": 2,
              "created_utc": "2026-01-18 06:13:56",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nzuywi2",
              "author": "applebook366",
              "text": "Let me have a look as well plz!",
              "score": 2,
              "created_utc": "2026-01-16 03:59:03",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nzuv15a",
              "author": "CarefulIndication988",
              "text": "Yes, please.",
              "score": 1,
              "created_utc": "2026-01-16 03:35:51",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nzv099f",
              "author": "zencola",
              "text": "I'd like to know how you target high engagement videos",
              "score": 1,
              "created_utc": "2026-01-16 04:07:28",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzus24y",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-16 03:18:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzuwxt2",
          "author": "Glad_Appearance_8190",
          "text": "that was an interesting list.....the ones that stuck for me were mostly the boring ones that dont surprise me anymore. anything that quietly runs for months without me babysitting it feels like a win. ive ditched a lot of shiny ai tools just because when something went wrong i had no idea why. tracing and simple monitoring end up mattering more than fancy features once the novelty wears off...",
          "score": 1,
          "created_utc": "2026-01-16 03:47:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzvndvq",
          "author": "Minttzie",
          "text": "I realized that I've started to use Gemini over ChatGPT more often for content. \n\nFor my site, I use Jotform AI agents to collect feedback and for customer service.\n\nI'm also trying out some n8n automations.",
          "score": 1,
          "created_utc": "2026-01-16 06:53:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzwr7ck",
          "author": "ManufacturerBig6988",
          "text": "Interesting list. The common thread I see in the ones that survive is visibility when things go wrong, not just speed when they work. Tracing and simple monitoring age better than flashy agent layers, especially once edge cases show up in real workflows. From a support and ops angle, anything that makes it easier to answer what happened and why usually earns its keep. Tools that hide failure modes tend to feel great for a month and then quietly create cleanup work. Curious which of these actually reduced rework for you versus just feeling nicer to use.",
          "score": 1,
          "created_utc": "2026-01-16 12:33:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzxdogg",
          "author": "Hereemideem1a",
          "text": "If you liked Granola, you might want to check out Vomo. I switched to it for meeting notes",
          "score": 1,
          "created_utc": "2026-01-16 14:38:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzuvj4z",
          "author": "Mysterious-Eggz",
          "text": "I tried using n8n but it feels too advanced for me. any recs on guide I should watch/read to understand it? I use notion AI too and been loving it so far. use it combined with gworkspace and spadeberry to track my biz and listing on ebay",
          "score": 0,
          "created_utc": "2026-01-16 03:38:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzy3tgn",
              "author": "Electrical_Heart_673",
              "text": "In my opinion, instead of learning N8N, I think you should try to switch over to Make and use Automly.pro. I tried to learn automation and build something for a client but it takes way too long bro. So I would say just se the free plan on Automly and build the scenarios you want on there.",
              "score": 1,
              "created_utc": "2026-01-16 16:37:47",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nzv3sqh",
              "author": "pmjdang",
              "text": "Use it alongside Gemini. I learned quite a bit in a few days. Built a workflow to autofill pdf fillable forms and docx form from Airtable. Gemini worked better than gpt",
              "score": 1,
              "created_utc": "2026-01-16 04:30:02",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzvvedg",
                  "author": "Mysterious-Eggz",
                  "text": "interesting. I keep seeing people recommend gemini/claude more for research compared to chatgpt. I'll try learning from it later",
                  "score": 0,
                  "created_utc": "2026-01-16 08:03:03",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nzv1ds7",
              "author": "Different-Bridge5507",
              "text": "relay.app for me has been a huge unlock. Basically does the same as n8n but you can use natural language prompting to build it.",
              "score": 0,
              "created_utc": "2026-01-16 04:14:33",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nzw2gh6",
              "author": "Turbulent-Isopod-886",
              "text": "n8n can definitely feel overwhelming at first because it’s so flexible.\n\nFor learning it, I’d start with step-by-step stuff like the official n8n YouTube tutorials and beginner walkthroughs that build simple workflows before branching out.\n\nBut if you’re loving Notion AI and want something more approachable for real business automation without the steep learning curve, also check out Konnectify. It lets you build and manage automations across Notion, Google Workspace, Shopify/eBay tools, and others with clearer logic and visibility, without needing to wire up complex nodes manually.\n\nStart with simple triggers and actions, learn the patterns in n8n, then use tools like Konnectify to orchestrate your key workflows without the friction.",
              "score": 0,
              "created_utc": "2026-01-16 09:07:50",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qajkec",
      "title": "Gemini + Kuse: my AI knowledge base workflow for efficient learning",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qajkec/gemini_kuse_my_ai_knowledge_base_workflow_for/",
      "author": "Opposite_Advance7280",
      "created_utc": "2026-01-12 03:04:27",
      "score": 28,
      "num_comments": 4,
      "upvote_ratio": 0.93,
      "text": "I have been using Kuse for a few months now, and I have also noticed more and more discussions about it on Threads. It really feels like it is becoming an important part of the AI learning stack, and sharing how I personally combine it with my favorite LLMs. And if you share similar goals: learning efficiently and building a smarter, long-term knowledge base, this might be helpful.\n\nTo be honest, this is one of the best knowledge-base tools I have used so far. It’s not just for storing notes; it actually helps explain, break down, and turn information into usable outputs. I mainly use it in two workflows:\n\n1\\. Start directly in Kuse\n\nI upload all the long-form content I want to study deeply, like YouTube videos, ebooks, long PDFs, and other files, straight into Kuse. Then I let it automatically extract structure, summarize key points, and generate a summary report that gives me a solid understanding. These reports come with a very clear table of contents, so I can jump directly to specific sections, plus visualized data or analytics for key information. Makes it much easier to decide what’s worth deeper study.\n\n2\\. Start with Gemini, then move to Kuse\n\nSometimes I begin with Gemini for deep research. Like getting an overview of a new field or synthesizing information from multiple sources. After that initial research, I put all the messy notes into a document and upload it to Kuse. Then kuse helps me turn everything into clearer, more structured outputs, like mind maps or data-analytics dashboards. Whenever I run into concepts I do not fully understand, I just keep asking questions directly inside Kuse using its built-in models. And I usually ask Kuse to generate a small quiz so I can review and make sure I have really understood the material.\n\nThat said, there are still some cons - the mind-map design could be clearer, and sometimes it defaults too often to website-style outputs, which means waiting longer for auto-coding.\n\nAre there any workflows or tool combinations you have been using to improve your study efficiency?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qajkec/gemini_kuse_my_ai_knowledge_base_workflow_for/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "nz3gp6o",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-12 03:04:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz4b7f7",
          "author": "Ok_Sand_5400",
          "text": "Interesting combo. I like the idea of using Kuse as the long-form intake layer and letting the LLM do the synthesis. Feels more intentional than dumping everything straight into a notes app.",
          "score": 1,
          "created_utc": "2026-01-12 06:23:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz9crf9",
          "author": "Accurate_Apricot_827",
          "text": "How's it fare against NotebookLM?",
          "score": 1,
          "created_utc": "2026-01-12 23:59:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzcbhzn",
          "author": "signal_loops",
          "text": "using Gemini for broad, messy synthesis and then handing things off to Kuse as a  knowledge refinery makes a lot of sense, especially for long term learning rather than one off answers. the quiz generation and structure extraction are underrated features because they force active recall instead of passive consumption, which most AI research workflows still lack. one thing that might level this up further is adding a lightweight  retrieval pass later  so the knowledge base compounds instead of staying siloed.",
          "score": 1,
          "created_utc": "2026-01-13 12:33:34",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qeaqpm",
      "title": "Can SleekFlow really replace your CRM and live chat tools when using WhatsApp for customer support or are extra platforms still necessary?",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qeaqpm/can_sleekflow_really_replace_your_crm_and_live/",
      "author": "iDontwantOne-13",
      "created_utc": "2026-01-16 08:38:35",
      "score": 24,
      "num_comments": 3,
      "upvote_ratio": 1.0,
      "text": "We’ve recently started testing WhatsApp as our primary customer support channel and are using SleekFlow to manage the conversations. On paper, it looks like it can act as both a CRM and a live chat tool, shared inbox, contact profiles, basic automation, tagging, etc. It feels more like a lightweight CRM layer combined with a shared inbox rather than a full CRM replacement. But I’m curious about real-world usage.  \nFor those who’ve tried SleekFlow or similar WhatsApp automation tools:  \nDid it actually replace your CRM and live chat stack?  \nWhere did it fall short?  \nAny hidden limitations with scaling, reporting, automation rules, or team workflows?  \nWould love to hear what worked, what didn’t and whether you ended up adding extra tools anyway.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qeaqpm/can_sleekflow_really_replace_your_crm_and_live/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "nzvzb1b",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-16 08:38:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0927nd",
          "author": "ruhila12",
          "text": "We started using SleekFlow to manage WhatsApp leads and it significantly reduced our manual work. While it doesn’t fully replace our CRM it integrates smoothly with it making lead tracking much easier. For early-stage teams that don’t need complex sales pipelines yet SleekFlow is honestly more than enough to handle daily communication and customer management.",
          "score": 1,
          "created_utc": "2026-01-18 06:49:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o094hhb",
          "author": "Own_Inspection_9247",
          "text": "Same boat here. Using WhatsApp for support feels natural for customers but tracking follow-ups became messy until we added SleekFlow. Still keep a lightweight CRM for sales pipeline though.",
          "score": 1,
          "created_utc": "2026-01-18 07:09:32",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qbqk5d",
      "title": "Saved 50+ hours every month for my first client!",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qbqk5d/saved_50_hours_every_month_for_my_first_client/",
      "author": "ScratchAshamed593",
      "created_utc": "2026-01-13 12:54:46",
      "score": 22,
      "num_comments": 13,
      "upvote_ratio": 0.9,
      "text": "Just built my first workflow and gave it to a client for free to build my portfolio.\n\nI recently got started with workflow automation, but found it very hard to break in without a reputation (people just don’t trust for some reason).\n\nSo I offered to build workflows for free and built a lead enrichment engine powered by Apollo. I’m very proud to say that this workflow saves the company \\~50 hours a week.\n\nBefore this automation, the company was manually copying LinkedIn URLs, searching Apollo one by one, and pasting contact info into Google Sheets. Now they can just paste a CSV of leads, hit run, and the workflow automatically enriches each contact through Apollo (name, email, company, title) and dumps everything into the same spreadsheet (which integrates into their existing workflow).\n\nCurious how people built their reputation initially to get started in automation? Did you also offer workflows for free?\n\nP.S - If anybody needs a workflow built, please let me know. I’d be happy to work for free for the first few people in exchange for a review!\n\nEdit :- Some of you guys have been asking for the template, so [here](https://www.noclick.com/workflow/apollo-enrichment-workflow) is the link. Cheers!",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qbqk5d/saved_50_hours_every_month_for_my_first_client/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "nzcmt1z",
          "author": "Wide_Brief3025",
          "text": "Offering free work for portfolio and reviews is such a solid way to break in. Early on, sharing case studies and results like yours can really build trust fast. You might also try replying to relevant Reddit threads where people are asking for automation help. If you ever want to streamline finding those leads, ParseStream can instantly alert you when folks mention keywords you care about.",
          "score": 5,
          "created_utc": "2026-01-13 13:43:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzhsmtg",
              "author": "ScratchAshamed593",
              "text": "Thanks a lot, will try it out",
              "score": 1,
              "created_utc": "2026-01-14 06:00:02",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzebtjb",
          "author": "ubuntuxp",
          "text": "Cool, let me know I want done automation. Will leave a review on LinkedIn",
          "score": 2,
          "created_utc": "2026-01-13 18:44:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzga53o",
          "author": "sam-goldman",
          "text": "That's really impressive! Props for hustling to build your portfolio.\n\nAlso, this is an impressive ad to generate more leads ;)",
          "score": 2,
          "created_utc": "2026-01-14 00:24:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzhsnl9",
              "author": "ScratchAshamed593",
              "text": "Thanks a lot",
              "score": 1,
              "created_utc": "2026-01-14 06:00:12",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzii32x",
          "author": "signal_loops",
          "text": " what you did makes sense for a first win free or heavily discounted work lowers trust barriers and gives you concrete proof instead of credentials. the key is to be intentional about it: limit free projects to 1–3, define a clear scope, and always tie the work to a measurable outcome , because that’s what converts into testimonials and referrals. after that, stop positioning yourself as free  and start positioning yourself as low-ris,paid pilots, fixed scope audits, or a small setup fee that converts into a larger engagement. reputation in automation spreads fastest through results screenshots, short case studies, and word of mouth from ops/sales leaders not through credentials or tool badges.",
          "score": 2,
          "created_utc": "2026-01-14 09:54:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzixbgf",
              "author": "ScratchAshamed593",
              "text": "Thank you for the advice. Means a lot.",
              "score": 1,
              "created_utc": "2026-01-14 12:04:25",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzpw7hd",
                  "author": "signal_loops",
                  "text": "you're welcome!",
                  "score": 1,
                  "created_utc": "2026-01-15 12:46:12",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzceoj7",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-13 12:54:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzfmh8i",
          "author": "No_Success3928",
          "text": "Reads like an advertisement for Apollo or is that just me?",
          "score": 1,
          "created_utc": "2026-01-13 22:20:05",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qe5obw",
      "title": "Web + desktop regression: what’s worth automating?",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qe5obw/web_desktop_regression_whats_worth_automating/",
      "author": "TaraFranklinq",
      "created_utc": "2026-01-16 04:00:14",
      "score": 20,
      "num_comments": 4,
      "upvote_ratio": 0.95,
      "text": "I need you guys help deciding on UI automation options for a product i'm working on that includes a mix of web, desktop, and some legacy UI components. API and backend testing are in a good place, but UI regression continues to be the main issue, especially in areas where selectors are unstable or UI structure isn’t consistently exposed.  \n  \nHere’s how some of the tools we’ve tested so far:\n\n* Playwright / Cypress: strong for modern web apps with a clean DOM, but maintenance cost rises quickly once the UI gets dynamic or partially non-web\n* TestComplete / Ranorex: broad UI support and mature features, though licensing cost and long-term scalability are real considerations\n* UiPath / Power Automate: solid for RPA-style workflows, but they felt more process-automation focused than test-centric for our needs\n* Pure image-based tools (Sikuli, PyAutoGUI): quick to prototype with, but brittleness becomes an issue beyond small scripts\n\nWe’ve also been testing Askui, mainly because it works at the visual/UI level instead of relying on selectors or control trees. It’s been useful for certain edge cases where traditional approaches break down, though it’s clearly not a replacement for standard test frameworks.\n\nFor teams who’ve gone through similar evaluation how did you decide which UI gaps were worth automating vs leaving manual? did anyone successfully combine visual automation with traditional tooling? and what mattered most for long-term maintainability??\n\nWill be highly appreciative of your input!!",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qe5obw/web_desktop_regression_whats_worth_automating/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "nzuz3hh",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-16 04:00:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzwsqkb",
          "author": "ExtensionBench7270",
          "text": "UI automation is worth it only for high-risk, stable user flows. Anything cosmetic, fast-changing, or selector-hostile is usually better left manual.\n\nA hybrid approach makes sense:  \n• DOM-based tools for modern web  \n• Visual automation only for true legacy gaps  \n• Most validation pushed below the UI\n\nLong-term maintainability matters more than coverage. If a test is noisy, it’s not helping.",
          "score": 1,
          "created_utc": "2026-01-16 12:43:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzwtww1",
          "author": "Ancient-Subject2016",
          "text": "The teams that do well here draw a hard line around what automation is supposed to protect. If a UI path is business critical and failures would cause revenue loss, compliance risk, or major escalations, it is worth automating even if the tests are imperfect. Everything else is a candidate for manual or spot checks. Visual automation can be useful for brittle or legacy surfaces, but only as a thin safety net, not a full regression strategy, because maintenance cost compounds fast. At scale, this becomes a risk because flaky tests erode trust and get ignored. The long term win usually comes from reducing the surface area you try to automate and pushing more logic into stable layers, even if that means accepting some manual coverage. Automation is about risk containment, not 100 percent coverage.",
          "score": 1,
          "created_utc": "2026-01-16 12:51:14",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qdkoe7",
      "title": "Accountant looking to deepen my automation knowledge",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qdkoe7/accountant_looking_to_deepen_my_automation/",
      "author": "MartiniPeeL",
      "created_utc": "2026-01-15 14:16:27",
      "score": 17,
      "num_comments": 29,
      "upvote_ratio": 0.96,
      "text": "Hello everyone, so I have been searching all over the web and over here as well for a minute now not really being satisfied with what I found so I decided to make my own post.\n\nI'm looking for advice, my situation is I was hired as an Accountat for a company around 3 years ago now but for the past 2 years I've mostly been doing Power Query/RPA for the Invoice Audit sector of my company.  \nI'm the only person that knows anything about it in my team or the whole accounting sector for that matter, aside from people that are straight up just IT guys.  \n  \nI used to study Data Science just for a few months before I joined this company hence why they asked me to do this \"more advanced\" stuff cause they figured I was capable and they were right. But the thing is, I want to be more capable, but I have no where to sart.   \n  \nI want to go deeper into automation, I want to help other departments with it as well, I want my colleagues to have less things to do so they live happier, less stressful lives.\n\nI told my superior that I would like to get some sort of course to learn more about all this and they said \"Hell yeah\" if I can just show them which one I want they will fund it and I've been looking for one to send them for around a month now but I just don't know if it even makes any sense.\n\nI absolutely love the process of automating that I already do and I want to be better, more useful cause as it is right now, I can basically just do 1 thing and fix it if it's broken but I know I can do more if I just had some direction.\n\nIf you guys got any recommendations of where I should start, or some place where to learn, how to get experience so I can actually start doing things here that would be amazing.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qdkoe7/accountant_looking_to_deepen_my_automation/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "nzqgifm",
          "author": "WorkLoopie",
          "text": "I would recommend starting with your background in accounting, and building workflows that make your job easier.  As for tech, I would recommend n8n.  Its the hardest to learn, but once you do learn it, all the other ipaas tech is easy to use.  In addition, I would recommend learning python, because the truth be told, all automation tools have limitations when it comes to drag and drop, and being able to also code when you see those limitations will help your skill set become more desirable.  \n\nAs an agency owner, accounting is going the way of dodo, as more and more clients start to trust AI automation is an excellent use case for numbers and math.  So your head is in the right spot.",
          "score": 6,
          "created_utc": "2026-01-15 14:39:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzw86kh",
              "author": "louis3195",
              "text": "you've nailed it! focusing on the biggest pain points is definitely the way to go. if you ever need to automate on legacy systems and avoid custom integrations, mediar might be worth a look. what's the process you've found hardest to tackle so far?",
              "score": 1,
              "created_utc": "2026-01-16 10:01:13",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzw8f3q",
                  "author": "louis3195",
                  "text": "totally agree with addressing pain points first. tackling legacy systems can be tricky, but with mediar's approach, i've noticed it makes integration a lot smoother. as for challenges, data migration has been a tough nut to crack for me. what about you?",
                  "score": 1,
                  "created_utc": "2026-01-16 10:03:24",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nzro6t5",
              "author": "EmeraldTradeCSGO",
              "text": "Dont use n8n, just use Claude Code to do what n8n does way easier.",
              "score": 1,
              "created_utc": "2026-01-15 17:59:49",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzqqpuh",
          "author": "DFSautomations",
          "text": "You are in a great position already. Accounting plus Power Query and RPA is a strong foundation. Before chasing more tools, I would focus on principles: mapping end to end processes, identifying handoffs, and measuring time saved per automation. For learning, I would go deeper into Power Platform first if you are already there, especially Power Automate and proper error handling, logging, and versioning. Parallel to that, learning basic SQL and API concepts will unlock far more automation than any single course. Once you are solid there, tools like n8n or Make make more sense because you will understand when to use them and when not to. Most people get stuck because they learn tools instead of systems thinking.",
          "score": 2,
          "created_utc": "2026-01-15 15:29:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzs270r",
              "author": "louis3195",
              "text": "great advice! understanding systems and end-to-end processes is key. having a strong grasp of the basics like power automate and sql before diving into other tools makes total sense.",
              "score": 2,
              "created_utc": "2026-01-15 19:01:43",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nzvp3sa",
              "author": "MartiniPeeL",
              "text": "I actually already did a few things in Power Automate before I just forgot to mention it in the post cause I dont really do it that often. Thank you for the advice on the rest though!",
              "score": 1,
              "created_utc": "2026-01-16 07:08:02",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzrnzbr",
          "author": "EmeraldTradeCSGO",
          "text": "I am a university student who has been building AI Agents since mid-2024. Last summer I worked as an intern at an accounting firm and automated my whole job-- and 20 others. This was with way worse tools than what we have today. I am pretty confident I could automate the entire firm.\n\nI also automated 10 people's jobs at a marketing firm and the entire intern class at a VC firm.\n\nYou do not need a course, most are snake oil.\n\nYou need to spend $200 a month on ChatGPT Pro and $200 a month on Claude Max.\n\nWatch David Ondrej How to use Claude Code and how to use Codex to learn how to use Claude Code, or use the new Claude Cowork if you do not want to try to get technical at all, but Claude Code is better. Also, learn Codex and use them together as co-engineers in Cursor is optimal since Claude does grunt work, and Codex can fix any hard problems.\n\nThen, scope out what job you want to build an agent to automate.\n\nTalk about the ins and outs with ChatGPT Pro for a few hours (it thinks for like 20 min so really provide detailed prompts with rich data, tacit knowledge and context and connect it to any necessary database through connectors).\n\nAfter much discussion, tell ChatGPT Pro to make a detailed master prompt to kick off Claude Code, and also list what API keys/data you will need to connect or obtain before making the agent work.\n\nGet the api keys and data.\n\nPaste into Claude Code.\n\nIterate with Codex and Claude Code until agent works.\n\nRepeat.\n\nYour whole industry will be automated in a few years for sure and people have been learning way longer than you so lock in.",
          "score": 2,
          "created_utc": "2026-01-15 17:58:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzuwc8v",
              "author": "Imindless",
              "text": "Have you tried Cursor?\n\nMy company switched from Claude Code to Cursor with great success. Fast and accurate. \n\nI agree that most repetitive tasks can be automated and roles replaced. \n\nI think it’s cool as a student you are taking initiative to dabble in automations.",
              "score": 1,
              "created_utc": "2026-01-16 03:43:36",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzvz7mx",
                  "author": "EmeraldTradeCSGO",
                  "text": "I use Claude Code, Codex and Cursor agent together in Cursor IDE, but codex and Claude code are so much better at their assigned roles that I don’t really ever use cursor agent.",
                  "score": 1,
                  "created_utc": "2026-01-16 08:37:43",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nzvc8jz",
              "author": "bravelogitex",
              "text": "fake course promoter",
              "score": 1,
              "created_utc": "2026-01-16 05:27:04",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzvz98w",
                  "author": "EmeraldTradeCSGO",
                  "text": "Bro it’s a free YouTuber lmao. You don’t even need to watch him if you know how to use Claude code and codex.",
                  "score": 1,
                  "created_utc": "2026-01-16 08:38:08",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nzvpdbd",
              "author": "MartiniPeeL",
              "text": "Oh yeah, I already do have CGPT Pro from my company as one of like 20 people that have it there and I sometimes use it already but I'm not too good at knowing what it can actually help me with. Thank you for the informative response!",
              "score": 1,
              "created_utc": "2026-01-16 07:10:19",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzvzg3u",
                  "author": "EmeraldTradeCSGO",
                  "text": "ChatGPT Pro prob smarter than all of us. Like I am an Ivy student who got 1580 SAT in 10th grade first try. I can get an A in every hard class without really trying. And ChatGPT pros intelligence blows me away every time I use it.",
                  "score": 1,
                  "created_utc": "2026-01-16 08:39:53",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzqbyps",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-15 14:16:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzt890a",
          "author": "ogandrea",
          "text": "Power Query to RPA is such a natural progression. I went through something similar at MIT when we were building automation tools for research data processing... started with basic scripts and kept wanting to do more complex stuff.\n\nSince your company's willing to fund training, maybe look at courses that cover Python automation frameworks? That opens up way more possibilities than just RPA tools. You could automate across departments, build custom integrations, even create web interfaces for your colleagues to use.\n\nActually if you want to see what modern automation looks like - we're using AI agents at Notte to automate browser tasks that would normally require complex RPA setups. Makes me realize how much the field is evolving beyond traditional automation approaches.",
          "score": 1,
          "created_utc": "2026-01-15 22:16:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzvpmld",
              "author": "MartiniPeeL",
              "text": "I alsao thought about Python automation courses, I will look for those. I was initially looking a little blindly for any course but I didnt really know what I wanted but this is definitely one of the better options. Thank you for the advice",
              "score": 1,
              "created_utc": "2026-01-16 07:12:30",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzud2f7",
          "author": "Electronic-Cat185",
          "text": "you are already doing the hard part, which is spottiing real problems and automating them in productiion, not just tutorials. at this point, courses matter less than expanding your mental model. learning more about Python for data workflows, APIs, and basic software engineering patterns will unlock a lot. versiion control, logging, error handliing, and designing automations other people can safely use are the next step. I would also look at how IT thinks about systems, not to become IT, but to speak their language. If your company will fund it, aiim for something that teaches foundations and architecture, not just another tool. You are already past beginner territory, you just need structure and exposure.",
          "score": 1,
          "created_utc": "2026-01-16 01:55:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzvc9cm",
          "author": "bravelogitex",
          "text": "try power automate",
          "score": 1,
          "created_utc": "2026-01-16 05:27:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzvis5g",
          "author": "Extreme-Brick6151",
          "text": "You’re already in a strong position what you’re missing is a framework, not ability. If you’re doing Power Query + RPA, the next step is thinking in **systems**, not tools: map end-to-end processes, spot handoffs and failure points, and automate flows instead of single tasks. Going deeper into workflow automation (n8n / Make / Power Automate) plus basic API concepts will take you far. Courses help, but rebuilding one full process end-to-end is where the real learning happens.",
          "score": 1,
          "created_utc": "2026-01-16 06:16:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzw08pf",
          "author": "signal_loops",
          "text": "what you’re missing isn’t ability, it’s structure and a path. the fastest way forward isn’t a generic AI or  automation course, but deliberately rounding out three layers: (1) automation fundamentals, (2) light engineering discipline, and (3) business-facing automation design. experience wise, you already have the best lab possible your company so the goal isn’t more theory, it’s expanding surface area methodically. if you do this, you’ll naturally evolve from  the only person who can fix this  into the person who designs systems that remove work across departments, which is exactly where automation careers become durable, respected, and well paid.",
          "score": 1,
          "created_utc": "2026-01-16 08:47:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzwtmc1",
          "author": "ExtensionBench7270",
          "text": "You’re already ahead of most people. You’re doing real automation inside the business, not just learning tools.\n\nIf you want direction:  \n• learn process mapping and system thinking  \n• go deeper into Power Automate / RPA fundamentals  \n• look at orchestration concepts, not just scripts  \n• apply it to one more department and learn from real problems\n\nCourses help, but doing automation across teams will teach you faster. You’re basically becoming the bridge between accounting and ops, and that’s a very valuable place to be.",
          "score": 1,
          "created_utc": "2026-01-16 12:49:24",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qc69z8",
      "title": "My Observations on Google’s Universal Commerce Protocol (UCP): An Elegant “Protocol Alliance” and the Inevitable Protocol War",
      "subreddit": "automation",
      "url": "https://i.redd.it/2qgsxptk57dg1.jpeg",
      "author": "MarketingNetMind",
      "created_utc": "2026-01-13 22:56:45",
      "score": 16,
      "num_comments": 3,
      "upvote_ratio": 0.8,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qc69z8/my_observations_on_googles_universal_commerce/",
      "domain": "i.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "nzg35hu",
          "author": "Afraid_Emergency5199",
          "text": "This is a great breakdown. What stands out to me is how UCP isn’t really about owning commerce, but about owning the language of commerce between agents and merchants. Whoever defines that layer shapes everything above it. The scary part isn’t that we might get two standards, it’s that we might end up with invisible toll booths between them, and that’s where the real complexity and cost will creep back in.",
          "score": 2,
          "created_utc": "2026-01-13 23:46:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzjpnuy",
              "author": "MarketingNetMind",
              "text": "There's long way to go before we conclude if there should be a \"universal protocal\" for agents. But anyway this is a nice attempt, at least for a market where first-comers usually gains most.",
              "score": 1,
              "created_utc": "2026-01-14 14:52:01",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzfttrz",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-13 22:56:47",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qfj5js",
      "title": "How I got my first 5 clients",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qfj5js/how_i_got_my_first_5_clients/",
      "author": "General_Maize_7636",
      "created_utc": "2026-01-17 17:25:36",
      "score": 15,
      "num_comments": 14,
      "upvote_ratio": 0.83,
      "text": "Wanted to share what actually worked for me in case it helps anyone else getting started with an automation agency:\n\n* Offer building workflows for free (people starting out have no differentiator or brand yet, so cutting prices is the best way to get the attention of potential clients)\n* Charge a recurring retainer after the value of the free workflow is proven to the client (they’ll need maintenance and you can charge \\~$100/month for this initially)\n* Focus on a specific niche (I focused on non-technical marketing teams and built workflows for lead enrichment, CRM updates, report generation, campaign data syncing, etc)\n* Build quickly using no-code tools, don’t try to go custom when starting (I used n8n and NoClick)\n* Use multiple channels to find clients. I found my first few via Upwork, Fiverr, and LinkedIn\n* Keep messages short and focused on value (X+ hours saved or $X saved) and skip all technical details in the pitch\n* Follow-up religiously with people who showed interest until they say yes or no clearly\n* Ask for reviews and referrals once you have them as customers\n\n5 clients paying you \\~$100/month isn’t a lot, but it gets you started and once you have social proof trust compounds and you can scale much faster.\n\nCurious how other people here got their first clients?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qfj5js/how_i_got_my_first_5_clients/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "o05c1sw",
          "author": "CanaryAccurate1299",
          "text": "The main question is how did you reach out to these people, like what was your outreach stack and how did you do it. \nReally good insights though",
          "score": 3,
          "created_utc": "2026-01-17 18:26:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0516dy",
          "author": "jannemansonh",
          "text": "What workflow builder apps did you use? Something like n8n or needle app?",
          "score": 2,
          "created_utc": "2026-01-17 17:36:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o05554f",
              "author": "General_Maize_7636",
              "text": "I used a mix of n8n and NoClick (mentioned in point 4)",
              "score": 2,
              "created_utc": "2026-01-17 17:54:34",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o055t13",
                  "author": "Electrical_Heart_673",
                  "text": "You guys can try Make with Automly.pro. It builds your scenarios for you so it might help if you're new to automating.",
                  "score": 1,
                  "created_utc": "2026-01-17 17:57:39",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o04yz1i",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-17 17:25:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o058cgp",
          "author": "Accurate_Apricot_827",
          "text": "Which channels worked the best for you? I never thought of using Upwork and Fiverr, that's pretty genius haha",
          "score": 1,
          "created_utc": "2026-01-17 18:09:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o059phn",
              "author": "General_Maize_7636",
              "text": "Referrals + LinkedIn work great now. When I was starting, upwork/fiverr/outreach were good.",
              "score": 3,
              "created_utc": "2026-01-17 18:15:41",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o05rgui",
                  "author": "AcanthisittaNo6174",
                  "text": "Which package of LinkedIn or what’s the approach there I sell something different but curious",
                  "score": 1,
                  "created_utc": "2026-01-17 19:38:40",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o05ugs2",
          "author": "AcanthisittaNo6174",
          "text": "What’s the best approach on I’m trying to understand what’s the best way to have a fully connected setup where everything talks to everything. For talent placement companies I have People (candidates AND clients) come to my website, fill out a form, and that lead is instantly created in HubSpot. If a known prospect or company browses my site, I get notified in HubSpot that they visited. I would use Apollo for outreach (email, LinkedIn, calls), and all activity is logged back into HubSpot automatically. Once someone is ready, a contract is auto-sent and signed online (DocuSign/PandaDoc/SignWell), and that status is tracked in the CRM too. End goal: one clean system where website visits, leads, outreach, calls, client and candidate contracts, and follow-ups are all centralized with minimal manual work. And live jobs are feeding on web",
          "score": 1,
          "created_utc": "2026-01-17 19:53:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o07mn3p",
          "author": "Remarkable_Guava942",
          "text": "Most people stuck at zero clients usually have one of three problems:\n\t1.\tThe offer is unclear\n\t2.\tThe outreach message has no hook\n\t3.\tThey’re talking to the wrong audience\n\nIf you want, tell me what you’re selling and how you’ve tried getting clients — I’ll point out the exact issue.",
          "score": 1,
          "created_utc": "2026-01-18 01:22:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o08ecx9",
          "author": "Behind_the_workflow",
          "text": "Getting the first few clients is brutal! Congrats on landing those clients mate, that always feels like the hardessst jump. When I was starting out, I overcomplicated everything. I think, the big unlock was just recording my process and showing people what I do. Once they see you actually fix their pain point and make their life easier, it’s pretty much a trust and time game after that.",
          "score": 1,
          "created_utc": "2026-01-18 03:55:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o08zj6u",
          "author": "JedXie",
          "text": "Hi, could you share some details on how to acquire customers on LinkedIn? I still haven't figured out the features of the LinkedIn platform. I've tried posting descriptions of some projects, but with little success.",
          "score": 1,
          "created_utc": "2026-01-18 06:26:43",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qdfrq0",
      "title": "Is it realistic to become a freelancer and start making money in 4–6 months?",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qdfrq0/is_it_realistic_to_become_a_freelancer_and_start/",
      "author": "MarcoAcrono",
      "created_utc": "2026-01-15 10:09:47",
      "score": 13,
      "num_comments": 17,
      "upvote_ratio": 1.0,
      "text": "Hey, I’m learning automation right now. I’m currently learning Make, and I’m making good progress and understand the basics well. I’m also a former junior web developer, so I already know APIs and related stuff.\n\nI’m taking Nick Sarev’s course and I’ll finish it by the end of this month. After that, I plan to practice more and start offering Make automation services. Then I want to move on to learning n8n, prompt engineering, and later Python and AI agents.\n\nMy goal is to be ready to take freelance jobs and start earning money in about 4 months. Is that a realistic goal? ( 500$)\n\nAlso, does my learning roadmap make sense, or should I change anything?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qdfrq0/is_it_realistic_to_become_a_freelancer_and_start/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "nzr9ik2",
          "author": "Realistic-Middle7168",
          "text": "yes of course I think you will also need to learn to market your service and find clients online.if you can do that you can easily achieve these targets.the most dificult part is to find clienst",
          "score": 2,
          "created_utc": "2026-01-15 16:53:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzt743o",
          "author": "lucas_gdno",
          "text": "Yeah 4 months is doable if you already know APIs. The web dev background helps a ton since half the freelance work is just connecting different services together anyway. Make is solid but honestly the real money is in the boring stuff - Zapier integrations for small businesses who don't even know Make exists. Also maybe skip straight to learning AI agents while they're hot.. everyone wants \"AI automation\" now even if they don't know what it means",
          "score": 2,
          "created_utc": "2026-01-15 22:10:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o03cwel",
          "author": "Tricky-Rip-6434",
          "text": "If you have a skill and you are not looking for quick money, just invest time in developing the skill, and you will run a business that provides tour skills as the product.\nYou will have less burnout and still feel like it's a game while your competitors try to copy what they don't know. Overall, you could build generation wealth.\nI would leave you a breakdown of how to run a business, but you can find many that my help you on my profile.",
          "score": 2,
          "created_utc": "2026-01-17 12:09:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzpcve4",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-15 10:09:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nztjsxe",
          "author": "WorkSmoothie",
          "text": "Clientele determines income. If you’re starting from zero then the question is can you find a client in 4-6 months? Yes. But you will need to be aggressive in your outbound sales methods",
          "score": 1,
          "created_utc": "2026-01-15 23:14:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nztsmqk",
          "author": "Cheap_Advisor_8218",
          "text": "Honestly, yes. Getting your first 1-5 clients will be tough but after that you'll start to learn what works and who you want to work with.",
          "score": 1,
          "created_utc": "2026-01-16 00:02:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o02ys5c",
              "author": "CulturalSchedule5205",
              "text": "Any advice on approaching or reaching out to potential first clients?",
              "score": 1,
              "created_utc": "2026-01-17 10:02:44",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzu9pnh",
          "author": "massivDirection4tech",
          "text": "with the web dev xp you should check out Nick Saraev's website, it needs some help with responsive design. I watch his stuff and he does seem to know his stuff at least in the projects he shows, especially the one creating a self-anealing ai agent in Antigravity. but one thing i have gathered from him is he's a content creator first, then a sales man, the automation developer...just what I've gathered anyways.\n\nthough if you've watched enough of his stuff you know it should be pretty easy if you guarantee results and offer to not accept payment until you fulfill the promised results. then you remove the risk the Client feels they will be taking, they basically can only win and you get a learning experience either way and something for a portfolio and you have the motivation to perform in order to get paid. he called it buying into the clients success.\n\nI would say make might be a smaller market, def learn it but try to make sure you hit the market with a wide net or more tools on your belt.. n8n +zaper+antigravity+gohighlevel. they all are similar as long as you understand make and APIs the antigravity is more custom which is where you can charge more.\n\n4 months is plenty of time, just create some templates to get a feel for each one of those and you'll hit the ground running.",
          "score": 1,
          "created_utc": "2026-01-16 01:36:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzubv1a",
              "author": "massivDirection4tech",
              "text": "I mention Nick's website just because it would be a cool avenue to make a connection to make...",
              "score": 1,
              "created_utc": "2026-01-16 01:48:28",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzul35j",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-16 02:40:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzvrby8",
              "author": "Realistic-Middle7168",
              "text": "what hussiness are you planning to build",
              "score": 2,
              "created_utc": "2026-01-16 07:27:06",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzv7zv0",
          "author": "clock_tower_climber",
          "text": "Why are focusing on make? This is not cutting edge anymore",
          "score": 1,
          "created_utc": "2026-01-16 04:57:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzv9835",
          "author": "ChestChance6126",
          "text": "Four to six months is realistic for your first paid work, but it will depend more on positioning than on finishing every tool on that roadmap. With Make plus API knowledge, you are already ahead of most beginners. The bigger risk I see is stacking learning instead of shipping small, real automations for real use cases.\n\nIf the goal is $500, focus on one or two boring problems you can solve end to end, lead capture to CRM, reporting, or internal ops. Build a few concrete examples, even if they are self-initiated or for friends. n8n, Python, and agents can come later. Clients pay for outcomes, not tool breadth. Start selling sooner than you feel ready and let the gaps guide what you learn next.",
          "score": 1,
          "created_utc": "2026-01-16 05:06:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzyuofj",
          "author": "Electrical_Heart_673",
          "text": "Yes it's very realistic. I just have a tip that might help you out a lot. \n\n  \nStop wasting the time learning and ty to get clients first because that's the hard part, then just use something like Automly.pro. It can build all of the automations in minutes for you.. Like learning automating is pointless because tools like Automly know more than you and can build out whole systems in minutes with an AI to help you debug too.\n\n  \nLearn to adapt, because if you decide to learn everything yourself to learn it, you'll fall behind bro.",
          "score": 1,
          "created_utc": "2026-01-16 18:36:20",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qbatt6",
      "title": "BE Tasting CSS!",
      "subreddit": "automation",
      "url": "https://i.redd.it/dpql5u0z40dg1.jpeg",
      "author": "Swaraj-Jakanoor",
      "created_utc": "2026-01-12 23:22:33",
      "score": 12,
      "num_comments": 3,
      "upvote_ratio": 1.0,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qbatt6/be_tasting_css/",
      "domain": "i.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "nz95xh5",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-12 23:22:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz966be",
          "author": "SUNnLIGHTN",
          "text": "lick or run?",
          "score": 1,
          "created_utc": "2026-01-12 23:23:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "nz9df9f",
              "author": "Swaraj-Jakanoor",
              "text": "Run…..🏃😅",
              "score": 1,
              "created_utc": "2026-01-13 00:03:00",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qe2un4",
      "title": "Do you actually feel productive… or just busy all day?",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qe2un4/do_you_actually_feel_productive_or_just_busy_all/",
      "author": "Solid_Play416",
      "created_utc": "2026-01-16 01:52:21",
      "score": 11,
      "num_comments": 13,
      "upvote_ratio": 1.0,
      "text": "Lately I end my day tired but not really sure what I *actually* accomplished.\n\nMost of my time goes to small repetitive stuff, checking tools, moving info around manually, answering the same things over and over.  \nData is everywhere, emails, docs, tools… and I don’t have a clear picture of what’s going on at any moment.\n\nFeels like I’m “working” all day but my system is kinda messy.\n\nAnyone else feeling this?  \nHow do you keep things under control without losing your mind?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qe2un4/do_you_actually_feel_productive_or_just_busy_all/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "nzuckdf",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-16 01:52:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzujlnr",
              "author": "Solid_Play416",
              "text": "Thanks! I’ve read the rules and will make sure to follow them.  \nGlad to be here 👍\n\n>",
              "score": 1,
              "created_utc": "2026-01-16 02:31:42",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzv22gg",
          "author": "ops_architectureset",
          "text": "This shows up a lot in ops roles. The pattern behind it is that effort gets spent on glue work instead of decisions. When information lives across tools and has to be reconciled manually, you stay busy but never reach a stable state. Automation helps only if it removes repeat decisions, not just moves data faster. What usually helps is mapping where the same question or action repeats during the day and asking why it exists at all. If that loop is not addressed, no tool really fixes the feeling.",
          "score": 1,
          "created_utc": "2026-01-16 04:18:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzw2h9e",
          "author": "VizNinja",
          "text": "Automate the boring stuff. There are lots if ways to automate.  I am not an n8n fan. It's kludegy.  It's difficult to configure nodes. It has security risks if you don't know what you are doing.  \n\nAI isn't always the answer for automation.  Python is excellent and versatile.  I learned from the book 'Automate the boring stuff'\n\nIf you have the Microsoft platform there are many good tools for automation that are designed for business.\n\nI will tell you that after having automated 80% of my work flows. I had to get use to not needing to do things to feel productive.  I spend 90% of my time looking for how to provide automation that makes a difference for the organization.",
          "score": 1,
          "created_utc": "2026-01-16 09:08:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzwe9hn",
          "author": "techside_notes",
          "text": "Yeah, that feeling usually shows up for me when I haven’t clearly separated “keeping things running” from “actually moving something forward.” Busy days are often just maintenance days in disguise. What helped was mapping where my time was going for a week, not to optimize it, but just to see the loops. A lot of the fatigue came from context switching and rechecking things because I didn’t trust my system. Once I simplified where info lived and decided what deserved automation versus manual attention, the days felt calmer. I still do small repetitive stuff, but now it feels intentional instead of endless.",
          "score": 1,
          "created_utc": "2026-01-16 10:55:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzwtcee",
          "author": "ExtensionBench7270",
          "text": "Yep, very common.\n\nMost of that feeling comes from constant context switching and no single place to see what actually matters. Lots of motion, little clarity.\n\nWhat helps isn’t hustle. It’s fewer tools, clearer priorities, and cutting or batching the repetitive stuff. Once the noise drops, you can actually see progress again.",
          "score": 1,
          "created_utc": "2026-01-16 12:47:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzyqjp6",
          "author": "dailyintelco",
          "text": "Yeah, this is exactly where delegation or automation starts to matter. If you’re spending most of your day repeating the same actions or moving info around, that’s usually a sign the system should be doing more of that work for you. Even small automations or handing off low-value tasks can free up a lot of mental space.",
          "score": 1,
          "created_utc": "2026-01-16 18:18:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o03tlds",
          "author": "ActiveDisaster1687",
          "text": "Same here. I spend all my time on repetitive tasks, when I finally try to get some work done, I'm called into meetings. I get dazed from all the context switching. Sometimes I feel like just sitting in front of the monitor, and the day is already over.",
          "score": 1,
          "created_utc": "2026-01-17 14:01:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o08z4kw",
          "author": "signal_loops",
          "text": "when your day is dominated by context switching, manual handoffs, and reactive work, your brain registers effort but not progress because nothing ever feels done. the way out isn’t working harder or adding another app, it’s reducing the number of places work can hide and making outcomes visible. that usually means picking a single source of truth for tasks or state  batching repetitive work instead of responding instantly, and automating or templating the small things that repeat daily so your attention is reserved for decisions, not movement. agood litmus test is asking yourself at the end of the day,   What changed because of my work?  If that’s hard to answer, it’s a sign your system needs tightening, not that you’re failing. most people who regain a sense of productivity don’t do more they design their workflows so progress is obvious and friction is removed.",
          "score": 1,
          "created_utc": "2026-01-18 06:23:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o09rxmw",
          "author": "autom8r_",
          "text": "It's definitely worth putting in the effort upfront to configure a system that can help you break out of this loop.",
          "score": 1,
          "created_utc": "2026-01-18 10:44:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzud3gu",
          "author": "automator71",
          "text": "This hits different. I had the exact same problem until I started building automations for the repetitive stuff. The key thing I realized is that \"busy\" usually means you're doing the same manual tasks over and over.\n\n\n\nNow I use n8n and Make to handle the data shuffling, email management, and tool switching. Frees up so much mental energy to actually focus on the work that matters.\n\n\n\nThe difference? Actual completion vs constant context switching. Small automation can seriously change how you feel about your workday.",
          "score": 1,
          "created_utc": "2026-01-16 01:55:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzuk1h5",
              "author": "Solid_Play416",
              "text": "100% this.  \nThat “busy = same manual loops” realization is huge.\n\nWhat surprised me the most wasn’t even the time saved, but how much calmer the workday feels once context switching drops. Like… fewer tabs, fewer decisions, fewer “where was I?” moments.\n\nCurious: did you automate everything at once, or did you start with one annoying workflow and build from there?",
              "score": 0,
              "created_utc": "2026-01-16 02:34:10",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qev1vo",
      "title": "What does an AI agency do?",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qev1vo/what_does_an_ai_agency_do/",
      "author": "NikhilSaif",
      "created_utc": "2026-01-16 22:57:23",
      "score": 10,
      "num_comments": 21,
      "upvote_ratio": 0.78,
      "text": "I'm no engineer or developer, I have zero technical background. But I find AI due to its machine learning capabilities can automate a lot of repeated works and increase productivity and reduce costs for businesses. I know it will be possible, I just don't know if its possible now or is it already being done. For example, there are supermarket chains that have order invoicing and PO that are done daily by employees which is repeated everyday. There are accounting works that almost repeated every month. I have spoke to few AI agencies and they state they implement automation based on what the client needs. But the problem is most clients don't know they need it. I think that's where the market gap is. You show the problem and then sell the solution. I can bring on clients, I have done it before. But I don't know what to sell to them or have the product. If there are AI solutions that definitely helps businesses,its not just slop and most importantly scalable . I would really like to know what you guys are doing.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qev1vo/what_does_an_ai_agency_do/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "o00trhl",
          "author": "WorkLoopie",
          "text": "I own an AI automation agency- and we do so much more than just repetitive stuff. We build Ai agents that aid in decision making, that help streamline processes and ensure cohesion. I’d say it a powerful tool when properly implemented. However there are so many people out there that don’t understand how to use it beyond prompting.",
          "score": 5,
          "created_utc": "2026-01-17 00:25:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o01fmns",
              "author": "GhostTrainSauce",
              "text": "If you don’t mind me asking. How do you find your clients? I’m on the same journey. I was thinking of doing free AI audits so I can uncover those inefficiencies.",
              "score": 1,
              "created_utc": "2026-01-17 02:41:21",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o01kyfe",
                  "author": "WorkLoopie",
                  "text": "Mostly referrals.",
                  "score": 1,
                  "created_utc": "2026-01-17 03:14:46",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o021l56",
              "author": "That-Shoe-9599",
              "text": "Off topic, but what should I learn after prompting and iterating the results?  I find this process improves my understanding of the task and improves the result.",
              "score": 1,
              "created_utc": "2026-01-17 05:09:18",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o029wjc",
              "author": "Exact-Fish-9106",
              "text": "yeah its true",
              "score": 1,
              "created_utc": "2026-01-17 06:14:43",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o06ebu1",
          "author": "Gullible-Storm9278",
          "text": "It sounds like you’ve got a good grasp on the potential of AI for businesses. I think you're right about the market gap; a lot of companies don’t even realize there are solutions that could save them time and money. I’ve seen some agencies help with automating things like invoicing too, like what you mentioned, and it feels like we're just scratching the surface. I tried Subleadit for some marketing stuff, and it definitely showed me the power of automation in a different context. It’s all about finding the right fit for clients, I guess.",
          "score": 2,
          "created_utc": "2026-01-17 21:35:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o00e271",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-16 22:57:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o01jp82",
          "author": "latent_signalcraft",
          "text": "what most of those agencies actually do today is closer to workflow automation than AI in the abstract. they map repetitive processes clean up the data inputs, add rules and sometimes layer models on top once the process is stable. the scalable wins usually come from boring things like invoice matching reconciliation or intake classification but only after ownership and exceptions are defined. the hard part is not selling automation it is helping clients see which workflows are ready versus which will collapse without governance and clean data.",
          "score": 1,
          "created_utc": "2026-01-17 03:06:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o01pn4p",
          "author": "Beneficial-Panda-640",
          "text": "A lot of what gets labeled “AI agency” work right now is really process discovery plus automation, with a thin layer of ML where it actually adds value. The hard part is rarely the model. It is figuring out what work is stable enough, well defined enough, and governed enough to automate without breaking things.\n\nYou are right that many clients do not know what they need. That is because their work is full of exceptions, informal handoffs, and tribal knowledge. Invoicing and accounting sound repetitive, but they usually hide edge cases that humans quietly resolve. Agencies that succeed tend to start by mapping the workflow, identifying decision points, and separating “rules we understand” from “judgment we outsource to people.”\n\nThe scalable opportunities are usually boring things like data movement, reconciliation, validation, and alerts, not full end to end replacement of roles. If you walk in selling “AI,” people get confused or defensive. If you walk in showing where work breaks, gets delayed, or depends on one person’s inbox, the automation conversation becomes much more concrete.",
          "score": 1,
          "created_utc": "2026-01-17 03:45:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o028jsb",
          "author": "newrockstyle",
          "text": "AI agency identifies repetitive tasks and implement scalable automation solutions tailored to client needs.",
          "score": 1,
          "created_utc": "2026-01-17 06:03:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o02f69i",
          "author": "Far-Bend3709",
          "text": "AI agencies don’t sell  AI  they sell automation of boring, repeat work. Think invoices, POs, reconciliations, emails, reports. The win isn’t tech, it’s spotting inefficiencies clients don’t see, then replacing manual steps with bots  AI. The scalable play is niche workflows + clear ROI, not buzzwords.",
          "score": 1,
          "created_utc": "2026-01-17 07:00:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o03tvgj",
          "author": "dmc-123",
          "text": "It's been my experience that automation is great for middle and back-office operations, while AI is more prevalent in the front of the house. AI solutions are sometimes harder to position because savings are soft costs, and business owners have a hard time seeing them until they are implemented.",
          "score": 1,
          "created_utc": "2026-01-17 14:03:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o040c78",
          "author": "signal_loops",
          "text": "if you’re strong at bringing clients but non technical, the winning setup is partnering with an automation builder or hiring one contractor and focusing yourself on diagnosis and ROI framing your value is spotting inefficiencies, quantifying cost, and selling outcomes. the tech stack already exists; the gap is understanding where AI actually fits and where it doesn’t. that’s why good AI agencies look more like process consultants with automation muscle, not software startups.",
          "score": 1,
          "created_utc": "2026-01-17 14:38:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o08fshq",
          "author": "Behind_the_workflow",
          "text": "Totally get this. The funny thing is that is everyone defines them differently.\n\nHonestly, kinda like what you said....the real ones I’ve seen focus on the boring stuff that actually moves the needle: fixing broken intake forms, cleaning data, making sure the same thing runs every time. Most people overcomplicate it with big automation promises when all clients really want is consistency.",
          "score": 1,
          "created_utc": "2026-01-18 04:04:36",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qfj9mg",
      "title": "How to pick a process to automate that sticks?",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qfj9mg/how_to_pick_a_process_to_automate_that_sticks/",
      "author": "abdush",
      "created_utc": "2026-01-17 17:29:56",
      "score": 10,
      "num_comments": 10,
      "upvote_ratio": 1.0,
      "text": "Working with a retail firm to help their Ecomm team identify processes they can automate. I am not an expert in this and doing this as a help. \n\nThe company has tried doing several automations on various processes from inventory management, supplier invoicing and so on. But none are getting used every day, or by all team members - because either they are comfortable doing the old way, most automation done needs keeping a diligent watch for any errors, or fully automated processes are just good to have or minor part of a bigger work\n\nThis also makes wider team hesitate to use AI\n\nWhat would be a good approach in this scenario? Are there any processes you feel can be reliably automated in Ecomm and retail?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qfj9mg/how_to_pick_a_process_to_automate_that_sticks/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "o04zwlh",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-17 17:30:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o057e3g",
          "author": "Accurate_Apricot_827",
          "text": "What data points do you have? Are you able to \"shadow\" them during a normal workday e.g through their slack channel or something similar? Good analysis will only happen with good data",
          "score": 1,
          "created_utc": "2026-01-17 18:04:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o058c5t",
              "author": "abdush",
              "text": "I m allowed to have zoom calls - generally 30 mins to 45 mins with various team members. I won’t get access to their systems",
              "score": 1,
              "created_utc": "2026-01-17 18:09:21",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o07vlo1",
          "author": "Electronic-Cat185",
          "text": "the automations that stick usuallly remove a pain everyone feels daily, not a theoretically efficient step. if a processs is only used weekly or needs constant babysitting, people willl defaullt back to muscle memory. i would start by mapping where errors, delays, or copy paste work cause the most frustratiion, not where automation looks impressive. In retail and ecomm, things like report prep, alerts for exceptions, or data cleanup tend to get adopted because they support existiing workflows instead of replaciing them. Adoption follows trust, and trust comes from boring reliability more than clever AI.",
          "score": 1,
          "created_utc": "2026-01-18 02:10:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o08v937",
          "author": "ChestChance6126",
          "text": "Automations stick when they remove daily pain, not when they’re technically impressive. Focus on high-frequency, low-judgment tasks that multiple people already hate doing. If it needs babysitting or only saves a little time, teams will ignore it.",
          "score": 1,
          "created_utc": "2026-01-18 05:51:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o093qjm",
          "author": "signal_loops",
          "text": " tie each automation to a simple, observable metric time saved per week, error reduction, faster decisions so the team sees value quickly  once one or two automations become boringly reliable, trust tends to follow and broader AI adoption becomes much easier.",
          "score": 1,
          "created_utc": "2026-01-18 07:02:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o099rbj",
          "author": "Ancient-Subject2016",
          "text": "At scale, the issue usually is not picking the “right” process, it is picking one where failure is boring and visible. Automations that stick tend to sit in the critical path, have a clear owner, and save time every single day, not occasionally. If people have to babysit it or double check outputs, adoption dies fast and trust goes with it. I would start by mapping where errors escalate today and asking which steps leadership actually cares about when they break. Inventory, pricing, refunds, and order exceptions can work, but only if there is tight monitoring and a clear rollback when something goes wrong. Teams hesitate to use AI when accountability is fuzzy, not because they dislike automation.",
          "score": 1,
          "created_utc": "2026-01-18 07:56:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o09t0xp",
          "author": "Beneficial-Panda-640",
          "text": "What usually makes automation stick is less about picking the “right” process and more about picking the right pain. If a process only saves time on a good day, people will fall back to muscle memory. The ones that get adopted tend to remove a recurring annoyance or risk, like constant rework, late surprises, or manual reconciliation that no one enjoys. I’d look for work that is frequent, boring, and already mentally tax­ing, especially around handoffs. Also worth noticing that low trust kills usage fast. If people have to babysit the automation, it feels like extra work. Starting with partial automation that makes the work easier, not invisible, often builds more confidence than trying to go fully hands off too early.",
          "score": 1,
          "created_utc": "2026-01-18 10:54:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0aj728",
          "author": "signalpath_mapper",
          "text": "The automations that stick usually remove pain people feel every single day. If it is optional or \"nice to have,\" it dies fast. At our volume, anything that still needed constant babysitting also got ignored because it added stress instead of removing it. What worked was starting with the ugliest, most repetitive work that no one wanted to defend, things like order status updates, basic refunds, or data handoffs between systems. If the automation cannot run quietly and fail safely, people will not trust it. Adoption follows reliability, not novelty.",
          "score": 1,
          "created_utc": "2026-01-18 14:10:10",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qfdux0",
      "title": "What AI tools do you use the most in 2026?",
      "subreddit": "automation",
      "url": "https://www.reddit.com/r/automation/comments/1qfdux0/what_ai_tools_do_you_use_the_most_in_2026/",
      "author": "Abhi_10467",
      "created_utc": "2026-01-17 13:57:31",
      "score": 8,
      "num_comments": 5,
      "upvote_ratio": 0.75,
      "text": "For me:\n\n* **ChatGPT** – I use this almost daily. Brain dump, planning, overthinking… it handles all of it better than I do most days\n* **Claude & Gemini** – Got these recommended a while back and now I rotate between them for writing, summaries, and school-related stuff. Each one has its own strengths.\n* **Suno** – Still my favorite for messing around with music ideas. Not replacing real production, but great for quick inspiration.\n* **Gensmo** – Super convenient when I don’t feel like putting outfits together. Surprisingly decent suggestions.\n* **Zoviz** – I’ve been using it lately for branding-related things (logos, visuals, quick design assets). I’m not a designer, so having something that keeps things consistent without much effort has been helpful.\n\nCurious what everyone else is relying on this year. Are you sticking with a few core tools or constantly trying new ones as they pop up?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/automation/comments/1qfdux0/what_ai_tools_do_you_use_the_most_in_2026/",
      "domain": "self.automation",
      "is_self": true,
      "comments": [
        {
          "id": "o03tt68",
          "author": "GeekTX",
          "text": "we are 17 days into 2026 and you think maybe toolsets and preferences changed since just 18 days ago?\n\n:D",
          "score": 3,
          "created_utc": "2026-01-17 14:02:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0a107l",
              "author": "necromenta",
              "text": "It’s always an ad for some product",
              "score": 2,
              "created_utc": "2026-01-18 12:04:34",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o03svwo",
          "author": "AutoModerator",
          "text": "Thank you for your post to /r/automation!\n     \nNew here? Please take a moment to read our rules, [read them here.](https://www.reddit.com/r/automation/about/rules/)\n\nThis is an automated action so if you need anything, please [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fautomation) with your request for assistance.\n\nLastly, enjoy your stay!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/automation) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-17 13:57:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o056zub",
          "author": "Electrical_Heart_673",
          "text": "I've been using:\n\n\\- **Antigravity**, for real the craziest AI coding platform out there\n\n\\- **Gemini**, just for brainstorming and the image generation\n\n\\- **Automly**, builds out all of the automations for me",
          "score": 1,
          "created_utc": "2026-01-17 18:03:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o08p63b",
          "author": "kubrador",
          "text": "i'm just here watching people optimize their way into using eight different apps to do what one used to do. \"brain dump\" is just called thinking but sure, let's add another subscription",
          "score": 1,
          "created_utc": "2026-01-18 05:06:50",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}