{
  "metadata": {
    "last_updated": "2026-02-07 08:49:57",
    "time_filter": "week",
    "subreddit": "b2bmarketing",
    "total_items": 20,
    "total_comments": 219,
    "file_size_bytes": 239919
  },
  "items": [
    {
      "id": "1qsteye",
      "title": "How a B2B company makes millions with their tiny Youtube channel",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qsteye/how_a_b2b_company_makes_millions_with_their_tiny/",
      "author": "illeatmyletter",
      "created_utc": "2026-02-01 08:55:23",
      "score": 73,
      "num_comments": 28,
      "upvote_ratio": 0.95,
      "text": "I came across this breakdown and it completely flipped how I thought about YouTube. Figured it might be valuable for you as well.\n\nMost founders assume YouTube only works if you go big. Massive subscriber counts, viral videos, influencer-level reach. But this case study proves that's wrong, well at least for B2B.\n\nThere's a small company in immigration + tax optimization. Nothing sexy. Their average client pays around $2,000 though. Their YouTube channel has maybe 1,000 to 1,500 subscribers. And from that channel alone, they've booked 500+ sales calls. That's easily seven figures in revenue from what most people would call a \"dead\" channel.\n\nBut it gets crazier… They get only around 350 to 400 views per day. About 30 videos total. But they close roughly half their calls. They even spun up a second channel in another language with under 30 subscribers, and it already brought in multiple paying clients.\n\nThis is why B2B YouTube is a completely different game.\n\nSubscriber count is a vanity metric. What actually matters:\n\n* Who's watching: are they decision-makers or random browsers?\n* Why they're watching: are they actively looking for a solution?\n* How much one customer is worth: if a client pays $2k, $10k, or more, you don't need scale\n\nThe videos that drive revenue on this channel aren't flashy. They're boring, high-intent, search-driven stuff: \"how to get residency in X,\" \"best tax residency for digital nomads,\" country comparisons etc. These aren't entertainment videos. They're decision-stage videos, which means the viewer is already problem-aware and actively searching for a solution. That's why they convert.\n\nIf you're selling something where one customer is worth a few thousand dollars or more, obsessing over subscriber count makes no sense. A small channel with the right topics can outperform a larger audience watching for entertainment. The leverage comes from intent, not scale.\n\nI’d love to hear form other founders to see if you’ve had similar results? Have any of you tried YouTube as an acquisition channel? What results did you see?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qsteye/how_a_b2b_company_makes_millions_with_their_tiny/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o2xwjox",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-01 08:55:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2z1ey2",
          "author": "Admirable_Swim_7805",
          "text": "this is gold, been telling clients for years that subscriber count means nothing in b2b. set up a workflow for one that auto tracks intent keywords from youtube searches, tags who watches pricing videos, then triggers a custom outreach sequence same day. went from random views to booked demos. the magic is in connecting youtube watch data to your crm and treating every view like a warm lead not vanity metric. search intent content beats entertainment every time",
          "score": 9,
          "created_utc": "2026-02-01 14:17:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o32xtfk",
              "author": "Comfortable_Win4678",
              "text": "what tool do you use to auto track intent keywords and also get their email?",
              "score": 3,
              "created_utc": "2026-02-02 01:55:12",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2ytifk",
          "author": "DaCmanLou",
          "text": "💯 true. Not only your own channel. I got a year of clients from being a guest on a podcast that only got 220 views.",
          "score": 6,
          "created_utc": "2026-02-01 13:30:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o32ggto",
          "author": "GeneralNetwork1318",
          "text": "This is almost exactly what happened with us. We started posting decision-stage videos around topics our ICP was already searching for and the calls just started coming in. Took us a while to figure out what topics to focus on though. \n\nThe team we worked with (Represent Studio) helped us dial that in, and created a strategy for us that made all the difference. Since then we started closing clients consistently through YT.",
          "score": 5,
          "created_utc": "2026-02-02 00:17:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3lfw2w",
          "author": "External_Design5985",
          "text": "Mind sharing the channel link?",
          "score": 3,
          "created_utc": "2026-02-04 20:33:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3p615t",
              "author": "norfolk789",
              "text": "that would help wouldn't it",
              "score": 2,
              "created_utc": "2026-02-05 11:18:30",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3p64g6",
                  "author": "External_Design5985",
                  "text": "Very",
                  "score": 2,
                  "created_utc": "2026-02-05 11:19:17",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o30b54b",
          "author": "AdamYamada",
          "text": "This reminds me Insurance Exam Queen. \n\n\nShe teaches people how to pass insurance exams. \n\n\nShe has made $1 million+ on her YouTube channel. \n\n\nIt's hyper focused content and she does a great job at teaching. ",
          "score": 2,
          "created_utc": "2026-02-01 17:56:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o31brng",
          "author": "Kamel_Ben_Yacoub",
          "text": "True, for many of our B2B SaaS clients YouTube ads is actually their top-performing campaign type.\n\nSince we have seen pretty good results lately we’ve been pushing more clients to move some of their search paid budget into YouTube Ads. It works well when you know your audience. \n\nCPVs (Cost Per View) are still very cheap and most B2B SaaS advertisers still aren't taking advantage of the YouTube placement, sticking only to Google Search.\n\nOur go-to setup is using YT ads In-Feed placements to reach cold audiences and In-Stream ads for retargeting.",
          "score": 2,
          "created_utc": "2026-02-01 20:47:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o31rmlh",
          "author": "OkDependent6809",
          "text": "this is actually smart and matches what i've seen work in b2b.\n\nwe tried youtube at my company for like 6 months. got maybe 200 subscribers, felt like a failure, stopped doing it. but looking back we were chasing views instead of targeting high intent searches.\n\nthe mistake we made was trying to make \"engaging content\" instead of just answering the exact questions our target customers were googling. boring works better for b2b.\n\none thing though. how do you figure out what high intent topics to cover? like how did that immigration company know which specific videos would drive calls? did they just guess or is there a way to validate topics before spending time making videos?\n\nwe wasted a ton of time making videos nobody searched for. would love to know how to avoid that.",
          "score": 2,
          "created_utc": "2026-02-01 22:04:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o348s0w",
              "author": "Content_Paths",
              "text": "Ask yourself what your clients have to go through (pain points, blockages...) so they'd decide to look for your solutions.\n\nEvery business solves a certain problem, your role should be to educate about that problem so you'd come up when people who have it look it up on YouTube or it'll be recommended to them when they're looking for something similar. For B2B channels, content strategy plays the biggest role in conversions (or at least in driving people further down your funnel). \n\nThe behind the scenes is to humanize the channel and get people to know you and your process a little more. It's also great for the warmest prospects amongst your audience who just need a little push to decide.\n\nHope this helps, let me know if you have any other questions. We're a YouTube video editing agency for coaches and business owners and I'd be happy to support however I can. No strings attached.",
              "score": 2,
              "created_utc": "2026-02-02 07:13:49",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2yh98n",
          "author": "No_Hedgehog8091",
          "text": "Spot on about search intent vs size. We tested this in SaaS - a single 'how to solve X problem' video with 800 views brought more enterprise leads than our viral 100k view product launch. High-ticket B2B is about being there when they're actively searching.",
          "score": 1,
          "created_utc": "2026-02-01 12:02:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o32fd32",
          "author": "KissyyyDoll",
          "text": "Subscriber count is cope for B2B - search intent and deal size are the only metrics that matter",
          "score": 1,
          "created_utc": "2026-02-02 00:11:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o349jyf",
          "author": "Content_Paths",
          "text": "I'm building my agency entirely around that 😆 since COVID people are trusting video content more and more, and what people fail to understand is that YouTube is not an entertainment platform, it's a unique search engine where people come to find solutions! And that's literally every business that exists because every business solves a certain problem for a specific audience.",
          "score": 1,
          "created_utc": "2026-02-02 07:20:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o34wjty",
          "author": "ItinerantFella",
          "text": "Cool reminder about the value of the audience and content.\n\n\nImmigration and tax services sounds B2C though. \n\n\nOur average B2B customer is $5m.",
          "score": 1,
          "created_utc": "2026-02-02 10:59:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o34ybue",
          "author": "Soft-Dragonfruit6447",
          "text": "Focused, problem-solving videos consistently outperform high-view content in B2B.",
          "score": 1,
          "created_utc": "2026-02-02 11:14:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o36y70f",
          "author": "Due-Tip-4022",
          "text": "One thing about this is it helps to niche down, if you can.\n\nWhere what we do, this doesn't necesarily apply. \n\nOur customers are absolutely worth that. I have one that brings me about $200K+ a year in sales.\n\n  \nBut my service solves a problem that people don't search for the early stages what we do. They search for a very specific thing that wouldn't necesarily have anything to do with our service directly unless we niche down to that one very specific thing. Yet that thing, it's not something you need to Youtube. You already know the solution, so you Google looking for a suplier of that very specific thing. In which case, the ranking on Google is exceptionally competitive. The only people searching Youtube for what I do are people who are too small for my service to make sense.\n\nIf you can niche down, and what you do is something that people do have questions about, then absolutely this works. I'm just not this thing.",
          "score": 1,
          "created_utc": "2026-02-02 17:50:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o393d4g",
          "author": "SnooRadishes4728",
          "text": "I might have to tap into trying this, I know it's a build process though right now im trying to land my first couple of clients ASAP",
          "score": 1,
          "created_utc": "2026-02-03 00:02:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3aj0ug",
          "author": "Odd-Pension-5078",
          "text": "Please share that youtube channel \n\nWould like to explore",
          "score": 1,
          "created_utc": "2026-02-03 05:10:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3asob8",
          "author": "Abhinaik-tv",
          "text": "this is so nice, can u share the link to that youtube channel?",
          "score": 1,
          "created_utc": "2026-02-03 06:26:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3hn13v",
          "author": "GrowthWithNina",
          "text": "this actually makes a lot of sense. it’s the same pattern you see with search-driven content vs social content.  \nif someone’s watching “how to solve X problem” instead of “top 5 trends,” they’re already halfway to buying.  \n  \nfeels like youtube just becomes a long-form version of high-intent search when done this way, small audience, but the right one.",
          "score": 1,
          "created_utc": "2026-02-04 06:55:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3okcmj",
          "author": "belth1r05",
          "text": "yep this checks out. b2b youtube is basically seo with a face, not a viral game. if your vids answer high intent searches and your client value is 2k+, you only need a few right viewers a month and it prints.\n\ndid the breakdown mention their funnel? ",
          "score": 1,
          "created_utc": "2026-02-05 07:54:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3q2waj",
          "author": "New_Grape7181",
          "text": "I've seen this work in practice too. We created about 15 videos addressing specific use cases our buyers were searching for. Nothing fancy, just screen shares and talking heads. The channel has maybe 400 subscribers, but those videos consistently bring in 3-5 qualified leads per month.  \n  \nThe bit that surprised me was how much easier the sales conversations were. When someone books a call after watching a 7-minute video of you explaining exactly how something works, they're already halfway sold. The close rate difference was massive compared to cold outbound.  \n  \nOne thing I'd add is that the video titles and descriptions need to match the exact phrases your buyers are typing into Google. We initially titled videos what we thought sounded good, but when we switched to boring, literal search terms like \"how to automate meeting booking for sales teams\", the views from the right people went up dramatically.  \n  \nThe production quality barely matters either. Our best performing video was shot on a laptop webcam with a wrinkled shirt in the background.  \n  \nWhat's the average time between when someone watches a video and when they book a call for you?",
          "score": 1,
          "created_utc": "2026-02-05 14:46:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3rsh2s",
          "author": "GrowthLab_Devanshi",
          "text": "I converted b2b clients this way for a swimming pool contractor company.\n\nJust a small YouTube channel talking about their technical USPs, how they work, key people, etc. Works like gold!",
          "score": 1,
          "created_utc": "2026-02-05 19:34:34",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1quokic",
      "title": "I sent 217,000 cold emails in 2025. Here's why I switched to LinkedIn social listening and the results so far",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1quokic/i_sent_217000_cold_emails_in_2025_heres_why_i/",
      "author": "Soft-Dragonfruit6447",
      "created_utc": "2026-02-03 10:34:45",
      "score": 37,
      "num_comments": 23,
      "upvote_ratio": 0.88,
      "text": "Started noticing deliverability fatigue around email 150K. Reply rates dropped from 2.1% to 0.7%. Domains were getting burned faster than I could warm new ones.\n\nThe breaking point: spending more time managing infrastructure (SPF records, inbox rotation, warmup sequences) than actually talking to prospects.\n\nWhat I switched to:\n\nInstead of blasting cold emails, I started tracking buying signals on LinkedIn. When someone posts about their pain point or mentions a competitor, I engage there first. Warm intro before any DM or email.\n\nResults after 90 days:\n\n* Reply rate: 12% (vs 0.7% with cold email)\n* Meetings booked: 34 (vs 8-12/month with email)\n* Time spent on infrastructure: basically zero\n\nStack I'm using:\n\n* OutX to track keywords + competitors on LinkedIn automatically\n* Sales Navigator for additional research\n* Clay for data enrichment and list building\n* Apollo for contact verification and backup outreach\n* Instantly for the few cold emails I still send (way less volume now)\n* Notion to track conversations and buying signals\n* ChatGPT to help personalize responses at scale\n\nThe tradeoff: this doesn't scale to 1000+ touches/day like cold email. But I'd rather have 50 warm convos than 500 cold bounces.\n\nAnyone else making this shift or am I crazy for ditching cold email volume?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1quokic/i_sent_217000_cold_emails_in_2025_heres_why_i/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o3bj3ue",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-03 10:34:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3brzft",
          "author": "InnerBuilding7949",
          "text": "How u can find people posting about their pain points and their competitors?",
          "score": 3,
          "created_utc": "2026-02-03 11:50:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3j0v0l",
              "author": "raccoonsleepy712",
              "text": "same question",
              "score": 1,
              "created_utc": "2026-02-04 13:40:53",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3enxxi",
          "author": "CodSpiritual8618",
          "text": "Please die. As early as possible.\n\nI report 10-20 guys like you each day. Low effort no outcome.",
          "score": 3,
          "created_utc": "2026-02-03 20:36:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3g53w3",
              "author": "therealtricklowe",
              "text": "Just curious, what would you report these people for?",
              "score": 0,
              "created_utc": "2026-02-04 01:05:52",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3ghaz0",
          "author": "and-so-what-78",
          "text": "217k is a lot, that only means there's something wrong with your cold email system. I sent 2 cold emails in a week, both prospects responded and of them turned into a closed deal. That's how you do cold email the right way. Quality over quantity",
          "score": 3,
          "created_utc": "2026-02-04 02:14:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3e0qqg",
          "author": "Recent_Lab_5442",
          "text": "Is no one seeing that this is a promo for OutX? 🙄",
          "score": 3,
          "created_utc": "2026-02-03 18:48:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3g71bt",
              "author": "benclarkereddit",
              "text": "They’re all bots or as good as bots",
              "score": 0,
              "created_utc": "2026-02-04 01:16:43",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3bq93k",
          "author": "KissyyyDoll",
          "text": "Not crazy at all. Cold email at scale feels pretty broken right now",
          "score": 1,
          "created_utc": "2026-02-03 11:37:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3cnk5r",
          "author": "ecom-strategist",
          "text": "Looks interesting, worth trying",
          "score": 1,
          "created_utc": "2026-02-03 14:59:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3cuvzb",
          "author": "Majestic_Hornet_4194",
          "text": "Sounds like a smart move to me. Cold email volume burns out fast and LinkedIn signals are way more targeted",
          "score": 1,
          "created_utc": "2026-02-03 15:35:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3cxogf",
          "author": "Public_Quiet_3624",
          "text": "Great man. Cold emails and linkedin are enough to find clients. Even I help people in finding emails and linkedin id. I've currently got like 320 thousand emails and linkedins",
          "score": 1,
          "created_utc": "2026-02-03 15:48:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3dabks",
          "author": "OverAgentRoger",
          "text": "Make sense.\n\nSpend $100 a month. Reach out to leads.\n\nAlso, Google is burning \"spam emails\" so you have to be more careful now.",
          "score": 1,
          "created_utc": "2026-02-03 16:47:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3g4z2i",
          "author": "therealtricklowe",
          "text": "I'd love to get to know a little more about this strategy.\n\nI use a couple automated tools for cold outreach, but I know I'm really not using email as well as I could be. ",
          "score": 1,
          "created_utc": "2026-02-04 01:05:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3nvle2",
              "author": "and-so-what-78",
              "text": "You can DM me. My SDR just brought in a lead who bought a $200k USD course for a whale client through cold calling. We also do cold emails but for high tickets, we're seeing great results with cold calls esp if you're targeting whales.",
              "score": 1,
              "created_utc": "2026-02-05 04:33:42",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3utmxe",
          "author": "New_Grape7181",
          "text": "I made a similar shift last year after burning through domains way too fast. The infrastructure management becomes a full-time job.  \n  \nOne thing I'd add to your approach is using video messages after you've engaged on their post. So you comment on their LinkedIn content, wait a day or two, then send a short personalised video referencing what they posted about. I've found it bridges that gap between \"random commenter\" and \"actual conversation\" really well.  \n  \nThe combination of social listening plus video has been way more effective than either alone. Someone already knows who you are from the comment, and the video feels like a natural follow-up rather than cold outreach.  \n  \nYour 12% reply rate is solid. I'm curious though, are you finding certain types of posts convert better than others? Like are pain point posts getting you better responses than announcement posts?",
          "score": 1,
          "created_utc": "2026-02-06 05:54:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3vtqba",
          "author": "_forgotmyownname",
          "text": "This is a massive shift, but it makes total sense given how aggressive spam filters have become lately. 217k emails is a huge volume, and seeing your reply rate drop to 0.7% is a clear signal that the \"spray and pray\" era is dying. Moving toward social listening might be slower, but a 12% reply rate is incredible. It’s better to be a sniper than a machine gunner when everyone has their shields up.",
          "score": 1,
          "created_utc": "2026-02-06 11:21:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3wzf4f",
          "author": "minipouceRAP",
          "text": "You should check buska (to do same as LinkedIn but for all social networks man)",
          "score": 1,
          "created_utc": "2026-02-06 15:28:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3zdej3",
          "author": "Extra-Pomegranate-50",
          "text": "the infrastructure fatigue is so real. ive seen this pattern a lot - people scale cold email, the DNS management becomes a full time job, and the actual selling takes a back seat\n\none thing tho - a lot of that SPF/inbox rotation pain comes from the authentication not being set up right from the start. if each domains got clean SPF (under 10 lookups), DKIM signing with the actual sending domain, and DMARC on at least quarantine, domains last way longer before burning. most people skip this or let thier tools auto-configure it which usually means its half broken\n\nyour shift to warm outreach makes total sense tho. \"50 warm convos vs 500 cold bounces\" is the best summary of this ive seen. cold email still works but only when the foundation is solid, and at 217k volume thats a lot of foundation to maintain",
          "score": 1,
          "created_utc": "2026-02-06 22:25:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o40ahj0",
          "author": "Interesting-Wheel350",
          "text": "Silly question but are all those cold contacts your ICP? Nowadays it’s super tough to gain trust, what I’ve started doing is something I’ve coined called Credibility Engineering, my work involves PR outreach to some degree but I usually align an opportunity with a prospect to get a piece of coverage in exchange for a testimonial and I usually align a conversation off the back of that. It’s a bit more effort but with my offer I need to have leads warm and show them proof of concept so they’re already somewhat intrigued as my offer is quite pricey",
          "score": 1,
          "created_utc": "2026-02-07 01:35:24",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qulifu",
      "title": "How to hire a competent agency for marketing",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qulifu/how_to_hire_a_competent_agency_for_marketing/",
      "author": "Middle_Lavishness137",
      "created_utc": "2026-02-03 07:23:39",
      "score": 29,
      "num_comments": 7,
      "upvote_ratio": 0.82,
      "text": "(I am not personally attacking anyone) but many are simply burning their money by not intervening and questioning their marketing agency enough. I have many clients whose trust has been eroded by scammy marketing agency and I tell them, why did you let this happen? Their answer is always the same. They were oblivious. So, here are a few of my tips that everyone should use if they think their marketing agency is not doing their job.\n\n1. The \"Platform Trap\"Google and Meta are designed to make you spend. Their \"Auto-Apply\" recommendations are often biased toward their revenue, not your ROI. A great agency acts as a filter, knowing when to lean into the machine and when to take back the wheel\n\n.2. Creative is the New Targeting-As privacy laws and \"cookie-less\" tracking have leveled the playing field, your creative is what does the heavy lifting. If your agency isn't using data-backed storytelling, they’re just guessing.\n\n3. The Shift to \"Agentic\" Execution-The best agencies have stopped doing manual, repetitive \"button-clicking.\" They are now leveraging autonomous AI tools to handle the grunt work. By integrating stacks like Blobr AI or Ryze AI, agencies can run 24/7 audits and creative swaps that a human simply can’t keep up with.\n\nNext time, ask the important questions. It pains me to see us marketing agencies get a horrible reputation just because of a few sour apples.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qulifu/how_to_hire_a_competent_agency_for_marketing/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o3az60b",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-03 07:23:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3b6yjr",
          "author": "TheInboxClubAgency",
          "text": "To add to this - it's okay to interrogate results and ask the difficult questions. Good agencies that do good work won't have a problem with digging beneath the 'headline results' if you ask. It's not offensive or a sign of a lack of trust, it's good due diligence.\n\nEven bad results can be manipulated to sound like good results. Feel empowered to scrutinise them.",
          "score": 1,
          "created_utc": "2026-02-03 08:37:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3bgy6i",
          "author": "richants",
          "text": "As a previous agency owner, start by treating the agency like you would staff. It takes commitment from both sides to work well. I would also suggest to communicate results and data via email and use meetings for strategy and in the early stages 4un through lists and basic stuff.\n\nAlso get everyone from the agency who you are working with involved. Often companies deal directly with a project manager but equally important to get feedback from the staff who manage your campaign on a day to day basis. \n\nSet realistic goals from both sides. Often companies want x amount of closes in 3 months but their sales cycle takes 4 months. Then they get frustrated, say it doesn't work and try another agency or strategy with the same result. \n\nAsk agencies for help. If they request something to be completed that impacts their sales but not getting done, ask the agency to do it or take the lead. If it's not a huge project and effects the results they will often just get it done. Otherwise the same conversation takes place every week and becomes a negative point.",
          "score": 1,
          "created_utc": "2026-02-03 10:14:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3c8k00",
          "author": "AzemaGlitch",
          "text": "Like anything, there’s a bell curve. Only 10% of agencies are going to really impress you. I would ask for customer references, refuse to sign a long contract until set goals are met.",
          "score": 1,
          "created_utc": "2026-02-03 13:39:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3f88xd",
          "author": "Turbulent-Cobbler-87",
          "text": "This is why i prefer smaller companies where you can talk to real people. It makes a big difference. Flashy doesn't mean better in business.",
          "score": 1,
          "created_utc": "2026-02-03 22:10:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3gm5h0",
          "author": "Zealousideal-Job6344",
          "text": "My 2 cents, if the agency owners gives you the impression that they can do everything and are the answers to your problems, please run away. No agency can sprinkle pixie dust to overcome all your business challenges to give you stellar results.",
          "score": 1,
          "created_utc": "2026-02-04 02:42:13",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qwl0g8",
      "title": "AI headshot recommendations?",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qwl0g8/ai_headshot_recommendations/",
      "author": "miss_raipelarmzz",
      "created_utc": "2026-02-05 13:17:11",
      "score": 23,
      "num_comments": 15,
      "upvote_ratio": 0.88,
      "text": "\nLooking for affordable headshots for our B2B team page. We need professional headshots for 10 people (sales, marketing, executives) but the headshot photographer quotes near me are $250-400 per person which adds up to $3,000+ total.\n\nThat's a huge chunk of our marketing budget. I've been researching cheaper alternatives and keep seeing AI headshot generators mentioned. Has anyone here used AI headshots for B2B company websites or should I keep looking for a more affordable headshot photographer ?\n\nSomeone mentioned they tried **Looktara** for their team's professional headshots and spent under $300 total instead of thousands, but I'm worried about quality and whether it looks unprofessional for B2B.\n\nFor B2B marketers - what's your recommendation? Find a cheap headshot photographer, use an AI headshot generator, or just pay the premium for traditional photography? Looking for suggestions on best options for professional headshots on a tight budget.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qwl0g8/ai_headshot_recommendations/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o3pmnoe",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-05 13:17:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3puxvr",
          "author": "No_Hedgehog8091",
          "text": "USING TIER A FOR THIS RESPONSE:\n\nTest AI on one person first, compare side-by-side with real photo.",
          "score": 5,
          "created_utc": "2026-02-05 14:04:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3r0r11",
          "author": "Old-Education-6879",
          "text": "You can try using Pixelbin.io. It gives good quality headshot images and also has a reasonable pricing plans.",
          "score": 3,
          "created_utc": "2026-02-05 17:27:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3q0jv5",
          "author": "PLT1789",
          "text": "Just use google nanobanana\nGenerate the first headshot as a « template »\nthen use it to replicate style across the 10 other people\nDon’t spend your time and money on these thin AI wrappers",
          "score": 1,
          "created_utc": "2026-02-05 14:34:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3uzkhz",
          "author": "kaancata",
          "text": "I can really recommend using Antigravity for AI headshot. I think you'd be surprised how far this area has moved. If you have a clear photo of each individual, and some photos of your office environments, it'll get you 90% of the way there. ",
          "score": 1,
          "created_utc": "2026-02-06 06:43:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3vdyu4",
          "author": "tamnvhust",
          "text": "Nano Banana Pro",
          "score": 1,
          "created_utc": "2026-02-06 08:56:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3vz938",
          "author": "_forgotmyownname",
          "text": "For a B2B team page, consistency is actually more important than absolute perfection. AI generators are great at this because you can choose a specific background and lighting style for everyone. If you use a cheap photographer, you might end up with different lighting and quality for each person. At under $300 for the whole team, it is worth a shot. If one or two come out looking a bit \"off,\" you can always have those specific people re-do them or edit them.",
          "score": 1,
          "created_utc": "2026-02-06 12:04:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3pnw0c",
          "author": "Doug-Mansfield",
          "text": "Even in the B2B space I feel like scales have tipped from professional studio headshots to favoring more authentic and candid photos. Though it depends on the nature of the business and what their clients are looking for to validate them. A financial services company might still prefer the studio headshot route. But, I wouldn't discount the possibility that more candid DIY shots of people in their place of work would be suitable for more companies than in years past. It has a more approachable feel.",
          "score": 1,
          "created_utc": "2026-02-05 13:24:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3polod",
          "author": "kiillazy",
          "text": "\nwe used AI headshots for our team page last year because coordinating 10 people for a shoot was a nightmare.\nkept 1 solid photo per person, deleted the rest. no prospects ever commented, metrics didn’t change.",
          "score": 1,
          "created_utc": "2026-02-05 13:28:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3q64hk",
          "author": "Voltalyze",
          "text": "Just use ChatGPT or Grok\n\nUpload the picture there and tell it to replace the background with a plain white color, and also tell it to crop it to be a headshot. \n\nIf this helps, you owe me 10$",
          "score": 1,
          "created_utc": "2026-02-05 15:03:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3pr28w",
          "author": "Positive_Load1595",
          "text": "a startup i advised used Looktara for their team page to save budget.",
          "score": -1,
          "created_utc": "2026-02-05 13:42:40",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qvk104",
      "title": "Why do B2B marketing agencies make you choose between brand building and demand gen? Am I missing something?",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qvk104/why_do_b2b_marketing_agencies_make_you_choose/",
      "author": "wolfybelfy",
      "created_utc": "2026-02-04 09:25:29",
      "score": 19,
      "num_comments": 38,
      "upvote_ratio": 0.93,
      "text": "I've been shopping for a b2b marketing agency for the past month and I keep\n\nrunning into the same thing - agencies are either brand-focused (pretty\n\ndecks, awareness campaigns, thought leadership) or demand-focused (MQLs,\n\npipeline, conversion rates).\n\nWhy is it so hard to find someone who can do both? Our CEO wants brand\n\npresence, our CRO wants pipeline. Seems like these shouldn't be opposing\n\nforces but every agency I talk to picks a lane.\n\nIs this just how the industry works or am I looking in the wrong places?\n\nFor context: Series B SaaS company, \\~$20M ARR, selling to mid-market.",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qvk104/why_do_b2b_marketing_agencies_make_you_choose/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o3i3ckh",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-04 09:25:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3iob00",
          "author": "HelpfulSlip1954",
          "text": "I run a small b2b agency (we cap at 6 clients but we're not cheap) that runs both sides - to do this level of work it requires very specific talent which almost no one has. A lot of demand gen agencies are simply performance marketing (ads) and a lot of brand agencies are simply logos and colors. You need something radically different hard to find.",
          "score": 8,
          "created_utc": "2026-02-04 12:23:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3jqpav",
              "author": "_FalseProphet",
              "text": "I'm a Creative Director with +20years of experience in b2c, but looking to make the jump to a remote work b2b agency! let me know if I can send you my book! :))",
              "score": 1,
              "created_utc": "2026-02-04 15:51:02",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3ioxbt",
          "author": "Kamel_Ben_Yacoub",
          "text": "The issue isn't finding one agency that does both. It's finding agencies that understand how brand and demand work together in a full-funnel strategy, not as separate silos.\n\nAlso, most B2B marketing agencies are generalists and do everything (SEO, PPC, outreach, emailing, sales enablement, etc.), so it's quite difficult to understand what they really do well. You can't be an expert at everything and it's easy to spot when you look at the services they offer. Deep expertise matters.\n\nYou can hire a SEO/content marketing agency and a PPC agency who does demand capture (paid search) and demand gen (paid social). You'll get better results than one large agency with ton of different services.\n\nMost of our B2B SaaS clients hire us for their PPC activities for this reason. Better to get specialists than generalists.",
          "score": 8,
          "created_utc": "2026-02-04 12:28:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3o7l5m",
              "author": "davmav71",
              "text": "the silo problem is usually the real issue, not capability on paper. Specialists can work great, but only if someone is actually owning the full-funnel strategy and making sure those pieces talk to each other.",
              "score": 1,
              "created_utc": "2026-02-05 06:01:29",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3j6q4v",
          "author": "LeadGenDotCom",
          "text": "There are several reasons why this happens. First, many marketing agencies specialize. In practice, many are really tech companies, not really marketing agencies per se, and many others are specialized with respect to a particular service (SEO, telemarketing, etc.) Second, the schools and the industry have moved away from traditional (i.e. Kotler) functions of marketing (which incudes things like market research, strategy development and positioning, not just branding, etc.,), as well as formal linkages to sales because being accountable is risky. Think MQL - which was an invention of the major CRM developer, but which is a nonsense concept. Third, everyone is being victimized, to a degree, by the platforms that control access to the market. There are agencies out there that can do what you're looking for, and maybe this perspective will help you find one.",
          "score": 3,
          "created_utc": "2026-02-04 14:12:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3kuxra",
              "author": "adriandahlin",
              "text": "great point about accountability -- look for agencies/consultants that talk about how you can measure their success and hold them accountable without you even asking",
              "score": 1,
              "created_utc": "2026-02-04 18:54:39",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3icwq6",
          "author": "Impressive-Amount255",
          "text": "I totally get the frustration, and you are absolutely right. It’s kind of difficult to trust one agency to handle your branding efforts and another agency to handle your demand gen or lead gen efforts. These three elements should flow naturally, and not having one agency manage the entire thing is the best way to make sure the experience is broken, not to mention that you’re probably going to pay more than you should.\n\nThat being said, why this happens actually makes sense. There are a couple of reasons. First, it’s not the same skill set. Some of the agencies you’re describing are very creative. They hire the right talent to make your brand stand out, create a message that resonates, define your identity, and distribute it so this identity is visible to everyone.\n\nThe other type of agency you’re describing hires teams laser-focused on optimizing and generating business.\nAnother element is that most agencies really want clarity on your goals. When your goal is “do everything,” agencies often anticipate trouble. You might end up saying, “Yes, but I expected more leads,” and they are forced to shift focus from awareness to lead gen. Or you might say, “My brand isn’t as visible as I wanted,” and they pivot back to awareness, reducing leads. Basically, agencies are used to clients being unclear about what they want, and trying to do too much in one shot ends up causing constant changes in direction until things break, or worse, until the agency gets fired.\nThat may explain what you’re seeing. That being said, I’m totally with you. I’m a huge believer that campaigns should be properly integrated: start with awareness and go all the way down to lead gen.\n\nMy recommendation would be to first work with an agency to define your brand: what it should look like, what you stand for, and what your values are. Once that’s clear, work with a dimensional agency to build truly integrated campaigns that cover the entire customer journey, properly integrating all channels, not just making branding consistent, but ensuring the right message reaches the right audience with a perfect flow, so no customer is mishandled.\n\nOnce you have this in place, you can have the same agency manage distribution for your brand awareness elements. This part is actually easy. Be explicit with them: the goal of this brand awareness campaign is purely impressions and visibility for the right audience. You’re not trying to generate leads from this campaign; other campaigns will handle lead gen.\n\nIf you have the resources, it’s even better to do this in-house. If you lack experience, there are plenty of frameworks available. If you type “integrated campaign framework” into Google, you’ll find many that are easy to use. My favorite one is the RIO framework, but there are many others.\n\nIf you rely on an agency, make sure they integrate everything properly and don’t go rogue: building a patchwork of random activities that may generate some short-term leads but will be a disaster to manage in the long run.",
          "score": 5,
          "created_utc": "2026-02-04 10:53:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3jh497",
          "author": "THESNUNK",
          "text": "You’re not missing anything,  a lot of agencies separate brand and demand because they’re built to do one or the other. In practice, brand is what makes demand gen and paid ads work better, not something separate from it. I’ve seen B2B teams like Ready Artwork handle this in a more balanced way by making sure the messaging, design, and paid ads all support lead generation and revenue. Those kinds of agencies usually feel more practical than ones that force you to pick a single lane.",
          "score": 2,
          "created_utc": "2026-02-04 15:05:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ij8ku",
          "author": "Mass_Metric",
          "text": "This comes up a lot at the Series B stage.\n\nIt’s usually not that agencies *can’t* do both. It’s that most of them were built with one core DNA, and that bias shows up in how they operate.\n\nBrand-led agencies tend to come from creative or comms backgrounds, so they think in terms of storytelling, positioning, and visibility. Demand-led agencies usually come from performance marketing or RevOps, so everything gets reduced to leads, CPL, and pipeline math.\n\nBoth are optimizing for what they know how to measure.\n\nThe problem is structural. Brand teams get judged on perception. Demand teams get judged on revenue. So agencies mirror that split and pick a lane.\n\nBut for a $20M ARR SaaS company, those two can’t really be separated anymore.\n\nBrand creates trust and familiarity, which lowers CAC and improves conversion.  \nDemand captures that trust and turns it into pipeline.\n\nIf you only run brand, you look great but struggle to prove ROI.  \nIf you only run demand, you burn budget chasing cold buyers forever.\n\nThe companies that scale well usually treat brand as demand infrastructure, not a separate function. Things like category POV, strong messaging, customer proof, and thought leadership directly improve ad performance, outbound response rates, and sales conversations.\n\nSo it’s less “brand vs demand” and more “brand feeding demand.”\n\nYou’re not looking in the wrong places. It’s just that many agencies are specialized silos. You probably want a team that thinks in terms of full-funnel or revenue marketing rather than either creative or performance alone.",
          "score": 1,
          "created_utc": "2026-02-04 11:46:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ikoap",
          "author": "aashrun",
          "text": "whats the struggle tho, meeting ceo n cro expectations?",
          "score": 1,
          "created_utc": "2026-02-04 11:57:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3izjh4",
          "author": "another_sleeve",
          "text": "because SaaS marketing is ass-backwards. in the real world an agency would do both, in SaaS land these are treated as seperate disciplines.\n\nfwiw just figure out how you want to split the budget between brand and demand and roll with that, but keep in mind that brand needs continous investment and it will affect how well the demand agency performs",
          "score": 1,
          "created_utc": "2026-02-04 13:33:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3o7of8",
              "author": "davmav71",
              "text": "brand isn’t optional overhead, it’s the thing that makes demand gen cheaper and actually work. Splitting budget is fine, but treating brand as a one-off instead of a continuous input is where teams shoot themselves in the foot.",
              "score": 1,
              "created_utc": "2026-02-05 06:02:13",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3opnio",
                  "author": "another_sleeve",
                  "text": "I'm not the one who needs convincing, it's the CFOs who treat brand like arts n crafts",
                  "score": 1,
                  "created_utc": "2026-02-05 08:44:27",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3izoqe",
          "author": "Responsible-Brick881",
          "text": "I can do both and likely something a bit different from what you've had put in front of you by everyone else....would be delighted to chat more and bring a new perspective!",
          "score": 1,
          "created_utc": "2026-02-04 13:34:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3j8v9j",
          "author": "appu49",
          "text": "There are very few agencies who are working in Brand to Revenue strategy.\nMy agency (where I work) is one of them, I wont brag about my agency name in the comment section but feel free to DM me if you have any questions or would like to know more about the Brand to Revenue model.\nAnd we have been doing this for more than 2 years.",
          "score": 1,
          "created_utc": "2026-02-04 14:23:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3jtupw",
          "author": "seanrrwilkins",
          "text": "The bifurcation is due to the completely  different skill sets and team needs. \n\nAlso, most clients, especially in your growth phase, aren’t looking for or able to pay for both at the same time. \n\nThat said, managing your leadership needs is never easy. \n\nAre you looking for one agency because you’re not familiar with partnering with agencies and one sounds better than two? \n\nIf you had to prioritize, brand or pipeline, for the next 12 months, what makes the most sense to support your business goals and growth story?",
          "score": 1,
          "created_utc": "2026-02-04 16:05:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3jym7l",
          "author": "agonsenhauser",
          "text": "The split exists because many agencies treat brand as \"vibes\" and demand as \"math,\" but they are actually part of the same infrastructure. Brand reputation is essentially the \"demand infrastructure\" that ensures you are on the shortlist of 4 or 5 vendors a buyer already has in mind before they ever engage. If you only focus on the capture side, you are fighting a losing battle against the 77 percent of buyers who have already formed a preference before they even start an active search. Find an agency that understands and appreciated both!",
          "score": 1,
          "created_utc": "2026-02-04 16:27:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3kgru5",
          "author": "datagirl2318",
          "text": "this actually frustrates me to read because in my mind, brand and demand are almost synonmous (obvi they're different..) but one does not exist without the other!!!!\n\nyou could have the best demand gen strategy in the world, have the most seasoned marketers, have the most clean workflows...but if nobody knows who you are, knows where you stand against competitors, or knows your value prop, good luck. there is no 'demand' without brand.\n\ni think the problem with these agencies is finding good talent that actually know how both work across the entire marketing funnel. unfortunately people in agency are severely underpaid and it's a lucrative business - this is my hunch as to why these agencies treat them seperate and as a result, there are siloes. \n\ni wish things were different. i'd be curious to know of an agency that does both these things exceptionally well, but i also have never seen one :( good luck on your search!",
          "score": 1,
          "created_utc": "2026-02-04 17:50:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3knw8e",
          "author": "ThatGuytoDeny165",
          "text": "We tell people brand 2 demand. We do both but it a very prescriptive approach. Quickly analyze brand and see what’s there and what works. Make minor adjustments as needed then get it into the world and start leveraging for demand. \n\nThe key is to constantly be looking at data and adjusting. A lot of times people spend way too much time in pursuit of perfection but until you get into the market you really don’t know how it’ll respond.",
          "score": 1,
          "created_utc": "2026-02-04 18:23:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3l07a9",
          "author": "ConfusionDull2183",
          "text": "Mostly in comes from B2B client demand - they are underspending on brand and over spending on performance. Agencies follow this demand. \n\nThe big B2B agencies do both - some well.",
          "score": 1,
          "created_utc": "2026-02-04 19:18:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3l2eui",
          "author": "kalol_",
          "text": "Doing both requires specialized skills and years and years of experience. Most agencies offering demand gen will only do ads, or cold emails. Not to mention an agency doing both will charge just as much. Branding requires experience that doesn't necessarily overlaps with experience needed for Demand gen.  \n\nI just started my agency last year but I have worked in b2b marketing space for 11 years now, doing both branding and demand gen. I am growing things slowly but in the end, you have to pitch these services separately (as people looking for both branding and lead gen are scarce or don't have the budget) and hence most agencies ends up picking a side that gives them most clients.",
          "score": 1,
          "created_utc": "2026-02-04 19:28:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3l2pqr",
          "author": "Euphoric-View-9876",
          "text": "They get separated because agencies optimize for what they can be measured and blamed for. Brand without pipeline feels safe, pipeline without brand feels accountable. The teams that actually connect the two usually dont sell it as brand + demand, they start from buyer reality and let both emerge from the same audience and message.",
          "score": 1,
          "created_utc": "2026-02-04 19:30:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3ogllg",
              "author": "Thin-Opportunity8732",
              "text": "What gets lost in that model is when buyers actually form preferences, which usually happens long before anything is measurable in a dashboard. Teams that anchor on buyer attention earlier dont have to force a brand vs demand tradeoff later.",
              "score": 2,
              "created_utc": "2026-02-05 07:19:23",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3qrbuk",
                  "author": "Euphoric-View-9876",
                  "text": "Exactly. By the time something shows up as demand, the decision has usually been narrowed to a short list already. Thats why agencies end up arguing about brand versus pipeline instead of focusing on where attention forms in the first place.",
                  "score": 1,
                  "created_utc": "2026-02-05 16:43:05",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3m9hd2",
          "author": "chaliques",
          "text": "As a agency that does both I'll explain. \n\nFor context been running my Revenue Markering agency for 5 years. Started off as a Demand Gen agency. We're doing about $5m+\n\n**Not trying to sell.**\n\nSo we literally only focus on brand once leadership signs off. Because as an agency, we can only touch things that show direct attribution to revenue growth. \n\nOtherwise it may look like we're underperforming if leadership isn't aligned with the goals.",
          "score": 1,
          "created_utc": "2026-02-04 22:57:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3mje34",
          "author": "therevenueramp",
          "text": "It’s the binary thinking of outsourcing must mean traditional b2b agencies who by design specialize in solving a problem. There are full end to end managed services, marketing-as-service firms that don’t force the choice between brand and demand. IT, Finance, HR all mastered different forms of outsourcing yet marketing thinks in house marketers OR traditional b2b agencies.",
          "score": 1,
          "created_utc": "2026-02-04 23:51:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3mpl4p",
          "author": "Strong_Teaching8548",
          "text": "most agencies specialize because they're built around one motion, brand folks are designers and strategists, demand folks are performance marketers. they're different skill sets and incentive structures\n\nbut here's what i've noticed building something in the adjacent space: the agencies that do both well usually have one person who bridges it. someone who understands that brand work actually impacts demand gen (better positioning = easier selling) and vice versa (demand work reveals what resonates)\n\nat your stage with mid-market, you probably need both but sequenced right, nail positioning first, then let demand gen leverage it. most agencies just don't have that person who thinks holistically about it :/",
          "score": 1,
          "created_utc": "2026-02-05 00:26:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3o7ion",
          "author": "davmav71",
          "text": "brand and demand only get split because agencies are built and measured around one motion. The good ones tie both to revenue, they’re just harder to find and don’t usually market it that way.",
          "score": 1,
          "created_utc": "2026-02-05 06:00:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3of0m8",
          "author": "Overall-Fondant-882",
          "text": "This split usually exists because agencies organize around services, not buyer behavior. From the buyer side, brand is what gets you onto the shortlist and demand is what captures intent once you’re already there. Teams that start from audience attention instead of tactics tend to blur that line naturally.",
          "score": 1,
          "created_utc": "2026-02-05 07:05:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3oilu8",
          "author": "Sourabh_Apage",
          "text": "Primary reason I see this from the performance side is that brand doesn’t show up immediately in attribution while demand gen does. Agencies end up optimizing for what they can defend in monthly reviews. Working with two separate agencies isn’t really the issue as long as someone in-house or a consultant is actually tying branding work to demand execution so they don’t operate in silos. Clear KPIs for both sides matter otherwise it’s hard to tell whether brand is helping demand or just drifting.",
          "score": 1,
          "created_utc": "2026-02-05 07:37:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3t0jjv",
          "author": "B2BScaler",
          "text": "My agency is literally developing tech to address this as we speak and has working demo models in play to address all channel issues with corresponding suggested fixes or additions (if absent from tech stack/advertising/marketing approach present).\n\nAgencies pigeon hole themselves often tricking themselves that channel or tool specialization means an edge over a competitor, while making the error of disregarding a tailored, all in one but not overly convoluted solution. \n\nThe perception you CAN'T do both is a limiting belief out of fear generated by infatuation with a strong suit channel or approach.\n\nFull stack, well rounded agencies that can execute at scale whether it be through internal headcount and skill sets, external teams and solid flows, white label, outsource/offshore, you name it - they all require a legit, top down view of approach on channels before sending a final proposal and promising an end result. \n\nIf you want me to give an example of what sort of proposal structure I use that I believe has an edge you can also message me if that sort of solution seems elusive to you.",
          "score": 1,
          "created_utc": "2026-02-05 23:10:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3tnmx8",
          "author": "lichoudini",
          "text": "2 different kinds of people, two different kinds of teams. So more expenses. More difficulties to optimize.",
          "score": 1,
          "created_utc": "2026-02-06 01:22:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o40bvoi",
          "author": "Interesting-Wheel350",
          "text": "This is an interesting read as I’m building a brand authority growth agency to align both the executive brand building with the business brand build through founder-led marketing campaigns and PR. The aim is to use the executive profile raising and brand building to convert into opportunities for revenue growth and sales. I spent a decade working across agencies and only one actually translated their marketing into revenue all the others spent time aligning with vanity metrics that didn’t move the needle",
          "score": 1,
          "created_utc": "2026-02-07 01:44:04",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qusna3",
      "title": "Cold emails in Europe are a gift from heaven.",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qusna3/cold_emails_in_europe_are_a_gift_from_heaven/",
      "author": "colinbyprospectai",
      "created_utc": "2026-02-03 13:59:23",
      "score": 16,
      "num_comments": 40,
      "upvote_ratio": 0.7,
      "text": "I run a cold email agency for B2B outbound from Germany with international clients.\n\nI had many clients from the US, Canada, and Australia, all English-speaking, before specializing in Europe. Why? The strong home bias and the incredibly impressive results here.\n\nInstead of struggling for a 3% reply rate in English-speaking countries, we get 5-20% reply rates for our Dutch, Belgian, French, and German clients, and that's the norm. It's all about intent-based outreach with our personalized message framework that works.\n\nWe get 10-30 meetings here with B2B decision makers. I love it and never want to go back.\n\nIf you're in Europe or want to expand, lmk!",
      "is_original_content": false,
      "link_flair_text": "Support",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qusna3/cold_emails_in_europe_are_a_gift_from_heaven/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o3cc4cn",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-03 13:59:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ckzpx",
          "author": "Ok_Attention8694",
          "text": "How are you dealing with GDPR issues - especially in Germany, which is an opt-in jurisdiction?",
          "score": 16,
          "created_utc": "2026-02-03 14:46:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3dkedz",
              "author": "Any-Editor8768",
              "text": " I would also like to know that. Cold mails are forbidden in Germany and you can get fined for it. My assumption is, that the ROI is still worth the risk for some business.",
              "score": 3,
              "created_utc": "2026-02-03 17:34:33",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3fqg3a",
                  "author": "Full-Competition-762",
                  "text": "this. we’re building a startup and I receive cold emails 2-3x a week. we could report them, but we don’t care since I think that that rule is nonsense. \n\nOP is just trying to promote their agency so while the topic is interesting, the post is bs",
                  "score": 4,
                  "created_utc": "2026-02-03 23:45:22",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3cs3ki",
          "author": "h_2575",
          "text": "How do you get consent? I mean uwg §7.2 is pretty clear.  If people don't expect your message or e-mail you cannot assume consent. This is considered unfair competition in most of Europe. Besides this, gdpr requires consent as well if you use personal E-Mails addresses. Same holds for cold phone calls or any other electronic way to get in touch.",
          "score": 9,
          "created_utc": "2026-02-03 15:22:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3d77ar",
              "author": "xxtoni",
              "text": "I thought for B2B if it is a business email and you have legitimate interest it was fair game",
              "score": 1,
              "created_utc": "2026-02-03 16:33:31",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3djwnx",
                  "author": "Any-Editor8768",
                  "text": "According to lawsuits selling sth. to a business does not count as a legitimate interest to use their mail address. Its only allowed over phone calls. Companies that still do this risk cease-and-desist letters high fines.",
                  "score": 3,
                  "created_utc": "2026-02-03 17:32:14",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o3vezhz",
                  "author": "AtomicMacaroon",
                  "text": "We recently cold-emailed a business, asking for a meeting at an upcoming trade show we were both attending to discuss if our services would perhaps be a good fit for them. Got a cease-and-desist letter from their lawyer asking for 500 Euros and a promise to never send them unsolicited marketing emails again. We could have fought this in court, but that would have cost as much as settling, so we just paid the fine and moved on.",
                  "score": 3,
                  "created_utc": "2026-02-06 09:05:51",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3ccdvt",
          "author": "EffectiveLet2117",
          "text": "Are you selling a service or a product?",
          "score": 4,
          "created_utc": "2026-02-03 14:00:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3cczq8",
              "author": "colinbyprospectai",
              "text": "God hoped this post was clear enough 😂 we are a agency, it's a dfy service.",
              "score": -1,
              "created_utc": "2026-02-03 14:04:10",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3cd69y",
                  "author": "EffectiveLet2117",
                  "text": "Yes but what kind of clients do you service \n\n They are 2 different worlds",
                  "score": 1,
                  "created_utc": "2026-02-03 14:05:09",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3ceh64",
          "author": "Imaginary-Fuel-7804",
          "text": "saw the same but my agency is in the us",
          "score": 2,
          "created_utc": "2026-02-03 14:12:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3j0l74",
          "author": "AioliPublic3177",
          "text": "That matches what I’ve seen too. Europe still feels *way less saturated* compared to US/Canada, and buyers there actually read emails if the message is relevant and localized. Language + cultural context seems to act like a natural filter against spammy outreach.",
          "score": 2,
          "created_utc": "2026-02-04 13:39:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3j73zv",
              "author": "colinbyprospectai",
              "text": "100%!",
              "score": 1,
              "created_utc": "2026-02-04 14:14:22",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3w0bop",
          "author": "Live-Conference-1718",
          "text": "Seems like OP doesn't want to answer questions on how he's getting around the legal challenges...",
          "score": 2,
          "created_utc": "2026-02-06 12:12:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3czpr2",
          "author": "ConfusionDull2183",
          "text": "Email them in native language, then flip them to English?",
          "score": 1,
          "created_utc": "2026-02-03 15:58:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3d1jzh",
              "author": "colinbyprospectai",
              "text": "We email them on behalf of our clients that are in the specific language.",
              "score": 1,
              "created_utc": "2026-02-03 16:07:12",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3dv3a9",
                  "author": "ConfusionDull2183",
                  "text": "Are they then moving to English or keeping it in mother tongue?  Thanks",
                  "score": 1,
                  "created_utc": "2026-02-03 18:22:45",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3hkoom",
          "author": "SendPotionDotCom",
          "text": "I wonder what the reason behind this is",
          "score": 1,
          "created_utc": "2026-02-04 06:35:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3htdd0",
          "author": "More-Car9727",
          "text": "Cold outreach in native languages are always better",
          "score": 1,
          "created_utc": "2026-02-04 07:51:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3hwik8",
          "author": "Mobile-Ambition-3714",
          "text": "Cold outreach in Europe can be surprisingly fruitful if you get the personalization right and respect the local culture but it does mean staying sharp about legal boundaries since the rules are a bit stricter. Those reply rates make sense when you tap into that home market trust and actually talk like a real person instead of sounding like a bot. The trick is keeping it relevant and not just spraying out templated pitches which people are just numb to. Always worth double-checking your process for compliance so the good results don’t come back to bite you.",
          "score": 1,
          "created_utc": "2026-02-04 08:20:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3hysgj",
          "author": "After-Park-2477",
          "text": "Bullshit 😂",
          "score": 1,
          "created_utc": "2026-02-04 08:42:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ll9vm",
          "author": "Ambitious_Escape8867",
          "text": "Talk to me",
          "score": 1,
          "created_utc": "2026-02-04 20:58:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3ormni",
              "author": "colinbyprospectai",
              "text": "Shoot a dm if interested brother",
              "score": 1,
              "created_utc": "2026-02-05 09:03:32",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3tfefi",
                  "author": "Ambitious_Escape8867",
                  "text": "you shoot a dm if you are interested brother",
                  "score": 1,
                  "created_utc": "2026-02-06 00:33:53",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3vyahx",
          "author": "No-Remote1647",
          "text": "English speaking markets are way more saturated. Many EMEA markets are still a complete playground",
          "score": 1,
          "created_utc": "2026-02-06 11:57:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3cwe9n",
          "author": "grafikolabs",
          "text": "We run a Creative Studio in india and would love to connect with Eu businesses.",
          "score": 1,
          "created_utc": "2026-02-03 15:42:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3d1a3e",
              "author": "colinbyprospectai",
              "text": "If you have budget for a german based agency lets talk 😃",
              "score": 1,
              "created_utc": "2026-02-03 16:05:53",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3iig0l",
                  "author": "grafikolabs",
                  "text": "Sure we can discuss.",
                  "score": 1,
                  "created_utc": "2026-02-04 11:40:40",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3chk0y",
          "author": "Leather-Warthog-8076",
          "text": "We have a B2B startup focused on services such as email marketing, cold calling, demand generation and cold lead generation. We have one of our decision makers in the Europe but are major workflow comes from our team in India. Please DM me if we can be of any help.",
          "score": -1,
          "created_utc": "2026-02-03 14:28:43",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qwmset",
      "title": "anyone tried ai social listening tools for campaign tracking?",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qwmset/anyone_tried_ai_social_listening_tools_for/",
      "author": "Sorry_Team_3451",
      "created_utc": "2026-02-05 14:31:14",
      "score": 13,
      "num_comments": 34,
      "upvote_ratio": 0.93,
      "text": "i’m running a campaign next month and trying to avoid repeating a mistake from our last one.\n\nwe used pretty basic monitoring before, and by the time we caught sentiment turning negative, it was already too late to fix the messaging. this time, i’m looking for AI-powered social listening that can surface issues in hours, not days.\n\nwhat i actually need from a tool:\n\n* real-time sentiment (not daily summaries)\n* spike detection when something starts taking off\n* share of voice vs 3 main competitors\n* geographic breakdown across 5 markets\n* context-aware insights, not just keyword matching\n\ni keep hearing mixed things about Meltwater, especially around Mira that does automated insights but i haven't tried it.\n\ni’ve also looked at Brandwatch, Sprinklr, and cheaper options like Brand24 and Buzzsumo, but Meltwater seems to come up the most when people talk about “enterprise-grade” listening.\n\nfor those who’ve actually used Meltwater during an active campaign:\n\n* did it help you catch issues early, or was it still reactive?\n* where does it work really well, and where does it fall short?\n* how does it compare to Brandwatch or Sprinklr when things start moving fast?\n* what Meltwater metrics or insights have your leadership actually cared about?\n\nbudget isn’t unlimited, but we can justify spend if it genuinely helps teams react faster and avoid missed opportunities like last quarter.\n\ncurious to hear real experiences especially from people who’ve used Meltwater in the wild.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qwmset/anyone_tried_ai_social_listening_tools_for/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o3pzxbm",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-05 14:31:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3y6cok",
          "author": "daviswbaer",
          "text": "this looks an awful lot like astroturfing by the Meltwater team...\n\nThe odds that 2 separate human people say exactly \"used Meltwater during live campaigns\" is basically 0...\n\nIf anyoen needs a social listening tool from a real human team, I'm the founder of a social media management tool\n\nOur social listening feature supports Reddit, YouTube, X, and Bluesky (plus more to come)",
          "score": 3,
          "created_utc": "2026-02-06 18:51:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3q0q0g",
          "author": "flamefreeze_YT",
          "text": "I’ve used Meltwater during live campaigns and it helped more by giving early heads-ups than perfect insights. When you catch spikes and sentiment shifts fast enough you can just prevent it from snowballing uk? It’s not magic and still needs human judgment, but compared to basic monitoring it felt way less reactive, especially when things started moving quickly across channels.",
          "score": 2,
          "created_utc": "2026-02-05 14:35:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3q10ek",
              "author": "Sorry_Team_3451",
              "text": "alright definitely gonna try meltwater!",
              "score": 1,
              "created_utc": "2026-02-05 14:36:58",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3q1b1e",
                  "author": "flamefreeze_YT",
                  "text": "You should tbh...it's worked for me... definitely worth a try",
                  "score": 2,
                  "created_utc": "2026-02-05 14:38:30",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3q0vww",
          "author": "vermaharsh321",
          "text": "We’ve used Meltwater during live campaigns and it did help catch sentiment shifts early — especially with spike alerts and share of voice. Mira’s insights aren’t perfect, but they’re good enough to flag issues fast so a human can dig in. Definitely more proactive than basic monitoring.",
          "score": 2,
          "created_utc": "2026-02-05 14:36:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3q2sks",
              "author": "Sorry_Team_3451",
              "text": "okay I got it will give it a try!",
              "score": 1,
              "created_utc": "2026-02-05 14:46:13",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3q7k3f",
          "author": "ActuaryTall2681",
          "text": "Meltwater, Sprinklr and YouScan are very nice to keep track of topics and alert you when it starts increasing. What you need for proactive situations is to use the right methodology when creating the queries and the correct framework, and it helps if the tool alerts you when you reach a certain threshold (being impressions, interactions, volume of mentions, or sensibilty). But from my PoV, the key is to create correctly those parameters for the alerts, so you dont need to be checking a dashboard or jumping when it's too late. There are specific courses that can teach you that.",
          "score": 2,
          "created_utc": "2026-02-05 15:10:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3qd7cu",
              "author": "Sorry_Team_3451",
              "text": "but most of the people are recommending meltwater. I'll probably go for that.",
              "score": 1,
              "created_utc": "2026-02-05 15:37:56",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3q9not",
          "author": "CommunicationRare603",
          "text": "Meltwater's real-time alerts have been a game changer for us. We link social sentiment with media coverage so nothing slips through the cracks between different data sources.",
          "score": 2,
          "created_utc": "2026-02-05 15:21:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3qdhys",
              "author": "Sorry_Team_3451",
              "text": "gotcha! I'll give it a try",
              "score": 2,
              "created_utc": "2026-02-05 15:39:19",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3q1kz8",
          "author": "rainbow_dude98",
          "text": "That's a very cool observation. Have you tried any other tool other than these?",
          "score": 1,
          "created_utc": "2026-02-05 14:39:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3q37vv",
              "author": "Sorry_Team_3451",
              "text": "I think it will work for me I will try it for sure",
              "score": 1,
              "created_utc": "2026-02-05 14:48:26",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3q1l1r",
          "author": "yj292",
          "text": "used meltwater for a launch last year... caught sentiment shift 4-6 hours before we would've noticed manually\n\nspike detection solid if you configure thresholds right...\n\nmira good for exec summaries but context still shallow on nuanced criticism",
          "score": 1,
          "created_utc": "2026-02-05 14:39:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3q3uzn",
              "author": "Sorry_Team_3451",
              "text": "got a lot of positive responses on meltwater and mira. will definitely use it!",
              "score": 1,
              "created_utc": "2026-02-05 14:51:44",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3q2ti4",
          "author": "manithedetective",
          "text": "Yeah i've been using meltwater for a few months now, the real-time sentiment is solid, way better than waiting for daily rollups. We caught a product complaint thread picking up steam on reddit around hour 3 instead of finding out the next morning. Spike detection works but you gotta tune the thresholds or you'll get false alarms on random stuff, share of voice tracking is straightforward, does what it says.",
          "score": 1,
          "created_utc": "2026-02-05 14:46:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3q4ml7",
              "author": "Sorry_Team_3451",
              "text": "good to hear that information I think meltwater will work for me.",
              "score": 1,
              "created_utc": "2026-02-05 14:55:40",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3q4wla",
          "author": "Developer_Akash",
          "text": "yeah the real issue with most of those tools is they're built for brand tracking, not campaign speed. you're gonna need something that actually flags intent shifts and sentiment spikes in real-time across platforms, not just keyword volume. CatchIntent does exactly that - AI-powered detection across Reddit, Twitter, LinkedIn and catches problems hours before they blow up. happy to show you how it compares to Meltwater for your timeline if you wanna try it out.",
          "score": 1,
          "created_utc": "2026-02-05 14:57:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3qc690",
              "author": "Sorry_Team_3451",
              "text": "I'll keep this in mind let's see what works for me.",
              "score": 1,
              "created_utc": "2026-02-05 15:33:09",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3q8ynd",
          "author": "DudeWaitWut",
          "text": "What social platforms are most important for you to monitor?",
          "score": 1,
          "created_utc": "2026-02-05 15:17:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3qdeu6",
              "author": "Sorry_Team_3451",
              "text": "social listening majorly",
              "score": 1,
              "created_utc": "2026-02-05 15:38:55",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3s1wc0",
                  "author": "DudeWaitWut",
                  "text": "I meant like Reddit, Twitter, Facebook, etc. Is there a specific one(s) that is most important? There are some good dedicated platforms depending on what you're looking for. \n\nThreadlytics is good if you need Reddit monitoring, Share of Voice, competitive insights, contextual-keyword filtering, per keyword sentiment, etc. But it's Reddit only.\n\nMeltwater is going to be really expensive. Think tens of thousands per year, with annual commitments. \n\nSprout Social is okay. It does have social listening. Though the listening features are a bit basic compared to other platforms. Sprout's social listening feels like it's geared more for crisis or brand reputation monitoring rather than proactive social marketing. It's missing some of the more complex features like advanced contextual filtering, keyword-specific sentiment, etc.",
                  "score": 1,
                  "created_utc": "2026-02-05 20:19:13",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3qh5cg",
          "author": "Anurag6162",
          "text": "Oof, that too late to fix feeling is the worst I used one of the beefier platforms for a campaign last year, and the spike alerts and geo maps were legit so helpful Leadership loved the simple competitor dashboards pretty graphs always win budgets But a heads-up you still gotta check it regularly The AI can flag something fast, but you need a human to decide if it’s real trouble or just noise If your team can glance at it a few times a day, it’s an absolute game-changer for reacting in those first few hours",
          "score": 1,
          "created_utc": "2026-02-05 15:56:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3qjguv",
              "author": "Sorry_Team_3451",
              "text": "okay I get what you're saying I'll keep this in my mind next time.",
              "score": 1,
              "created_utc": "2026-02-05 16:06:50",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3vbovo",
          "author": "Drumroll-PH",
          "text": "I’ve used Meltwater and it’s solid for broad monitoring, but it’s not truly real time when things move fast it still feels slightly reactive. Brandwatch is better for live sentiment shifts and spike detection, especially during active campaigns, while Sprinklr shines if you need workflow and response coordination across teams. Leadership usually only cares about trend direction, spike alerts, and share of voice not the fancy AI summaries. If speed is the priority, Brandwatch first, Meltwater second.",
          "score": 1,
          "created_utc": "2026-02-06 08:34:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3wihlx",
              "author": "Sorry_Team_3451",
              "text": "thank you for assisting I'll try meltwater for sure",
              "score": 1,
              "created_utc": "2026-02-06 14:01:39",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3xq986",
          "author": "Abhi_deep",
          "text": "Real-time alerts and spike detection are definitely stronger on the more advanced platforms but you still need to babysit the setup if you want issues surfaced in real-world speed. Most of these tools push out a ton of data and it’s easy to drown in it if your alert rules and keyword groups aren’t tight. As for metrics, leadership tends to care about share of voice and sentiment graphs especially when compared to competitors so those dashboards get the most eyeballs. Honestly nothing is truly set-and-forget but with some tuning these tools can give you a fighting shot at spotting trouble before it’s all over social.",
          "score": 1,
          "created_utc": "2026-02-06 17:35:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3q6job",
          "author": "Loud-Commercial-3386",
          "text": "I built a small thing called GoAlche for myself for this. It watches reddit conversations and helps catch issues, competitor mentions, and when people are clearly looking to buy. it’s been handy, at least for me",
          "score": 0,
          "created_utc": "2026-02-05 15:05:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3qc9t3",
              "author": "Sorry_Team_3451",
              "text": "omg okay I got it.",
              "score": 1,
              "created_utc": "2026-02-05 15:33:36",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qsrj3n",
      "title": "Why I stopped scaling outreach volume and started filtering for inactive contacts, our reply rates went from 0.4% to 6% (B2B lead gen breakdown)",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qsrj3n/why_i_stopped_scaling_outreach_volume_and_started/",
      "author": "ScheduleNo5736",
      "created_utc": "2026-02-01 07:05:57",
      "score": 10,
      "num_comments": 11,
      "upvote_ratio": 0.91,
      "text": "Look, I need to vent about something that nearly killed our outbound program last year. Everyone in B2B keeps saying it's a numbers game and just scale your lists. I bought into that completely and it almost got our entire domain infrastructure blacklisted.\n\nWe were working with the usual suspects for data. Apollo, ZoomInfo, the works. Paying premium rates for those verified badges next to every contact. Our dashboards looked immaculate. Bounce rates under 2%, deliverability scores in the high 90s, everything tracking green. We scaled up to about 18,000 to 20,000 touchpoints monthly across our sequences. I was genuinely expecting our pipeline to finally match the effort we were putting in.\n\nInstead we flatlined at a 0.4% reply rate. And most of those replies were variants of unsubscribe or how did you get my info. Our AE team was getting maybe two qualified conversations per week from thousands of sends. I spent entire evenings convinced it was a messaging problem. Rewrote subject lines, tested different value props, even brought in a contractor to rebuild our sequences from scratch. Nothing moved.\n\nThe wake up call came when I started manually checking who was actually opening our emails. Turns out a huge chunk of our verified contacts were people who'd left their companies four to six months ago, or whose email accounts were just auto forwarding to a black hole. The mailboxes existed so they passed the basic validation checks, but there was no human on the other end. We were burning sender reputation on what were essentially abandoned accounts.\n\nI finally admitted we needed to stop throwing volume at the problem and completely rethink our data hygiene approach. The issue wasn't our copy or our offer. It was that we were optimizing for the wrong metric. Deliverability doesn't mean anything if the recipient hasn't logged in since Q2 of last year.\n\nSo we shifted the entire workflow. Instead of just verifying that an email exists we started screening for actual activity signals. Things like mobile number status, recent job changes, social engagement patterns. We moved to a batch filtering process using TNTwuyou before any contacts even touched our CRM. The goal was to prioritize signal over scale.\n\nA few things became obvious pretty fast. First, phone number validation turned out to be a surprisingly strong proxy for active engagement. If someone's mobile line is dead or disconnected their email's probably not much better. Second, recency matters more than anything else. A contact that was valid three months ago is often worthless today in fast moving industries. Third, this approach adds friction to your workflow and your team will push back on smaller lists. You have to be willing to defend lower volume if it means higher quality.\n\nOnce we started filtering out the noise our effective reply rates climbed back up to the 5% to 7% range. We're running at maybe 20% of our previous monthly volume but our AEs are actually having real conversations again instead of just logging rejection after rejection. Using the TNTwuyou Data Filtering and Validation Tool as a pre outreach gate basically saved us from getting our domains torched.\n\nThat said, this level of filtering probably isn't worth the operational overhead if you're selling low ticket transactional stuff where volume really is the only lever. It makes sense for us because we're in high ticket enterprise sales where every bad touch costs us credibility we can't afford to lose.\n\nI'm curious if anyone else has completely abandoned the big database model lately. Or are we just in a particularly stale vertical where contact decay happens faster than usual.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qsrj3n/why_i_stopped_scaling_outreach_volume_and_started/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o2xklzf",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-01 07:05:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2xuj0y",
          "author": "stephan85",
          "text": "For high-ticket B2B, prioritizing contact activity over sheer volume is essential for maintaining sender reputation and achieving real engagement. Many teams find that \"verified\" contacts from standard databases often include individuals who have long left their roles, effectively sending emails into a void, much like you described.\n\nyou could establish a rigorous pre-outreach filtering process that looks for recent professional activity signals. like job changes or social engagement. Before any contact enters a sequence, which often yields significantly better reply rates.",
          "score": 3,
          "created_utc": "2026-02-01 08:36:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2xx17u",
          "author": "Scared_Yak5572",
          "text": "I went through this exact thing last year. We cranked lists to hit volume and watched reply quality tank while deliverability still looked fine on paper. The turning point for us was adding a quick activity check before contacts hit our sequences,  phone status, LinkedIn activity, and recent role changes. That cut our sends way down but doubled reply quality and saved our sending health.\n\nA tiny framework that helped: 1) small fresh list 2) activity filter 3) two warm touches (comment + connection) before cold mail 4) prioritize follow ups. curious how you balance the extra ops work with quota pressure? I run this daily loop inside Depost AI so prospects and follow ups don’t slip, but a simple checklist works too.",
          "score": 2,
          "created_utc": "2026-02-01 08:59:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2y1ra1",
              "author": "Middle_Currency_110",
              "text": "I like the idea of warm touches before a cold email - nice!",
              "score": 2,
              "created_utc": "2026-02-01 09:44:14",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2ztkho",
                  "author": "Scared_Yak5572",
                  "text": "Yup, spraying DMs, Emails will burn you out, few warm touches, warm discussion, more chance to close, in era of bots, still human touches needed :)",
                  "score": 2,
                  "created_utc": "2026-02-01 16:36:47",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2xyf8d",
          "author": "phoebeb_7",
          "text": "Yeah, a smaller, clean list always beats huge, stale databases. You get fewer sends but way higher quality replies and engagement.",
          "score": 2,
          "created_utc": "2026-02-01 09:12:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o329sam",
          "author": "NewsOdd7348",
          "text": "T⁠his i⁠s a⁠ f⁠antastic b⁠reakdown o⁠f w⁠hy v⁠olume a⁠lone i⁠s i⁠rrelevant. T⁠he b⁠iggest c⁠ulprit i⁠s n⁠ot s⁠tale d⁠ata, b⁠ut t⁠he 3⁠-6 m⁠onth l⁠ag t⁠ime i⁠n t⁠raditional d⁠atabases u⁠pdating j⁠ob c⁠hanges. T⁠hey p⁠ass v⁠alidation, b⁠ut t⁠he h⁠uman i⁠s g⁠one. T⁠he o⁠nly w⁠ay t⁠o b⁠eat t⁠his d⁠ecay i⁠s t⁠o s⁠hift f⁠rom c⁠leaning l⁠ists t⁠o m⁠onitoring t⁠hem l⁠ive.\n\nT⁠o s⁠olve t⁠his p⁠roactively, o⁠ur t⁠eams a⁠re m⁠oving b⁠eyond s⁠imple v⁠alidation c⁠hecks. T⁠hey i⁠mplemented a⁠ j⁠ob c⁠hange w⁠atchlist p⁠re g⁠ate. T⁠ools l⁠ike A⁠pollo a⁠nd Z⁠oomInfo a⁠re i⁠nputs, b⁠ut y⁠ou n⁠eed a⁠ l⁠ive s⁠ystem t⁠o c⁠heck t⁠heir s⁠tatus. W⁠e r⁠un t⁠his u⁠sing a⁠n n⁠8n w⁠orkflow: l⁠ist s⁠egmentation -> l⁠imadata w⁠atch A⁠PI (f⁠or r⁠eal t⁠ime j⁠ob c⁠hange w⁠ebhooks) -> C⁠RM. I⁠f t⁠he c⁠ontact h⁠as c⁠hanged r⁠oles i⁠n t⁠he l⁠ast 9⁠0 d⁠ays, t⁠hey g⁠et p⁠rioritized. I⁠f t⁠hey c⁠hanged r⁠oles 1⁠80+ d⁠ays a⁠go a⁠nd h⁠aven’t b⁠een u⁠pdated, t⁠hey g⁠et b⁠inned. I⁠t e⁠liminates t⁠he o⁠perational o⁠verhead o⁠f m⁠anually c⁠hecking t⁠hat c⁠rucial r⁠ecency s⁠ignal.",
          "score": 2,
          "created_utc": "2026-02-01 23:40:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2yh5ng",
          "author": "StunningStatement998",
          "text": "Switching from list scale to actual engagement signals was a game changer for us too. We struggled with low reply rates until we focused on filtering for recent activity and job changes. Partnering with Linkedist took this even further, after they redid our outreach with these filters our response rates jumped to 7% and we stopped wasting effort on dead leads. Total difference in AE morale and overall pipeline health.",
          "score": 1,
          "created_utc": "2026-02-01 12:01:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2z2ume",
          "author": "Admirable_Swim_7805",
          "text": "man ive been there, blasting 20k emails a month just to get crickets and watch your rep tank. switched a client to auto filtering their lists through activity signals like recent logins and mobile verifies before hitting send. cut volume by 70 percent but replies jumped to 8 percent because youre only emailing live humans. set it up with make pulling from hubspot, runs daily, no more dead contacts clogging sequences. game changer for keeping domains clean",
          "score": 1,
          "created_utc": "2026-02-01 14:25:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o33a0wh",
          "author": "jrpollock",
          "text": "Super useful information. Thank you!",
          "score": 1,
          "created_utc": "2026-02-02 03:04:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3q2ut0",
          "author": "New_Grape7181",
          "text": "I had a similar wake up call about 8 months ago when our domain reputation started tanking. We were chasing volume metrics that looked great on paper but meant nothing for actual pipeline.  \n  \nThe phone number validation insight is spot on. We started doing something similar but added LinkedIn activity as another layer. If someone hasn't posted, commented, or even changed their profile in 6+ months, they're probably not actively checking anything work related. Saved us from wasting touches on what were basically dormant accounts.  \n  \nOne thing that helped us beyond just filtering was timing our outreach around actual engagement signals. So instead of batch blasting a cleaned list, we'd wait for a LinkedIn post, company announcement, or funding news, then reach out within 48 hours while they're actually paying attention. Reply rates jumped even higher because we weren't just reaching active contacts, we were catching them at moments when they were already engaged.  \n  \nThe pushback from your team on smaller lists is real though. Took me weeks to convince our sales director that 500 highly qualified contacts beat 5,000 stale ones.  \n  \nWhat's your current approach for keeping the filtered lists fresh? Are you re validating on a schedule or just filtering once at the point of upload?",
          "score": 1,
          "created_utc": "2026-02-05 14:46:33",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qui34f",
      "title": "Surveying for the best b2b lead gen agency in 2026.",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qui34f/surveying_for_the_best_b2b_lead_gen_agency_in_2026/",
      "author": "smartladyphdy",
      "created_utc": "2026-02-03 04:19:32",
      "score": 10,
      "num_comments": 10,
      "upvote_ratio": 0.82,
      "text": " The landscape has changed so much with AI search and email restrictions. I’m curious who you think is the top-tier agency for generating high-intent B2B leads right now. We are looking for someone that uses intent data to find people who are in-market. If you’ve seen a significant pipeline boost from a specific vendor lately, I’d love to hear the details.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qui34f/surveying_for_the_best_b2b_lead_gen_agency_in_2026/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o3abprh",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-03 04:19:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3cmp92",
          "author": "Intrepid_Boss9449",
          "text": "If you want leads that are actually in-market, look for agencies that use real intent data from multiple sources not just email opens or clicks. Some B2B vendors are missing the mark by ignoring social signals. Tools like SocListener can help spot active prospects on Reddit by finding relevant posts and engaging them directly, which can boost pipeline in ways email alone won’t.",
          "score": 1,
          "created_utc": "2026-02-03 14:55:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ecqcj",
          "author": "erickrealz",
          "text": "Finding a solid cold email agency that actually uses intent data properly can make a huge difference in your pipeline. The key is vetting them on their approach to targeting, not just their copywriting or deliverability claims. Our clients who've worked with good agencies saw pipeline improvements because the agency focused on finding companies showing actual buying signals, not just blasting random lists.\n\nIntent data matters but most agencies use it wrong. They'll tell you someone visited a competitor's site or searched a keyword, but that doesn't mean they're ready to buy your specific solution. Look for agencies that layer multiple signals together like recent funding, hiring patterns, tech stack changes, plus intent data. That combination actually indicates in market behavior.\n\nAsk potential agencies for case studies in your industry and how they specifically use intent data in their targeting process. The good ones will walk you through their exact methodology instead of just promising results. Expect to pay a few thousand monthly minimum for quality work that includes proper infrastructure setup and ongoing optimization.",
          "score": 1,
          "created_utc": "2026-02-03 19:43:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3utd65",
          "author": "New_Grape7181",
          "text": "I've found that most agencies still rely on outdated tactics like cold email blasts, which are getting hammered by the new restrictions you mentioned.  \n  \nIf you're serious about intent data, look for agencies that can show you their specific data sources. Ask them whether they're using G2 intent, Bombora, 6sense, or just scraped LinkedIn activity. There's a massive difference in quality.  \n  \nWe shifted away from agencies entirely about 8 months ago and built our own motion around intent signals plus personalised video outreach. The issue with agencies is they're incentivised on volume, not quality. When we took it in-house, our SQL rate went up 3x because we could actually act on intent signals within 24 hours instead of waiting for weekly reports.  \n  \nThat said, if you must go with an agency, I'd suggest finding one that offers a hybrid model where your SDRs work alongside theirs. You get the intent data and targeting expertise without losing the speed and authenticity that comes from your own team.  \n  \nWhat's your internal capacity like for follow-up? That's usually the bottleneck I see when companies bring in lead gen agencies.",
          "score": 1,
          "created_utc": "2026-02-06 05:52:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3al2x5",
          "author": "Old-Environment8760",
          "text": "The problem is not with the agency, but with the channel. You can’t just randomly come to people on the “street” and try to sell something. Especially in B2B you have to build trust first. \n\nVisibility in AI search brings amazing leads. \n\nXQL Group are great for inbound lead gen and doing actual marketing that brings high quality leads.",
          "score": 0,
          "created_utc": "2026-02-03 05:25:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3atfkc",
          "author": "SchniederDanes",
          "text": "reach out to smartreach..they list their top lead gen agencies..you should get a good reference from there",
          "score": 0,
          "created_utc": "2026-02-03 06:33:19",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qul5cg",
      "title": "What usually breaks first when b2b companies scale?",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qul5cg/what_usually_breaks_first_when_b2b_companies_scale/",
      "author": "ExtremeAstronomer933",
      "created_utc": "2026-02-03 07:02:48",
      "score": 10,
      "num_comments": 7,
      "upvote_ratio": 1.0,
      "text": "We’re growing steadily and trying to anticipate common failure points before we hit them. Messaging, alignment, process, handoffs, everything feels fine for now, but I know something will crack eventually. For teams that have been through this, what usually breaks first?",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qul5cg/what_usually_breaks_first_when_b2b_companies_scale/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o3awtxv",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-03 07:02:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3p089h",
          "author": "No_Hold_9560",
          "text": "Alignment broke first for us. thewayhow helped fix that before it became a bigger problem.",
          "score": 2,
          "created_utc": "2026-02-05 10:26:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3zxpjt",
              "author": "ExtremeAstronomer933",
              "text": "Figures.Alignment usually slips slowly, not all at once, so it’s easy to miss until things start feeling harder than they should. Once teams aren’t aiming at the same thing, every handoff gets messier. Catching it early makes a huge difference.",
              "score": 1,
              "created_utc": "2026-02-07 00:19:09",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3cn3cw",
          "author": "Intrepid_Boss9449",
          "text": "Usually the first thing that breaks is the handoff between teams. When sales and marketing or product teams don’t sync up well, stuff gets lost or delayed.",
          "score": 1,
          "created_utc": "2026-02-03 14:57:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3zxj8q",
              "author": "ExtremeAstronomer933",
              "text": "That tracks. Things work when the team is small because context lives in people’s heads. As soon as you scale, that breaks down and handoffs need to be way more explicit or you start dropping balls fast.",
              "score": 1,
              "created_utc": "2026-02-07 00:18:08",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3wdrju",
          "author": "signalpath_mapper",
          "text": "Onboarding. You can handhold 5 clients, but at 50, that \"white glove\" service turns into a bottleneck that chokes your growth.",
          "score": 1,
          "created_utc": "2026-02-06 13:36:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3zxtlx",
              "author": "ExtremeAstronomer933",
              "text": "This one hits home. Onboarding usually works great when volume is low, then suddenly becomes the thing everyone’s waiting on. If it’s still built around heroics instead of a system, it turns into a growth ceiling really fast.",
              "score": 1,
              "created_utc": "2026-02-07 00:19:48",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qus7hb",
      "title": "B2B Business Owner looking for Marketing Advice",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qus7hb/b2b_business_owner_looking_for_marketing_advice/",
      "author": "arjunmurali1993",
      "created_utc": "2026-02-03 13:41:01",
      "score": 10,
      "num_comments": 13,
      "upvote_ratio": 1.0,
      "text": "A quick intro about my business. I run a garment manufacturing company in India and we have an excellent setup (stitching factory owned by my business partner). We already do a ton of corporate orders, orders for brands and so on within India through B2B platforms like Indiamart, Justdial and we also run some Google Ads within India to get leads. We have a good technical sales team who convert these leads to orders.\n\nAt the moment, our order size typically averages in the hundreds to a few thousand units. However, we have to confirm and execute about 10 to 15 orders each month just to cover our monthly overheads.\n\nI want to start targeting bigger customers like clothing brands from Europe, Australia, etc. to grow the order volume significantly.\n\nI'm sure the decision makers of these brands aren't actively searching for manufacturers in Google so Google Ads and SEO might not be the right channel for us.\n\nI've read quite a lot on how cold emails work starting from data gathering and enrichment through Clay or other data sources followed by sending using platforms like Instantly. I can personally try it out myself and learn and improve and go ahead but I'm not too keen on that. I would rather prefer paying an agency who know what they are doing.\n\nWill cold emails work for our scenario?  \nWhat are the things I should look for when hiring an agency to handle cold emails for our business?\n\nIf not, should I look at LinkedIn marketing or other channels?   \n  \nI know I have everything in my business primed for success, and proper marketing seems to be the last missing piece of the puzzle that I really want to crack.",
      "is_original_content": false,
      "link_flair_text": "Support",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qus7hb/b2b_business_owner_looking_for_marketing_advice/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o3c8sye",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-03 13:41:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3coe33",
          "author": "Intrepid_Boss9449",
          "text": "Cold emails can work but only if the agency really knows your niche and can get you good quality leads, not just spammy lists. When hiring, ask for proof of past success with B2B garment or fashion brands and how they handle follow-ups. \n\nLinkedIn might be better for targeting decision makers in Europe and Australia since it’s more professional and you can build relationships over time.",
          "score": 2,
          "created_utc": "2026-02-03 15:04:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3fxbdh",
          "author": "Responsible-Brick881",
          "text": "Have you tried any kind of advertising in the past?",
          "score": 1,
          "created_utc": "2026-02-04 00:23:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3glcgz",
          "author": "OkDependent6809",
          "text": "talk to your biggest customers first and ask how they found you and why they picked you\n\nthis will tell you way more than guessing at cold email or linkedin. international brands probably buy differently than domestic ones\n\nmost agencies will just spam generic emails. save your money until you understand how your target customers actually make buying decisions",
          "score": 1,
          "created_utc": "2026-02-04 02:37:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3hwurj",
          "author": "ObjectiveFerret9017",
          "text": "Cold outreach can get you in front of some European or Australian brand folks but response rates are pretty rough unless the messaging feels truly personal and you understand their pain points. If you’re hiring an agency I’d press them hard on how they source and qualify leads plus how they handle warm follow ups without coming off spammy. LinkedIn is usually better for opening a door and trading some real conversation before trying to close anything, especially in B2B apparel where relationships drive trust. Honestly if you have a strong visual story or case studies, sometimes just DMing or commenting thoughtfully on relevant posts can get you further than blasting a thousand cold emails.",
          "score": 1,
          "created_utc": "2026-02-04 08:23:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ng57j",
          "author": "whskme",
          "text": "I happened to come across this post and coincidentally we are exactly what we are looking for. We run a LinkedIn & Email Outbound Agency with a core expertise in GTM (creating a targeted list of companies who are likely to buy from you) \n\nShoot me a DM and let’s talk",
          "score": 1,
          "created_utc": "2026-02-05 02:56:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3odnlc",
          "author": "Crazy-Ask-3510",
          "text": "If you want serious buyers then go participate in trade shows in those countries \n\nThat’s the strategy  most apparel companies who export get their initial set of Clients\n\nP.s I run a business with exposure to US and UK clients partly",
          "score": 1,
          "created_utc": "2026-02-05 06:53:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3p7gnk",
          "author": "Desperate_Pop_1578",
          "text": "Oh man, so I’m *super* new to all this marketing stuff (I’m literally in the middle of launching my first integrated campaign, so take this with a grain of salt) but here’s what I’d probably do if I were you: skip the fancy campaign for now and just chase referrals. Like, is there *anyone* in your current customer base who could hook you up with a bigger player? Or maybe someone in your network who can make an intro? That first customer is always the hardest to land, but once you’ve got one, you can ride that word-of-mouth wave and use their success story to open doors with others.\n\nHonestly, at this stage, I’d lean more into a sales approach than a full-blown marketing one. Like, just get that first win however you can, and then you can build from there. It’s way easier to sell when you’ve got a happy customer singing your praises. Just my two cents, still figuring this out myself, so grain of salt and all that!",
          "score": 1,
          "created_utc": "2026-02-05 11:30:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3utr0l",
          "author": "New_Grape7181",
          "text": "I've worked with a few manufacturing businesses trying to crack international markets, and cold email can work but there's a catch with your specific situation.  \n  \nThe challenge is that clothing brands typically have existing manufacturer relationships and switching costs are high (quality control, minimum orders, logistics). Cold email works best when you're solving an active problem, but most brands aren't actively looking to change manufacturers unless something's gone wrong.  \n  \nWhat I've seen work better is a two-step approach. First, identify brands that are actually in buying mode like new sustainable fashion labels, brands expanding into new product lines, or companies posting jobs for production managers. These are real signals they might need new manufacturing partners.  \n  \nSecond, instead of just email, try sending a short personalised video showing your factory floor, quality control process, or a similar product you've made. It builds trust way faster than text when you're asking someone to trust you with their entire production. Brands need to see your capabilities, especially when you're overseas.  \n  \nLinkedIn could work too, but I'd focus on building relationships with production managers and supply chain people rather than just cold pitching founders.  \n  \nHave you got any case studies or samples from your existing brand work that you could showcase?",
          "score": 1,
          "created_utc": "2026-02-06 05:55:17",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qxdf83",
      "title": "what we do to generate 200+ leads a month",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qxdf83/what_we_do_to_generate_200_leads_a_month/",
      "author": "Glass-Ad3933",
      "created_utc": "2026-02-06 09:48:28",
      "score": 10,
      "num_comments": 15,
      "upvote_ratio": 0.92,
      "text": "alright posting this because i keep seeing the same recycled advice everywhere and it honestly doesnt match what happens in real businesses, we run a b2b operation and cold email alone brings us **200 to 300 plus inbound leads every single month**, real companies in lending saas transportation manufacturing and marketing, not course buyers not wanna be founders, actual decision makers with budgets.\n\nthe first mistake people make is thinking cold email starts with copy, **it starts with who you target**, and for us that is always **c suite and executives only**, ceo founder co founder managing partner cfo head of growth director level minimum, anything below that just slows deals down and kills reply quality.\n\n**how we actually pull leads**  \nwe use **Apollo and RocketReach together**, never just one, inside apollo we go very specific, united states only, employee count usually **10 to 200**, industry filtered tight depending on the offer, then we layer titles like **CEO, Founder, Co Founder, Managing Partner, CFO, Head of Growth, Director**, then comes the most important part which most people skip, manual exclusions, we remove banks, credit unions, nonprofits, trucking associations, churches, foundations, anything that cant buy or needs a board vote.\n\nexample from last month, we targeted lending companies and pulled **12,400 contacts** initially, sounds great right, after exclusions and cross checking with rocketreach that list dropped to **6,100**, then after verification it dropped again to **3,900**, that smaller list outperformed every bigger list weve ever sent.\n\n**email verification is not optional**  \nwe dont trust one verifier ever, we run the list through our verifier then we break it down by provider, **gmail outlook yahoo corporate**, if gmail bounces even smell risky we kill the batch, we literally deleted **8,400 manufacturing leads** last month because early testing bounced too much, rebuilt a tighter list of **3,100 execs**, that list alone generated **47 replies and 11 booked calls**, this is where most people lose before they even send.\n\n**inboxes matter more than copy**  \nwe use **Puzzle Inbox, Slicey, and Premium Inboxes**, typical setup is **3 inboxes per domain** sending **15 to 20 emails per inbox per day**, so one domain does around **45 to 60 emails daily**, when we want to scale we dont touch volume we add domains, one saas campaign ran on **18 domains with 54 inboxes**, sending just under **900 emails per day**, deliverability stayed clean for weeks.\n\nif youre sending 100 emails from one inbox youre already done you just havent felt it yet.\n\n**sending tools**  \nwe rotate between **Instantly and Smartlead**, instantly when we want speed and simplicity, smartlead when reply routing matters more, no links no images no tracking pixels, plain text only, first email is intentionally simple and slightly confusing.\n\nexample first email that still works insanely well  \nhey john quick question are you the right person for partnerships at company name\n\nthats it.\n\n**copy that actually gets replies**  \nwe write like humans not marketers, structure is always **relevance credibility low pressure question**, one of our highest performing emails for a transportation company had a typo in the first line and still booked **9 calls in two weeks**, people reply to intent not perfection.\n\nexample  \nhey mike saw you run operations at a mid sized freight company and figured id ask  \nwe help transportation teams book inbound demos without hiring more sales people  \nopen to me sending over how it works or should i disappear\n\nno pitch deck no calendar link no pressure.\n\n**crm and reply handling**  \nwe keep it boring on purpose, **HubSpot or GoHighLevel**, every reply is tagged manually at first, positive neutral negative out of office unsubscribe, this is how patterns show up, last month we noticed **lending CEOs reply between 6am and 8am eastern**, while **saas founders reply late night around 9 to 11pm**, we adjusted send windows and reply volume jumped without changing copy at all.\n\n**real numbers so this doesnt sound like fluff**  \nmarketing agency campaign  \n**22,400 emails sent**  \n**312 total replies**  \n**84 positive replies**  \n**19 booked calls**  \n**4 closed deals**  \naverage deal size **7k monthly**\n\nfunding company campaign  \n**15,000 emails sent**  \n**61 replies**  \n**14 asked directly for options**\n\nall cold email.\n\nlast thing ill say is this, cold email is not dead and its not about tricks, **its about clean data slow sending boring copy and respecting the inbox**, if youre getting zero replies its not because the channel is broken its because something upstream is.\n\nhappy to answer questions but if your inbox setup is trash templates wont save you.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qxdf83/what_we_do_to_generate_200_leads_a_month/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o3vje4b",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-06 09:48:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3xgzt0",
          "author": "hollee-o",
          "text": "Lol. \n\nGullibles reading this: They are selling lead gen. if they were as successful doing this as claimed, why would they be here spending time sharing secrets? Hint: they wouldnt. They’d be too busy running their process printing money. \n\nThe absolute worst content hole on the web has long been and continues to be selling lead gen.",
          "score": 3,
          "created_utc": "2026-02-06 16:50:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3vnsal",
          "author": "UbaidJoyzAI",
          "text": "what's your TOAS?\n\nall this setup and the money you burnt vs what you  closed?\n\n",
          "score": 2,
          "created_utc": "2026-02-06 10:29:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3vqvvh",
              "author": "Glass-Ad3933",
              "text": "i have around a 3-4x return.",
              "score": 2,
              "created_utc": "2026-02-06 10:56:56",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3xeiym",
          "author": "AmphibianNo9959",
          "text": "For automating the discovery of those genuine conversations on Reddit as alternative channel, I use Leadmatically. It can find like more than 30 leads for one business. If you remove some irrelevant leads from them, I will still be way more than 200/month figure.",
          "score": 1,
          "created_utc": "2026-02-06 16:39:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ybhw7",
          "author": "Finners_GrowthStrat",
          "text": "What are you selling? I find that what you're actually selling influences which channels work well. We're selling consulting projects and haven't found much cold of anything to be that successful. Intros, referrals, people warmed up on social has been more successful, for us that is.",
          "score": 1,
          "created_utc": "2026-02-06 19:16:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3yn9p1",
              "author": "Glass-Ad3933",
              "text": "i sell lead gen",
              "score": 1,
              "created_utc": "2026-02-06 20:14:09",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3z22jz",
                  "author": "Finners_GrowthStrat",
                  "text": "Interesting. I assume then that you do lead gen for non-lead-gen businesses? Using the same method? What's the success rate of that? Same/better/worse? What's your typical client? What are they selling?\n\nSorry for all the questions just trying to build my understanding of what works/doesn't. Thanks.",
                  "score": 1,
                  "created_utc": "2026-02-06 21:28:06",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o403x86",
          "author": "New_Grape7181",
          "text": "I've been running cold outreach for a while now and honestly your point about targeting being more important than copy is spot on. We had the same realisation about six months back.  \n  \nOne thing that's worked really well for us alongside email is layering in video messages to the people who respond positively. When someone replies saying \"yeah tell me more\" or asks a question, instead of another text email we send a quick personalised video walking through exactly what we mentioned. It's maybe 45 seconds, references their company specifically, and the conversion from interested reply to booked call went from around 30% to nearly 60% for us.  \n  \nThe reason it works is the same as your boring copy approach. It's human, low friction, and doesn't feel like you're being pushed through a sales machine.  \n  \nCurious though, when you get those positive replies back, are you jumping straight on a call or do you nurture them a bit first with more context?",
          "score": 1,
          "created_utc": "2026-02-07 00:55:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4090j9",
          "author": "kubrador",
          "text": "this is the kind of post that makes people go \"oh so i just need to do the actual work instead of buying another course\" and then never do it\n\n\n\nthe real tell is that you deleted 8,400 leads because they smelled wrong. most people would've sent them anyway and complained cold email doesn't work.",
          "score": 1,
          "created_utc": "2026-02-07 01:26:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o40car6",
          "author": "boomerific816",
          "text": "Are you posting to get hired? Or selling one of the tools you mention",
          "score": 1,
          "created_utc": "2026-02-07 01:46:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o413tnd",
          "author": "Aislot",
          "text": "this is one of the more grounded cold email breakdowns I’ve seen lately and the upstream point is dead on most people obsess over copy when the real damage is bad targeting bad data and burned inboxes also like the focus on execs only that alone filters a ton of noise first 50 customers are almost always founder driven anyway and cold email done like this is basically founder led distribution at scale keep pushing once this works referrals and warm intros usually start compounding on their own curious how you decide when to kill a campaign early versus letting it run longer",
          "score": 1,
          "created_utc": "2026-02-07 04:47:00",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qsa2b1",
      "title": "Has anyone successfuly executed founder led growth on Linkedin",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qsa2b1/has_anyone_successfuly_executed_founder_led/",
      "author": "less_is_more9696",
      "created_utc": "2026-01-31 18:27:25",
      "score": 8,
      "num_comments": 19,
      "upvote_ratio": 1.0,
      "text": "I'm a freelance B2B SaaS content marketer, and I recently landed a client who wants help growing their COO's page and presence on LinkedIn.\n\nAlthough I have a lot of experience in content marketing, most of it is in creating long-form content (blogs, seo, guides, etc). With those content mediums becoming less popular, I'm trying to pivot more into social media and short-form content.\n\nSince I don't have a ton of experience, I would love to get advice from anyone who has succesfully exectued this type of content program before.\n\nI have a few more concrete questions, but I would love to hear any insights or advice.\n\n1. Did you notice any specific type of content format perform better i.e., carousel, pure text, single image, video, etc\n2. Did you notice any specific content type perform better - personal story, brief reflections, hard-earned lessons, declarative opinions, industry commentary/insights, how-tos, step-by-steps, etc\n3. How long did it take to get traction?\n\nA bit more context: the app is in the fintech category. Our ICP (without going into too much detail) is finance leaders and small business owners.",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qsa2b1/has_anyone_successfuly_executed_founder_led/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o2txjfz",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-31 18:27:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2uaapd",
          "author": "Kamel_Ben_Yacoub",
          "text": "What you need is basically demand gen content to build trust and authority along with brand equity.\n\nFounder-led content isn't just organic, you can leverage and amplify this content by distributing it in paid campaigns to your exact ICP.\n\nThese are the content formats that you can amplify with LinkedIn Ads, exactly as we do for our clients:\n\n\\- Thought Leader Ads promoting your CEO's organic post.\n\n\\- Brand awareness videos to focus on your product capabilities and problems solved.\n\n\\- Problem/solution content. Heavy focus on product marketing ads (how your company is different from competitors and the core capabilities you help with). Content that answers top questions your ICP has.\n\nRegarding the founder's content, you've already mentioned most of the angles that perform well but if I had to choose the top performers based on our results I would recommend these three:\n\n\\- Personal stories & hard-earned lessons: These work because people trust a human sharing a real mistake or success story much more than a corporate brand.\n\n\\- Industry commentary & insights: Sharing a unique opinion on a trend always works great for authority. It shows you're an expert who actually knows the \"real game\" behind the scenes.\n\n\\- Step-by-steps & how-tos: These are good for proving you know your stuff, but they don't get the same emotional engagement as a personal story. Use these to support your authority, not as your main hook.\n\nAlso, better if you can include an image or video in your posts.",
          "score": 3,
          "created_utc": "2026-01-31 19:27:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2v1anh",
              "author": "sanfranciscolady",
              "text": "Agree with all this, and be EXTREMELY careful not to let AI language leak through!",
              "score": 2,
              "created_utc": "2026-01-31 21:40:27",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2x3qa8",
          "author": "Any-Rooster2350",
          "text": "Been there done that, have the scars: biggest issue was 1 of my ceo clients never wanted to sell in her posts. Thought it was beneath her. Guess what: tons of engagement and 7x followers, but no leads in 1.5 yrs of working with her.  \n\nI’m friends with the Linkedin top voices editorial team too, and they said they highly prioritize personal stories and experiences and “behind the scenes” of something only the ceo has access to. So go get personal! \n\nThe best lead content has been sharing customer win stories, hands down. DM me if you wanna know the 3 things I’d do again and not do again ;)",
          "score": 3,
          "created_utc": "2026-02-01 04:53:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2v17ja",
          "author": "sanfranciscolady",
          "text": "I run a B2B marketing agency that specializes in organic marketing, we do this type of thing for a lot of our clients! Would be happy to talk shop and share tips if you shoot me a DM!",
          "score": 1,
          "created_utc": "2026-01-31 21:40:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2xkpmi",
          "author": "Scared_Yak5572",
          "text": " Prioritize consistent posting, testing formats, and threading opinion into practical advice.founder led on LI works if you hammer carousels w hard earned fintech lessons or quick how-tos for SMB owners - text posts flop hard tho. traction took me \\~4 mos consistent posting 3x/wk but pairing it w targeted commenting via depost ai (build lists engage smart draft replies) exploded interactions into real convos fast. skip the spray n pray bs",
          "score": 1,
          "created_utc": "2026-02-01 07:06:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2yeab1",
          "author": "globetrotter-vienna",
          "text": "For me sliders perform best. Slider: a PDF some 5 pages where the user can take action himself and interact.",
          "score": 1,
          "created_utc": "2026-02-01 11:37:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2z38lq",
          "author": "Admirable_Swim_7805",
          "text": "founder led li is gold but content grind sucks. set one up with auto onboarding flows, scrapes new connections, scores them by role and industry, drips crm nurtures with their pain specific tips from your posts. like conn connects, tags as hot if vp marketing, day 3 email saw your post on x heres how we fixed that at similar fintech. traction in 4 weeks, 15 percent reply on founder content. carousels crushed for us over video, and personal stories beat how tos by like 3x engagement",
          "score": 1,
          "created_utc": "2026-02-01 14:27:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o30mq59",
          "author": "SendPotionDotCom",
          "text": "Adam Robinson of Retention is doing this really well. \n\nPS: I'm not affiliated with them at all, just like his stuff on LinkedIn.",
          "score": 1,
          "created_utc": "2026-02-01 18:48:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o33illq",
          "author": "amoorthy",
          "text": "1. Have a content mix of Top:Middle:Bottom funnel content of about 30:50:20. \n\n\\- Top of funnel content: personal stories that show the COO's inspiration/drive\n\n\\- Middle of funnel content: industry trends and commentary.\n\n\\- Bottom of funnel content: company/product specific\n\nThe views are much higher for Top than Bottom funnel content but the latter drives more leads. Still, all are required to grow your visibility.\n\n2. Posting regularly (2x/week is enough) is only half the story. You have to find and engage in conversations with relevant industry influencers whom your ICP likely already reads. This is good way to increase visibility and showcase COO's expertise. Should be commenting \\~3x/day.\n\n3. Posts do better when you put a lot of time into the visuals (charts are especially good). This is one place where a talented marketer can far outshine AI generated content.\n\nAside: A lot of people struggle with #2 above: finding relevant industry influencers and getting subject matter experts to engage in relevant conversations regularly. This is a problem we are solving at Rocksalt AI.",
          "score": 1,
          "created_utc": "2026-02-02 03:56:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o34lyip",
          "author": "Public_Quiet_3624",
          "text": "idk about that. But if you want emails, linkedin and other leads, I've got 334k leads of decision makers in the USA. Dm if anyone needs it",
          "score": 1,
          "created_utc": "2026-02-02 09:18:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o34xkja",
          "author": "Soft-Dragonfruit6447",
          "text": "Amazing how **7x followers** doesn’t auto-convert to revenue. If only likes paid invoices.",
          "score": 1,
          "created_utc": "2026-02-02 11:08:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o35t64r",
          "author": "hotdoogs",
          "text": "Look at what others are posting (influencers, competitors etc), copy the style, make some posts, boost them as ads to your target audience = profit",
          "score": 1,
          "created_utc": "2026-02-02 14:35:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3776a8",
          "author": "Mordaniel877",
          "text": "A colleague of mine gained 25k followers in 6 months, from 5 > 30k, by intense learning of linkedin content.\n\nLead magnets, posts structure, all kinds of artificial pods etc. To make it work you might need to spend a ton of time on LinkedIn fyi. Not sure if there're shortcuts to building authority. Someone will have to ghostwrite on his behalf.",
          "score": 1,
          "created_utc": "2026-02-02 18:30:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3bmbij",
          "author": "freudianslip9999",
          "text": "I am at 60K and have found no shortcuts. Happy to answer a few questions in the DM’s if you still have them after hearing from everyone.",
          "score": 1,
          "created_utc": "2026-02-03 11:03:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3bva0o",
          "author": "Mobile-Ambition-3714",
          "text": "What’s worked best is leaning into personal stories or hard-earned lessons especially where the COO can give a real “inside the room” vibe that nobody else could fake. Industry takes and brief how-tos also land well if they’re practical and aimed straight at your ICP but the emotional stuff pulls more engagement. Carousels and images help snag attention better than text alone but quality beats fancy graphics. Expect traction to pick up once you hit a groove with consistent posting and smart commenting but it’s rarely instant—plan for a few months of steady effort before things start to really snowball.",
          "score": 1,
          "created_utc": "2026-02-03 12:15:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3uoz0f",
          "author": "New_Grape7181",
          "text": "I've been doing founder-led content on LinkedIn for about 18 months now, so can share what's worked.  \n  \nVideo posts consistently get 3-4x the reach of text or carousel posts in my experience. LinkedIn's algorithm seems to heavily favour native video. That said, carousels work well for tactical how-to content that people want to save and reference later.  \n  \nFor content type, I found that specific, tactical posts outperform everything else. Instead of \"5 lessons from scaling our startup\", go with \"We reduced customer churn from 12% to 4% by changing our onboarding sequence. Here's the exact three emails we sent.\" The more concrete and less generic, the better.  \n  \nPersonal stories work, but only if they connect to a specific insight your ICP can actually use. Nobody cares that your COO woke up at 5am unless there's a payoff that helps finance leaders solve a real problem.  \n  \nTraction took about 2-3 months of posting 3x per week before we saw consistent engagement. The first month was mostly crickets, which is normal.  \n  \nFor fintech targeting finance leaders, I'd focus on regulatory changes, compliance shortcuts, or cost-saving tactics. Really specific stuff they can implement quickly.  \n  \nWhat's the COO's current posting frequency and engagement level?",
          "score": 1,
          "created_utc": "2026-02-06 05:18:30",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qx6blh",
      "title": "New to Local Lead Gen and Looking for Advice on Getting Started the Right Way",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qx6blh/new_to_local_lead_gen_and_looking_for_advice_on/",
      "author": "Ill-Explorer-5001",
      "created_utc": "2026-02-06 03:12:54",
      "score": 8,
      "num_comments": 9,
      "upvote_ratio": 1.0,
      "text": "I’m looking to get my feet wet in the local lead generation space and could really use some guidance from people who’ve actually been in the trenches.\n\nRight now, I’m not a business owner yet. I’m at the very beginning stages and trying to learn the right way before jumping in. My long-term goal is to build something that lets me work from home while my wife works full time, so I can be there for our kids and help care for our special needs daughter.\n\nHaving flexibility and stability is extremely important to my family. It’s very difficult trying to work around each other’s schedules to provide adequate supervision and care around the clock for our daughter. We don’t have outside help or government assistance. It’s just my wife and I.\n\nI’m also not working at the moment. I left my previous employer so my wife could work full time while I job hunt and watch the kids.\n\nA little about me:\n\n1.) I already have experience with scripting\n\n2.) I’m comfortable with prospecting\n\n3.) I have some cold calling skills\n\n4.) I’m not afraid of outreach or rejection\n\nWhat I’m hoping to learn from you all:\n\n1.) What’s the best way to get started in local lead generation with little to no experience?\n\n2.) I’m mainly interested in service-based lead gen for local companies in my area.\n\n3.) How did you land your first client?\n\n4.) What beginner mistakes should I watch out for?\n\n5.) What would you recommend learning first?\n\n6.) What niches would you recommend looking into?\n\n7.) What tools are best to start out with (preferably free or cheap)?\n\nRight now, I’m seriously considering targeting epoxy flooring companies as my main niche. Part of the reason is because I’ve worked with epoxy before and have done flooring in the past, so I already understand the product, the process, and what customers usually care about. I’ve checked with Google Maps and have seen there are plenty of companies in my area with little to no reviews and plenty more with no online presence. \n\nThat said, I’m still not 100% sure if epoxy will pan out long-term or scale well, so I’m very open to hearing other niche ideas too.\n\nI’m motivated, willing to put in the work, and in this for the long haul. I’m not looking for shortcuts. I just want to avoid wasting time going down the wrong paths.\n\nAny advice, resources, or personal experiences would mean a lot.\n\nAND PLEASE DO NOT TRY TO SELL ME ON YOUR AI PRODUCT. NOT INTERESTED. \n\nTIA y’all!",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qx6blh/new_to_local_lead_gen_and_looking_for_advice_on/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o3u685p",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-06 03:12:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4027ri",
          "author": "New_Grape7181",
          "text": "I worked in local service business marketing for a while, and epoxy flooring is actually a solid pick. The margins are high enough that they can afford to pay for leads, and you're right that most are invisible online.  \n  \nSince you're comfortable with cold calling, here's what I'd do first. Ring 10 epoxy companies in your area and ask them straight up how they currently get customers. You'll learn more in those conversations than any course will teach you. Most will actually tell you because they're not used to people asking smart questions.  \n  \nFor your first client, don't sell lead gen as a service yet. Offer to run a small test campaign for just the cost of ad spend (if you go that route) or do it purely on commission per lead. This removes all their risk and gets you a case study fast.  \n  \nTools to start: Google Business Profile optimisation costs nothing and actually works for local. If you want to run ads later, Google Local Services Ads convert well for home services.  \n  \nOne thing I'd caution against is building sites you don't own yet. Some people do the \"rank and rent\" model but it takes months to see results, and you need cash flow now.  \n  \nWhat's your plan for actually generating the leads once you land a client?",
          "score": 2,
          "created_utc": "2026-02-07 00:45:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o40l24z",
              "author": "Ill-Explorer-5001",
              "text": "You’re just validating everything that I’ve been thinking about on how to navigate all of this! I plan is to build my own website first, run ads and draw in traffic then sell them for a commission per lead to build that case study. (I don’t know how I’m going to do all of this yet, but I’m figuring it out as I go.) I just got my laptop back from a friend today who was a software engineer. I had him fix some bug issues to speed it up. I’m currently sitting in front of it now downloading tools necessary for the job. \n\nAny more tips you may have for where I’m at now?\nDoes my game plan so far sound like I’m taking the right path?\nThank you!",
              "score": 1,
              "created_utc": "2026-02-07 02:40:53",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3wu7xe",
          "author": "Ash_Skiller",
          "text": "sounds like you've got a solid foundation with your scripting and cold calling background, that'll serve you well in lead gen. For finding those local service businesses to target (like your epoxy flooring idea), I came across SMB Sales Boost recently and it looks like it could be useful for building out prospect lists. It's basically a database that shows you newly registered businesses in your area so you can reach out to them early before they're getting hit by everyone else.\n\nOne thing I'd add about epoxy flooring as a niche - it's pretty seasonal in some areas and the market can be saturated depending on where you are. Might be worth also looking at HVAC, plumbing, or electrical companies since they tend to have more consistent year-round demand and higher customer lifetime value. The fact that you have hands-on experince with epoxy is definitely valuable though, maybe use that as your starting point to land the first client and build proof of concept before branching out.",
          "score": 1,
          "created_utc": "2026-02-06 15:02:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3xyx09",
          "author": "ActivitySmooth8847",
          "text": "Start by picking one niche and really learn what their customers want. Epoxy flooring sounds good since you know the product, but also check out plumbers or landscapers since they always need leads. For cheap tools, try Google Maps and free CRM like HubSpot, and if you want to speed up lead lists, SocLeads can help pull contacts fast without much hassle.",
          "score": 1,
          "created_utc": "2026-02-06 18:16:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ysr11",
          "author": "erickrealz",
          "text": "Epoxy flooring is actually a damn solid niche pick, especially since you already know the industry. That knowledge alone puts you ahead of 90% of people starting out because you can actually speak the language when talking to these business owners. Don't overthink the niche selection, just commit and go.\n\nYour scripting and cold calling background is honestly the perfect skill set for this. With our clients who sell lead gen services to local businesses, the ones who crush it early all started the same way. They picked up the phone, called local companies with crappy online presence, and offered to bring them leads. No fancy pitch deck, no website needed, just \"hey I can get your phone ringing, want to try it out.\" Landing that first client is always the hardest part so consider doing the first one free or on a pay per lead basis just to get proof that your system works.\n\nFor tools on a budget, grab Apollo for prospecting and building contact lists of local business owners. Use Google My Business to identify companies with weak online presence like you're already doing. For the actual lead gen delivery, start with a simple landing page through Carrd or a free WordPress setup paired with Google Local Service Ads. Those convert like crazy for home services and the barrier to entry is low.\n\nBiggest mistake I see beginners make is trying to offer everything to everyone. Stick with epoxy flooring, learn exactly what works to generate those leads, document your results obsessively, then use that proof to sign paying clients in the same niche. Rinse and repeat until you've got a system that runs predictably before even thinking about adding another niche.",
          "score": 1,
          "created_utc": "2026-02-06 20:41:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3yt02y",
          "author": "Tomsonx232",
          "text": "What is your product/service? You're going to do lead generation for epoxy flooring companies aka you're going to find customers for the epoxy flooring companies?",
          "score": 1,
          "created_utc": "2026-02-06 20:42:55",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qtzqxs",
      "title": "You (Marketing) have 3 slides to defend a $15K/month channel that's \"not driving enough pipeline yet.\" What do you show?",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qtzqxs/you_marketing_have_3_slides_to_defend_a_15kmonth/",
      "author": "Goran-CRO",
      "created_utc": "2026-02-02 16:28:21",
      "score": 7,
      "num_comments": 14,
      "upvote_ratio": 1.0,
      "text": "I'm sure you've been on this type of meeting more than once:)\n\nSubject: Paid Search Budget Review \n\nAttendees: CMO, CFO, CEO Meeting length: 30 minutes\n\nYou (Marketing) have 3 slides to defend a $15K/month channel that's \"not driving enough pipeline yet.\"\n\nWhat do you show?\n\nSLIDE 1: Wrong Approach \\[Title: Paid Search Performance - Month 3\\]\n\n\\- Total Spend: $45K\n\n\\- Total Pipeline: $86K\n\n\\- \"ROI\": 1.91x\n\n\\- Demos: 32\n\n\\- Cost per demo: $1,406\n\nCFO: \"Our best channel is 3.2x cheaper per demo. Why are we still doing this?\"\n\nYou: \"Well, it's early and we need more time to—\"\n\nCFO: \"How much more time?\"\n\nYou: \"Um, maybe 3 more months?\"\n\nCEO: \"Let's table this and circle back next quarter.\"\n\n\\[Budget gets cut.\\]\n\nSLIDE 1: Better Approach \\[Title: Paid Search Optimization Trajectory - Investment Phase\\]\n\nWhat We're Measuring (Months 1-6): ❌ Not measuring: ROI vs. mature channels ✅ Measuring: Path to economic viability\n\nProgress Indicators: → CPA trend: $2,400 (M1) → $1,800 (M2) → $1,350 (M3) \\[↓ 44%\\] → Conversion rate: 2.1% → 3.4% → 4.2% \\[↑ 100%\\] → Impression share in ICP: 8% → 12% → 18% \\[↑ 125%\\] → Demo quality: 68% ICP match (on par with outbound)\n\nWhat This Means: → Economics improving faster than benchmarks → Scale headroom: 82% of addressable impression share untapped → Trajectory suggests $800-900 CPA by Month 6 (comparable to outbound)\n\nDecision Point: → If CPA hits $900 by Month 6 → Scale to $30K/month → If CPA stays above $1,200 → Kill it\n\nCFO: \"So we're on track?\"\n\nYou: \"Yes. And we have clear kill criteria if we're not.\"\n\nCEO: \"Let's revisit at month 6 with these benchmarks.\"\n\n\\[Budget approved.\\]\n\nThe difference:\n\n❌ First version: Defending a weak ROI number \n\n✅ Second version: Showing progress toward a milestone with kill criteria\n\nWhat's your go-to metric when defending experimental channels?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qtzqxs/you_marketing_have_3_slides_to_defend_a_15kmonth/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o36gd3c",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-02 16:28:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o36j62d",
          "author": "Impressive-Amount255",
          "text": "That’s a very interesting point you’re making, and I mostly agree with how you frame it.\nIf you’re trying to compare channels against each other without taking into account the maturity of each channel, then yes, you’re right. It’s like comparing apples with pears. I would even go one step further and say that not all channels are revenue-generating channels from a tracking perspective. Some channels will always look more expensive because their influence is harder to track than others.\nHowever, to me, this is not even how the discussion should be framed.\nThe discussion should not be about comparing channels in front of a CFO or a CEO. If you are in charge of marketing, you should define the plan and be judged on the total outcome. The CFO has no business being involved in how each individual channel is performing, especially when they don’t have the context of what is expected from a specific channel.\nLooking at each channel purely in terms of direct impact on revenue is insanely short-sighted, and that’s typically what a CFO with no knowledge of marketing would do.\nWhat I’m saying is that the discussion should be happening on a completely different turf. The discussion should be about how your campaign as a whole, including channel A, channel B, and channel C, has spent X dollars of budget for Y dollars of revenue, with whatever ROI is attached to it.\nThen, as a marketer, with the full context, your expertise, and the metrics you are tracking, you should be the one deciding where to invest more money.\nIf your CEO and CFO are making those calls on your behalf, you’re not a CMO. You’re a marketing executive who has been hired to execute a strategy you’re not even deciding yourself.\nTo me, you have to take one step back, think in terms of integrated campaigns, and look at campaign ROI, not channel ROI, at least not in discussions with your executive team.",
          "score": 7,
          "created_utc": "2026-02-02 16:41:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o37ow33",
              "author": "Radiant-Security-347",
              "text": "this is dead on. leaders don’t defend. they lead.",
              "score": 2,
              "created_utc": "2026-02-02 19:51:59",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o36ivnm",
          "author": "another_sleeve",
          "text": "idk but I'd start with not asking chatgpt to build me a slide to defend my budget",
          "score": 3,
          "created_utc": "2026-02-02 16:39:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3d84x2",
          "author": "agonsenhauser",
          "text": "The \"better approach\" in your example works because it shifts the focus from defending spend to demonstrating a clear path to viability. I've found that replacing activity metrics with trust metrics like ICP alignment and pipeline velocity is the real key to changing the vibe of these meetings. These budget reviews are critical tenure moments, and when you show the C-suite that you are focused on the quality of the business being built, you stop being viewed as a cost center and start being treated like a strategic partner.",
          "score": 2,
          "created_utc": "2026-02-03 16:37:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o384yz4",
          "author": "Any-Rooster2350",
          "text": "Genuine question: when does sales ever have to “defend” anything?  Not snarky, I truly want to know",
          "score": 1,
          "created_utc": "2026-02-02 21:08:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3adyqr",
              "author": "Dickskingoalzz",
              "text": "Marketing does - all the time.",
              "score": 1,
              "created_utc": "2026-02-03 04:34:47",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3bqbst",
          "author": "KissyyyDoll",
          "text": "Kill criteria + trajectory beats raw ROI every time. CFOs want a plan, not hope",
          "score": 1,
          "created_utc": "2026-02-03 11:37:48",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1quopxb",
      "title": "Struggling to find the right ICP and channel",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1quopxb/struggling_to_find_the_right_icp_and_channel/",
      "author": "pmagi69",
      "created_utc": "2026-02-03 10:44:06",
      "score": 7,
      "num_comments": 15,
      "upvote_ratio": 1.0,
      "text": "I’ve spent the past year building a B2B SaaS platform (AI-enabled scripting tool) but I’m facing the classic mistake: I built first, validated later (not entirely true, I did a bunch of early validation interviews and have kept that up recently). Now I’m stuck with what feels like three different products under one roof, and I need help finding the right positioning and acquisition channel.\n\n**What the platform does:** It’s a scripting tool that lets users create mini-apps with simple code. These apps guide users through multi-step AI workflows (think: structured SOPs, not automation/agents). The LLM follows your script, asks questions, processes inputs, and returns results at each step. Think custom GPTs on steriods.\n\n**The three “products” I could sell:**\n\n1. **DIY Platform** \\- Advanced users script their own workflow apps (small audience, high expertise required)\n2. **Done-for-you Service** \\- I interview clients about their SOPs and build custom apps for them (consultative, doesn’t scale well, but could be good in the beginning)\n3. **Ready-made Apps** \\- I build and distribute vertical-specific apps (e.g., “SoMe Commenter” for LinkedIn/Reddit engagement, “Long Text Editor” for working around LLM output limits), \"Content Repurposing\" app etc etc.\n\n**What I’ve tried so far:**\n\n* Marketed as a content creation tool to LinkedIn thought leaders (limited traction at the time)\n* Pitched custom workflow solutions to in-house content teams and agencies (slow sales cycle, and hard to get a foot in among the solutions they already use)\n* Positioned it as a dev tool with open-source apps on GitHub (minimal uptake)\n* Currently experimenting with marketing individual apps (SoMe Commenter, Long Text Editor) *without* mentioning the platform\n\n**Where I’m at:** Right now, I need to find my first paying customers to validate an ICP that’s actually willing to pay for this to get a beach head to operate from. I have hundreds of users registered but haven’t cracked the retention or monetization piece yet.\n\n**Channels I’m considering:**\n\n* Cold email campaigns to targeted ICPs\n* Google Ads (Search/Display)\n* Social media ads (LinkedIn/Facebook)\n* Organic social media content marketing (doing)\n* Direct LinkedIn outreach to book demos with ideal customers (doing)\n* Community engagement (Reddit, niche forums, etc.) (doing)\n\n**My questions:**\n\n1. Which of these three product approaches would you double down on to get initial traction and paying customers?\n2. Which acquisition channels would you prioritize given my situation? (Limited budget, B2B focus, workflow/productivity tool, need to validate willingness to pay)\n3. Should I continue decoupling the apps from the platform, or is there a way to leverage the platform story?\n4. For those who’ve tested these channels for similar products in super early days, what worked fastest for getting your first 5-10 paying customers?\n\nWould love to hear from anyone who’s navigated similar positioning challenges!  \n",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1quopxb/struggling_to_find_the_right_icp_and_channel/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o3bk48v",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-03 10:44:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3c2km2",
          "author": "Fit-While-2208",
          "text": "I would start with the basics. It sounds like your platform is very general as a product. Who did you build it for specifically? What job function? Start there and then conduct some marketing interviews to understand what channels might apply.",
          "score": 2,
          "created_utc": "2026-02-03 13:04:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3cesbe",
          "author": "Nihcas_Sachin",
          "text": "couldnt get the SPECIAL thing about your product. Understanding intent and context if not figured out, would be diff to make a sell\n\nRather build an agency out of these mini apps and service the shit out of it",
          "score": 2,
          "created_utc": "2026-02-03 14:13:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3eb7t4",
              "author": "pmagi69",
              "text": "Yeah, maybe that's the way to go......but not as fun as its not scalable....",
              "score": 1,
              "created_utc": "2026-02-03 19:36:42",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3cnt9c",
          "author": "Intrepid_Boss9449",
          "text": "I’d focus on the done-for-you service first to get paying customers fast and learn what they really need. For channels, cold email and direct LinkedIn outreach seem best with limited budget. Don’t fully decouple the apps from the platform yet since the platform story can help build trust and upsell later.",
          "score": 2,
          "created_utc": "2026-02-03 15:01:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3ebf1f",
              "author": "pmagi69",
              "text": "Tnx, I also think that is the way to go, but I am also trying in parallell to market a couple of the apps.",
              "score": 1,
              "created_utc": "2026-02-03 19:37:40",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3d7g9c",
          "author": "agonsenhauser",
          "text": "I would lean into the done-for-you service as a diagnostic engine rather than a long-term business model. It is the fastest way to track which specific niche has the shortest sales cycle and highest win rate without the overhead of building self-serve features first. Once you find that beachhead where the friction is lowest, you will have the clarity you need to actually scale the DIY platform for them.",
          "score": 2,
          "created_utc": "2026-02-03 16:34:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3ebnsu",
              "author": "pmagi69",
              "text": "Sounds lika a smart way ahead, so, then outreach on linkedin is probably the best way for now....",
              "score": 1,
              "created_utc": "2026-02-03 19:38:49",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3j4q6f",
          "author": "Dangerous_Bowler3286",
          "text": "I’ve been in a similar spot, and for me the biggest unlock wasn’t adding channels it was simplifying the workflow. I tried most common B2B channels (ads, LinkedIn, content, communities), but with a limited budget they were slow and noisy. What finally worked was focusing on cold email as the core channel and using everything else as support.\n\nMy current flow is pretty simple: identify a very narrow ICP → look for real buying signals → enrich and verify leads → run short, relevant cold email sequences → follow up consistently → only then bring in LinkedIn or calls if there’s engagement. That gave me faster feedback on who’s actually willing to pay.\n\nCold email to very specific roles with a clear problem beats ads early on. Once patterns emerge, you can package that into ready-made apps later.\n\nThis setup works for me because it’s credit-based, budget-friendly, and cuts a lot of manual work.   \n  \nCurious which ICP has shown any buying signal so far, even weak ones?",
          "score": 1,
          "created_utc": "2026-02-04 14:01:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3j655v",
              "author": "pmagi69",
              "text": "I am assuming you sell cold email solutions…?…;-)",
              "score": 1,
              "created_utc": "2026-02-04 14:09:17",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3uv22i",
          "author": "New_Grape7181",
          "text": "I've been in a similar spot with multiple possible ICPs and it's honestly paralysing. Here's what helped me narrow down:  \n  \nStop trying to validate three products simultaneously. Pick the path with the shortest distance to money right now. From what you described, the done-for-you service is probably your fastest route to revenue, even if it doesn't scale yet. You learn exactly what clients need, you get paid to build case studies, and you can productise later based on patterns you see.  \n  \nFor channels, cold email and direct LinkedIn outreach can work but they're slow when you don't have a tight ICP yet. I'd focus harder on the community engagement you're already doing. Find 3-5 specific communities where your potential users are actively complaining about workflow problems your tool solves. Reddit, Slack groups, niche forums. Answer questions, share insights, build trust over a few weeks, then DM the most engaged people offering to build them a custom workflow for free in exchange for feedback.  \n  \nThe decoupling question is interesting. I'd test both, honestly. Some people will want the specific app, others will want the platform flexibility once they see what's possible.  \n  \nWhat type of SOPs or workflows are your current registered users actually trying to build most often?",
          "score": 1,
          "created_utc": "2026-02-06 06:05:53",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qvrrck",
      "title": "How did you get your first 10 customers?",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qvrrck/how_did_you_get_your_first_10_customers/",
      "author": "InevitableSense7507",
      "created_utc": "2026-02-04 15:36:32",
      "score": 7,
      "num_comments": 17,
      "upvote_ratio": 1.0,
      "text": "Hi everyone, I’m Kane from Atlanta. I'm a 2x founder building an AdTech product.   \n  \nWe’re at about $2k/mo and growing steadily. I’m looking for the real story on first customers, not the generic stuff I'm mainly seeing on YT.  \n  \n**How did you get your first 10? Where did you find them, what did you say, and what did you do repeatedly until it worked?**\n\n",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qvrrck/how_did_you_get_your_first_10_customers/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o3jnkv3",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-04 15:36:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3kxr0s",
          "author": "No_Hedgehog8091",
          "text": "Talk with them, not at them. My first 10 came from commenting helpfully in niche Facebook groups, solving real problems before mentioning my solution.",
          "score": 3,
          "created_utc": "2026-02-04 19:07:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3njutt",
              "author": "InevitableSense7507",
              "text": "thanks!",
              "score": 1,
              "created_utc": "2026-02-05 03:18:37",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3mi856",
          "author": "agm_93",
          "text": "honestly for my first 10 it was a lot of manual work - i spent hours finding people talking about the exact problem i was solving on reddit and other communities, then reaching out directly. it's time consuming but you get real feedback and those early customers actually care about what you're building.\n\nfor context, i built inreach (a chrome extension) specifically because that manual search process was eating up so much of my time, but the direct outreach approach itself is what worked to get those initial customers.",
          "score": 3,
          "created_utc": "2026-02-04 23:45:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3nqf4a",
          "author": "algatesda",
          "text": "You want story how to get first customer in Ad tech space or any other space /industry?",
          "score": 2,
          "created_utc": "2026-02-05 03:59:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3puff0",
              "author": "InevitableSense7507",
              "text": "Not first we're past that just wanted to hear your stories",
              "score": 2,
              "created_utc": "2026-02-05 14:01:24",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3puu7d",
                  "author": "algatesda",
                  "text": "I reached out to my contacts who is potential to give business and then I joined in a referral network .Then I defined my ICP to outreach to whom my expertise and solution will help them.Once I setup my outbound system I can able to reach $6K MRR for my service business",
                  "score": 2,
                  "created_utc": "2026-02-05 14:03:42",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3u2ayy",
          "author": "KissyyyDoll",
          "text": "Congrats on the progress! 2k monthly is a solid start.\n\nFor us, it was all about LinkedIn outbound but in a very low key way. I didn't send pitches. I just messaged people in my niche asking for a quick feedback call on a specific feature I was building.\n\nMost people are happy to give advice if you don't try to sell them something right away. Out of every 10 calls, maybe 2 would ask \"so how much does this cost?\" and those became the first customers. It’s a grind but it builds a better product too.",
          "score": 2,
          "created_utc": "2026-02-06 02:49:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3u329m",
              "author": "InevitableSense7507",
              "text": "Dude this is great advice!",
              "score": 1,
              "created_utc": "2026-02-06 02:53:50",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o3u35jq",
              "author": "InevitableSense7507",
              "text": "We’re already doing LinkedIn Outbound so that would be useful to incorporate into our flow",
              "score": 1,
              "created_utc": "2026-02-06 02:54:21",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3vulfh",
          "author": "Nihcas_Sachin",
          "text": "try finding first degree connects of founders, investors, customers, employees who could be within your ICP",
          "score": 2,
          "created_utc": "2026-02-06 11:28:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3wsw9u",
              "author": "InevitableSense7507",
              "text": "👏",
              "score": 1,
              "created_utc": "2026-02-06 14:55:49",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3wn1e8",
          "author": "No_Item_1508",
          "text": "Yup, generally agree with the above comments, the first 10 will come from 1st and 2nd degree connections. You need to ask for intro’s, leverage connections and most important ASK QUESTIONS and try to solve their problem not sell your product.",
          "score": 2,
          "created_utc": "2026-02-06 14:25:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3wsuml",
              "author": "InevitableSense7507",
              "text": "💯",
              "score": 1,
              "created_utc": "2026-02-06 14:55:35",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3q9h5q",
          "author": "Intrepid_Boss9449",
          "text": "I found my first 10 customers by hunting down niche Reddit threads where people openly asked for help or solutions related to my product. I just dropped honest, helpful comments and followed up with DMs only if they showed interest. Tools like SocListener can speed this up by finding those posts and suggesting what to say, so you don’t waste time searching or guessing.",
          "score": 1,
          "created_utc": "2026-02-05 15:20:10",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qwdlnr",
      "title": "How are you scaling outbound research without burning time or money?",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qwdlnr/how_are_you_scaling_outbound_research_without/",
      "author": "Comfortable-Camera60",
      "created_utc": "2026-02-05 06:14:55",
      "score": 6,
      "num_comments": 16,
      "upvote_ratio": 1.0,
      "text": "I am a founder doing outbound for a **mid-market / enterprise B2B product**, and I am stuck on the research layer.\n\n**Context:**  \nWe run account-based outbound, and for each account we try to understand:\n\n* What the company actually does (beyond buzzwords)\n* Who they sell to (b2b vs b2c)\n* Whether they are even worth a sales conversation\n\nIn our case, there is an added wrinkle: We target companies that **actively host or participate in events**. This signal is often **not obvious from the website** and requires going deeper into LinkedIn activity, event pages (Eventbrite, Meetup, etc.), and team behavior.\n\nCurrent setup:\n\n* Apollo for sourcing accounts and enriching emails + phone numbers\n* Lemlist for sequencing\n\nWe experimented with ChatGPT & Claude to do deeper company research (website + LinkedIn + event footprint). It works well for deep dives, but doing this **one account at a time does not scale**, and running detailed prompts across hundreds of accounts gets expensive quickly.\n\nWe explored Clay to automate enrichment and research, but at our stage it feels **hard to justify purely on cost**, especially while we are still refining what “good research” looks like for our niche.\n\nWhat I am trying to learn:\n\n* How are you doing **company-level qualification at scale**, especially when signals go beyond the website?\n* Are you using tools, custom scrapers, outsourcing, or hybrid workflows?\n\nNot looking for a perfect tool. Just trying to learn how others have solved this in practice.",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qwdlnr/how_are_you_scaling_outbound_research_without/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o3o97u1",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-05 06:14:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3oa7a3",
          "author": "Own-Skin-354",
          "text": "We ran into this exact wall in ABM outbound. The mistake we made early was trying to fully “research” every account before first touch. That doesn’t scale. Now we split the research into two layers.\n\nLayer 1 = cheap filters at scale. We only check signals that can be pulled fast... tech stack, hiring pattern, LinkedIn activity level, recent funding/news, role density in the target function. That gets us from 1,000 → \\~150 decent accounts.\n\nLayer 2 = deep research only after a trigger. Example: they open multiple emails, reply, or match 2–3 intent signals. Only then do we do the deeper dive... events, partnerships, community presence, etc. Humans + AI together here is fine because the volume is lower.\n\nFor event/activity signals specifically, we’ve had better luck tracking people signals instead of company pages... speakers, partnership managers, community leads... their posting behavior is often more revealing than the website.\n\nNet effect: research happens progressively, not upfront. Saves a lot of time and tool cost.",
          "score": 2,
          "created_utc": "2026-02-05 06:23:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3oi0nu",
          "author": "stephan85",
          "text": "When I'm looking for specific behavioral signals like event hosting, traditional firmographic data often falls short. I've tried a few different approaches for this, and for identifying companies with specific early traits, tools like New Business Radar can be interesting because they surface new businesses shortly after domain registration.\n\n\n\nWhile it's not a direct match for finding event hosts, I've also found ZoomInfo and Clearbit helpful for broader data enrichment, though they might require more manual digging for those specific event signals you're tracking. For your specific event-hosting criteria, I'd consider a hybrid approach: maybe use AI for initial broad sweeps of LinkedIn or event platforms, then layer in a human touch for final qualification on a smaller, more refined list.",
          "score": 1,
          "created_utc": "2026-02-05 07:32:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3z691q",
              "author": "Character_Cable_1531",
              "text": "Firmographics are almost useless once you’re hunting behavior, not category. What I’ve seen work better is flipping the flow: Start from where the behavior happens (LinkedIn events, Luma, Eventbrite, Meetup, webinar landing pages) rather than from the company record, then enrich after you’ve spotted the signal, not before.\n\nZoomInfo / Clearbit are fine for filling in gaps once you’ve already identified the account, but expecting them to surface something like “recently hosted an event” is asking them to do judgment they’re not designed for.\n\nThe hybrid approach you mentioned is basically unavoidable right now:  \nAI to sweep wide and flag weak signals,  \nthen a tighter human pass to decide if the signal is real, recent, and actually relevant to why you’d reach out.\n\nThe hardest part isn’t finding more signals, it’s deciding which ones are defensible enough to act on and which are just noise. That decision step is where most lead research quietly breaks down.",
              "score": 1,
              "created_utc": "2026-02-06 21:48:52",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3omdqo",
          "author": "JunaidRaza648",
          "text": "Some people use LinkedIn ads. People who interacted with your ads can be your prospects.",
          "score": 1,
          "created_utc": "2026-02-05 08:13:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3p8cc7",
          "author": "DamienBreneliere",
          "text": "I understand the desire to be specific with the targeting but it can be very complex and time consuming. \n\nThere's a simple alternative: targeting large, not doing custom research and just adapting your copy so that you'll filter the leads based on replies. \n\nIt's a bit like instead of searching for a needle in a haystack, just burn the haystack and the needle will be obvious.",
          "score": 1,
          "created_utc": "2026-02-05 11:37:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3qa8y8",
          "author": "Intrepid_Boss9449",
          "text": "For scaling research on event participation, I’d suggest building simple scrapers for event sites and LinkedIn to pull key data automatically. Outsourcing some of the manual digging to freelancers who can flag good accounts also helps keep costs down. Tools like Apollo are good but don’t cover event signals well, so you might need a custom mix until you find a solid pattern.",
          "score": 1,
          "created_utc": "2026-02-05 15:23:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3s0kam",
          "author": "Botsplash",
          "text": "We’ve run into this too, and the only thing that’s really scaled is a hybrid approach.\n\nThe mistake is trying to do deep research on every account. What works better is using cheap, lightweight signals to narrow the list first, then doing deeper AI or manual research only on the short list that has been created. AI is great at summarizing and scoring once you’ve surfaced raw data, but it gets expensive and messy if you ask it to discover everything.\n\nDirectionally correct is usually enough for outbound. Automate to reduce volume, use AI to synthesize, and keep humans for sanity checks and to make sure eveything looks accurate .",
          "score": 1,
          "created_utc": "2026-02-05 20:12:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3z5oo8",
          "author": "Character_Cable_1531",
          "text": "Really interesting to see this. I did a post about this a few days ago and saw that loads of people are having the same problem of lead research taking up their time, and that its difficult to know which angle to take into outbound. Trying to see if they host events is difficult, but honing on research on an individual, company and industry level can get you a good idea of their position. I use some workflows to cut this down so i can gather info from as many sources as possible. Whats your current stack for researching, or do you still not have an affordable setup?",
          "score": 1,
          "created_utc": "2026-02-06 21:46:02",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qs4tfe",
      "title": "Best personal brands -B2B Founders/Marketers",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qs4tfe/best_personal_brands_b2b_foundersmarketers/",
      "author": "Shre_Marketing",
      "created_utc": "2026-01-31 15:11:15",
      "score": 6,
      "num_comments": 4,
      "upvote_ratio": 1.0,
      "text": "Hey everyone \nI was wondering if there are any Founders/Marketers/Executives whose personal brand you really enjoy seeing on LinkedIn or any other platform?\n\n\nThese are my favorites:\n\n1. Jess Cook (Vector) - Relatable, shares great marketing tips and always puts her product first\n2.  Marie Martens (Tally) - Customer first approach and a great example of how to build-in-public \n3. Tom Orbach (Wiz.io) - Amazing marketing tips and always sneaks in examples from his own experience at Wiz \n\nAny others you really like?\n\nP.S. just realised all my favorites are marketers ",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qs4tfe/best_personal_brands_b2b_foundersmarketers/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o2ssrrc",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-31 15:11:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2z3190",
          "author": "Admirable_Swim_7805",
          "text": "jess cook is legit, her stuff is practical not fluff. for founders trying to build personal brands ive found the best approach is auto onboarding new connections. scrapes connects, scores them by role and industry, drips crm nurtures with their pain specific tips from your old posts. one founder i worked with saw traction in 4 weeks, 15 percent reply on founder content when we matched pain points to connection triggers. carousels crushed it way more than video for us",
          "score": 2,
          "created_utc": "2026-02-01 14:26:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2z59g8",
              "author": "Shre_Marketing",
              "text": "Interesting. I have heard lately that LinkedIn is trying to incentivize carousel creation over video.",
              "score": 1,
              "created_utc": "2026-02-01 14:38:42",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2t06os",
          "author": "[deleted]",
          "text": "[deleted]",
          "score": -3,
          "created_utc": "2026-01-31 15:48:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2t25of",
              "author": "Shre_Marketing",
              "text": "I am sorry but I am not sure I understand what you are trying to say",
              "score": 1,
              "created_utc": "2026-01-31 15:57:36",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qw6p4n",
      "title": "How do you market a B2B product when the users don’t even know they need it",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qw6p4n/how_do_you_market_a_b2b_product_when_the_users/",
      "author": "kevinbaur",
      "created_utc": "2026-02-05 00:52:44",
      "score": 5,
      "num_comments": 51,
      "upvote_ratio": 0.86,
      "text": "Hello, I’m Kevin, a software developer who has been self-employed since summer 2025 and has been working on a product ever since.\n\nLike many developers, I (apparently) made the mistake and thought my product is so great that the users will come... all the people I told about it were immediately “ah, that sounds super useful, if that works well, many industries will certainly use it”.\n\nSo I thought great, everything waterproof, so I just have to code it cleanly and it works. In November I was done so far, the result pretty good.. since it works with ai and only a new model appeared, I thought everything is clear, if I switch to the model, the thing will be even better, that can only run well!\n\nSo the first step, switch on Google Ads! After a few hundred euros came the disillusionment, not a single registration...\n\nI think it was because I didn’t specify my product and competed with big customers but they offer a completely different product so I have my keywords etc. Adapted and now hope for improvement.\n\nUnfortunately, I noticed today that almost no one is looking for this problem, probably also because no one knows they need it, because it doesn’t exist yet...\n\nI mean, who thought I needed a car before the car was invented. Or I need socks, etc.\n\nI can’t use strategies like X or reddit either, there are hardly any posts about it, or they are already light years old and no one answers them anymore...\n\nAre there any proven techniques this far? Should I switch to cold outreach?\n\nThank you. Kevin",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qw6p4n/how_do_you_market_a_b2b_product_when_the_users/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o3mufrc",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-05 00:52:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3mvuf8",
          "author": "dOdrel",
          "text": "hard to say anything without knowing your product, but if you think they don't know they need it, that probably means they don't need it. they either have an other solution to the problem, or the problem is not painful enough for them to solve.\n\nfocus on your ICP. get 5-10 of them and talk with them about the problem. you'll have a better sense then. I recommend you to read \"do things that don't scale\" by paul graham",
          "score": 6,
          "created_utc": "2026-02-05 01:00:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3olybk",
              "author": "Right-Influence-2460",
              "text": "I agree with this, and Ive seen another pattern too: when founders think nobody is searching for this, its often because the pain shows up as workarounds and frustration, not as a named problem. People talk about the symptoms long before they articulate the need. Early traction usually comes from finding those conversations rather than trying to force demand through ads.",
              "score": 3,
              "created_utc": "2026-02-05 08:09:06",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3owxkv",
                  "author": "kevinbaur",
                  "text": "Well, it could also have been that some customers immediately jump on the advertisement, who knows that in advance without keyword analysis etc.",
                  "score": 1,
                  "created_utc": "2026-02-05 09:55:26",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            },
            {
              "id": "o3myvym",
              "author": "kevinbaur",
              "text": "I understand what you mean, I’ve been dealing with it for a while and I’ve already asked myself the question of whether it’s actually just trash...\n\nIt is a tool to secure knowledge when an employee is leaving the company, which should not replace offboarding, but rather complete it. Companies already have processes to secure or produce documentation / instructions. But my tool captures implicit knowledge, which is in the heads of the employees and which is not written down normally. For example, who has to be called if the system collapses at night.\n\nI already have (through contacts) introduced it to consultants I know, but since the use case occurs rather acutely when someone leaves the company immediately, it is also not so easy to sell in my immediate environment.\n\nMy strategy would be to write to companies that have just advertised a position for a suitable position with a lot of implicit knowledge (senior level for example) and to ask if they would like to test it with the leaving employee.\n\nMaybe I’m just too careful and I should tell everyone about it and write to everyone I know to sell the whole thing... I’m just not a marketing expert (yet)\n\nThanks for the book recommendation, I’ll take a look at that!",
              "score": 1,
              "created_utc": "2026-02-05 01:18:11",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3n7c5p",
                  "author": "dOdrel",
                  "text": "i think you have a problem - solution fit hypothesis, but i’m not sure its actually validated. don’t focus too much on the original idea, this eg might be useful for consultants themselves to gather processes from existing employees (idk). just don’t skip the part where you get to know your customers deeply, it cannot be skipped with any amount of marketing or ads.",
                  "score": 1,
                  "created_utc": "2026-02-05 02:06:57",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o3weov4",
                  "author": "Even-Signature-5286",
                  "text": "**You could try SEO strategies as below:**\n\nWrite detailed blog posts that address specific pain points: why you should secure an employee's implicit knowledge when he's leaving, how to offboard an employee smoothly, best way to offboard an employee; and position your product as the right solution.\n\nIf you have big competitors and your product addresses a specific problem; you have a chance to attract people looking for alternatives to the competitor. You write detailed comparison posts like 'your product' vs competitor's product.\n\nYou can also create posts like 'alternatives' to competitor's product and position your product as the right alternative. These posts have high buying intent and convert quite well.\n\nPromote these posts via paid advertising till you get organic traffic.",
                  "score": 1,
                  "created_utc": "2026-02-06 13:41:16",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o3p5ye5",
              "author": "RedditSayWhatNow",
              "text": "Agreed, reach out via LinkedIn or other \"Hey, I built this thing that does X and would really value your opinion on what could make it better.\"\n\nNext, figure out what are the risks of using you and meet those head on. New supplier = risk. Unproven product = risk. AI integration = risk.\n\nThen, catastrophise what happens if they don't use your product. After that, then you start selling.",
              "score": 1,
              "created_utc": "2026-02-05 11:17:48",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3pmrud",
                  "author": "kevinbaur",
                  "text": "Thanks I try this already on my landingpage, but you mean I should directly communicate the risks also in the dialog, right?   \nSounds like a good strategy, thanks a lot.",
                  "score": 1,
                  "created_utc": "2026-02-05 13:17:52",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3nd9ev",
          "author": "Choice_Bee_1581",
          "text": "Marketing 101. What problem are you solving for them.",
          "score": 2,
          "created_utc": "2026-02-05 02:40:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3ox73j",
              "author": "kevinbaur",
              "text": "Yeah it’s hard to define, because if you hear knowledgemanagment and offboarding you are thinking on specific tasks, return your laptop for example\n\nWith today’s attention span, many there already switch off directly “we already have”, “not another hr tool”",
              "score": 1,
              "created_utc": "2026-02-05 09:57:57",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3pcyz5",
                  "author": "Remotir",
                  "text": "Kevin, ask Claude or Gemini this, thank us later: \"whats the ROI impact when an employee with specialist, implicit knowledge leaves? What's the cost to the employer?\"",
                  "score": 1,
                  "created_utc": "2026-02-05 12:13:19",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3oftap",
          "author": "kiterdave0",
          "text": "You need to create your market. 1 Clearly defined the problem that you solve. 2 develop your ideal Customer profile or your Customer avatar. These are the people who are going to pay money to solve that problem with your product. 3 The first few are going to be a little harder to find. When you find them off the product for free, on the basis that they produce a testimonial and Video case study with you. 4 you turn the video case into a video ad which you run on Instagram and Facebook. 6, you nurture these people interact with your ad using remarking to make sure they fully understand the problem the other problems and the value proposition. 7. If that doesn’t work find a bigger problem and build a new product.",
          "score": 2,
          "created_utc": "2026-02-05 07:12:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3ppcfq",
              "author": "kevinbaur",
              "text": "Yes, you are pointing at something I have been thinking about for quite a while.\n\nRight now, the first process, securing the implicit knowledge of an employee and creating this handover report, is completely free. You can use all features without any limitation. In the end, you get the report with no watermark or restriction. It is simply the full functionality for free.\n\nAnd I think that this might actually scare people off. It is a new product. I have almost no testimonials or reviews. Nobody really knows me. And on top of that, the whole thing is free.\n\nThen there is also the security aspect. Nobody knows me and nobody knows what I could theoretically do with the data. That everything is secure and encrypted and that even I cannot read the data is something no one can really verify from the outside.\n\nSo I am thinking that maybe I should remove the completely free access. Instead, when I do outreach through DMs, messages or emails, I could include a **voucher code**. Not to create pressure, but more like giving them the feeling that they are getting something valuable for free that would normally cost, for example, 69 euros.\n\nMaybe that changes the perception from “this is free and therefore suspicious” to “this is actually paid, but I am getting special access.”\n\nWould you say that I should change it like this and test that approach? In any case, thanks a lot. This is really helpful guidance and I will follow up on it.",
              "score": 1,
              "created_utc": "2026-02-05 13:32:48",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3rd673",
          "author": "LeadGenDotCom",
          "text": "For fun, put this prompt into ChatGPT: Cartoon-style illustration, clear left-to-right motion. A male office employee is walking OUT of an office through a door marked “EXIT”, moving from left (office interior) to right (outside). The man is shown in profile, facing right, with one foot already outside the doorway. He is holding a cardboard box WITH BOTH HANDS IN FRONT OF HIS CHEST, elbows bent naturally, containing a potted plant, a framed photo, and desk items. Behind him, also facing right and walking in the SAME direction, are three anthropomorphic symbols of knowledge: A book labeled “KNOWLEDGE” A cartoon brain A lightbulb All three knowledge characters are clearly walking OUT the door, following the man, not facing the office, not turned backward, not inside the room. The office interior (left side) looks dull and gray, with coworkers watching in shock from cubicles. The outside (right side) is bright and sunny, symbolizing departure and loss of institutional knowledge. Important constraints: Everyone (man + knowledge characters) faces the SAME direction (right). No objects are attached to the man’s back. No characters face the office. The box is physically realistic and held in front.",
          "score": 2,
          "created_utc": "2026-02-05 18:24:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3w6m6i",
              "author": "kevinbaur",
              "text": "That’s a really nice pic thanks 😉",
              "score": 1,
              "created_utc": "2026-02-06 12:54:26",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3tnizd",
          "author": "agonsenhauser",
          "text": "The problem with Google Ads here is that you are trying to capture demand that has not been created yet. In B2B, usually about 95 percent of your market is not looking to buy at any given time, so they will never even see your keywords. You should probably flip the strategy to demand generation by educating people on the hidden cost of brain drain and building your reputation before they actually hit an offboarding crisis.",
          "score": 2,
          "created_utc": "2026-02-06 01:21:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3w8ovn",
              "author": "kevinbaur",
              "text": "Thank’s I’ll try sounds good!",
              "score": 1,
              "created_utc": "2026-02-06 13:07:12",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3uxqm4",
          "author": "New_Grape7181",
          "text": "I've been in a similar spot where we built something innovative but realised people weren't searching for the solution because they didn't know it existed yet.  \n  \nGoogle Ads is tough for this because you're right, there's no search volume. Cold outreach actually worked better for us, but the key was leading with the problem, not the solution.  \n  \nInstead of \"here's my new AI tool\", I'd reach out to specific people in industries where you know the problem exists (even if they don't realise it yet) and describe the pain point first. Something like \"I noticed \\[specific observation about their workflow/industry\\], which typically costs companies X hours per week. We built something that addresses this, would you be open to a quick chat?\"  \n  \nFor us, showing became more important than telling. A short video showing the actual problem being solved in 30 seconds got way more traction than any written explanation.  \n  \nThe other thing that helped was finding adjacent communities. If people aren't talking about your specific solution, where are they complaining about related problems? Those frustrated comments are gold for understanding how to position what you've built.  \n  \nWhat industry are you targeting specifically?",
          "score": 2,
          "created_utc": "2026-02-06 06:28:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3w9thu",
              "author": "kevinbaur",
              "text": "That sounds great thanks for the information, I heard that now several times to post about the problem, not my solution. To be honest it sounds very obvious.. thanks for sharing your experiences, I’ll try to create a video and share it with a short explanation.\n\nMy tool is working universal, but thanks to this post and so many people suggesting specifying a niche is way easier to be successfull, I’ll try to niche down to property management! I have good connections in that industry and I know they have a lot of fluctuation.",
              "score": 1,
              "created_utc": "2026-02-06 13:13:58",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3yp7q2",
                  "author": "New_Grape7181",
                  "text": "Yep makes much more sense. There's a reason everyone is hammering down on that, it works!  \nGive me a shout if you'd like any pointers on the video outreach, we do that a lot so have tested most scenarios",
                  "score": 1,
                  "created_utc": "2026-02-06 20:23:52",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3n5oum",
          "author": "B2BScaler",
          "text": "Market education is first step to selling when it isn't a blaring obvious problem and paying for mass impressions to intake info from educational, issue-highlighting content then utilizing retrieving campaigns to further engage those users is expensive at times, and definitely can be quite the process to \"trickle charge\" your user base. \n\nI have a client right now I am solving the client acquisition problem for once and for all in the SaaS sector with an aggressive, ambitious, and direct approach utilizing a high ticket price point and sandbox back end one on one model. \n\nMessage me and I can break down the alternative school or thought further. \n\nGet a few clients on board, prove concept, go loud with case studies that back the claim.",
          "score": 1,
          "created_utc": "2026-02-05 01:57:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3o7mlc",
          "author": "h_2575",
          "text": "I know this, great Idea and solution, but how to get in front of clients and convince them.\n\nI would try to find related problems. But problems that occur in workflows. This makes paying for some solution more obvious. But also ask if people are used to pay for tools in this context. If not, you have a lot of headwind. \n\nCan you check related stuff in YouTube, insta and tiktok or pinterest? Are people there to talk about your original problem?",
          "score": 1,
          "created_utc": "2026-02-05 06:01:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3po2bv",
              "author": "kevinbaur",
              "text": "Well, this is exactly the problem. Most people do not even realize that this is something you could actually secure.\n\nWhen people talk about offboarding, it is usually just about what happens at the very end. I already did surveys on this. When you ask when a tool to secure knowledge should be used shortly before someone leaves, the first answer is always that if you only start when the employee resigns, you have already lost. That is far too late. It has to be done continuously.\n\nAnd I get that. Guides are important. Documentation is important. I do not want to replace any of that. I am not trying to explain the how. I want to talk about the why.\n\nOf course I can google offboarding and onboarding and how to do it properly. And what shows up are checklists and other tools that automate offboarding tasks, like removing users from accounts and similar things.\n\nThe real issue is that if I use offboarding and onboarding keywords, I end up competing with very large companies where I simply have no chance and just disappear. It is not only my opinion. Several SEO tools compare the keyword difficulty with my domain rating and basically confirm this.\n\nMaybe I am overthinking it and trusting those tools too much. That is why I am here in this forum asking you for help.",
              "score": 1,
              "created_utc": "2026-02-05 13:25:25",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3qkx5i",
                  "author": "h_2575",
                  "text": "I have worked in large companies myself. They usually have set processes, and if you're lucky, you might receive some training. But 99% of learning is on the job. If someone with know-how disappears, a new person just has to figure it out if no one else knows how to solve the problem. Sometimes people are happy with some staff turnover as it reduces the overall payroll or helps to improve/adapt. If it's not mission critical, who cares about new small inefficiencies? People are different anyway. Sometimes they organize the luxury of overlapping employment and real transfer. But even then, edge cases always arise that require improvisation.\n\nSo, in your case, I would look for areas where knowledge transfer is mission critical. These could be areas such as healthcare, firefighting or production, where people are hard to find and require years of professional training. B2B sales between larger companies (account management) are also a good fit, because they must have a smooth transition in front of their customers.\n\nAs I recall another example, a HR startup for feedback and onboarding (Leapsome) started with him (one of the co-founders) organizing the code and her (the other co-founder) travelling and selling, mostly providing inspiration to other startups on how employees should be treated in companies, how feedback should be organized, and the effect that a positive culture and trust have on a company's performance. I.e. you may find an angle that lets companies save costs or boost growth, and which is believable.",
                  "score": 1,
                  "created_utc": "2026-02-05 16:13:31",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3ojz44",
          "author": "Responsible-Brick881",
          "text": "Forget about marketing it for now, or at least paid media...get out and sell it!\n\nDM every single connection and follower you have on LinkedIn. \n\nPost about your industry insight, observations of the problems you see (that your product solves) without selling the product.\n\nEven post what it is here - somebody might reach out to find out more",
          "score": 1,
          "created_utc": "2026-02-05 07:50:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3pomh6",
              "author": "kevinbaur",
              "text": "Yes, thanks, that is actually a really good idea.\n\nI have already dropped everything related to paid media anyway. I just feel like I am far too inexperienced to really know what makes sense there, how to read the metrics and how to optimize things properly.\n\nI started posting about my industry insights and the problems I see on LinkedIn about two or three weeks ago. I am just doing two or three posts a day and keeping at it. Most of it just stays within my current followers, but I keep going and hope that at some point I reach some kind of bubble.\n\nIt is also quite hard to really get into communities like HR or leadership where many employers and decision makers are active and exchange ideas.\n\nAnd you are actually right. It helps to simply write about it openly. Someone has already reached out to me because of one of those posts, so maybe this will turn into something.\n\nThanks in any case. It is really reassuring to hear that what I am doing is not completely wrong.",
              "score": 1,
              "created_utc": "2026-02-05 13:28:38",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3pqwxu",
          "author": "big_whale_goes_laps",
          "text": "Whatever you do, don’t start with “creating your category” - that’s the worst thing a startup can do (I’ve lived through a few of those myself + I do SEO for work, so I can tell you it never ends well). If you still have some extra cash left, go and google “B2B research platform” (I’m not sure what’s the policy here with recommending tools so I’d rather not risk it but there are plenty). These platforms let you interview a segment of your potential target audience to validate your product-market fit. Once you do that, aka validate your audience and the pain they have, you can start thinking about how you want to market your solution. Or you might realize that your idea needs tweaking to have actual payable customers, and that’s also fine and happens more often than all of us would like to admit. In any case, better start with evaluating demand for your solution.",
          "score": 1,
          "created_utc": "2026-02-05 13:41:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3qckvy",
          "author": "vin2502",
          "text": "I have made this mistake as well. and it’s a classic fit solution to problems rather than find problems and build solution for it. focus on the problem first",
          "score": 1,
          "created_utc": "2026-02-05 15:35:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ql83k",
          "author": "DudeWaitWut",
          "text": "Skip the ads. Focus on:\n\n**1. Direct outreach** \\- Identify companies that would benefit most and reach out directly. You can do this manually, or if your budget supports it, use something like Apollo to build out sequences. Just don't mass spam people. I would suggest starting small and coming up with a target list of people (maybe 25-50 contacts).\n\n**2. Content marketing** \\- Write blog posts targeting specific keywords for your product or that your target buyers might search. Focus on high-intent searches that you can actually rank for (search terms that are more likely to lead to immediate conversion/shows someone has an active need). Ahrefs can help you find low difficulty keywords. It will be tough to rank when you're just starting out, but be consistent and give it time.\n\n**3. Improve your website** \\- Make it problem-focused, not product-focused. Help visitors realize they have this problem before pitching your solution. Add videos showing your product, how it works, etc.",
          "score": 1,
          "created_utc": "2026-02-05 16:14:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3wdaqw",
              "author": "kevinbaur",
              "text": "Thank you! I’ll give it a shot!",
              "score": 1,
              "created_utc": "2026-02-06 13:33:39",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3ry1hy",
          "author": "ConstantAnywhere8463",
          "text": "Pain points. Identify what pain point it solves for them. Show them that they need it.",
          "score": 1,
          "created_utc": "2026-02-05 20:00:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3w6780",
              "author": "kevinbaur",
              "text": "Alright I’ll try thanks!",
              "score": 1,
              "created_utc": "2026-02-06 12:51:49",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3srm1t",
          "author": "andrewkass",
          "text": "Google ads may be the wrong channel, you may target wrong people. When was the last time you clicked on sudden google ands pulled your wallet and paid immediately? Why other people should do so? General advice: make explanatory content that clarifies the problem and the solution, in a form of articles, YouTube videos. YouTube can help you find even super ultra niched geeks and pull them from the whole world. Complex topics need complex multi-step funnels: awareness - interest - consideration - evaluation - decision. You have to pass them all!",
          "score": 1,
          "created_utc": "2026-02-05 22:23:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3w5zyz",
              "author": "kevinbaur",
              "text": "First process is free, you don’t even need the credit card. It’s not like clicking -> spending money\n\nBut thanks for the advice I think that’s a fair point.. I could mention some studies and inform instead of trying to pitch a solution if the problem is not known…",
              "score": 2,
              "created_utc": "2026-02-06 12:50:33",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3xvk1h",
                  "author": "andrewkass",
                  "text": "it would be probably the same efforts if you either sell it by taking credit card or just expect users to signup, my idea is that you have to teach users about the problem by producing numerable education materials and distributing it online via various social media",
                  "score": 1,
                  "created_utc": "2026-02-06 18:00:23",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3vllo9",
          "author": "structured-pm",
          "text": "Are you consistent on any platform such as LinkedIn? I ask because I have been going through the same situation with a product I created. The secret has been consistency in educating my network/target audience on the topic I specialise in, the pain points my product tackles and the value my clients would get by using it. \n\nIt isn’t a quick fix, it’s building rapport, networking, posting regularly (even through the noise at first) and keep upgrading your skills, content trial and error until it gets engagement, message your target audience privately, etc.\n\nOffer a couple of ideal clients the opportunity to get it for free for a trial, and ask them to give you their feedback/testimonial. You’re testing the product, getting market fit intel directly from your ideal market, and testimonials which are more effective than any ads you can pay for at this stage. \n\nTalk about what value it gives people: “save 10 hours weekly on new staff training by getting your previous employee’s knowledge during their off boarding process.”",
          "score": 1,
          "created_utc": "2026-02-06 10:09:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3w8krk",
              "author": "kevinbaur",
              "text": "I try to be consistent on linkedIn, now after three weeks a rather sober result, posts have an average of 20 impressions.. but I continue maybe it will get better and it does not cost me much time... I think, if someone is interested he at least has some material to read\n\nThank you for your time",
              "score": 1,
              "created_utc": "2026-02-06 13:06:32",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3y2eml",
                  "author": "structured-pm",
                  "text": "To make it easier, I take the afternoon on Fridays or Saturdays to create all the context for the following week. So I create and schedule my posts. I realised it can take over your entire life if you create content as you go. And remember to stick to your branding (if you don’t have a branding strategy yet, you should get one) because people need to be able to recognise your content from the first glance.",
                  "score": 1,
                  "created_utc": "2026-02-06 18:32:51",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}