{
  "metadata": {
    "last_updated": "2026-02-02 09:09:57",
    "time_filter": "week",
    "subreddit": "b2bmarketing",
    "total_items": 20,
    "total_comments": 277,
    "file_size_bytes": 259569
  },
  "items": [
    {
      "id": "1qqalxx",
      "title": "Does the B2B data pricing model even make sense anymore?",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qqalxx/does_the_b2b_data_pricing_model_even_make_sense/",
      "author": "noobCoder00101",
      "created_utc": "2026-01-29 14:51:22",
      "score": 47,
      "num_comments": 36,
      "upvote_ratio": 1.0,
      "text": "I’ve been looking at tools to help with our sales, and the pricing is crazy. It feels like there is no in-between. You either have to use free tools with bad accuracy, or sign a massive contract for tens of thousands of dollars before you even start.\n\nHas anyone found a decent way to get reliable data that doesn't cost a fortune? We need good data, but aren't at the stage where a $15k ZoomInfo commitment makes sense yet. ",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qqalxx/does_the_b2b_data_pricing_model_even_make_sense/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o2f3qz6",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-29 14:51:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2fccba",
          "author": "Not_Average78",
          "text": "Y⁠ou a⁠ren’t p⁠aying f⁠or t⁠he d⁠ata i⁠tself, y⁠ou a⁠re p⁠aying f⁠or t⁠he p⁠latform’s U⁠I, t⁠heir s⁠eats, a⁠nd t⁠heir b⁠undled f⁠eatures. I⁠f y⁠ou a⁠re s⁠erious a⁠bout s⁠caling, y⁠ou n⁠eed t⁠o b⁠reak a⁠way f⁠rom t⁠he p⁠latform m⁠odel a⁠nd m⁠ove t⁠o a⁠ p⁠roper d⁠ata s⁠tack. H⁠ere’s m⁠y s⁠uggestion:\n\nW⁠orkflow L⁠ayer: U⁠se a⁠ l⁠ow-code a⁠utomation t⁠ool l⁠ike n⁠8n o⁠r C⁠lay (A⁠irscale/F⁠loqer a⁠re a⁠lso g⁠reat c⁠hoices) t⁠o m⁠anage t⁠he l⁠ogic, d⁠eduplication, a⁠nd y⁠our e⁠nrichment w⁠aterfall.\n\nT⁠argeting: U⁠se A⁠pollo (f⁠ree t⁠ier) o⁠r S⁠ales N⁠avigator t⁠o b⁠uild y⁠our i⁠nitial p⁠rospect l⁠ist (N⁠ame, T⁠itle, C⁠ompany U⁠RL)\n\nD⁠ata E⁠nrichment: Y⁠ou n⁠eed a⁠ r⁠eliable d⁠ata A⁠PI (l⁠ike P⁠eople D⁠ata L⁠abs o⁠r L⁠imadata). W⁠e u⁠se L⁠imadata’s E⁠nrich A⁠PI h⁠eavily f⁠or l⁠ive p⁠rofile d⁠ata a⁠nd b⁠ulk e⁠nrichment. S⁠olid a⁠ccuracy, a⁠nd w⁠ay m⁠ore f⁠lexible.\n\nV⁠erification L⁠ayer: R⁠un t⁠he o⁠utput t⁠hrough l⁠ightweight t⁠ools l⁠ike Z⁠erobounce, H⁠unter i⁠o, o⁠r D⁠ropcontact t⁠o v⁠alidate a⁠nd t⁠op o⁠ff. T⁠his k⁠eeps d⁠eliverability h⁠igh w⁠ithout i⁠nflating y⁠our s⁠tack c⁠ost.\n\nT⁠his w⁠orkflow e⁠nsures h⁠igh d⁠eliverability a⁠nd I⁠t’s w⁠ay c⁠heaper w⁠ith n⁠o l⁠ock i⁠n. H⁠appy t⁠o s⁠hare t⁠he n⁠8n j⁠son t⁠emplate f⁠or t⁠he w⁠orkflow t⁠hat i⁠ u⁠se f⁠or m⁠y a⁠gency. D⁠M m⁠e i⁠f y⁠ou w⁠ant t⁠he s⁠etup.",
          "score": 4,
          "created_utc": "2026-01-29 15:31:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2gi0b8",
              "author": "noobCoder00101",
              "text": "Just sent you a DM, would love to take a look at that setup",
              "score": 1,
              "created_utc": "2026-01-29 18:37:45",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2gi5q9",
          "author": "Fickle_Day_7150",
          "text": "The pricing doesn't make sense because the data itself is decaying faster than ever. A $20k seat usually just buys you a bigger list of people who are already being spammed by everyone else with that same seat. Instead of paying for contact info, we've seen much higher ROI by focusing on brand sentiment data. If you find out where your target audience is already complaining about a competitor (on Reddit or niche forums), you don't need a list of 10,000 names you just need the 10 who are active right now.",
          "score": 2,
          "created_utc": "2026-01-29 18:38:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2hmuuh",
              "author": "noobCoder00101",
              "text": "What’s your method for finding those active conversations?",
              "score": 1,
              "created_utc": "2026-01-29 21:51:07",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o316zm3",
              "author": "fishmatador",
              "text": "Catching people while they’re actively talking about a problem is way more actionable than blasting cold contacts.",
              "score": 1,
              "created_utc": "2026-02-01 20:24:02",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2gywjg",
          "author": "_forgotmyownname",
          "text": "It’s definitely getting ridiculous. I’ve noticed the same gap where you’re either stuck with manual scraping or a five-figure contract. There’s almost no middle ground for smaller teams.",
          "score": 2,
          "created_utc": "2026-01-29 19:56:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2his0i",
          "author": "medazizln",
          "text": "Finding a middle ground between trash data and a 5-figure contract is a nightmare. Honestly, the legacy data model is broken because they sell you stuff from 18 months ago. I usually stick to real-time research lists for specific campaigns so I'm not paying for 10k contacts I'll never use.",
          "score": 2,
          "created_utc": "2026-01-29 21:31:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2hp8ro",
              "author": "noobCoder00101",
              "text": "18 months might be a stretch, but with how fast people change jobs now, the decay rate is definitely a massive issue",
              "score": 1,
              "created_utc": "2026-01-29 22:02:24",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2hja4c",
          "author": "kubrador",
          "text": "the b2b data market is basically designed by people who've never had to justify a software expense to anyone. you're in the worst possible position - too small for enterprise pricing to work, too real for them to give a shit about you.\n\n\n\nyour best bet is probably scraping linkedin like a normal person or just building a list manually for now. i know that sucks but at least you'll know what you're actually getting.",
          "score": 2,
          "created_utc": "2026-01-29 21:34:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2hzu6z",
          "author": "ComfortableAny947",
          "text": "They know that once you're locked into their ecosystem, you won't leave. If you're under that $15k threshold, you're almost always better off using a combination of LinkedIn Sales Navigator and a targeted scraper/verification tool. It’s more manual, but the accuracy beats a bloated database every time",
          "score": 2,
          "created_utc": "2026-01-29 22:55:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2kux9d",
              "author": "noobCoder00101",
              "text": "True. Accuracy beats volume every time, but i'm still hoping there’s a way to automate the process without the hefty price tag. Looking into some custom workflows now to see if that’s efficient",
              "score": 1,
              "created_utc": "2026-01-30 10:21:56",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2fs25f",
          "author": "japhethsandiego",
          "text": "Crazy that you found anything to buy for 15k. Most SaaS platforms are starting at 70k these days.",
          "score": 1,
          "created_utc": "2026-01-29 16:41:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2gh7e4",
              "author": "noobCoder00101",
              "text": "70k? At that point, i might as well hire a full time researcher to manually find leads on linkedin lol\n\nare you guys actually paying that, or is that just the quote they're throwing at you?",
              "score": 1,
              "created_utc": "2026-01-29 18:34:07",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2gk9at",
                  "author": "japhethsandiego",
                  "text": "This highly context sensitive. 70k would be a bargain for any one of the many tools we have in our stack.",
                  "score": 1,
                  "created_utc": "2026-01-29 18:47:53",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2ijyiq",
          "author": "OkDependent6809",
          "text": "yeah the pricing is insane. we looked at zoominfo last year and it was like $20k minimum. we're not even sure if we'd use it enough to justify that.\n\nended up just using a mix of free tools and doing manual research for now. it sucks but at least we're not locked into a huge contract.\n\nthe problem is most of these companies optimize for enterprise deals not startups. they'd rather have one $50k customer than 10 $5k customers\n\nidk if there's a good solution honestly. maybe try apollo or lusha? they're cheaper but data quality is hit or miss",
          "score": 1,
          "created_utc": "2026-01-30 00:43:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2k3z02",
          "author": "supriya_l89",
          "text": "I completely understand B2B data pricing because it creates an insurmountable barrier which smaller teams cannot overcome. A few ways to bridge the gap:  \n  \nBusinesses should evaluate Apollo and Leadfeeder and Lusha as subscription-lite tools which provide affordable access to contact data and intent data through their basic service plans.  \n  \nThe use of freemium systems which combine LinkedIn Sales Navigator with a Chrome enrichment extension provides an effective solution for gap resolution.  \n  \nThe company should concentrate its efforts on creating high-quality content instead of producing excessive material which lacks value for their target audience.  \n  \nYou can obtain trustworthy data that produces useful results without needing to spend 50000 dollars at this time because a reliable solution exists in the market.",
          "score": 1,
          "created_utc": "2026-01-30 06:25:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2kinx3",
          "author": "Livid_Pace8596",
          "text": "yep, we’re basically still doing this the old-fashioned way — a bunch of interns manually digging through lists 😅",
          "score": 1,
          "created_utc": "2026-01-30 08:30:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2kk9rf",
          "author": "Lucky-One12020",
          "text": "Spot on this pricing gap. Most B2B data tools are built for enterprises, not teams that are still figuring things out. You end up paying for volume when what you actually need is relevance.\n\nI ran into the similar issue before, which is why we built Lessie. Instead of selling huge static databases, it uses semantic search to reason over profiles and review leads that actually match intent or context — not just titles or keywords.\n\nIt’s pretty SMB-friendly, and you can run an initial search for free to see if the output is even useful before committing to anything.",
          "score": 1,
          "created_utc": "2026-01-30 08:45:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2lee3h",
          "author": "InnerBuilding7949",
          "text": "You should always start with your funnel:\nAwareness -> Consideration -> Decision. \nI can tell by your nick name that you are selling Software, SaaS, or sort of. So if u are just established, you should focus on the Awareness stage, which is so-called branding, promotion,... Do markerting activities, outreach via Linkedin, getting raw data, networking at exhibitions and events,...and so on. Then you do the next step which is try to contact, discuss, meeting with clients, and so on.\nWhat you are doing here is to find more data because you think you dont have enough. Good things take time bro. Database purchasing is not a magic tool. You need to do step by step and control the performance of each stage. \nWish u good luck! \n\nDM if u want more insight from me. For free of course, i like to contribute to the community.",
          "score": 1,
          "created_utc": "2026-01-30 12:50:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ubudi",
          "author": "Glittering-Yak-3703",
          "text": "Yeah, this has been our experience too. The pricing feels designed for bigger teams, not small or early-stage ones.\n\nThat jump from free tools to a big annual contract is rough. We ended up mixing a few lightweight tools with some manual work just to get by.\n\nWhat kind of data are you actually most stuck on right now?",
          "score": 1,
          "created_utc": "2026-01-31 19:35:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2jfgyx",
          "author": "nachokings",
          "text": "Claude Cowork is surprisingly good at building lists and tracking down accurate info.",
          "score": 1,
          "created_utc": "2026-01-30 03:38:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2kv7vb",
              "author": "noobCoder00101",
              "text": "I’ll look into it, thanks",
              "score": 1,
              "created_utc": "2026-01-30 10:24:33",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2gpav9",
          "author": "Right-Will8093",
          "text": "If you're looking for better data to find more qualified leads, then we can help you find high-intent leads\n\nBut if you need an actual data system because you want your sales team to do prospecting too, then we can show you our system that:\n\n\\- Tracks new posts and comments in relevant subreddits and communities  \n\\- Monitors these posts for intent (whether they're actively seeking solutions or complaining)  \n\\- Puts these leads on a google sheet for you to reach out to\n\nIt's simple once you get the hang of it",
          "score": 0,
          "created_utc": "2026-01-29 19:10:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2hk7kb",
              "author": "noobCoder00101",
              "text": "Interesting approach, how exactly does this work in practice? is it keyword based or are you using something else to filter the posts?",
              "score": 1,
              "created_utc": "2026-01-29 21:38:33",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2hkxsa",
                  "author": "Right-Will8093",
                  "text": "So I built an automation that combines code-based filters which goes through our keyword list first,\n\nThen that data gets sent through a Claude model for intent analysis essentially \nYou want a quick demo?",
                  "score": 1,
                  "created_utc": "2026-01-29 21:42:01",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qsteye",
      "title": "How a B2B company makes millions with their tiny Youtube channel",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qsteye/how_a_b2b_company_makes_millions_with_their_tiny/",
      "author": "illeatmyletter",
      "created_utc": "2026-02-01 08:55:23",
      "score": 47,
      "num_comments": 15,
      "upvote_ratio": 0.93,
      "text": "I came across this breakdown and it completely flipped how I thought about YouTube. Figured it might be valuable for you as well.\n\nMost founders assume YouTube only works if you go big. Massive subscriber counts, viral videos, influencer-level reach. But this case study proves that's wrong, well at least for B2B.\n\nThere's a small company in immigration + tax optimization. Nothing sexy. Their average client pays around $2,000 though. Their YouTube channel has maybe 1,000 to 1,500 subscribers. And from that channel alone, they've booked 500+ sales calls. That's easily seven figures in revenue from what most people would call a \"dead\" channel.\n\nBut it gets crazier… They get only around 350 to 400 views per day. About 30 videos total. But they close roughly half their calls. They even spun up a second channel in another language with under 30 subscribers, and it already brought in multiple paying clients.\n\nThis is why B2B YouTube is a completely different game.\n\nSubscriber count is a vanity metric. What actually matters:\n\n* Who's watching: are they decision-makers or random browsers?\n* Why they're watching: are they actively looking for a solution?\n* How much one customer is worth: if a client pays $2k, $10k, or more, you don't need scale\n\nThe videos that drive revenue on this channel aren't flashy. They're boring, high-intent, search-driven stuff: \"how to get residency in X,\" \"best tax residency for digital nomads,\" country comparisons etc. These aren't entertainment videos. They're decision-stage videos, which means the viewer is already problem-aware and actively searching for a solution. That's why they convert.\n\nIf you're selling something where one customer is worth a few thousand dollars or more, obsessing over subscriber count makes no sense. A small channel with the right topics can outperform a larger audience watching for entertainment. The leverage comes from intent, not scale.\n\nI’d love to hear form other founders to see if you’ve had similar results? Have any of you tried YouTube as an acquisition channel? What results did you see?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qsteye/how_a_b2b_company_makes_millions_with_their_tiny/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o2xwjox",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-01 08:55:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2z1ey2",
          "author": "Admirable_Swim_7805",
          "text": "this is gold, been telling clients for years that subscriber count means nothing in b2b. set up a workflow for one that auto tracks intent keywords from youtube searches, tags who watches pricing videos, then triggers a custom outreach sequence same day. went from random views to booked demos. the magic is in connecting youtube watch data to your crm and treating every view like a warm lead not vanity metric. search intent content beats entertainment every time",
          "score": 4,
          "created_utc": "2026-02-01 14:17:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o32xtfk",
              "author": "Comfortable_Win4678",
              "text": "what tool do you use to auto track intent keywords and also get their email?",
              "score": 3,
              "created_utc": "2026-02-02 01:55:12",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o32ggto",
          "author": "GeneralNetwork1318",
          "text": "This is almost exactly what happened with us. We started posting decision-stage videos around topics our ICP was already searching for and the calls just started coming in. Took us a while to figure out what topics to focus on though. \n\nThe team we worked with (Represent Studio) helped us dial that in, and created a strategy for us that made all the difference. Since then we started closing clients consistently through YT.",
          "score": 5,
          "created_utc": "2026-02-02 00:17:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ytifk",
          "author": "DaCmanLou",
          "text": "💯 true. Not only your own channel. I got a year of clients from being a guest on a podcast that only got 220 views.",
          "score": 3,
          "created_utc": "2026-02-01 13:30:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o31brng",
          "author": "Kamel_Ben_Yacoub",
          "text": "True, for many of our B2B SaaS clients YouTube ads is actually their top-performing campaign type.\n\nSince we have seen pretty good results lately we’ve been pushing more clients to move some of their search paid budget into YouTube Ads. It works well when you know your audience. \n\nCPVs (Cost Per View) are still very cheap and most B2B SaaS advertisers still aren't taking advantage of the YouTube placement, sticking only to Google Search.\n\nOur go-to setup is using YT ads In-Feed placements to reach cold audiences and In-Stream ads for retargeting.",
          "score": 2,
          "created_utc": "2026-02-01 20:47:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2yh98n",
          "author": "No_Hedgehog8091",
          "text": "Spot on about search intent vs size. We tested this in SaaS - a single 'how to solve X problem' video with 800 views brought more enterprise leads than our viral 100k view product launch. High-ticket B2B is about being there when they're actively searching.",
          "score": 1,
          "created_utc": "2026-02-01 12:02:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o30b54b",
          "author": "AdamYamada",
          "text": "This reminds me Insurance Exam Queen. \n\n\nShe teaches people how to pass insurance exams. \n\n\nShe has made $1 million+ on her YouTube channel. \n\n\nIt's hyper focused content and she does a great job at teaching. ",
          "score": 1,
          "created_utc": "2026-02-01 17:56:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o31rmlh",
          "author": "OkDependent6809",
          "text": "this is actually smart and matches what i've seen work in b2b.\n\nwe tried youtube at my company for like 6 months. got maybe 200 subscribers, felt like a failure, stopped doing it. but looking back we were chasing views instead of targeting high intent searches.\n\nthe mistake we made was trying to make \"engaging content\" instead of just answering the exact questions our target customers were googling. boring works better for b2b.\n\none thing though. how do you figure out what high intent topics to cover? like how did that immigration company know which specific videos would drive calls? did they just guess or is there a way to validate topics before spending time making videos?\n\nwe wasted a ton of time making videos nobody searched for. would love to know how to avoid that.",
          "score": 1,
          "created_utc": "2026-02-01 22:04:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o348s0w",
              "author": "Content_Paths",
              "text": "Ask yourself what your clients have to go through (pain points, blockages...) so they'd decide to look for your solutions.\n\nEvery business solves a certain problem, your role should be to educate about that problem so you'd come up when people who have it look it up on YouTube or it'll be recommended to them when they're looking for something similar. For B2B channels, content strategy plays the biggest role in conversions (or at least in driving people further down your funnel). \n\nThe behind the scenes is to humanize the channel and get people to know you and your process a little more. It's also great for the warmest prospects amongst your audience who just need a little push to decide.\n\nHope this helps, let me know if you have any other questions. We're a YouTube video editing agency for coaches and business owners and I'd be happy to support however I can. No strings attached.",
              "score": 1,
              "created_utc": "2026-02-02 07:13:49",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o32fd32",
          "author": "KissyyyDoll",
          "text": "Subscriber count is cope for B2B - search intent and deal size are the only metrics that matter",
          "score": 1,
          "created_utc": "2026-02-02 00:11:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o33s26h",
          "author": "jfrancai",
          "text": "Curious, what's the average time to close from video view to booked call? Would be interesting to see if there's a pattern in which specific video topics convert fastest.",
          "score": 1,
          "created_utc": "2026-02-02 04:58:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o349jyf",
          "author": "Content_Paths",
          "text": "I'm building my agency entirely around that 😆 since COVID people are trusting video content more and more, and what people fail to understand is that YouTube is not an entertainment platform, it's a unique search engine where people come to find solutions! And that's literally every business that exists because every business solves a certain problem for a specific audience.",
          "score": 1,
          "created_utc": "2026-02-02 07:20:45",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qnlqzb",
      "title": "How people are booking meetings before conferences",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qnlqzb/how_people_are_booking_meetings_before_conferences/",
      "author": "Putrid-Proposal-340",
      "created_utc": "2026-01-26 17:00:44",
      "score": 29,
      "num_comments": 17,
      "upvote_ratio": 0.88,
      "text": "I’ve seen a lot of posts lately about conferences being a waste of money, and I resonate with that. If you just show up and hope people walk by, it's going to be crickets 9 times out of 10.\n\nI came to the realization the conference itself isn’t where most of the value happens. The value happens *before* anyone even shows up, when people still have open calendars.\n\nWe tried pre event outreach using confirmed attendee data. Tried manual linkedin digging but that was useless, then we tried this PullAList service which collects verified conference attendee lists, believe it or not that got us two good opportunities in Vegas (CES) this year.\n\nThe difference between wandering in hopes of finding something and walking in with meetings booked is night and day.   \nWould love to see how many people already knew about this trick and gatekept",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qnlqzb/how_people_are_booking_meetings_before_conferences/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o1ulc85",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-26 17:00:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1uxtz2",
          "author": "AmbitionMean5170",
          "text": "Finding out who’s actually attending is the hardest part. This Pullalist thing seems interesting, they've hit a pain point with this one",
          "score": 5,
          "created_utc": "2026-01-26 17:55:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1unyms",
          "author": "Vegetable_Cap_3142",
          "text": "The difference between walking out with meetings vs a stack of cards is huge. Once you see it, it’s hard to justify doing events any other way.",
          "score": 2,
          "created_utc": "2026-01-26 17:12:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1v6ile",
          "author": "Clean-Hippo8232",
          "text": "During the show feels like the worst time to start conversations, if you land anything amidst that mess it's just sheer luck.",
          "score": 2,
          "created_utc": "2026-01-26 18:31:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1wadx6",
          "author": "Admirable_Swim_7805",
          "text": "this is honestly what ive been telling people for months now. conferences are way overpriced if youre just hoping to bump into the right person at a booth. the real play is reaching out before the event when everyones still planning their schedule and actually has time to respond. once everyone gets there its just chaos and everyone already has their calendar locked up.\n\n\n\nthe pullalist thing sounds interesting though. never heard of it but makes sense that theres a service for verified attendee lists. manual linkedin scraping is brutal and half the time people dont even have their company listed properly.",
          "score": 1,
          "created_utc": "2026-01-26 21:24:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1z2qbk",
          "author": "james-porter1",
          "text": "completely agree. conferences only feel like a waste if you show up without doing the groundwork. pre-event outreach to verified attendees is what separates people who get roi from those who don't.",
          "score": 1,
          "created_utc": "2026-01-27 06:49:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1z4v0v",
          "author": "Shre_Marketing",
          "text": "Have been using this for a few years. It is really hit and miss and depends on the event. Very rarely have there been occasions where people express interest to meet.",
          "score": 1,
          "created_utc": "2026-01-27 07:07:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1z6kqk",
          "author": "Surbhimarketing",
          "text": "Agree. Conferences only fail when you rely on foot traffic.\n\nReal ROI is decided pre-event, when calendars are still open. Targeted outreach to confirmed attendees changes the whole equation. You show up with meetings, not hope.\n\nConferences aren’t the problem. Lack of prep is.",
          "score": 1,
          "created_utc": "2026-01-27 07:22:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o23rnak",
          "author": "erickrealz",
          "text": "Pre-event outreach for conferences is absolutely the right move. Showing up cold and hoping for booth traffic is a waste of money and time. Our clients who get ROI from conferences always do outreach 2-3 weeks before the event to book specific meetings with target accounts who'll be there.\n\nThe attendee list thing isn't really gatekept, it's just that most people don't think strategically about conferences. They treat it like a networking lottery instead of a targeted sales opportunity. You can also scrape LinkedIn for people posting about attending specific events, or use intent data to find companies registering attendees, though buying verified lists is obviously faster.\n\nThe real trick is your outreach messaging. Don't just say \"hey wanna meet at the conference?\" That's lazy as hell. Reference why you want to meet them specifically, what problem you solve, and make it easy to book a 15-minute coffee slot at the event. Our clients booking 10-15 meetings per conference usually have 40-50% show rates, which beats random booth conversations by a mile.\n\nConferences are expensive so if you're gonna spend the money, treat it like a targeted campaign not a branding exercise.",
          "score": 1,
          "created_utc": "2026-01-27 22:28:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o286gk0",
          "author": "New_Grape7181",
          "text": "I've done this for a few events now and it completely changes the ROI. Showing up cold is such a waste.  \n  \nOne thing I'd add is layering in personalisation once you have that attendee data. We pulled lists for a conference last year, but instead of just standard email outreach, I recorded quick personalised videos for the top 30 prospects mentioning why I wanted to connect at the event specifically. Booked 8 meetings before we even got on the plane.  \n  \nThe key was being really specific about why meeting at the conference made sense, not just \"let's grab coffee\". Like referencing a talk they were probably attending or a product they'd see on the floor that related to their challenge.  \n  \nCold emails to conference attendees still feel spammy if they're generic. The fact you have the list is only half the battle.  \n  \nWhat kind of messaging are you using once you have the attendee data? Are you keeping it pretty straightforward or adding any hooks?",
          "score": 1,
          "created_utc": "2026-01-28 15:16:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1v5y5w",
          "author": "sagefrogmarketing",
          "text": "ROI shifts dramatically when the event becomes a deadline for pre-booked conversations instead of a gamble on foot traffic. The teams that win treat the conference as a forcing function for outreach, relevance, and timing, not the main attraction. Walking in with a calendar already full completely changes the economics of the event.",
          "score": 1,
          "created_utc": "2026-01-26 18:29:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1vra4e",
          "author": "Original-Bus-6172",
          "text": "We’ve tried manual linkedin research and list providers and just like you've said it felt useless, pullalist might be an option for the next event",
          "score": 1,
          "created_utc": "2026-01-26 20:00:07",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qni5yt",
      "title": "How to find customers for b2b ai product?",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qni5yt/how_to_find_customers_for_b2b_ai_product/",
      "author": "Not_trxctf",
      "created_utc": "2026-01-26 14:54:22",
      "score": 29,
      "num_comments": 57,
      "upvote_ratio": 0.98,
      "text": "Hello! I have ai b2b startup. Now i looking for customers.  My product is ai call centre. Where i can find customers?\nCan you share your experience in common cases? Do you know some platforms for such cases ",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qni5yt/how_to_find_customers_for_b2b_ai_product/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o1tskee",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-26 14:54:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1u04yb",
          "author": "Forsaken-Athlete-673",
          "text": "You built this startup before talking to customers? How do you even know you’re solving their problem? How do you know what the problem is and how to differentiate? \n\nI know this isn’t helpful for your query, but I think this should have been step 1. \n\nThat said, when you built this, who did you intend to have as a customer? Find one of those and ask them for 15 mins to show them a demo and get feedback. I think the more interaction you have with the intended businesses that you see as customers, the easier it will be (assuming you’re solving their problem).",
          "score": 10,
          "created_utc": "2026-01-26 15:29:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1vm0cy",
          "author": "Voltalyze",
          "text": "I don't usually give such gems, but I'll do it this time. \n\nThere are a ton of opportunities for you to get clients on the jobs websites. \n\nLook for call center operators jobs and reach out to the companies and offer them the solution. \n\nThey are already in need of a caller so you just need to position in front of them the right way. \n\n\nHey, if you find even a little value in this just upvote it, I am trying to rank up my account (no pressure)",
          "score": 10,
          "created_utc": "2026-01-26 19:37:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1yt7os",
              "author": "Amulyakumarr",
              "text": "A very good approach",
              "score": 2,
              "created_utc": "2026-01-27 05:35:27",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o1ytt80",
              "author": "realizingdata",
              "text": "Smart move",
              "score": 2,
              "created_utc": "2026-01-27 05:39:56",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1uk3a9",
          "author": "AutomaticSpell2889",
          "text": "Depending on the tool, email newsletter sponsorships can bring a ton of value. Focus on the small to mid-sized newsletter, avoid big ones for now. Make sure your ICP reads those newsletters, niche down as much as you can.",
          "score": 2,
          "created_utc": "2026-01-26 16:55:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1v82gg",
          "author": "theguywhobuilds",
          "text": "Start much narrower than you think, because most B2B AI products fail by trying to sell to “teams” instead of one person with one problem they already want gone.\n\nFigure out who actually feels the pain, when it shows up, and what they’re already trying, then show up in those same places , usually google when something breaks, linkedIn when they’re learning, and reddit when they’re sanity-checking tools.\n\nDon’t sell the AI part at all. talk about the problem and the outcome, because people buy relief, not models.\n\nOnce a few customers convert, trace exactly how they found you and repeat that path instead of trying to scale everything at once.",
          "score": 2,
          "created_utc": "2026-01-26 18:38:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1tt6dz",
          "author": "kubrador",
          "text": "cold email works if your product actually saves people money, which call center ai supposedly does. linkedin sales navigator + some basic research = free prospecting, beats paying for leads you'll probably ignore anyway.",
          "score": 1,
          "created_utc": "2026-01-26 14:57:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1tx1tb",
          "author": "GetNachoNacho",
          "text": "You’re asking the right question early. B2B AI products usually win by going narrow first, one clear industry, one painful problem, and direct conversations with real buyers.",
          "score": 1,
          "created_utc": "2026-01-26 15:15:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ty7v9",
          "author": "According_Nebula7936",
          "text": "finding b2b customers for ai call centers usually isn’t about platforms, it’s about targeting the right industries and decision makers. start by mapping businesses that rely heavily on calls — telecoms, support-heavy SaaS, insurance — then reach out directly or via linkedin. can explain more if you want??",
          "score": 1,
          "created_utc": "2026-01-26 15:20:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o22v87z",
              "author": "Not_trxctf",
              "text": "How i can find costumers in LinkedIn?",
              "score": 1,
              "created_utc": "2026-01-27 20:02:24",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1u51vt",
          "author": "Intrepid_Focus_6605",
          "text": "No of source of getting customers which has worked for me.\n\n1. Personal connects. Made them my design partner. Once problem's validated, converted them to paid customers.\n\n2. Attending events/meetups do convert.",
          "score": 1,
          "created_utc": "2026-01-26 15:51:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o22vd28",
              "author": "Not_trxctf",
              "text": "What kind of events/platforms? Where i can find them?",
              "score": 1,
              "created_utc": "2026-01-27 20:03:01",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2cpigx",
                  "author": "Intrepid_Focus_6605",
                  "text": "Luma/meetups",
                  "score": 1,
                  "created_utc": "2026-01-29 04:16:41",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1ufig6",
          "author": "SumitCasey",
          "text": "for B2B AI products like an AI call center, the key is finding companies that already rely on call centers or customer support at scale. Start by targeting industries like e-commerce, SaaS, telco, and fintech. LinkedIn is great for finding decision-makers (heads of support, ops, or CX). You can also check startup/job boards for companies hiring large support teams, that usually signals a need. Platforms like Product Hunt, AngelList, and industry Slack/Discord communities can help you connect with early adopters.",
          "score": 1,
          "created_utc": "2026-01-26 16:36:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ugryf",
          "author": "Admirable-Grocery-42",
          "text": "Eventually for almost any B2B startups the approach is the same:\n\n1) Outreach: cold emails + calls + LinkedIn outreach (depending on your industry)\n\n2) Posting valuable industry content on LinkedIn, X or any other place where your audience are\n\n3) Partnerships — collaborate with someone who already works with your potential customers \n\nMy number one advice — please, make a list of all your target customers that realistically can buy from you in the next 12 months , and focus only on them. Go to the events where they are, advertise to them, ask network for introductions. Don't spread your budget too thin by targeting way too many target accounts",
          "score": 1,
          "created_utc": "2026-01-26 16:41:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o22vhiz",
              "author": "Not_trxctf",
              "text": "What kind of events where i can find them?",
              "score": 1,
              "created_utc": "2026-01-27 20:03:34",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o22woea",
                  "author": "Admirable-Grocery-42",
                  "text": "Better ask your customers or potential ones, which events or conferences on top of their mind. Most people visit 2-3 top events, so better ask customers which events they prefer, instead of going to random events.",
                  "score": 1,
                  "created_utc": "2026-01-27 20:08:58",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1uii5x",
          "author": "PoolEqual4401",
          "text": "Please let me know if you need help with lead gen",
          "score": 1,
          "created_utc": "2026-01-26 16:48:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1uriks",
          "author": "Intrepid_Boss9449",
          "text": "Try finding customers in LinkedIn groups or forums where call centers and sales teams hang out. Also check out industry events or cold email lists. Reddit might help but for AI call centers you need places where decision makers are active.",
          "score": 1,
          "created_utc": "2026-01-26 17:27:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1utg93",
          "author": "theninjadesigner",
          "text": "You can you use social media platforms like linkedin and reddit to build your community by creating high quality posts which adds real value to the life of your target audience. And by doing inbound marketing, you can convert your target audience by doing soft selling and convert them as your customers. Dont expect to see the results right away, it takes time and consistency to build the strong organic audience. Once that's done, you can doo paid marketing.",
          "score": 1,
          "created_utc": "2026-01-26 17:35:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1vd2ez",
          "author": "KissyyyDoll",
          "text": "Congrats on the startup. For an AI call center, you should probably look where people are already complaining about high support costs or long wait times.\n\nLinkedIn is the obvious choice but dont just spam people. Try joining groups for operations managers or customer success leads since they are usually the ones dealing with the headache of scaling a team.\n\nAnother good move is checking out G2 or Capterra to see who is leaving frustrated reviews for the old school legacy systems. Those are usually the easiest people to talk to because they already know they have a problem. You could also try cold outreach but keep it super short and focus on one specific pain point like \"hey we help stop your phones from ringing off the hook after hours\" or something like that.",
          "score": 1,
          "created_utc": "2026-01-26 18:59:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1vik3q",
          "author": "Nabo_the_Best0924",
          "text": "Customer Success Managers could be a potential target ICP for you who are petrified with high number of calls that his/her team has to handle everyday regarding repetitive things. Because, mostly people look for automation for avoiding repetitive tasks. Scout for them through different social media platforms by joining in relevant groups and communities where they generally hang out.\n\nNow, the real game will be played how skillfully you design your outbound campaigns to reach out to these people and definitely you will need specialized tools to master the art of outreach. Let me know in my DM, if you ever need additional information about omnichannel outreach automation tools.",
          "score": 1,
          "created_utc": "2026-01-26 19:22:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1w46rg",
          "author": "SharpInsect3636",
          "text": "The harder part here isnt finding channels, its figuring out who actually feels the pain strongly enough to buy right now. “AI call center” is too abstract for most teams unless something just broke or costs spiked. The fastest path I have seen is starting with one narrow use case and one role, then talking directly to people already dealing with that exact problem.",
          "score": 1,
          "created_utc": "2026-01-26 20:57:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1w51n3",
              "author": "Euphoric-View-9876",
              "text": "This is the key part most founders miss. What helped me was not guessing where buyers hang out, but starting from who they already pay attention to. Instead of broad outreach, I mapped competitors and legacy tools in the space, then looked at who follows them on LinkedIn. That audience is already problem aware. Once you have that, conversations feel way less cold because youre showing up where intent already exists.",
              "score": 2,
              "created_utc": "2026-01-26 21:01:05",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1wdz6u",
                  "author": "Right-Influence-2460",
                  "text": "Thats a really underused way to think about intent. People signal what they care about long before they fill out a form, usually by who they follow or compare themselves against. Starting from those gravity centers makes outreach feel less like interruption and more like joining an existing conversation.",
                  "score": 1,
                  "created_utc": "2026-01-26 21:40:46",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1w4g1o",
          "author": "derevops",
          "text": "Work hard on your startups GEO/AEO and build a presence online. Buyers are currently either asking AI or going to particular social media platforms like reddit or x to search for the solutions/products they need. Keep that in mind. \n\nAlso, go hard on linkedin, you might feel unease at first but it all pays off :) good luck finding new customers!!",
          "score": 1,
          "created_utc": "2026-01-26 20:58:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o22vl83",
              "author": "Not_trxctf",
              "text": "Thank you)",
              "score": 1,
              "created_utc": "2026-01-27 20:04:02",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1w5t8u",
          "author": "OkDependent6809",
          "text": "yeah finding initial customers for b2b ai stuff is tough. especially call center products since there's so many now.\n\nlinkedin outbound can work but you gotta be really specific about who you target. like dont just spam vp of operations at every company. find companies that actually have call center pain (high support volume, lots of complaints about wait times, etc)\n\nhonestly tho id focus on events. like industry conferences, startup meetups, b2b networking things. way easier to have actual conversations there and get contact info from people who might actually care. then you can follow up properly instead of cold outreach\n\nthe conversion part is where you gotta put real energy. getting a poc from an event is easy, turning that into a customer takes work. most people collect business cards and never follow up properly\n\nalso pick one industry to focus on first. like bfsi has massive call center operations and tons of compliance requirements that ai could help with. way easier to build case studies and references when youre solving the same problem for similar companies. spreading too thin early on kills momentum\n\nwhat stage are you at? do you have any customers yet or still building?",
          "score": 1,
          "created_utc": "2026-01-26 21:04:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o22vya6",
              "author": "Not_trxctf",
              "text": "Now i looking for costumers i already have couple via network and cold calls. But it’s not really effective source( so i am looking for better tools for searching clients",
              "score": 1,
              "created_utc": "2026-01-27 20:05:41",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1wjirq",
          "author": "Erynlaflamme",
          "text": "Start with the foundation: Organic. It's what everything else will build upon.\n\n1. Optimize your website for SEO so that customers can find you.   \n2. Make sure you have a solid CRM in place and use tools like RB2B to see WHO is visiting your site  \n3. Create content that answers their questions   \n4. Distribute that content organically to start (social media, email marketing to your database)  \n5. Start doing Linkedin outreach and outbound email sequences to prospects visiting your website but not converting  \n6. Consider looking into tools like Wynter to pressure test your messaging / make sure its resonating with your audience before going to market   \n7. Leverage your LinkedIn- Post thought leadership posts weekly (not sales posts- but share expertise and advice about things your ICP is asking and provide actionable solutions- if your tool solves them great plug it sometimes but be more helpful that salesy) and use tools like Dripify to connect / message with your ICP (I've had tons of success booking meetings this way) and because you're posting consistent thought leadership, they will know you're a good person to know/talk to (you have shown you know your shit and want to be helpful)  \n8. Once your messaging is solidified and your foundation is set up, start testing paid channels (have a demand gen or paid consultant run an audit to determine where your audience exists and what your competitors are doing - and start running ads there if budget permits)  \n9. Networking is still great. Go to industry conferences your ideal customers are going to... go to all the meet ups, dinners etc. and get well connected.",
          "score": 1,
          "created_utc": "2026-01-26 22:05:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1yb8lg",
          "author": "ElectronicPop",
          "text": "Follow these steps. \n\n1. Identify who will probably need your software.\n2. Let's say they are sales people or b2b sales teams. \n3. Now you need a list of contact details of sales people in different companies. You can google around and get a good quality list from a service provider\n4. Start emailing them about the problems you solve. In total you should send them 5 emails in regular intervals. The final email should be a breakup email. The first email should be non salesy. Dont sell but show the customer how your software benefit them. \n\nDo it consistently and you will have sales.",
          "score": 1,
          "created_utc": "2026-01-27 03:38:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1yz34l",
          "author": "supriya_l89",
          "text": "You need to begin your customer target development process by defining specific industry requirements and company size criteria and use case conditions. AI call centers usually resonate with industries like healthcare, logistics, real estate, and e-commerce.  \n  \nMost early B2B traction comes from outbound: LinkedIn Sales Navigator, cold email, and direct demos. Trustbuilding requires you to combine your solution with case studies and pilot projects. The marketplaces and directories provide support through G2 and Capterra while direct conversations will establish demand proof more quickly than passive channels.",
          "score": 1,
          "created_utc": "2026-01-27 06:20:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1z62o8",
          "author": "UwU_MilkDrop",
          "text": "Target businesses that rely heavily on call centers or customer support. LinkedIn outreach, industry directories, and attending trade shows are good starting points.",
          "score": 1,
          "created_utc": "2026-01-27 07:17:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1zagto",
          "author": "Kalpana-Rathore",
          "text": "The key isn’t finding *customers*, it’s picking one very clear use case.\n\nFor a B2B AI call-center product, avoid “any business with calls.” Choose one segment (SMB support, sales teams, BPOs, SaaS CX). Each buys for different reasons.\n\nEarly customers usually come from manual LinkedIn outreach, personalized cold emails, and real conversations in communities, not paid ads. Focus on one problem you solve really well and get a pilot customer first.",
          "score": 1,
          "created_utc": "2026-01-27 07:56:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1zgpy7",
          "author": "kylegawley",
          "text": "Start with:\n\n1. Cold DMs on LinkedIn to people who need your solution  \n2. Warm DMs to people on social media posting about looking for your solution",
          "score": 1,
          "created_utc": "2026-01-27 08:54:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1zl5h9",
          "author": "Aunker",
          "text": "Usually the problem isn’t where to find customers, but that AI call center is too vague to trigger interest. Buyers think in specific jobs being replaced or improved. Support, sales follow ups, booking, collections. Each has different buyers and channels. Early traction almost always comes from picking one narrow use case and one industry, not from searching for generic platforms.",
          "score": 1,
          "created_utc": "2026-01-27 09:35:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1zpl1d",
          "author": "FunDevelopment3229",
          "text": "How about using your call center to get more clients?",
          "score": 1,
          "created_utc": "2026-01-27 10:16:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o22w39a",
              "author": "Not_trxctf",
              "text": "What kind of? I don’t understand",
              "score": 1,
              "created_utc": "2026-01-27 20:06:18",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o20n6r9",
          "author": "No_Hedgehog8091",
          "text": "For AI call centers, target companies already using traditional call centers. Start with LinkedIn Sales Navigator filtering by industry (insurance, telecom, healthcare) and company size 50-500 employees.\n\nSearch job postings for 'call center manager' or 'customer service director' roles. These companies have the pain point you solve.\n\nJoin industry-specific Slack/Discord communities where operations managers hang out. They discuss vendor selection there.\n\nCold outreach works best when you reference their current tech stack. Many list their providers on job postings or company pages.",
          "score": 1,
          "created_utc": "2026-01-27 14:06:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o20oxdp",
          "author": "Due-Willow-2002",
          "text": "Start by narrowing who you’re actually selling to — support-heavy SMBs, sales teams, or BPOs. From there, most early customers come from direct outreach and conversations, not platforms. LinkedIn and email work better than marketplaces at this stage, especially if you can offer pilots or demos and learn from real usage.",
          "score": 1,
          "created_utc": "2026-01-27 14:15:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o20tfrv",
          "author": "MembershipHorror404",
          "text": "Been there. Early on, what helped me most was not “finding customers” but finding one clear use case.\n\nFor an AI call center, pick a narrow ICP first (for me it was real estate + outbound-heavy teams). Then hang out where they already complain 😄, subreddits, LinkedIn comments, niche Slack/Discord groups. Reply with experience, not a pitch.\n\nI also did a lot of manual outbound at the start: short emails/DMs saying “saw you’re handling X calls/day, curious how you’re managing it today?” That opened real conversations fast.\n\nOnce a couple of customers convert, everything else (platforms, ads, content) becomes way easier.",
          "score": 1,
          "created_utc": "2026-01-27 14:37:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2123lf",
          "author": "Dangerous_Bowler3286",
          "text": "To find customers for your AI call center product, start by defining your ICP (B2B companies with high call volume, customer support teams, or service-heavy industries).   \n  \nLook for buying signals like recent growth, hiring in customer service roles, or scaling operations   these are clues that companies are likely ready to adopt AI solutions.\n\nUse a multi-channel approach: start with cold email outreach to targeted companies, leveraging platforms like LinkedIn for visibility and engagement. Combine that with AI-driven lead enrichment and email verification to ensure quality prospects.   \n  \nAutomate the process from finding leads to handling replies and syncing everything to your CRM, so you can scale efficiently.\n\nPlatforms like LinkedIn for discovery and cold email tools for outreach work well, but having an automated workflow that continuously targets, qualifies, and nurtures leads is key.",
          "score": 1,
          "created_utc": "2026-01-27 15:19:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o23g74d",
          "author": "SignificanceBusy2136",
          "text": "For B2B AI products, most people start by narrowing the ICP first—industry, company size, job roles, and the specific workflow your AI actually improves. Once you know that, outreach gets way easier and less random.\n\nIf you need data to find those companies or contacts or determine what is trending in your target market, Techsalerator has firmographic and contact datasets you can filter by industry, geography, tech stack, etc., which can help you build a cleaner starting list. It can save a ton of time compared to scraping everything yourself.",
          "score": 1,
          "created_utc": "2026-01-27 21:36:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o23svsp",
          "author": "erickrealz",
          "text": "You're not gonna find customers on platforms, you gotta go directly to companies that need AI call centers. Build a list of 200-300 businesses in one specific vertical like ecommerce support teams or lead gen agencies, then reach out via cold email and LinkedIn explaining exactly how much money you save them.\n\nOur clients selling AI products waste months trying to find the \"right platform\" when direct founder-led sales is always faster for getting your first 20 customers. Pick companies handling high call volumes with repetitive questions, those are your easiest targets. Use Apollo or Sales Navigator to find decision makers, then send them a clear pitch about outcomes not features.\n\nThe mistake everyone makes is trying to sell AI call centers to every industry instead of dominating one niche first. If you can't get 10 customers in one vertical through direct outreach, your product probably doesn't solve a painful enough problem or your positioning sucks. Fix that before worrying about distribution platforms.",
          "score": 1,
          "created_utc": "2026-01-27 22:34:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o24cpyz",
          "author": "Organic-Scientist742",
          "text": "Since you mentioned B2B ai startup im guessing your target customers would be in customer support teams. You could look up relevant folks on LinkedIn and dm them to offer a demo or you can use tools like usemunch and generate your prospect list.",
          "score": 1,
          "created_utc": "2026-01-28 00:14:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o25gsn0",
          "author": "swapdroid2",
          "text": "You can start the easiest from google my listing for particular niche like dentists or salons. You pitch them directly and create custom use cases for them to understand the ROI.\n\nNext step would be free trial for 7 days or more as to get the experience and then you can easily sell them the product. Create testimonials, and replicate.",
          "score": 1,
          "created_utc": "2026-01-28 03:47:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2afrk9",
          "author": "Alone_Ad_3375",
          "text": "Very very very simple talk to a community of people who might be interested in trying your product \n\nGo to reddit \n\n1. Find your community\n2. Ask if they would be interested in something you have built\n3. Get feedback and build over that",
          "score": 1,
          "created_utc": "2026-01-28 21:11:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2bl0qq",
          "author": "Drumroll-PH",
          "text": "Just google “how to create an evergreen cold email campaign“ and read a couple articles on this topic, best way to get B2B clients imo",
          "score": 1,
          "created_utc": "2026-01-29 00:29:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2dhm98",
          "author": "KiwiOpening3678",
          "text": "Most B2B call center startups get traction by narrowing down a very specific ICP first then going where those buyers already are. The highest ROI provider is LinkedIn, target heads of support/ops with personalized outreach and post content around AI and call center ROI. Cold email, LinkedIn outbound (Apollo/ZoomInfo) works if you keep it value focused, not salesy. Early on, Product Hunt can bring feedback, while partnerships with BPOs can unlock faster trust and deals.. if helpful, just upvote my comment , trying to up my account..",
          "score": 1,
          "created_utc": "2026-01-29 07:51:48",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qq6m1u",
      "title": "Visual content work for B2B or is it just more noise?",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qq6m1u/visual_content_work_for_b2b_or_is_it_just_more/",
      "author": "juxhinam",
      "created_utc": "2026-01-29 11:56:51",
      "score": 26,
      "num_comments": 28,
      "upvote_ratio": 0.96,
      "text": "Been seeing many B2B brands pushing infographics, interactive charts, visual reports etc. instead of just text heavy blog posts and whitepapers. \n\nSome of it seems to perform well on LinkedIn and in nurture seq but I'm wondering if it's actually getting ROI or just inflating engagement metrics?\n\nHas anyone here tested visual content formats in their strategy? What actually worked for lead quality or conversions vs what just looked good? Trying to figure out if this is worth investing in or if i should stick to my trad long form for our ICP. \n\nThank you! ",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qq6m1u/visual_content_work_for_b2b_or_is_it_just_more/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o2e9gdv",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-29 11:56:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2el7lx",
          "author": "Potential_Pool5955",
          "text": "We tested this exact Q last year across a few campaigns and visual content got use 3x the engagement, but only 1.3x the qualified leads. \n\nThe gap taught us that visuals are great at stopping the scroll but they need to be paired with a clear conversion path. The infos that worked best for actual pipeline were the ones that visualize a specific problem our ICP is facing then offer a natural next step. ",
          "score": 4,
          "created_utc": "2026-01-29 13:14:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2eq87w",
          "author": "Temporary_Term_1042",
          "text": "Most B2B visual content is solving the wrong problem. We're not losing deals because our content isn't pretty enough. We're losing deals because we're not saying anything memorable. Slapping the same generic 5 trends or 3 tips into a template is just making more noise. \n\nWhat actually works is making complex ideas easier to understand. Think visualizing your propietary methodology, showing before and after transformation data, or mapping out a decision framework  people can use.",
          "score": 3,
          "created_utc": "2026-01-29 13:41:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2eze3q",
          "author": "Dismal_Cartoonist_45",
          "text": "It works really well. That's what I do for me and my clients as well. 💪🏻",
          "score": 1,
          "created_utc": "2026-01-29 14:29:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2f0t5t",
          "author": "GrabUsed5041",
          "text": "I find that visual content is important if you're trying to explain a complex concept quickly. When we run campaigns we tend to create visuals that add additional context to the messaging to help show their value points efficiently.",
          "score": 1,
          "created_utc": "2026-01-29 14:36:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2f3f8s",
          "author": "TemporaryKangaroo387",
          "text": "hot take but i think visual content is overrated for B2B unless youre specifically optimizing for linkedin feed performance\n\nthe engagement numbers look good but what actually builds pipeline long term is searchable, indexable content that establishes expertise. infographics dont rank on google, they dont get cited by AI search tools, they dont compound the way a well-written deep dive does\n\nive seen teams chase visual engagement metrics while their organic search presence tanks. its a distribution channel mismatch -- linkedin rewards scroll-stoppers, but your ICP researching solutions at 2am is reading blog posts not infographics\n\nif budget is limited id focus on long form text content that actually answers the questions your buyers are searching. use visuals to support that content, not replace it",
          "score": 1,
          "created_utc": "2026-01-29 14:49:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2fgcbd",
          "author": "Intrepid_Boss9449",
          "text": "Visual content can boost engagement but often just inflates vanity metrics if not tied to clear goals. I found that mixing visuals with targeted outreach works better for lead quality. Tools like SocListener help find real sales conversations on Reddit so you can engage prospects directly instead of hoping visuals alone convert.",
          "score": 1,
          "created_utc": "2026-01-29 15:49:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2gorsa",
          "author": "Massive_Report947",
          "text": "It really depends on the quality of the content.\n\nAs said, visuals work to explain concepts and especially work at the awareness and consideration stages of the sales cycle.\n\nHaving said that, a great visual or video to explain how a new product or concept or to visualise a SaaS product eg screenshots, can help to unlock leads. Hope that helps.",
          "score": 1,
          "created_utc": "2026-01-29 19:08:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2h4ank",
          "author": "Content_thought55",
          "text": "We've tested this a lot with B2B clients at Feedbird. Visual content definitely performs better for engagement but you're right to question whether engagement actually means conversions.\n\nCarousels and infographics get way more shares and saves on LinkedIn but the lead quality can be hit or miss. The sweet spot we've found is using visual content for top of funnel awareness, then gating the long form stuff behind lead magnets for people who are actually serious. The visual gets them in the door, the long form filters for intent.\n\nIf you're purely optimizing for conversions, long form still wins for qualified leads imo. But if you need visibility and brand presence, visual formats get you in front of way more people.",
          "score": 1,
          "created_utc": "2026-01-29 20:22:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2h840d",
          "author": "gptbuilder_marc",
          "text": "That’s the right tension to focus on. A lot of B2B teams mix up visibility with actual movement in the funnel, especially on LinkedIn. When you say ROI, are you more worried about lead quality downstream, or whether this changes buying behavior at all for your ICP?",
          "score": 1,
          "created_utc": "2026-01-29 20:40:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ike3c",
          "author": "OkDependent6809",
          "text": "we tried this last year. made a bunch of infographics and visual stuff for linkedin. engagement went up like 3x but leads didn't really change.\n\nthe problem is people will like and share visual stuff but it doesn't mean they're actually in market to buy. we got a lot of \"oh cool chart\" reactions but no real conversations.\n\nwhat kinda worked was using visuals to simplify complex stuff in our nurture emails. like taking a dense whitepaper section and turning it into a simple diagram. that actually seemed to help move deals forward.\n\nbut just posting pretty charts on linkedin for engagement? waste of time imo",
          "score": 1,
          "created_utc": "2026-01-30 00:45:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2j9n3r",
          "author": "KissyyyDoll",
          "text": "I have been seeing this too and in my experience visual content helps a lot with getting people to actually stop scrolling on LinkedIn. Text heavy whitepapers are great for later in the funnel but those interactive charts or simple infographics usually get way better lead quality because they simplify complex stuff for the ICP. \n\nIf you want to test it without overcommitting maybe just try turning one of your top performing blog posts into a visual report first to see if the conversions follow the engagement.",
          "score": 1,
          "created_utc": "2026-01-30 03:05:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2jwth9",
          "author": "Amulyakumarr",
          "text": "The same thing is happening to us. I spent over a month writing and designing an ebook, and I have been running multiple campaigns, LinkedIn groups, LinkedIn posts, and have so many clicks to the landing page but no downloads or conversions. I am backed up against the wall now, and would very much appreciate any suggestions.",
          "score": 1,
          "created_utc": "2026-01-30 05:30:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2k6u1s",
          "author": "_forgotmyownname",
          "text": "Visuals work, but only if tied to a conversion goal. Pretty engagement alone isn’t ROI.",
          "score": 1,
          "created_utc": "2026-01-30 06:48:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2kmnee",
          "author": "Tiny-Celery4942",
          "text": "I think it depends a lot on your audience. We tried some infographics but our people seem to like the longer, more in depth stuff. Maybe test both and see what gets better leads?\n\nAlso only content & visual will not solve your problem, same content shared by a top voice, will get thousand of likes and share and by starter no attention..\n\nBuild community, be Focused and engage with your ICPs, content + engagement+ DMs + adding new people to your circle, compound .. it take effort",
          "score": 1,
          "created_utc": "2026-01-30 09:06:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2l05ya",
          "author": "tzarhirovito",
          "text": "In a colleague’s business i remember a team experimented with visual content, infographics, interactive charts, and short reports ofc alongside traditional blog posts. At first, engagement looked great, but best results came from when the visuals tied to clear CTAs and nurture flows. It's important  to know or work with someone that knows its not just about looking good and that the format has to guide the right audience toward action",
          "score": 1,
          "created_utc": "2026-01-30 11:07:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2l41sh",
          "author": "Due-Willow-2002",
          "text": "Visual content absolutely works in B2B, but it’s all about **how you use it**. Infographics, interactive charts, and visual reports grab attention and make complex ideas digestible, which helps with engagement and brand recall.\n\nThat said, not all visuals drive **real leads**. The ones that work best are tied to **actionable insights or gated content** — for example, a visually rich report that requires an email to download. Purely “pretty” visuals may boost clicks or likes but won’t move the needle on conversions.\n\nA mix of long-form content for authority + strategic visual assets for engagement usually gives the best ROI.",
          "score": 1,
          "created_utc": "2026-01-30 11:38:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2l8mta",
          "author": "Mobile-Ambition-3714",
          "text": "Visuals definitely help you cut through the feed clutter, especially for B2B when everyone else is still churning out three-page case studies. Charts and infographics are good for stopping people, but the ones that drive actual pipeline are the ones that make a pain point super clear or help your ICP do their job faster. Vanity metrics do pile up if you’re not intentional though, so I’d test a couple of formats, see what gets people to actually take the next step, and double down on the stuff that pulls folks deeper instead of just racking up likes.",
          "score": 1,
          "created_utc": "2026-01-30 12:12:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ldgre",
          "author": "madhuforcontent",
          "text": "Helpful visual content greatly works for B2B.",
          "score": 1,
          "created_utc": "2026-01-30 12:44:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2r1sp0",
          "author": "theninjadesigner",
          "text": "It takes a lot of time, but yeah, the main purpose of creating high-quality infographics is to build trust and a community our target audience can look up to.",
          "score": 1,
          "created_utc": "2026-01-31 06:55:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2tthdl",
          "author": "CCMALLC",
          "text": "You agree Visual content drives up engagement so next you are looking to find out how to match this to result in driving up your conversion (enrollment).\n\nThere's a process for driving up conversions using visual content and it relies on having the proper systems in place and doing the right things in the right order (not piecing YouTube videos together). The MAIN component of the process is not to create the visual content just to take place of text post. People are already drowning in content overload.  The Issue is very few provide CONTEXT...this is the main component that drives conversion when using visual content. \n\nI can't post images here so I can't directly show you. And, telling is not what we specialize in. We show, we don't tell  and we serve,  we don't sell.\n\nContext is why the ones using visual content aren't seeing a higher conversion rate. If you want to get clarity on the CONTEXT of your Offer and what you should be doing and the order you should be doing it using the visual content Strategy, let's connect where I show you the WHAT and give you confidence you can implement it.",
          "score": 1,
          "created_utc": "2026-01-31 18:08:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ua1vy",
          "author": "Public_Quiet_3624",
          "text": "The best outreach method is always linkedin + cold emails. I had got 300 thousand linkedin ids and cold emails. If someone wants it.. dm me",
          "score": 1,
          "created_utc": "2026-01-31 19:26:38",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qrfpzx",
      "title": "Do consulting firms actually care about polished LinkedIn photos or is it all about the profile content?",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qrfpzx/do_consulting_firms_actually_care_about_polished/",
      "author": "desisevil",
      "created_utc": "2026-01-30 19:41:08",
      "score": 19,
      "num_comments": 5,
      "upvote_ratio": 0.85,
      "text": "Preparing to recruit for consulting roles and everyone keeps telling me to get professional LinkedIn headshots. The advice is always \"invest in a good headshot\" but nobody explains if consulting firms actually filter based on photo quality or if this is just conventional wisdom.\n\nTraditional photographers charge $400-500 which I'm willing to pay if it genuinely matters for MBB or Big 4 recruiting, but I'm skeptical that photo quality is what gets you interviews versus your experience and school.\n\nA friend recruiting for consulting used **Looktara** for their LinkedIn photo instead of paying for a photographer and still got interviews at top firms. They said recruiters never mentioned it.\n\nFor people in consulting - does LinkedIn headshot quality actually matter for recruiting? Or is this just one of those things people say without real evidence that it impacts outcomes?",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qrfpzx/do_consulting_firms_actually_care_about_polished/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o2ntqk3",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-30 19:41:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2o0cyn",
          "author": "Leather_Moose_6601",
          "text": "ex-consultant here. nobody is filtering candidates based on headshot quality.",
          "score": 1,
          "created_utc": "2026-01-30 20:11:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2o3hql",
          "author": "Better-Upstairs-52",
          "text": "$400 on a headshot won’t move the needle compared to coffee chats, referrals, and case prep.",
          "score": 1,
          "created_utc": "2026-01-30 20:26:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2qfezd",
          "author": "cedarconsultants",
          "text": "No. Don’t have a profile picture shotgunning a beer and you’ll be ok.",
          "score": 1,
          "created_utc": "2026-01-31 04:04:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2o3mz8",
          "author": "malaglista",
          "text": "A couple people in my cohort used Looktara instead of paying for photographers and photos looked normal and professional.",
          "score": 0,
          "created_utc": "2026-01-30 20:27:28",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qnnhyw",
      "title": "I own a $120,000 a month cold email agency and here's what you can use:",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qnnhyw/i_own_a_120000_a_month_cold_email_agency_and/",
      "author": "Unhappy_Shock_6203",
      "created_utc": "2026-01-26 18:00:16",
      "score": 17,
      "num_comments": 32,
      "upvote_ratio": 0.76,
      "text": "Hey everyone,\n\nI want to do a post personally to explain some tips and tricks for new cold emailers.\n\nBefore getting into the post - side note if you are not interested or you are just going to attack just ignore this post it wasn’t meant for you.\n\nWe send 7-8 million cold emails across 89 different clients and setup more than 5000 campaigns. We work with financial service firms, marketing companies, recruitment firms, manufacturing firms, saas companies, 3pl (transportation firms) etc.\n\n**Cold email is not easy but I will give some insights.**\n\n1. Dont send any links at all in the first email. People say this but they dont know the reason behind. Blacklist providers like Spamhouse ZEN and Braccuda actually look at the spam reports and a link is associated with spam - even if you are not spamming. \n2. Leads currently we target are smtp and google. Sometimes we blend office 365. If you buy an old domain and do an office 365 setup and have a non sales script you can actually get 1-2% reply rates. We have done a lot of testing and if anyone has any questions regarding office 365 deliverability I am happy to answer.\n3. Include and test with gmail leads. These are 50-50 sometimes good sometimes bad. They are not approached as much as Google Apollo leads. This works well especially if you are targeting small local businesses and when you have a narrow tam.\n4. Have a diversified setup. Never rely fully on google or outlook always balance out. Always have a 60-40 or 50-50 split. Deliverability is fragile sometimes outlook is good and sometimes google make sure you balance it out.\n\nLet me know if anyone has any questions.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qnnhyw/i_own_a_120000_a_month_cold_email_agency_and/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o1uz01m",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-26 18:00:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1wbr43",
          "author": "Admirable_Swim_7805",
          "text": "this is solid advice especially the part about not sending links in the first email. most people dont realize email providers scan for links and domains and if youre new or using a fresh domain every link makes you look more like spam.\n\n\n\nthe 5050 split on google and outlook is key too. diversification saves you when one platform decides to crack down. we learned this the hard way when google updated their filters and tanked our deliverability for a week.\n\n\n\none thing id add is warm up your domains properly before sending at scale. even if you buy an aged domain you still need to gradually increase send volume over 23 weeks. jumping straight to high volume is a quick way to get blacklisted.\n\n\n\nalso test your emails with mail tester or glockapps before launching campaigns. catches a lot of issues early like spf dkim or content flags that hurt deliverability.",
          "score": 3,
          "created_utc": "2026-01-26 21:30:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2862uy",
              "author": "New_Grape7181",
              "text": "I've found that while the technical setup matters, the actual message and timing often make a bigger difference than most people think.  \n  \nOne thing I'd add to your list is that personalisation at scale is tricky but worth it. We've tested adding a quick reference to something specific about their company (recent LinkedIn post, news mention, funding round) in the opening line. It bumps replies noticeably compared to generic openers, even when the rest of the email is templated.  \n  \nAlso curious about your take on multichannel. We've seen cold email work better when it's not the only touchpoint. For example, engaging with their content on LinkedIn first, then following up with email a few days later. The email becomes a continuation rather than cold outreach.  \n  \nWhat's your approach when a prospect opens multiple times but doesn't reply? Do you change the follow-up strategy or keep the same cadence?",
              "score": 2,
              "created_utc": "2026-01-28 15:14:15",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2e8x22",
                  "author": "Unhappy_Shock_6203",
                  "text": "this is a really solid take. technical setup is just the entry ticket. message and timing decide if you actually get replies  \nagree on light personalization. referencing something real about them works way better than fake {{first\\_name}} tricks  \non multichannel i like linkedin first then email. even a profile view or small engagement makes the email feel warmer  \nfor multiple opens no reply i don’t change cadence immediately. usually i change angle. shorter follow up. different hook. sometimes just calling out the silence directly  \nopens mean interest. silence usually means low priority not rejection",
                  "score": 2,
                  "created_utc": "2026-01-29 11:53:02",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            },
            {
              "id": "o2e8vrr",
              "author": "Unhappy_Shock_6203",
              "text": "appreciate this a lot. especially the point about links and fresh domains. most people learn that only after burning a domain or two  \nthe 50 50 google outlook split is underrated. you don’t feel it until one provider sneezes and your whole setup catches a cold  \nalso +1 on warming properly. people rush scale then blame tools instead of volume ramping  \nmail tester and glockapps save so much pain early. boring stuff but it’s what actually keeps you alive long term",
              "score": 2,
              "created_utc": "2026-01-29 11:52:47",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2kcflq",
                  "author": "New_Grape7181",
                  "text": "100%, its so easy to rush. We now don't use email much though, focus mainly on personalised video on linkedin - don't need to worry about deliverability issues.",
                  "score": 1,
                  "created_utc": "2026-01-30 07:34:52",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1vd64j",
          "author": "KissyyyDoll",
          "text": "this is super helpful thanks for sharing. i always wondered about the link thing in the first email because i see so many people still doing it. that 50-50 split between google and outlook makes a lot of sense too especially with how moody deliverability can be lately. appreciate the tips",
          "score": 2,
          "created_utc": "2026-01-26 18:59:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2e92iz",
              "author": "Unhappy_Shock_6203",
              "text": "this is one of those things people ignore until deliverability slaps them  \nlinks in the first email work fine when you already have reputation. early on they just raise unnecessary flags  \nand yeah google and outlook have been extra moody lately. spreading risk is basically insurance  \nglad it helped. this stuff isn’t sexy but it’s what actually keeps campaigns alive",
              "score": 1,
              "created_utc": "2026-01-29 11:54:08",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1wvd0j",
          "author": "CCMALLC",
          "text": "Thanks for the intel!",
          "score": 2,
          "created_utc": "2026-01-26 23:01:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1x4lun",
          "author": "Adjudica",
          "text": "You do niche specific work?",
          "score": 2,
          "created_utc": "2026-01-26 23:48:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2e94sa",
              "author": "Unhappy_Shock_6203",
              "text": " We work with financial service firms, marketing companies, recruitment firms, manufacturing firms, saas companies, 3pl (transportation firms) etc.",
              "score": 1,
              "created_utc": "2026-01-29 11:54:33",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2ongob",
                  "author": "Bilaldev99",
                  "text": "That's a lot! Can I ask specific questions?",
                  "score": 1,
                  "created_utc": "2026-01-30 22:01:34",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1xo30c",
          "author": "Dickskingoalzz",
          "text": "Didn’t I just see this post a few days ago? Word for word?",
          "score": 2,
          "created_utc": "2026-01-27 01:30:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1xsmv1",
          "author": "InnerBuilding7949",
          "text": "Super surprised in what you delivered (millions of mails), 5000 campaigns 😂. Wish your business continues with success",
          "score": 2,
          "created_utc": "2026-01-27 01:55:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2e99lh",
              "author": "Unhappy_Shock_6203",
              "text": "haha appreciate that. sounds crazy when you say it like that  \nit’s just a lot of small boring decisions done consistently  \nthanks for the good wishes",
              "score": 1,
              "created_utc": "2026-01-29 11:55:31",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1ynnfr",
          "author": "Aggravating_Bug_3326",
          "text": "May I know your business name?",
          "score": 2,
          "created_utc": "2026-01-27 04:56:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2e9c6n",
              "author": "Unhappy_Shock_6203",
              "text": "i usually don’t drop names publicly here  \nhappy to share details in dm if you’re curious",
              "score": 1,
              "created_utc": "2026-01-29 11:56:01",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2e9ese",
                  "author": "Aggravating_Bug_3326",
                  "text": "Yes please.",
                  "score": 2,
                  "created_utc": "2026-01-29 11:56:32",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1zcfo1",
          "author": "Thymen-WPM",
          "text": "How do you make your inboxes? I’ve used premium inboxes as they offer just the professional workspace but just the e-mail adres. Don’t really like the interface so I’m looking for something new",
          "score": 2,
          "created_utc": "2026-01-27 08:14:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2e9dz2",
              "author": "Unhappy_Shock_6203",
              "text": "i mostly stick to google workspace and outlook directly  \npremium inboxes are fine but you lose a lot of control and flexibility  \nnative setups let you manage dns warmup and sending behavior properly  \ninterface matters less once things are automated but deliverability matters a lot more",
              "score": 1,
              "created_utc": "2026-01-29 11:56:22",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1zn9ha",
          "author": "MendMySoulXoXo",
          "text": "Your MRR went from 120k to 154k real quick 😭",
          "score": 2,
          "created_utc": "2026-01-27 09:55:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2e8ekp",
              "author": "Unhappy_Shock_6203",
              "text": "Yeah !!",
              "score": 1,
              "created_utc": "2026-01-29 11:49:16",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o225n7v",
          "author": "Bright-Traffic-8215",
          "text": "What is the usual email to lead conversion? (Lead meaning they want call/more info)\n\n\nHow do you get results when doing lead generation for service-based agencies? Those are quite challenging from my experience",
          "score": 2,
          "created_utc": "2026-01-27 18:11:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2e9hzz",
              "author": "Unhappy_Shock_6203",
              "text": "there’s no single number but as a rough range 1 to 3 percent of total sends turning into real conversations is healthy  \nservice based is harder because you’re selling trust not a product  \nwhat works for me is niche down hard. one service. one pain. one outcome  \nmost campaigns fail because they’re too broad and sound like everyone else",
              "score": 1,
              "created_utc": "2026-01-29 11:57:11",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2c3cuv",
          "author": "Positive_Yak930",
          "text": "With links, do you also mean we should not send our website link?",
          "score": 2,
          "created_utc": "2026-01-29 02:09:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2e9jxo",
              "author": "Unhappy_Shock_6203",
              "text": "yeah early on i avoid any links including the website  \nif someone asks for it or replies with interest i’ll share it then  \nfirst email is just about starting a conversation not proving credibility",
              "score": 1,
              "created_utc": "2026-01-29 11:57:34",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1vo3at",
          "author": "Radiant-Security-347",
          "text": "so this is how I fool the spam filters, eh?",
          "score": 1,
          "created_utc": "2026-01-26 19:46:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2e8zrn",
              "author": "Unhappy_Shock_6203",
              "text": "Exactly!!",
              "score": 1,
              "created_utc": "2026-01-29 11:53:35",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2on7vv",
          "author": "Bilaldev99",
          "text": "Solid advice. Thanks for sharing your perspective!",
          "score": 1,
          "created_utc": "2026-01-30 22:00:23",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qrm645",
      "title": "Stuck at the finish line. How do you get B2B deals over the line?",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qrm645/stuck_at_the_finish_line_how_do_you_get_b2b_deals/",
      "author": "Such_Dragonfruit7958",
      "created_utc": "2026-01-30 23:45:50",
      "score": 16,
      "num_comments": 9,
      "upvote_ratio": 1.0,
      "text": "I’m running into the same problem over and over and could really use some advice.\n\nI get the inquiry. I scope the project. I send the quote. Pricing is agreed. The client says they want to move forward. And then… nothing. No PO. No urgency. No decision. Even though they came to us with the problem and clearly need what we offer.\n\nIt feels like deals stall not because of objections, but because the buyer just isn’t prioritizing the decision. I’ve tried following up, checking timelines, and even hinting at things like pricing changes or limited availability, but I don’t want to rely on fake urgency or pressure tactics that damage trust.\n\nOne recent example really sums it up. Client wanted to move ahead during the summer. Quote delivered. Follow-ups done. They started debating sourcing some equipment themselves to lower cost, then went quiet. When we finally met again, the answer was that the budget for this year was gone and the project got pushed to next year. No hard “no,” just drift.\n\nI’m realizing I’m not losing these deals to competitors. I’m losing them to indecision and lack of momentum.\n\nI’m starting to think the issue isn’t the pitch or the pricing, but how I’m guiding the buyer once they say yes in principle. I’ve seen some teams use tools like Trumpet to keep everything in one place. Quote, scope, timelines, next steps, and decision checkpoints all visible so the buyer doesn’t mentally reset after every conversation.\n\nFor those of you in higher-end B2B sales, how do you handle this stage?  \n How do you create real urgency without pressure?  \n How do you help buyers actually commit when they agree but don’t act?\n\nAny practical tactics, frameworks, or lessons learned would be hugely appreciated.\n\n",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qrm645/stuck_at_the_finish_line_how_do_you_get_b2b_deals/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o2p7f9y",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-30 23:45:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2t3grt",
          "author": "Right-Will8093",
          "text": "This is a big issue, especially when you're dealing with bigger businesses/deals with bigger price tags$\n\nChances are, you might be attracting low-intent tyre kickers (basically businesses who kinda want what you offer, but this was never a priority call just something they want to note down for when they need it \"later\")\n\nFor your current prospects, I'd definitely make some kind of dashboard which has everything they need to view the project so they don't clock out\n\nBut it may also be worth checking what level of intent these leads have\n\nHow are you getting these leads? Do they come from SEO, ads, cold outreach etc?",
          "score": 2,
          "created_utc": "2026-01-31 16:03:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2u8eey",
          "author": "Kitchen-Quality-3357",
          "text": "Create urgent by striking their FOMO, insinuating demand, and introductory offers with a deadline.",
          "score": 2,
          "created_utc": "2026-01-31 19:18:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2x2d4f",
          "author": "Seven_Figure_Closer",
          "text": "I would need a lot more info. But based on what you shared, my immediate thought is that you may be sharing pricing way too early. You need to anchor solution value to real pain or understood priorities/outcomes. If you aren't anchoring and validating the cost-benefit/ROI is understood, your pricing may scare people off. \n\nWould be happy to chat on this with you if you want to DM",
          "score": 2,
          "created_utc": "2026-02-01 04:43:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2voklu",
          "author": "lionstock555",
          "text": "“I get the inquiry” is already a “not so good” start imo + did they agree your value + who agreed …\nLots of questions",
          "score": 1,
          "created_utc": "2026-01-31 23:42:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2z3f2c",
          "author": "Admirable_Swim_7805",
          "text": "that drift after verbal yes kills me too. for agencies i automate proposals off call transcripts, pulls key needs from otter ai, plugs into their branded template, spits out pdf with dynamic pricing and esign link in under 5 mins. auto sends with heres your custom scope based on what you said, sign to lock it in. cut stall time from weeks to days, win rate up 20 percent because it keeps momentum without chasing. no more budget excuses when its in their inbox same day",
          "score": 1,
          "created_utc": "2026-02-01 14:28:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o32f38n",
          "author": "KissyyyDoll",
          "text": "ou need a clear next step before ending every conversation - specific date, specific action, specific person responsible. No \"we'll be in touch.\"",
          "score": 1,
          "created_utc": "2026-02-02 00:09:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o32kvwj",
          "author": "BranchDirect6526",
          "text": "I feel your pain and share it too. I agree that maybe the client needed to better understand the cost of not moving forward financially and operationally so that the urgency is there and the price is a secondary factor. \n\nAlso, I’ve had deals collapse when I didn’t get early access to senior leaders. The problem was, right before closing, my champion had to reach up to seniors to move forward, who disagreed with the sale.  Dead. 😵 \n\nI’d love to hear more ideas on handling this.",
          "score": 1,
          "created_utc": "2026-02-02 00:41:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2qupgc",
          "author": "thesinnedknight",
          "text": "Send the invoice, let them know you sent it, the terms are on it, and you can start as soon as it's paid.\n\nLeave it in their hands.  Don't beg.",
          "score": 1,
          "created_utc": "2026-01-31 05:56:03",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qp9tbl",
      "title": "I booked 7 meetings in 15 days with a 65% reply rate. Stop \"pitching\" in DMs directly",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qp9tbl/i_booked_7_meetings_in_15_days_with_a_65_reply/",
      "author": "aashrun",
      "created_utc": "2026-01-28 12:18:06",
      "score": 15,
      "num_comments": 40,
      "upvote_ratio": 0.71,
      "text": "**Unpopular opinion**: Cold DMs work. You're just doing them wrong.\n\nIf your open rate is high but your reply rate is <5%, use this as a reality check: You are boring. I spent the last 2 weeks running a split-test on Reddit outreach for my SaaS.\n\nThe Stats:\n\n* Duration: 15 Days\n* Volume: \\~100+ DMs sent (highly targeted)\n* Replies: 43 (>65% Reply Rate)\n* Booked Calls: 7\n\nThe \"Old\" Way (That failed): Finding a user, sending a generic \"Hey, I saw you like marketing. I have a tool...\" Result: Ghosted.\n\nThe \"New\" Way (The Secret): I realized that Redditors post because they want validation or help. They don't want to be sold to. So I stopped selling.\n\nThe Strategy Breakdown:\n\n**1. Context is King (The Search)** \n\nYou cannot DM random people. You need people who are active right now and talking about your specific problem.\n\nI stopped manually browsing. It's a waste of life.\n\nI set up monitors using SleepLeads (filters out the noise nicely and sends dms for me)\n\nI tracked keywords like: \"struggling with X\", \"alternative to Y\", \"how do I Z\".\n\nThe moment someone posted, I got a ping.\n\n**2. The \"Ego-First\" DM** \n\nI did not pitch my tool. I pitched their post back to them.\n\n* Script Structure: \"Saw your post about \\[X\\]. Totally agree with your point on \\[Y\\]. I actually tried \\[Z\\] and it worked. Curious how you're handling \\[A\\]?\"\n* Why it works: It positions me as a peer/expert, not a salesman. It strokes their ego (\"You agree with me? I like you.\").\n\n**3. The Pivot** \n\nOnce they reply (and they usually do, within a few mins), then we start a conversation. \"Yeah, manual tracking is a pain. I actually built a specific tool to automate that part if you want to test it out?\" Reply: \"Sure, link?\"\n\nTakeaway: You can't automate the human connection, but you absolutely should automate the finding part. Stop scrolling. Start listening. Pitch the problem, not the product.\n\nTL;DR: Be human. Validate their post first. Use tools to find high-intent posts instantly.\n\n",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qp9tbl/i_booked_7_meetings_in_15_days_with_a_65_reply/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o279rq2",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-28 12:18:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o27xqwo",
          "author": "Low-Evening9452",
          "text": "Nice ad for your tool",
          "score": 12,
          "created_utc": "2026-01-28 14:34:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o29uhcq",
              "author": "Robin_Saunders",
              "text": "Yep he slipped it in there but he knows people will search it.",
              "score": 5,
              "created_utc": "2026-01-28 19:37:07",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o290o44",
          "author": "nachosareafoodgroup",
          "text": "You’re still not connecting.\n\nYou’re faking connection and interest to sell.\n\nYou’re being manipulative.",
          "score": 5,
          "created_utc": "2026-01-28 17:28:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2ctosw",
              "author": "borkborkibork",
              "text": "Welcome to Marketing & Sales",
              "score": 2,
              "created_utc": "2026-01-29 04:44:15",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2cu75p",
                  "author": "SadThrowaway-PlzHelp",
                  "text": "Thats BS. That’s why everyone *hates* marketing and salespeople.\n\nI’m in sales. B2B sales. My people love me.\n\nBecause I’m not manipulative.",
                  "score": 3,
                  "created_utc": "2026-01-29 04:47:37",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o2c9ca4",
              "author": "SadThrowaway-PlzHelp",
              "text": "Honestly. \n\nPretending that’s connection is honestly lowkey sociopathic.",
              "score": 1,
              "created_utc": "2026-01-29 02:41:23",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o29lytr",
              "author": "aashrun",
              "text": "Okay",
              "score": -1,
              "created_utc": "2026-01-28 18:59:07",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o27nhj9",
          "author": "belth1r05",
          "text": "Helpful. Thanks.",
          "score": 3,
          "created_utc": "2026-01-28 13:41:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o281gjf",
              "author": "aashrun",
              "text": "no worries!",
              "score": 1,
              "created_utc": "2026-01-28 14:52:21",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2fjpd0",
          "author": "New_Grape7181",
          "text": "I've noticed the same thing with DMs. People can smell a sales pitch from a mile away, but if you actually engage with what they said, they're surprisingly open to chatting.  \n  \nOne thing I'd add to your approach is using video in that second message instead of text. Once they've replied and shown interest, a 30-second personalised video explaining the tool (showing your face, maybe a quick screen recording) converts way better than another text message with a link. It keeps that human connection going rather than suddenly switching to \"here's my product page.\"  \n  \nWe saw our demo booking rate jump from around 15% to 40% just by swapping out text for video at that exact pivot point you mentioned. Plus it filters out tyre kickers since only genuinely interested people will watch.  \n  \nThe monitoring approach you described sounds solid. How are you qualifying which posts are actually worth engaging with beyond just keyword matches?",
          "score": 3,
          "created_utc": "2026-01-29 16:04:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2flb68",
              "author": "aashrun",
              "text": "Amazing advice! I'll take it actually. The end message is to personalisation it for the people you're reaching out to, right?\n\nOh btw, i use SleepLeads though. My own saas. Helps me get high intent leads.",
              "score": 1,
              "created_utc": "2026-01-29 16:11:22",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o27a8bh",
          "author": "kubrador",
          "text": "lol the \"ego-first dm\" is just complicated flattery but okay, it worked so i guess that's the plot twist. real talk though. you found people actively complaining about their problems then offered a solution, which is Sales 101 dressed up in reddit cosplay. the 65% reply rate probably just means you caught people while they were already thinking about fixing something, not because you unlocked some secret psychology hack.",
          "score": 2,
          "created_utc": "2026-01-28 12:21:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o28540l",
          "author": "AlinaHalak",
          "text": "100% agree with this.\n\nWe’ve been running a similar approach when reaching out to marketing agencies for white-label analytics partnerships.\nNo pitching, no offers in the first message — just context + validation.\n\nOur recent numbers:\n~60–65% reply rate\nseveral white-label partnership calls booked in the first weeks\nall from highly targeted, context-first DMs\n\nThe moment you position yourself as a peer, not a seller, the conversation opens naturally.\nIf anyone here is experimenting with partnership-led outreach (especially white-label models), would love to compare notes.",
          "score": 2,
          "created_utc": "2026-01-28 15:09:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o287s15",
              "author": "aashrun",
              "text": "Positioning is the key, couldn't agree more",
              "score": 1,
              "created_utc": "2026-01-28 15:22:03",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o290tli",
          "author": "tyson_sd",
          "text": "I do the exact same thing but 0 replies reality is redditors hate marketers \n\nPeople know who is a reddit and who is a marketers\n\nWhat works is just add really helpful valuable information for the context of the problem and be open about yourself anonymously and use brand affiliate tag, and let the user reach out to you rather than you spamming them. This is real situation and this is its happening.",
          "score": 2,
          "created_utc": "2026-01-28 17:28:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o29lsj8",
              "author": "aashrun",
              "text": "Buddy, we need to talk. Seriously.",
              "score": 1,
              "created_utc": "2026-01-28 18:58:22",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2d0wtf",
                  "author": "tyson_sd",
                  "text": "we can talk",
                  "score": 2,
                  "created_utc": "2026-01-29 05:34:14",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2badyy",
          "author": "MasonOx1",
          "text": "This is good and I have used some of these points before. \n\nMy only problem is I'm trying to help people make money......",
          "score": 2,
          "created_utc": "2026-01-28 23:34:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2fll7i",
              "author": "aashrun",
              "text": "Do you wanna discuss more about it on dms tho?",
              "score": 1,
              "created_utc": "2026-01-29 16:12:36",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2dkin0",
          "author": "beiveric",
          "text": "did this for a bit and yeah, “ego-first” works way better than a pitch. the part that still wrecked me was the constant hunting for fresh posts. opencord’s been nice for that since it watches reddit and spits out decent human-ish replies so i’m not living in search bars all day.",
          "score": 2,
          "created_utc": "2026-01-29 08:17:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2flhtj",
              "author": "aashrun",
              "text": "Try SleepLeads. You'll never be disappointed.",
              "score": 1,
              "created_utc": "2026-01-29 16:12:11",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2fip84",
          "author": "impatient_jedi",
          "text": "Stop using AI",
          "score": 2,
          "created_utc": "2026-01-29 15:59:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2flcv5",
              "author": "aashrun",
              "text": "Start leveraging AI",
              "score": 2,
              "created_utc": "2026-01-29 16:11:34",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2q7whp",
          "author": "satishpyrite",
          "text": "I almost fell for the sleepleads. Very good way to promote your product with any proofs. 😅",
          "score": 2,
          "created_utc": "2026-01-31 03:16:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o27gsw6",
          "author": "Tiny-Celery4942",
          "text": "I used to think cold DMs were a waste of time. I was so wrong. Your point about validating their posts first is key. People want to feel heard, not sold to.\n\nWhat actually worked for me wasn’t a tactic. It was turning LinkedIn into a daily habit.\n\nHere’s my loop:\n\n\\-    Build a prospect list.\n\n\\-   Create a \"mini feed\" just for those people.\n\n\\-   Warm them with real comments.\n\n\\-   Send connection requests only once they’re warm.\n\n\\-   First DM = context + one easy question.\n\n\\-   Treat follow ups like a pipeline.\n\nMass cold DMs and InMails without interaction were a waste.\n\nThis takes time, but it made results predictable. I use **Depost AI** to keep a targeted feed, draft comments and DMs, and track follow ups. It helps me stay organized.",
          "score": 3,
          "created_utc": "2026-01-28 13:03:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2k6uen",
              "author": "Business-Feedback896",
              "text": "No shot you using a product plug post to comment and plug your own lmfao",
              "score": 1,
              "created_utc": "2026-01-30 06:48:10",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o27hp5k",
          "author": "algatesda",
          "text": "Good strategy ,I also manual + Automation with AI to target messaging to ICP and booked 7 calls in 20 days .but I am curious what tool you use for alert you with post",
          "score": 2,
          "created_utc": "2026-01-28 13:08:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o281eq6",
              "author": "aashrun",
              "text": "Oh I use SleepLeads though. it's sleepleads dot io",
              "score": 0,
              "created_utc": "2026-01-28 14:52:07",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2k6qlx",
          "author": "Business-Feedback896",
          "text": "Can you not bring your LinkedIn type ChatGPT post product plug onto here?",
          "score": 1,
          "created_utc": "2026-01-30 06:47:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2selwy",
          "author": "AndesAndAlps",
          "text": "I mean really? That's what you've got. A psychology 101 mind trick? \n\nFuck me. Whoever closed a deal with you needs their fucking head checked.",
          "score": 1,
          "created_utc": "2026-01-31 13:51:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o283zva",
          "author": "pollinatedcorn",
          "text": "great insight, the key seems to be focusing on value in the first message instead of pitching right away and when the outreach feels like a conversation, reply rates go up fast",
          "score": 1,
          "created_utc": "2026-01-28 15:04:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o287w10",
              "author": "aashrun",
              "text": "Truly super fast.",
              "score": 1,
              "created_utc": "2026-01-28 15:22:33",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qp3vlf",
      "title": "Best way to get b2b clients for freelance",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qp3vlf/best_way_to_get_b2b_clients_for_freelance/",
      "author": "Silent_Jump608",
      "created_utc": "2026-01-28 06:36:45",
      "score": 14,
      "num_comments": 22,
      "upvote_ratio": 0.95,
      "text": "Hi all, \n\nHave 9+ YOE in digital marketing with 6+ years in b2b demand generation marketing \n\nI have worked and scaled channels like Google ads, LinkedIn ads and successfully set up Account based Marketing process in my previous experiences \n\nWhat is the best way to get clients for starting freelancing work ? \n\nIf anyone does freelancing, please help me with your journey as well",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qp3vlf/best_way_to_get_b2b_clients_for_freelance/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o265r8n",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-28 06:36:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o26ayqc",
          "author": "TemporaryKangaroo387",
          "text": "linkedin is still king for b2b freelance tbh. but not the cold DM spam everyone does\n\nwhat actually worked for people i know: post content about problems youve solved (\"how we cut CPL by 40% for X type of client\"), then when inbound comes you filter hard on fit. way better than chasing clients who dont know they need you yet\n\nwith 6 years of demand gen you probably have 10-15 case study worthy projects. those are gold for positioning\n\nare you thinking of specializing or staying generalist? that choice affects the whole strategy",
          "score": 6,
          "created_utc": "2026-01-28 07:19:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o266soz",
          "author": "josh-bfb2b",
          "text": "Outbound with a good offer to your ICP. \n\nCall, email, LinkedIn etc.\n\nOr, use gig websites for inbound.",
          "score": 2,
          "created_utc": "2026-01-28 06:45:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o26s2ip",
          "author": "algatesda",
          "text": "You have great expertise ,as said Linekdin is the best place to get good projects .For that you need to choose your target audience and offer to sell.I have created a doc I amusing to book 20+ Appointments every month .If you are interested DM will share .Its FREE",
          "score": 2,
          "created_utc": "2026-01-28 09:53:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o27j71y",
              "author": "theinventivecreative",
              "text": "can u DM it to me please? thanks!",
              "score": 2,
              "created_utc": "2026-01-28 13:17:40",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o2mhoux",
              "author": "No_Guest_3303",
              "text": "Dm me please too!",
              "score": 2,
              "created_utc": "2026-01-30 16:07:51",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2mjriw",
                  "author": "algatesda",
                  "text": "DM will share",
                  "score": 1,
                  "created_utc": "2026-01-30 16:17:07",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o2ho0dr",
              "author": "[deleted]",
              "text": "[removed]",
              "score": 1,
              "created_utc": "2026-01-29 21:56:36",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o27hhom",
          "author": "tzarhirovito",
          "text": "With ur background you already have a strong foundation to start freelancing. A good approach is to leverage your existing network first, past colleagues, LinkedIn connections, and industry contacts. Sharing case studies, ABM successes, and campaign results can attract attention. Many freelancers I know also find clients through LinkedIn outreach, targeted emails, and joining communities where decision makers hang out. Personally, I realized I couldn’t do it all alone, no time and not enough knowledge back then, and my audience was mostly good on LinkedIn so I hired a team to handle outreach and lead generation for me so it freed me up to focus on strategy and execution, and it worked really well, which i assume would work too as soon as u figure out where your ICP tends to be the most",
          "score": 2,
          "created_utc": "2026-01-28 13:07:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o27y3bu",
          "author": "less_is_more9696",
          "text": "\\- Build yourself a basic website - home page, services pages, testimonials/portfolio, contact page.   \n\\- Create testimonials/case studies that show the results of your previous work (\"how I grew X by X for client in X industry).  \n\\- Share the testamonials on Linkedin along with regularly posting marketing advice or insights to do some inbound/content marketing for your own business.  \n\\- Once your website is built and you have 2-3 good testamonials, do some cold outbound to company's that fall within your ideal client.",
          "score": 2,
          "created_utc": "2026-01-28 14:35:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o27swjb",
          "author": "lacrimboso",
          "text": "With your experience, start by showcasing case studies and results on LinkedIn and a personal website. Reach out to decision-makers directly via email or LinkedIn, join B2B networking groups, and offer a free audit or consultation to demonstrate value. Referrals also work ask past colleagues or clients for introductions. For finding leads efficiently, use Tomba.io to get contacts and start pitching.",
          "score": 1,
          "created_utc": "2026-01-28 14:09:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o29cmis",
          "author": "sanfranciscolady",
          "text": "I run a successful and busy agency doing organic marketing and content for b2b clients. Tell me more about what you do? I often bring in freelancers to work with clients as part of my broader team. Send me a DM!",
          "score": 1,
          "created_utc": "2026-01-28 18:19:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2dynmb",
          "author": "CommunityGlobal8094",
          "text": "great background, that experience combo should definitely attract clients. For finding actual clients to pitch, I'd focus on warm outreach first - hit up former colleagues, people you've worked with at agencies or past companies, and LinkedIn connections in your niche. Most freelancers I know get their first few clients from their existing network before needing to do any cold outreach.\n\n\nWhen you do need to expand beyond warm leads, I came across SMB Sales Boost recently and it looks like a solid option for building prospect lists. It's basically a database of newly registered businesses, so you can find companies that might need demand gen help before they're already locked into other vendors. Seems especially useful for your niche since new SMBs are usually activley looking for help with paid ads and lead gen.\n\n\nAlso worth setting up a simple case study page showing specific results from your previous roles (even anonymized ones). Metrics like CPA improvements or pipeline growth make a huge differece when pitching.",
          "score": 1,
          "created_utc": "2026-01-29 10:29:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2e2fz5",
          "author": "mohamednagm",
          "text": "Join warm Reddit discussions in your niche, leave helpful comments, and watch inbound interest grow.",
          "score": 1,
          "created_utc": "2026-01-29 11:01:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2p1djh",
          "author": "SignificanceBusy2136",
          "text": "You can pair firmographic and contact vendor data (Techsalerator, Uplead, Ect) to identify companies that match your ICP instead of guessing, and pair that again with personalized outreach on LinkedIn or email. There are also a few good freelancing gig sites that are well verified and vetted for quality.",
          "score": 1,
          "created_utc": "2026-01-30 23:12:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2tuoc2",
          "author": "CCMALLC",
          "text": "Do you have a clear ICP?",
          "score": 1,
          "created_utc": "2026-01-31 18:14:06",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qqfx3l",
      "title": "I never thought B2B LinkedIn could be this easy",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qqfx3l/i_never_thought_b2b_linkedin_could_be_this_easy/",
      "author": "JunaidRaza648",
      "created_utc": "2026-01-29 18:00:57",
      "score": 14,
      "num_comments": 25,
      "upvote_ratio": 0.77,
      "text": "I’ve actively started using LinkedIn, and I never thought it would be this easy.\n\nJust:\n\n1. Build an ICP\n\n2. Connect with them regularly\n\n3. Engage with them using valuable insights\n\n4. Create copies that truly resonate with them\n\n5. Let the algorithm do its job\n\nI’ve written and published a couple of copies this month, and engagement is increasing every single day.\n\nThe benefit?\n\nIf you produce quality content, it acts as a warm introduction, and founders respond.\n\nI’ve never received this much response before I started writing valuable copies.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qqfx3l/i_never_thought_b2b_linkedin_could_be_this_easy/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o2g9rzw",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-29 18:00:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2khnta",
          "author": "GrimLeeper",
          "text": "I started about a week ago, posting daily. How long before you started to see leads?",
          "score": 1,
          "created_utc": "2026-01-30 08:21:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2ko0z3",
              "author": "JunaidRaza648",
              "text": "It depends. The effectiveness of the content and whether you’re reaching the right prospects.\n\nAfter copy, your connections matter the most.\n\nIf everything is perfectly aligned, you can start seeing results within a month.",
              "score": 1,
              "created_utc": "2026-01-30 09:19:18",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o2pjdkp",
              "author": "SpicyChickenDeluxe",
              "text": "It's getting super easy now for me as well. I started posting 3x a week in Dec and 5x a week in January. The appointments come easy now.",
              "score": 1,
              "created_utc": "2026-01-31 00:51:33",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2l7m15",
          "author": "Mobile-Ambition-3714",
          "text": "Honestly love to see someone discovering how much return there is in just being consistent and thoughtful on LinkedIn for B2B. Most folks overthink it or chase hacks instead of just understanding who they want to reach and showing up with real value. It really does feel like the posts warm people up for you and conversations get way easier once your content puts you on their radar. Keep riding the momentum and tweaking as you learn what hits, it only gets better.",
          "score": 1,
          "created_utc": "2026-01-30 12:05:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2nht2m",
          "author": "justeatingtoothpaste",
          "text": "Do you reach out via DMs or just post and wait for the algo to work its magic?",
          "score": 1,
          "created_utc": "2026-01-30 18:47:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2pwb9c",
              "author": "JunaidRaza648",
              "text": "Depends on the situation. But mostly posting.",
              "score": 1,
              "created_utc": "2026-01-31 02:07:18",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2qoohi",
          "author": "Due-Tip-4022",
          "text": "Wish my icp gave a rats ass about LinkedIn.",
          "score": 1,
          "created_utc": "2026-01-31 05:09:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2qpl7m",
              "author": "JunaidRaza648",
              "text": "This rule works *everywhere*! Where is your audience *consuming* content?",
              "score": 1,
              "created_utc": "2026-01-31 05:16:21",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2qpv77",
                  "author": "Due-Tip-4022",
                  "text": "Just like anyone,  they watch whatever hobbies they have on say YouTube. Follow their friends on Facebook. That sort of stuff.",
                  "score": 1,
                  "created_utc": "2026-01-31 05:18:24",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2r9q0k",
          "author": "GTMSignals",
          "text": "Does posting gives better results ? And Dms looks like pushy or salesy what is best approach according to you",
          "score": 1,
          "created_utc": "2026-01-31 08:08:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2rdnhc",
              "author": "JunaidRaza648",
              "text": "Both. Not everyone is problem or solution aware.",
              "score": 2,
              "created_utc": "2026-01-31 08:45:26",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2rgyw8",
          "author": "Upcoming-best",
          "text": "I want to give it a try but am concerned about my employer finding out about my business.\n\nIts not in a competing market but I don’t want them to think I am less focused or dedicated.\n\nHave anyone tried LinkedIn while working a full-time job?",
          "score": 1,
          "created_utc": "2026-01-31 09:16:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2rqz87",
          "author": "InnerBuilding7949",
          "text": "I love to see people do things successfully and the others do the exact same things with less success. I hate secret and so-called magic recipe. The world dont operate that way, u need to accept the uncertainty and changes. For me, as a professional sales for years, I only do these things: bring the valued solution to the right persons at the right time. That's all!\nWish u all successful with your business!",
          "score": 1,
          "created_utc": "2026-01-31 10:52:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2sh4po",
          "author": "theninjadesigner",
          "text": "I consistently share valuable content on LinkedIn, but I do not always achieve the desired results. I often find myself hoping that a post performs well.\n\nI typically post at 1 PM; does the timing of my posts have an impact? If it would be helpful, I can also provide a link to my LinkedIn company profile for reference.",
          "score": 1,
          "created_utc": "2026-01-31 14:06:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2sk89g",
              "author": "JunaidRaza648",
              "text": "Business is all about P2P, not P2B.\n\nStart building personal brand.\n\n1. Connect with your prospects\n2. Then share valuable content",
              "score": 2,
              "created_utc": "2026-01-31 14:24:35",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2slbiy",
                  "author": "theninjadesigner",
                  "text": "Got it 👍",
                  "score": 1,
                  "created_utc": "2026-01-31 14:30:45",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2te0im",
          "author": "heyiamnickk",
          "text": "Yeah, exactly... once you’re consistent, outreach doesn’t even feel like outreach anymore. People already know you from your posts, so replies feel natural. That’s when it starts compounding.",
          "score": 1,
          "created_utc": "2026-01-31 16:54:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2tpwlb",
              "author": "JunaidRaza648",
              "text": "Couldn't agree more.",
              "score": 1,
              "created_utc": "2026-01-31 17:51:48",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2zfzhx",
          "author": "EmilyRothGold",
          "text": "Are you talking on posts or Newsletters?",
          "score": 1,
          "created_utc": "2026-02-01 15:33:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2zp6bp",
              "author": "JunaidRaza648",
              "text": "Posts. NL is a seperate entity I manage.",
              "score": 1,
              "created_utc": "2026-02-01 16:16:33",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2kb0f8",
          "author": "_forgotmyownname",
          "text": "Yep, consistency and relevance beat everything. Good content really does warm up leads.",
          "score": 0,
          "created_utc": "2026-01-30 07:22:35",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qpfbsf",
      "title": "Spent 8 months building a faceless YouTube channel for our B2B SaaS, here's the full breakdown",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qpfbsf/spent_8_months_building_a_faceless_youtube/",
      "author": "Independent_Plum_489",
      "created_utc": "2026-01-28 16:01:28",
      "score": 13,
      "num_comments": 8,
      "upvote_ratio": 1.0,
      "text": "Started this project back in May 2025 when our CEO asked me to explore video content without putting anyone from the team on camera. We're a 12 person company selling workflow automation software to mid market operations teams, and nobody wanted to be the face of the brand. Fair enough.\n\nThe goal was simple: create educational content about operations workflows, process documentation, and automation best practices. Target audience is ops managers and directors at companies doing $10M to $50M revenue. We figured YouTube could be a long term play for inbound since our blog was already ranking decently.\n\nMonth 1 and 2 were rough. I tried the classic stock footage plus voiceover approach. Hired a freelancer on Upwork for $400 per video to edit together B roll with our scripts. The videos looked... fine? But retention was terrible. Average view duration was under 40 seconds on 6 minute videos. Comments were mostly spam bots.\n\nThe problem was obvious in hindsight. B2B buyers want to see a person. They want to feel like someone is teaching them, not watching a corporate explainer with generic office footage. But again, nobody on our team wanted to be on camera, and hiring a spokesperson felt weird for a small company.\n\nMonth 3 I started experimenting with AI generated presenters. Tested a bunch of tools over about 6 weeks. Synthesia was the first one I tried since they're the most well known. Quality was decent but the pricing didn't work for us at our volume, and the avatar movements felt a bit stiff for longer educational content. Tried HeyGen next which had better pricing tiers but I ran into some consistency issues when I needed the same presenter across multiple videos with different outfits and backgrounds. Also looked at D-ID and Colossyan. Each had tradeoffs.\n\nEventually landed on a workflow using APOB for generating the presenter visuals and combining that with ElevenLabs for voice. Took me a solid week to figure out the lighting settings though because the default outputs kept looking overexposed when I tried to match our brand's cooler color palette. Had to regenerate a bunch of images before I got the hang of it. The key thing that worked for our use case was being able to maintain the same face across dozens of videos while changing everything else. Our fictional presenter Sarah now has appeared in 34 videos wearing different outfits in different virtual office settings, and she looks like the same person in all of them. That consistency matters more than I initially thought because returning viewers actually recognize her now.\n\nMonth 4 through 6 was pure iteration. We posted twice a week, tested different video lengths, thumbnails, titles. What actually moved the needle:\n\nSwitching from 6 to 8 minute videos down to 3 to 4 minute focused tutorials. Retention jumped from 38% to 52% average.\n\nAdding chapters and timestamps. Sounds basic but our audience skips around a lot.\n\nMaking thumbnails that show Sarah's face plus a specific problem statement. CTR went from 2.1% to 4.8% on average.\n\nPosting at 7am EST Tuesday and Thursday. Our audience is US operations managers who apparently watch YouTube before their morning meetings.\n\nMonth 7 and 8 is where things got interesting. We hit 2,400 subscribers which isn't huge but the quality of those subscribers matters more. Started getting comments from actual ops managers asking specific questions. More importantly, we can now trace 11 demo requests directly to YouTube in our attribution. We use HubSpot with UTM tracking on all our video description links, plus we added a \"how did you hear about us\" field to our demo form. 8 of those 11 explicitly mentioned YouTube or referenced specific video topics. The other 3 came through tracked links. At our ACV of $18k, if even half of those convert at our typical 35% demo to close rate, we're looking at around $70k in actual revenue from this channel. The $198k pipeline number is all 11 at full ACV which is optimistic but that's how we report it internally.\n\nTotal cost breakdown for the 8 months:\n\nAI tools and subscriptions: roughly $2,100\n\nElevenLabs voice generation: $660\n\nVideo editing software and stock music: $340\n\nFreelancer for thumbnail design: $850\n\nMy time: approximately 6 hours per week which I'm not counting since this was part of my role anyway\n\nSo under $4k in hard costs. Compare that to what a video production agency quoted us initially which was $3,500 per video. We would have spent $119k on 34 videos.\n\nThe weird part is that I don't think anyone watching knows or cares that Sarah isn't real. We've never tried to hide it but we've also never announced it. One commenter asked if she was AI generated and I just replied honestly. Nobody seemed to care, the conversation moved on to the actual content topic.\n\nBiggest lessons from this whole thing:\n\nConsistency of the presenter matters way more than I expected. Random stock footage people in every video kills any sense of relationship with the audience.\n\nB2B audiences on YouTube are more forgiving of production quality than I assumed. They care about the information being useful, not cinematic lighting.\n\nThe compounding effect is real but slow. Month 1 through 4 felt like shouting into the void. Month 5 onward the algorithm started actually pushing our content.\n\nHaving a face, even a synthetic one, makes a massive difference versus pure screen recordings or stock footage compilations.\n\nStill early days and I have no idea if this scales to 10k or 50k subscribers. But for now it's working as a supplement to our other demand gen efforts.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qpfbsf/spent_8_months_building_a_faceless_youtube/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o28gpvg",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-28 16:01:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o28jb4c",
          "author": "Visual-Sun-6018",
          "text": "That 11 demo trace to an $18k ACV is the only metric that matters. Congrats on the pipeline. The consistency point is huge. B2B buyers just want a familiar teacher they can trust, even if she's synthetic. Are you finding that the AI voice from ElevenLabs holds up for the full 4 minutes or do you have to do a lot of manual pacing tweaks to keep it from sounding monotonous?",
          "score": 2,
          "created_utc": "2026-01-28 16:12:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o28ow6j",
          "author": "Tampa89",
          "text": "Please share your YouTube page. Curious to see how the avatars and videos look.",
          "score": 2,
          "created_utc": "2026-01-28 16:36:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o28jcls",
          "author": "TemporaryKangaroo387",
          "text": "this is gold, thanks for actually sharing the specifics instead of just \"we did youtube and it worked\"\n\ncouple things that stood out:\n\n1. the consistency point about the same presenter across videos is underrated. i think this matters even more for B2B because buyers are slower to trust and need that familiarity over multiple touchpoints before they convert\n\n2. curious about your workflow now -- how long does one video take from script to publish? and are you writing the scripts yourself or using AI for drafts?\n\n3. re: tracking signups back to youtube -- are you seeing people mention specific videos on demo calls, or is it more \"i found you on youtube\" generally? trying to figure out if longer educational content actually influences purchase decisions or if its more top of funnel awareness\n\nalso random observation: the fact that YouTube content shows up in AI search results now (chatgpt, perplexity, etc) makes video even more interesting as a long term play. your educational content might end up being cited when people ask AI tools about operations workflows",
          "score": 1,
          "created_utc": "2026-01-28 16:12:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2a92mb",
          "author": "bundlesocial",
          "text": "How many accouts you posting on?\n\nasking from technicall standpoint. Maybe you can run those scripts for different languages to multiply the income stream?",
          "score": 1,
          "created_utc": "2026-01-28 20:42:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2a9t46",
              "author": "bundlesocial",
              "text": "as for tools, you post them manually or have a workflow set up. (now I wanna plug our social media API that has no account limits)",
              "score": 1,
              "created_utc": "2026-01-28 20:45:29",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2anxkf",
          "author": "unicorn69love",
          "text": "stock footage VO is dogshit for B2B retention, ai presenters are the move even if theyre stiff at first. i ditched the manual grind with vidmachine it auto gens scripts ideas visuals via veo/sora + elevenlabs voice and posts direct to yt. cut my time to like 5 mins setup per batch, views held 2x longer.",
          "score": 1,
          "created_utc": "2026-01-28 21:47:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2cgvsy",
          "author": "Worldly_Row1988",
          "text": "Did you make any Adsense revenue from the YouTube channel?",
          "score": 1,
          "created_utc": "2026-01-29 03:23:48",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qpjkq1",
      "title": "Generating quality b2b leads that actually convert",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qpjkq1/generating_quality_b2b_leads_that_actually_convert/",
      "author": "Tad_Astec",
      "created_utc": "2026-01-28 18:27:30",
      "score": 13,
      "num_comments": 43,
      "upvote_ratio": 1.0,
      "text": "We’ve tried outreach campaigns, cold emails, and LinkedIn ads, but leads are low-quality or unresponsive. How do others in b2b marketing generate leads that are actually interested?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qpjkq1/generating_quality_b2b_leads_that_actually_convert/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o29ej73",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-28 18:27:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o29l3bv",
          "author": "Uzzzi_1610",
          "text": "Cold dm and emails are old fashioned in lead generation, currently people who get leads through paid ads are winning. Not only they get leads but it convert too. This is current market situation and best way to grow your business.",
          "score": 3,
          "created_utc": "2026-01-28 18:55:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o29x8lw",
              "author": "Tad_Astec",
              "text": "So paid ads are the best approach you say",
              "score": 1,
              "created_utc": "2026-01-28 19:49:29",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o29xkpj",
                  "author": "Uzzzi_1610",
                  "text": "Yes. In this competition age you can only be ahead of yor competitors through this approach.",
                  "score": 1,
                  "created_utc": "2026-01-28 19:50:58",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2e2u5u",
          "author": "rolandsozolins",
          "text": "Think what are necessary conditions for B2B buyer to be interested in talking with you.\n\nI believe these are 4:\n\n1. get attention\n\n2. demonstrate ability to solve the problem\n\n3. build trust\n\n4. sell the first-step offer (a workshop, a demo, an audit, POC, etc).\n\nIt is almost impossible to meet these 4 requirements with any form of cold communication.\n\n  \nMy team has ran over 150 lead generation campaigns for IT service providers in last 18 months. and we had generous liberty to experiment with multiple offers, messages and channels.\n\nWe tried many things and at the end we settled on live webinars.\n\nWhy?\n\nBecause they specifically allow to cover all 4 necessary conditions in one go.\n\nYou can literally end up webinar with some leads signed up for your offer.\n\nAnd additionally get a list of leads scored by \n\n\\-their profile, \n\n\\- behaviour during the webinar \n\n\\- their company fit rating for your offer and \n\n\\- brief company research.\n\nHowever, there are quite a lot of nuances how to make webinars work and every nuance must be taken care of. There are too many to describe in the post.",
          "score": 3,
          "created_utc": "2026-01-29 11:05:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2hl8xj",
              "author": "Maia9779",
              "text": "How have you been using live webinars to generate results? What nuances did you mention?",
              "score": 1,
              "created_utc": "2026-01-29 21:43:28",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o29x3dw",
          "author": "Impressive-Amount255",
          "text": "I guess the first question is, what do you call a lead?\nAnd how do you define that as low quality?\nBecause many of your activities may actually show that people have some kind of interest in the topic, not necessarily that they are ready to buy.\nHow long have you been trying?\nAre you nurturing these leads?\nAre you immediately trying to close the sale right after someone shows interest in anything you're talking about?\nTo fix that problem, you need to have a very clear definition of what is a lead and when is the right time to actually talk product versus just nurturing that lead.\nMy suggestion is to look at how you can integrate all of your different channels together so that you can gently push these people down your sales funnel until the time comes that you can close the deal.",
          "score": 2,
          "created_utc": "2026-01-28 19:48:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o29tdc7",
          "author": "erickrealz",
          "text": "Low quality leads usually means your targeting sucks or your messaging is too vague. You can't just blast \"we help B2B companies grow\" and expect decision makers to care. Our clients who actually get quality leads narrow their ICP to one specific industry and one specific pain point, then build lists of companies showing buying signals like recent funding, new hires, or tech stack changes.\n\nFor cold email specifically, stop using generic copy. Reference something specific about their business in the opener and explain exactly what outcome you deliver, not just what you do. If you're getting responses but they're unqualified, your offer is probably attracting the wrong people or you're not filtering hard enough during list building.\n\nLinkedIn ads are expensive as hell for lead gen. They work better for retargeting people who've already engaged with your outreach. Focus your budget on building better lists and testing different value props through cold email first. Quality beats volume every damn time.",
          "score": 4,
          "created_utc": "2026-01-28 19:32:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o29xltf",
              "author": "Tad_Astec",
              "text": "But doing such is also time consuming and expensive. Going industry by industry to determine who's the best candidate and then end up not getting the contract",
              "score": 1,
              "created_utc": "2026-01-28 19:51:06",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2bqxy9",
          "author": "ObjectIndependent827",
          "text": "Reddit has been way better for me than cold outreach. People here are discussing about almost every problems. But, it is still so hard to find the discussions where you could help. That is why, I started using a lead gen AI tool called leadmatically to automatically discover leads about my services. Now, I don't have do the search process at least and it saves me a lot more time than I expected.",
          "score": 2,
          "created_utc": "2026-01-29 01:00:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2a2b36",
          "author": "ComprehensiveTax1233",
          "text": "Low-quality leads don’t mean your channels are broken.They mean your targeting is lazy.\nIf you’re talking to people who could buy instead of people who feel the pain right now, nothing converts.\nVolume won’t save bad timing.If your message fits everyone, it convinces no one.",
          "score": 1,
          "created_utc": "2026-01-28 20:12:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2dwetg",
          "author": "AioliPublic3177",
          "text": "ICP + relevance of outreach more than tools alone. When you target the right buyer with messages that speak directly to their situation, replies and meetings jump way up. Pair that with clean data and consistent follow-ups, and conversion becomes predictable instead of hit-or-miss.",
          "score": 1,
          "created_utc": "2026-01-29 10:09:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2e1xev",
          "author": "mohamednagm",
          "text": "Cold outreach barely works anymore, so it’s not worth spending time on it. Instead, focus on monitoring warm leads and engaging with people who are already responding - those are the ones you can actually convert into customers.\n\nWhen someone asks a question or clearly states a problem they need solved, that’s your moment to step in and convert.\n\nI’m happy to help if you want more details or support with implementation.",
          "score": 1,
          "created_utc": "2026-01-29 10:57:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2yuw1l",
              "author": "ernosem",
              "text": "Cold outreach works, if you have some crazy offer.. eg. I'll run your campaigns for free, or you only pay if.. etc.   \n(But this not what we are doing, but I've seen working, however the clients you got from this approach are questionable, probably you just scoop up the bad ones.)",
              "score": 1,
              "created_utc": "2026-02-01 13:39:08",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2ep9fi",
          "author": "Dangerous_Bowler3286",
          "text": "From my experience, the issue usually isn’t the channel  it’s how outreach is structured. Quality B2B leads come from relevance and timing, not volume. Cold email still works when you anchor on real buying signals (hiring, growth, role changes) and narrow targeting before scaling.\n\nWhat made a difference for us was treating outreach as a system: define ICP → enrich the right accounts → email-first outreach → LinkedIn as support → consistent follow-ups → track replies, not opens. That aligns with solid B2B best practices  relevance beats surface-level personalization, and timing beats brute force.\n\nOnce we focused on conversations instead of pitches and avoided over-automation, reply quality improved a lot. Curious how others are spotting intent before launching campaigns?",
          "score": 1,
          "created_utc": "2026-01-29 13:36:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2fda3i",
          "author": "Ok-External3080",
          "text": "There’s a lot to unpack here because B2B marketing is difficult and they don’t teach this in school. So it’s imperative that you have a good strategy first and a mechanism to test if your strategy could work. In terms of leads, it’s the responsibility of the sales teams to ensure that they are converting the right prospects from your ICP. Marketing should typically focus on making sure that your prospects are not only knowledgable about your product but can also flag when there is an interest. Effectively, both sales and marketing need to be two sides of a strategy to convert a lead to a buying customer.\n\nI read somewhere in this thread that paid is the only way to generate leads, and I disagree with that. There are far too many factors to consider before you jump in with a paid strategy.\n\nI also see a lot of good advice in here about who your lead is and why they should care about what you have to offer. This is good advice because it helps you understand at what point in your funnel your prospects are willing to learn more and share their email with you. This is what should drive your overall strategy to help nurture, engage with more focused content or actually move towards a demo. Please remember, LinkedIn is not the only place where you can reach your ICP. Meaning you need a multi channel strategy that is based on data to show where your prospects are engaging with your content at the least possible price, with meaningful content.\n\nI help clients with B2B strategy and I have this conversation every single day, and I dont get bored. And the truth is, just because the strategy worked with someone else doesn’t mean it will work for you as well. Your product and your services are different from the others and require focussed attention to the funnel strategy.\n\nNo easy way out!",
          "score": 1,
          "created_utc": "2026-01-29 15:35:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2fhfb3",
          "author": "Wrong-Finish7655",
          "text": "We ran a few campaigns like that. Most “volume” lists are trash, lots of bounces. Focusing on a clean base and filtering by title/industry always helped more than fancy enrichment.\n\nFor scale, we use LeadCourt sometimes — you can set filters by designation, org size, location, then enrich with email/phone.",
          "score": 1,
          "created_utc": "2026-01-29 15:54:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2fpitd",
          "author": "New_Grape7181",
          "text": "I had the same issue until I realised our timing was completely off. We were reaching out to anyone matching our ICP criteria, but not considering whether they actually needed our solution right now.  \n  \nWhat changed things for us was focusing on intent signals rather than just demographic fit. We started tracking things like job postings (if they're hiring for a role our product helps), funding announcements, tech stack changes, and LinkedIn activity showing they're researching problems we solve.  \n  \nThen we switched from generic outreach to personalised video messages. Instead of a templated email, I'd record a 30-second video referencing something specific about their company and explaining why I thought we could help. Response rates jumped from about 3% to over 20%.  \n  \nThe quality improved massively because we were catching people at the right moment, and the video format meant they could see we'd actually done our homework rather than just adding them to a spray-and-pray list.  \n  \nWhat signals are you currently using to qualify leads before reaching out?",
          "score": 1,
          "created_utc": "2026-01-29 16:30:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2hupbg",
              "author": "ajjame78",
              "text": "You actually get people to open videos with cold outreach? How does that not drop you in spam?",
              "score": 1,
              "created_utc": "2026-01-29 22:29:11",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2m20h2",
                  "author": "New_Grape7181",
                  "text": "Via LinkedIn you don't need to worry about dropping into spam. We use Stack BD and the videos always native in their inbox so no dodgy link to click on",
                  "score": 1,
                  "created_utc": "2026-01-30 14:55:57",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2g72pj",
          "author": "Right-Will8093",
          "text": "There are lots of ways, but for B2B specifically your best shot is finding active subreddits and other communities where your target market hangs out\n\nThen track the posts and comments for anyone asking for advice/insights/solutions, and provide value\n\nIt's a better way to build relationships and get booked calls with qualified prospects, especially if your product/service is on the high-ticket side",
          "score": 1,
          "created_utc": "2026-01-29 17:48:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2gazmw",
          "author": "Even-Signature-5286",
          "text": "For most companies, there are a number people who're already in the buying stage. These people use specific keywords find products they intend to buy. When you optimize your website content around those keywords, and write content in a compelling way to sell your product, leads and sales come in organically.\n\n\"Best \\[industry\\]\\[use case\\] software/tool/app\" For people searching for a product relevant to their industry\n\n\"Best \\[software name/tool name/app name\\] Alternatives\".  For people trying to switch to another product that better meets their requirements.",
          "score": 1,
          "created_utc": "2026-01-29 18:06:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2jw0pz",
          "author": "Best-Fun-4742",
          "text": "Live webinars, on-demand demo snippets, and highly targeted LinkedIn campaigns (with tailored creative per segment) often outperform generic cold outreach if done with a cohesive value narrative",
          "score": 1,
          "created_utc": "2026-01-30 05:24:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2khmko",
          "author": "Lysiane-Dumont",
          "text": "Investir dans une stratégie de contenus : ça prend plus de temps, mais c'est efficace.  \nPar exemple, un livre blanc bien travaillé avec des interventions d'experts : ça te positionne sur ton secteur et ça te ramène de beaux leads (et en plus, tu disposes de contenus réutilisables)",
          "score": 1,
          "created_utc": "2026-01-30 08:20:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2l91rg",
          "author": "MendMySoulXoXo",
          "text": "Reddit.",
          "score": 1,
          "created_utc": "2026-01-30 12:15:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2mhkut",
          "author": "unicorn69love",
          "text": "cold emails flop cuz theyre generic trash - been there. clienthunter uses ai to hunt qualified prospects by industry/role/size then spits out personalized sequences with smart followups, bumped my replies from crap to actually usable without the manual grind",
          "score": 1,
          "created_utc": "2026-01-30 16:07:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2mk2ob",
          "author": "Humantic_AI",
          "text": "we also have the same question 😂",
          "score": 1,
          "created_utc": "2026-01-30 16:18:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2n5hzj",
          "author": "MSpecialistHere",
          "text": "SEO is winning strategy for getting new leads for any B2b business.",
          "score": 1,
          "created_utc": "2026-01-30 17:54:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2qg3q1",
          "author": "CCMALLC",
          "text": "I was researching a topic earlier and something helpful to your question popped up. There's some tools specifically for this issue you expressed.  One I remember I believe was called zoominfo or something like that.  I believe the other names will come up if you try pulling up this one. If you don't get anything let me know and I'll pul up my search history from today.",
          "score": 1,
          "created_utc": "2026-01-31 04:09:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2yw2z8",
          "author": "ernosem",
          "text": "Have you tried Microsoft Ads? If you target B2B, there are really great buyers out there on that channel.   \nAlso many people mentioned Google Ads, that's decent as well.   \nBut you need to put the framework together, it's not just you throw some money out and see what happens. You need to define your ICPs, create landing pages, write ads that addresses your USPs and the landing page for showing your expertise, case studies and such.   \n\n\nYou even can generate leads from Facebooks, fairly similar approach, target your customers' pain points",
          "score": 1,
          "created_utc": "2026-02-01 13:46:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o34bxag",
          "author": "Naive_Bed03",
          "text": "thewayhow has proven methods for finding and nurturing high-quality B2B leads, a practical alternative to expensive lead-gen tools.",
          "score": 1,
          "created_utc": "2026-02-02 07:42:43",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qpsnv0",
      "title": "b2b creative testing is so different from dtc, here's what I learned",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qpsnv0/b2b_creative_testing_is_so_different_from_dtc/",
      "author": "Latter-Giraffe-5858",
      "created_utc": "2026-01-29 00:07:00",
      "score": 12,
      "num_comments": 13,
      "upvote_ratio": 1.0,
      "text": "I moved from a dtc brand to b2b saas 6 months ago and the creative strategy is completely different. everything I thought I knew about what makes good ads had to get thrown out.\n\nIn dtc you can get away with emotional, flashy, attention-grabbing stuff because you're selling on impulse. B2b buyers are researching for weeks or months before they even fill out a form, they want substance not entertainment.\n\nI tested probably 30 different creative concepts in the first 3 months and the patterns were surprising. The polished, professional looking ads that would've flopped in dtc actually perform best. The decision makers don't want messy ugc style content, they want to feel like they're dealing with a legitimate company.\n\nAlso the messaging has to be way more specific, can't just say we help you grow or we make things easier. The need to call out the exact problem they're dealing with and show you understand their world. Generic value props get ignored immediately.\n\nThe creative that works best for us now is case study focused. Showing real results from real companies in their vertical, with actual data not just testimonials. It takes way longer to produce because you need to work with customers to get permission and pull the numbers but the performance makes it worth it.\n\nStill figuring this out but the learning curve has been steep.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qpsnv0/b2b_creative_testing_is_so_different_from_dtc/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o2bgoht",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-29 00:07:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2bgx5f",
          "author": "Funny-Affect-8718",
          "text": "curious how long your sales cycles are, we're dealing with 3-4 month cycles and trying to figure out if we should even bother with creative testing or just focus on retargeting",
          "score": 3,
          "created_utc": "2026-01-29 00:08:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2bkdat",
          "author": "Responsible-Brick881",
          "text": "What channels are you guys using?",
          "score": 3,
          "created_utc": "2026-01-29 00:26:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2bgz3k",
          "author": "Optimal_Excuse8035",
          "text": "made the same transition last year and struggled with the same stuff, dtc tactics just don't translate at all. the sales cycle length changes everything",
          "score": 2,
          "created_utc": "2026-01-29 00:08:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2ea6l8",
              "author": "astillero",
              "text": "Everything that works great in B2C flops in B2B. \n\nComplete eye opener.",
              "score": 1,
              "created_utc": "2026-01-29 12:02:04",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2bleeh",
          "author": "Kindly_Watercress416",
          "text": "Great insight",
          "score": 2,
          "created_utc": "2026-01-29 00:31:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2gv8py",
          "author": "Kamel_Ben_Yacoub",
          "text": "Since your case studies work well, you should definitely try Thought Leader Ads format featuring your customers or some industry influencers.\n\nIt's about using an organic post as an ad. The powerful thing is they look like a real post and not like an advert. They work great for B2B SaaS with long sales cycles and complex products.\n\nWe've seen significantly higher engagement with Thought Leader Ads compared to traditional single image ads for all our B2B clients. The personal credibility of a real customer or industry expert profile is way more efficient than a traditional single image.\n\nA few approaches that work:\n\n**Customer partnerships TLAs:**\n\n* Have successful customers share their results/experience from their personal profile.\n* You promote their post to your ICP.\n\n**Executive/founder TLAs:**\n\n* Your CEO or product experts sharing insights of one of your case study.\n* Builds personal brand alongside company brand.\n\nMore authentic than brand testimonials + decision-makers trust more people than logos.",
          "score": 2,
          "created_utc": "2026-01-29 19:39:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ff449",
          "author": "Intrepid_Boss9449",
          "text": "Sounds about right. B2B buyers want proof and specifics, not flashy stuff. ",
          "score": 1,
          "created_utc": "2026-01-29 15:43:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ha0dg",
          "author": "yngbld5",
          "text": "B2B and B2C are quite different.  Consumers are transactional and purchase risk is low. There are no impulse buys in B2B.  Buyers are deliberate and distracted by the many challenges faced each day. The larger the deal, the higher the risk. Sole decision makers become buying groups of multiple decision-makers, representing different stakeholders with unique interests, and long sales cycles get even longer. \n\nB2B is a long game and intimate understanding of specific ICP needs and priorities is vital. \n\n ",
          "score": 1,
          "created_utc": "2026-01-29 20:49:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2k9vh9",
          "author": "_forgotmyownname",
          "text": "Lol same here, I moved from consumer stuff to B2B and had to unlearn a ton. Case studies and real data >anything “cool” or viral.",
          "score": 1,
          "created_utc": "2026-01-30 07:12:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2m78yx",
          "author": "chandj054",
          "text": "i’ve seen a lot of marketers hit that same wall when they move from dtc to b2b saas. i’d say you’re on the right track by leaning into polished, case study driven creatives that speak directly to specific problems and real outcomes. i’d keep doubling down on vertical specific stories and data, and use verification tools like emailverifier io to make sure your b2b lists are clean so your strong creatives actually reach real decision makers.",
          "score": 1,
          "created_utc": "2026-01-30 15:20:38",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qpbvvn",
      "title": "How to start good B2B marketing? (Looking for advice)",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qpbvvn/how_to_start_good_b2b_marketing_looking_for_advice/",
      "author": "aronzskv",
      "created_utc": "2026-01-28 13:50:59",
      "score": 12,
      "num_comments": 39,
      "upvote_ratio": 1.0,
      "text": "I have been in the process of setting up my freelance business over the last year. I feel like I have not figured out the correct marketing tactic yet, since I do not have much experience in marketing.\n\nThe business is focussed on digitisation and automation of tasks for businesses in europe, mainly focussing on reducing redundant use of AI, as a lot of things can be automated without or with less AI.\n\nMy current idea for the marketing would be to scan Google Maps for potential clients (using queries with certain niches/industries and cities, so it will not be a general scrape but location and industry specific), to then cold email with personalized messages based on the available data (industry/niche, location, size, etc) with potential solutions and how I could help them set it up.\n\nI feel like this is not yet enough, and I would like to start looking into other options like Reddit or LinkedIn. How would you tackle this process?",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qpbvvn/how_to_start_good_b2b_marketing_looking_for_advice/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o27pc3p",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-28 13:50:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o27qi6z",
          "author": "Mike-Nicholson",
          "text": "It’s too big an answer for Reddit, but I’ll try to summarise how you can start fairly cheaply, based on how we help our clients:\n\n(1) → Define your ideal client ///\n(2) → Define the problems you solve for them ///\n(3) → Build a list of them in Sales Nav ///\n(4) → Replicate that list in Ads Manger ///\n(5) → Write content that talks about how you solve problems on LinkedIn ///\n(6) → Listen to the leads list you built for opportunities to build a relationship ///\n(7) → Boost your personal, organic LinkedIn content into your audience segment using Ads Manager.\n\nGood luck! 🧡",
          "score": 6,
          "created_utc": "2026-01-28 13:57:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o27rpu3",
              "author": "aronzskv",
              "text": "Amazing, thank you!\nDo you reckon it would be doable without having to pay at least 120eu/month for Sales Nav? Is there any ways to replicate it using custom built software (or the API) or cheaper replacements?",
              "score": 2,
              "created_utc": "2026-01-28 14:03:21",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o27sbyy",
                  "author": "Mike-Nicholson",
                  "text": "You are welcome. The Sales Nav part gives you advanced search for your ICP, and a clean social listening newsfeed just for your leads, so it’s a big part of the process.\n\nWithout it you would be talking but no listening - possible but not ideal.",
                  "score": 1,
                  "created_utc": "2026-01-28 14:06:34",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2836rs",
          "author": "Dangerous_Bowler3286",
          "text": "To start good B2B marketing, you need a structured outreach process that combines targeting, personalization, and automation.   \n  \nFirst, clearly define your ideal customer profile (ICP) in your case, businesses in Europe focused on digitization and automation. Use tools to identify and enrich potential leads, ensuring you have accurate contact information and relevant details about their needs.\n\nStart with cold email outreach personalize each message based on the company’s industry, recent activity, or pain points. LinkedIn and Reddit can be excellent for additional research and warmth-building before direct outreach. Use multi-channel outreach to reinforce your messages without overwhelming prospects.\n\nFor scaling, automate the follow-ups, track engagement, and sync responses to your CRM for better tracking. You can also A/B test your subject lines and email copy to find what resonates. This way, you can focus on relevant conversations rather than chasing random leads.\n\nCurious how are you planning to manage the balance between personalization and automation in your outreach?",
          "score": 2,
          "created_utc": "2026-01-28 15:00:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o285j5v",
              "author": "aronzskv",
              "text": "So my current idea (which I have tried for clients), is for the biggest part of the automations being in the finding of lists of companies and their details, and potential enrichment and classification (wherever possible).\n\nAlso, the system will have template and example emails, which then will be provided to a LLM (those known to be best for writing copy like gpt4.5) with the company profile, and based on the information (usually industries, niches, maybe additional info if found) would then be used to identify how exactly how I could help them in rough ideas based on common practices in the industry.\n\nUsing this I should be able to send a decent number of emails als cold outreach, and personally respond to any questions that follow.",
              "score": 1,
              "created_utc": "2026-01-28 15:11:42",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o299t9g",
          "author": "Intrepid_Boss9449",
          "text": "Scanning Google Maps and cold emailing can work but it’s slow and low response. Try LinkedIn for better targeting and real conversations. Also check out Reddit with tools like SocListener to find sales posts and drop quick replies that fit the convo, it’s less spammy and can get you leads faster.",
          "score": 2,
          "created_utc": "2026-01-28 18:07:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o29qgzc",
          "author": "erickrealz",
          "text": "Cold email from Google Maps scraping can work but the targeting is super broad. You're better off identifying specific industries that have obvious automation needs (like accounting firms drowning in data entry or logistics companies with manual scheduling) and building targeted lists through Apollo or LinkedIn Sales Navigator instead of just scraping random businesses from Maps.\n\nOur clients selling automation services succeed when they lead with a specific pain point, not generic \"we automate stuff.\" Instead of \"I help businesses with digitization,\" try \"I help logistics companies eliminate 15 hours weekly of manual route planning.\" Pick one vertical, nail your messaging for that specific problem, then expand once you've got 5-10 clients.\n\nReddit won't work for B2B freelance services unless you're genuinely participating in industry communities for months before mentioning your services. LinkedIn works better for building credibility through content and direct outreach to decision makers, but it's slower than cold email for getting your first clients.\n\nFocus on cold email to 30-50 highly targeted prospects daily with personalized value props. That'll get you clients faster than spreading yourself thin across multiple channels you don't understand yet.",
          "score": 2,
          "created_utc": "2026-01-28 19:18:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2dy2zm",
              "author": "aronzskv",
              "text": "Thanks! That is indeed what I was looking to do, mainly finding companies in certain niches/industries and offering them to automate tasks within those fields (with high customisability). Most of this I am already automating!",
              "score": 1,
              "created_utc": "2026-01-29 10:24:00",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2afwdg",
          "author": "KissyyyDoll",
          "text": "Scanning Google Maps is okay for local businesses, but for tech and automation in Europe, you’ll probably find more success on LinkedIn.\n\nInstead of just cold emailing, try sharing some quick tips or \"before and after\" examples of tasks you've simplified without using heavy AI. People love seeing how they can save money or time without adding more complex tools to their stack. Since you are focusing on the European market, maybe join some specific industry groups on LinkedIn or even here on Reddit to see what problems owners are complaining about. It makes the \"selling\" part feel much more like just helping someone out.",
          "score": 2,
          "created_utc": "2026-01-28 21:12:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2dy5yl",
              "author": "aronzskv",
              "text": "Definitely a good idea on how to do the marketing part, thanks!!",
              "score": 1,
              "created_utc": "2026-01-29 10:24:45",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2d3ixf",
          "author": "supriya_l89",
          "text": "B2B companies in their early development phase should avoid spending excessive time on planning their marketing strategies because they should prioritize developing clear communication and building customer trust. Start with a tight ICP and a clear problem you solve (e.g., cost reduction from overusing AI). Cold email can work if it’s highly targeted and value-led. LinkedIn serves as a platform for sharing practical information with decision-makers while Reddit answers specialized questions without commercial promotion. The combination of consistency with proof through case studies and examples will achieve better results than any single \"hack\" method.",
          "score": 2,
          "created_utc": "2026-01-29 05:53:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2dmys9",
          "author": "svlease0h1",
          "text": "cold email alone gets lonely fast, so your instinct is right. pairing light outbound with being visible on linkedin or reddit builds trust quicker. i saw better replies once people had seen my comments before my email hit their inbox. slower start, warmer calls.",
          "score": 2,
          "created_utc": "2026-01-29 08:40:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ek8e2",
          "author": "FunDevelopment3229",
          "text": "I’ll recommend you share workflow diagrams, and ask head of sales for trial of a week. Once they see some success, trust me they won’t leave you. Everyone loves leads and no one will leave you alone once you feed them enquiries. All the best.",
          "score": 2,
          "created_utc": "2026-01-29 13:08:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2ete7d",
              "author": "aronzskv",
              "text": "Thanks!",
              "score": 1,
              "created_utc": "2026-01-29 13:58:27",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2ap7t1",
          "author": "OkDependent6809",
          "text": "honestly cold email from google maps scraping is gonna get terrible open rates. feels pretty spammy.\n\nid pick one specific niche first instead of all businesses. your messaging will be way too generic otherwise.\n\nfor channels linkedin works if you post helpful stuff about automation problems, not cold dms. reddit is good if you actually help in relevant subs without pitching.\n\nthe hardest part is youre selling something abstract. businesses need to understand the specific problem youre solving before they care about channels or tactics.",
          "score": 1,
          "created_utc": "2026-01-28 21:52:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2dyfbo",
              "author": "aronzskv",
              "text": "That is indeed the case, Ill be scraping based on predefined industries/niches and cities using queries with all related data stored in a database. It is definitely not generic scraping, but finding data to personalise each email based on location and industry, and using it for more elaborate analysis in the long run.",
              "score": 1,
              "created_utc": "2026-01-29 10:27:05",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2cwenf",
          "author": "amacg",
          "text": "Focus on customer pain point i.e price, use case etc",
          "score": 1,
          "created_utc": "2026-01-29 05:02:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2dyvl9",
          "author": "-Just_a_Seal-",
          "text": "Selling general digitization is brutal because nobody wakes up wanting to buy abstract efficiency. Pick one boring, expensive problem like automated invoicing and just sell the specific solution for it",
          "score": 1,
          "created_utc": "2026-01-29 10:31:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2dz9c5",
              "author": "aronzskv",
              "text": "That’s fair, but that is where the personalised marketing will come in. I was thinking of personalising the emails based on the industry (which is collected data) and defining base options with customisability. So in the end it will come down to offering solutions to defined problems, but not latching onto one.",
              "score": 1,
              "created_utc": "2026-01-29 10:34:32",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2r9mas",
                  "author": "Front_Morning_1446",
                  "text": "My advice would be to personalise not on the industry purely based on data points but really look into the emotional drivers for the buyers. But as the person above said, if you stat doing this for every industry it will also get too messy for you. What you’re trying to do here is find the product market fit so focus on 1/2 industries and really drill into the emotional drivers. Your product here competes not only with other systems that already exist but AI which is the new shiny thing and the person drowning in work wont give a shit about AI not being sustainable or expensive.",
                  "score": 2,
                  "created_utc": "2026-01-31 08:07:33",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2ft66u",
          "author": "hollee-o",
          "text": "Honestly, I think these comments are leading you into a brick wall. Start with your own network. Find friends, former colleagues or classmates, family members, anyone who knows you that is working at a company that fits your ICP and take them out to lunch. Show them what you’re doing and ask for their feedback and specific insight into how they are dealing with the problem you solve. See if you can get a foot in the door, or a referral. You are *far* more likely at this stage to get a win banging on doors directly than digitally right now. LinkedIn Sales Nav is highly overrated and outrageously priced for what it delivers. I use it a ton for paid media, but that will bleed you dry at this stage of development without a proven PMF.",
          "score": 1,
          "created_utc": "2026-01-29 16:46:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2gheeq",
              "author": "Right-Will8093",
              "text": "I sort of agree, I like the idea of networking but I do think OP could apply that digitally  \n  \nNot many systems do this, but if you can track relevant posts/comments where your target audience hangs out and actively provide value when they're complaining about a relevant pain point, seeking their exact solutions, or seeking advice/insights then that'll land clients definitely\n\nIt's way more organic and natural to move someone to a sales call/demo doing this compared to cold email\n\nAnd paid ads drain my bank account like crazy lol",
              "score": 2,
              "created_utc": "2026-01-29 18:35:01",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2jumwm",
          "author": "CCMALLC",
          "text": "1.Do you know it's something that the market is paying for? \n2.Have you done your market research or do you know how to do market recon? \n\nValidate your Offer. \n\nProper market research will answer 99% of the questions you asked.\n\nI'd wager any \"absolutes\"  or  \"definites\" instructions you get will lead you down a long road of struggle and frustration.  Do your research",
          "score": 1,
          "created_utc": "2026-01-30 05:15:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2mhsvo",
          "author": "unicorn69love",
          "text": "dude scraping google maps for leads is tedious af and youll get crap data half the time. ive had luck with ClientHunter for auto-finding qualified b2b prospects by industry/location and spitting out personalized cold emails with smart followups - scales way better than manual grind. start there before reddit/linkedin distractions.",
          "score": 1,
          "created_utc": "2026-01-30 16:08:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2ojdwb",
              "author": "aronzskv",
              "text": "I already made it automated 🤷🏼‍♂️ it’s literally what I sell, why would I do it manually?",
              "score": 1,
              "created_utc": "2026-01-30 21:42:05",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o34a4vg",
          "author": "Majestic_Estate963",
          "text": "start from simple",
          "score": 1,
          "created_utc": "2026-02-02 07:26:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o28gwax",
          "author": "Tiny-Celery4942",
          "text": " I was in the same boat trying to get my freelance biz off the ground. Cold emailing can feel like shouting into the void.\n\nWhat actually worked for me was making LinkedIn a daily thing, not just posting and hoping.\n\nHere's what I do now:\n\n \\- Post 3 time a week (for inbounds)\n\n\\-   I make a list of my ideal clients.\n\n\\-   I check only their posts.\n\n\\-   I leave real comments, adding to the talk.\n\n\\-   Then, I ask to connect with a note about something they posted.\n\n\\-   My first message is short and asks one easy question.\n\n\\-   I keep track of who I need to follow up with.\n\nI use **Depost AI** to keep a feed of just my prospects, draft comments and messages, and track who I need to follow up with. It helps a lot.",
          "score": 0,
          "created_utc": "2026-01-28 16:02:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o28qy73",
          "author": "colinbyprospectai",
          "text": "Hire us 😃",
          "score": -1,
          "created_utc": "2026-01-28 16:45:37",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qnlyj1",
      "title": "What B2B deal closing tips worked for you in real sales situations?",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qnlyj1/what_b2b_deal_closing_tips_worked_for_you_in_real/",
      "author": "Aboukinen",
      "created_utc": "2026-01-26 17:07:37",
      "score": 12,
      "num_comments": 2,
      "upvote_ratio": 1.0,
      "text": "There’s no shortage of advice on how to close deals, but a lot of it feels theoretical or overly scripted. I’m more interested in the practical b2b deal closing tips that actually worked when a deal was close but not quite there yet.\n\nIn my experience, deals usually stall because of small things. Missing context, unclear next steps, or buyers needing time to align internally. The challenge is knowing what to do in that in-between phase without pushing too hard or coming across as desperate.\n\nI’ve seen some teams focus less on hard closing tactics and more on making it easier for buyers to move forward on their own terms. Clear follow-ups, simple summaries, and giving them one place to review everything seems to help.\n\nFor those who consistently close B2B deals, what specific habits or approaches made the biggest difference for you?",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qnlyj1/what_b2b_deal_closing_tips_worked_for_you_in_real/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o1umxyf",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-26 17:07:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o210ih1",
          "author": "Intrepid_Boss9449",
          "text": "What helped me was always sending a quick recap email after calls with clear next steps and deadlines. Also giving buyers space to talk to their team without pushing too much. If you want to find real conversations about your product on Reddit to engage with, SocListener can help spot those moments and suggest ways to reach out.",
          "score": 1,
          "created_utc": "2026-01-27 15:12:12",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qo6xaf",
      "title": "What’s the most popular CMS setup for B2B SaaS companies?",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qo6xaf/whats_the_most_popular_cms_setup_for_b2b_saas/",
      "author": "Fred-swe",
      "created_utc": "2026-01-27 07:10:23",
      "score": 11,
      "num_comments": 33,
      "upvote_ratio": 1.0,
      "text": "I’m working at a SaaS scale up and currently run our website on Wordpress with outsourced hosting and development. What alternatives do we have? In-house or outsourced dev? Hourly cost for dev?\n\nWordpress and cloud hosted?\n\nWebflow?\n\nHubSpot cms?\n\nImportant to have quick and efficient development and good access to talent.\n\nEdit: main problem currently is dev costs",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qo6xaf/whats_the_most_popular_cms_setup_for_b2b_saas/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o1z5742",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-27 07:10:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1z6m7l",
          "author": "theninjadesigner",
          "text": "You can also try Framer CMS, i am quite happy with it.",
          "score": 2,
          "created_utc": "2026-01-27 07:22:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2nuo0s",
              "author": "nachokings",
              "text": "We're moving out sites from webflow to framer and so far so good. Design seems to prefer it.",
              "score": 2,
              "created_utc": "2026-01-30 19:45:28",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1zc7uq",
          "author": "corwinsword",
          "text": "based on my experience it's Webflow and Framer now",
          "score": 2,
          "created_utc": "2026-01-27 08:12:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1zc8q6",
          "author": "dOdrel",
          "text": "you have a plethora of options, if you already have wordpress and are mostly satisfied with it, just stick with it. if you don’t like the design or want faster load times, you can also use it as a headless CMS and use your own customer facing frontend solution.  in this line you can also look into Strapi. \n\ndeveloping your own makes sense only if you have special needs that no other solves, or you have the resources to develop one (internal or external). \n\nhourly rate depends a LOT on location and expertise, cheap offshore devs might do it for 10-20 bucks an hour, decent US/EU agencies might bill you over 100. a reasonable middle way is eastern europe with around 40-60. most of the times (but not always) you pay what you get for - don’t cheap out, quality will be terrible.",
          "score": 2,
          "created_utc": "2026-01-27 08:12:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o20l9nl",
              "author": "Fred-swe",
              "text": "Currently I pay around 80euro/h for a European dev company. I think it’s expensive. A couple of new moudules easily cost 5000-10000 euro to develop, test and deploy inc project management",
              "score": 1,
              "created_utc": "2026-01-27 13:56:30",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o220q98",
                  "author": "dOdrel",
                  "text": "there’s difference in European locations. Switzerland or Denmark/Norway might be very expensive, Poland, Hungary should be mid, Romania, Ukraine should be cheaper.",
                  "score": 1,
                  "created_utc": "2026-01-27 17:50:56",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o20lqvx",
          "author": "nic2x",
          "text": "There are two types of CMS you should look into: no-code or headless. For no-code CMS the best option in the market is Webflow, providing everything you need for SEO/AEO purpose. For headless CMS, go for Sanity. I've used it on a client's site and thanks to its flexibility, we were able to build customized web components in the content page to retain the users for longer retention time.",
          "score": 2,
          "created_utc": "2026-01-27 13:58:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o21978u",
          "author": "BrilliantLow7403",
          "text": "We had an agency convince us to move over to strapi w/ sveltekit about a year and a half ago. We had been on wordpress and my team didnt have any experience with headless CMS. The agency barely completed the job, did not accurately set up our schema, no SEO in place, didnt train us how to use, I could write a novel about how screwed up they left us. We are completely reliant on dev and it takes a lifetime to make even minor aesthetic tweaks. \n\nHeadless is really interesting, but i've tried to teach myself so much while also writing the wrongs the agency created. Basically we are about to pay another agency thousands of dollars to re-do it. so beware",
          "score": 2,
          "created_utc": "2026-01-27 15:51:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1z8x2q",
          "author": "kubrador",
          "text": "hubspot cms if you want marketing to stop bugging engineering about landing pages, wordpress if you enjoy paying someone $80/hr to fix plugin conflicts at 2am. webflow's great until you need literally anything custom, then you're back to hiring developers anyway.",
          "score": 1,
          "created_utc": "2026-01-27 07:42:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1zccjx",
          "author": "Exciting-Sir-1515",
          "text": "Define what you want to do first then look for solutions eg. A/B test, landing pages, blog posts, Personalisation, multi-language …..\n\nWhat you’ve said literally gives you a million options….",
          "score": 1,
          "created_utc": "2026-01-27 08:13:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1zlfqg",
          "author": "Just-a-torso",
          "text": "Taking everything into account I still think WP is the winner. It went downhill a few years ago but the recent updates have been great. If you know what you're doing you can do most things without dev support now. And, importantly for you, it scales up nicely. But the one caveat is, if you don't know what you're doing, it's very easy to end up with some Frankenstein horror show of broken plugins and dependencies.\n\nWebflow is good if you want to make a little portfolio site but it's a nightmare (and expensive) if you want to scale or do anything custom. I've been hearing good things about Framer as a Webflow replacement. \n\nHubspot if you already use it behind the scenes, but it's super limited. \n\nThere are also things like Adobe Experience Manager or Craft, but they're fully Enterprise and probably overkill.",
          "score": 1,
          "created_utc": "2026-01-27 09:38:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1zu2av",
              "author": "Fred-swe",
              "text": "What would be the best way to run WP successfully? In house developer? Custom themes?",
              "score": 1,
              "created_utc": "2026-01-27 10:55:38",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1zvz7i",
                  "author": "Just-a-torso",
                  "text": "Very unlikely you'll need a dedicated dev. As I mentioned with the newer WP versions you can do a lot of stuff without dev support. In most places I've worked that used Wordpress the engineering team would pitch in whenever we needed dev support - another advantage of WP is that it's very well documented and there's a huge community around it, so any decent developer will be able to pick it up quite quickly.\n\nThe best way, tbh, is to hire a marketing person who knows their way around Wordpress.\n\nAnd yes, probably custom theme is the way to go. Start with the built-in themes (Twenty Twenty Five or whatever) and add what you need. Don't be tempted by things like Elementor, they add huge bloat and they're impossible to get rid of once you start building with them.",
                  "score": 1,
                  "created_utc": "2026-01-27 11:11:45",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1zz95p",
          "author": "astillero",
          "text": "Salesforce / Pardot seems very popular but Wordpress might be more suited if speed and talent are key priorities.  \n\nI'm surprised you're not mentioning SEO - because you have the best CMS in the world but if it's not appearing Google or GEO search results it kind of defeats the whole purpose of a CMS.",
          "score": 1,
          "created_utc": "2026-01-27 11:38:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o208biy",
              "author": "Fred-swe",
              "text": "We have good SEO/GEO visibility thanks. I’m want to find a CMS that is easy to work with at scale. We are more enterprise SLG than startup/PLG so the demands are very different",
              "score": 1,
              "created_utc": "2026-01-27 12:43:12",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o21fps4",
          "author": "mister_malarky",
          "text": "There’s nothing wrong with WordPress, but just curious. What’s the issue you’re facing right now? You mentioned developers charging a few grand for new modules, what’s the nature of the content you’re adding needs as your scale up grows?\n\nAre your challenges with cost, scalability, content flexibility??",
          "score": 1,
          "created_utc": "2026-01-27 16:19:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2216c2",
              "author": "Fred-swe",
              "text": "Challenges is dev costs. As soon as I want to rebuild or change something it costs a fortune. And this limits our ability to be competitive. For example to promote new products, adapt to competitors etc",
              "score": 1,
              "created_utc": "2026-01-27 17:52:48",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2qm8lu",
                  "author": "mister_malarky",
                  "text": "Do you have someone your team providing designs? Does your current page templates (assuming there are templates) always need to undergo heavy modifications?",
                  "score": 1,
                  "created_utc": "2026-01-31 04:51:53",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o22fq7z",
          "author": "SendPotionDotCom",
          "text": "Webflow",
          "score": 1,
          "created_utc": "2026-01-27 18:54:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o22io9c",
          "author": "Admirable_Swim_7805",
          "text": "if dev costs are killing you then wordpress is probably not the move even if its familiar\n\n\n\nwebflow is honestly the sweet spot for saas companies at scale up stage. you can build and iterate fast without devs for every little change. marketing team can update pages content AB test landing pages etc. also the hosting is included so one less thing to manage\n\n\n\nthe real game changer though is automating the repetitive stuff regardless of what cms you pick\n\n\n\nlike set up zapier or make to auto publish blog posts from notion or google docs. or auto update your changelog page when engineering pushes releases. you can pull data from your product api and display it on marketing pages without manual updates\n\n\n\nalso if youre doing a lot of lead gen set up automations to pass form submissions straight to your crm with enrichment. so when someone fills demo request it auto creates deal in pipedrive or hubspot adds linkedin data company size etc\n\n\n\nfor hubspot cms specifically the benefit is everything lives in one place crm email automation forms website. but its pricey and honestly unless youre already deep in hubspot ecosystem the integration tax is high\n\n\n\nmy vote is webflow plus airtable as lightweight backend plus automation tools to connect everything. way cheaper than hubspot and you can move faster than wordpress",
          "score": 1,
          "created_utc": "2026-01-27 19:06:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o22uwg3",
              "author": "Fred-swe",
              "text": "Thanks. We are approx 20ppl in the marketing team and do work deep with HubSpot and Salesforce. The automation and lead management part is well sorted. We don’t have a high volume business. \n\nI just wonder if no-code solutions will give me the pixel perfect adjustments and tuning we want to make😂",
              "score": 2,
              "created_utc": "2026-01-27 20:00:56",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o23kxpz",
          "author": "drakarisx",
          "text": "Webflow/Framer/WordPress does the job if you are a startup. \n\nBut for an enterprise please go with Headless CMS (Next JS + Storyblok) and you will never need dev support.",
          "score": 1,
          "created_utc": "2026-01-27 21:57:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o26rrzi",
          "author": "Mundane-Anybody-9726",
          "text": "Most B2B SaaS companies move toward Webflow or HubSpot CMS for lower dev overhead and easier updates. Wordpress works but can get costly with custom features and outsourced developers.",
          "score": 1,
          "created_utc": "2026-01-28 09:51:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o26xufn",
          "author": "ElectricalMoose5054",
          "text": "If you go Webflow, you lower dev costs but hit a ceiling on customization. If you go Headless CMS + SSG (like Next.js/Astro) and host on Vercel, your upfront dev cost might be higher (depends on the agency), but you'll save a lot on maintenance, security, and hosting compared to WordPress with it's constant plugin updates and server management. I might sound a bit biased as I work in a company that gives these services but in our research, we found that SSGs offer the best long-term ROI for SaaS companies because they are virtually unhackable and fast. THus, the Reason why we decided to work with these products. We actually built our own internal CMS to bridge the gap between \"non-technical\"  and developer. We opened it to the public around last year. Let me know if you want to try it out.",
          "score": 1,
          "created_utc": "2026-01-28 10:45:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2d5mps",
          "author": "MembershipHorror404",
          "text": "I’ve seen very few teams actually use HubSpot CMS at scale.\n\nPersonally, I’ve worked with both Webflow and WordPress, and if SEO is a serious growth channel, WordPress is still hard to beat. The flexibility around content, plugins, and technical SEO just gives you more control as you scale.\n\nOne of our clients doing $10M ARR still runs on WordPress with custom themes and selective custom code. The key isn’t the CMS, it’s keeping the setup disciplined. Once every experiment needs heavy dev work, costs explode. The best setups I’ve seen keep WordPress lean and let marketing move fast without constant engineering help.",
          "score": 1,
          "created_utc": "2026-01-29 06:10:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2iy19s",
          "author": "Dapper-Condition6041",
          "text": "WP on Wpengine is a good combo",
          "score": 1,
          "created_utc": "2026-01-30 02:00:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2mclty",
          "author": "mwalker973",
          "text": "Does your SaaS application run on or through your website? If that’s the case, you should have dedicated developers since that’s your business. If the website is more of a marketing tool then there isn’t much that can’t be done with Wordpress. Probably just a matter of finding the right vendor to work with. Also, if it’s planned out well, you can create custom themes, templates, or custom post types that make most updates pretty easy.",
          "score": 1,
          "created_utc": "2026-01-30 15:45:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2n9s9j",
              "author": "Fred-swe",
              "text": "No, we don’t have a PLG motion at all. You can’t even find the logon button on the website",
              "score": 1,
              "created_utc": "2026-01-30 18:12:41",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qsrj3n",
      "title": "Why I stopped scaling outreach volume and started filtering for inactive contacts, our reply rates went from 0.4% to 6% (B2B lead gen breakdown)",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qsrj3n/why_i_stopped_scaling_outreach_volume_and_started/",
      "author": "ScheduleNo5736",
      "created_utc": "2026-02-01 07:05:57",
      "score": 10,
      "num_comments": 10,
      "upvote_ratio": 0.86,
      "text": "Look, I need to vent about something that nearly killed our outbound program last year. Everyone in B2B keeps saying it's a numbers game and just scale your lists. I bought into that completely and it almost got our entire domain infrastructure blacklisted.\n\nWe were working with the usual suspects for data. Apollo, ZoomInfo, the works. Paying premium rates for those verified badges next to every contact. Our dashboards looked immaculate. Bounce rates under 2%, deliverability scores in the high 90s, everything tracking green. We scaled up to about 18,000 to 20,000 touchpoints monthly across our sequences. I was genuinely expecting our pipeline to finally match the effort we were putting in.\n\nInstead we flatlined at a 0.4% reply rate. And most of those replies were variants of unsubscribe or how did you get my info. Our AE team was getting maybe two qualified conversations per week from thousands of sends. I spent entire evenings convinced it was a messaging problem. Rewrote subject lines, tested different value props, even brought in a contractor to rebuild our sequences from scratch. Nothing moved.\n\nThe wake up call came when I started manually checking who was actually opening our emails. Turns out a huge chunk of our verified contacts were people who'd left their companies four to six months ago, or whose email accounts were just auto forwarding to a black hole. The mailboxes existed so they passed the basic validation checks, but there was no human on the other end. We were burning sender reputation on what were essentially abandoned accounts.\n\nI finally admitted we needed to stop throwing volume at the problem and completely rethink our data hygiene approach. The issue wasn't our copy or our offer. It was that we were optimizing for the wrong metric. Deliverability doesn't mean anything if the recipient hasn't logged in since Q2 of last year.\n\nSo we shifted the entire workflow. Instead of just verifying that an email exists we started screening for actual activity signals. Things like mobile number status, recent job changes, social engagement patterns. We moved to a batch filtering process using TNTwuyou before any contacts even touched our CRM. The goal was to prioritize signal over scale.\n\nA few things became obvious pretty fast. First, phone number validation turned out to be a surprisingly strong proxy for active engagement. If someone's mobile line is dead or disconnected their email's probably not much better. Second, recency matters more than anything else. A contact that was valid three months ago is often worthless today in fast moving industries. Third, this approach adds friction to your workflow and your team will push back on smaller lists. You have to be willing to defend lower volume if it means higher quality.\n\nOnce we started filtering out the noise our effective reply rates climbed back up to the 5% to 7% range. We're running at maybe 20% of our previous monthly volume but our AEs are actually having real conversations again instead of just logging rejection after rejection. Using the TNTwuyou Data Filtering and Validation Tool as a pre outreach gate basically saved us from getting our domains torched.\n\nThat said, this level of filtering probably isn't worth the operational overhead if you're selling low ticket transactional stuff where volume really is the only lever. It makes sense for us because we're in high ticket enterprise sales where every bad touch costs us credibility we can't afford to lose.\n\nI'm curious if anyone else has completely abandoned the big database model lately. Or are we just in a particularly stale vertical where contact decay happens faster than usual.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qsrj3n/why_i_stopped_scaling_outreach_volume_and_started/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o2xklzf",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-01 07:05:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2xuj0y",
          "author": "stephan85",
          "text": "For high-ticket B2B, prioritizing contact activity over sheer volume is essential for maintaining sender reputation and achieving real engagement. Many teams find that \"verified\" contacts from standard databases often include individuals who have long left their roles, effectively sending emails into a void, much like you described.\n\nyou could establish a rigorous pre-outreach filtering process that looks for recent professional activity signals. like job changes or social engagement. Before any contact enters a sequence, which often yields significantly better reply rates.",
          "score": 3,
          "created_utc": "2026-02-01 08:36:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2xx17u",
          "author": "Scared_Yak5572",
          "text": "I went through this exact thing last year. We cranked lists to hit volume and watched reply quality tank while deliverability still looked fine on paper. The turning point for us was adding a quick activity check before contacts hit our sequences,  phone status, LinkedIn activity, and recent role changes. That cut our sends way down but doubled reply quality and saved our sending health.\n\nA tiny framework that helped: 1) small fresh list 2) activity filter 3) two warm touches (comment + connection) before cold mail 4) prioritize follow ups. curious how you balance the extra ops work with quota pressure? I run this daily loop inside Depost AI so prospects and follow ups don’t slip, but a simple checklist works too.",
          "score": 2,
          "created_utc": "2026-02-01 08:59:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2y1ra1",
              "author": "Middle_Currency_110",
              "text": "I like the idea of warm touches before a cold email - nice!",
              "score": 2,
              "created_utc": "2026-02-01 09:44:14",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2ztkho",
                  "author": "Scared_Yak5572",
                  "text": "Yup, spraying DMs, Emails will burn you out, few warm touches, warm discussion, more chance to close, in era of bots, still human touches needed :)",
                  "score": 2,
                  "created_utc": "2026-02-01 16:36:47",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2xyf8d",
          "author": "phoebeb_7",
          "text": "Yeah, a smaller, clean list always beats huge, stale databases. You get fewer sends but way higher quality replies and engagement.",
          "score": 2,
          "created_utc": "2026-02-01 09:12:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o329sam",
          "author": "NewsOdd7348",
          "text": "T⁠his i⁠s a⁠ f⁠antastic b⁠reakdown o⁠f w⁠hy v⁠olume a⁠lone i⁠s i⁠rrelevant. T⁠he b⁠iggest c⁠ulprit i⁠s n⁠ot s⁠tale d⁠ata, b⁠ut t⁠he 3⁠-6 m⁠onth l⁠ag t⁠ime i⁠n t⁠raditional d⁠atabases u⁠pdating j⁠ob c⁠hanges. T⁠hey p⁠ass v⁠alidation, b⁠ut t⁠he h⁠uman i⁠s g⁠one. T⁠he o⁠nly w⁠ay t⁠o b⁠eat t⁠his d⁠ecay i⁠s t⁠o s⁠hift f⁠rom c⁠leaning l⁠ists t⁠o m⁠onitoring t⁠hem l⁠ive.\n\nT⁠o s⁠olve t⁠his p⁠roactively, o⁠ur t⁠eams a⁠re m⁠oving b⁠eyond s⁠imple v⁠alidation c⁠hecks. T⁠hey i⁠mplemented a⁠ j⁠ob c⁠hange w⁠atchlist p⁠re g⁠ate. T⁠ools l⁠ike A⁠pollo a⁠nd Z⁠oomInfo a⁠re i⁠nputs, b⁠ut y⁠ou n⁠eed a⁠ l⁠ive s⁠ystem t⁠o c⁠heck t⁠heir s⁠tatus. W⁠e r⁠un t⁠his u⁠sing a⁠n n⁠8n w⁠orkflow: l⁠ist s⁠egmentation -> l⁠imadata w⁠atch A⁠PI (f⁠or r⁠eal t⁠ime j⁠ob c⁠hange w⁠ebhooks) -> C⁠RM. I⁠f t⁠he c⁠ontact h⁠as c⁠hanged r⁠oles i⁠n t⁠he l⁠ast 9⁠0 d⁠ays, t⁠hey g⁠et p⁠rioritized. I⁠f t⁠hey c⁠hanged r⁠oles 1⁠80+ d⁠ays a⁠go a⁠nd h⁠aven’t b⁠een u⁠pdated, t⁠hey g⁠et b⁠inned. I⁠t e⁠liminates t⁠he o⁠perational o⁠verhead o⁠f m⁠anually c⁠hecking t⁠hat c⁠rucial r⁠ecency s⁠ignal.",
          "score": 2,
          "created_utc": "2026-02-01 23:40:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2yh5ng",
          "author": "StunningStatement998",
          "text": "Switching from list scale to actual engagement signals was a game changer for us too. We struggled with low reply rates until we focused on filtering for recent activity and job changes. Partnering with Linkedist took this even further, after they redid our outreach with these filters our response rates jumped to 7% and we stopped wasting effort on dead leads. Total difference in AE morale and overall pipeline health.",
          "score": 1,
          "created_utc": "2026-02-01 12:01:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2z2ume",
          "author": "Admirable_Swim_7805",
          "text": "man ive been there, blasting 20k emails a month just to get crickets and watch your rep tank. switched a client to auto filtering their lists through activity signals like recent logins and mobile verifies before hitting send. cut volume by 70 percent but replies jumped to 8 percent because youre only emailing live humans. set it up with make pulling from hubspot, runs daily, no more dead contacts clogging sequences. game changer for keeping domains clean",
          "score": 1,
          "created_utc": "2026-02-01 14:25:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o33a0wh",
          "author": "jrpollock",
          "text": "Super useful information. Thank you!",
          "score": 1,
          "created_utc": "2026-02-02 03:04:30",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qokl8b",
      "title": "B2B Influencer Marketing",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qokl8b/b2b_influencer_marketing/",
      "author": "Responsible-Brick881",
      "created_utc": "2026-01-27 17:36:44",
      "score": 9,
      "num_comments": 36,
      "upvote_ratio": 0.92,
      "text": "Hi all,\n\nI'm not particularly sure if influencer marketing would be aligned for me, but wondering if there are any platforms anyone can recommend that allows you to search by niche? Any experience in general with influencer marketing for b2b?\n\nThanks",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qokl8b/b2b_influencer_marketing/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o21xgdh",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-27 17:36:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2274u3",
          "author": "Historical-Client-78",
          "text": "Look into Sprout Influencer Marketing",
          "score": 3,
          "created_utc": "2026-01-27 18:18:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o227rcg",
              "author": "Responsible-Brick881",
              "text": "Excellent, thank you!",
              "score": 1,
              "created_utc": "2026-01-27 18:20:47",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o22cm1i",
          "author": "wildcard_71",
          "text": "For B2B, your best bet is to just use LinkedIn to find influencers and make a direct connection. That's most of where people are self-promoting, particularly business-related content. Even if they aren't self-described  influencers, they may be open to being featured in whatever you're doing.",
          "score": 3,
          "created_utc": "2026-01-27 18:41:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o22d2t9",
              "author": "Responsible-Brick881",
              "text": "Thank you, I'll do some digging!",
              "score": 1,
              "created_utc": "2026-01-27 18:43:11",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2257hd",
          "author": "hostsofinfluence",
          "text": "Depends on what platform you are looking to market to. If Linkedin... check out Creator Match they have a lot of b2b content creators and partnerships. Also Tech creators are always a great way to market to b2b !",
          "score": 1,
          "created_utc": "2026-01-27 18:09:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o226ays",
              "author": "Responsible-Brick881",
              "text": "Great, thanks for that. I'll take a look at that. I reckon linkedin is probably the best fit but have you any recommendations for insta?",
              "score": 1,
              "created_utc": "2026-01-27 18:14:42",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o229ur0",
                  "author": "hostsofinfluence",
                  "text": "i would search for b2b creators on linkedin first and then find them on IG ! What niche of b2b are you looking for?",
                  "score": 1,
                  "created_utc": "2026-01-27 18:29:33",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o22bo5o",
          "author": "MendMySoulXoXo",
          "text": "UGC on reddit > Influencer marketing",
          "score": 1,
          "created_utc": "2026-01-27 18:37:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o22cur3",
              "author": "Responsible-Brick881",
              "text": "Just so im clear on how you're defining UGC. Are you talking about my own video content and the likes (potentially including my customers)?\n\nMy thinking there is: \nI plan to take part in some podcasts and use that long form content on say YouTube. Then snip it into multiple pieces of short form to go across multiple channels.\n\nAlso working on how I can incorporate client testimonials into this - think a 20 minute client update call and then slice up thst into some short form snippets. \n\nThen just some other general, less coordinated video shorts - quick update, thought re industy, etc.",
              "score": 1,
              "created_utc": "2026-01-27 18:42:15",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o22n0of",
                  "author": "MendMySoulXoXo",
                  "text": "What services do your B2B offer?",
                  "score": 1,
                  "created_utc": "2026-01-27 19:25:58",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o22f2uh",
          "author": "Admirable_Swim_7805",
          "text": "b2b influencer stuff is tricky because most platforms are built for b2c\n\n\n\none hack that works: use intent signals and engagement data to build your own micro influencer list. like find people who consistently engage with your ICP on linkedin, have decent followings, and actually know the space\n\n\n\nthen automate outreach to them with personalized collaboration pitches. way more targeted than paying for a database",
          "score": 1,
          "created_utc": "2026-01-27 18:51:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o22g7bg",
              "author": "Responsible-Brick881",
              "text": "Interesting. Thanks for that.",
              "score": 1,
              "created_utc": "2026-01-27 18:56:19",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o22o378",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-27 19:30:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o22ovxw",
              "author": "Responsible-Brick881",
              "text": "Thanks for all this, really appreciate it! I'll keep digging into things. \nSolo founder at present so no employees to push out content yet...but we'll get there!",
              "score": 1,
              "created_utc": "2026-01-27 19:34:21",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o257quf",
          "author": "mendel-cohen",
          "text": "There are no real/credible b2b influencers that will allow you to pay in return for promotion. Your best bet is creating co-branded content where you do all the work and give them something to promote to their audience, and with that, you'll be promoted as a byproduct.",
          "score": 1,
          "created_utc": "2026-01-28 02:56:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o28gbwr",
              "author": "Responsible-Brick881",
              "text": "Gotcha. Thanks for that",
              "score": 1,
              "created_utc": "2026-01-28 15:59:49",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o27tuc9",
          "author": "lacrimboso",
          "text": "just don't they all sucks",
          "score": 1,
          "created_utc": "2026-01-28 14:14:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o28g7ng",
              "author": "Responsible-Brick881",
              "text": "Very fair!!",
              "score": 1,
              "created_utc": "2026-01-28 15:59:19",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o28pagr",
          "author": "hazel-wood5",
          "text": "b2b influencer marketing works well for thought leadership and credibility in niches like saas, tech, and finance.. it’s more for audience building and trust rather than direct sales. some platforms to find niche influencers: upfluence: search by industry, keywords, audience, b2b-friendly. aspire: niche filters and performance data, good for tech, saas. grin: ecom and b2b mix, search by vertical. influencity: advanced niche targeting and analytics. linkedin creator marketplace: free and built-in, for b2b professionals, search by topic, expertise..",
          "score": 1,
          "created_utc": "2026-01-28 16:38:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2a4fk8",
              "author": "Responsible-Brick881",
              "text": "This is very helpful, thank you. Yeah looking at it as more of a credibility thing rather than pure sales (as much as that would be great!). I'll check these out!",
              "score": 1,
              "created_utc": "2026-01-28 20:21:36",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2j2jb3",
          "author": "Ancient_Team_1608",
          "text": "i have a resource that can help b2b influencer marketing, , DM i'll send it to you",
          "score": 1,
          "created_utc": "2026-01-30 02:25:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ns99q",
          "author": "Late-Hat-5853",
          "text": "B2B influencer marketing works when it feels genuinely useful. Operationally though, it still breaks if assets aren’t easy to find and reuse across teams. We hit friction before tightening our workflow with Yoho. Structure quietly drives consistency here.",
          "score": 1,
          "created_utc": "2026-01-30 19:34:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2o476x",
              "author": "Responsible-Brick881",
              "text": "When you say assets, what exactly are you referring to here? Just so im completely clear.\n\nSolo founder here so no team to worry about yet!",
              "score": 1,
              "created_utc": "2026-01-30 20:30:06",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o33j4aa",
                  "author": "Late-Hat-5853",
                  "text": "Like, the content produced for us.",
                  "score": 1,
                  "created_utc": "2026-02-02 03:59:14",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qramxi",
      "title": "I Built a free Google Maps scraper that extracted 10,000+ validated business emails - try it and let me know if it beats paid tools",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qramxi/i_built_a_free_google_maps_scraper_that_extracted/",
      "author": "Srigbok_",
      "created_utc": "2026-01-30 16:44:03",
      "score": 7,
      "num_comments": 10,
      "upvote_ratio": 0.9,
      "text": "Hi\n\nI recently built a free tool that extracts businesses from Google Maps along with validated email addresses. Right now, I'm looking for people who can try it out and share feedback - mainly whether the data quality is actually useful for lead generation compared to other tools.\n\nCurrent Features:\n\nFetch businesses based on rating (e.g., less than or more than 3 stars)\n\nFetch reviews from within specific years\n\nFind businesses with a low review count\n\nExtract negative reviews from businesses\n\nI'd love to know if this gives you valuable results or if something feels missing.",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qramxi/i_built_a_free_google_maps_scraper_that_extracted/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o2mptx0",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-30 16:44:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2mu58z",
          "author": "No_Hedgehog8091",
          "text": "The review filtering is smart. Most scrapers miss that businesses with 3.5 stars and recent negative reviews are actually hot leads - they desperately need help and have budget to fix their reputation. Test it on 'dentists near me' with 3-4 stars. Those convert 3x better than 5-star businesses.",
          "score": 2,
          "created_utc": "2026-01-30 17:03:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2nbvj5",
          "author": "Fro2stly",
          "text": "Name of the tool?",
          "score": 2,
          "created_utc": "2026-01-30 18:21:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2nk4ss",
          "author": "MomentComfortable528",
          "text": "I'm interested.  How do I try it out?",
          "score": 2,
          "created_utc": "2026-01-30 18:57:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2pbnss",
          "author": "kubrador",
          "text": "ah yes, the classic \"free tool that definitely won't violate google's tos or get your domain blacklisted\" energy. bold move scraping maps data and emails in a sub literally full of people who know what litigation looks like.",
          "score": 2,
          "created_utc": "2026-01-31 00:09:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2oqfa2",
          "author": "stevywunda",
          "text": "I've recently done some scraping for UK businesses, I'm happy to compare the two",
          "score": 1,
          "created_utc": "2026-01-30 22:16:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2quqe8",
          "author": "ddmoneymoney123",
          "text": "I'm interested. How do I try it out?",
          "score": 1,
          "created_utc": "2026-01-31 05:56:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2z3m40",
          "author": "Admirable_Swim_7805",
          "text": "google maps scraping is clutch for local lead gen. built something similar for agency clients, pulls businesses by low ratings or recent negative reviews then auto triggers outreach with saw you had some tough reviews, heres how we help businesses like yours fix reputation and get more bookings. converted way better than cold since they clearly have pain. whats your bounce rate on emails tho, found maps data can be hit or miss on accuracy",
          "score": 1,
          "created_utc": "2026-02-01 14:29:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3479pr",
          "author": "New_Grape7181",
          "text": "I've tested a bunch of scrapers and the big issue is always email accuracy. Google Maps listings don't usually include emails directly, so most tools end up guessing based on domain patterns or scraping website contact pages.  \n  \nTwo things that made a difference for me when using scraped data:  \n  \nFirst, I'd run the emails through a verification service before sending anything. Even \"validated\" emails from scrapers can have 20-30% bounce rates, which tanks your sender reputation.  \n  \nSecond, I found way better response rates when I combined scraped data with a warmer approach. Instead of cold emailing straight away, I'd check if they had a LinkedIn presence or recent Google review I could reference. Makes it feel less like spam when you mention something specific about their business.  \n  \nOne thing I'm curious about with your tool - when you say \"validated\", are you doing SMTP checks or just format validation?",
          "score": 1,
          "created_utc": "2026-02-02 07:00:34",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}