{
  "metadata": {
    "last_updated": "2026-02-23 17:19:57",
    "time_filter": "week",
    "subreddit": "b2bmarketing",
    "total_items": 20,
    "total_comments": 255,
    "file_size_bytes": 267763
  },
  "items": [
    {
      "id": "1r7395r",
      "title": "I need to make medical awareness slides with for upcoming presentation",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1r7395r/i_need_to_make_medical_awareness_slides_with_for/",
      "author": "juxhinam",
      "created_utc": "2026-02-17 11:12:50",
      "score": 32,
      "num_comments": 9,
      "upvote_ratio": 1.0,
      "text": "Doing a presentation on diabetes awareness for the community next month. Need to make it fun, engaging and easy to understand for general public. PowerPoint feels too formal and boring for this. What do you use for patient education presentations?",
      "is_original_content": false,
      "link_flair_text": "Support",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1r7395r/i_need_to_make_medical_awareness_slides_with_for/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o5uiovc",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-17 11:12:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ut1xq",
          "author": "e71469",
          "text": "Use Notebook LLM, you will love it",
          "score": 1,
          "created_utc": "2026-02-17 12:32:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5uvhyh",
          "author": "CommunicationNo2408",
          "text": "The tool matters less than the structure imo. For community audiences you want to make the slides super simple with one idea per slide, large visuals and minimal text. You or whoever's speaking needs to be animated and interesting rather than expecting the audience to read a whole lot of text. ",
          "score": 1,
          "created_utc": "2026-02-17 12:49:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5v0b21",
              "author": "posurrreal123",
              "text": "I agree 100% on all points, OmmunicationNo2408. If it's too flashy, they may be distracted and not pay attention to your message. \n\nYou could have a graphic with different elements. As you click, each element would appear to add to the bigger picture until it's complete. It's like a journey.",
              "score": 1,
              "created_utc": "2026-02-17 13:18:45",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6w1wcu",
          "author": "Hot-Butterscotch2711",
          "text": " PowerPoint feels stiff for this kind of thing. I’ve used Canva for patient friendly slides and Google Slides when sharing with a team. Simple visuals and one quick quiz keeps people engaged",
          "score": 1,
          "created_utc": "2026-02-23 03:11:05",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r75zcg",
      "title": "4 months into B2B sales and still no traction. what am i doing wrong?",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1r75zcg/4_months_into_b2b_sales_and_still_no_traction/",
      "author": "Ok-University-2605",
      "created_utc": "2026-02-17 13:27:27",
      "score": 22,
      "num_comments": 62,
      "upvote_ratio": 0.97,
      "text": "Hi everyone.\n\nI’m about 4 months into an international B2B sales role at a Turkey-based industrial company, and I feel stuck. I’m starting from zero with no training or mentor, and despite trying cold emails, trade fair outreach, LinkedIn networking, and consistent follow-ups, I’m getting almost no responses. I’m also expected to sell across multiple very different product categories, which makes it hard to build a focused strategy. For those experienced in B2B sales, what should I prioritize to move past the “ignored” phase and start generating real conversations and closing deals? ",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1r75zcg/4_months_into_b2b_sales_and_still_no_traction/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o5v1sqj",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-17 13:27:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o60n70a",
          "author": "LuliProductions",
          "text": "Four months in B2B with no training is hard, especially across multiple product categories. You’re not failing. You’re overloaded. When you try to sell everything, your message becomes generic, and buyers ignore generic.\n\nNarrow down to one product and one clear ideal customer. Focus on one industry and one buyer role. Speak to a specific operational pain, not a product list. Your goal right now is replies, not closed deals. Study how competitors frame their value and sharpen your messaging. Even tools like GetHookd can help you see which angles and positioning patterns work in your niche so you stop guessing. Once conversations start, momentum follows.",
          "score": 8,
          "created_utc": "2026-02-18 07:57:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o69atsr",
              "author": "Ok-University-2605",
              "text": "thank you much.  \nactually i dont confuse people with multiple products. for example i search for potential customers for product A and other customers for product 2 and so on.",
              "score": 1,
              "created_utc": "2026-02-19 15:46:53",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5w4v69",
          "author": "Odd-Home3418",
          "text": "You’re probably not being ignored because of effort.  \nYou’re being ignored because of clarity.\n\nIn B2B, especially industrial, buyers don’t respond to activity.  \nThey respond to **decision readiness**.\n\nRight now, I see 3 likely gaps:\n\n1️⃣ **Recognition**\n\n2️⃣ **Explanation** \n\n3️⃣ **Yes-Safety**\n\nCold emails, LinkedIn, trade fairs — those are channels.  \nBut channels amplify clarity. They don’t create it.\n\nIf I were you, I would:\n\n• Pick ONE product category  \n• Pick ONE buyer persona  \n• Define ONE core problem you solve better than alternatives  \n• Rewrite outreach around that single positioning\n\nIn B2B, traction doesn’t come from doing more.  \nIt comes from removing hesitation.\n\nMost sales teams optimize volume.  \nThe real leverage is fixing the decision layer first.\n\nCurious — if you had to narrow down to one product + one buyer segment for the next 60 days, what would it be?",
          "score": 12,
          "created_utc": "2026-02-17 16:49:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5xc8cz",
              "author": "rishiroy19",
              "text": "This is a great advice!! Similar situation when I started my SaaS which was B2B focus. I wanted to showcase all my product features, and target different buyer personas, it took me a while to correct my mistakes. Narrow down!!!",
              "score": 2,
              "created_utc": "2026-02-17 20:13:41",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o5y1zb4",
              "author": "AccountAbilityB2B",
              "text": "Great advice! Key thing will be choosing which product category and buyer persona. Suggest leveraging insights on what is working for the business already. Who are their biggest customers, what do they do for them and why do they work with them - will help determine the one core problem.   \n  \nIs the business able to work with multiple clients with the same type of business? If yes, then you can do a look-a-like targeting strategy, so approach similar Accounts and offer them the same solutions and leverage case studies / testimonials to hook prospects in",
              "score": 1,
              "created_utc": "2026-02-17 22:15:40",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o69bjcr",
              "author": "Ok-University-2605",
              "text": "thank you for the advice!!  \ni can start with the weilding machine right away, but still i dont understand how to Pick ONE buyer persona.. ",
              "score": 1,
              "created_utc": "2026-02-19 15:50:20",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5w19wp",
          "author": "Kindly_Watercress416",
          "text": "Why doesn’t your company provide any information about the sales process, target audience, sales materials, what works and what doesn’t, or any info from the colleagues or the past employees? \nThat would be really helpful \n\nKolay gelsin",
          "score": 2,
          "created_utc": "2026-02-17 16:30:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o69clr1",
              "author": "Ok-University-2605",
              "text": "thanks, they are good people but propably just dont have so much time to sit and teach me. i super new to sales",
              "score": 2,
              "created_utc": "2026-02-19 15:55:30",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5vb22l",
          "author": "MiniGhost7",
          "text": "What are your numbers? what are your responses like? are they STOP or not interested or what? you can determine what you are doing wrong buy the current feedback.",
          "score": 2,
          "created_utc": "2026-02-17 14:18:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5vce32",
              "author": "Ok-University-2605",
              "text": "Unfortunately I’ve sent hundreds of emails and messages across the platforms but very few people responded and the response was (not interested) other than that I don’t any other feedbacks. \nMy messages normally are short I personalize the context according to the targeted audience, I give an introduction then a summary of the product with two or three sentences, then I ask if they’re interested and wait for the response. \nOne time I got a real response (that was the only time) and they’re asking about the type of the product, I gave more details into it and attached the catalog. But nothing happened after that.",
              "score": 2,
              "created_utc": "2026-02-17 14:26:02",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5vcch4",
          "author": "Mularkeyy",
          "text": "4 months in international industrial B2B isn’t that long, cycles are slow. So don’t assume you’re failing yet.\n\nThe bigger issue is you’re being asked to sell too many categories. That makes your outreach sound generic. I’d pick one product, one industry, and one target country and go deep for 30 days. Focus on getting conversations, not pitches. Learn how they buy, who the decision makers are, what triggers a supplier switch, and what objections come up. Then rewrite your outreach around that one segment.\n\nAlso, in industrial B2B, direct cold email is rarely enough. Start working distributors, agents, and importers in that market too. We talk about practical B2B lead gen approaches on r/LeadGenSEA if you want more ideas.",
          "score": 2,
          "created_utc": "2026-02-17 14:25:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5vcq4j",
              "author": "Ok-University-2605",
              "text": "Thank you so sooo much",
              "score": 1,
              "created_utc": "2026-02-17 14:27:47",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5x8gfi",
          "author": "ConfusionDull2183",
          "text": "\n\nIt’s hard - but it’s all about putting in the grind, learning, and getting smarter as you go.\n\nI’m an old dog in B2B - both marketing and sales.\n\nThe most important point to understand is this:\n\nAt any one time, who is actually in-market for these machines (or whatever B2B stuff you’re selling)?\n\nThe stats show that 95–99% of your market is NOT in-market.\n\nThey’re not interested.\nThey don’t have a problem that needs solving.\nThey don’t give a crap about what you’re selling.\nThey simply think what you offer is of zero need.\n\nYou’re invisible.\n\nLet that sink in.\n\nRarely --- but sometimes --- someone goes, “Wow, great timing, I’m looking.”\nBut it’s rare. It’s almost luck.\n\nThe exception is if you’re the brand everyone thinks of when they want to solve that problem.\n\nA potential buyer has two vendors in their mind before they even start looking for solutions.\n\nTheir day zero list.\n\nIf you have shit marketing, or you’re a lesser-known brand, you’ll always be fighting uphill.\n\nBeing on that day zero list is why big brands keep growing.\n\nI’ve always been in an uphill battle - and I’ve always grinded it out to find success - as you will. \n\nIt just takes time and learning.\n\nIf you want more shit advice look me up - Regan George on Linkedin.",
          "score": 1,
          "created_utc": "2026-02-17 19:55:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o69d38h",
              "author": "Ok-University-2605",
              "text": "thank so so much i needed to hear that. i am more than happy to check your page",
              "score": 1,
              "created_utc": "2026-02-19 15:57:51",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5yatl1",
          "author": "Finners_GrowthStrat",
          "text": "Yup this is not an uncommon story. I'd suggest going back to your core proposition. You'll have a core proposition per customer group or per product (ideally the former) your proposition is a compelling offer that resonates. It's something that your organisation does better than the competition in delivering a valued outcome to your client.\n\nIts not easy to get clarity on your proposition but there are fairly formulaic steps you can follow to get there. The first is taking a step back from tactics and trying to really understand your target customer. Not understand what needs they have for your product but truly understand what makes them tick. This can be a little desk research (googling or gpt) but really needs to include calls with clients. No-sales research interviews. It can feel hard to run these when all you wanna do is pitch but it helps things in the long run.\n\nCustomer is most important, doing that and then layering competitor and your product capability should through up some ideas for what your core value proposition is.\n\nIf helpful to lay it out a bit more let me know and I'll write something up.",
          "score": 1,
          "created_utc": "2026-02-17 23:01:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o69dtmk",
              "author": "Ok-University-2605",
              "text": "thank you so much,, yess please i need more guidance to learn how to lay it out",
              "score": 1,
              "created_utc": "2026-02-19 16:01:24",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5ydl1i",
          "author": "SignificanceBusy2136",
          "text": "Most people don’t respond unless your message hits a very specific need, so narrowing your focus can make a big difference. Pick one product category, learn the pain points, and build a simple, repeatable outreach angle around it.\n\nIt’s also worth checking whether your prospect list is the issue. Using more targeted B2B data sources like Techsalerator can help a lot since their global business datasets actually cover industries in places like Turkey, so you better could reach companies that matched what you are selling. You just need a clearer niche and cleaner targets. Keep iterating.",
          "score": 1,
          "created_utc": "2026-02-17 23:16:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5zm10j",
          "author": "inside-search-1974",
          "text": "Would you give some additional context?\nWhat specific industry, or product categories, type of customer, type of competition, etc.\nI’m open to give some advice but I guess with this level of information it could be very generic.",
          "score": 1,
          "created_utc": "2026-02-18 03:17:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5zo1au",
          "author": "SatisfactionBig7126",
          "text": "Cold B2B outreach is really rough at first. Small improvements in messaging and branding can make a big difference. Agencies like StudioT help craft content that actually gets noticed, which can save you from feeling like your emails are just disappearing into the void.",
          "score": 1,
          "created_utc": "2026-02-18 03:30:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5zvks6",
          "author": "Slight_Tutor1790",
          "text": "It might also help to change the goal of your first message. Right now it sounds like you are pitching and waiting for interest, but in industrial B2B most buyers are not actively looking. Instead of asking if they are interested, try asking a simple question about how they currently handle that specific problem or supplier. That shifts it from selling to starting a conversation. You may get more replies when people feel you are trying to understand their situation rather than sell a product.",
          "score": 1,
          "created_utc": "2026-02-18 04:17:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o69em2h",
              "author": "Ok-University-2605",
              "text": "thank you",
              "score": 1,
              "created_utc": "2026-02-19 16:05:15",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6059o2",
          "author": "svlease0h1",
          "text": "starting b2b sales without replies feels discouraging but it happens early on. focusing on one product and one buyer type usually helps conversations start. rewriting outreach with one clear problem and one result makes emails easier to read. a new rep narrowed focus for two weeks and finally booked meetings.",
          "score": 1,
          "created_utc": "2026-02-18 05:25:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o60tv5d",
          "author": "o1got",
          "text": "did you try analyzing your conversations/emails in Claude? you will get honest feedback and ideas for improvement",
          "score": 1,
          "created_utc": "2026-02-18 09:00:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o69exbq",
              "author": "Ok-University-2605",
              "text": "let me try that . thanks",
              "score": 1,
              "created_utc": "2026-02-19 16:06:44",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o61jowk",
          "author": "WannabeeFilmDirector",
          "text": "You've got some great advice on here, especially focusing on a market.  I started in B2B in a dinky company.  It was hellishly hard until we had some video customer testimonials.  Videos of customers saying it's a great product.  That was a gamechanger.\n\nWe were then bought by Reuters and the brand made everything so much easier.  Ridiculously easier.\n\nSo I'd recommend doing what other people have suggested but getting a little killer collateral.  Because who do prospects trust more?  Is it the salesperson selling to them or videos of customers saying you've got a great product?",
          "score": 1,
          "created_utc": "2026-02-18 12:34:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o62xirz",
          "author": "MembershipHorror404",
          "text": "Four months is still early for B2B, especially if you're selling across multiple product categories. That actually makes it harder because you can't refine one pitch.\n\nA few things that helped us when we were in a similar spot: pick one category and go deep on it first instead of spreading thin across all of them. Way easier to build momentum when you're not switching contexts every call.\n\nAlso, consistent follow-ups matter more than you think. We thought people were ignoring us, too but turns out B2B cycles are just long and people need like 5-7 touchpoints before they even respond. Set up a simple system to track who you've talked to and when to follow up again.\n\nAnd honestly, trade shows and LinkedIn might not be your best channels. What's worked better for us is finding where your buyers actually hang out: industry groups, forums, even niche Slack communities. Cold outreach from those places converts way better than generic LinkedIn messages.\n\nDon't give up yet. Four months is nothing in B2B. Most of our deals took 6-9 months from first contact to close.",
          "score": 1,
          "created_utc": "2026-02-18 16:47:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6653j4",
          "author": "Ancient-Sea-7807",
          "text": "U need to work on matching the customers' frequency! Its okay, all Start broad but when you engage with people, adapt your pitch on the fly. \n\nYou need to Understand their pain points and tailor your conversions to show how your product solves their specific needs. \n\nOnce you've got clarity, target similar audiences and repeat the process. \n\nEverything will help like Cold emails, trade fairs but your content should intrest them – it's all about bridging the gap between what they need and what you offer.",
          "score": 1,
          "created_utc": "2026-02-19 02:12:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o69bkr7",
          "author": "ProfessionalAir6580",
          "text": "B2b is itsself a hard game to crack and time taking as well what u need to do is first of all know your target audience then build connection from lower level first nail it without reference convincing client is difficult. Feel free to DM if u want help",
          "score": 1,
          "created_utc": "2026-02-19 15:50:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6a33y8",
          "author": "eviom_B2BMarketing",
          "text": "Hm, in dem Fall würde ich LinkedIn Ads empfehlen. Hast du das schon mal gemacht?",
          "score": 1,
          "created_utc": "2026-02-19 18:02:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6kc58k",
              "author": "Ok-University-2605",
              "text": "No let me tell the company to do so",
              "score": 1,
              "created_utc": "2026-02-21 07:02:57",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6b70nf",
          "author": "MarketingOB1",
          "text": "B2B requires patience and a long term strategic approach. Build credibility first. Google reviews. Service. Quality.",
          "score": 1,
          "created_utc": "2026-02-19 21:13:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6bd8gk",
          "author": "TightNectarine6499",
          "text": "I don’t see any numbers. Numbers speak.",
          "score": 1,
          "created_utc": "2026-02-19 21:44:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6kc6gc",
              "author": "Ok-University-2605",
              "text": "What do you mean ?",
              "score": 1,
              "created_utc": "2026-02-21 07:03:16",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6ljp46",
                  "author": "TightNectarine6499",
                  "text": "You tried cold emails, networking that all says nothing since you don’t give any numbers and it’s unclear what your approach is. You might not be nurturing, ask for sales before they are ready, or they are not looking for what you offer.\n\nAlso different industries have different habits.\n\nIf you’re not measuring what you’re doing you can’t steer, so you don’t know when to adjust your approach.\n\nAsk your boss for on the job training.\n\nThere are also a lot of free trainings online, check youtube, be specific\n\nMake sure it’s specific to your industry. Send an email to your manager ask for 20 min to discuss sales, show up prepaired so you can ask targeted questions to get to know their industry, typical behavior of their ideal clients.\n\nWhat works, what does not work?\n\nHow does their buying proces works, how many people are involved, at what level should I approach. Get to join in calls, meetings (be fly on the wall). Ask for onboarding.",
                  "score": 1,
                  "created_utc": "2026-02-21 13:35:56",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6ljv7v",
          "author": "TightNectarine6499",
          "text": "Ask chatgpt",
          "score": 1,
          "created_utc": "2026-02-21 13:37:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6matfl",
          "author": "Round_Bullfrog_4563",
          "text": "What's your service? Can you specify? Finding a top notch service is important. Problem I have is I've got 190k real estate, 450k ecommerce, 127k accounting and other leads. Now I need to figure out what to sell them.\n\nAnd you mentioned you're targeting Turkish clients. Why not US, UK, Aus clients? English speaking ones Is easier",
          "score": 1,
          "created_utc": "2026-02-21 16:07:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ng3l4",
          "author": "KissyyyDoll",
          "text": "Sounds like you’re juggling too much at once. Focus on one product line, one target persona, and build a strategy there before spreading thin.",
          "score": 1,
          "created_utc": "2026-02-21 19:33:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ub078",
          "author": "Dxstinity",
          "text": "sounds like you're hitting a rough patch, but don't get discouraged! maybe try narrowing down your target audience a bit more. focus on understanding their specific pain points and tailor your outreach to that. also, have you thought about using something like mailly? it helps with figuring out the right fit and crafting better messages. good luck!",
          "score": 1,
          "created_utc": "2026-02-22 21:14:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6w3cth",
          "author": "Hot-Butterscotch2711",
          "text": "Four months with no training and multiple product lines is a brutal setup, so don’t beat yourself up. I’d pick one product and one buyer type to focus on first and get super specific in outreach. Warm things up by engaging on LinkedIn before DMing. Way easier to get replies when your name isn’t cold",
          "score": 1,
          "created_utc": "2026-02-23 03:20:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5vp8y0",
          "author": "Own-Skin-354",
          "text": "four months in b2b sales with no training and no clear product focus is honestly a very tough setup, so don’t beat yourself up too fast.\n\nfrom what you wrote, the biggest issue sounds like too much spread. too many product categories and one generic message. buyers switch off when the pitch feels broad.\n\npick one product line and one buyer type first. write to their specific problem in simple words. show that you understand their use case, not just your catalog.\n\nalso try to get on calls instead of only sending emails. even short intro calls help you learn faster than 100 ignored messages.\n\nif possible, ask your company for past customer data or old deals and study what actually worked. patterns are usually there.\n\nearly b2b sales is less about volume and more about relevance. once your message fits the buyer, replies start coming.",
          "score": 1,
          "created_utc": "2026-02-17 15:31:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5vqfer",
              "author": "Ok-University-2605",
              "text": "I actually do that \nI spent some time learning the machines , which don’t take a long time because I’m actually and engineering graduate. But I’m not a salesperson that’s where I’m struggling.\nI try to dedicate my days to focus on searching and finding customers , for example one day is only for the product A , and the next day is for product B and so on. \nI never email anyone to pitch about multiple products. \nI never tried calling actually. Maybe I should switch to that",
              "score": 2,
              "created_utc": "2026-02-17 15:37:14",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5w06js",
                  "author": "Kindly_Watercress416",
                  "text": "The fact that you’re not a sales person can be even better. You understand the tech side deeply and it can work for you. So don’t worry",
                  "score": 2,
                  "created_utc": "2026-02-17 16:25:12",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5xbti7",
          "author": "Tiny-Celery4942",
          "text": "Starting from zero with no mentor is tough, especially with too many products. I found that trying to reach everyone usually means reaching no one. I stopped the random cold outreach and moved to a daily loop that actually works. \n\nFirst, I pick twenty high value prospects and only follow their posts. I leave real comments on their content for a week before I ever send a message. This makes my name familiar. When I finally reach out, I mention a specific point they made. \n\nI use Depost AI to manage this workflow. it helps me keep a targeted feed of just those prospects and drafts my first comments and follow ups so I stay consistent. It keeps my DMs organized so I never miss a reply. Happy to share my daily checklist if it helps.",
          "score": 1,
          "created_utc": "2026-02-17 20:11:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o69cb06",
              "author": "Ok-University-2605",
              "text": "thank you for the advice, but how do i pick the high value prospects :(",
              "score": 1,
              "created_utc": "2026-02-19 15:54:04",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o69f2i6",
                  "author": "Tiny-Celery4942",
                  "text": "First start creating content around you ICP's, it will serve you much better then spraying cold DMs, Emails, daily you will find interested users you can engage them.. Finding high value prospects starts with looking at who is already active in your niche. Use LinkedIn search , SN to find people posting about your industry or commenting on your competitors posts. These are the warm leads because they are already talking about the problems you solve. I use Depost AI to save these specific people into a targeted feed so I can engage with them before sending a DM. This way I only talk to people who actually care about the product. \n\nYou may consider creating different accounts for each ICP, but it will move your funnel, build some authority by content, so you get listen.",
                  "score": 1,
                  "created_utc": "2026-02-19 16:07:25",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1rad461",
      "title": "How do I scale from 2k to 10k per month",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1rad461/how_do_i_scale_from_2k_to_10k_per_month/",
      "author": "This_Assignment_2188",
      "created_utc": "2026-02-21 00:52:27",
      "score": 22,
      "num_comments": 20,
      "upvote_ratio": 0.97,
      "text": "Hey all,\n\nI’ve been an avid reader of the subreddit for quite some time. Recently, I decided to leave my full time job and, with a bit of runway, start my own SaaS instead of working a regular 9-5.\n\nAnyway, it’s gone pretty well and I’ve hit approx 2k per month with a pretty decent profit margin.\n\nI’ve got to this point by product hunt launches and launching on other similar sites.\n\nI’ve got a super low churn rate, which is helpful! However, I don’t feel as though I have enough money to start doing paid ads.\n\nI’ve got approx $900 to work with each month. My question is this: how do I get to 10k per month without doing paid ads?\n\nIt’s a bit of a catch-22. I can’t scale without ads and I can’t get ads without scaling.\n\nMy tool is a SaaS that identifies visitors on your website and turns them into pipeline for you to sell to. See: Clickmodus.com\n\nAny advice would be much appreciated.",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1rad461/how_do_i_scale_from_2k_to_10k_per_month/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o6iw35k",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-21 00:52:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6iy1r3",
          "author": "I_trust_politicians",
          "text": "I'd start talking to the customers you've brought in. See why they signed up for your product (was there a trigger moment), and what specific problems it's solved for them/successful outcomes they've gotten from it. Look for similarities/are they from a specific industry etc. \n\nIf they are coming from a similar industry/use case, you could test linkedin ads with super-narrow targeting. I worry SEM will have too much competition, and you'll end up getting like 28 clicks for your $900. \n\nBut honestly, I'd probably look into a referral program for existing customers. Give them some sort of discount every time they refer someone. ",
          "score": 5,
          "created_utc": "2026-02-21 01:04:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6j0c2h",
              "author": "This_Assignment_2188",
              "text": "This is great, thank you. The nature of my product allows me to see my customers sites - I’m going to do a deep dive into that and see what I come up with. I am going to give more thought into the LinkedIn ads route.",
              "score": 2,
              "created_utc": "2026-02-21 01:18:36",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6iyfyf",
          "author": "kubrador",
          "text": "sounds like you need to pick a vertical and become the default answer for that problem instead of trying to be everything to everyone. $900/month goes way further doing outreach to 50 specific companies than running ads to the void.",
          "score": 2,
          "created_utc": "2026-02-21 01:06:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6j0l96",
              "author": "This_Assignment_2188",
              "text": "Interesting, could you explain this a bit further? My tool is quite broad in the fact that it helps almost all B2B sites - how do I decide what vertical to pick? I’m guessing something low competition although that is easier said than done!",
              "score": 2,
              "created_utc": "2026-02-21 01:20:09",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o6k5pij",
              "author": "fistminut",
              "text": "yeah this is the move. when you say \"pick a vertical\" how narrow are you thinking, like \"shopify agencies\" narrow or just \"b2b saas\"? and are you doing cold email or linkedin for those 50?",
              "score": 1,
              "created_utc": "2026-02-21 06:05:25",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6lcbac",
          "author": "GetCameraCrew",
          "text": "How did you get to 2k?",
          "score": 1,
          "created_utc": "2026-02-21 12:44:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6ld5c9",
              "author": "This_Assignment_2188",
              "text": "Launching on sites such as product hunt. Also trying to get some traction via Reddit but not seeing much success.",
              "score": 1,
              "created_utc": "2026-02-21 12:50:33",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6lgqpm",
                  "author": "GetCameraCrew",
                  "text": "Can you lunch 5 more times? and you'll get to 10k",
                  "score": 1,
                  "created_utc": "2026-02-21 13:16:20",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6mfejz",
          "author": "Confident_Box_4545",
          "text": "2k to 10k is not an ad problem. It is a distribution loop problem.\n\nIf churn is low, double down on referrals, case studies, and outbound to the exact ICP already converting.\n\nScale what already works before you pay to amplify it.",
          "score": 1,
          "created_utc": "2026-02-21 16:30:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6mmwfs",
          "author": "Wise-Trouble-653",
          "text": "The trap is thinking ads are the lever that takes you from 2k to 10k.\n\nAt 2k MRR, your issue isn’t traffic. It’s focus. Product Hunt gave you bursts, not a repeatable engine. Scaling now is about picking one distribution path and exhausting it.\n\nYou sell pipeline. That means your buyers care about revenue, not features. Can you niche down to one segment where the ROI is obvious and build direct outbound around that? 50 highly targeted conversations a week beats broad ads.\n\nLow churn means you have proof. Turn that into case studies and partner with agencies or consultants who already sell to your ICP.",
          "score": 1,
          "created_utc": "2026-02-21 17:07:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6nmrcz",
          "author": "_forgotmyownname",
          "text": "Yeah, $900 isn’t huge for ads. I’d try making awesome guides, case studies, or templates for your audience and share them on forums, LinkedIn, or relevant communities. Word-of-mouth + free channels can do a lot.\n\n",
          "score": 1,
          "created_utc": "2026-02-21 20:07:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ocbps",
          "author": "manufacturermarketer",
          "text": "I'm not SaaS person but here's couple of advice:\n1. Never put all of your eggs in one basket. Don't just rely on paid ads, do SEO/GEO, paid ads and cold emailing.\n2. Conversions are all about positioning, experience and trust.\n3. Don't focus on scaling from 2K to 10K focus on gradually going from 2K to 2.5K then 3K. Plan\n4. Most companies(especially b2b) build a strategy and then figure out things on the job.\n5. Place good systems and people in place which will focus on the actual data than their own assumptions.",
          "score": 1,
          "created_utc": "2026-02-21 22:24:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6w30zg",
          "author": "Slight_Tutor1790",
          "text": "You already proved people will pay for it, so I would stop thinking about channels and start thinking about leverage. Instead of chasing more launches or testing ads too early, I would look at your highest paying customers and see if there is a way to increase their ARPU through a premium tier, done for you onboarding, or performance based pricing. Going from 2k to 10k can come from 40 new small customers, or from 10 better ones. Sometimes the fastest path is not more traffic but better monetization of the traffic you already have.",
          "score": 1,
          "created_utc": "2026-02-23 03:18:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6w5gll",
          "author": "FRNk7600",
          "text": "At this stage, scaling isn’t about ads it’s about turning what already works into a repeatable system.\n\nYou’ve already done the hard part:\n\t•\tProduct works\n\t•\tLow churn\n\t•\tPeople are paying\n\nThat means distribution > features now.\n\nA few levers that usually move 2k → 10k without paid ads:\n\n1) Double down on the channel that already converted\nProduct Hunt worked once, but the insight is why it worked.\nWho signed up? What role? What problem were they trying to solve?\nTurn that into:\n\t•\ttargeted outbound\n\t•\tcommunity posts\n\t•\tdirect integrations or partnerships\n\n2) Sell to people who already believe\nYour product identifies website visitors → pipeline.\nYour best customers are likely:\n\t•\tB2B founders\n\t•\tAgencies\n\t•\tSales-led SaaS\n\nThose people already hang out in very specific places. Go where the intent is instead of trying to create it.\n\n3) Raise ARPU before chasing volume\nGoing from 2k → 10k is often:\n\t•\tbetter packaging\n\t•\tclearer positioning\n\t•\ta higher-tier offer (even manual at first)\n\n5 customers at $200 > 50 customers at $20.\n\n4) Use $900 to buy learning, not scale\nSpend it on:\n\t•\ttools to find your ICP\n\t•\tbetter data\n\t•\texperiments that shorten feedback loops\n\nAds only work when the message is already proven.\n\nYou’re not stuck you’re just between validation and distribution.\nFigure out where your current buyers came from and build a system around that before touching ads.",
          "score": 1,
          "created_utc": "2026-02-23 03:34:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ktgge",
          "author": "Imaginary-Leg-2546",
          "text": "You can't get to 10k per month without running paid ads.",
          "score": 0,
          "created_utc": "2026-02-21 09:52:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6kugi8",
              "author": "This_Assignment_2188",
              "text": "At what point to I swap to paid ads? Do I just take all of my net profit for the month and put into ads? I thought the pixels on these sites needed time to learn etc.",
              "score": 1,
              "created_utc": "2026-02-21 10:02:19",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6r5g3k",
                  "author": "maxroix_",
                  "text": "Yes invest your own money and net profit. \nWe do SEO/AEO/GEO full on social media marketing. So if you are interested lmk \nCurrently working with big brand names",
                  "score": 1,
                  "created_utc": "2026-02-22 11:03:04",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1rbf634",
      "title": "B2B marketing feels way harder than it should.",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1rbf634/b2b_marketing_feels_way_harder_than_it_should/",
      "author": "FRNk7600",
      "created_utc": "2026-02-22 07:05:48",
      "score": 18,
      "num_comments": 41,
      "upvote_ratio": 0.85,
      "text": "I work on the “boring” side of growth – fixing the systems that turn attention into pipeline for B2B companies – and I keep seeing the same thing:\n\n\\- LinkedIn posts going out, but no real conversations  \n\n\\- Email sequences set up, but reply rates are near zero  \n\n\\- Ads getting clicks, but nobody remembers the offer a week later\n\nWhen you strip the buzzwords away, B2B marketing is just:  \n\nget in front of the right businesses, start real conversations with decision‑makers, and make it easy for them to say “yes” when the timing is right.\n\nThe stuff that seems to work best right now (from what I’m seeing):\n\n\\- Very specific positioning (one ICP, one problem, one clear outcome)  \n\n\\- Consistent “helpful first” posting + comments in niche communities (Reddit, LinkedIn groups, etc.)  \n\n\\- Simple outbound systems that warm people up instead of blasting cold pitches\n\nI’m curious what’s actually working for others here:\n\n\\- If you’re in B2B, what channel is driving the most \\*real\\* opportunities for you right now?  \n\n\\- Are you seeing more movement from content, outbound, communities, or something else?\n\nIf it’s useful, I’m happy to break down how I’d build a simple B2B marketing / outbound system for one or two examples in the comments (no pitch, just architecture).",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1rbf634/b2b_marketing_feels_way_harder_than_it_should/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o6qgkn2",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-22 07:05:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6qy9p4",
          "author": "Lonely_Noyaaa",
          "text": "The dirty secret of near zero reply rates on email sequences is that most of them are written for the sender's convenience not the recipient's reality, and a single genuinely useful email that acknowledges a real pain point will outperform a six step automated sequence every single time.",
          "score": 13,
          "created_utc": "2026-02-22 09:54:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6ub42z",
              "author": "FroyoConfident1367",
              "text": "Have experienced this myself and the case of LinkedIn, I custom crafted my message for my ICP and I got 3 out of 10 people replying and booking meeting with me.",
              "score": 2,
              "created_utc": "2026-02-22 21:15:09",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o6wjv0v",
              "author": "Admirable-Package-44",
              "text": "YES, this. 1,000 times yes. Your emails need to deliver something of VALUE to the Champion in your Buyer Group. Yes, it could be addressing a pain point — but other things are valuable as well: industry survey, top 10 list to increase revenue, even something funny (I.e: industry cartoon...) 95% of the time your prospect is not ready to buy. Give them a positive experience of your brand before buying-time comes around and you'll show up on the Short List of contenders.\n\nConversely, sending email sequences that constantly asks for business while pretending to know them gets your URL banned and a negative brand impression for your company. You are LITERALLY destroying brand trust and value.",
              "score": 1,
              "created_utc": "2026-02-23 05:16:18",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6sce36",
          "author": "CarmeloManning",
          "text": "When you’re really honest about the digital industry, you’ll see all of the KPIs that we’ve established as a fact for the last 20 years, were all made up by someone to sell something.",
          "score": 7,
          "created_utc": "2026-02-22 15:42:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6ubhyg",
              "author": "FroyoConfident1367",
              "text": "Jira is such a great example",
              "score": 2,
              "created_utc": "2026-02-22 21:17:04",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6qn0o8",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 3,
          "created_utc": "2026-02-22 08:06:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6s292z",
              "author": "FRNk7600",
              "text": "Outbound works when it’s intentional, not spam. What signals are you leaning on most when picking those 20–50 accounts?",
              "score": 2,
              "created_utc": "2026-02-22 14:51:53",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o6rx8h1",
              "author": "willsamadi",
              "text": "What’s an example of a reason to talk that’s not book a demo?",
              "score": 1,
              "created_utc": "2026-02-22 14:25:01",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6qr8e3",
          "author": "eviom_B2BMarketing",
          "text": "B2B Marketing ist meiner Meinung nach dankbarer als B2C... Wir setzen hier neben Inbound auf die Kombi mit Paid Ads. Bewährt sich gut, machen damit unsere Hauptumsätze ☺️",
          "score": 3,
          "created_utc": "2026-02-22 08:47:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6td3o0",
          "author": "Wise-Trouble-653",
          "text": "The reason it feels harder is because attention is no longer the bottleneck. Relevance is.\n\nMost B2B content is technically correct but strategically vague. So it gets seen, maybe even clicked, but it doesn’t create urgency. Decision-makers don’t move because nothing feels specific to their current constraint.\n\nWhat I’m seeing work is tight ICP focus plus problem timing. When you speak to a situation they’re actively dealing with, conversations happen. When you speak to a general “growth” idea, it drifts.",
          "score": 4,
          "created_utc": "2026-02-22 18:28:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6su03t",
          "author": "richard-b-inya",
          "text": "This will shock you.  We were approached by a company a few months ago.  Automated mail.  Yes regular mail.  Their idea seemed wild but what they said made a lot of sense.  Mail isn't used much anymore.  There used to be tons of \"spam\" and bills.  Most spammers have moved away from it and most bills are electronic paperless option these days.  So the mail collected gets a lot more attention.\n\nHowever we are B2C so not sure how it would work when the decision maker isn't getting the mail in larger companies.  If you do do small companies where the owner gets the mail I could see it working.  Or maybe addressed to the decision maker if your lead source has that.",
          "score": 2,
          "created_utc": "2026-02-22 17:00:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6wl070",
              "author": "Admirable-Package-44",
              "text": "Creative Director here for award-winning direct response agency. YES, paper mail \"still works\" with B2B and will definitely get opened and get attention in the corporate world if the envelope has a 3D chachki in it -- Pen, notebook, desk toy, etc....",
              "score": 1,
              "created_utc": "2026-02-23 05:25:13",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6tzm8z",
          "author": "SuspiciousTruth1602",
          "text": "That's a really insightful breakdown of the B2B landscape. I agree, it's easy to get lost in the noise and forget the fundamentals. We've found a lot of success by focusing on super-targeted engagement within niche communities, like you mentioned. The key is finding relevant conversations happening in real-time. For us, that's been across Reddit, X, and LinkedIn. The challenge we faced was the sheer volume of posts and comments. Just searching for keywords wasnt cutting it – too much irrelevant stuff. We ended up building a tool to solve this. It helps us filter out the noise and only notifies us when theres a genuine opportunity to contribute to a relevant discussion or connect with a potential customer. It’s been a game-changer for finding warm leads through organic outreach, because we can catch people actively discussing problems our product solves. Plus, having some suggested replies ready to go saves a ton of time. To answer your question directly, communities have been the biggest driver of real opportunities for us. Its about being helpful, adding value to the conversation, and building relationships. Outbound still has its place, but its gotta be warm and informed by insights gathered from those community interactions.",
          "score": 2,
          "created_utc": "2026-02-22 20:16:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6uvztu",
              "author": "B2BScaler",
              "text": "What tool is this creation of yours? I'd love to take a look!",
              "score": 1,
              "created_utc": "2026-02-22 23:03:59",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o6vlj7z",
              "author": "Crazy_Sir_2770",
              "text": "What is “community” you referring to ? Please help clarify",
              "score": 1,
              "created_utc": "2026-02-23 01:31:21",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6y4uq7",
                  "author": "SuspiciousTruth1602",
                  "text": "depends on the product, for me its communities like build in public on X, most of LinkedIn, and subs like this one",
                  "score": 1,
                  "created_utc": "2026-02-23 13:28:15",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6w2t69",
          "author": "Slight_Tutor1790",
          "text": "Funny how half the thread proves your point in real time. Everyone agrees on tight ICP and better messaging, but very few talk about internal alignment between marketing and sales. Most of the friction I see comes from handoffs, unclear definitions of a qualified opportunity, and offers that sales does not fully believe in. When those pieces are tight, even average channels start performing better because the whole system is pulling in the same direction.",
          "score": 2,
          "created_utc": "2026-02-23 03:16:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6x2y4q",
              "author": "Jo-callaway",
              "text": "I have to agree with you on this. MQLs and SQLs aren’t aligned and you have an invisible leak which bleeds your campaigns to death.",
              "score": 1,
              "created_utc": "2026-02-23 08:03:38",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6qz81m",
          "author": "kubrador",
          "text": "the irony of posting this in b2b marketing is that you're about to get 47 replies from people selling b2b marketing systems. genuinely curious which channel is actually working though.",
          "score": 4,
          "created_utc": "2026-02-22 10:03:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6s2a6d",
          "author": "OneStand5448",
          "text": "sure I’d be curious to see your architecture",
          "score": 2,
          "created_utc": "2026-02-22 14:52:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6shdkm",
          "author": "hems004",
          "text": "Consistent video creation that speaks about the solutions to the problems worked for me....",
          "score": 1,
          "created_utc": "2026-02-22 16:03:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ttxgc",
          "author": "Zealousideal-Job6344",
          "text": "I am sorry to hear that you feel b2b is boring and hard. Well yes there is less glamour in the face of things, but if take a step back to see the impact or revenue it generates, it will surprise you. \n\nWhile it seems to be, boring you do seem to have found things that work for you. Kudos ! \n\nWould you open to a demo of the solutions that you built. If yes, please DM me!",
          "score": 1,
          "created_utc": "2026-02-22 19:48:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6w17om",
          "author": "Darkpanther061",
          "text": "Yeah, this is painfully real. Most teams aren’t “bad at marketing,” they’re just doing a bunch of disconnected stuff that looks busy but doesn’t move deals. Your list is basically the symptom list.What’s worked best for us lately is boring but reliable: pick a tight ICP, pick one problem they already admit they have, and build one path that goes from “I saw this” to “I want to talk” without switching voices 5 times. If LinkedIn posts don’t lead to DMs, the post is usually too generic, or the CTA is weird. If emails get no replies, they’re written for the sender, not the buyer.Also agree with the commenter calling out “activity cosplay.” If you’re not getting real convos, shrink the target list and go deeper. 20–50 accounts with real angles beats blasting 2,000 people with “quick question.”If you’re trying to fix the whole system (not just tweak copy), having someone come in and force alignment on ICP, offer, and what counts as a qualified opportunity can save months. I’ve seen Demand Revenue be solid for that kind of “make the machine actually connect” work without turning it into a million random tactics.",
          "score": 1,
          "created_utc": "2026-02-23 03:06:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6wt45u",
          "author": "Public_Quiet_3624",
          "text": "I'm facing similar problem. Do you recommend to find a service first or find customers first? Because I found lead of various niches like saas, dental, real estate, agencies, linkeidn sales navigator, etc. Now have to figure out what to sell them.\n\nAnd i feel that b2b might be fast to find clients but we can sign $2k a month service. And only need like 4 clients to make $8k a month (yeah it sounds easy to say but is hard lol) still I belive B2B is 100x easier than SAAS for beginners",
          "score": 1,
          "created_utc": "2026-02-23 06:33:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6x83co",
          "author": "Jo-callaway",
          "text": "Most outreach wanna sell the ‘appointment’ too quickly. We all do but the reality is that b2b game is a long game and creating consistent meaningful touch points is the key!",
          "score": 1,
          "created_utc": "2026-02-23 08:54:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6xdwh8",
          "author": "Tiny-Celery4942",
          "text": "yep B2B marketing often feels like shouting into a void because we focus too much on the volume of posts rather than the depth of the actual conversations. I shifted my focus from broad reach to a tight daily loop that actually builds a pipeline.\n\nHere is the simple system I use now:\n\n1. Build a list of fifty dream accounts and only engage with their posts.\n\n2. Leave three thoughtful comments a day that add to their ideas.\n\n3. Send a connection note only after they recognize my name from those comments.\n\n4. Track every reply and set a reminder to follow up three days later if they go quiet.\n\nI use Depost AI to manage this entire workflow. It helps me maintain a targeted feed of just my prospects and drafts initial comments in my own style so I can stay visible without spending hours on it. It also tracks my DMs so no warm lead ever slips through the cracks. Happy to share my full daily checklist if you want to see the breakdown.",
          "score": 1,
          "created_utc": "2026-02-23 09:52:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6xkyg3",
          "author": "This_Assignment_2188",
          "text": "You are spot on with the niche communities. If you can find a way to provide some actual value to them, you win.",
          "score": 1,
          "created_utc": "2026-02-23 10:58:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6xou44",
          "author": "Mobile-Ambition-3714",
          "text": "The stuff that’s actually moving the needle for B2B right now is usually super clear messaging and actually being present in the right places where your buyers hang out online. Outbound only works when it feels like a real person reaching out and not just another “nurture sequence.” Community is underrated when you’re patient and actually add something to the convo, not just farming leads. Most wins seem to come from being specific and helpful, not from spraying and praying across channels.\n\n",
          "score": 1,
          "created_utc": "2026-02-23 11:33:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6xu1nt",
          "author": "Icy_Assistance991",
          "text": "The shift from 'blasting pitches' to 'niche communities' is spot on. I’ve noticed the biggest missed opportunity for B2B pipeline right now is what I call the **Video Gap**.\n\nMost teams obsess over their own LinkedIn posts but completely miss the organic conversations happening in vertical video (TikTok/Shorts) where their ICPs are actually venting about problems. We’re seeing that the 'real' opportunities come when you can identify a specific narrative forming in those videos and enter the conversation with clarity before it even hits a LinkedIn feed.",
          "score": 1,
          "created_utc": "2026-02-23 12:15:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6y83s9",
          "author": "OkDependent6809",
          "text": "agree with most of this but the channel problems usually come from not understanding the icp well enough before building anything.\n\nemail reply rates are near zero because messaging is based on assumptions vs things customers have actually said. talking to even 10-15 real prospects before building the system changes the copy, the positioning, everything.\n\nwarm outbound is working best for us right now. cold blasting is basically dead.",
          "score": 1,
          "created_utc": "2026-02-23 13:47:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6yc6mt",
          "author": "PianoRevolutionary72",
          "text": "Podcast advertising.",
          "score": 1,
          "created_utc": "2026-02-23 14:10:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6s3tu6",
          "author": "lemadfab",
          "text": "Inbound is dead, outbound is ok but not great… but tradeshow, speaking event and interview in niche Trades worked incredibly well. It really resonate with your point: pick a lane and be the best and most helpful in there. Now the big challenge is building a proper opportunity engine.",
          "score": 1,
          "created_utc": "2026-02-22 14:59:57",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r9h0a7",
      "title": "How are you improving AI search visibility in 2026?",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1r9h0a7/how_are_you_improving_ai_search_visibility_in_2026/",
      "author": "purpleplatypus44",
      "created_utc": "2026-02-20 00:50:50",
      "score": 17,
      "num_comments": 24,
      "upvote_ratio": 1.0,
      "text": "Yo, i’ve been thinking a lot about AI visibility lately, not just classic Google SEO. Rankings and backlinks still matter, obviously, but I keep hearing people say they found brands through ChatGPT or Google AI Overviews instead of clicking search results. That kind of made me pause. It feels like LLM visibility and AI search optimization are becoming their own thing.\n\nWhat I’m trying to wrap my head around is what actually moves the needle here. Is it still mostly the traditional SEO stuff like topical authority and strong internal linking? Or is AI visibility more about clear positioning, solid comparison pages, tight FAQs, structured content, and consistent brand mentions across trusted sites? It’s a bit confusing tbh.\n\nFor anyone actively working on GEO or AEO, what has genuinely helped you get cited in AI answers? Are you tracking LLM mentions separately from normal rankings? And honestly, what mistakes have you made that others should avoid when trying to build long-term AI search visibility?",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1r9h0a7/how_are_you_improving_ai_search_visibility_in_2026/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o6catct",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-20 00:50:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6cbwfh",
          "author": "ronniealoha",
          "text": "OP, classic SEO still matters. Authority, internal links, backlinks, that’s the foundation. But that’s table stakes now. What really moves AI visibility is clarity. Clear positioning, strong comparison pages, direct answers, tight FAQs, and consistent mentions across the web. LLMs need to clearly understand what you are and when to recommend you.\n\nThe teams doing well treat GEO as a second layer. They still optimize for Google, but they also track a set of non-branded prompts in ChatGPT or Perplexity, log citations, and adjust content based on gaps. Some use tools like Meridian to make that tracking easier over time.\n\nBig mistake I see? Adding more content instead of making existing content clearer and more citable. AI rewards obvious authority, not just volume.",
          "score": 8,
          "created_utc": "2026-02-20 00:57:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6d7vlv",
              "author": "Forcepoint-Team",
              "text": "Well said",
              "score": 1,
              "created_utc": "2026-02-20 04:19:20",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6cbs1l",
          "author": "EldarLenk",
          "text": "Tbh I think most people are still stuck in more content equal more visibility mode. That worked years ago. Now? Not really. If your positioning is vague, you can publish 50 blog posts and LLMs still won’t know what box to put you in. I’d rather see 10 super clear, tightly focused pages than 100 random ones. Clarity beats volume every time.",
          "score": 2,
          "created_utc": "2026-02-20 00:56:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ccnzc",
          "author": "pumpkinpie4224",
          "text": "ngl, stop obsessing over mentions and start caring about citations. A mention is nice for ego. A citation means your page was trusted as a source. That’s the signal that matters. When I review this stuff, I literally ask, “Which URL got pulled?” If you can’t answer that, you’re just staring at vibes.",
          "score": 2,
          "created_utc": "2026-02-20 01:01:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6d18u9",
          "author": "SearchMaverick",
          "text": "What's working for us is treating AI visibility as a citation problem, not a content-volume problem. Build topical clusters around high-intent questions, add clear entity/context signals and publish evidence-rich pages that are easy to quote. \n\nThen track three things by topic - mention rate, citation rate and assisted conversions from AI referrals, not just raw traffic. Biggest mistake I keep seeing is publishing generic AI-written posts without a map, which creates output but not authority.",
          "score": 2,
          "created_utc": "2026-02-20 03:34:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6cd88j",
          "author": "Tchaimiset",
          "text": "For me, off site context matters more than people admit. Like with reddit threads, niche communities, review sites, podcasts, guest posts. LLMs don’t just read your homepage. They piece together who you are from the whole web.   \nIf your brand only exists on your own domain, that’s a weak entity signal. You need people talking about you elsewhere.",
          "score": 1,
          "created_utc": "2026-02-20 01:05:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6daoo3",
          "author": "celestialcascade012",
          "text": "I’ve been thinking about the exact same thing, I actually started working with SearchTides specifically to figure this out. Clear messaging alignment so AI consistently associates us with a specific category",
          "score": 1,
          "created_utc": "2026-02-20 04:39:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6eh1p3",
          "author": "LeadershipRare1908",
          "text": "Reddit is pretty useful to get mentionned by LLMs.  \nBtw Sam Altman personally owns around 8.7% of Reddit (making him the third-largest shareholder)  \n  \nI don't think this is insignificant ",
          "score": 1,
          "created_utc": "2026-02-20 10:55:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6eh98r",
          "author": "PerfectFinish94",
          "text": "Previously, the goal was to rank only on Google, which was fine with blogs and links, but now we need to be seen in AI answers, so we need to get as many mentions as possible, which we can now refer to as listicles and brand mentions, and we can't just rely on blog posting; we need to be active on all platforms.",
          "score": 1,
          "created_utc": "2026-02-20 10:56:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6fr9pr",
          "author": "Gotoclient",
          "text": "Reddit is definitely useful for LLM citations",
          "score": 1,
          "created_utc": "2026-02-20 15:33:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6grfrv",
          "author": "AdamYamada",
          "text": "You need a Reddit strategy. \n\nAlso helps to have other publications answer questions about your brand. Not just on your own website. \n\nI've even helped build-up a 3rd party publications to help with this. ",
          "score": 1,
          "created_utc": "2026-02-20 18:19:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6gvvns",
          "author": "Hopeful_Account_1370",
          "text": "Look, I get the confusion AI search feels like a whole new game in 2026, and yeah, people are finding brands via ChatGPT, Perplexity, or Google AI Overviews without clicking through. But let's cut the bullshit: it's **not** \"its own thing\" separate from SEO.\n\nI've run AEO for SaaS clients since 2024 one fintech jumped 7x in citations in 90 days by adding original benchmarks + advertorials on authority pubs, plus tracking via tools like Profound or Semrush AI Visibility. Zero magic; just consistent, citable content + off-site authority signals.\n\nMistakes killing most people: keyword stuffing (AI hates it), ignoring conversational/long-tail intent, stagnant content (freshness matters), or chasing \"simplified\" fluff that tanks real SEO.\n\nTrack LLM mentions separately yes, use visibility tools (Semrush, Conductor benchmarks show it's now a core KPI).\n\nIf you're still treating this as \"classic SEO + some FAQs,\" you're getting eaten alive. Build real authority with data no one else has, get mentioned everywhere trusted, and structure like AI wants to quote you. That's it no shortcuts.\n\nAI visibility isn't new tricks; it's traditional SEO on steroids with citation hunger.\n\nDo that, or watch your traffic evaporate",
          "score": 1,
          "created_utc": "2026-02-20 18:39:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6h0yf9",
          "author": "No-Perspective4464",
          "text": "Structured content, clear positioning, and getting mentioned on trusted third-party sites seem to be what actually moves the needle for LLM visibility.. tools like Semrush or VoxLabs can help you track where your brand is showing up and what's driving those mentions.",
          "score": 1,
          "created_utc": "2026-02-20 19:02:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6hcu0t",
          "author": "erickrealz",
          "text": "Stop treating this like a separate discipline. AI models pull from the same damn sources that rank well traditionally, authoritative content, strong brand signals, and consistent mentions across trusted sites.\n\nThe stuff that actually works is boring. Clear product positioning, solid comparison content, well structured FAQs, and getting mentioned naturally in industry discussions. That's it.\n\nBiggest mistake I see is people chasing \"AI optimization\" as some new shiny thing while ignoring fundamentals. Nail your topical authority first and the AI citations follow.",
          "score": 1,
          "created_utc": "2026-02-20 19:59:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6hj2qu",
          "author": "fishmatador",
          "text": "Mostly still strong SEO fundamentals, but the big win is clear, structured, question-focused content that’s easy for LLMs to quote, plus tracking AI citations separately from normal rankings.",
          "score": 1,
          "created_utc": "2026-02-20 20:30:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6pnm26",
          "author": "Thomas-at-Vanguard",
          "text": "For us it’s been layering on structure and reformatting to make it more easily digestible for LLMs but the same content types still work. \n\nFocusing on how much stuff costs, comparisons, best of type articles are heavily referenced because that’s what people are asking. The answer matters more than any ‘hack’.",
          "score": 1,
          "created_utc": "2026-02-22 03:18:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6w3ike",
          "author": "Hot-Butterscotch2711",
          "text": "Totally a real shift. What’s worked for us is being super clear and specific with content more than chasing links. Clean FAQs and comparison pages seem to get picked up more by ChatGPT and Google AI Overviews. Biggest mistake was vague positioning and fluffy pages",
          "score": 1,
          "created_utc": "2026-02-23 03:21:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6xevyi",
          "author": "Chance-Tower-7926",
          "text": "Right now it's all about basic SEO fundamentals. That's what's going to make a big difference to both traditional SEO but also \"GEO\". Clear audience, helpful content, clear messages, providing actually useful and informative. content in a helpful way.",
          "score": 1,
          "created_utc": "2026-02-23 10:01:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6zbpcp",
          "author": "TemporaryKangaroo387",
          "text": "good question. been working on this for a while so heres what actually moved the needle vs what was a waste of time\n\n**what worked:**\n- entity consistency across the web. if your brand name, description, and positioning is inconsistent between your site, linkedin, g2, capterra etc, LLMs get confused about who you are. cleaning that up alone improved visibility for some brands we track\n- comparison and \"vs\" pages. LLMs love pulling from these when someone asks \"whats the best X for Y\"\n- getting cited in independent reviews, not just your own blog. third-party mentions on forums, review sites, niche publications\n\n**what didnt work:**\n- just pumping out more blog content. volume means nothing if the content isnt structured for direct answers\n- schema markup alone. helps a little but its not the magic bullet people claim\n\n**mistakes to avoid:**\n- dont optimize for one model only. ChatGPT, Perplexity, Claude all weight things differently. you need to track across all of them\n- dont confuse Google AI Overview visibility with LLM visibility, totally different systems\n\nfor tracking I use vectorgap to monitor share of voice across models. biggest insight: some brands rank #1 on Google but are completely invisible to ChatGPT because they lack entity clarity. its a different game",
          "score": 1,
          "created_utc": "2026-02-23 17:04:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6dozv9",
          "author": "supriya_l89",
          "text": "The present situation demonstrates that organizations need to focus on their core business operations yet they must develop systems which machines can understand.   \n  \nTopical authority still matters. People who lack strong traditional SEO abilities will have difficulty appearing in AI responses. The following elements have contributed most to success:  \n  \nLLMs show better performance when presented with clear and precise positions.  \n  \nThe website contains two types of pages: comparison pages and use-case pages.  \n  \nThe website provides short FAQs which deliver precise answers to common inquiries from buyers.  \n  \nThe organization maintains a uniform presence on trustworthy websites through consistent brand mentions.   \n  \nWe monitor LLM visibility through two methods which include manual prompts and tools that track AI citations because rankings do not equal mentions.  \n  \nPeople make a major error by pursuing AI-specific marketing tactics which fail to produce practical content that delivers value through organized information. The AI system shows better results when it comprehends information through which it needs to evaluate the entire content of an article.",
          "score": 0,
          "created_utc": "2026-02-20 06:35:13",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1ra34sb",
      "title": "This is how sales actually happen, not the way most people think.",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1ra34sb/this_is_how_sales_actually_happen_not_the_way/",
      "author": "JunaidRaza648",
      "created_utc": "2026-02-20 18:21:53",
      "score": 17,
      "num_comments": 10,
      "upvote_ratio": 0.96,
      "text": "Just think about the buyer’s journey.\n\nThey had a problem and heard about your solution, probably on LinkedIn, Reddit, X, in a listicle, or through an email.\n\nWhat’s the next step?\n\nThey’ll want to learn more about you:\n\n1. Your online credibility\n\n2. Your brand story\n\n3. Your relevance\n\n4. Your reviews and case studies\n\nAll of this adds up to building trust in your product.\n\nThen one day, often through a search engine, they land on your website or landing page and reach out to you.\n\nThat’s how sales actually happen, not the way most people think.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1ra34sb/this_is_how_sales_actually_happen_not_the_way/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o6grwo5",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-20 18:21:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6gteh9",
          "author": "Pat_Coyle",
          "text": "Sure. That’s all „problem aware stage“ - but how convert „unaware“?",
          "score": 2,
          "created_utc": "2026-02-20 18:28:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6gttfi",
              "author": "JunaidRaza648",
              "text": "Educate them first, but after that, the journey is the same:\n\n1. Credibility\n\n2. Branding\n\n3. Persuasion\n\n4. Social proof",
              "score": 2,
              "created_utc": "2026-02-20 18:30:22",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o6i4k1k",
              "author": "Zealousideal-Job6344",
              "text": "Consistent messaging. At any given point, 80% people you reach out to will not be interested in buying your service right away. What art is to be a top of mind recall when they do. Hence awareness and consistency in messaging matters.",
              "score": 1,
              "created_utc": "2026-02-20 22:17:32",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6jkedo",
          "author": "Sophiaw9",
          "text": "Spot on. B2B sales are all about slow trust-building with content and credibility way before the demo. Great way to explain the hidden buyer journey. Thanks for this!",
          "score": 1,
          "created_utc": "2026-02-21 03:26:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ktd7n",
          "author": "Imaginary-Leg-2546",
          "text": "I'm guessing you're not very good at marketing.....?",
          "score": 1,
          "created_utc": "2026-02-21 09:51:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6uiw9u",
          "author": "ducksoupecommerce",
          "text": "That's fine but it's not a very reliable or predictable way to get new business. That's what I'm struggling with now - a proactive way to scale.",
          "score": 1,
          "created_utc": "2026-02-22 21:54:14",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r7whkl",
      "title": "B2B is harder than I thought.",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1r7whkl/b2b_is_harder_than_i_thought/",
      "author": "Key-Possibility-4494",
      "created_utc": "2026-02-18 07:24:16",
      "score": 16,
      "num_comments": 30,
      "upvote_ratio": 1.0,
      "text": "Basically, I’ve discovered that being good at B2B networking and socializing is crucial.\n\nI’ve found a few excellent tools that have been incredibly helpful. However, is there any way to bypass this requirement? ",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1r7whkl/b2b_is_harder_than_i_thought/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o60jifx",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-18 07:24:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o64impu",
          "author": "erickrealz",
          "text": "No. There's no shortcut around relationships in B2B. Tools help you find and reach people faster but they don't replace the trust that closes deals. The companies winning at B2B aren't the ones with the best tech stack, they're the ones where the founder picks up the phone and has real conversations.\n\nIf networking doesn't come naturally, start small. Join one industry community, comment thoughtfully, and build relationships with 5 people this month. B2B sales is just helping people solve problems through conversation. You don't need to be a damn extrovert, you just need to genuinely care about their business.",
          "score": 10,
          "created_utc": "2026-02-18 21:06:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o65kkon",
              "author": "Key-Possibility-4494",
              "text": "Thank you for the words of wisdom!",
              "score": 1,
              "created_utc": "2026-02-19 00:14:45",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o68q31b",
              "author": "Real_Round5353",
              "text": "This is a valuable comment, as it essentially describes how the world operates.",
              "score": 1,
              "created_utc": "2026-02-19 13:58:31",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o65amdp",
          "author": "Zealousideal-Job6344",
          "text": "Everything is hard! But as someone who has been b2b 2 decades, I love it. Is networking important, yes. But does that mean you need to be party animal.. no. The goal should be find your tribe. You will find people that speak your language. If you have the depth in your domain, that is generally enough to get you going. Don’t worry how you dress , how you speak , if drink or not. Just be yourself and b2b should take care of you. Ping me if you need help !",
          "score": 5,
          "created_utc": "2026-02-18 23:20:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o65kc1e",
              "author": "Key-Possibility-4494",
              "text": "Thank you for this! I will shoot you a DM and pick your brain more 👍🏻",
              "score": 2,
              "created_utc": "2026-02-19 00:13:26",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o6lezdw",
              "author": "TreeExtra525",
              "text": "As a fellow B2B founder I totally resonate with this. Would love to ping and connect we might be different industries but still sure we can align anyway on stuff :)",
              "score": 2,
              "created_utc": "2026-02-21 13:03:58",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6m722d",
                  "author": "Zealousideal-Job6344",
                  "text": "Sure would love to speak offline",
                  "score": 1,
                  "created_utc": "2026-02-21 15:48:32",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o64me3s",
          "author": "mariposa_marketing",
          "text": "Have you had any clients yet? If so, can they refer you? Also, I’d leverage speaking engagements and panel opportunities if you can.",
          "score": 3,
          "created_utc": "2026-02-18 21:23:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o65kvlq",
              "author": "Key-Possibility-4494",
              "text": "I have had a couple clients so far. I have done some speaking engagements, but not panel opportunities. This is interesting!",
              "score": 2,
              "created_utc": "2026-02-19 00:16:25",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o67f7kl",
          "author": "madhuforcontent",
          "text": "Build your personal brand so strong on the social media platforms",
          "score": 3,
          "created_utc": "2026-02-19 07:38:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o62fg6h",
          "author": "kubrador",
          "text": "you can't network your way out of not networking, my guy. that's like asking if there's a shortcut to the shortcut.",
          "score": 2,
          "created_utc": "2026-02-18 15:24:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o64h4nh",
              "author": "Key-Possibility-4494",
              "text": "I haven’t really looked at it that way. Shortcut to a shortcut does not end well 🙃. I will stick that in my pocket!",
              "score": 1,
              "created_utc": "2026-02-18 20:59:13",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o62hhze",
          "author": "Intrepid_Boss9449",
          "text": "Honestly, you can’t really skip the social part in B2B. But tools like SocListener help cut down the awkwardness by finding good posts and auto-making comments so you don’t have to start from zero every time. It’s not a full bypass but makes networking less painful.",
          "score": 2,
          "created_utc": "2026-02-18 15:34:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o64hgm2",
              "author": "Key-Possibility-4494",
              "text": "I have tried SocListener. It was good but felt very, robotic. I do not have a lot of experience with it, so it was probably user error vs the tool itself. I will try it again.",
              "score": 1,
              "created_utc": "2026-02-18 21:00:44",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o66gyhg",
          "author": "SignificanceBusy2136",
          "text": "B2B definitely leans heavily on networking, but it doesn’t have to be all handshakes and small talk. A lot of people make it easier by tightening their targeting first, so conversations start warmer and feel less forced. Clean firmographic data helps with that. Tools like Techsalerator can surface the right companies, roles, and direct contacts, which cuts down on random outreach and makes each interaction more intentional.\n\nFrom there, simple routines on LinkedIn go a long way. Commenting on posts, sending quick value‑first notes, and staying visible builds familiarity without needing to be a natural extrovert. When you’re reaching out to the right people and showing up consistently, the “networking” part feels a lot less daunting. Good targeting reduces how much social energy you need; consistency does the rest.",
          "score": 2,
          "created_utc": "2026-02-19 03:22:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o684x1j",
          "author": "GrouchyGovernment784",
          "text": "Totally fair. B2B *is* harder than it looks.\n\nLonger sales cycles, more decision-makers, higher trust needed and slower wins. It takes patience and strong relationships.\n\nBut once it clicks, the deals are bigger and more stable.",
          "score": 2,
          "created_utc": "2026-02-19 11:39:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o68a3ia",
          "author": "norfolk789",
          "text": "avoid free 'meetups' - most are a waste of time. If you can try join a paid entrepreneur community like EO. Pavillion and Exit5 are also pretty good for sales and marketing learning and connecting. ",
          "score": 2,
          "created_utc": "2026-02-19 12:18:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6d7jzp",
              "author": "Key-Possibility-4494",
              "text": "That makes sense. I think I am in the stage of wanting to learn and understand B2B at a deeper level. I am always drawn to rabbit trails and B2B seems to have infinite directions one can dive into. It seems as if the only limitations is one’s ability to get creative.",
              "score": 1,
              "created_utc": "2026-02-20 04:17:03",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o68kuev",
          "author": "beforeyoureyes",
          "text": "While I agree that networking is important in B2B marketing overall, the amount of how much you'll actually have to do in order to be successful varies significantly by the product/service/industry you're in. \n\nFor example, my previous marketing job was doing B2B at an Australian bank, and the networking/socialising component was surprisingly much less involved (Sales handled most of it) than in my job before that, when I worked with a hospitality SaaS company.  \n\nYou can't avoid/bypass networking in B2B (in fact, you should actually actively lean into it in a positive way; networking in some shape or form is a requirement of most marketing roles, either B2C or B2B, and it's healthy to get 'good' at it). However, just know that there are some B2B roles where it's not as large a part of the job as in others.",
          "score": 2,
          "created_utc": "2026-02-19 13:28:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6d75oe",
              "author": "Key-Possibility-4494",
              "text": "Interesting. So, depending on what type of B2B I am doing, this will affect the level of networking required. Not remove it, but potentially decide or increase it. Is this correct?",
              "score": 1,
              "created_utc": "2026-02-20 04:14:16",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6dknqj",
          "author": "KissyyyDoll",
          "text": "You can't really bypass the human element in B2B because trust is the primary currency for high-ticket deals. You can automate the lead gen and the initial outreach, but eventually, someone has to get on a call. Focus on building a repeatable process so the \"socializing\" part feels less like a chore and more like a checklist.\n\n",
          "score": 2,
          "created_utc": "2026-02-20 05:57:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6j1zgn",
          "author": "therealtricklowe",
          "text": "My business mantra is ‘friendship first, business always’.\n\nAnd I’ve NEVER found a product or service where this wasn’t true.\n\nIt’s not what you know, it’s who you know.\n\nThis is a fact that will never change.",
          "score": 2,
          "created_utc": "2026-02-21 01:28:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o60zfxm",
          "author": "lionstock555",
          "text": "No way bro. It’s the job itself",
          "score": 1,
          "created_utc": "2026-02-18 09:52:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o62qr3x",
              "author": "Key-Possibility-4494",
              "text": "Make sense! My introverted self was not ready for this awareness of the job 😆",
              "score": 2,
              "created_utc": "2026-02-18 16:16:30",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o62zo76",
                  "author": "lionstock555",
                  "text": "don't worry. Introverts can do very well in this field. It needs some methods...",
                  "score": 2,
                  "created_utc": "2026-02-18 16:56:47",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o610ccp",
          "author": "eloquent_t",
          "text": "What are the tools you are talking about?",
          "score": 1,
          "created_utc": "2026-02-18 10:00:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o64gl48",
              "author": "Key-Possibility-4494",
              "text": "I have been using Lusha. It has been good. I also use Campaign.ceo they have been good. They curate leads to my clients. Very simple, but very useful. B2B seams to get so complex sometimes. Keeping things simple helps me a ton.",
              "score": 2,
              "created_utc": "2026-02-18 20:56:44",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o68ta9k",
          "author": "ViceCityVixen",
          "text": "I felt the same starting out. In B2B, trust is the product, so networking isn’t optional, but you can make it easier. Pick a tight niche, show real case studies, and let warm intros do the heavy lifting. You don’t need to be a social butterfly, just consistently visible and useful.",
          "score": 1,
          "created_utc": "2026-02-19 14:16:13",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rbbfgu",
      "title": "How do I generate high quality leads for my development services",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1rbbfgu/how_do_i_generate_high_quality_leads_for_my/",
      "author": "FlakyTree1726",
      "created_utc": "2026-02-22 03:43:08",
      "score": 15,
      "num_comments": 33,
      "upvote_ratio": 1.0,
      "text": "I am a full stack developer and I am confident in my technical skills. I can build complete websites and web apps, but when it comes to generating high quality leads for my services, I struggle.\n\nI get small projects sometimes, but I want to attract serious business owners who are ready to invest in bigger projects. I feel like I am missing the right lead generation strategy and positioning.\n\nFrom a lead generation perspective, what would you suggest for someone like me\n\nHow can I consistently attract high ticket clients as a developer\n\nWould really appreciate practical advice from this community.",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1rbbfgu/how_do_i_generate_high_quality_leads_for_my/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o6pr5ma",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-22 03:43:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6pty3o",
          "author": "FRNk7600",
          "text": "You’re not struggling with lead gen \nYou’re struggling with positioning.\n\nHigh-ticket clients don’t look for “full-stack developers.” They look for outcomes.\n\nA few practical shifts that usually fix this:\n\n1. Stop selling dev. Start selling a business result\nInstead of:\n-“I build websites and web apps”\nSay:\n“I help B2B companies increase conversions / reduce ops cost / launch faster by building X.”\n\nSame skills. Completely different perceived value.\n\n2. Pick a narrow ICP (even temporarily)\nHigh-ticket clients come from relevance, not reach.\nExamples:\n-SaaS founders post-funding\n-Service businesses doing £50k–£500k/mo\n-Internal tools for ops-heavy businesses\n\nWhen someone reads your offer and thinks “this is for me”, price resistance drops.\n\n3. Productise your service\nCustom dev = low trust, lots of comparison.\nProductised = easier buying decision.\n\nExample:\n- “MVP in 30 days for SaaS founders\n- “Conversion-focused B2B website rebuild”\n- “Internal dashboard for ops teams”\n\nClear scope → clear price → better clients.\n\n4. Use proof without needing massive case studies\nIf you don’t have big logos yet:\n    - Break down how you’d solve a real business problem\n    - Share teardown-style posts (what’s broken, how you’d fix it, why it matters)\n    - Show thinking, not just code\n\nDecision-makers buy confidence and clarity.\n\n5. Go where buyers already are\nHigh-ticket dev clients usually come from:\n- Warm intros / partnerships (designers, marketers, agencies)\n - LinkedIn (commenting intelligently, not pitching)\n- Founder communities (not freelancing platforms)\n\nCold outreach works too — but only when your message speaks to a specific pain.\n\nIf you want, DM me:\n- who you ideally want to work with\n- what type of projects you want more of\n\nHappy to help you sharpen the positioning.",
          "score": 7,
          "created_utc": "2026-02-22 04:02:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6pxhle",
              "author": "PoolEqual4401",
              "text": "Could you help me as well",
              "score": 2,
              "created_utc": "2026-02-22 04:27:22",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6q8i59",
          "author": "Old-Environment8760",
          "text": "You should definitely position yourself as an agency. All the advice above about positioning is valid and highly important.\n\nIn terms of channels for dev agency clients, Meta ads and AI search optimization are generating leads.\n\nCold outreach and events are not performing well. Overall, your network and referrals should be your primary channel. You can also consider Upwork profile boost option as a solo dev, should work well in terms of conversations, some solid clients are also on Upwork. \n\nI am the owner of XQL Group, a B2B marketing agency that has worked with more than 60 software development agencies. Happy to connect with someone from our field. 💪",
          "score": 4,
          "created_utc": "2026-02-22 05:53:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6qrcz6",
              "author": "FlakyTree1726",
              "text": "Thank you for the advice 🙏",
              "score": 1,
              "created_utc": "2026-02-22 08:48:18",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6prp1y",
          "author": "kubrador",
          "text": "your problem is that you're selling to broke people. a business owner ready to drop $50k on dev work isn't scrolling reddit looking for freelancers, they're already working with an agency or getting referred by their accountant.\n\nstart going to actual business networking events, country clubs, chamber of commerce mixers. places where people with money hang out. or just ask your existing clients for referrals and actually follow up on them. referrals convert better than anything because someone already vouched for you.",
          "score": 2,
          "created_utc": "2026-02-22 03:46:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6psj79",
              "author": "FlakyTree1726",
              "text": "True, I agree with that.\nBut I am not looking for clients here. I am looking for advice on outreach strategies, methods, or platforms that can help me generate high quality leads online.\nI want to understand what actually works when targeting serious business owners who are ready to invest in development services.",
              "score": 1,
              "created_utc": "2026-02-22 03:52:43",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6ptvii",
                  "author": "B2BScaler",
                  "text": "What have you tried thus far?",
                  "score": 1,
                  "created_utc": "2026-02-22 04:02:02",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6qedqn",
          "author": "Scared_Yak5572",
          "text": "yep, its mostly about positioning and offers not chasing channels, if you want bigger clients stop selling full stack and sell a business result. pick one narrow icp, productise a fixed scope offer with a clear outcome and price, build two short case teardowns that show problem, solution, impact, then use linkedin and warm intros to reach decision makers. \n\nMy daily workflow is nail the niche and offer, \n\n\\- post teardowns twice a week,\n\n\\- comment on a few relevant posts\n\n\\- send one contextual connection note and follow up. \n\ni use depost ai to keep posting and follow ups consistent, i have templates i can share if you want, you can do this",
          "score": 2,
          "created_utc": "2026-02-22 06:45:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6qrfnm",
              "author": "FlakyTree1726",
              "text": "Thank you that helps a lot",
              "score": 1,
              "created_utc": "2026-02-22 08:49:00",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6qygew",
          "author": "Lonely_Noyaaa",
          "text": "The fastest path to high ticket clients as a developer is not lead generation at all, it is going back to every small project client you have ever had and asking if they know anyone who needs what you built for them, because a warm referral from a satisfied client converts at a rate no cold outreach strategy will ever match.",
          "score": 2,
          "created_utc": "2026-02-22 09:56:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6r1bcu",
              "author": "FlakyTree1726",
              "text": "Yes, I do have referral clients, but most of them are from my local city and within the same price range.\nMy goal now is to work with foreign clients outside India. I want to position my services in international markets where the project budgets are higher, instead of staying limited to my local network.",
              "score": 1,
              "created_utc": "2026-02-22 10:23:56",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6r1s7b",
          "author": "GrowthMotions",
          "text": "Generating high-quality leads as a full-stack dev is all about positioning yourself as a strategic partner for bigger projects, not just a coder.  firstly, Niche Down and Build Authority, Target and Outreach to High-Ticket Clients, Leverage Referrals and Ads.\n\nAt our agency, we've helped developers like you land 5-6 figure retainers with this playbook -DM if you want a free positioning audit. What's your niche?",
          "score": 2,
          "created_utc": "2026-02-22 10:28:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6r3s56",
          "author": "SuspiciousTruth1602",
          "text": "Its a problem a lot of devs face, being good at building but struggling with the biz side of things. When I launched my first app, I thought just building a good product would be enough I was wrong. I spent a lot of time trying different things but found cold outreach to be a waste of time ads got some downloads but those users werent as engaged as I wanted them to be. What eventually worked was hanging out on Reddit in the right communities and chiming in whenever someone had a problem my app could solve, or when they were talking about stuff related to it if there was an organic fit I'd pitch my app. It was super time consuming constantly scanning Reddit for the right conversations. Thats why I built a tool that does that for me, now it finds relevant convos across Reddit, Twitter and LinkedIn. It started as an internal thing but I figured other people would find it useful too. I think it could help you find those serious business owners youre looking for, the ones actively discussing their needs and pain points, if you want to try it out just let me know",
          "score": 2,
          "created_utc": "2026-02-22 10:47:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ro71a",
          "author": "OneHunt5428",
          "text": "Niche down. Instead of I build websites say I help specific business solve specific problem. Speak to their pain, not your tech stack. That's what attracts serious clients.",
          "score": 2,
          "created_utc": "2026-02-22 13:32:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6rtryo",
          "author": "Confident_Box_4545",
          "text": "Most full stack devs try to sell i build websites and apps. That’s not what serious business owners are shopping for.\n\nThey’re shopping for a specific problem getting fixed.\n\nIf you want bigger projects, narrow your focus. Not in tech stack. In outcome. For example, not “web apps for anyone” but “booking systems for local service businesses losing leads” or “internal dashboards for agencies drowning in spreadsheets.” When someone reads it, they should immediately think this is for me.\n\nSecond, stop hunting for clients in places where nobody is actively buying. Go where business owners are already complaining about something broken. Threads about slow sites, clunky processes, losing customers because of bad UX, messy operations. Break down what’s wrong and how you’d fix it. No pitch. Just clarity. The right ones will reach out.\n\nAlso, talk to your past clients. The bigger ones especially. Ask what nearly stopped them from hiring you and what convinced them. That language is gold. Most developers write like developers. Clients buy in business terms.\n\nHigh ticket usually comes from specificity and proof, not from being better at code.\n\n",
          "score": 1,
          "created_utc": "2026-02-22 14:05:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6tcuac",
          "author": "Wise-Trouble-653",
          "text": "The problem isn’t lead generation. It’s how you’re positioning what you sell.\n\n“Full stack developer” attracts people shopping for execution. Serious business owners don’t look for code. They look for outcomes: revenue, automation, speed to market, lower CAC.\n\nIf you market skills, you get small projects. If you market a specific business result for a specific type of company, the conversation changes.",
          "score": 1,
          "created_utc": "2026-02-22 18:26:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6tjl64",
          "author": "Nyodrax",
          "text": "First off, let me say congratulations; you’re ready for your first marketing strategy. Very exiting stuff.\n\nDo you have an email list? Any people you know working for orgs that could benefit from what you’re building?\n\nReach out to all of them. This is called outbounding. It’s 1/2 of Sales and can be really powerful with the right contact lists.\n\nThen there is inbounding (what you’re really talking about). In my mind, depending on the market, this will generally involve SEO (optimizing your site to appear in organic search and answer engines); paid media (paid search + meta / LinkedIn / ect); and email/lifecycyle (re: those email lists) \n\nIf you have the bandwidth, you can couple these efforts with (a) social media presence and forum posting (social marketing) and (b) conversion rate optimization (making your actual site / user journey more likely to convert users, but rooted in messaging / product marketing / UX)",
          "score": 1,
          "created_utc": "2026-02-22 18:57:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ux8gt",
          "author": "MarketingOB1",
          "text": "Maybe try positioning yourself as the anti-AI developer who you can count on. You use AI. You fix AI code. You’re above AI.",
          "score": 1,
          "created_utc": "2026-02-22 23:10:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6w2irn",
          "author": "Slight_Tutor1790",
          "text": "You might also want to think about your sales process, not just lead generation. A lot of developers focus on getting more leads, but high ticket clients usually decide based on clarity and confidence during conversations. If your discovery calls are structured around business goals, ROI, and clear next steps, you can turn average leads into better deals. Improving qualification and how you present proposals could raise the quality of clients you close without needing a huge increase in volume.",
          "score": 1,
          "created_utc": "2026-02-23 03:15:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6w8fjw",
          "author": "New_Grape7181",
          "text": "I was in a similar spot when I started out. The shift that actually helped was positioning myself less as \"developer for hire\" and more as someone who solves specific business problems for a niche.  \n  \nInstead of saying \"I build websites and web apps\", I targeted SaaS companies struggling with outdated dashboards and positioned around \"I rebuild analytics interfaces that your customers actually use\". Made it way easier to have pricing conversations because we're talking about their revenue impact, not my hourly rate.  \n  \nFor lead gen, I stopped cold outreach entirely and focused on being visible where my ideal clients already hang out. I'd find relevant posts in their communities, share a quick solution or code snippet, and occasionally someone would DM me. Also started a simple newsletter breaking down common technical problems in my niche. Took 4 months to get traction but the quality was miles better than Upwork.  \n  \nThe other thing is case studies. Even if your past projects were smaller, document the business outcome. \"Reduced checkout time by 40%\" sounds better than \"built a payment flow\".  \n  \nWhat type of businesses are you trying to attract right now?",
          "score": 1,
          "created_utc": "2026-02-23 03:54:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6wofl5",
          "author": "svlease0h1",
          "text": "you’re not stuck on skills, you’re stuck on positioning. bigger clients don’t hire “a full stack dev,” they hire someone who fixes a revenue problem. pick one niche and one pain, then build a tight offer around that. send 15 to 20 short loom audits a week showing one clear missed opportunity. post teardown content so people see how you think. one dev i know niched into saas onboarding and closed a 10k project in a month just from audit videos. smaller pool, better deals.",
          "score": 1,
          "created_utc": "2026-02-23 05:53:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6wrfp0",
          "author": "Round_Bullfrog_4563",
          "text": "What's your niche? I had 190k real estate, 50k saas companies, 100k agencies and other plenty of niche of various industries. I'm also thinking of what to sell them.",
          "score": 1,
          "created_utc": "2026-02-23 06:18:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6x4312",
              "author": "FlakyTree1726",
              "text": "Right now I am considering focusing on one niche, maybe real estate or SaaS founders.\nBoth seem to have better budgets compared to local service businesses. I am still evaluating which one would be easier to penetrate as a developer targeting foreign clients.",
              "score": 1,
              "created_utc": "2026-02-23 08:14:45",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6xe32r",
          "author": "KissyyyDoll",
          "text": "Start by niching down. Instead of “full stack developer,” position yourself as the expert for a specific type of cliente.g., SaaS startups, e-commerce platforms, or agencies needing custom dashboards. When you speak to a precise audience, you can tailor messaging and show case studies that resonate, which attracts higher-ticket leads.",
          "score": 1,
          "created_utc": "2026-02-23 09:53:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6y7a2a",
          "author": "OkDependent6809",
          "text": "positioning is probably your real problem before tactics even matter. \"full stack dev who builds websites\" is hard to sell at high ticket. \"developer who solves x for y type of business\" is much easier.\n\nonce you figure that out, actually talk to the kind of clients you want before pitching them. understand what they care about, what's made them hesitant to hire devs before, what outcomes matter to them. most devs skip this and wonder why nobody bites.\n\nlinkedin direct outreach works once you know exactly who you're targeting.",
          "score": 1,
          "created_utc": "2026-02-23 13:42:38",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r9uiwk",
      "title": "How do you actually measure b2b lead quality before they hit the sales team?",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1r9uiwk/how_do_you_actually_measure_b2b_lead_quality/",
      "author": "Xev007",
      "created_utc": "2026-02-20 12:51:19",
      "score": 12,
      "num_comments": 30,
      "upvote_ratio": 0.94,
      "text": "The same argument keeps happening internally where marketing says the leads are fine and sales says they're garbage and nobody has a good framework for resolving it. MQL counts look healthy but conversion to opportunity is terrible which could mean the leads are bad or could mean sales isn't working them properly. Building some kind of scoring or qualification layer before handoff would help but everything so far just adds friction without actually improving outcomes. What are other people doing to bridge this gap?  \n",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1r9uiwk/how_do_you_actually_measure_b2b_lead_quality/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o6ewm91",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-20 12:51:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6f66g0",
          "author": "StayAtHomeAstronaut",
          "text": "The leads are weak.\n\nThe leads are weak...? The fucking leads are weak!?\"\n\nNo. You're weak! \n\nIf you cannot close the leads to which you are given, then you can't close shit, YOU ARE SHIT, hit the bricks pal!",
          "score": 11,
          "created_utc": "2026-02-20 13:46:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6eyc30",
          "author": "Dry-Case3175",
          "text": "So at my company we figured this out by reframing the idea about the leads being good to what actual evidence do we have that X person and Y account are in-market right now, and did we follow up correctly:\n\n1. Define lead quality as a small set of measurable pre-sales signals: account fit grade, role relevance, and intent signals tied to specific interests (pricing, integration, implementation, security, product pages). Add a recency layer so a lead that surged this week is treated differently than one that engaged once a month ago.\n2. Make handoff rules explicit: what qualifies for a sales touch, what the response time SLA is, and what dispositions sales must log (bad fit, no need, wrong person, timing). Audit a weekly sample together.\n3. Surface why a lead is prioritized, not just a score.\n\nIf you want tooling, 6Sense, SalesWings, and DemandBase are all worth looking into.",
          "score": 2,
          "created_utc": "2026-02-20 13:02:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6hkhry",
              "author": "liaxampee",
              "text": "yeah this framing is the only one thats ever stopped the sales vs marketing food fight for me. what are you using to track those intent hits, 6sense or just ga4 + hubspot events?",
              "score": 1,
              "created_utc": "2026-02-20 20:37:13",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6hthmi",
          "author": "Hopeful_Account_1370",
          "text": "I've run RevOps at a mid-stage SaaS firm. We had the same finger-pointing war until we killed vanity MQLs. Switched to a pre-handoff layer: combined firmographic + behavioral scoring (e.g., multiple page views, intent data via Bombora-style tools, demo-like actions weighted heavy).\n\nAdded a quick SDR \"pre-qual\" call (5-min BANT/CHAMP check) before full handoff. Result? MQL volume dropped 40%, but MQL-to-opp jumped from \\~9% to 28% in six months. Pipeline velocity doubled, sales stopped hating marketing, and we closed more with fewer dials.\n\nStop the blame game. Align on a real scoring model (not just demographics), measure pre-sales quality via conversion rates + feedback loops, and prioritize intent over volume.",
          "score": 2,
          "created_utc": "2026-02-20 21:21:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6fa9xw",
          "author": "Everyd4yAudioGuy",
          "text": "This is super common. The fix is usually agreeing on one shared definition of a good lead, then measuring it with pipeline outcomes, not MQL volume.\n\nThe cleanest framework I’ve seen is tracking lead quality based on what happens after handoff. Things like % that become sales accepted leads, % that become opportunities, and win rate by source. If a channel produces a lot of MQLs but almost no opps, it’s not a lead gen win.\n\nScoring only works if it’s tied to real intent signals. Pricing page visits, demo page views, repeat visits from the same company, ROI tool usage, and job title fit tend to correlate better than downloads.\n\nAlso, add a simple feedback loop. Sales should tag leads with reasons like no budget, wrong persona, not a priority, competitor locked in. After a few weeks, you’ll see patterns and marketing can adjust targeting instead of guessing.\n\nIt’s less about adding friction and more about closing the loop with actual pipeline data. We talk about lead scoring and readiness frameworks on r/LeadGenSEA too if you want more examples",
          "score": 1,
          "created_utc": "2026-02-20 14:08:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6ftv1l",
              "author": "Dapper-Condition6041",
              "text": "\\>>Things like % that become sales accepted leads, % that become opportunities, and win rate by source.\n\nThis is a needless step. There's no need for a \"sales accepted lead.\" \n\nThe definition of an MQL is jointly defined by Sales and Marketing - if it meets the criteria, it is, a priori, a sales accepted lead.\n\nAll that's needed is a simple diqual / reject feedback mechanism from Sales to Marketing for leads that turn out to be not-qualified, to tune the model.",
              "score": 1,
              "created_utc": "2026-02-20 15:46:02",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6fdikl",
          "author": "osiris_rai",
          "text": "Added a verification and enrichment step before anything gets marked as an MQL, basically checking that contact info is valid and company actually fits ICP.",
          "score": 1,
          "created_utc": "2026-02-20 14:25:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6fdogd",
          "author": "Live_Cheetah_3800",
          "text": "Part of the problem might be counting leads that aren't even reachable as qualified, verifying emails through anymail finder before they hit the CRM and filtering out invalid ones helped a lot with the perception problem because sales isn't wasting time on contacts that were never going to connect anyway.",
          "score": 1,
          "created_utc": "2026-02-20 14:26:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6fiu6p",
          "author": "ProfessionIll5518",
          "text": "The framework that works is basically fit plus engagement plus reachability, if any of those three is missing it doesn't pass to sales. Sounds simple but took forever to get alignment on what each one actually means in practice ngl",
          "score": 1,
          "created_utc": "2026-02-20 14:52:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6fqa1c",
          "author": "kubrador",
          "text": "before you build another scoring model nobody will use, find out what your sales team actually closes. backtrack from won deals, what did those leads look like day one? industry, company size, problem they mentioned, how they found you, whatever. that's your real qualification criteria, not what seemed logical in a spreadsheet.\n\nthen you can actually compare: are incoming leads matching that profile or are they systematically different? if they are, marketing's genuinely handing off worse stuff. if they're the same quality, sales might just be bad at working them (or the product doesn't close those kinds of deals, which is a different problem).\n\nthe friction thing is real though. most qualification layers fail because they're too rigid and marketing finds ways around them. if you go",
          "score": 1,
          "created_utc": "2026-02-20 15:29:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6fseve",
          "author": "_forgotmyownname",
          "text": "You need to map fit against intent. Use a data enrichment tool to verify the job title and company size before it even reaches a rep. If it doesn't match your ICP, it's not a lead.\n\n",
          "score": 1,
          "created_utc": "2026-02-20 15:39:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6fsjic",
          "author": "Dapper-Condition6041",
          "text": "Perhaps Lead Scoring and MQLs etc. are b.s. as someone else in this forum suggested, but lead scoring - by fit to ICP (Fit Score) and behavior (Lead Score) are the time-honored practices for measuring lead quality before passing to sales.\n\nPutting aside criticisms, the entire premise was assigning a numerical value to each lead, and setting a threshold in a Sales/Marketing SLA below which Marketing would NOT pass to Sales and above which Marketing WOULD pass to sales. \n\nThat numerical threshold is the MQL - marketing qualified it according to previously agreed standards specifications with Sales as documented in the SLA.\n\nThere needs to be an ongoing feedback loop from Sales to Marketing to provide adjustments to the scoring model to fine tune it.\n\nIt's imperfect, but workable. It sounds like you have a poorly implemented version of this model.",
          "score": 1,
          "created_utc": "2026-02-20 15:39:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6g01hs",
          "author": "Gratefulanddriven",
          "text": "This is about misalignment. Marketing needs to work with sales to agree on ICP, and lead definitions. This needs to be approved by senior management. What are the shared definition of an MQL and SQL. Then marketing is working toward goals that sales have given them. If they’re not working then you all sit down again and iterate. Of closed/won, what aligns with your shared definitions? You should also have some shared KPIs otherwise you’re just fighting with each other. Sales can iterate faster but it takes a while for a marketing demand engine to get going so these need to be established. I’ve worked in marketing and sales.  It’s a failure of both the head of marketing and head of sales to align.",
          "score": 1,
          "created_utc": "2026-02-20 16:14:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6haas7",
          "author": "Hopeful_Account_1370",
          "text": "Look, I've been in the trenches running RevOps for a mid-stage B2B SaaS company (we scaled from $8M to $35M ARR in 3 years), and this exact fight marketing bragging about \"healthy MQL counts\" while sales drowns in garbage happens everywhere. The brutal truth? Your low MQL-to-opportunity conversion screams **bad leads**, not lazy sales (though sales execution can suck too).\n\nThe fix that actually worked for us (and I've replicated the same at 3 other shops):\n\n1. Kill pure MQL handoff. Co-build a **pre-handoff qualification layer** with sales: Use fit (ICP firmographics) + behavioral scoring (e.g., pricing page views, demo requests, multiple touches) + light BANT/MEDDIC via forms or intent data. Threshold: Only hand off at 70+ score or clear intent signal.\n2. Closed-loop feedback: Sales rates every lead 1-5 on quality weekly; marketing sees the data live in CRM. We cut junk by 60% in 4 months, MQL volume dropped 40%, but SQL-to-opp jumped 2.5x.\n3. Measure real lead quality pre-sales: Track **pre-handoff conversion to meeting booked** or **early-stage progression velocity**. Volume KPIs die; revenue attribution lives.\n\nYour post is classic symptom of misaligned incentives marketing chases leads, sales chases pipeline. Stop patting backs on MQLs; they're meaningless without conversion data.\n\nIf conversions suck, leads are bad. Fix the scoring model together, or keep fighting. We did it, pipeline quality soared, and the blame game ended.",
          "score": 1,
          "created_utc": "2026-02-20 19:47:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6hv8jl",
          "author": "Scared_Yak5572",
          "text": "stop blaming each other, pick a gate and test it, mql counts alone mean nothing. define a short joint acceptance checklist, eg fit signal, intent signal, contactability, require 2 of 3 before handoff. enforce a 48h sla for first outreach and force a rejection reason to be logged, track conversion by source, campaign and owner. run a two week blind audit on a sample of passed leads to see if sales is actually working them, if fail rate stays high tighten scoring or add a 1 call sdr triage. i have used this and it shows fast where the leak actually is.",
          "score": 1,
          "created_utc": "2026-02-20 21:30:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ihkb0",
          "author": "harisenbon",
          "text": "The argument never gets resolved because marketing measures quantity at the top and sales measures quality at the bottom, and nobody owns the middle.\n\nPick one metric both teams agree on (usually \"opportunities created\" or \"pipeline generated\") and measure marketing's contribution to that number, not to MQLs. MQL counts are a vanity metric that lets marketing declare victory before anything actually happened. If 200 MQLs produce 3 opportunities, it doesn't matter that the MQL number looks healthy.",
          "score": 1,
          "created_utc": "2026-02-20 23:28:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6lmywt",
          "author": "murtuza78",
          "text": "The real trick is aligning on what a \"good\" lead actually means for both teams and then tracking what happens to those leads after handoff rather than just pre-handoff signals. Tie quality to sales accepted, opportunities created and actual outcomes instead of MQL volume. Add a feedback loop where sales logs why leads get dropped or progressed so both sides see the reality. This setup beats any scoring system that just adds more hoops for leads to jump through.",
          "score": 1,
          "created_utc": "2026-02-21 13:56:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6w000x",
          "author": "New_Grape7181",
          "text": "I used to have this exact fight with our sales team monthly. The breakthrough for us was creating a shared definition of what \"qualified\" actually meant before anything got scored or passed over.  \n  \nWe sat both teams in a room and went through the last 50 deals that closed, then the last 50 that went nowhere. Looked for patterns in firmographics, behaviour, timing, all of it. Turned out our ICP was way off and we were sending over loads of leads that matched our \"ideal\" criteria but had zero budget authority or actual need.  \n  \nThe scoring came after, not before. We built it around those actual closed-won patterns rather than theoretical fit. Then added a simple manual step where marketing does a 2 minute LinkedIn check before handoff, just to verify the person's still in role and the company hasn't been acquired or whatever.  \n  \nConversion to opp went from about 8% to 19% in two months. Sales still complains sometimes but now we have the shared framework to point back to.  \n  \nThe other thing that helped was having sales commit to a specific follow-up cadence. If they're not working leads properly, that data needs to surface too.  \n  \nWhat does your current handoff process look like between the teams?",
          "score": 1,
          "created_utc": "2026-02-23 02:59:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6w2oz6",
          "author": "Slight_Tutor1790",
          "text": "Another angle to consider is positioning. If you present yourself as someone who solves a specific business problem instead of just offering a service, the conversation changes completely. Clients at the higher end usually look for expertise and direction, not just execution. Sharpening your niche and messaging could naturally attract better fit opportunities without chasing every inquiry.",
          "score": 1,
          "created_utc": "2026-02-23 03:16:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6f03m9",
          "author": "LeadGenDotCom",
          "text": "Measuring lead quality misses the point. It's like putting lipstick on a pig. The problem is the underlying process, and the lack of accountability (usually by Marketing.) MQL, for example, was a concept invented by the CRM firms and some consultants because they wanted marketing programs to get credit for producing junk. The same with Lead Scoring; it's nonsense. The best solution we know of is Funnel Management. Marketing has to be measured on the accuracy of the Sales Forecast. We have an entire training course on it, but the short answer is that you can only measure lead quality in retrospect. ",
          "score": 1,
          "created_utc": "2026-02-20 13:12:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6f0dht",
              "author": "Radiant-Security-347",
              "text": "but he said nobody has solved this vexing problem",
              "score": 2,
              "created_utc": "2026-02-20 13:14:16",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6f0zqh",
                  "author": "LeadGenDotCom",
                  "text": "He is wrong. It was solved 50 years ago. You just have to use the technique, and stop listening to the noise. I'll give you an example. We do lead generation (among other things) for our clients. And we participate in their sales meetings, with their sales teams. That means we have to listen to them yell at us if we send them out on time-wasters. We have to participate in the creation of the sales forecast. If we (collectively) exceed it, we get to join the celebration. If we miss it (which we usually don't) we get spanked. And as a third party, that spanking can hurt.",
                  "score": 2,
                  "created_utc": "2026-02-20 13:17:56",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o6fshy3",
              "author": "_forgotmyownname",
              "text": "Totally agree with you! ",
              "score": 1,
              "created_utc": "2026-02-20 15:39:35",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o6glrvq",
              "author": "Dapper-Condition6041",
              "text": "I found your website..... but I can't yet find a page that articulates the model you proscribe that makes Lead Scoring and MQL/SQL useless.... could you pls DM me with a URL? thx.",
              "score": 1,
              "created_utc": "2026-02-20 17:54:24",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r6s1qw",
      "title": "Planning on refreshing our 5 year old Wordpress site looking for redesign advice",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1r6s1qw/planning_on_refreshing_our_5_year_old_wordpress/",
      "author": "purpleplatypus44",
      "created_utc": "2026-02-17 01:11:09",
      "score": 12,
      "num_comments": 17,
      "upvote_ratio": 1.0,
      "text": "We built our WordPress site about five years ago and it’s starting to show. The design feels really dated, mobile UX is clunky, and the messaging doesn’t match where our business is now.\n\nWe’re planning a website redesign with a budget under $10k. Not DIY, but not a big agency either. I’m debating whether to stick with WordPress or move to a simpler website builder for easier long-term management.\n\nIf you’ve gone through a redesign recently and had a good experience, I’d love recommendations or lessons learned.",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1r6s1qw/planning_on_refreshing_our_5_year_old_wordpress/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o5scqm7",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-17 01:11:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5sd70z",
          "author": "philbrailey",
          "text": "Yo, with kinda budget under $10k you’re in a decent spot, but I’d first get clear on what this really is. Is it just a visual refresh, or does the structure and messaging need a full rethink? A lot of the time clunky mobile UX and weak copy can be fixed without blowing everything up. But if WordPress feels bloated with plugins and constant maintenance, that’s usually the sign it’s the stack, not just the design.\n\nSome teams stay on WordPress and clean it up with a lighter theme and fewer plugins. Others use the redesign as a reset and move to a more opinionated builder so updates are easier long term. I’ve seen people switch to simpler setups like Durable for that reason, especially when the goal is clean pages, smoother lead flow, and less backend babysitting.",
          "score": 6,
          "created_utc": "2026-02-17 01:13:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5sdeze",
          "author": "ronniealoha",
          "text": "Honestly, before you even touch design, I’d zoom out and ask what’s actually broken. Is it just ugly, or is it not converting? Big diff. I’ve seen companies spend $$$ on a redesign and nothing changes because the messaging was the real issue. Tighten the copy, clarify the offer, simplify the nav. Sometimes that alone feels like a new site without nuking everything.",
          "score": 4,
          "created_utc": "2026-02-17 01:15:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5sdpei",
          "author": "EldarLenk",
          "text": "Sub $10k is solid, but be careful with “cheap but looks good” agencies. Ask to see real live sites they built 2+ years ago. Not Dribbble shots. Real URLs. Do they still load fast? Do they feel modern? If they can’t show long term work, that’s a red flag. A good website redesign is about structure and UX, not just swapping fonts.",
          "score": 3,
          "created_utc": "2026-02-17 01:16:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5sqa8d",
          "author": "f1zombie",
          "text": "Great advice here. I would also consider prototyping structure, content and maybe design with AI to get a better view on what you want. We've started doing this for all our engagements and it makes it very easy to understand what works and doesn't work. It also helps that you can use actual content and data to design.",
          "score": 2,
          "created_utc": "2026-02-17 02:32:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5sdyhb",
          "author": "pumpkinpie4224",
          "text": "If WordPress hasn’t been a nightmare for you, you might not need to leave it. A lighter theme, fewer plugins, and a cleaner layout can go a long way. But if you’re constantly fighting updates, security, and random plugin drama, that’s energy you could spend elsewhere. Some teams switch to more opinionated builders just to reduce maintenance stress and move faster",
          "score": 1,
          "created_utc": "2026-02-17 01:18:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5se38g",
          "author": "Diamond_handzz_420",
          "text": "with the ai coding tools out now.. vibe code the new website",
          "score": 1,
          "created_utc": "2026-02-17 01:19:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5sjzuh",
          "author": "No-Belt7254",
          "text": "Depends a lot on the type of product, but a good sight is built on knowing exactly why customers and prospects come to your site.",
          "score": 1,
          "created_utc": "2026-02-17 01:54:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5tmf4j",
          "author": "algatesda",
          "text": "Yes 5 years old Wordpress needs really upgrade .Always keep updating your website every 2 years to have updated UI and UX to attract your right audience .$10K is pretty much decent to revamp your website in latest web technologies \n\nIf you are into B2B then website is your first touch point in your buyers journey .\nJava or Bootstrap gives you premium and liquid flow of pages for better experience",
          "score": 1,
          "created_utc": "2026-02-17 06:15:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5u7gzh",
          "author": "SatisfactionBig7126",
          "text": "Since you want to avoid big agencies but stay under $10k, check out StudioT. They are solid for performance driven design and UX audits which would fix that mobile clunkiness. They can also help you decide if you should stick with WordPress or jump to a new builder while keeping the messaging on point.",
          "score": 1,
          "created_utc": "2026-02-17 09:30:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ut4ra",
          "author": "RandyCanuck",
          "text": "I would change the messaging including images. first and measure the conversions.  That will guide you in the direction u need to go",
          "score": 1,
          "created_utc": "2026-02-17 12:33:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5y0twr",
          "author": "just_a_freak_teen",
          "text": "Web developer, and I’ve worked with many clients who asked for the exact same thing. However, after delivering the redesign, they often complain that it didn’t bring them more business. Since you’re planning a redesign, it’s important to keep in mind that design alone usually won’t create a huge impact on lead generation. You also need to tighten the copy, improve the page structure, and add strong CTAs that direct users to forms that aren’t too long.",
          "score": 1,
          "created_utc": "2026-02-17 22:09:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ze92g",
          "author": "Rounak147",
          "text": "Hey.. what line of business are you in? Do you sell online (eCommerce) or are you a service business looking for lead gen?\n\nLike what exactly is the purpose of the website?\n\nIs it to generate leads, or sales, or is it just a vanity piece? You need to define that clearly. If it's just a vanity item, focus more on the design and transitions and creative styling than anything else. However, rarely do businesses ever want a website just for aesthetics. \n\nAlso, do you run paid ads? Because if yes, you're going to need to think about conversion much more than anything else. \n\nSo my guess is that it is a little bit of both for you - lead gen/sales + aesthetic. In this case, before jumping into aesthetics, just visualize your ideal client's funnel. How do they find you, what do they wnat to know about you once they find you, and what are the key decision making factors that enable purchase or conversion? Once you know all of this - then build out the website. \n\nI run a performance marketing agency and our proecss for this is similar. We send out a questionnaire that gets this info out of you, then we jump to wire framing - which helps you visualize your funnel, then we jump to the actual branding and designing of the website.  Happy to answer any follow-up questions. \n\n  \nAs for the platform, it really doesn't matter THAT much. If you want you can stick to wordpress and just built a better looking and converting website. \n\nAlso, FYI, for a 10K budget, we could build you a great website that's both aesthetic and high-converting. Canadian mid-size agency. Feel free to DM.",
          "score": 1,
          "created_utc": "2026-02-18 02:33:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6djkm2",
          "author": "KissyyyDoll",
          "text": "Stick with WordPress since you already know the backend. Move to a lightweight theme or a modern builder like Bricks or Breakdance to fix the speed issues. Five years is a long time in tech so a clean install is probably better than patching the old one. Under 10k is doable for a solid freelancer.",
          "score": 1,
          "created_utc": "2026-02-20 05:48:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6fe6ey",
          "author": "Top-Buy-4207",
          "text": "u/purpleplatypus44 sent dm, please check!",
          "score": 1,
          "created_utc": "2026-02-20 14:29:01",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r9s7uj",
      "title": "this is how I get B2B client in my agency",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1r9s7uj/this_is_how_i_get_b2b_client_in_my_agency/",
      "author": "LeadershipRare1908",
      "created_utc": "2026-02-20 10:50:13",
      "score": 9,
      "num_comments": 28,
      "upvote_ratio": 1.0,
      "text": "For the context, I run a Linkedin cold outreach agency (around $25k/mo)\n\nOur acquisition is Linkedin content + Outreach + Word of mouth.\n\nBut if I go deeper on this, here's what works so well.\n\n**1/ I create lead magnet (either Notion doc or private YT video)**  \n\\-> disclaimer : needs to be really helpful for your ICP, not just a Claude PDF done in 2min.\n\n**2/ I publish a post on Linkedin to promote it, and ask for a comment to receive the doc**  \nKey points for a viral post are :  \n\\- strong hook with numbers  \n\\- Attractive visual (GIF, Document blurred, ..)  \n\\- answer every comment in the first hour after the post for an algo boost\n\n**3/ I scrap commenters and send automatic DM**\n\n**4/ few days after, I ask people (only that are in my ICP)** :  \n\"curious to know why you asked for the ressource, are you interested in {{topic}} at the moment ?\"\n\nNote : don't ask 'have you seen my doc?'. 90% won't check it. And it doesn't matter.\n\nWhat matters is the signal they send you, they're interested in the topic right now. They often need help and are looking for agencies.\n\nHope it helps and give you insights.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1r9s7uj/this_is_how_i_get_b2b_client_in_my_agency/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o6eghl1",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-20 10:50:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ejw4f",
          "author": "Silly_Newt4788",
          "text": "If you had to how would you do this if your were in gaming industry? Would your workflow still remain the same?",
          "score": 2,
          "created_utc": "2026-02-20 11:19:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6ep7ru",
              "author": "Relevant_Fee1017",
              "text": "yeah same skeleton works in gaming, you jsut change the magnet: eg a UA creative teardown Notion or a private vid on Steam page conversion. are you targeting indie devs or publishers?",
              "score": 1,
              "created_utc": "2026-02-20 12:00:35",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6f39br",
                  "author": "Silly_Newt4788",
                  "text": "Targeting gaming studios that are looking for QA, Art an Dev services.",
                  "score": 1,
                  "created_utc": "2026-02-20 13:30:55",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o6x9yxv",
              "author": "LeadershipRare1908",
              "text": "Works for every industry if your ICP is on Linkedin",
              "score": 1,
              "created_utc": "2026-02-23 09:13:05",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6eqfh0",
          "author": "eviom_B2BMarketing",
          "text": "Danke für deinen Beitrag! Lass uns gern über Agentur Lead Akquise austauschen",
          "score": 2,
          "created_utc": "2026-02-20 12:09:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ey85u",
          "author": "SnooPeppers1256",
          "text": "How would you do this for an instagram marketing agency?",
          "score": 2,
          "created_utc": "2026-02-20 13:01:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6xa139",
              "author": "LeadershipRare1908",
              "text": "I never did this on Instagram so I don't know if it works, but I know it works pretty well on X",
              "score": 1,
              "created_utc": "2026-02-23 09:13:39",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6g66cq",
          "author": "Individual-War3274",
          "text": "Does your outreach have typos?",
          "score": 2,
          "created_utc": "2026-02-20 16:42:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6xa2ey",
              "author": "LeadershipRare1908",
              "text": "Never, why ? ",
              "score": 1,
              "created_utc": "2026-02-23 09:14:01",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6yfozy",
                  "author": "Individual-War3274",
                  "text": "**4/ few days after, I ask people (only that are in my ICP)** :  \n\"curious to know why you asked for the ressource, are you interested in {{topic}} at the moment ?\"\n\n",
                  "score": 1,
                  "created_utc": "2026-02-23 14:29:43",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o6yg13h",
                  "author": "Individual-War3274",
                  "text": "I once had a cold email specialist tell me that it was ok to have typos in email outreach because it made the email feel more \"authentic.\" My feeling is that if you have typos in your initial email to me, you're telling me that attention to detail is negotiable. Thoughts?",
                  "score": 1,
                  "created_utc": "2026-02-23 14:31:31",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6iceqq",
          "author": "Immediate_Bear_6132",
          "text": "I did the same for my agency. I write an insane lead magnet on Twitter and DM all commenters. I think it's the smartest technique",
          "score": 2,
          "created_utc": "2026-02-20 22:59:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6xa33f",
              "author": "LeadershipRare1908",
              "text": "currently it's a cheatcode hehe",
              "score": 1,
              "created_utc": "2026-02-23 09:14:13",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6kefoc",
          "author": "Exciting-Sir-1515",
          "text": "What’s the tool you use to reply to messages?",
          "score": 2,
          "created_utc": "2026-02-21 07:24:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6xa44u",
              "author": "LeadershipRare1908",
              "text": "I answer manually in the first hour",
              "score": 1,
              "created_utc": "2026-02-23 09:14:31",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6ln02g",
          "author": "murtuza78",
          "text": "This is honestly solid and nails the intent-first part of outreach most folks skip. The doc is just bait but the real value is in the signal from commenters. The follow-up is where deals actually start so dialing in that message makes all the difference. Love that you’re not stressing whether they viewed it because true leads just surface through the convo anyway.",
          "score": 2,
          "created_utc": "2026-02-21 13:56:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6vzrbt",
          "author": "New_Grape7181",
          "text": "I like this approach, especially point 4 about not asking if they read the doc. That's clever because you're right, most people won't touch it but they've still raised their hand.  \n  \nI've found adding a quick personalised video at step 4 instead of just text can bump response rates quite a bit. Something like a 30-second Loom referencing their specific company situation rather than a generic \"did you find this useful\" message. Takes maybe 2 minutes per person but feels much more consultative.  \n  \nThe key is keeping it short and making it about them, not pitching anything yet.  \n  \nWhen you send that follow-up DM at step 4, are you finding certain times of day or days of the week perform better, or does it not really matter?",
          "score": 2,
          "created_utc": "2026-02-23 02:57:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6xac0u",
              "author": "LeadershipRare1908",
              "text": "thanks for the insight about the Loom video, I'll try this for the top tier ICP who asks for the ressource.   \nI avoid sundays because people often see the message and are like \"I'll answer that on monday when I go back at work\" but they forget. ",
              "score": 1,
              "created_utc": "2026-02-23 09:16:43",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6w34vd",
          "author": "Slight_Tutor1790",
          "text": "At this stage I would spend less time trying to scale channels and more time engineering distribution into the product itself. If there is any natural output your users generate, reports, dashboards, shareable links, templates, make those branded and easy to share with colleagues. Early on, a single user who brings in two others inside the same company is more valuable than 100 anonymous blog readers. Zero budget growth usually comes from tight loops inside small networks, not wide top of funnel reach.",
          "score": 2,
          "created_utc": "2026-02-23 03:19:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6f17hj",
          "author": "Radiant-Security-347",
          "text": "Tonto, is that you?",
          "score": 1,
          "created_utc": "2026-02-20 13:19:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6xa1oh",
              "author": "LeadershipRare1908",
              "text": "nope",
              "score": 1,
              "created_utc": "2026-02-23 09:13:49",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6xemiw",
          "author": "KissyyyDoll",
          "text": "I’d add that pairing the lead magnet with a quick follow-up video explaining one key point can boost engagement. It makes you more memorable and warms up prospects before the DM.\n\n",
          "score": 1,
          "created_utc": "2026-02-23 09:59:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6gj2fw",
          "author": "EntranceBest",
          "text": "Solid breakdown. The insight about not asking \"did you see my doc\" is underrated. The signal matters more than the consumption.\n\nRunning a similar value-first approach but on Reddit instead of LinkedIn right now. Answering real questions from business owners in eCommerce and B2B subreddits with no pitch, just genuinely useful replies. The inbound is slower to start but the intent is high when it comes in because they've already read your thinking before they reach out.\n\nDifferent channels, same principle: give before you ask, and let the signal tell you who's ready.",
          "score": 1,
          "created_utc": "2026-02-20 17:42:04",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1radei1",
      "title": "Needing a B2B SEO/GEO agency",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1radei1/needing_a_b2b_seogeo_agency/",
      "author": "piefordays",
      "created_utc": "2026-02-21 01:05:18",
      "score": 8,
      "num_comments": 15,
      "upvote_ratio": 0.91,
      "text": "I've been running in circles as of late trying to find an SEO agency. The two big needs are:\n\n* consistent B2B content development\n* SEO + GEO support (strategy and execution)\n\nWe’re a tech company so bonus points for agencies that “get” B2B tech and have worked with a range of company sizes and verticals.\n\nI think at the moment I'm overwhelmed by options lol. So coming to ask for some opinions...Have you had any good experiences with specific agencies in the B2B/tech field? Would love those recommendations. Thanks.",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1radei1/needing_a_b2b_seogeo_agency/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o6iy6u8",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-21 01:05:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6lqpj4",
          "author": "astillero",
          "text": "Not a mention of sales outreach in the OP's post. \n\nYou need to remember that for most B2B products (SaaS) included - PPC, inbound marketing and sales are three legs of the same 3-legged stool. \n\n",
          "score": 2,
          "created_utc": "2026-02-21 14:19:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6t1zhf",
              "author": "kra73ace",
              "text": "He's probably in the exploration phase... \n\nEveryone starts looking at SEO first but soon forgets about long-term and starts going aggressively after quarterly targets. And that requires campaigns that deliver from the moment you turn them on.",
              "score": 2,
              "created_utc": "2026-02-22 17:37:13",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6k9gfu",
          "author": "ClevrSolutions",
          "text": "What exactly do you sell? A service, software, or physical product?",
          "score": 1,
          "created_utc": "2026-02-21 06:38:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6layrj",
          "author": "sharyphil",
          "text": "Yes. Mine, of course.",
          "score": 1,
          "created_utc": "2026-02-21 12:33:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6mgbft",
          "author": "AngieCvi",
          "text": "theposh.agency",
          "score": 1,
          "created_utc": "2026-02-21 16:34:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6spfy9",
          "author": "MWL-camper",
          "text": "My company has a tech and team that helps with SEO/AIO in a flexible way. Companies that want fully managed service can test and learn side by side with our experts. They benchmark key topics/solutions and how you are doing, then either provide content framework with linking strategy OR do it for you. Typically clients start with 1-2 content pillars as POC then build from there. I’m in sales and support only 12 enterprises accounts in SaaS, healthcare, manufacturing and financial services. If you DM me I can connect you with the right people.",
          "score": 1,
          "created_utc": "2026-02-22 16:39:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6vzck8",
          "author": "Commercial_Web_6821",
          "text": "That’s all we do, full service agency for B2B tech. Extensive media, SEO and now AEO experience. Reach out through workwithwonder(dot)com",
          "score": 1,
          "created_utc": "2026-02-23 02:55:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6w9whf",
          "author": "zohaahmed1",
          "text": "If you need help with Reddit SEO (ranking higher) we have 40+ companies from YC tech startups partnered with us. DM me for details.",
          "score": 1,
          "created_utc": "2026-02-23 04:04:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6yfr4u",
          "author": "Prestigious_Air5520",
          "text": "We ran into the same issue when scaling B2B SEO for tech companies.\n\nA lot of agencies are either strong at content OR strong at technical SEO, but rarely both — and almost none understand how GEO/AI search is shifting discovery.\n\nWhat we found works well for B2B tech:\n\n* Deep ICP-led content strategy (not keyword-first, but problem-first)\n* Tight alignment between product positioning and SEO & GEO\n* Distribution beyond Google (AI search, community, founder-led content)\n\nThe biggest gap I see is agencies producing content without revenue intent. Rankings ≠ pipeline.\n\nHappy to share what we’ve learned building this for B2B SaaS if helpful.",
          "score": 1,
          "created_utc": "2026-02-23 14:30:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6iz6b4",
          "author": "throwawayjoystix",
          "text": "Your inbox is about to be wrecked with marketers haha. But it sounds like maybe that's exactly what you want, so right on.\n\nWe've been using Garit Boothe Digital the last two and a halfish years because they came super recommended to us. Glad we went that route because it has my life a lot easier. Always a good feeling being able to tell my marketing director that we aren't down in organic with all this AI overview stuff stirring up a ton.\n\nDo your research!",
          "score": 1,
          "created_utc": "2026-02-21 01:11:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6jbz8h",
          "author": "ppcbetter_says",
          "text": "I like PPC Better. I hear they are awesome at B2B lead gen.",
          "score": 0,
          "created_utc": "2026-02-21 02:31:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6jomf3",
          "author": "JunaidRaza648",
          "text": "I’ve worked with fintech and IT companies, and I’ve also worked on several other B2B websites so I’m confident I can help you.\n\nHere’s how I craft a strategy to not only attract the right audience but also improve conversions:\n\n* Your business gets positioned across every channel your potential clients use, search engines, answer engines, and AI tools, so you’re visible wherever buying decisions begin.\n* The messaging resonates with the right audience, attracting qualified prospects and turning attention into action.\n* We will make the sales funnel friction-free to improve conversions every stage of the funnel.\n* Your brand grows through strategic thought leadership, building authority, trust, and long-term demand.\n\nThese systems align perfectly with your goals and do up to 80% of your sales work even before potential clients reach out.",
          "score": 0,
          "created_utc": "2026-02-21 03:54:37",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r8ae3y",
      "title": "Is it just me who wants my entire business running from my own custom platform?",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1r8ae3y/is_it_just_me_who_wants_my_entire_business/",
      "author": "harrison_W_stevens",
      "created_utc": "2026-02-18 18:05:16",
      "score": 8,
      "num_comments": 12,
      "upvote_ratio": 0.84,
      "text": "Maybe this is just me, but I’ve started valuing having everything run inside one unified environment.\n\nNot stitched together.Not synced across five platforms. Actually unified. Not just because everything runs smoother although it does, but because it changes how you operate. Decisions are faster. Nothing hides in another tab. You’re not second guessing where something lives or whether it’s up to date. Not only that, but I own my infrastructure, I have control / customisation, and I’m not adapting to a tool which wasn’t meant to adapt to how I operate.\n\nI know the common approach is “best tool for each function,” but at some point that turns into constant switching and invisible friction. Think about the time wasted.\n\nAm I overcorrecting here, or are more people starting to see consolidation as the real upgrade?",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1r8ae3y/is_it_just_me_who_wants_my_entire_business/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o63eyxt",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-18 18:05:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o64h0zx",
          "author": "erickrealz",
          "text": "You're overcorrecting. Building a custom platform to replace proven tools sounds like control but it's actually just creating a full-time job maintaining software instead of running your business.\n\nEvery founder who goes down this path underestimates maintenance. Stripe updates their API, you have to update. Email deliverability changes, you have to fix it. CRM needs a new feature, you have to build it. Meanwhile Salesforce has 500 engineers handling that for you.\n\nThe \"invisible friction\" of switching tabs costs way less than the very visible friction of debugging your custom platform at midnight when something breaks before a client meeting. Use 2-3 best-in-class tools connected with Zapier and spend your time on revenue, not playing damn software engineer for your own business.",
          "score": 3,
          "created_utc": "2026-02-18 20:58:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o64p9ff",
              "author": "NotSoShyAlbatross",
              "text": "For reals, Stripe changed their API right after I bid a custom payment portal. I had to eat all that time brushing up on new protocols.\n\nThere are a lot of times you don’t even need Zapier. Tons of tools have webhooks and endpoints built in. It’s great if you don’t want another $59 sub (needed for multi-step zaps) and yet another thing to have to check on.",
              "score": 1,
              "created_utc": "2026-02-18 21:36:28",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o6xgcur",
              "author": "harrison_W_stevens",
              "text": "That’s because you’re dealing with it, why would you maintain it when the people who have built it can?",
              "score": 1,
              "created_utc": "2026-02-23 10:15:20",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o65o825",
          "author": "Dapper-Condition6041",
          "text": "Yes. I think you should focus on developing your own marketing platform rather than your product.",
          "score": 2,
          "created_utc": "2026-02-19 00:34:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o63limj",
          "author": "martinjsalgado",
          "text": "I’ve had the same thought but there are so many moving parts that actually working on building it was a full time job in itself. Following to see if anyone has an answer to this.",
          "score": 1,
          "created_utc": "2026-02-18 18:33:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6xga53",
              "author": "harrison_W_stevens",
              "text": "That’s because you don’t build it yourself. You need at least $500 for a full setup and two months of support and maintance",
              "score": 1,
              "created_utc": "2026-02-23 10:14:39",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o64glr4",
          "author": "NotSoShyAlbatross",
          "text": "I like people like you. I actually build the systems, but I’ve been able to help people take what they have and connect it better. You don’t always need another tool or to burn it all down and start with over.\n\nFeel free to DM me your “stack”, I might have some free insight that can save you some time.",
          "score": 1,
          "created_utc": "2026-02-18 20:56:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o67otag",
          "author": "AmeliaUnlikely",
          "text": "Yeah, have you looked at Odoo?",
          "score": 1,
          "created_utc": "2026-02-19 09:11:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o67szg2",
          "author": "Soft_Lick_Baby",
          "text": "I don’t think you’re overcorrecting at all. I’ve also been through the phase of having 7 tools open and integrations causing more friction than value. A unified platform gives clarity and faster decision-making. The real challenge is long-term maintenance. If you have the resources to maintain and scale it, it can be a serious advantage.",
          "score": 1,
          "created_utc": "2026-02-19 09:52:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6cx780",
          "author": "Nat_from_Doodle",
          "text": "are you building this yourself or stitching APIs into something centralized?\n\nI’ve noticed people feel the pain most when integrations are shallow. When tools truly talk to each other well, the “five platforms” problem feels less painful.",
          "score": 1,
          "created_utc": "2026-02-20 03:08:21",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r76qqt",
      "title": "B2B marketing is quietly shifting again.",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1r76qqt/b2b_marketing_is_quietly_shifting_again/",
      "author": "aksjonov_se",
      "created_utc": "2026-02-17 13:59:50",
      "score": 8,
      "num_comments": 12,
      "upvote_ratio": 0.83,
      "text": "For years the game was: Rank in Google → get traffic → convert.   \nNow more decision-makers are asking AI tools for answers before ever clicking a website. That changes the funnel.   \n  \nIf AI doesn’t mention your company when someone asks about your category, you might never enter the consideration stage.   \n  \nFrom testing this across B2B SaaS and service businesses, a few patterns stand out:  \n• Ranking alone does not guarantee AI visibility    \n• Clear, definition-first content gets reused more often    \n• Structured pages outperform clever copywriting    \n• Original data increases the likelihood of being referenced    \n• Strong SEO still matters, but it’s now the foundation, not the finish line    \n  \nSome are calling this GEO (Generative Engine Optimization). Not replacing SEO. Layering on top of it.  \n  \nSEO drives discoverability. AI-driven answers influence perceived authority.  \n  \nCurious how others here are thinking about this: Are you actively testing whether your brand appears in AI-generated answers within your niche?\n\n",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1r76qqt/b2b_marketing_is_quietly_shifting_again/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o5v7kqd",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-17 13:59:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5w21k6",
          "author": "Impressive-Amount255",
          "text": "I honestly think not much has changed.\n\nYou’re right. In the past, there was a big focus on getting traffic to your website. Today, there’s a big focus on whether you appear in LLMs. But it has never been only about your website.\n\nIn B2B, it has always been multi-touch.\nNow, the number of touches depends on what you’re selling:\nIf you’re targeting small businesses with a low-ticket offer paid by credit card, the journey might be short.\nIf you’re targeting large enterprises with long sales cycles and six-figure contracts, the journey is much longer.\n\nBut at no point was it ever enough to:\nRank first on Google →\nHave someone type the right keyword →\nSee you in position one →\nAnd immediately enter their credit card details.\n\nThat has never been how serious B2B decisions work.\nIt has always been a mix of touchpoints, such as:\nFinding your website and reading a few blog posts\nSeeing an ad in a magazine\nAsking peers what tools they use\nChecking what industry analysts are saying\nReading media rankings of the best solutions\nLooking at conversations on LinkedIn\nAttending events and trade shows to explore options\n\nWith AI, people are acting like the entire game has changed.\nYes, it’s true that LLMs are a new tool.\nYes, they may take time away from traditional search engines.\nBut no one ever made a serious B2B decision based solely on Google. \n\nAnd I don’t believe buyers will suddenly start making six-figure decisions based solely on a ChatGPT response either.\nMaybe it’s different for a $10 purchase.\nIt’s definitely different for a $500,000 contract.\nBut overall, multi-touch remains the foundation.\n\nTo me, AI and LLMs are simply one more channel to integrate into an existing strategy.\nAn important channel? Absolutely.\nA game-changer that replaces everything else? No.\nIf you already operate with a strong, disciplined integrated campaign framework, it’s not a revolution. It’s an addition.\n\nFor me, using the RIO Integrated Campaign Framework gives the structure to build well-orchestrated campaigns. Adding LLM visibility is simply about incorporating another touchpoint into the mix.\nIt doesn’t fundamentally change how I do marketing.\n\nIt’s just one more channel to influence buyers the right way.",
          "score": 4,
          "created_utc": "2026-02-17 16:34:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5w6o6z",
              "author": "f1zombie",
              "text": "This! \n\nWe are actively building demand gen pipelines that are omni-channel, but more importantly non-linear. Buying committees are over all the place, and each at a different maturity in understanding. AI would be another addition. \n\nSpeaking of - have any of you seen results with optimising for AI?",
              "score": 3,
              "created_utc": "2026-02-17 16:58:43",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o5xkcq4",
              "author": "aksjonov_se",
              "text": "I agree that multi-touch has always been the foundation in B2B. Where I see a shift is not in replacing the journey, but in where early perception is formed.   \n  \nLLMs don’t close six-figure deals. But they increasingly shape first impressions and shortlists. And that changes how clarity and positioning need to work across channels.",
              "score": 1,
              "created_utc": "2026-02-17 20:52:33",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5zp7q1",
          "author": "CoyotePrize4287",
          "text": "I think the biggest shift isn’t just visibility in AI answers, it’s corroboration. LLMs tend to surface brands that are consistently mentioned across multiple trusted sources, not just those with strong on-site SEO. So distribution and third-party validation may matter even more than before.",
          "score": 3,
          "created_utc": "2026-02-18 03:37:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5vbt0z",
          "author": "Mularkeyy",
          "text": "Yeah I’ve noticed this shift too. People aren’t just Googling and clicking anymore, they’re asking ChatGPT or Perplexity and taking the summary as truth.\n\nAnd you’re right, ranking doesn’t automatically mean you show up in AI answers. The stuff that gets pulled tends to be clear, structured, definition-style content, plus pages with actual data or strong examples. SEO still matters, but now it feels like the baseline. The real question is whether you’re becoming the default source AI models keep referencing.\n\nWe’ve been testing this by literally searching our category prompts weekly and tracking if we get mentioned. It’s a new layer of brand protection. We talk about this kind of AI-driven discovery shift on r/LeadGenSEA too if you want more examples and experiments.",
          "score": 2,
          "created_utc": "2026-02-17 14:22:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5xklux",
              "author": "aksjonov_se",
              "text": "That’s a great point about structure and definition-style clarity. What we’re seeing is similar,  it’s less about “ranking” and more about being consistently referenceable.   \n  \nPages that clearly define who they’re for, what they solve, and how they differ seem to get pulled more often. I like the idea of treating it as brand protection. It’s not just visibility, it’s whether the model understands you correctly.\n\n",
              "score": 1,
              "created_utc": "2026-02-17 20:53:45",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5zvnja",
          "author": "Slight_Tutor1790",
          "text": "I think the part that is underestimated here is messaging consistency across every channel. If someone asks an AI tool about your category and then checks your site, LinkedIn, or reviews, the positioning needs to match everywhere. If it is fragmented, the model might still mention you, but the buyer will feel the disconnect. So maybe the real shift is not just optimizing for AI answers, but tightening your overall narrative so it is clear and repeatable wherever it shows up.",
          "score": 2,
          "created_utc": "2026-02-18 04:18:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o63n6qx",
          "author": "Lemonshadehere",
          "text": "The funnel shift is real but I think a lot of people are still underestimating how fast it's happening\n\nwe work with B2B clients and the pattern is consistent: prospects show up to sales calls already having asked ChatGPT or Perplexity for vendor recommendations. if you're not in that initial AI-generated shortlist, you're not even being considered\n\nwhat's actually working from what we've seen:\n\nthird-party validation is everything. your own content matters but AI systems heavily weight what others say about you. strong G2/Capterra presence, getting mentioned in comparison articles, actual customer discussions in communities - that stuff carries way more influence than perfectly optimized landing pages\n\nentity clarity matters more than keyword optimization. if AI can't quickly understand \"company X solves Y problem for Z customers\" by pulling from multiple external sources, you get skipped or lumped into generic results\n\nthe definition-first approach is spot on. but it's not just about structure on your own site - it's about how consistently you're described across the web\n\nbiggest challenge is the measurement gap. clients still want to see \"rankings\" and \"traffic\" but those metrics don't capture whether you're actually showing up in the AI answers that matter\n\nhave you noticed any difference in how established brands vs newer companies show up? feels like newer B2B companies are getting buried even harder in AI results compared to traditional search",
          "score": 2,
          "created_utc": "2026-02-18 18:41:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6f7o67",
          "author": "Imaginary-Leg-2546",
          "text": "I don't need to check AI my traffic comes from other sources that do very well for us.",
          "score": 2,
          "created_utc": "2026-02-20 13:54:42",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r9vk0f",
      "title": "Legit way to find list of IT companies (1000-5000 employees)",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1r9vk0f/legit_way_to_find_list_of_it_companies_10005000/",
      "author": "TurbulentMarketing14",
      "created_utc": "2026-02-20 13:37:03",
      "score": 8,
      "num_comments": 17,
      "upvote_ratio": 1.0,
      "text": "What are some ways you find these companies? I assume this is a paid service, so not expecting a free ride.  What platforms have you had some success with?   \nAlso considering a workflow that can scrape sites and pull basic info from mostly static pages. ",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1r9vk0f/legit_way_to_find_list_of_it_companies_10005000/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o6f4dhl",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-20 13:37:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6fdnb2",
          "author": "BusySeedAgency",
          "text": "Some paid data platforms you can use are LinkedIn Sales Navigator, Apollo, ZoomInfo, and Crunchbase. Paid platforms are usually worth it.",
          "score": 5,
          "created_utc": "2026-02-20 14:26:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6fmhi5",
              "author": "TurbulentMarketing14",
              "text": "These are platform names that keep coming up. ",
              "score": 1,
              "created_utc": "2026-02-20 15:10:58",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o6g2om3",
              "author": "KissyyyDoll",
              "text": "Which one specifically? ",
              "score": 1,
              "created_utc": "2026-02-20 16:26:43",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6f9wcg",
          "author": "Everyd4yAudioGuy",
          "text": "If all 5 of your test emails are landing in spam, it’s almost always a reputation hit, not just a DNS problem. DFY accounts can still get cooked if Gmail starts seeing bad signals.\n\nQuick checks: did bounce rate creep up, are you using open tracking or links, did volume change recently, and is the copy basically the same across inboxes. Gmail flags patterns fast, even with text-only. I’d pause cold sends for a few days, keep warmup running, and run the domains through GlockApps or Mail Tester to see what’s failing before buying new domains.\n\nAlso, if list quality is part of the issue, The Grid can help for SEA targeting since the data tends to be fresher than generic databases.\n\nWe talk deliverability and lead sourcing on r/LeadGenSEA too if you want more insights.",
          "score": 2,
          "created_utc": "2026-02-20 14:06:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6laiow",
              "author": "[deleted]",
              "text": "[removed]",
              "score": 1,
              "created_utc": "2026-02-21 12:30:04",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6m6pv2",
          "author": "BodybuilderHorror718",
          "text": "Apollo 100%",
          "score": 2,
          "created_utc": "2026-02-21 15:46:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6nn7i1",
          "author": "Reasonable-Pen-8529",
          "text": "There are tons of companies that sell data lists. I would look into one like Techsalerator, as it has large, customizable datasets so you'll probably be able to find what you need.",
          "score": 2,
          "created_utc": "2026-02-21 20:10:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6g2km0",
          "author": "KissyyyDoll",
          "text": "Filter by headcount on Sales Navigator. It’s the most accurate for mid-market companies because it’s based on real-time employee profiles. Just export the list and verify the domains manually.",
          "score": 1,
          "created_utc": "2026-02-20 16:26:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6nsho7",
          "author": "salestoolsss",
          "text": "Use Tomba.io’s Reveal tool  it’s the easiest way to get more complete data, especially since most B2B companies and leads are active on LinkedIn.",
          "score": 1,
          "created_utc": "2026-02-21 20:38:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6y1g97",
          "author": "Eileen_woman",
          "text": "Paid options will be better. you'll be limited to trials otherwise. listkit has a company search feature that will help you with this. We used it in our previous campaign their data is reliable.",
          "score": 1,
          "created_utc": "2026-02-23 13:07:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6z8u4t",
          "author": "Persimmon_Reagan",
          "text": "listkit is solid for this, just type \"IT companies 1000-5000 employees\" in plain english and it builds the list. headcount filters, verified contacts, bounces stay under 2% they say. they have a free leads offer if you wanna test it before committing",
          "score": 1,
          "created_utc": "2026-02-23 16:51:19",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r9r31h",
      "title": "How are people generating short product videos for tiktok ads?",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1r9r31h/how_are_people_generating_short_product_videos/",
      "author": "LateNightLateral",
      "created_utc": "2026-02-20 09:43:06",
      "score": 8,
      "num_comments": 6,
      "upvote_ratio": 1.0,
      "text": "I am trying to figure out the best way to create short product videos for tiktok ads without doing full shoots or filming creators.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1r9r31h/how_are_people_generating_short_product_videos/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o6e94dq",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-20 09:43:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6kdzth",
          "author": "beboid",
          "text": "Whats worked for me is starting with a short script and hook then building visuals around that. Product images and simple demos go a long way if the pacing feels native to tiktok and FalcoCut helped with that",
          "score": 3,
          "created_utc": "2026-02-21 07:20:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ep90r",
          "author": "exomisfit",
          "text": "Veo via Fiddlart.",
          "score": 1,
          "created_utc": "2026-02-20 12:00:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6f1mpi",
          "author": "Cool-Muscle-8954",
          "text": "SENT AN INVITE",
          "score": 1,
          "created_utc": "2026-02-20 13:21:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6l4n55",
          "author": "ObjectiveFerret9017",
          "text": "Bro most people just repurpose existing footage like product images, short clips, or even UGC-style snippets they stitch together with text overlays, trending sounds, and fast cuts. You can use stock footage mixed with animated text or mockups to highlight features if you don’t have fresh content. No need for a full shoot when TikTok’s vibe is all about scrappy, authentic, and quick edits that don’t feel polished anyway.",
          "score": 1,
          "created_utc": "2026-02-21 11:39:56",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rakxl1",
      "title": "AI headshots for 10-person B2B team?",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1rakxl1/ai_headshots_for_10person_b2b_team/",
      "author": "patata-chip",
      "created_utc": "2026-02-21 07:28:04",
      "score": 7,
      "num_comments": 9,
      "upvote_ratio": 0.6,
      "text": "Looking for affordable headshots for our B2B team page. We need professional headshots for 10 people (sales, marketing, executives) but the headshot photographer quotes near me are $250-400 per person which adds up to $3,000+ total.\n\nThat's a huge chunk of our marketing budget. I've been researching cheaper alternatives and keep seeing AI headshot generators mentioned. Has anyone here used AI headshots for B2B company websites or should I keep looking for a more affordable headshot photographer ?\n\nSomeone mentioned they tried **Looktara** for their team's professional headshots and spent under $300 total instead of thousands, but I'm worried about quality and whether it looks unprofessional for B2B.\n\nFor B2B marketers - what's your recommendation? Find a cheap headshot photographer, use an AI headshot generator, or just pay the premium for traditional photography? Looking for suggestions on best options for professional headshots on a tight budget.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1rakxl1/ai_headshots_for_10person_b2b_team/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o6ketc1",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-21 07:28:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6kf4m4",
          "author": "athousand_miles",
          "text": "we’ve never seen headshots move conversion in B2B.",
          "score": 4,
          "created_utc": "2026-02-21 07:31:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6lpqx2",
          "author": "lemadfab",
          "text": "Second time I see that ad… Geebus.",
          "score": 2,
          "created_utc": "2026-02-21 14:13:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6kfh35",
          "author": "Utakata11",
          "text": "we used AI headshots for our team page last year because coordinating 10 people for a shoot was a nightmare.\nkept 1 solid photo per person, deleted the rest. no prospects ever commented, metrics didn’t change.",
          "score": 1,
          "created_utc": "2026-02-21 07:34:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6kg7m3",
          "author": "makingsalescoolagain",
          "text": "Ask your team members to submit 3 closeup selfie/photos each. Throw it in an image generation model and ask it to generate professional headshots keeping the character consistent (VEO-3/Nanaobana are the best suited). Would take 30 mins to generate headshots for a team of 10, literally no one would say it is AI.\n\nFeel free to Dm for the prompt or sample headshots",
          "score": 1,
          "created_utc": "2026-02-21 07:41:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6lv9rh",
          "author": "Tampa89",
          "text": "Spam slop post!",
          "score": 1,
          "created_utc": "2026-02-21 14:45:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6mlafh",
          "author": "StayAtHomeAstronaut",
          "text": "Not even subtly pushing your shitty apps anymore",
          "score": 1,
          "created_utc": "2026-02-21 16:59:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6t8czm",
          "author": "atlasspring",
          "text": "I'd suggest checking out NovaHeadshot as a practical alternative for your team because it delivers professional-grade, consistent results that solve the budget issue without sacrificing that corporate trust factor. While headshots rarely drive direct metrics, maintaining a cohesive visual brand across your team page is still crucial for establishing credibility.",
          "score": 1,
          "created_utc": "2026-02-22 18:06:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6kfunw",
          "author": "After_Diamond2098",
          "text": "a startup i advised used Looktara for their team page to save budget.",
          "score": -1,
          "created_utc": "2026-02-21 07:38:08",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r7wkqo",
      "title": "What Can I Gain or Benefit to Lead Generation?",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1r7wkqo/what_can_i_gain_or_benefit_to_lead_generation/",
      "author": "National-Cancel1200",
      "created_utc": "2026-02-18 07:29:41",
      "score": 7,
      "num_comments": 9,
      "upvote_ratio": 1.0,
      "text": "Lately, I’ve been thinking a lot about lead generation and how it fits into growing a business effectively. It seems like so many people focus just on collecting contacts or building email lists, but I feel there’s a bigger picture, like finding the right prospects, building meaningful relationships, and creating a steady flow of opportunities without wasting time on the wrong leads. I’m curious about how others approach it and what they consider the most valuable outcomes from investing time and effort into lead generation.\n\nI’d really love to hear your insights and experiences. Have you tried strategies or tools that made a real difference in finding quality leads or improving conversions? Are there methods that surprised you with unexpected benefits, like better client relationships, clearer targeting, or even internal process improvements? Any advice, suggestions, or lessons learned would be incredibly helpful, not just for me, but for anyone looking to understand the real impact of lead generation beyond just numbers.\n\n",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1r7wkqo/what_can_i_gain_or_benefit_to_lead_generation/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o60k3x9",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-18 07:29:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o62aclv",
          "author": "New_Grape7181",
          "text": "I think you're spot on about the bigger picture. Most people get stuck chasing volume when quality is what actually moves the needle.  \n  \nFrom my experience, the shift happened when I stopped treating lead gen as a numbers game and started focusing on intent signals. Instead of cold outreach to static lists, I began tracking company triggers like funding announcements, job postings, leadership changes, or even just engaged LinkedIn activity. That context let me reach out at the right moment with something relevant, rather than interrupting randomly.  \n  \nThe unexpected benefit wasn't just better conversion rates. It was shorter sales cycles and higher deal values because these prospects were already in motion. They had a reason to care right then, not in six months.  \n  \nI also found that personalisation at scale is possible if you use the right approach. For us, sending quick personalised videos instead of text-only emails completely changed response rates. People actually replied because it felt human, not automated.  \n  \nThe internal benefit you mentioned is real too. Better lead quality means your sales team stops wasting time on tyre kickers and actually enjoys their pipeline.  \n  \nWhat's your current process for identifying which leads to prioritise?",
          "score": 2,
          "created_utc": "2026-02-18 15:00:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o60kgtl",
          "author": "albrasel24",
          "text": "Lead gen isn’t about more emails. It’s about better fits.\n\nWhen you nail your ICP, everything improves: messaging, sales calls, conversion rates.\n\nI’d rather have 20 solid prospects than 200 random ones. Quality > volume.",
          "score": 1,
          "created_utc": "2026-02-18 07:32:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o60zdgz",
              "author": "Tahanchin",
              "text": "Agree. But these days, you need 2000 quality leads to reach at least a few. Channels are overloaded, and each company is trying (successfully) to choke outreachers.",
              "score": 1,
              "created_utc": "2026-02-18 09:51:53",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o60qxww",
          "author": "B2BScaler",
          "text": "Comprehensive understanding of channels and outcomes.\n\nMessage me for full breakdown.\n\nMany shortcut it as a pain point solve and pay up and regret from not asking what you just did intelligently before embarking.",
          "score": 1,
          "created_utc": "2026-02-18 08:32:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o629nmo",
          "author": "New_Grape7181",
          "text": "I think you're spot on about the bigger picture. Most people get stuck chasing volume when quality is what actually moves the needle.  \n  \nFrom my experience, the shift happened when I stopped treating lead gen as a numbers game and started focusing on intent signals. Instead of cold outreach to static lists, I began tracking company triggers like funding announcements, job postings, leadership changes, or even just engaged LinkedIn activity. That context let me reach out at the right moment with something relevant, rather than interrupting randomly.  \n  \nThe unexpected benefit wasn't just better conversion rates. It was shorter sales cycles and higher deal values because these prospects were already in motion. They had a reason to care right then, not in six months.  \n  \nI also found that personalisation at scale is possible if you use the right approach. For us, sending quick personalised videos instead of text-only emails completely changed response rates. People actually replied because it felt human, not automated.  \n  \nThe internal benefit you mentioned is real too. Better lead quality means your sales team stops wasting time on tyre kickers and actually enjoys their pipeline.  \n  \nWhat's your current process for identifying which leads to prioritise?",
          "score": 1,
          "created_utc": "2026-02-18 14:57:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o62nqca",
          "author": "chanchalll_21",
          "text": "Lead generation gives you a consistent pipeline of potential customers. Instead of chasing sales randomly, you build a system that brings interested prospects to you regularly.",
          "score": 1,
          "created_utc": "2026-02-18 16:02:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o68mo8r",
          "author": "Wrong-Finish7655",
          "text": "Lead gen done right gives you predictable pipeline, cleaner ICP clarity, and way less time wasted on bad fits — it’s not about list size, it’s about control over revenue.\n\nWhat actually moved the needle for us was tightening targeting (industry + title + company size) and fixing data quality first; clean inputs improved replies, conversions, and even how sales handled calls.",
          "score": 1,
          "created_utc": "2026-02-19 13:39:21",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r9pxwi",
      "title": "How do you guys generate leads in conservative niches?",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1r9pxwi/how_do_you_guys_generate_leads_in_conservative/",
      "author": "S1lv3rS4rf3r",
      "created_utc": "2026-02-20 08:31:39",
      "score": 7,
      "num_comments": 65,
      "upvote_ratio": 0.82,
      "text": "I run a boutique agency (low to mid six figure annual revenue, small team, all specialists) in a super conservative niche (think wealth management, luxury, architecture, high-end real estate, financial planners, fine art, jewelry etc.). We have been going at it for more than 5 years but were never able to scale beyond mid six figures.\n\nThe retainers we sell (media buying/lead gen agency with some design, CRO) range from $5k-$20k per month on 12 month agreements. We have high professional standards and do good work I would say.\n\nSo far the only thing that has worked for us is curating a targeted email list of contacts and accounts in our niche (buying data from brokers, segmenting it, filtering it etc.), creating highly targeted blogs and lead magnets for the email list and advertising our stuff on LinkedIn through targeted ads.\n\nOrganic social, SEO, event attendance/sponsorship, local networking, direct media deals with industry publishers and PR earned media have yielded only visibility and growth of reach but never real leads (most people that come through these channels are tire-kickers or freebie seekers).\n\nOur sales cycles are long (several weeks and months) and we only get a handful of good opportunities per year, with strong feast & famine cycles.\n\nA lot of people in our niche also regularly try to steal our ideas, frameworks and thought leadership without giving us credit, money or recognition. Most of our former clients have been small operators or mid-sized accounts with a small operator mindset. We would love to engage more mid-sized companies since they are much stickier (small accounts in our niche tend to fire you to save money if you are doing well, and fire you early if results take time or they can't leverage the leads properly). Enterprise clients have just tried to manipulate us in participating in bad faith pitches or doing free spec work and then went on to hire Accenture and these kind of people. We are all a bit burned out by these experiences.\n\nWe have a solid brand, good case studies and recognition from magazines, so I don't want to close shop or switch niches to something faster but low-ticket. Any ideas? Other owners or people working in similar niches? How do you generate leads for your conversative niche?\n\nHappy to network and exchange ideas with people on here in similar fields.\n\nTLDR:\n\nBoutique agency owner in ultra conservative niche wonders how other people generate leads in conservative niches",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1r9pxwi/how_do_you_guys_generate_leads_in_conservative/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o6e1miz",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-20 08:31:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6e77z0",
          "author": "cursedboy328",
          "text": "three things stand out:\n\nfeast/famine = your pipeline stops when delivery ramps up. your working channel (curated list + linkedin ads) needs to run on autopilot whether you're busy or not. if it depends on your spare time, it'll always be inconsistent.\n\nsmall clients firing you = wrong ICP, not wrong niche. mid-size companies with $5-20K/mo budgets don't flinch at that spend if results are there. the issue is reaching them - conservative niches respond to warm intros and peer-level outreach, not ads or content marketing.\n\nidea theft in pitches = showing too much before contract. sell the outcome with proof (case studies, metrics). hold back the how until they're signed.\n\nfor mid-size accounts in luxury/wealth management specifically - targeted 1-to-1 outreach to 50-100 ideal accounts beats any scalable channel. low volume, high personalization, positioned as a peer conversation not a vendor pitch.\n\nwhat does your ideal mid-size client look like specifically?",
          "score": 3,
          "created_utc": "2026-02-20 09:25:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6ebzlu",
              "author": "S1lv3rS4rf3r",
              "text": "Thank you for the tips!\n\nThere have been times when we slacked off on the blogs and lead magnets for sure, but in the last 3 months we have been pretty consistent. \n\nOur goal this year is a new blog each week, 2 new lead magnets per quarter, which results in 3 mailings to our 30k curated list each week (gated lead magnet, blog, gated lead magnet).\n\nWe are also refining the positioning and paint points in our content constantly. We are not sure if this will improve pipeline, but we will see. We will also add 2.5-5k in Linkedin ad spend to each lead magnet to reach more decision makers once we sign one or two new clients this or next quarter.\n\nWe reject small clients in general now and dont even talk to them these days anymore. We have long forms, and a lot of qualification built into our sales funnel now.\n\nWe also dont participate in pitches or engage with enterprise companies anymore, I frankly dislike RFPs anyway. In the past these only came our way through event attendance and we stopped going due to the cost and lack of ROI.\n\nWe didnt have any results doing personalized outreach to mid level buyers in our niche in the past, neither through cold email (apollo.io) or LinkedIn DMs. We spent a lot of time on curating accounts, researching them, using sales anayltics to track opens, clicks, forwards, tracking domain health and deliverability etc. \n\nThe only thing we did not do were personalized video messages due to our small team size, which seem to work for non-niche agencies but seem prohibitive in terms of time for small teams like us.\n\nAny tips for outreach segmentation or personalization for a conservative niche beyond \"dont sound like an agency pitch or be salesy\"? We already tried to avoid the obvious mistakes.\n\nAccording to our trained AI agent, buyers in our niche do a lot of intellectual consumption and only buy services like ours if there is internal management or leadership driven pychological pressure to hire external help. \n\nThey supposedly love to read and download but rarely buy (some kind of ego trip or intellectual need for industry benchmarking according to the AI.)\n\nI wanted to make sure Im not missing out on additional viable approaches, hence why I wanted to get some input from real people here on Reddit.\n\nI cant really reveal what the account profile looks like without giving away the exact niche we work in, but we have targeting that consists of industry, business model, revenue size, employee size, job titles, pain points and buying scenarios based on industry patterns and trends.\n\n5mill in annual revenue is our minimum threshold.",
              "score": 2,
              "created_utc": "2026-02-20 10:09:20",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6l0y7l",
                  "author": "cursedboy328",
                  "text": "your AI agent's analysis sounds like a rationalization for why outreach isn't working. \"they love to read but rarely buy\" isn't a buyer profile - it's what happens when your outreach doesn't match how they actually make decisions.\n\nconservative niches don't buy from content funnels or cold outreach from unknowns. they buy from people already in their network or people who look like peers. the 30k list + linkedin ads approach works for mid-market SaaS, not for luxury/wealth management buyers who see themselves as above being \"marketed to.\"\n\ntwo things i'd test before adding more content volume:\n\nyour apollo cold email not working is probably infrastructure and targeting, not messaging. most people running apollo have 1 domain, no warmup rotation, do not verify catch-all emails with good providers, and land in spam before the prospect ever sees the email. what was your sending setup - how many domains, inboxes, daily volume?\n\nfor the personalized outreach that failed - what was the actual approach? \"hi \\[name\\], noticed your firm does \\[x\\]\" personalization doesn't move the needle anymore that much, given AI capabilities. the test is whether your first line references something only someone in their world would know. industry-specific trigger events, not linkedin profile scraping.\n\nand relevance might help you a lot as well, reaching out to people as soon as some specific signal hit.\n\nwhat reply rates were you getting on the cold email and linkedin outreach?",
                  "score": 1,
                  "created_utc": "2026-02-21 11:05:20",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6e2u7h",
          "author": "kubrador",
          "text": "you've already found the only thing that works in these niches (targeted email + linkedin) and you're doing it. the problem is you've built a business that requires you to be a salesperson to wealthy, paranoid people who move slow and then fire you when things get good.\n\nthe real answer nobody wants to hear: you either need to go deeper on what's working (hire someone whose only job is list building and outreach), go niche-within-niche (like, only wealth managers in the southwest with $500m+ aum), or build a productized service that doesn't require hand-holding mid-market clients through their own incompetence.\n\nyour best accounts probably came from warm intros or existing relationships anyway. that's where the real lead gen happens in conservative spaces. the tire-kickers found you through everything else.",
          "score": 2,
          "created_utc": "2026-02-20 08:43:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6e4r4j",
              "author": "S1lv3rS4rf3r",
              "text": "Thanks for the comment! Damn, that sucks. I often wondered if picking our niche was a major mistake...\n\nCold email itself (even to our curated list, through apollo, sequences etc. ) only worked for retainers with shorter durations below $3k. We dont want to do these kind of deals any more since they were killing our morale previously. It is hard to do good work in our niche with that little money.\n\nReferals were ironically never a thing for us. Each time we asked a client for a referral they said they dont want to share us with other people or reveal that they are using us. I guess that is where the paranoia kicks in.\n\nI was honestly hoping that there is a tactic, playbook or channel that we might have missed that has scaled for other people with similar niches and decent client profiles.",
              "score": 3,
              "created_utc": "2026-02-20 09:01:27",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6exmpf",
          "author": "SnooPeppers1256",
          "text": "What you’re describing isn’t really a “conservative niche” problem.\n\nIt’s a trust compression problem.\n\nUltra-conservative industries (wealth management, fine art, high-end real estate, architecture etc.) don’t convert from visibility they actually  convert from perceived inevitability, IMHO.\n\nMost agencies in those spaces optimise for:\n\nReach  \nCredibility badges  \nIndustry placements  \nEvents  \nLinkedIn ads\n\nBut mid-market buyers in conservative sectors typically make decisions based on three internal checkpoints:\n\n1. Risk reduction (Will this blow up on me?)\n2. Social proof inside my tier (Are firms like mine already doing this?)\n3. Pre-sold belief in the mechanism (Do I understand why this will work before the pitch?)\n\nFrom your description, it sounds like you generate awareness well, but the belief-building might still be happening inside the sales cycle instead of before it.\n\nThat’s what creates long cycles and feast/famine.\n\nOne shift I’ve seen work in “high trust, slow decision” industries is moving from lead generation to conviction engineering.\n\nInstead of:\n\nBlog → Lead magnet → Call\n\nIt becomes:\n\nHighly specific operator-level diagnostics → Problem escalation content → Funnel that pre-sells the cost of inaction → Application-level call\n\nThe difference is subtle, but it filters out tire-kickers and dramatically shortens sales cycles because buyers arrive already convinced they need a structural solution, not “another agency.”\n\nAlso, conservative niches respond far better to:  \nSpecificity over volume  \nNarrow problem dominance over broad service lists  \nCase study depth over industry recognition\n\nwhen you look at your last 10 serious opportunities, did they come in already convinced about your mechanism, or were you still educating them inside the sales process?",
          "score": 2,
          "created_utc": "2026-02-20 12:57:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6f325v",
              "author": "S1lv3rS4rf3r",
              "text": "Thank you for the reply!\n\nThe 3 checkpoint approach and operator diagnostic funnel you described is something we are already gravitating towards. Interesting to hear that other people are doing smth similar. I will try to expand on that with upcoming new content this year for sure. Thanks for the ideas and structure.\n\nIn theory we pass all three criteria due to our track record and specialisation. Maybe we dont communicate that strongly enough though in the right sequence.\n\nOur new sales process is something very similar to what you described btw. Industry & pain point specific audit -> Buisness Case -> Business Case Review -> Proposal -> Proposal review -> Agreement.\n\nWe are already highly specialized in terms of pain points we solve, with a limited offering in terms of services and case studies pointing out that we can walk the walk.\n\nThis is helpful in sales with the right mid sized accounts, but not really useful in lead gen since there are a lot of cheaper generalists that claim that they can do what we do (90% cant based on what people told us though).\n\nThe last solid opps came from the funnel I described at the beginning, it is just quite slow.  To be fair pre q3/q4 2025 our approach was more spray and pray with soft gates and a lot of small operators in the mix that didnt really care about our specialization as much and had in general low sophistication in terms of digital maturity.\n\nI just want to make sure we are locked in correctly in 2026. But at least we are moving in the right direction based on the responses here.",
              "score": 2,
              "created_utc": "2026-02-20 13:29:49",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6fh6db",
                  "author": "SnooPeppers1256",
                  "text": "Appreciate the detailed response, this genuinely sounds like a much healthier positioning than spray and pray.\n\nFrom what you’re describing, it doesn’t feel like a capability or closing issue.\n\nIt feels more like signal calibration at the top of funnel.\n\nMid-sized firms in conservative sectors don’t just evaluate specialization, they evaluate tier alignment.\n\nIf the front-end messaging attracts the same psychological buyer profile as generalist agencies, even strong differentiation still gets bucketed incorrectly.\n\nThat’s usually where velocity compresses.\n\nOne shift I’ve seen work in slower-cycle markets is tightening the entry frame around capital allocation and acquisition risk at their stage of maturity, rather than around competence.\n\nThat framing tends to filter small operators automatically and elevate the conversation before it starts.\n\nOn your last few serious opportunities,  were they already operating at a higher digital maturity when they entered your funnel, or were you still building that awareness during the audit?",
                  "score": 2,
                  "created_utc": "2026-02-20 14:44:29",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6f1ixh",
          "author": "[deleted]",
          "text": "[deleted]",
          "score": 2,
          "created_utc": "2026-02-20 13:21:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6fbicw",
              "author": "S1lv3rS4rf3r",
              "text": "What are founder-led systems? Personal branding? Paid speaking engagements at events? Writing a book? Those are sadly prohibitively expensive in terms of money and time. At least for now. I would also rather not be the sole face of my company forever.",
              "score": 1,
              "created_utc": "2026-02-20 14:15:06",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6fgmdg",
                  "author": "[deleted]",
                  "text": "[deleted]",
                  "score": 1,
                  "created_utc": "2026-02-20 14:41:35",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6faqbv",
          "author": "Everyd4yAudioGuy",
          "text": "Yeah this is a tough space, but honestly your situation sounds normal for conservative, high-ticket niches. They don’t convert like SaaS, they get referred.\n\nWhat usually scales better than content and ads in these markets is building a small circle of distribution partners. Think accountants, law firms, private banks, wealth tech vendors, real estate brokers, architects, or even niche software providers who already have trust and can introduce you. One strong partner can outperform a year of LinkedIn ads.\n\nI’d also stop trying to market to the whole niche and go hyper-specific, like one segment plus one flagship offer. Conservative buyers don’t want options, they want certainty.\n\nAnd for idea theft, the best defense is packaging. Don’t give away frameworks as content, turn them into paid audits, workshops, or diagnostics that require a call to access. Feels like you’re doing a lot right, but you’re relying on channels that attract researchers instead of buyers. Relationships and referrals are usually the real growth lever here.\n\nWe talk about high-ticket lead gen in SEA and conservative industries on r/LeadGenSEA too if you want more ideas.",
          "score": 2,
          "created_utc": "2026-02-20 14:10:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6fm981",
              "author": "S1lv3rS4rf3r",
              "text": "Thanks for the pointers. I mentioned the niches above as examples. I dont think calling out your niche on a place like reddit is very smart haha. We are absolutely hyper specialized on specific business models in a specific conservative industry. Our clients have been international so far btw but I will check out the subreddit. Thanks!\n\nEDIT: How would you go about building that referel network with laywers, bankers etc though? Offer them a referral bonus? Do personalized outreach to them?",
              "score": 2,
              "created_utc": "2026-02-20 15:09:51",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6fqaem",
          "author": "Wrong-Finish7655",
          "text": "We’ve worked wealth managers and PE-backed real estate, same slow cycles and gatekeepers — blasting content won’t move them.\n\nTight C-suite lists + 1:1 email + LinkedIn touch + small private dinners/webinars worked best; we source niche titles by AUM/firm size filters (LeadCourt/Apollo), then go deep not wide and treat it like ABM, not volume outbound.",
          "score": 2,
          "created_utc": "2026-02-20 15:29:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6fta0n",
              "author": "S1lv3rS4rf3r",
              "text": "Interesting approach! I imagine the private dinners only work on the local level? Or do you literally fly out to meet people? I fantasized a lot about doing ABM but tools like demandbase or 6sense are also expensive as hell and require aligned sales teams for specific accounts.",
              "score": 1,
              "created_utc": "2026-02-20 15:43:17",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6g1w9j",
          "author": "KissyyyDoll",
          "text": "ngl you're giving away too much for free if people are stealing your frameworks. idc how good the content is, if it's public, it's \"commodity.\" tbh the real leads in these boring-but-rich niches come from private dinners or small roundtables with 5-10 founders. stop trying to scale through volume and start scaling through exclusivity. the \"if you have to ask, you can't afford it\" vibe actually works here.",
          "score": 2,
          "created_utc": "2026-02-20 16:23:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6gp40x",
          "author": "No-Perspective4464",
          "text": "Referrals and cross-referrals with non-competing advisors in your niche seem like the obvious untapped move here honestly.",
          "score": 2,
          "created_utc": "2026-02-20 18:09:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6k69pp",
              "author": "S1lv3rS4rf3r",
              "text": "How would you go about establishing these relationships, write to these lawyers, accountants etc.? Offer them smth?",
              "score": 1,
              "created_utc": "2026-02-21 06:10:14",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6hi7gw",
          "author": "Hopeful_Account_1370",
          "text": "What actually moves the needle (what I did to break $1M+ ARR): Flip to 70%+ referral/partnership-driven. Referrals convert 30% better than other channels; top advisors get 10+ qualified prospects/month via centers-of-influence (CPAs, attorneys, family offices) not ads. Build a Virtual Family Office-style network partner with complementary pros (tax, estate lawyers) for co-marketing/webinars. I stopped buying lists, cut LinkedIn spend 60%, invested in 1:1 relationship events (small dinners, not big sponsorships). Result: 3-4 mid-sized sticky clients/year vs. 10 flaky ones. LTV doubled, churn dropped 70%.\n\nIf you love the niche, double down on trust ecosystems over volume tactics. Otherwise, yeah, the ceiling is real most don't break it without niche shift or massive pivot.",
          "score": 2,
          "created_utc": "2026-02-20 20:25:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6k7fbw",
              "author": "S1lv3rS4rf3r",
              "text": "A lot of people seem to run this playbook. Interesting! How would you go about building that network? What do you offer your partners and how do you connect?",
              "score": 1,
              "created_utc": "2026-02-21 06:20:19",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6ldrce",
          "author": "Left-Instruction9074",
          "text": "the apollo issue might be less about the sequences and more about data quality at the ICP level. apollo's built for volume. for a niche like yours the firmographic filters are too blunt to reliably surface wealth management or fine art contacts at the right seniority and revenue threshold\n\na friend of mine running a similar boutique switched to listkit for exactly this reason, describe the ICP in plain english, get triple verified contacts back, no manual broker cross referencing. if domain health is already on your radar, sending to unverified broker lists will keep hurting you regardless of how tight the copy is",
          "score": 2,
          "created_utc": "2026-02-21 12:55:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6vzshm",
          "author": "New_Grape7181",
          "text": "I've worked with some similarly conservative niches and the long sales cycles are painful. One thing that helped us was adding video prospecting into the mix alongside email.  \n  \nInstead of just sending text emails to your curated lists, I'd record quick personalised videos (30-45 seconds) for your highest-priority prospects. Reference something specific about their business or a recent company announcement. It sounds time-consuming but you can knock out 20-30 in an hour once you get the rhythm down.  \n  \nThe response rate was dramatically higher than text-only outreach for us. I think it's because these conservative niches value the extra effort and personal touch. They can see you're a real person who actually researched them, not just another agency blast.  \n  \nThe other thing I'd consider is asking your best clients for warm intros before they churn. Since you mentioned small operators fire you when doing well, that's actually your moment of highest leverage. They're happy with results but want to save money, so they should be willing to introduce you to 2-3 peers as a thank you.  \n  \nHave you tried getting systematic about asking for intros during the offboarding process?",
          "score": 2,
          "created_utc": "2026-02-23 02:57:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6wdixi",
              "author": "S1lv3rS4rf3r",
              "text": "The videos are something we thought about. Def should try that at some point. Same with the referrals, we will do them earlier (prob after 2-3 months like people recommended). I rather shut down the agency than work with more small operators tbh (I can consult to make a living - did that in the past). The only accounts we want to work with a decent mid sized ones. Everything else is just too draining and not worth the effort.",
              "score": 1,
              "created_utc": "2026-02-23 04:29:24",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6w2z2h",
          "author": "Slight_Tutor1790",
          "text": "You might be over optimizing channels when the real leverage could be concentration. If only 3 to 4 mid sized six figure deals closed in a few years, that tells me the market is small and relationship driven, not volume driven. Instead of trying to scale content harder, I would map the exact profile of those 3 to 4 buyers and build a micro ecosystem around that tier only. Private roundtables, closed door briefings, industry specific research reports shared directly with a short list of operators. Conservative buyers often move when they feel part of a select peer group, not when they download another asset. That approach may create fewer leads on paper but stronger inevitability with the right accounts.",
          "score": 2,
          "created_utc": "2026-02-23 03:18:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6wdom6",
              "author": "S1lv3rS4rf3r",
              "text": "Several people here mentioned to run a closed circle type playbook. Def something I will look into. Thanks for the advice!",
              "score": 1,
              "created_utc": "2026-02-23 04:30:32",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6edipp",
          "author": "Responsible-Brick881",
          "text": "I've been speaking with a lot agencies similar to you lately - in fact, very similar in terms of the type of clients. Also speaking with a lot of luxury brands, wealth management type companies too.\n\nI might have something interesting for you that could be an easy bolt on for your existing clients and gives you an opportunity to scale. I can pop you a DM if you're open to hearing me out.",
          "score": 1,
          "created_utc": "2026-02-20 10:23:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6eeyo1",
              "author": "S1lv3rS4rf3r",
              "text": "Sorry that sounds like another SaaS tool upsell. We are currently only generating 3-5 new clients per year, for our own services. Im just looking for advice from other service providers selling into similar niches on how they generate leads that close.\n\nOther agencies and programmtic platforms have tried to propose upsell partnerships like that in the past (CRO tools that scale in price with site visits, media kickback fees for placing client budget and creative on adtech platforms etc.) \n\nI would not risk the relationship with a new mid-sized client just to make couple extra dollars tbh. That might work for bigger or volume focused agencies but it will most likely not work for us.\n\nI also dont like the \"become a tech affiliate\" hustle. A lot of agencies dont really offer any value (referral, co branded pitch, white label scope etc.) but just try to find people that can sell their SaaS or Adtech solution for them.\n\nNot my world sadly. Kinda violates our professional code.",
              "score": 1,
              "created_utc": "2026-02-20 10:36:40",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6eilez",
                  "author": "Responsible-Brick881",
                  "text": "No worries man. Im not trying to hustle anyone though to be clear. As I've said, I've been speaking with clients in yous niche who see real value in what I've built for them - basically cutting out the shit elements of online advertising, giving them full transparency and only serving on a very niche, premium set of publishers. \nWas just trying to help with something I belive actually makes advertising better for brands of all sizes, not just the biggest brands in the world who get all the best services/platforms.",
                  "score": 0,
                  "created_utc": "2026-02-20 11:08:14",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6ey2jx",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-20 13:00:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6f8s3u",
              "author": "S1lv3rS4rf3r",
              "text": "The opinion about our niche comes from a mixture of selling into it for 5 years+, working with businesses in the 1mill to 50mill range in terms of annual revenue and doing industry benchmarking with AI and public data sources. If someone would give me a data backed solid reason why our perception is wrong than Im all ears to change my view on it.\n\nThe people in our niche do work with agencies for different things but they often opt for low cost generalists over more expensive specialists like us due to a lack of digital maturity or sheer ignorance when it comes to the fact that industry specialization really matters a lot when it comes to targeting, copywriting, art direction, tech/channel selection, funnel math and customer psychology. Basically what we do drives results and success with a much higher likelyhood for clients in our industry then the frameworks that some of our low cost competitors use. Hency why a lot of industry media have covered us. \n\nIm blaming SaaS for that to be honest, since they commoditized marketing agencies in the eye of a lot of unsophisticated buyers with budget authority (results are just 1-2 clicks away, full marketing suite for $50 blabla)\n\nOur rates are fair and we deserve it due to our specialization. Our 12 month minimum is necessary since we do not do things like outsource to development countries, white label generalists doing all the work for peanuts etc to allow for cheaper rates, lower minimums and more volume. Everybody who works with us has industry expertise and gets paid fairly by western standards. Agency sweatshops are disgusting.\n\nWe have already reduced the technicality in our content massively and talk more about pain points and bad results of inaction now. We should prob ask for referrals earlier thats true.\n\nWe never organized round tables but we particpated in one or two which resulted in a lot ooohs and aahs, opt ins for our list but zero real leads. Software referral partners these days have directories full of cheap generalists and will refer them much more likely since they make more money for them than a small, heavily specialized \"expensive\" agency like us.",
              "score": 2,
              "created_utc": "2026-02-20 14:00:35",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6i4cwc",
          "author": "PenPuzzled8055",
          "text": "Working in real estate / finance / impact, and having worked in art, jewelry , luxury,  the only way is personal relationships. You’ll never get to the inner circles without relationships, recommendations. That per she is not scalable. \nYou’re selling lead gen to wealth management - this might be an area for optimisation - most of their clients come from trusted referrals. Unless I don’t fully see what you’re selling. \nI would look into other target sectors for growth and keep the current one as a stabiliser.",
          "score": 1,
          "created_utc": "2026-02-20 22:16:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6k7kw6",
              "author": "S1lv3rS4rf3r",
              "text": "I just mentioned the niches in the beginning to give examples of conservative niches. We dont sell to wealth management but I rather not dox us by revealing what niche we sell into.",
              "score": 1,
              "created_utc": "2026-02-21 06:21:41",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6gb4wm",
          "author": "brightfff",
          "text": "Your biggest problem may be that your niche isn’t actually a niche. Wealth management and fine art have very little to do with each other and you aren’t able to actually differentiate or develop deep knowledge of your niche because although high end luxury stuff seems similar it is not purchased in anywhere near the same way. \n\nYou need to tighten up and develop some IP within an actual niche.",
          "score": 0,
          "created_utc": "2026-02-20 17:05:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6k65km",
              "author": "S1lv3rS4rf3r",
              "text": "Those were just examples of conservative niches. We only have one dedicated niche, but I didnt mention it on purpose to not dox myself.",
              "score": 0,
              "created_utc": "2026-02-21 06:09:16",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6l56i3",
                  "author": "brightfff",
                  "text": "Ok good. You need to what I said though: develop intellectual property about how your client’s customers buy and use that to attract leads. This can be owned research, a model that plots your clients against their competitors, things like that. ‘Thought leadership’ is a waste of time. Your IP needs to attract buyers with intent. \n\nMy agency has been doing this for over a decade and it works very well to differentiate us from our competitors. We are in a conservative niche as well and work with both midsized and billion + multinational companies.",
                  "score": 2,
                  "created_utc": "2026-02-21 11:44:44",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6grhwi",
          "author": "eviom_B2BMarketing",
          "text": "Hallo, ja geht uns ähnlich. Wir haben uns rein auf B2B fokussiert. Ich glaube, das aktuell wirklich die Wirtschaft (bei uns zumindest) ein Thema ist. Überzeugen können wir oft mit unseren Referenzen, dazu haben wir noch Case Studys und Co. \nLass uns gern austauschen ☺️",
          "score": 0,
          "created_utc": "2026-02-20 18:20:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6k6cq9",
              "author": "S1lv3rS4rf3r",
              "text": "This seems like a bot comment haha.",
              "score": 1,
              "created_utc": "2026-02-21 06:10:57",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6k6jvx",
                  "author": "eviom_B2BMarketing",
                  "text": "Nett, danke 😂\nWieso eröffnest du denn eine Frage, nur um dann so zu kommentieren?",
                  "score": 0,
                  "created_utc": "2026-02-21 06:12:42",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6qj18y",
          "author": "[deleted]",
          "text": "[deleted]",
          "score": 0,
          "created_utc": "2026-02-22 07:29:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6qkiyt",
              "author": "S1lv3rS4rf3r",
              "text": "Damn, another bot comment. No thank you.",
              "score": 1,
              "created_utc": "2026-02-22 07:43:11",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6qkrb8",
                  "author": "[deleted]",
                  "text": "[deleted]",
                  "score": 0,
                  "created_utc": "2026-02-22 07:45:24",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6xbbpk",
          "author": "Big-Percentage4674",
          "text": "organic marketing.",
          "score": 0,
          "created_utc": "2026-02-23 09:26:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6xf2l4",
          "author": "Chance-Tower-7926",
          "text": "For the type of client you're targeting it's all about super specific relationships. Cultivating relationships across the industry, without pitching so when they are in need it's you they think of. The buying cycle in niche high value industries is much longer than for lower value so it's all about the long game.",
          "score": 0,
          "created_utc": "2026-02-23 10:03:15",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r954f5",
      "title": "ChatGPT ads are live (sort of). Here's what B2B marketers actually need to know.",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1r954f5/chatgpt_ads_are_live_sort_of_heres_what_b2b/",
      "author": "stevehetr",
      "created_utc": "2026-02-19 17:17:17",
      "score": 6,
      "num_comments": 5,
      "upvote_ratio": 0.87,
      "text": "Scroll to the end for a TL;DR\n\nWe were asked a variant of the question, \"ChatGPT is making ads why aren't we doing this?\"\n\nSo, we did some digging, here's what we found:\n\nChatGPT ads are live (sort of). Here's what B2B marketers actually need to know.\n\nSome quick background to assure you guys we know what we're talking about: We run a B2B agency name **Obility**, that handles paid search, paid social, SEO, and GEO for tech and SaaS companies. We've been doing it for a hair over 15 years now.\n\nSo, \"can we run ads in ChatGPT?\"\n\nThe short answer is no. Not yet. And probably not for a while if you're in B2B.\n\nWe wanted to lay out what's actually happening, what it means for B2B, and what's worth doing instead.\n\nWhat's actually happening with ChatGPT ads:\n\nOpenAI started testing ads in the U.S. on February 9, 2026. Here's how it works:\n\n\\- Ads have started showing up for logged-in users on the Free and Go ($8/month) tiers\n\n\\- Plus, Pro, Business, Enterprise, and Education users don't see any ads for now\n\n\\- Ads appear as labeled sponsored boxes at the bottom of ChatGPT's responses, not inside the answer itself\n\n\\- OpenAI says ads do not influence what ChatGPT tells you\n\n\\- The pricing model is impression-based, not CPC\n\nThis is a closed, invite-only pilot. OpenAI is calling it the Ad Pilot Program. The companies in it so far are large:\n\n\\- Adobe is testing ads for Acrobat Studio and Firefly\n\n\\- Omnicom secured placements for over 30 of its clients\n\n\\- WPP is involved as an agency partner\n\nThe reported minimum commitment for the beta is $200,000. There's no self-serve platform. No way to just log in and set up a campaign. If you don't have a direct relationship with OpenAI or one of the pilot agencies, you're not getting in right now.\n\nIt seems to be serious about privacy and restrictions issues\n\nOpenAI set some hard boundaries around targeting and data:\n\n\\- Targeting is contextual, based on conversation topic only\n\n\\- Advertisers don't get access to chat history, memories, or personal details\n\n\\- They only receive aggregate data (views, clicks)\n\n\\- Ads are blocked from conversations about health, mental health, politics, and other sensitive topics\n\n\\- Users under 18 won't see ads\n\n\\- Free tier users can opt out of ads, but doing so reduces their daily message limit\n\nThis doesn't matter for most B2B companies yet\n\nThe format is built mostly for consumer use cases right now. The examples OpenAI has shown are:\n\n\\- Someone asks about trips to Santa Fe, sees an ad for a cottage rental\n\n\\- Someone asks about hiking boots, sees a shopping suggestion\n\n\\- Someone asks about dinner party recipes, sees an ad for hot sauce\n\nThat's all B2C.\n\nYou guys know B2B buying doesn't work that way. A few reasons:\n\n\\- Your prospects aren't querying ChatGPT \"which ERP system should I buy?\" and then clicking an ad\n\n\\- B2B purchase cycles involve multiple stakeholders and long evaluation periods\n\n\\- The users seeing ads are on Free and Go tiers, which skews younger (18-34) and more price-conscious\n\n\\- The decision-makers evaluating enterprise software are more likely on paid, ad-free plans\n\nPlus we aren't sure there is a willingness in B2B clients to spend $200K on a test budget for a platform with no self-serve option.\n\nNone of this means ChatGPT ads will never matter for B2B. OpenAI has said they'll expand the program with new formats and buying models over time. A self-serve platform is expected sometime in 2027. So, we have time.\n\nWhat B2B companies should actually focus on right now\n\nIf you or your prospects want to show up in ChatGPT (or any other LLM), the way to do it is is through Generative Engine Optimization (GEO or Answer Engine Optimization if you will).\n\nIn case anyone reading doesn't know, GEO is the practice of making your brand and content more likely to appear in AI-generated responses. It's not the same as SEO, though there's overlap. Most AI search engines pull heavily from top-ranking organic results, so the two work together (we can talk more about that in the comments, we've a lot of experience there).\n\nHere's what we know works:\n\nGet your product data into Reddit conversations, major directories and merchant feeds. LLMs (not exclusively ChatGPT) pulls from these when generating answers. If you are currently in conversations, you will show up.\n\nPublish content that directly answers buyer questions. Not vague no blatantly AI-generated thought leadership. Real, detailed answers to things people type into AI tools:\n\n\\- \"What's the difference between X and Y?\"\n\n\\- \"How much does Z typically cost?\"\n\n\\- \"What should I look for in a \\[category\\] vendor?\"\n\nGet mentioned in third-party sources. AI models weigh information from multiple independent sources more than a single brand's own claims. Reviews, comparison articles, analyst coverage, and earned media all feed into how these systems rank and present information.\n\nOrganize your content clearly. AI models parse well-organized content better than walls of text. Use descriptive headings. Define your terms. Make information easy to extract.\n\nTrack your AI visibility. Monitor whether your brand shows up in AI overviews and AI search engine results. Track which queries surface your content and which don't. Treat it like you'd treat keyword rankings in traditional SEO, because that's what it is now.\n\nIt doesn't have the turnaround time of a paid channel, but it is a viable content and visibility strategy. And for B2B right now, it matters far more than trying to buy into an ad platform that's designed around consumer shopping queries.\n\nThe Big Picture (as of today)\n\nWe're seeing people treat ChatGPT ads like they're going to replace Google Ads. We've seen projections by analysts proposing that OpenAI's ad business could hit $25 billion in annual revenue by 2030, and we've seen some people publish long strategy guides about conversation funnel bidding and contextual intent targeting.\n\nSome of that will probably come true eventually. but it is hypothetical at this point, here's what we are able to surmise from OpenAI's published papers is that:\n\n\\- The platform is in a closed beta with a handful of large advertisers\n\n\\- The targeting is basic\n\n\\- The format is simple\n\n\\- The measurement infrastructure barely exists\n\n\\- The whole thing is built around consumer intent patterns\n\nIf you're in B2B and your boss or client is asking about ChatGPT ads, the honest advice is to save the budget. Put it into making sure your brand shows up in AI-generated answers organically.\n\nThe paid side will come. When it does, companies that already have strong organic AI visibility will be in a much better position to run ads in that environment than companies starting from zero.\n\n\\---\n\nTL;DR\n\n\\- ChatGPT ads launched as a U.S.-only, invite-only beta on February 9, 2026\n\n\\- Only Free and Go tier users see ads. Paid plan users don't.\n\n\\- Minimum commitment is reportedly $200K. No self-serve platform.\n\n\\- The format is built around consumer use cases: shopping, travel, local services\n\n\\- B2B companies can't buy in right now, and the format doesn't fit B2B buying patterns anyway\n\n\\- What B2B should focus on instead: GEO. Make your brand visible in AI-generated answers through content, structured data, and third-party mentions.\n\n\\- The paid opportunity will come. Building organic AI visibility now is what actually matters",
      "is_original_content": false,
      "link_flair_text": "News",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1r954f5/chatgpt_ads_are_live_sort_of_heres_what_b2b/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o69tnmf",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-19 17:17:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o69y11h",
          "author": "BodybuilderHorror718",
          "text": "Good recap of what's going on. ChatGPT ads doesn't seem like a b2b play yet, it's more b2c. And $200k investment? I'll put my ad dollars elsewhere for now",
          "score": 1,
          "created_utc": "2026-02-19 17:38:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6am1l3",
              "author": "stevehetr",
              "text": "Thank you,   \n  \nalso, unrelated: love the username! ",
              "score": 1,
              "created_utc": "2026-02-19 19:31:45",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6cekzh",
          "author": "Jamin_Hekle",
          "text": "ChatGPT ads are interesting but pricey and unproven for niche B2B like crypto—I've had way better luck with Victoria Olsina's LLM SEO tactics that got our project cited in organic responses. Her free resources on YouTube nailed the frameworks without the ad spend guesswork.",
          "score": 1,
          "created_utc": "2026-02-20 01:13:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6dubug",
          "author": "New_Grape7181",
          "text": "I've been thinking about this a lot lately. The consumer vs B2B distinction you've made is spot on.  \n  \nThe thing that worries me about waiting for self-serve in 2027 is that by then, buying behaviour will have already shifted. People aren't using ChatGPT to compare vendors yet, but they're absolutely using it to research problems, understand terminology, and build their shortlists before they ever hit a demo request form.  \n  \nYour GEO advice is solid. I'd add one thing though: video content seems to get indexed and referenced more than most people realise. We've had snippets from webinars and product walkthroughs show up in AI-generated answers when the equivalent blog post didn't. The transcript makes it easy to parse, and if it's hosted somewhere public (YouTube, LinkedIn), it gets picked up.  \n  \nThe Reddit point is interesting too. I've noticed ChatGPT will sometimes cite \"discussions on Reddit\" when answering software comparison questions. Not linking directly, just using it as source material.  \n  \nHave you seen any patterns yet in which types of B2B content get surfaced most consistently in AI responses?",
          "score": 1,
          "created_utc": "2026-02-20 07:23:46",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}