{
  "metadata": {
    "last_updated": "2026-01-27 16:59:04",
    "time_filter": "week",
    "subreddit": "b2bmarketing",
    "total_items": 20,
    "total_comments": 312,
    "file_size_bytes": 286906
  },
  "items": [
    {
      "id": "1qi7inr",
      "title": "The best B2B marketing teams I work with are ruthless about focus",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qi7inr/the_best_b2b_marketing_teams_i_work_with_are/",
      "author": "Adept_Masterpiece777",
      "created_utc": "2026-01-20 17:32:10",
      "score": 67,
      "num_comments": 21,
      "upvote_ratio": 1.0,
      "text": "Working with clients across B2B, the biggest difference I see between teams that feel calm and teams that feel overwhelmed isn’t budget or tools, it’s focus. The strongest teams are very intentional about where human effort goes. They don’t try to deeply analyze everything. They use systems to handle the background work and save their thinking time for positioning, messaging, and decisions that actually move the needle.\n\nOn a lot of accounts, the messy part isn’t creativity, it’s the in-between work. Research, list cleanup, checking whether accounts are still relevant, keeping data in sync. When that layer is handled cleanly, clients are able to spend more time on strategy instead of maintenance. I’ve seen teams use tools like Clay for research and signals, HubSpot as the source of truth, and Notion to keep plans visible. The exact stack varies, but the mindset stays the same.\n\nThe pattern that keeps showing up is this: the better the focus, the less the team feels the need to overbuild process. They automate the boring parts, stay thoughtful about the rest, and move faster without feeling rushed.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qi7inr/the_best_b2b_marketing_teams_i_work_with_are/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o0p97an",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-20 17:32:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0pxted",
          "author": "NervousObjective9280",
          "text": "I mostly agree, but I think focus is sometimes the *result* of clarity, not the cause.\n\nI’ve seen teams automate a ton and still feel overwhelmed because they never aligned on what actually mattered. They had systems everywhere, but no shared conviction on positioning or priorities, so every signal felt urgent.\n\nWhere it really clicked wasn’t just automating the in between work, but first deciding what problems were worth thinking about at all. Once that was clear, the tools helped. Without it, even a clean stack just makes the noise move faster.",
          "score": 10,
          "created_utc": "2026-01-20 19:23:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0rd6t8",
              "author": "Euphoric-View-9876",
              "text": "This is a really good distinction. Ive seen the same thing teams automate themselves into being busy faster, not clearer. What helped in practice was being ruthless about which signals even get surfaced to humans in the first place. When you narrow inputs to things that show real intent or change (actual conversations, shifts in behavior, explicit pain), focus becomes a byproduct. Without that filter, every dashboard just creates another false “priority.”",
              "score": 2,
              "created_utc": "2026-01-20 23:29:53",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o0s8i63",
              "author": "yngbld5",
              "text": "Agree. Clarity enables focus",
              "score": 2,
              "created_utc": "2026-01-21 02:24:53",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o0zqdyp",
              "author": "_forgotmyownname",
              "text": "That’s fair. Without clarity, focus just turns into faster confusion.",
              "score": 1,
              "created_utc": "2026-01-22 04:42:48",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o13waps",
              "author": "theguywhobuilds",
              "text": "Fair point, and I think we’re mostly saying the same thing from different angles.\n\nFocus doesn’t come from discipline alone  it comes from knowing what actually matters, but once that clarity exists the teams that win are the ones that can hold that focus and not get pulled into every new signal or tool.\n\nI’ve seen things fall apart is when clarity is there but execution keeps drifting, or when tools start driving priorities instead of the other way around. Clarity sets direction, focus keeps it from unraveling.",
              "score": 1,
              "created_utc": "2026-01-22 20:01:44",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0t1fvn",
          "author": "signalpath_mapper",
          "text": "This matches what I’ve seen too. Teams usually aren’t drowning because of bad ideas, they’re drowning because attention is spread across too many half important tasks.\n\nWhen the background work is predictable and boring by design, people can actually think. The calm teams tend to say no more often and don’t feel the need to optimize every tiny thing. Focus does more than any new tool.",
          "score": 1,
          "created_utc": "2026-01-21 05:28:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0t44q9",
          "author": "signal_loops",
          "text": "the teams that look ahead aren’t necessarily smarter or better funded, they’re just disciplined about where attention goes. they accept that not everything deserves deep analysis and they design systems to quietly handle the repetitive, error prone work so humans can stay focused on positioning, narrative, and decision making. once research, data hygiene, and account relevance are mostly automated or at least standardized, strategy stops feeling like a luxury and starts becoming the default. the interesting part is that focus actually reduces process bloat when priorities are clear, teams don’t feel the urge to layer on more tools or meetings to compensate.",
          "score": 1,
          "created_utc": "2026-01-21 05:48:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0tbupf",
          "author": "deep_singh3106",
          "text": "I would argue that focus comes from constraints as well. Some of the best teams that I have seen deliberately limit what the system is allowed to surface even if it means missing some signals because constant optionality creates anxiety. When everything is technically visible, nothing feels sage ignore. Designing systems that intentionally hide 80% of the noise can feel risky at first, but that's usually where real leverage shows up.",
          "score": 1,
          "created_utc": "2026-01-21 06:52:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0trp55",
          "author": "Sea-Environment-5938",
          "text": "This is so real. Most \"marketing chaos\" is just attention fragmentation dressed up as process. The calm teams usually have 2-3 priorities and say no to everything else.",
          "score": 1,
          "created_utc": "2026-01-21 09:20:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0uji6m",
          "author": "SilentUniversity1304",
          "text": "I see this all the time. Focus does more for speed than any new tool. When teams are clear on what matters, they stop overprocessing and actually move.",
          "score": 1,
          "created_utc": "2026-01-21 13:04:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0uyhck",
          "author": "ActivitySmooth8847",
          "text": "Totally agree that automating the boring stuff frees up brainpower for strategy.",
          "score": 1,
          "created_utc": "2026-01-21 14:27:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0x05qv",
          "author": "TNT-Rick",
          "text": "This feels like an ad...",
          "score": 1,
          "created_utc": "2026-01-21 20:01:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0zqa9y",
          "author": "_forgotmyownname",
          "text": "This tracks. Focus beats tools every time. Most overwhelm comes from trying to care about everything.",
          "score": 1,
          "created_utc": "2026-01-22 04:42:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o13p5bq",
          "author": "theguywhobuilds",
          "text": "That’s been my experience too. The best teams arent chasing every new tactic, they’re aligned on why they’re doing something and who its actually for.\n\nWhen product, sales, and marketing agree on the problem they’re solving and the language they use to explain it, execution gets simpler and results compound. When that alignment is missing, even good tactics look random and underperform.\n\nStrong teams feel boring from the outside because they repeat the same message consistently, but that consistency is usually the reason they win.",
          "score": 1,
          "created_utc": "2026-01-22 19:29:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o16t96q",
          "author": "KissyyyDoll",
          "text": "Automating repetitive tasks and centralizing data frees cognitive bandwidth for strategic work. Teams that enforce this focus show higher output velocity and lower operational friction, regardless of the tech stack.",
          "score": 1,
          "created_utc": "2026-01-23 05:33:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1fc3lr",
          "author": "AzemaGlitch",
          "text": "Agree. They know what success looks like and don’t take moral victories about stuff that doesn’t really matter.",
          "score": 1,
          "created_utc": "2026-01-24 13:55:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1jcae2",
          "author": "New_Grape7181",
          "text": "I've noticed the same thing. The teams that seem to have their act together aren't doing more, they're doing less but with way more intention.  \n  \nOne thing that helped us was splitting work into \"decide once\" and \"decide often\" buckets. Decide once means automating it or documenting the process so tightly that nobody has to think about it again. List hygiene, signal tracking, basic qualification criteria, that stuff shouldn't need a meeting every week.  \n  \nThe decide often bucket is where the actual brain power goes. Messaging angles, which accounts to prioritise this quarter, what content to create. That's where the differentiation happens.  \n  \nWe used to spend hours manually researching accounts and prepping outreach. Now we've automated most of the research layer, which frees up time to actually personalise the message in a way that matters. The hard part was trusting the system enough to let go of the manual checks.  \n  \nWhat's been the biggest time sink for your clients before they get this sorted?",
          "score": 1,
          "created_utc": "2026-01-25 01:28:44",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qj0ds3",
      "title": "2-3k/mo budget for LinkedIn ads even worth it?",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qj0ds3/23kmo_budget_for_linkedin_ads_even_worth_it/",
      "author": "Ok_Secretary4782",
      "created_utc": "2026-01-21 15:09:35",
      "score": 41,
      "num_comments": 77,
      "upvote_ratio": 1.0,
      "text": "We're a super small bootstrapped AI b2b saas startup. We have a proven product and great social proof from our mid-market customers, but we're just struggling to find a repeatable channel.\n\nI've dabbled in Google search ads with little to no success. I always turn them off after a few hundred bucks because they typically drive junk traffic (despite turning off display network and setting location to US only). I am not a Google ads expert and don't have the budget to hire one, so I basically decided to stop trying there.\n\nLinkedIn ads feel far less complicated, and the audience targeting makes logical sense if you've used sales navigator or just spend a lot of time on linkedin.\n\nI'm committing \\~$1.5k to a week long thought leader ad experiment (our biggest issue is that our ideal customer doesn't know we exist).\n\nWill this level of spend move the needle?",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qj0ds3/23kmo_budget_for_linkedin_ads_even_worth_it/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o0v6xtc",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-21 15:09:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0v8ojw",
          "author": "cornelmanu",
          "text": "Short answer: $1.5k will not “move the needle” in terms of revenue. But it can still be useful if you set the right goal.\n\nA few straight points:\n\n1. This is not a channel problem yet. If Google ads brought junk traffic and LinkedIn feels easier, the real issue is probably messaging and ICP clarity, not the platform. Paid just amplifies what already works.\n2. Thought leader ads = learning, not pipeline. With $1.5k over a week, expect signals, not demos. You are testing awareness and message resonance, not demand. Judge success by comments, profile visits, and DMs, not conversions.\n3. Ads only work after messaging is proven. The best LinkedIn ads come from posts and DMs that already get replies organically. If you have not validated that yet, ads will feel random.\n4. This is where fractional makes sense. You are too early to hire a paid ads specialist, but too far along to guess. A fractional growth setup focuses on ICP, messaging, organic validation, then turns on paid as a multiplier, not a gamble. That is exactly how I work with bootstrapped B2B SaaS teams.\n\nIf you want a quick sanity check, share your ICP and deal size and I can tell you if this test is worth running or better paused.",
          "score": 15,
          "created_utc": "2026-01-21 15:17:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o10k0p1",
              "author": "nopaxx2k",
              "text": "this one of the smartest things ive ever read in the ppc jungle",
              "score": 3,
              "created_utc": "2026-01-22 08:45:49",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o17dnej",
              "author": "Ceylen_White",
              "text": "Professional feedback, learn a lot",
              "score": 2,
              "created_utc": "2026-01-23 08:22:32",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o0v9x3u",
              "author": "Ok_Secretary4782",
              "text": "This is great feedback. I appreciate it. Mind if I shoot you a DM?",
              "score": 1,
              "created_utc": "2026-01-21 15:23:39",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0vaeb8",
                  "author": "cornelmanu",
                  "text": "Sure",
                  "score": 1,
                  "created_utc": "2026-01-21 15:25:54",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o15h23p",
                  "author": "ActionOverThoughts",
                  "text": "We also want answer here. If you can leave the private details, would appreciate for the learning!",
                  "score": 1,
                  "created_utc": "2026-01-23 00:47:33",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0vl7jy",
          "author": "ArtemLocal",
          "text": "$1.5k won’t prove a channel, but it can tell you if you’re directionally right or completely wrong. Thought leader ads are awareness, not demand capture. Expect impressions, profile views, maybe some site traffic. Not pipeline in a week. If you judge it on leads, you’ll kill it too early like Google. The bigger risk is message, not platform. If the ICP doesn’t already feel the pain when they see the ad, targeting won’t save it. With mid market proof, I’d care less about CTR and more about whether the right people start engaging repeatedly over a few weeks. What specific action would tell you this is worth continuing after the test?",
          "score": 2,
          "created_utc": "2026-01-21 16:14:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1d9dc1",
              "author": "kindie123",
              "text": "Check ",
              "score": 1,
              "created_utc": "2026-01-24 03:57:49",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0w3511",
          "author": "likethestonx",
          "text": "I'd take an organic approach to LI first, gather some data on what works, and go from there.\n\nIn the past I used an organic + ads specialist who showed me how to run both simultaneously, as well as the power of organic only with a hypertargeted campign. \n\nHappy to DM you their contact info.",
          "score": 2,
          "created_utc": "2026-01-21 17:35:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0x2ttw",
              "author": "Minute-Nose9876",
              "text": "Totally agree – with some clever hooks, it's still possible to get seen organically (and rather fast too).",
              "score": 2,
              "created_utc": "2026-01-21 20:14:02",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o11z5br",
              "author": "Ok_Secretary4782",
              "text": "I am trying but it appears the algorithm despises my account. I was at least getting a few likes and comments here and there but now it looks like my posts are genuinely getting no visibility. I guess I just need to keep trying.",
              "score": 2,
              "created_utc": "2026-01-22 14:48:04",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o122el0",
                  "author": "likethestonx",
                  "text": "What worked for me was focusing on 4 things that needed to be in alignment before even thinking about content. \n\nProfile,\nAudience,\nEngagement,\nMessaging.",
                  "score": 1,
                  "created_utc": "2026-01-22 15:03:56",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o0w3mua",
              "author": "likethestonx",
              "text": "Oh, forgot to mention. Yes, 1.5k ad spend is too much at first.",
              "score": 1,
              "created_utc": "2026-01-21 17:37:35",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o11zbof",
                  "author": "Ok_Secretary4782",
                  "text": "I will likely kill it early. Performance is good (CPM, CPC), not clear it is driving anything meaningful at all. but it also super early - only on day 2.",
                  "score": 1,
                  "created_utc": "2026-01-22 14:48:56",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            },
            {
              "id": "o10hm7b",
              "author": "Stunning-Bad-5805",
              "text": "That sounds smart I always find starting organic first saves so much headache later",
              "score": 1,
              "created_utc": "2026-01-22 08:23:08",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o10i5od",
              "author": "Just-Fennel8301",
              "text": "How would you take organic approach?",
              "score": 1,
              "created_utc": "2026-01-22 08:28:17",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0xig19",
          "author": "Kamel_Ben_Yacoub",
          "text": "B2B sales cycles typically take 2–6 months from first contact to a closed deal, so a one-week ad campaign even with $1.5k would likely be a waste of money. This amount should be the minimum spend for a full month, and you will need to maintain that effort for several months to start seeing real results.\n\nHere is what I would do instead:\n\n1. Start with posting organic post to leverage your founder personal  brand (showing more testimonial best practices, teardowns, feature highlights, case studies...)\n2. invest in influencer partnerships that serve your ICP. partner with 10-20 people that post about your tool monthly (long term collaborations, not one offs)\n3. Then boost founder posts ( the most engaging organic post ). + influencers posts via thought leader ads",
          "score": 2,
          "created_utc": "2026-01-21 21:24:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0v8ip5",
          "author": "Responsible-Brick881",
          "text": "Hard to say if it'll move the needle, especially as the CPM's are crazy expensive from what I've seen $150+!!\nHow many people in your company?",
          "score": 1,
          "created_utc": "2026-01-21 15:17:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0v9mbx",
              "author": "Ok_Secretary4782",
              "text": "Very small, 2 people.",
              "score": 1,
              "created_utc": "2026-01-21 15:22:14",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0va2tg",
                  "author": "Responsible-Brick881",
                  "text": "I hear ya... Solopreneur here!! Are you actively pushing out content from your personal pages...stats suggest they're up to 20X more engaging than pushing out from a company page",
                  "score": 2,
                  "created_utc": "2026-01-21 15:24:24",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0vgojx",
          "author": "colombow1",
          "text": "LI ads are crazy expensive as cold outreach channel. I would rather invest the money into lead enrichment tool so that your sales can bug people through DM woth relevant content.\n\nWhat worked for us with lower budgets were gated whitepapers with solid case on solving the issue your product solves. LI now allows form-gated PDFs as medium, gathering contact info for those who download – those translate well to hot leads.",
          "score": 1,
          "created_utc": "2026-01-21 15:54:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0xddig",
              "author": "sanfranciscolady",
              "text": "My b2b agency is about to publish a big (and we think good!) gated whitepaper like this on LinkedIn. We're excited to see how it goes, we've never used this feature before. Any tips on how to position the content, or examples of a successful campaign using gated content?? (TIA if you have any!!!)\n\nAgree with everyone else that founder thought leadership (to reinforce all the messaging) and a great outbound campaign would be smart here. We use a manual list generator in the Phillipines for a few clients to make super enriched, targeted lists for LinkedIn, then we run the outbound program on Alfred. We've used a few others but Alfred is cheap and gets the job done.\n\nALSO- this might be an emporers' new clothes situation here--- but have you tried Reddit? Organic reddit, not paid. IFYKYK.",
              "score": 1,
              "created_utc": "2026-01-21 21:01:45",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0y8m2w",
                  "author": "colombow1",
                  "text": "Some random bits and bobs:\n– We made the whitepaper in neutral visual to enhance the positioning as expert material, not sales material. Keep it honest, do not push commercial CTAs (link to your product where appropriate, though), keep push for sales team\n– We connected the form directly with Hubspot through native integrations to keep it in our funnel mapping\n– It needs to be clearly positioned as concrete answer to a concrete problem (not vague like \"get more leads\") or as a valid research result. Ours was in style of \"Comparison of time spent with methods X and Y for calculating steel connections\", which got enough engineers (our target group) to want to read it in exchange for their e-mail\n– Beware, LI does not automatically store the lead LI url unless you tell it otherwise, it was a pain to search for everyone since we only stored e-mails\n– It brought dozens of leads with CPA ~€15 in multiple regions (EU, Middle East)\n\nIf you need further consultation, I am open to coop :)",
                  "score": 1,
                  "created_utc": "2026-01-21 23:33:32",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0vhntf",
          "author": "kubrador",
          "text": "$2-3k/mo on linkedin won't move the needle if your icp doesn't know you exist. you're basically hoping to build awareness on a platform that charges $15+ per click. that's like 150-200 clicks for your budget with zero guarantee any convert.\n\nyour real problem isn't the channel, it's that you haven't found \\*any\\* repeatable channel yet. before spending on ads, figure out how to get one customer through word of mouth, content, or sales outreach. then scale that. right now you're just lighting money on fire to solve a discovery problem that ads alone won't fix.",
          "score": 1,
          "created_utc": "2026-01-21 15:58:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0vj3hh",
          "author": "BarkingMadJosh",
          "text": "Yes, and sounds like you're doing it the right way - distributing content to plant seeds with ICP versus lead gen.   \n  \nWhat's your audience size and avg. CPM so far? I'll run it through my budget calculator to see what your ideal budget should be. \n\nDo you have Audience Expansion and Audience Network off?  Those waste a ton of money.",
          "score": 1,
          "created_utc": "2026-01-21 16:05:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0vu2bt",
          "author": "noinluence",
          "text": "That budget probably will not directly drive revenue, but it can still be useful if expectations are set right. LinkedIn ads at that spend level work better for visibility and message testing than actual pipeline, especially for a two person team. If the goal is getting the right people familiar with the product and validating which messages land, then it is worth running. It usually helps a lot if founders are also posting organically, since ads tend to perform better when they reinforce content people are already engaging with.",
          "score": 1,
          "created_utc": "2026-01-21 16:54:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0vvl8u",
          "author": "Chupacabra1987",
          "text": "The thing is, google ads isn’t „easy“ to do and a couple 100s isn’t enough to say anything about it. I started 2 years ago from 0 and just a couple months ago it clicked all togetherness lading page, what campaigns, what copy, a lot of A/B testing. If you get everything right there is not much that is more profitable in marketing",
          "score": 1,
          "created_utc": "2026-01-21 17:01:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0wxf9i",
          "author": "sagefrogmarketing",
          "text": "At that spend the goal isn’t conversions, it’s signal. A week and $1.5k can tell you whether the message, ICP, and hook resonate enough to earn attention and engagement. Thought leader ads tend to work best when they validate positioning and spark conversations you can then follow up on manually, not when you expect direct pipeline. If you treat this as a learning sprint (what gets saves, comments, profile visits), it can absolutely move the needle in clarity, even if it doesn’t in revenue yet.   \n  \nAlso Google search ads work best when there's plenty of historical data to work off of so I'd recommend leaving them on, even if the spend is minimal.",
          "score": 1,
          "created_utc": "2026-01-21 19:49:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0x2e1u",
          "author": "kailfarr",
          "text": "I run both Google ads and LinkedIn ads. Google leads are typically lower than LinkedIn leads, with the exception of document ads. Document ads are great on LinkedIn, but you really need to know who your customer is by title and industry. The document also needs to be compelling for the user to want to download. For Google ads, you need to give the system a lot of information, for example, are your conversion pixels setup properly? Are you passing information for offline conversions back to Google? You can get help with setting this up via AI. Claude is a great option and can walk you through it. Google needs to have about 7-14 days to learn, so if you are strapped for cash, try running one campaign at $40/day. Be very tight with your keywords and don't touch the system for at least a couple of days. You can check out the search terms report and block irrelevant searches. Also, try and modify your bids to remove mobile traffic or at least bid very low for it.",
          "score": 1,
          "created_utc": "2026-01-21 20:12:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0x47pu",
          "author": "shitisrealspecific",
          "text": "They claim audio advertising is better. Maybe try that...",
          "score": 1,
          "created_utc": "2026-01-21 20:20:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0xj1om",
          "author": "romerogers",
          "text": "\\- i would focus on SEO\n\n\\- automate blogs, info hubs etc\n\n\\- create a linkedin posting bot with claude code + opus",
          "score": 1,
          "created_utc": "2026-01-21 21:27:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0xkgwt",
          "author": "carrzo",
          "text": "1. Spend amount is Ok and you should be seeing some data and traction at that level. Remember, pipeline is irrelevant if you're really doing it for awareness - which may sound nice but remember in the end someone will be asking where is the revenue right quick so be ready for awareness vs. pipeline chat.\n2. Immediately turn off any Week 1 ads with some decent impression count compared to the rest, but are below 1% CTR\n3. Keep in mind depending on your spend, timing (weekends turned off or on? That's another thread entirely) geo targeting, titles, etc, even your best ads will fatigue within 10 days or so. You'll start to notice because last week's CTR winner is this week's not so much, especially when impressions per unique tap out at 5+. The catch 22 is the best clicked ads get shown more by the algorithm until people see them 3+ more repeated times and they ignore.\n4. You may be able to turn the best ones back on a few weeks later - or of course with a different targeting set - but know they will decay.\n5. Yes as stated before definitely turn OFF audience expansion no matter what pablum messaging is in the interface encouraging you to do so.\n6. I assume this Phillipines thing is sending you targeting emails that you are uploading as Audiences in Linkedin for specific targeting?\n7. The titles field is powerful for segmentation - know your vertical and understand if Managers have budget or does it start with Director and above.\n8. Again, if it's awareness, any broad targeted clicks by whatever title may work but be ready to push back when asked about ROI and \"where is the Pipeline from all this  spend?\" And in the end it always comes down to it so I'd put the awareness spend at no more than 20% effort.\n9. North star is CTR above 3% - and keep in mid it's all about the visuals as you want people to stop scrolling, especially on their phones.\n10. That said, white papers are great for thought leadership and positioning but depending on your vertical, they attract researchers, students, interns, data analysts, who are all great people but likely don't have huge budget or need to buy your full product, or the internal pull to make it happen. Again, awareness vs. ROI. Case studies work.\n11. And the same whitepaper can be positioned differently for those budget-conscious personas to get their attention.\n12. Pro tip: Mention  \"career,\" \"job,\", \"Your team\", \"falling behind\", \"becoming irrelevant,\" \"getting ahead,\" \"stay updated,\" etc because in the end it's a career preservation social platform. Good luck and keep us posted.\n\n(Edited for numbering)",
          "score": 1,
          "created_utc": "2026-01-21 21:34:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0xum66",
          "author": "MontrealKyiv4477",
          "text": "Ads are working only if you know what you want to achieve by running them. Google ads can drive traffic and boost your online presence especially if you run ads for branded queries or against competitor brand names. Then it’s up to your site and technics you are using to convert that traffic - depending on your product, business model and sales cycle. That could be trials, gated content, optimised content assets, etc. Now on LinkedIn you can run ads within the platform and if leadgen is your target - use document ads under LinkedIn forms to generate prospects and then work with them to nurture to conversion. 1.5-2k a months for LinkedIn ads is a sufficient budget. With cpl around 3 dollars you can generate a good list of prospects to work with.",
          "score": 1,
          "created_utc": "2026-01-21 22:21:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0y7zxo",
          "author": "blawblahh",
          "text": "I'd rather focus on curated outreach rather than paid ads.",
          "score": 1,
          "created_utc": "2026-01-21 23:30:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0yhfng",
          "author": "Aly_sherif",
          "text": "I’m a marketer and ads specialist so let me tell you what i know from experience… \nTo understand the reasons for the results you are getting you basically need to go to the customer’s journey, so if the customer is searching for something specific he will search on google, an ad could be useful to get in front of him but this customer will see multiple websites like yours then he will be looking somewhere else to validate the choices he will make. \n\nBut what if he knows a one of these choices before this search process? What makes sense is that he will need less validation and more likely to get to the next step faster whether to book a call or to subscribe. \n\nBased on my experience with an AI b2b startup, companies like these needs to deploy itself somewhere and build a strong presence utilizing content and communication with its target audience to get a better chance communicating with the same audience else where …. So choosing LinkedIn could be a better solution at your stage for sure. \n\nBut you won’t be able to get ROI from sales focused ads right now, what you need to focus on is choosing a specific segment of audience (an industry or a specific job title) and start boosting content that delivers your message to them, raise their awareness about your existence and raise the brand recognition. This is called top of the funnel (TOFU) \n\nAfterwards, you can create sales ads for this segment, but when you do you will be sure that you have built your presence and that your target audience are recognizing you, so you get a better chance in communication with them (middle of the funnel), and then you close them through sales efforts. \n\nI hope my comment was helpful, and if you need any further information from me or have any questions feel free to message me directly.",
          "score": 1,
          "created_utc": "2026-01-22 00:21:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0zcbp4",
              "author": "Bubbly-Tangerine-284",
              "text": "Second all at. ICP definition is crucial but none of that really matters if you aren’t prepped and in the right space.",
              "score": 2,
              "created_utc": "2026-01-22 03:14:32",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o10msk0",
                  "author": "Aly_sherif",
                  "text": "That’s for sure, if you don’t have a clear ICP you won’t have a target audience to focus on",
                  "score": 1,
                  "created_utc": "2026-01-22 09:11:46",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0yucyt",
          "author": "ConnorSol",
          "text": "Ads for retargeting your outreach efforts",
          "score": 1,
          "created_utc": "2026-01-22 01:32:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0z897e",
          "author": "signalpath_mapper",
          "text": "At that spend, I’d calibrate expectations hard. LinkedIn will get you targeted eyeballs, but $2–3k/month usually buys learning, not results. Where I’ve seen it help is clarity, which message gets ignored, which title clicks, which segment doesn’t care at all. If you treat it as a fast feedback loop instead of a growth channel, it can be worth it. If you expect pipeline, you’ll probably be disappointed.",
          "score": 1,
          "created_utc": "2026-01-22 02:51:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0zqy8r",
          "author": "Hardheadedsoftskills",
          "text": "It’s enough to get results. The quality and quantity of your creative is important though. DM if you want help there.",
          "score": 1,
          "created_utc": "2026-01-22 04:46:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0zvc9i",
          "author": "QuantumWolf99",
          "text": "Nope.",
          "score": 1,
          "created_utc": "2026-01-22 05:17:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o109ook",
          "author": "Amulyakumarr",
          "text": "I think you should start organically (Cold Emails, SEO Strength, Link Building), find your target audience, and then commit to paid ads.",
          "score": 1,
          "created_utc": "2026-01-22 07:11:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o10ogj9",
          "author": "Dutchmany",
          "text": "I create a list of several thousand potential customers and then advertise to them on LI, Google display, and Meta. LI is likely the most expensive. Focus on customer problems, not your product. \n\nThen after a  month, when you have some brand awareness, have sales start to do outreach to them. Combine this with other channels: organic posts, webinars, etc. Combined they can move the needle.",
          "score": 1,
          "created_utc": "2026-01-22 09:27:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1d9tex",
              "author": "kindie123",
              "text": "Hey I texted",
              "score": 1,
              "created_utc": "2026-01-24 04:00:40",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o10usll",
          "author": "Fred-swe",
          "text": "The budget mus be put in relation to the audience you try to reach. Do you taget 500 named accounts or 50.000?",
          "score": 1,
          "created_utc": "2026-01-22 10:26:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o11gghc",
          "author": "Only_Performer9165",
          "text": "Hi,\n\nGuess the challenge is everywhere. I have been prudent about spending money on ads and if you are not skilled enough , the organic reach will not be  helpful either. I am a new startup(cybersecurity risk and compliance) and  new to business. A sole soldier battling and still struggling to get that very first client. The challenge for me has not been the market but the awareness in this area.  \n\n I am trying to do the following, not sure if it would work, but there is no harm in trying. \n\n1. Insert SEO keywords on to your company page (For Inbound traffic). Try google or chatgpt to get some idea\n\n2. Try to attend online and offline events including pitch events across your city where you get connects\n\n3. Try referrals. \n\n4.  Having the right mentor to guide you. Trust me this is helping me a lot. \n\n\\- Cheers",
          "score": 1,
          "created_utc": "2026-01-22 13:08:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o132sf6",
          "author": "nirvanababes",
          "text": "Start with content ( how to content, that solve users search and the pain point , you don’t necessarily have to go after the whole market \nTake out a micro niche and then solve their problems effect \nTo create awareness \nYou could create content via your company blogs \nLinkedIn thought leadership as well \nOrganic may take awhile \nBut it will give you the best ROI",
          "score": 1,
          "created_utc": "2026-01-22 17:50:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1396qs",
          "author": "sculptsocial",
          "text": "Let's fast forward. It's you, a week older (and wiser). The ads are off, the budget is spent. The results are in:\n\nYou spent $1500. You reached 6,818 people in your ICP ($220 CPM), and drove 375 engagements at a $4 CPE (clicks, reactions). You go back to your question. \"Did it move the needle?\"\n\nThis is the situation you want to avoid. Not because that's necessarily good or bad. But because you have nothing to compare to in order to understand it.\n\nIf you want better insights from your experiment, make sure you're amplifying multiple TL ads, each with a distinct angle (framing). Rather than test small elements, or major ones like audience targeting, focus on how you're presenting your value proposition overall.\n\nThe idea being you won't just learn WHAT LinkedIn brought for $1500 worth of exposure from your ICP, but also WHICH messaging angle resonates.\n\nThat way it's not just \"how many clicks did we get in a week vs. what we hoped\" but \"which message angle/offer actually performed better based on reactions or click efficiency.\n\nHelpful?",
          "score": 1,
          "created_utc": "2026-01-22 18:18:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1da9cx",
              "author": "kindie123",
              "text": "Check",
              "score": 1,
              "created_utc": "2026-01-24 04:03:33",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1wu53f",
                  "author": "sculptsocial",
                  "text": "Mate",
                  "score": 1,
                  "created_utc": "2026-01-26 22:55:34",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1561mz",
          "author": "hkg2jfk",
          "text": "I‘d go retargeting only - this is just my 2ct after years of experience and working with +10 of the leading US LinkedIn agencies! They make it sound like it‘s the holy grail but almost no account I‘ve seen was able to buy cold traffic, profitably, on LinkedIn. Like other members here said, it‘s all about expectations. Hope this helps",
          "score": 1,
          "created_utc": "2026-01-22 23:49:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o16s83s",
          "author": "alexboyd08",
          "text": "Well did you use PMax on Google ads…? That’s prob why you got Google display junk",
          "score": 1,
          "created_utc": "2026-01-23 05:25:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o18124m",
          "author": "Hopeful-Candle-8442",
          "text": "I’ve been there—bootstrapped, great product, but the channel hunt feels like throwing darts blindfolded. LinkedIn’s targeting \\*can\\* work for B2B, but your $1.5k test might burn fast if you’re not hyper-specific. Try running 3-5 variations of the same ad (different hooks/visuals) to see what resonates, then double down on the winner. Have you tested any organic LinkedIn content first to validate messaging?",
          "score": 1,
          "created_utc": "2026-01-23 11:49:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o197gjt",
          "author": "Dismal_Cartoonist_45",
          "text": "You can get qualified inbound leads when you're posting content on LinkedIn intentionally with that price that you just spend on ads.",
          "score": 1,
          "created_utc": "2026-01-23 15:44:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1bifz5",
              "author": "likethestonx",
              "text": "Definitely. Just don't tell an agency about your current budget.",
              "score": 1,
              "created_utc": "2026-01-23 22:06:24",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1d4a8j",
          "author": "mada299",
          "text": "I think this is worth it if you use it to promote posts of you leaders or employees that are already getting organic traction, vs regular ads.",
          "score": 1,
          "created_utc": "2026-01-24 03:26:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1d5ivc",
          "author": "Analytics-Maken",
          "text": "A small budget on LinkedIn ads delivers impressions and clicks, but leaves you guessing which signals matter, especially alongside Google Ads. You can use ETL tools like Windsor.ai to centralize both sources into one dashboard to monitor test performance and resolve the question.",
          "score": 1,
          "created_utc": "2026-01-24 03:33:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1enoim",
          "author": "weoter",
          "text": "Ask yourself what is my goal? Early stage startups are usually about lead generation so how many leads do you want to get for this to be successful. Consider a cost per lead of at least a few hundred dollars if not more in developed countries. You pay a premium with LinkedIn for the B2B targeting so cost per lead is significantly higher with lower intent",
          "score": 1,
          "created_utc": "2026-01-24 10:53:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1m22bm",
          "author": "Jo-callaway",
          "text": "100% worth it, only if you do it write.\n\nIn a nutshell, LinkedIn performs best when you boost a post that is already performing well and also when you use it for retargeting your page visitors and other types of engagements.\n\nFor cold audience, specially if you’re not 100% confident with LD targeting : not so much",
          "score": 1,
          "created_utc": "2026-01-25 13:14:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1me31m",
          "author": "cedarconsultants",
          "text": "This is great",
          "score": 1,
          "created_utc": "2026-01-25 14:23:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1mx3g2",
          "author": "vikasdwg",
          "text": "I think the problem is not about the platform. Even you can get the right people on Meta ads also. You need to define your target audience in a right way. \n\nAll platforms have its own individual way to target same kind of audience or you can say the same user on different platforms. \n\n1. Try to find your best business keywords not a large amount even only 5 to 10 keywords would work for you. \n\n2. If you want to go linkedin try to publish leadership and problem solving content around your product and try to make personal connections with your target audience.\n\n3. Make a highly customized website with 0% fluffy content precise to your problem solving features. Do SEO on that. This will be the cherry on top for your product to get awareness towards your brand. \n\nI have done this same pattern for our B2B clients and this worked.",
          "score": 1,
          "created_utc": "2026-01-25 15:56:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1sivfu",
          "author": "Far_Competition_8269",
          "text": "Je n'ai pas l'info à proprement parlé sur la pub LinkedIn, je suis moi-même en cours de test. Néanmoins, la pub LinkedIn fait partie d'une strat plus globale sur LinkedIn, et il faut, je pense, prendre du recul pour avoir la big picture. \n\nGlobalement, combiné pub LinkedIn + post LinkedIn sur long-terme ça va te permettre d'éduquer et de devenir top of mind dans la tête de tes prospects. \n\nIl faut donc déterminer le bon message, et le martelé sur tes posts LinkedIn. Le mieux c'est que l'ensemble de ta team participe à cela. Plus vous publierez à ce sujet, plus vous construirez une \"communauté\" autour de ce message. Une fois que tu as une bonne base, tu peux ensuite mettre un petit budget pub pour booster certaine publication. \n\nEx concret : tu fais deux trois vidéos qui expliquent ton produit, ton positionnement etc.. Quand une vidéo fait quelques centaines de vues (assez simple d'atteindre ce stade sur LinkedIn), tu viens la booster pour continuer sa progression. \n\nC'est ce genre de vidéo, avec un lien calendar, qui peut te rapporter du ROI. La strat de publier sur long-terme est une stratégie ROIste clairement. Au fur et à mesure, tu deviendras le chassé, et plus le chasseur -> les deals viendront à toi car tu auras martelé ton audience. Le tout est bien sur de bien connaître son audience et le message qui fonctionne pas elle.",
          "score": 1,
          "created_utc": "2026-01-26 09:46:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1wclpj",
          "author": "Admirable_Swim_7805",
          "text": "honestly 23k is tight for linkedin but it can work if youre super targeted. the key is not trying to hit everyone. pick one specific role at one type of company and go deep on that.\n\n\n\nthought leader ads are actually smart for brand awareness when people dont know you exist. they help you build credibility before asking for anything. but dont run them alone. pair them with sponsored content to people who engage.\n\n\n\nfor that budget id say run 1.5k on thought leader ads to your icpto build awareness then use the other 1.5k for retargeting those same people with a lead magnet or free tool. stack the touchpoints.\n\n\n\nalso make sure your linkedin profiles and company page are dialed in before you spend anything. people will check you out after seeing ads and if your profile looks empty or your company page hasnt been updated in months it kills trust.",
          "score": 1,
          "created_utc": "2026-01-26 21:34:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0w0ilf",
          "author": "itsgediminas",
          "text": "Please take a moment and look into affiliate marketing! It changed everything for us to stop spending with ADS and started paying for real sales. Reach out if you need any help with it.",
          "score": 1,
          "created_utc": "2026-01-21 17:23:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o11g985",
              "author": "TheGolfersHandBible",
              "text": "Why?",
              "score": 1,
              "created_utc": "2026-01-22 13:07:20",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o1oggwk",
              "author": "sgart25",
              "text": "I'd like to learn more about this – how do you start with affiliate marketing if you've never tried it before?",
              "score": 1,
              "created_utc": "2026-01-25 19:52:08",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0vezhj",
          "author": "Tiny-Celery4942",
          "text": "I hear you. Finding that repeatable channel is tough when you're bootstrapped. I was in the same boat, burning cash on Google Ads with little to show for it.\n\nFor LinkedIn, $1.5k for a week on thought leadership ads could move the needle, especially with solid social proof. The key is consistent engagement. What actually worked for me was turning LinkedIn into a daily system.\n\nHere’s what I do:\n\n\\- Prospect List: Build a list of 50 to 150 ideal customer profile accounts.\n\n\\- Mini Feed: Focus only on posts from that list.\n\n\\- Real Comments: Leave 10 to 20 comments daily, adding insights or questions.\n\n\\- Warm Connections:  Send requests only after a few touchpoints.\n\n\\- Contextual DMs:  Keep them short, specific, and relevant.\n\n\\- Follow Ups: Track replies and follow ups daily.\n\nTo keep a targeted feed of prospects and draft comments, personlized DM, Follwoup reminders I use Depost AI. It also helps me track follow ups so I don't miss anyone.",
          "score": 0,
          "created_utc": "2026-01-21 15:47:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0w140e",
          "author": "resonate-online",
          "text": "First off - do NOT shut off your google ads.  Let's them run at the minimum it will allow.  Every time you shut them off, you have to start new again when you start back up.  Keep the most basic ad going so that you don't lose the data.\n\n  \nI don't believe LI works the same way.  LI can be really hard.  You need to have really good targeting and you need to know what you are trying to accomplish with the ads.\n\n$2k-$3k is enough to get started depending on industry.\n\n  \nHappy to chat through it with you if you want to PM me.",
          "score": 0,
          "created_utc": "2026-01-21 17:26:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0w50sa",
              "author": "Cold_Quarter_9326",
              "text": "oh yeah, google's algorithm is not good with stopped campaigns",
              "score": 1,
              "created_utc": "2026-01-21 17:43:44",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qnlqzb",
      "title": "How people are booking meetings before conferences",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qnlqzb/how_people_are_booking_meetings_before_conferences/",
      "author": "Putrid-Proposal-340",
      "created_utc": "2026-01-26 17:00:44",
      "score": 29,
      "num_comments": 14,
      "upvote_ratio": 0.91,
      "text": "I’ve seen a lot of posts lately about conferences being a waste of money, and I resonate with that. If you just show up and hope people walk by, it's going to be crickets 9 times out of 10.\n\nI came to the realization the conference itself isn’t where most of the value happens. The value happens *before* anyone even shows up, when people still have open calendars.\n\nWe tried pre event outreach using confirmed attendee data. Tried manual linkedin digging but that was useless, then we tried this PullAList service which collects verified conference attendee lists, believe it or not that got us two good opportunities in Vegas (CES) this year.\n\nThe difference between wandering in hopes of finding something and walking in with meetings booked is night and day.   \nWould love to see how many people already knew about this trick and gatekept",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qnlqzb/how_people_are_booking_meetings_before_conferences/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o1ulc85",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-26 17:00:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1uxtz2",
          "author": "AmbitionMean5170",
          "text": "Finding out who’s actually attending is the hardest part. This Pullalist thing seems interesting, they've hit a pain point with this one",
          "score": 5,
          "created_utc": "2026-01-26 17:55:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1unyms",
          "author": "Vegetable_Cap_3142",
          "text": "The difference between walking out with meetings vs a stack of cards is huge. Once you see it, it’s hard to justify doing events any other way.",
          "score": 2,
          "created_utc": "2026-01-26 17:12:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1v6ile",
          "author": "Clean-Hippo8232",
          "text": "During the show feels like the worst time to start conversations, if you land anything amidst that mess it's just sheer luck.",
          "score": 2,
          "created_utc": "2026-01-26 18:31:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1wadx6",
          "author": "Admirable_Swim_7805",
          "text": "this is honestly what ive been telling people for months now. conferences are way overpriced if youre just hoping to bump into the right person at a booth. the real play is reaching out before the event when everyones still planning their schedule and actually has time to respond. once everyone gets there its just chaos and everyone already has their calendar locked up.\n\n\n\nthe pullalist thing sounds interesting though. never heard of it but makes sense that theres a service for verified attendee lists. manual linkedin scraping is brutal and half the time people dont even have their company listed properly.",
          "score": 1,
          "created_utc": "2026-01-26 21:24:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1z2qbk",
          "author": "james-porter1",
          "text": "completely agree. conferences only feel like a waste if you show up without doing the groundwork. pre-event outreach to verified attendees is what separates people who get roi from those who don't.",
          "score": 1,
          "created_utc": "2026-01-27 06:49:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1z4v0v",
          "author": "Shre_Marketing",
          "text": "Have been using this for a few years. It is really hit and miss and depends on the event. Very rarely have there been occasions where people express interest to meet.",
          "score": 1,
          "created_utc": "2026-01-27 07:07:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1z6kqk",
          "author": "Surbhimarketing",
          "text": "Agree. Conferences only fail when you rely on foot traffic.\n\nReal ROI is decided pre-event, when calendars are still open. Targeted outreach to confirmed attendees changes the whole equation. You show up with meetings, not hope.\n\nConferences aren’t the problem. Lack of prep is.",
          "score": 1,
          "created_utc": "2026-01-27 07:22:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o20lvau",
          "author": "Tiny-Celery4942",
          "text": "I used to think conferences were a waste too. Showing up and hoping for the best never worked for me. It felt like throwing money away.\n\nI realized the real work happens before the event. Booking meetings in advance is a total game changer. It makes the whole experience worthwhile.\n\nWhat actually worked for me wasn’t a tactic. It was turning LinkedIn into a daily system instead of a place I randomly post and pray.\n\nHere’s the loop I run now that consistently books B2B calls:\n\n\\-   Start with a hand built prospect list (not the feed) 50–150 ICP accounts + people.\n\n\\-   Create a “mini feed” just for those people.\n\n\\-   Warm them with 5–10 real comments per day.\n\n\\-   Send connection requests only once they’re warm.\n\n\\-   First DM = context + one easy question.\n\n\\-   Treat follow ups like a pipeline, not an afterthought.\n\nTo keep a targeted feed of prospects and run this system, I use **Depost AI**. It helps me build feeds, draft comments and DMs, and tracks follow ups so I don't miss anyone.",
          "score": 1,
          "created_utc": "2026-01-27 13:59:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1v5y5w",
          "author": "sagefrogmarketing",
          "text": "ROI shifts dramatically when the event becomes a deadline for pre-booked conversations instead of a gamble on foot traffic. The teams that win treat the conference as a forcing function for outreach, relevance, and timing, not the main attraction. Walking in with a calendar already full completely changes the economics of the event.",
          "score": 1,
          "created_utc": "2026-01-26 18:29:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1vra4e",
          "author": "Original-Bus-6172",
          "text": "We’ve tried manual linkedin research and list providers and just like you've said it felt useless, pullalist might be an option for the next event",
          "score": 1,
          "created_utc": "2026-01-26 20:00:07",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qjrdax",
      "title": "Reddit as a b2b channel",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qjrdax/reddit_as_a_b2b_channel/",
      "author": "celeskush",
      "created_utc": "2026-01-22 10:45:32",
      "score": 28,
      "num_comments": 56,
      "upvote_ratio": 0.97,
      "text": "Hi fellow marketers. I'm a content/growth manager working for a SaaS startup and looking for new channels to test in 2026. I've been considering Reddit as a possible channel for GEO and awareness. Has anyone tested it yet? Where should i start? I've never used Reddit even for myself so i'm very new to this :)) Thanks a lot",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qjrdax/reddit_as_a_b2b_channel/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o10wx2k",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-22 10:45:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o157h3z",
          "author": "amoorthy",
          "text": "Hello! My colleague wrote up a guide on Reddit for marketing that has been well received by our customers and non-customers so you may find useful.\n\nIt covers if and how Reddit influences LLM answers, how to get started with Reddit marketing (build karma, don't get banned), and generally how to be a good Redditor rather than a spammy one.\n\nI'm not sure if we can post links in this subreddit so it's the 3 most recent posts at blog dot rocksalt dot ai. I can answer any specific questions if you have.",
          "score": 2,
          "created_utc": "2026-01-22 23:57:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1v67ri",
          "author": "sagefrogmarketing",
          "text": "Reddit can work, but only if you treat it as a conversation channel, not a distribution channel. Start by spending time in a few subreddits where your buyers already ask questions and vent. Read for patterns before posting anything. The value comes from answering real questions, sharing lived experience, and testing language that later feeds content and GEO elsewhere. If you lead with curiosity and usefulness instead of links or promotion, Reddit becomes surprisingly high-signal.",
          "score": 2,
          "created_utc": "2026-01-26 18:30:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o11808g",
          "author": "MendMySoulXoXo",
          "text": "Reddit as a growth channel is great! Especially for GEO. I was able to bring LLM visibility for my SaaS within 10 days of organic reddit marketing. Would love to connect and share how i started. \n\nBtw above recommended agency The Orange Project .Co is exceptionally good in terms of organic reddit marketing. These guys are pro at it. Their approach helped improve our searchability and brand awareness on reddit.",
          "score": 3,
          "created_utc": "2026-01-22 12:13:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o120ee9",
              "author": "celeskush",
              "text": "Oh wow 10 days! I would be happy to connect and talk about it",
              "score": 1,
              "created_utc": "2026-01-22 14:54:11",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o1aszwx",
              "author": "Digi-Dave",
              "text": "Hi, mind sharing your strategy? I would love to learn as well!",
              "score": 1,
              "created_utc": "2026-01-23 20:06:51",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1eq5zt",
                  "author": "MendMySoulXoXo",
                  "text": "One thing I should add (for full transparency).. we did have an unfair advantage going in.\nOur brand was already getting organic, positive mentions on Hacker News and a few other forums, including Reddit. So there was already some ambient trust when people checked us out.\nThat said, Reddit still didn’t reward promotion. What helped was leaning into explanation-first replies rather than trying to amplify the brand mentions. The existing chatter just made it easier for people (and AI tools) to connect the dots once they saw consistent, useful answers.\nIf you’re starting from zero, the same approach still works, it just takes longer. The core driver wasn’t the mentions themselves, but the clarity and consistency of how we explained the problem and tradeoffs.\nHappy to expand on how we’d do this from scratch too.",
                  "score": 1,
                  "created_utc": "2026-01-24 11:16:17",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o113505",
          "author": "Alone_Ad_3375",
          "text": "I'm a reddit marketer helping enterprises, would love to help you get started with it.\n\nIf you could tell your startup name I can build a custom strategy for you to use including all the subreddits and sops we personally use :)\n\nBtw I run The Orange Project. Co, an enterprise Reddit marketing agency.",
          "score": 1,
          "created_utc": "2026-01-22 11:37:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1207se",
              "author": "celeskush",
              "text": "I would be happy to connect!",
              "score": 1,
              "created_utc": "2026-01-22 14:53:17",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o1286dt",
              "author": "sanfranciscolady",
              "text": "Would love to connect and swap notes. I run a small B2B growth agency and we do some Reddit strategies.",
              "score": 1,
              "created_utc": "2026-01-22 15:31:44",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o13f1n3",
                  "author": "Alone_Ad_3375",
                  "text": "dm sent",
                  "score": 1,
                  "created_utc": "2026-01-22 18:43:57",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o11nyuf",
          "author": "barefamting",
          "text": "Who are your customers?",
          "score": 1,
          "created_utc": "2026-01-22 13:50:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o11zt0g",
              "author": "celeskush",
              "text": "ESG/sustainability professionals!",
              "score": 1,
              "created_utc": "2026-01-22 14:51:18",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o128iif",
                  "author": "barefamting",
                  "text": "Too broad. Needs to be more specific. What specific pain points do they have and what have they tried so far?",
                  "score": 2,
                  "created_utc": "2026-01-22 15:33:20",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o11qj6g",
          "author": "lhlb",
          "text": "This is something I've been looking into for a client a fair bit. There's lots of stats out there to suggest it's worthwhile but I think this is mostly where there's already well-established communities, like in tech, cybersecurity, SEO, PR, and marketing spaces. I couldn't quite find an existing space or community that mapped well to my client's business, but that doesn't mean there would be one (or several) for yours!\n\nHowever, Redditors are quick to downvote thinly-veiled promotion, so sharing highly relevant, genuinely useful, educational content is the way to go to build up karma and credibililty.  \n\n  \nI'd be really interested to know thoughts on whether to use a real name or pseudonym for this kind of work though. Some thought leaders post under their names and I've been told it's always important to disclose any affiliation with a company for complete transparency, but the majority of Reddit users are fairly anonymous.",
          "score": 1,
          "created_utc": "2026-01-22 14:03:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1205ar",
              "author": "celeskush",
              "text": "I guess the good news is that the company i'm working for has a lot of vulgarization content on our topic (ESG, european regulations, climatic science..) i guess it could be a good start to share our knowledge and content without making it sales-y?",
              "score": 1,
              "created_utc": "2026-01-22 14:52:57",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o17h1js",
                  "author": "lhlb",
                  "text": "Yes absolutely! It helps to build up karma too by commenting and sharing genuinely valuable insight because some communities don't let you post until you've met a certain threshold.",
                  "score": 1,
                  "created_utc": "2026-01-23 08:53:55",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o15qiaa",
          "author": "abdraaz96",
          "text": "yes it works great, 20+ of our clients we applying this, and the results are just amazing.",
          "score": 1,
          "created_utc": "2026-01-23 01:40:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o15xhee",
          "author": "cole-interteam",
          "text": "In my experience, Reddit works well for B2B SaaS. However, I would think of Reddit in terme of high-intent conversations that provide long-tail research.\n\nWhen starting out and using organic approach, I would suggest selecting two or three subreddtis where your target costumers are asking the question your product solves. Lurk on those communities for a period, and then, create detailed answer that provide value, but not a sales pitch. The outcome will tell you whether your product aligns with your ICP and the type of content each community discuss. \n\nAs for paid ads, we have had our most sucess on Reddit Ads, especially through conversations. We begin by selecting a very small number of highest fit subreddits, running thread level ads to a middle funnel asset such as a guide or comparison page, and tagging every ad in the CRM using UTM's to allow us to determine which subs and threads are really converting.",
          "score": 1,
          "created_utc": "2026-01-23 02:19:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o16ggje",
          "author": "AdamYamada",
          "text": "Yes Reddit is key for chatbots and LLMs. ",
          "score": 1,
          "created_utc": "2026-01-23 04:08:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o16nqmf",
          "author": "fkingdiabolical",
          "text": "I've seen it work firsthand. I've done freelance reddit for a marketing automation SaaS brand and the posts and responses have been great. Got some referral traffic as well to key money pages on their website. Happy to help do it for your brand as well.",
          "score": 1,
          "created_utc": "2026-01-23 04:54:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o16oauf",
          "author": "InevitableCamera-",
          "text": "Reddit can work, but only if you treat it like a community, not a distribution channel",
          "score": 1,
          "created_utc": "2026-01-23 04:58:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o16uw1r",
          "author": "james-porter1",
          "text": "reddit works great for B2B but you need to be careful. best approach; genuinely help people and mention your product only when it solves their exact problem.",
          "score": 1,
          "created_utc": "2026-01-23 05:45:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o178ddf",
          "author": "signal_loops",
          "text": "yes, Reddit can work for B2B but only if you treat it as a community, not an ad channel. start by lurking in 5–10 relevant subreddits vLearn what gets upvoted and what gets downvoted. Post value first, insights, lessons learned, mistakes, data. Avoid links early.",
          "score": 1,
          "created_utc": "2026-01-23 07:35:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1f9jps",
          "author": "Federal_Chipmunk8779",
          "text": "I’m in a similar situation. More familiar with LinkedIn though now considering Reddit",
          "score": 1,
          "created_utc": "2026-01-24 13:40:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1l6xkz",
          "author": "swedishtea",
          "text": "If you play it right it can be great for b2b, but way too many brands just spam without value which is not a good look. The Growth Hacking Reddit book is a solid guide on how to do it the right way for organic growth b2b - for example 95/5 value to plug, not to talk in corporate, and be part of the community not an outsider",
          "score": 1,
          "created_utc": "2026-01-25 08:56:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1mbuzu",
          "author": "mohamednagm",
          "text": "use Reddboss",
          "score": 1,
          "created_utc": "2026-01-25 14:11:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o117456",
          "author": "another_sleeve",
          "text": "Reddit works wonders, and you can see a lot of people doing it out in the wild.\n\nThe most basic thing you can do is set up something like F5 bot to alert you if conversations around the pain point / your solutions pop up and jump in with a branded profile to answer.\n\nA bit more shadier but increasingly popular is to get into relevant niche subreddits and use multiple accounts to start discussions around the problem space/solution and plug in yours as the answer. If you overdo it people will catch on and downvote you into oblivion, but guess what, since Google loves displaying reddit in the SERP, it's a no brainer to own BOFU keywords with reddit convos.\n\nThe more advanced/long term play is to start a reddit community that you moderate, either around the problem space or your solution itself, but this is very niche dependent - it mostly works for broad user-base PLG companies.",
          "score": 1,
          "created_utc": "2026-01-22 12:07:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o16qfxl",
              "author": "rainmakerdigital",
              "text": "There are a ton of astroturfing accounts on here. We've started posting for the brand on Reddit just recently, and it's a bit disheartening seeing how much of the conversation on here is being driven by new usernames plugging \\[random SaaS you've never heard of\\] in 20 threads in a row.",
              "score": 1,
              "created_utc": "2026-01-23 05:13:04",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o17nsmg",
                  "author": "another_sleeve",
                  "text": "tbh reddit is a half-dead platform in terms of cultural relevance, but it gets so much traffic it'd be insane to ignore",
                  "score": 2,
                  "created_utc": "2026-01-23 09:57:12",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o12chg5",
          "author": "heyimkrista",
          "text": "Hey there! I run a Reddit marketing agency and I’m actually starting a space to help educate marketers who are new to Reddit (think weekly lessons, templates, etc). I’ve talked to so many who also don’t know where to start! Lmk if you want more info :)",
          "score": 1,
          "created_utc": "2026-01-22 15:51:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o12cp5c",
              "author": "celeskush",
              "text": "I would be happy to connect!",
              "score": 1,
              "created_utc": "2026-01-22 15:52:35",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o13ok3o",
          "author": "theguywhobuilds",
          "text": "Reddit works for B2B, but only if you treat it like a long-term presence, not a channel you “run campaigns” on. It’s good at shaping opinion, earning trust, and staying top-of-mind long before someone is ready to buy, which means it behaves more like demand creation than lead gen. If you show up consistently, answer real questions, and don’t try to sell, people remember you when the timing finally clicks.\n\nIf you come in expecting quick leads or try to force CTAs, it’ll fail fast. Reddit rewards patience and clarity, not urgency.",
          "score": 1,
          "created_utc": "2026-01-22 19:26:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o117fbb",
          "author": "Responsible-Brick881",
          "text": "Im looking into it myself too!\n\nOn a separate note though, im the founder of an Irish start up that helps build brand awareness through premium video on sites like forbes, business insider, WSJ, etc.\n\nI actually built it with DTC in mind as i also have the likes of premium fashion sites like Vogue and GQ, but I've ended up getting way more interest from the B2B tech/saas space as they're very interested in getting their videos in front of senior decision makers on the news sites they spend time consuming content. This means they're not on a busy social feed and at a high attentive frame of mind. My first 2 customers after launching at the start of this month have both been B2B so maybe I'm on to something. \nI'd be happy to run you through it - no hard sell - Im at the point where I'm keen to just get some feedback from b2b marketers to validate if its the vertical I should be focusing on. \nBeen in adtech for 11 years so worst case scenario, I can give you some general insight on various platforms.",
          "score": 0,
          "created_utc": "2026-01-22 12:09:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o12j9al",
              "author": "International_Rip706",
              "text": "Interesting start up, name?\n\nLike Linkby but video and for B2B, which is kind of what they’re missing",
              "score": 0,
              "created_utc": "2026-01-22 16:22:08",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o12f9jv",
          "author": "MORPHOICES",
          "text": "Last year, I went to Reddit as a B2B channel when I was looking for something earlier than SEO, less designed than LinkedIn.  \\~\n\nThe most shocking thing was that any mention of “channel strategy” was punished, while very narrowly defined problem stories were rewarded. In the beginning, I mistakenly believed in subreddits + content themes. That failed.\n\nThe solution we developed was to treat each subreddit like a small industry room – lurking for a couple weeks, noticing the same questions repeating, then replying with one concrete experience (what we tried, what broke, what we learned). No hyperlinks or calls to action.\n\nAs you set out to growth-hack your startup, here is a simple takeaway: don’t test Reddit as a distribution channel. Give it a test as your listening channel. \n\nAfter reading a week’s worth of posts, if you can’t see recurring pain points, it’s probably not worth B2B anyway.",
          "score": 0,
          "created_utc": "2026-01-22 16:04:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o12hi3u",
          "author": "algatesda",
          "text": "Last year I was trying my hands in Reddit and getting good traction for idea validation for your solution .If you help people on solving their with your solution .Need any help DM",
          "score": 0,
          "created_utc": "2026-01-22 16:14:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o12mdod",
          "author": "PianoRevolutionary72",
          "text": "Podcast ads, it’s working very good for SaaS right now, if you know how and with who to do it.",
          "score": 0,
          "created_utc": "2026-01-22 16:35:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o12xrsh",
          "author": "Consistent-Let-537",
          "text": "Interesting, but not sure how much time as per Google updates.",
          "score": 0,
          "created_utc": "2026-01-22 17:27:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o134g3n",
          "author": "Cold_Respond_7656",
          "text": "We are a cybersec intelligence platform and Reddit worked amazing for us.\n\nAll we did was write up Reddit posts from our blog posts, post those write ups into security subs like r/cybersecurity or specific tech subreddits, with a link to our page at the bottom of the post and before we knew it Google had us well indexed and we started getting a lot of traffic specifically from GPT and Perplexity\n\nFor example this one that drew in >100k views and 1450 shares\n\nhttps://www.reddit.com/r/cybersecurity/s/IhtCoSv65b\n\nOr this one that brought it >750k views with more than 5000 shares \n\nhttps://www.reddit.com/r/OpenAI/s/WHba8uPIr7\n\nTraffic on the site exploded",
          "score": 0,
          "created_utc": "2026-01-22 17:57:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o119ucg",
          "author": "dextert48",
          "text": "Mostly a waste of time",
          "score": -2,
          "created_utc": "2026-01-22 12:26:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o11k7sw",
          "author": "evilbarron2",
          "text": "B2B? Is this a new acronym for “Business-to-bot” marketing?\n\nI’d need to see some independent evaluations of what percentage of the Reddit audience are bots or other IVT before I put my money or effort into it. ",
          "score": -2,
          "created_utc": "2026-01-22 13:30:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o126rn1",
              "author": "wildcard_71",
              "text": "Hi, I’m a bot. /s",
              "score": 0,
              "created_utc": "2026-01-22 15:24:56",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qni5yt",
      "title": "How to find customers for b2b ai product?",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qni5yt/how_to_find_customers_for_b2b_ai_product/",
      "author": "Not_trxctf",
      "created_utc": "2026-01-26 14:54:22",
      "score": 24,
      "num_comments": 41,
      "upvote_ratio": 1.0,
      "text": "Hello! I have ai b2b startup. Now i looking for customers.  My product is ai call centre. Where i can find customers?\nCan you share your experience in common cases? Do you know some platforms for such cases ",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qni5yt/how_to_find_customers_for_b2b_ai_product/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o1tskee",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-26 14:54:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1u04yb",
          "author": "Forsaken-Athlete-673",
          "text": "You built this startup before talking to customers? How do you even know you’re solving their problem? How do you know what the problem is and how to differentiate? \n\nI know this isn’t helpful for your query, but I think this should have been step 1. \n\nThat said, when you built this, who did you intend to have as a customer? Find one of those and ask them for 15 mins to show them a demo and get feedback. I think the more interaction you have with the intended businesses that you see as customers, the easier it will be (assuming you’re solving their problem).",
          "score": 7,
          "created_utc": "2026-01-26 15:29:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1vm0cy",
          "author": "Voltalyze",
          "text": "I don't usually give such gems, but I'll do it this time. \n\nThere are a ton of opportunities for you to get clients on the jobs websites. \n\nLook for call center operators jobs and reach out to the companies and offer them the solution. \n\nThey are already in need of a caller so you just need to position in front of them the right way. \n\n\nHey, if you find even a little value in this just upvote it, I am trying to rank up my account (no pressure)",
          "score": 4,
          "created_utc": "2026-01-26 19:37:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1yt7os",
              "author": "Amulyakumarr",
              "text": "A very good approach",
              "score": 2,
              "created_utc": "2026-01-27 05:35:27",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o1ytt80",
              "author": "realizingdata",
              "text": "Smart move",
              "score": 2,
              "created_utc": "2026-01-27 05:39:56",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1uk3a9",
          "author": "AutomaticSpell2889",
          "text": "Depending on the tool, email newsletter sponsorships can bring a ton of value. Focus on the small to mid-sized newsletter, avoid big ones for now. Make sure your ICP reads those newsletters, niche down as much as you can.",
          "score": 2,
          "created_utc": "2026-01-26 16:55:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1v82gg",
          "author": "theguywhobuilds",
          "text": "Start much narrower than you think, because most B2B AI products fail by trying to sell to “teams” instead of one person with one problem they already want gone.\n\nFigure out who actually feels the pain, when it shows up, and what they’re already trying, then show up in those same places , usually google when something breaks, linkedIn when they’re learning, and reddit when they’re sanity-checking tools.\n\nDon’t sell the AI part at all. talk about the problem and the outcome, because people buy relief, not models.\n\nOnce a few customers convert, trace exactly how they found you and repeat that path instead of trying to scale everything at once.",
          "score": 2,
          "created_utc": "2026-01-26 18:38:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1tt6dz",
          "author": "kubrador",
          "text": "cold email works if your product actually saves people money, which call center ai supposedly does. linkedin sales navigator + some basic research = free prospecting, beats paying for leads you'll probably ignore anyway.",
          "score": 1,
          "created_utc": "2026-01-26 14:57:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1tx1tb",
          "author": "GetNachoNacho",
          "text": "You’re asking the right question early. B2B AI products usually win by going narrow first, one clear industry, one painful problem, and direct conversations with real buyers.",
          "score": 1,
          "created_utc": "2026-01-26 15:15:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ty7v9",
          "author": "According_Nebula7936",
          "text": "finding b2b customers for ai call centers usually isn’t about platforms, it’s about targeting the right industries and decision makers. start by mapping businesses that rely heavily on calls — telecoms, support-heavy SaaS, insurance — then reach out directly or via linkedin. can explain more if you want??",
          "score": 1,
          "created_utc": "2026-01-26 15:20:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1u51vt",
          "author": "Intrepid_Focus_6605",
          "text": "No of source of getting customers which has worked for me.\n\n1. Personal connects. Made them my design partner. Once problem's validated, converted them to paid customers.\n\n2. Attending events/meetups do convert.",
          "score": 1,
          "created_utc": "2026-01-26 15:51:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ufig6",
          "author": "SumitCasey",
          "text": "for B2B AI products like an AI call center, the key is finding companies that already rely on call centers or customer support at scale. Start by targeting industries like e-commerce, SaaS, telco, and fintech. LinkedIn is great for finding decision-makers (heads of support, ops, or CX). You can also check startup/job boards for companies hiring large support teams, that usually signals a need. Platforms like Product Hunt, AngelList, and industry Slack/Discord communities can help you connect with early adopters.",
          "score": 1,
          "created_utc": "2026-01-26 16:36:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ugryf",
          "author": "Admirable-Grocery-42",
          "text": "Eventually for almost any B2B startups the approach is the same:\n\n1) Outreach: cold emails + calls + LinkedIn outreach (depending on your industry)\n\n2) Posting valuable industry content on LinkedIn, X or any other place where your audience are\n\n3) Partnerships — collaborate with someone who already works with your potential customers \n\nMy number one advice — please, make a list of all your target customers that realistically can buy from you in the next 12 months , and focus only on them. Go to the events where they are, advertise to them, ask network for introductions. Don't spread your budget too thin by targeting way too many target accounts",
          "score": 1,
          "created_utc": "2026-01-26 16:41:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1uii5x",
          "author": "PoolEqual4401",
          "text": "Please let me know if you need help with lead gen",
          "score": 1,
          "created_utc": "2026-01-26 16:48:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1uriks",
          "author": "Intrepid_Boss9449",
          "text": "Try finding customers in LinkedIn groups or forums where call centers and sales teams hang out. Also check out industry events or cold email lists. Reddit might help but for AI call centers you need places where decision makers are active.",
          "score": 1,
          "created_utc": "2026-01-26 17:27:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1utg93",
          "author": "theninjadesigner",
          "text": "You can you use social media platforms like linkedin and reddit to build your community by creating high quality posts which adds real value to the life of your target audience. And by doing inbound marketing, you can convert your target audience by doing soft selling and convert them as your customers. Dont expect to see the results right away, it takes time and consistency to build the strong organic audience. Once that's done, you can doo paid marketing.",
          "score": 1,
          "created_utc": "2026-01-26 17:35:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1vd2ez",
          "author": "KissyyyDoll",
          "text": "Congrats on the startup. For an AI call center, you should probably look where people are already complaining about high support costs or long wait times.\n\nLinkedIn is the obvious choice but dont just spam people. Try joining groups for operations managers or customer success leads since they are usually the ones dealing with the headache of scaling a team.\n\nAnother good move is checking out G2 or Capterra to see who is leaving frustrated reviews for the old school legacy systems. Those are usually the easiest people to talk to because they already know they have a problem. You could also try cold outreach but keep it super short and focus on one specific pain point like \"hey we help stop your phones from ringing off the hook after hours\" or something like that.",
          "score": 1,
          "created_utc": "2026-01-26 18:59:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1vik3q",
          "author": "Nabo_the_Best0924",
          "text": "Customer Success Managers could be a potential target ICP for you who are petrified with high number of calls that his/her team has to handle everyday regarding repetitive things. Because, mostly people look for automation for avoiding repetitive tasks. Scout for them through different social media platforms by joining in relevant groups and communities where they generally hang out.\n\nNow, the real game will be played how skillfully you design your outbound campaigns to reach out to these people and definitely you will need specialized tools to master the art of outreach. Let me know in my DM, if you ever need additional information about omnichannel outreach automation tools.",
          "score": 1,
          "created_utc": "2026-01-26 19:22:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1w46rg",
          "author": "SharpInsect3636",
          "text": "The harder part here isnt finding channels, its figuring out who actually feels the pain strongly enough to buy right now. “AI call center” is too abstract for most teams unless something just broke or costs spiked. The fastest path I have seen is starting with one narrow use case and one role, then talking directly to people already dealing with that exact problem.",
          "score": 1,
          "created_utc": "2026-01-26 20:57:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1w51n3",
              "author": "Euphoric-View-9876",
              "text": "This is the key part most founders miss. What helped me was not guessing where buyers hang out, but starting from who they already pay attention to. Instead of broad outreach, I mapped competitors and legacy tools in the space, then looked at who follows them on LinkedIn. That audience is already problem aware. Once you have that, conversations feel way less cold because youre showing up where intent already exists.",
              "score": 2,
              "created_utc": "2026-01-26 21:01:05",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1wdz6u",
                  "author": "Right-Influence-2460",
                  "text": "Thats a really underused way to think about intent. People signal what they care about long before they fill out a form, usually by who they follow or compare themselves against. Starting from those gravity centers makes outreach feel less like interruption and more like joining an existing conversation.",
                  "score": 1,
                  "created_utc": "2026-01-26 21:40:46",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1w4g1o",
          "author": "derevops",
          "text": "Work hard on your startups GEO/AEO and build a presence online. Buyers are currently either asking AI or going to particular social media platforms like reddit or x to search for the solutions/products they need. Keep that in mind. \n\nAlso, go hard on linkedin, you might feel unease at first but it all pays off :) good luck finding new customers!!",
          "score": 1,
          "created_utc": "2026-01-26 20:58:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1w5t8u",
          "author": "OkDependent6809",
          "text": "yeah finding initial customers for b2b ai stuff is tough. especially call center products since there's so many now.\n\nlinkedin outbound can work but you gotta be really specific about who you target. like dont just spam vp of operations at every company. find companies that actually have call center pain (high support volume, lots of complaints about wait times, etc)\n\nhonestly tho id focus on events. like industry conferences, startup meetups, b2b networking things. way easier to have actual conversations there and get contact info from people who might actually care. then you can follow up properly instead of cold outreach\n\nthe conversion part is where you gotta put real energy. getting a poc from an event is easy, turning that into a customer takes work. most people collect business cards and never follow up properly\n\nalso pick one industry to focus on first. like bfsi has massive call center operations and tons of compliance requirements that ai could help with. way easier to build case studies and references when youre solving the same problem for similar companies. spreading too thin early on kills momentum\n\nwhat stage are you at? do you have any customers yet or still building?",
          "score": 1,
          "created_utc": "2026-01-26 21:04:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1wjirq",
          "author": "Erynlaflamme",
          "text": "Start with the foundation: Organic. It's what everything else will build upon.\n\n1. Optimize your website for SEO so that customers can find you.   \n2. Make sure you have a solid CRM in place and use tools like RB2B to see WHO is visiting your site  \n3. Create content that answers their questions   \n4. Distribute that content organically to start (social media, email marketing to your database)  \n5. Start doing Linkedin outreach and outbound email sequences to prospects visiting your website but not converting  \n6. Consider looking into tools like Wynter to pressure test your messaging / make sure its resonating with your audience before going to market   \n7. Leverage your LinkedIn- Post thought leadership posts weekly (not sales posts- but share expertise and advice about things your ICP is asking and provide actionable solutions- if your tool solves them great plug it sometimes but be more helpful that salesy) and use tools like Dripify to connect / message with your ICP (I've had tons of success booking meetings this way) and because you're posting consistent thought leadership, they will know you're a good person to know/talk to (you have shown you know your shit and want to be helpful)  \n8. Once your messaging is solidified and your foundation is set up, start testing paid channels (have a demand gen or paid consultant run an audit to determine where your audience exists and what your competitors are doing - and start running ads there if budget permits)  \n9. Networking is still great. Go to industry conferences your ideal customers are going to... go to all the meet ups, dinners etc. and get well connected.",
          "score": 1,
          "created_utc": "2026-01-26 22:05:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1yb8lg",
          "author": "ElectronicPop",
          "text": "Follow these steps. \n\n1. Identify who will probably need your software.\n2. Let's say they are sales people or b2b sales teams. \n3. Now you need a list of contact details of sales people in different companies. You can google around and get a good quality list from a service provider\n4. Start emailing them about the problems you solve. In total you should send them 5 emails in regular intervals. The final email should be a breakup email. The first email should be non salesy. Dont sell but show the customer how your software benefit them. \n\nDo it consistently and you will have sales.",
          "score": 1,
          "created_utc": "2026-01-27 03:38:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1yz34l",
          "author": "supriya_l89",
          "text": "You need to begin your customer target development process by defining specific industry requirements and company size criteria and use case conditions. AI call centers usually resonate with industries like healthcare, logistics, real estate, and e-commerce.  \n  \nMost early B2B traction comes from outbound: LinkedIn Sales Navigator, cold email, and direct demos. Trustbuilding requires you to combine your solution with case studies and pilot projects. The marketplaces and directories provide support through G2 and Capterra while direct conversations will establish demand proof more quickly than passive channels.",
          "score": 1,
          "created_utc": "2026-01-27 06:20:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1z62o8",
          "author": "UwU_MilkDrop",
          "text": "Target businesses that rely heavily on call centers or customer support. LinkedIn outreach, industry directories, and attending trade shows are good starting points.",
          "score": 1,
          "created_utc": "2026-01-27 07:17:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1zagto",
          "author": "Kalpana-Rathore",
          "text": "The key isn’t finding *customers*, it’s picking one very clear use case.\n\nFor a B2B AI call-center product, avoid “any business with calls.” Choose one segment (SMB support, sales teams, BPOs, SaaS CX). Each buys for different reasons.\n\nEarly customers usually come from manual LinkedIn outreach, personalized cold emails, and real conversations in communities, not paid ads. Focus on one problem you solve really well and get a pilot customer first.",
          "score": 1,
          "created_utc": "2026-01-27 07:56:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1zgpy7",
          "author": "kylegawley",
          "text": "Start with:\n\n1. Cold DMs on LinkedIn to people who need your solution  \n2. Warm DMs to people on social media posting about looking for your solution",
          "score": 1,
          "created_utc": "2026-01-27 08:54:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1zl5h9",
          "author": "Aunker",
          "text": "Usually the problem isn’t where to find customers, but that AI call center is too vague to trigger interest. Buyers think in specific jobs being replaced or improved. Support, sales follow ups, booking, collections. Each has different buyers and channels. Early traction almost always comes from picking one narrow use case and one industry, not from searching for generic platforms.",
          "score": 1,
          "created_utc": "2026-01-27 09:35:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1zpl1d",
          "author": "FunDevelopment3229",
          "text": "How about using your call center to get more clients?",
          "score": 1,
          "created_utc": "2026-01-27 10:16:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o20n6r9",
          "author": "No_Hedgehog8091",
          "text": "For AI call centers, target companies already using traditional call centers. Start with LinkedIn Sales Navigator filtering by industry (insurance, telecom, healthcare) and company size 50-500 employees.\n\nSearch job postings for 'call center manager' or 'customer service director' roles. These companies have the pain point you solve.\n\nJoin industry-specific Slack/Discord communities where operations managers hang out. They discuss vendor selection there.\n\nCold outreach works best when you reference their current tech stack. Many list their providers on job postings or company pages.",
          "score": 1,
          "created_utc": "2026-01-27 14:06:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o20oxdp",
          "author": "Due-Willow-2002",
          "text": "Start by narrowing who you’re actually selling to — support-heavy SMBs, sales teams, or BPOs. From there, most early customers come from direct outreach and conversations, not platforms. LinkedIn and email work better than marketplaces at this stage, especially if you can offer pilots or demos and learn from real usage.",
          "score": 1,
          "created_utc": "2026-01-27 14:15:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o20tfrv",
          "author": "MembershipHorror404",
          "text": "Been there. Early on, what helped me most was not “finding customers” but finding one clear use case.\n\nFor an AI call center, pick a narrow ICP first (for me it was real estate + outbound-heavy teams). Then hang out where they already complain 😄, subreddits, LinkedIn comments, niche Slack/Discord groups. Reply with experience, not a pitch.\n\nI also did a lot of manual outbound at the start: short emails/DMs saying “saw you’re handling X calls/day, curious how you’re managing it today?” That opened real conversations fast.\n\nOnce a couple of customers convert, everything else (platforms, ads, content) becomes way easier.",
          "score": 1,
          "created_utc": "2026-01-27 14:37:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2123lf",
          "author": "Dangerous_Bowler3286",
          "text": "To find customers for your AI call center product, start by defining your ICP (B2B companies with high call volume, customer support teams, or service-heavy industries).   \n  \nLook for buying signals like recent growth, hiring in customer service roles, or scaling operations   these are clues that companies are likely ready to adopt AI solutions.\n\nUse a multi-channel approach: start with cold email outreach to targeted companies, leveraging platforms like LinkedIn for visibility and engagement. Combine that with AI-driven lead enrichment and email verification to ensure quality prospects.   \n  \nAutomate the process from finding leads to handling replies and syncing everything to your CRM, so you can scale efficiently.\n\nPlatforms like LinkedIn for discovery and cold email tools for outreach work well, but having an automated workflow that continuously targets, qualifies, and nurtures leads is key.",
          "score": 1,
          "created_utc": "2026-01-27 15:19:34",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qk1sdz",
      "title": "Anyone here actually managed to create a realistic AI for product demo video",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qk1sdz/anyone_here_actually_managed_to_create_a/",
      "author": "PinkVelvet_Simmons",
      "created_utc": "2026-01-22 18:04:20",
      "score": 23,
      "num_comments": 5,
      "upvote_ratio": 0.97,
      "text": "We’re a small saas team and product demo videos are taking up so much of our time.\n\nEvery time we ship something (even something small) we’re filming new videos from scratch and having to outsource to freelancers etc to edit them.\n\nI’m noticing more companies using the same “presenter” across demos, but it’s clearly not a real person re-filming every time. looks like some kind of AI spokesperson setup.\n\ni’m not anti filming, just tired of redoing the same stuff over and over. We can’t afford to expand right now and we can’t keep spending all our time and budget on these videos.\n\nCurious if anyone’s actually switched to an AI avatar and if so…\n\ndid users care?\n\ndid it feel less trustworthy?\n\nor did it just… solve the problem and no one noticed?\n\nTrying to figure out if this is smart or if i’m just burned out lol.",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qk1sdz/anyone_here_actually_managed_to_create_a/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o13616a",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-22 18:04:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o14xktf",
          "author": "kubrador",
          "text": "you're burned out but also right. ai avatars work fine for saas demos because nobody's emotionally invested in the presenter. they want to see the product do the thing.\n\nsynthesia/heygen are the go-to's and honestly they're indistinguishable from tired freelancers at this point. biggest risk is looking \\*too\\* polished and creepy, but a slightly awkward ai avatar reads as \"startup\" not \"uncanny valley.\"\n\njust record yourself once with good lighting, use that for 6 months, update quarterly. way less burnout than redoing everything, way cheaper than freelancers, and way less sus than an ai that nobody asked for. you're a saas team, not a production company.",
          "score": 3,
          "created_utc": "2026-01-22 23:05:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1a3x13",
          "author": "aimdoc-ai",
          "text": "we're building something to essentially skip over that. basically an AI buyer copilot that:\n\n* engages prospects when they land on your site\n* determines if they're a fit based on your criteria\n* shows your product + sets it up based on what they're most interested in\n\nwhat I landed on was, why demo the product when AI can set it up for them in real time and show value?",
          "score": 1,
          "created_utc": "2026-01-23 18:11:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o154a0l",
          "author": "Low-Cardiologist-432",
          "text": "Just sent you a DM!",
          "score": 0,
          "created_utc": "2026-01-22 23:40:16",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qj5jui",
      "title": "Are there marketing strategies that work specifically for B2B companies under $10M?",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qj5jui/are_there_marketing_strategies_that_work/",
      "author": "Champ-shady",
      "created_utc": "2026-01-21 18:15:24",
      "score": 17,
      "num_comments": 46,
      "upvote_ratio": 1.0,
      "text": "Most marketing advice I find feels built for either: early-stage startups trying everything, or well-funded companies with big teams and long runways.\nWe’re a B2B company doing under $10M ARR, and we don’t have the luxury of waiting 12 months for brand awareness to pay off. Paid ads are hit-or-miss, content feels slow, outbound is noisy, and everyone keeps recommending tactics without context.\nFor those who’ve actually scaled B2B at this stage, what consistently works when resources are limited and revenue matters now?",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qj5jui/are_there_marketing_strategies_that_work/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o0wc961",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-21 18:15:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0wfukp",
          "author": "cornelmanu",
          "text": "What consistently works at sub $10M ARR is not a new tactic. It is focus and integration.\n\nHere is what I have seen work repeatedly when revenue matters now.\n\n1. Pick one ICP slice and one use case Most teams at this stage are still too broad. “Mid-market B2B” is not a strategy.\n2. Prove messaging before scaling channels Paid, content, and outbound all fail when messaging is fuzzy.\n3. Use outbound as a learning engine, not just a sales engine\n4. Content should support sales, not wait for SEO\n5. Stop running channels in silos The biggest waste I see is teams treating paid, content, outbound, and LinkedIn as separate things. What works is one clear message, reused everywhere:\n\n* Outbound tests it\n* LinkedIn amplifies it\n* Paid scales it\n* Content supports it\n\nThat is how you move faster with fewer resources.\n\nThis is also why many teams at this stage move to a fractional model instead of hiring specialists or agencies. One owner across channels usually beats three disconnected tactics.",
          "score": 17,
          "created_utc": "2026-01-21 18:31:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0ws2lt",
              "author": "slow_lightx",
              "text": "Bingo",
              "score": 2,
              "created_utc": "2026-01-21 19:25:02",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o11ojla",
              "author": "AireStream",
              "text": "This is the key!",
              "score": 2,
              "created_utc": "2026-01-22 13:53:24",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o15eqp4",
              "author": "matl_smmus88",
              "text": "100%",
              "score": 2,
              "created_utc": "2026-01-23 00:35:19",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o0zh9x3",
              "author": "Champ-shady",
              "text": "It’s not about chasing the next growth hack, but about disciplined focus and message channel integration.",
              "score": 1,
              "created_utc": "2026-01-22 03:44:08",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o108guu",
          "author": "blank_waterboard",
          "text": "At that size, random tactics don’t work without strategy. I’ve seen thewayhow.com approach this by connecting marketing directly to pipeline, not vanity metrics. Makes more sense when cash flow matters.",
          "score": 5,
          "created_utc": "2026-01-22 07:01:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0whf5s",
          "author": "Rachel1702",
          "text": "A synergy of outbound, events, sales enablement is what I can think of.",
          "score": 2,
          "created_utc": "2026-01-21 18:37:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0wyjm6",
          "author": "sagefrogmarketing",
          "text": "At that stage, what works is narrowing the game, not expanding it. Teams that scale under $10M ARR usually win by doubling down on one or two channels where they already have proof, then tightening ICP, messaging, and follow-up so every dollar compounds. The fastest revenue comes from aligning sales, content, and outbound around the same buyer problems instead of running them as separate motions. It’s less about finding a magic channel and more about making one channel uncomfortably focused and repeatable.",
          "score": 2,
          "created_utc": "2026-01-21 19:54:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0zhqxo",
              "author": "Champ-shady",
              "text": "Exactly, execution over expansion .",
              "score": 0,
              "created_utc": "2026-01-22 03:47:03",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0xeir6",
          "author": "Radiant-Security-347",
          "text": "why are you assuming “brand awareness” is the answer?\n\nIt would be moronic to pursue a brand awareness strategy in your circumstance. It sounds like the company needs to find someone with B2B marketing experience. It sounds like you are thinking of B2C marketing approaches ( and even then, pure brand awareness is of little value for b2b - it’s not unimportant but should be combined with lead gen/direct response marketing)\n\nKeep in mind, even under ideal circumstances, marketing takes six months to see real impact on revenue - plus however long your sales cycle might be.\n\nYou don’t mention sales either - having a crack sales team with a consistent methodology is the shortest distance to revenue and MROI.\n\nNobody can give you good advice based on the minuscule amount of information in your post. your ARR is the least meaningful variable. \n\nwhat industry?\n\nwhat target market?\n\nhow many sales people?\n\nwhat have you tried?\n\nwhat worked to get to $10m? What didn’t work?\n\n  \nToo many people come here looking for some “one size fits all” advice. It simply doesn’t exist.",
          "score": 2,
          "created_utc": "2026-01-21 21:07:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0zivsi",
              "author": "Champ-shady",
              "text": "I came looking for a formula, but the real insight is that the formula is clear thinking built on specific context.",
              "score": 0,
              "created_utc": "2026-01-22 03:54:08",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0y62re",
          "author": "CyberStartupGuy",
          "text": "Focus on building in public to create a micro brand. Especially if you can get several people at your company doing it, you can seem significantly larger than you are currently. Don't try to be everything for everyone, but focus on an incredibly narrow ICP and only care about your brand in that community.\n\nIf you share more about your industry I can tailor it a little more. For example I'm in cyber so I can get very specific for the security industry or other technical buyers",
          "score": 2,
          "created_utc": "2026-01-21 23:19:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o102r0k",
          "author": "ScrollableDreams",
          "text": "for sub-$10M B2B, what works isn’t channels. it’s entry timing. most tactics fail because they target accounts before there’s pressure to act. \n\ninstead of “doing outbound” or “doing content,” focus on reaching buyers when something just changed (budget unlocked, hiring spike, expansion, deadline). \n\nthat shortens cycles and makes even simple outreach work. At this stage, relevance beats scale every time.",
          "score": 2,
          "created_utc": "2026-01-22 06:13:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o13upiq",
          "author": "Commercial-Tutor-238",
          "text": "What I’ve seen work at that stage isn’t chasing more tactics. It’s getting clear on the one problem your buyer is under pressure to fix right now. When sales, outbound, and content all tell the same simple story about that problem and why it matters, deals move faster and effort stops getting wasted.",
          "score": 2,
          "created_utc": "2026-01-22 19:54:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o15j9of",
          "author": "matl_smmus88",
          "text": "Here's my 2 cents on content strategy before investing in paid ads:\n\n1. I think strong branding is often undervalued. The look and feel of your website and brand design is so important.\n2. Organic social content: Again undervalued, but important to keep somewhat consistent.\n3. Paid ads (the key): Easy to understand messaging that solves your customer problem paired with **great** video, motion and graphic content is a winning formula. This takes some experimenting with various messages, method of delivery and channels. From experience, targeting particular roles within an org through video ads - motion and short testimonials has been most successful.\n\nHaving someone within your company in control of brand & content strategy, supported by a content creation agency may be your best best for scaling.",
          "score": 2,
          "created_utc": "2026-01-23 00:59:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0wdb4m",
          "author": "History86",
          "text": "10M ARR and no budget?\n\nMore context maybe? What’s your GTM motion? What is the role marketing plays in your firm?",
          "score": 1,
          "created_utc": "2026-01-21 18:19:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0weycm",
              "author": "Champ-shady",
              "text": "GTM is hybrid, marketing role is to generate qualified leads and support sales.",
              "score": 1,
              "created_utc": "2026-01-21 18:27:08",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0wgaya",
                  "author": "History86",
                  "text": "Okay, so is there enough lead at tofu and at bofu? Clear ICP defined?\n\nIs there a problem at delivery quantity or quality of leads?",
                  "score": 2,
                  "created_utc": "2026-01-21 18:33:05",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0wh8bz",
          "author": "aashrun",
          "text": "whats the pain point with ur current marketing strategy tho?",
          "score": 1,
          "created_utc": "2026-01-21 18:37:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0wsach",
          "author": "Worldly_Row1988",
          "text": "I have built several AI workflows for B2B GTM and will be happy to show you how I can help you scale your business. Already doing this for 4 other clients. Ping if interested.",
          "score": 1,
          "created_utc": "2026-01-21 19:25:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0zggka",
              "author": "hjd-1",
              "text": "Interested.",
              "score": 2,
              "created_utc": "2026-01-22 03:39:10",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o13tiqg",
                  "author": "Worldly_Row1988",
                  "text": "Hi check your messages",
                  "score": 1,
                  "created_utc": "2026-01-22 19:49:01",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0x3m3j",
          "author": "kailfarr",
          "text": "Google Ads works well, as long as you have good data and enough budget to let the system optimize. LinkedIn Ads works especially well if you use document ads.",
          "score": 1,
          "created_utc": "2026-01-21 20:17:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0x8c5y",
          "author": "ArtemLocal",
          "text": "At this stage the channel matters less than the wedge. What works is narrowing to one ICP, one pain, one motion that ties directly to revenue. Most teams fail by running five half channels instead of one tight loop. Fast feedback beats scale. Case driven outbound. Product led expansion inside accounts you already won. Content that answers buying objections, not thought leadership. Ads only when you already know the message converts somewhere else. Brand can wait. Pipeline cannot. Which motion has already closed real deals for you in the last 90 days, even if it does not scale yet?",
          "score": 1,
          "created_utc": "2026-01-21 20:39:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0xh5yw",
          "author": "OkDependent6809",
          "text": "we're at \\~$8M ARR so i'm literally in this stage.\n\npaid ads work but they're expensive and cac keeps creeping up. small referral program gets us maybe 8-10% of customers. partnering with sales on demos to test messaging helps.\n\ncontent marketing moves too slow. most \"brand awareness\" stuff is just burning money.\n\nhonestly at this stage it's grinding paid ads and optimizing your funnel. not sexy but it pays the bills. if you find the magic bullet let me know lol.",
          "score": 1,
          "created_utc": "2026-01-21 21:19:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0xy0mx",
          "author": "OkCardiologist1426",
          "text": "Focusing on one or two ICPs is helpful. For tactics, layer display ads into lead generation. And for lead generation do an end to end--the full funnel. Heavy on the top so you can build a database of contacts and then few lead son the bottom that are sales ready and go to sales.",
          "score": 1,
          "created_utc": "2026-01-21 22:38:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0yxadb",
          "author": "algatesda",
          "text": "Hey to grow from current you check your past client base and segregate them industry wise .high LTV of customers who is paying you currently then target them in AEO,SEO and Paid media sure shot you can able to scale it faster .need a strategy and execution  I can help you out",
          "score": 1,
          "created_utc": "2026-01-22 01:49:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0zeaxe",
          "author": "agonsenhauser",
          "text": "The top comment nails the focus piece, but curious how you decide when your messaging is actually \"proven\" enough to move from outbound testing into paid? \n\nAt your stage, scaling too early burns budget and scaling too late leaves money on the table. What metrics or signals do you use to know when it's time? Reply rates hitting a certain threshold? Meeting conversion? Some combo of leading indicators?",
          "score": 1,
          "created_utc": "2026-01-22 03:26:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0zhb7j",
          "author": "shwarma21",
          "text": "tighten your focus to a super specific buyer pain, build a repeatable outreach or referral motion around solving that pain fast, and double down only on the one or two tactics that directly lead to short-cycle deals instead of spreading thin across every channel",
          "score": 1,
          "created_utc": "2026-01-22 03:44:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o11ys5i",
          "author": "tzarhirovito",
          "text": "I’ve been in similar situations where budgets were tight and the team was small, either my own or partners, clients ... what moved it was focusing on a mix of very targeted paid campaigns, highly personalized outreach (LinkedIn + email or just one of those) and making sure the website and landing pages converted efficiently. Honestly, it felt like spinning a lot of plates at first, which is why I ended up hiring a team to handle both ads and outreach, this is for my own case, and i can say it works well under the circumstances",
          "score": 1,
          "created_utc": "2026-01-22 14:46:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o12l75z",
          "author": "Wrong-Finish7655",
          "text": "most b2b under $10m are spread too thin tbh.  \npick one channel you can control and one ICP you already close. double down on outbound + partnerships, not “content.”  \nbrand won’t save this yet.",
          "score": 1,
          "created_utc": "2026-01-22 16:30:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o12ygrb",
          "author": "garselona",
          "text": "DMed you, please check.",
          "score": 1,
          "created_utc": "2026-01-22 17:30:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o12zykr",
          "author": "Corgi-Ancient",
          "text": "If you need quick leads without wasting time on slow content or noisy outbound, tools like SocLeads can help you build accurate contact lists fast from places like LinkedIn and Google Maps. It saves hours on manual work so you can focus on reaching out to the right people now instead of waiting months for brand stuff to kick in. For under $10M ARR, speed and precision in lead gen usually beats broad tactics.",
          "score": 1,
          "created_utc": "2026-01-22 17:37:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1522gs",
          "author": "RomainBlumberger",
          "text": "1. Nail the ICP  \n2. Run fast Blitz messaging campaigns to find the winning messaging  \n3. Ramp this up",
          "score": 1,
          "created_utc": "2026-01-22 23:28:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o196hqb",
          "author": "Dismal_Cartoonist_45",
          "text": "LinkedIn is a good place for B2B company.",
          "score": 1,
          "created_utc": "2026-01-23 15:40:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1amg6h",
          "author": "Chemical_Holiday_239",
          "text": "The only way I survived 'founder burnout' was realizing I can't be creative on demand 24/7. Now I separate 'idea capture' from 'writing'. I dump ideas into audio notes when I'm walking, and then use a tool I built (Beamio) to turn those rough notes into polished posts later. Disconnecting the two tasks saved my sanity.",
          "score": 1,
          "created_utc": "2026-01-23 19:36:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1wezvl",
          "author": "Admirable_Swim_7805",
          "text": "the short answer is dont try to do what the big funded companies do. they can afford to burn money on brand awareness for 12 months. you cant.\n\n\n\nat under 10m arr your focus should be on direct response tactics that show roi fast. that means outbound email linkedin outreach and targeted paid search for high intent keywords only. skip the brand campaigns and longterm content plays.\n\n\n\nalso double down on customer referrals and case studies. your best marketing asset is happy customers who will introduce you to their network. build a referral program that actually rewards people. most companies half ass this and wonder why it doesnt work.\n\n\n\nfor content focus on bottom of funnel stuff. comparison pages how to guides and tools that people use when theyre ready to buy. top of funnel awareness content is a luxury you dont have yet.",
          "score": 1,
          "created_utc": "2026-01-26 21:45:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0wl5n1",
          "author": "Predator6502",
          "text": "Paid ads is probably the easiest way to go from 10mil to 50mil ARR",
          "score": 1,
          "created_utc": "2026-01-21 18:54:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0z5oj6",
          "author": "w23lfe",
          "text": "Asking consultation without pretty clear idea on what you do. I don’t think it is possible. However, I would say don’t leave cold mailing if your resources are limited.",
          "score": 0,
          "created_utc": "2026-01-22 02:36:55",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qlnb4a",
      "title": "how do you guys do lead gen",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qlnb4a/how_do_you_guys_do_lead_gen/",
      "author": "Character_Cable_1531",
      "created_utc": "2026-01-24 13:43:06",
      "score": 15,
      "num_comments": 37,
      "upvote_ratio": 0.84,
      "text": "Hi everyone, I'm in the process of starting a business where the main service helps with lead research and cold outreach. \n\nI'm going to use cold email outreach myself, however I'm just curious if there are any other methods of lead gen that you guys are doing? I've previously scraped leads through apollo and linkedin but reaching a bit of a dead end.\n\nWould really appreciate any help. thanks",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qlnb4a/how_do_you_guys_do_lead_gen/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o1f9ymg",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-24 13:43:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1fioer",
          "author": "Aunker",
          "text": "Cold email works, but it gets way easier when you stack one more channel on top. Best options I’ve seen that don’t need big spend: LinkedIn comments and DMs with people already talking about the problem, niche communities like Reddit and Slack groups, simple Loom audits sent to warm prospects, partnerships with agencies who already have the clients, and retargeting ads to your site visitors once you have traffic. If Apollo scraping feels dead, the issue is usually list quality and targeting, not the channel. Tighter ICP, fewer industries, and better triggers like hiring, new funding, new job posts, or tech changes makes replies jump. What service are you offering and who is your ideal customer?",
          "score": 7,
          "created_utc": "2026-01-24 14:33:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ir2n1",
          "author": "Digi-Dave",
          "text": "I find Google Ads to be a fairly successful platform for B2B lead gen.",
          "score": 3,
          "created_utc": "2026-01-24 23:36:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1fkqk5",
          "author": "MorganJIngram0",
          "text": "You have multiple options here:\n\n1. Cold Calling  \n2. Cold Emailing (already doing this)  \n3. LinkedIn  \n4. Direct Mail  \n5. Referrals \n\n6. Your own network \n\nIf I was in your shoes I would hyper focus on people in your network already. Go into LinkedIn to start sending messages to your 1st degree connections and text people that you know about your offer. This is your low hanging fruit which I always look to focus on first. Also, you don't have to sell all these people...go to people in your network that are willing to do a referral for you because that would be the way to stand out. Then once you start getting results with those people, amp up your cold emailing with the proof from those people. I would suggest doing LinkedIn messaging since you already know email works well. LI messages is just punchy copy.\n\n  \nHope this helps.",
          "score": 2,
          "created_utc": "2026-01-24 14:44:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1xgpws",
          "author": "New_Grape7181",
          "text": "I've found that combining different channels works better than just relying on cold email alone. Email inboxes are so crowded now that even good emails get buried.  \n  \nA few things that worked for us beyond the standard Apollo/LinkedIn scraping:  \n  \nCold calling still converts surprisingly well if you've got a good hook. People aren't expecting it anymore, so if you're helpful rather than pushy, you can actually have real conversations.  \n  \nVideo messages on LinkedIn have been huge for us. Recording a quick 30-second personalised video referencing something specific about their company (recent post, job opening, company news) gets way higher response rates than text. We've seen it jump from around 3% with text to 18-20% with video.  \n  \nAlso, engaging with prospects' content before reaching out makes a massive difference. Comment on their LinkedIn posts genuinely for a week or two, then send your outreach. They recognise your name and you're not just another cold message.  \n  \nThe biggest shift for me was focusing on quality over quantity. 50 highly researched, perfectly timed outreaches beat 500 spray-and-pray messages every time.  \n  \nWhat type of clients are you planning to target with your service?",
          "score": 2,
          "created_utc": "2026-01-27 00:50:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1fb06u",
          "author": "ck_atti",
          "text": "How do you manage cold email outreach by yourself?",
          "score": 1,
          "created_utc": "2026-01-24 13:49:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1fb8tw",
              "author": "Character_Cable_1531",
              "text": "scraping leads and filtering down, and then creating email templated sequences",
              "score": 1,
              "created_utc": "2026-01-24 13:50:39",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1fdabe",
                  "author": "ck_atti",
                  "text": "what is the core of the strategy? \ndo you know enough about proper technical setup of your mailboxes?\nare you sure apollo js the best place to find your target people?",
                  "score": 1,
                  "created_utc": "2026-01-24 14:02:38",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1wlile",
                  "author": "Euphoric-View-9876",
                  "text": "One thing that helped was starting from competitor audiences instead of cold databases whos following similar tools already. You can do it manually at first, but tools like Followerli make that discovery part faster. The big win isnt the tool though, its starting from attention instead of scraping names.",
                  "score": 1,
                  "created_utc": "2026-01-26 22:14:46",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1fb4k2",
          "author": "Wrong-Finish7655",
          "text": "for scale, cost matters more than people admit.  \nwe moved to cheaper verified sourcing (leadcourt) so we could pull bigger pools and aggressively filter without stressing spend. that unlocked volume again.  \nare you optimizing for accuracy or reach right now?",
          "score": 1,
          "created_utc": "2026-01-24 13:49:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1fcun3",
          "author": "madhuforcontent",
          "text": "Through my blog",
          "score": 1,
          "created_utc": "2026-01-24 14:00:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1fmv7p",
          "author": "NecessarySoftware569",
          "text": "Automate it across different platforms , saves me a bunch of time",
          "score": 1,
          "created_utc": "2026-01-24 14:55:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1fpq02",
          "author": "jeeves_inc",
          "text": "We’re in a similar space (lead research + outreach), and honestly the biggest shift for us was stopping the idea that lead gen = just scraping + blasting.\nCold email still works, but only as a distribution layer, not the core strategy. When it’s the first touch and there’s zero context, it’s brutal now.\nWhat’s worked better for us:\nBe visible before you reach out.\nPosting useful stuff (not pitchy) on LinkedIn, commenting thoughtfully on other people’s posts, being active in communities like this one. When someone later gets an email from you, there’s at least some “oh, I’ve seen this name before.”\nProblem-first targeting instead of tool-first scraping.\nApollo/LinkedIn are fine, but lists perform way better when they’re built around a specific trigger (hiring, new funding, tech change, recent post, etc.). Fewer leads, much higher reply rates.\nWarm intros > cold volume.\nPast clients, ex-coworkers, partners, even “hey do you know anyone who…” messages. Not scalable on paper, but they compound fast when you’re early.\nSmall events / niche meetups.\nNot big conferences. Local or industry-specific stuff where you can actually talk to people. Those conversations turn into deals later even if nothing happens immediately.\nContent as trust, not demand gen.\nWe’ve seen more success when people understand how we think before sales ever comes up. By the time outreach happens, it doesn’t feel cold anymore.\nTL;DR: cold outreach isn’t dead, but using it as the first impression is. Lead gen works better when sales shows up after familiarity, not before.\nHope that helps, happy to answer follow-ups.",
          "score": 1,
          "created_utc": "2026-01-24 15:10:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1fvulv",
              "author": "Paulthesecond9",
              "text": "Agree with everything you said! The only problem is that it’s not realistic to rely on the fact that people that you email have heard about your business, so unfortunately it will almost always be the “first touch”.",
              "score": 1,
              "created_utc": "2026-01-24 15:40:40",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o1uent5",
              "author": "Pale_Ad_1800",
              "text": "This matches what I’ve been seeing too. The biggest change for me is realizing that “cold” is really just a timing issue now — not a channel issue. When there’s no context, people assume risk and ignore. When there *is* context, the same email suddenly feels reasonable. The trigger-based targeting point is especially important. Fewer leads but higher intent almost always beats volume, even if it feels counterintuitive at first. Curious — have you noticed certain triggers consistently outperforming others, or does it vary a lot by industry?",
              "score": 1,
              "created_utc": "2026-01-26 16:32:26",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1gijw4",
          "author": "AfraidHelicopter1569",
          "text": "Cold email is good, but if you could find people that are looking for help in reddit, it would be even better. For this, I'm using a reddit lead gen that automatically find right conversations for your business.",
          "score": 1,
          "created_utc": "2026-01-24 17:23:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1hcrq3",
          "author": "fiq-43",
          "text": "Cold email and linked in",
          "score": 1,
          "created_utc": "2026-01-24 19:34:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1jcb5q",
          "author": "Electronic-Cat185",
          "text": "cold emaiil works but it gets much better when it is paired with signal based lead gen. instead of scrapiing more names focus on finding moments when someone actually has a problem like job changes new fundiing tool switches or public complaints. content and community replies can also generate warmer leads over time even if volume is lower. the dead end usually means the liist is the problem not the channel",
          "score": 1,
          "created_utc": "2026-01-25 01:28:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1jgl1x",
          "author": "aaro-ai-2024",
          "text": "Cold email to figure out who might be interested -> connect on LinkedIn -> follow up with text, phone call or canvas",
          "score": 1,
          "created_utc": "2026-01-25 01:52:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1k1d3k",
          "author": "algatesda",
          "text": "I am using cold calling and voice agent to book appointments.Linekdin DM with automation also working for me .But use it with understanding the LI DM limit policy",
          "score": 1,
          "created_utc": "2026-01-25 03:49:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1l2mvb",
          "author": "harryonlyfan",
          "text": "We started getting consistent inbound leads through organic SEO and on-site optimization. Happy to share what worked for us if anyone’s interested.",
          "score": 1,
          "created_utc": "2026-01-25 08:19:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1zgv8c",
              "author": "Deepdive_8197",
              "text": "Hey I would be! Could you dm me?",
              "score": 1,
              "created_utc": "2026-01-27 08:55:40",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1ltfzk",
          "author": "Commercial-Job-9989",
          "text": "Now days there are many AI assistant which handles inbound and outbound calls and helps in generating leads and also easy to use. \n\nAI assistant helps to reduce missed calls, record call summary also provides text to speech and speech to text also you can customise your workflow accordingly. It also sends hot mail to sales teams as a result it increases sales .",
          "score": 1,
          "created_utc": "2026-01-25 12:12:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ml0ro",
          "author": "Dangerous_Bowler3286",
          "text": "I’ve seen this a lot, and the dead end usually isn’t the channel  it’s how lead gen is being approached.\n\nCold email still works, but only when it’s part of a broader lead-generation workflow, not just scraping lists and blasting them.\n\nWhat’s worked better for me:\n\nStart with intent signals: hiring related roles, funding/growth, product launches/expansion. Smaller lists hit harder.\n\nUse social for research, not scale: LinkedIn/Twitter to spot signals + find decision-makers + grab context, then move off-platform.\n\nCold email is still the best entry: it’s the most consistent way to start conversations at scale.\n\nFollow-ups do most of the lifting: most replies come after 2–4 touches, not email #1.\n\nMake it one flow: company discovery → contacts → send → follow-ups → handle replies. The goal isn’t more scraped leads, it’s more booked conversations.\n\nIf you share your niche + offer + target titles, I can suggest a few high-intent triggers to build lists around.",
          "score": 1,
          "created_utc": "2026-01-25 14:59:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1o6dkl",
          "author": "Altruistic-Classic72",
          "text": "In person networking events for your ICP works great! But you kinda need to be in a nice spot, if you live in the middle of nowhere it might not be the right move.",
          "score": 1,
          "created_utc": "2026-01-25 19:07:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ry9zh",
          "author": "Ok-Race-479",
          "text": "We use a mix: cold email + LinkedIn (manual outreach, not just Apollo), landing pages with lead magnets, partnerships/referrals, and sometimes paid ads (LinkedIn/Facebook) for narrow niches. We also upsell inbound leads through content and case studies. One channel rarely works consistently a combo works better",
          "score": 1,
          "created_utc": "2026-01-26 06:46:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1s3ucb",
          "author": "Lower-Instance-4372",
          "text": "google “how to create an evergreen cold email campaign“ and read an article on this topic\n\nthis is the best performing campaign type so worth looking into",
          "score": 1,
          "created_utc": "2026-01-26 07:32:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1sjksh",
          "author": "Far_Competition_8269",
          "text": "Je prêche ma paroisse car je publie chaque jour sur LinkedIn mais c'est une stratégie long-terme qui t'apportera du lead, mais pas que. \n\nQuand tu publies sur LinkedIn, tu créés une communauté / tu créés un avantage concurrentiel en devenant top of mind sur ton sujet. \n\nDe plus, en devenant top of mind, tu deviens chassé au lieu d'être chasseur : c'est tout l'enjeu. En publiant, tu ne fais pas qu'avoir des leads, tu te créés une expertise et les leads qui viendront à toi, seront déjà convaincus par ta solution. Tu es devenu un expert, et plus un vendeur. Cela prend du temps, mais ça a tellement d'autres avantages : \n\n\\-> construction de ton réseau pro \n\n\\-> rencontre avec d'autres paires de ton secteur pour le partage d'info \n\n\\-> tu attireras plus de candidats quand tu recruteras",
          "score": 1,
          "created_utc": "2026-01-26 09:53:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1uefq3",
          "author": "Corgi-Ancient",
          "text": "If cold email and scraping from Apollo and LinkedIn feels stuck try mixing in leads from other platforms like Google Maps or Instagram. Tools like SocLeads can help pull and verify leads from those places fast so you don’t waste time on bad data. It might open up new angles for outreach beyond the usual spots.",
          "score": 1,
          "created_utc": "2026-01-26 16:31:28",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qnnhyw",
      "title": "I own a $120,000 a month cold email agency and here's what you can use:",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qnnhyw/i_own_a_120000_a_month_cold_email_agency_and/",
      "author": "Unhappy_Shock_6203",
      "created_utc": "2026-01-26 18:00:16",
      "score": 11,
      "num_comments": 13,
      "upvote_ratio": 0.72,
      "text": "Hey everyone,\n\nI want to do a post personally to explain some tips and tricks for new cold emailers.\n\nBefore getting into the post - side note if you are not interested or you are just going to attack just ignore this post it wasn’t meant for you.\n\nWe send 7-8 million cold emails across 89 different clients and setup more than 5000 campaigns. We work with financial service firms, marketing companies, recruitment firms, manufacturing firms, saas companies, 3pl (transportation firms) etc.\n\n**Cold email is not easy but I will give some insights.**\n\n1. Dont send any links at all in the first email. People say this but they dont know the reason behind. Blacklist providers like Spamhouse ZEN and Braccuda actually look at the spam reports and a link is associated with spam - even if you are not spamming. \n2. Leads currently we target are smtp and google. Sometimes we blend office 365. If you buy an old domain and do an office 365 setup and have a non sales script you can actually get 1-2% reply rates. We have done a lot of testing and if anyone has any questions regarding office 365 deliverability I am happy to answer.\n3. Include and test with gmail leads. These are 50-50 sometimes good sometimes bad. They are not approached as much as Google Apollo leads. This works well especially if you are targeting small local businesses and when you have a narrow tam.\n4. Have a diversified setup. Never rely fully on google or outlook always balance out. Always have a 60-40 or 50-50 split. Deliverability is fragile sometimes outlook is good and sometimes google make sure you balance it out.\n\nLet me know if anyone has any questions.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qnnhyw/i_own_a_120000_a_month_cold_email_agency_and/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o1uz01m",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-26 18:00:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1wbr43",
          "author": "Admirable_Swim_7805",
          "text": "this is solid advice especially the part about not sending links in the first email. most people dont realize email providers scan for links and domains and if youre new or using a fresh domain every link makes you look more like spam.\n\n\n\nthe 5050 split on google and outlook is key too. diversification saves you when one platform decides to crack down. we learned this the hard way when google updated their filters and tanked our deliverability for a week.\n\n\n\none thing id add is warm up your domains properly before sending at scale. even if you buy an aged domain you still need to gradually increase send volume over 23 weeks. jumping straight to high volume is a quick way to get blacklisted.\n\n\n\nalso test your emails with mail tester or glockapps before launching campaigns. catches a lot of issues early like spf dkim or content flags that hurt deliverability.",
          "score": 2,
          "created_utc": "2026-01-26 21:30:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1vd64j",
          "author": "KissyyyDoll",
          "text": "this is super helpful thanks for sharing. i always wondered about the link thing in the first email because i see so many people still doing it. that 50-50 split between google and outlook makes a lot of sense too especially with how moody deliverability can be lately. appreciate the tips",
          "score": 1,
          "created_utc": "2026-01-26 18:59:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1vo3at",
          "author": "Radiant-Security-347",
          "text": "so this is how I fool the spam filters, eh?",
          "score": 1,
          "created_utc": "2026-01-26 19:46:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1wvd0j",
          "author": "CCMALLC",
          "text": "Thanks for the intel!",
          "score": 1,
          "created_utc": "2026-01-26 23:01:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1x4lun",
          "author": "Adjudica",
          "text": "You do niche specific work?",
          "score": 1,
          "created_utc": "2026-01-26 23:48:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1xo30c",
          "author": "Dickskingoalzz",
          "text": "Didn’t I just see this post a few days ago? Word for word?",
          "score": 1,
          "created_utc": "2026-01-27 01:30:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1xsmv1",
          "author": "InnerBuilding7949",
          "text": "Super surprised in what you delivered (millions of mails), 5000 campaigns 😂. Wish your business continues with success",
          "score": 1,
          "created_utc": "2026-01-27 01:55:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ynnfr",
          "author": "Aggravating_Bug_3326",
          "text": "May I know your business name?",
          "score": 1,
          "created_utc": "2026-01-27 04:56:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1zcfo1",
          "author": "Thymen-WPM",
          "text": "How do you make your inboxes? I’ve used premium inboxes as they offer just the professional workspace but just the e-mail adres. Don’t really like the interface so I’m looking for something new",
          "score": 1,
          "created_utc": "2026-01-27 08:14:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1zn9ha",
          "author": "MendMySoulXoXo",
          "text": "Your MRR went from 120k to 154k real quick 😭",
          "score": 1,
          "created_utc": "2026-01-27 09:55:22",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qmzupk",
      "title": "I tried to see if ChatGPT would recommend my product",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qmzupk/i_tried_to_see_if_chatgpt_would_recommend_my/",
      "author": "Stepbk",
      "created_utc": "2026-01-25 23:54:58",
      "score": 10,
      "num_comments": 10,
      "upvote_ratio": 0.92,
      "text": "Out of curiosity, I started asking ChatGPT the same types of questions a buyer would ask, just phrased in slightly different ways.\n\nWhat surprised me wasn’t whether my product showed up or not. It was how stable the recommendations were across similar prompts. Some names felt “locked in” as defaults, while others only appeared in very narrow scenarios.\n\nThat made me realize this isn’t about gaming a single answer. It’s about understanding the situations where your product even belongs in the conversation.\n\nIs anyone else testing this from a buyer-intent angle rather than a pure marketing one?\n\n",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qmzupk/i_tried_to_see_if_chatgpt_would_recommend_my/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o1pywvc",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-25 23:54:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1pzf6g",
          "author": "ellensrooney",
          "text": "This matches what I’ve been seeing. The stability is the signal. Once a tool becomes a default in the model’s head, it keeps showing up unless the question is very niche.\n\nI started using Meridian to sanity-check this because manual prompt testing gets messy fast. Seeing which prompts actually trigger mentions made it clear this is about recall, not ranking.\n\nWhat helped it click was thinking about tools like Semrush or Ahrefs. They didn’t win on one feature. They won because people describe them the same way, for the same jobs, over and over.\n\nThe biggest change for me was tightening language around one clear job-to-be-done instead of listing features. When the association is narrow and obvious, the model seems much more consistent about when it mentions you.",
          "score": 5,
          "created_utc": "2026-01-25 23:57:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1q1gcu",
          "author": "MoistGovernment9115",
          "text": "Reading real forum posts and copying how people describe the problem in their own words, and avoiding feature-heavy phrasing when testing prompts. The clearer the problem statement, the more consistent the recommendations seem to be.",
          "score": 2,
          "created_utc": "2026-01-26 00:07:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1xfy59",
          "author": "amoorthy",
          "text": "I'm not sure what you mean by \"buyer intent angle rather than pure marketing one\". Since the dawn of Google, hasn't marketing been thinking about what queries their buyers are asking and trying to answer them?",
          "score": 2,
          "created_utc": "2026-01-27 00:46:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1pzizo",
          "author": "kubrador",
          "text": "this is actually smart. you're basically doing competitive analysis through the ai's training data instead of pretending you can prompt-inject your way to the top. the \"locked in defaults\" thing is just showing you which vendors won the mindshare battle years ago when the model was trained, which is way more useful intel than a ranking.",
          "score": 1,
          "created_utc": "2026-01-25 23:57:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1q1a77",
          "author": "Weird-Director-2973",
          "text": "I think the buyer-intent angle is the right one. When I stopped asking “will it recommend me” and started asking “when would it make sense to recommend me,” things got clearer.",
          "score": 1,
          "created_utc": "2026-01-26 00:06:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1q1dt6",
          "author": "Significant_Pen_3642",
          "text": " I did save the exact prompts where recommendations felt stable and treat those as the baseline. Then I worked backwards from those questions instead of trying to force visibility everywhere. It’s way more useful than chasing one-off mentions.",
          "score": 1,
          "created_utc": "2026-01-26 00:06:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1whkr9",
          "author": "Admirable_Swim_7805",
          "text": "Interesting experiment this is where working on AI optimization starts to matter beyond just SEO we need to think about token level visibility and context awareness making sure brand name associations and use cases are properly documented across all public facing content because thats where models are pulling from during inference",
          "score": 1,
          "created_utc": "2026-01-26 21:56:42",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qkulib",
      "title": "I run a 6-figure B2B outbound agency, and here are the best tips for your email campaign",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qkulib/i_run_a_6figure_b2b_outbound_agency_and_here_are/",
      "author": "decaster3",
      "created_utc": "2026-01-23 15:58:07",
      "score": 10,
      "num_comments": 5,
      "upvote_ratio": 0.81,
      "text": "Ran outbound for 50+ B2B clients, shipped hundreds of thousands of emails, tested stuff every month like unhinged lab rats. Most advice online is either outdated or written by people who sent 3 campaigns and declared themselves gurus. So here’s the short list of what really worked.\n\n**1/spray & pray is dead. Like fax machines dead**\n\nIf you’re still blasting ‘20–500 employees’ and calling it targeting, congrats, you’re just burning enrichment credits faster, but once you know why this company is interesting, the copy basically writes itself.\n\n**2/your first email does all the work, the rest are emotional support**\n\nEmail #1 gets the replies\n\nEmail #2 sometimes\n\nEmail #3 is already on thin ice\n\nEmail #4+ is just you refusing to let go\n\nInstead of adding follow-ups like it’s a breakup text, rework the offer and relaunch the sequence in 2 months. They won’t remember you, cuz you’re not that special (sorry).\n\n**3/stop running 7–9 step sequences, nobody wants that**\n\nOur best campaigns are 3-4 emails max:\n\na/clear pitch\n\nb/context / why you\n\nc/frictionless CTA (’want a quick audit?’ / ‘want the resource?’)\n\nAfter that - pause, rethink, fix the offer.\n\n**4/inbox volume matters more than your clever copy**\n\nWe cap at 40-50 emails per inbox per day, never more, if replies <1%, something’s broken (usually deliverability)\n\nDon’t waste time playing seed-list bingo, just rotate domains and rewrite the copy.\n\n**5/timing > leads being ‘used once’**\n\nPeople treat TAM lists like one-shot Pokemon cards.\n\nReality: timing changes, budgets change, fires appear.\n\nWe recycle TAM every 6 month with new angles. A ‘no’ six months ago is often just ‘not right now’ moment\n\n**6/test offers, not button colors**\n\nEveryone A/B tests subject lines like it’s 2016.\n\nWe test what we’re offering like:\n\n\\-save time vs make money\n\n\\-case study first vs pain first\n\n\\-which persona responds to which angle\n\nThat’s where real lifts come from.\n\n! One extra tip - **less poetry, more receipts**\n\nAnalogies rarely land, real signals do (hiring pages, tech stack changes, Series A, Intercom rollout, recent posts)\n\nCall out something they actually care about and you sound human without trying too hard.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qkulib/i_run_a_6figure_b2b_outbound_agency_and_here_are/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o19ag2a",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-23 15:58:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1xg0tr",
          "author": "New_Grape7181",
          "text": "I've noticed the same thing with recycling lists. We had a segment that went completely cold in Q1, then ran them again in Q3 with a different hook (focused on a new pain point their industry was facing) and got 4x the response rate.  \n  \nOne thing I'd add to your timing point is video seems to cut through better when you're hitting people the second or third time round. First touch they ignored the text email, but a 30-second personalised video referencing something specific about their company gets attention. It's harder to ignore a face talking directly to you than another wall of text.  \n  \nThe offer testing bit is spot on. We wasted weeks testing subject lines that moved the needle maybe 1-2%, then tested \"free audit\" vs \"here's what we found about your site\" and replies jumped 18%.  \n  \nWhen you're recycling your TAM every 6 months, are you changing up the channel at all or staying purely email?",
          "score": 1,
          "created_utc": "2026-01-27 00:47:05",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qip96w",
      "title": "Looking for Marketing suggestion",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qip96w/looking_for_marketing_suggestion/",
      "author": "harryonlyfan",
      "created_utc": "2026-01-21 05:24:19",
      "score": 8,
      "num_comments": 18,
      "upvote_ratio": 0.91,
      "text": "I run a cannabis eCommerce business, but I’m not sure which marketing strategies are most effective for increasing traffic and generating revenue. I’ve read several articles and gathered different ideas, but before moving forward, I’d love to hear real experiences. If anyone is willing to share suggestions or insights, I’d really appreciate it.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qip96w/looking_for_marketing_suggestion/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o0t0vx7",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-21 05:24:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0tsirs",
          "author": "Sea-Environment-5938",
          "text": "If I had to pick one channel to build long-term in cannabis: SEO for high-intent queries. Not \"what is THC\" blog fluff think \"best (product) for (use case)\", \"near me\" modifiers (if applicable), comparisons, and \"how to choose\" pages that push to collection pages. \n\nBuild a content cluster per category and internally link aggressively to money pages.  \nDo you have enough products/categories to build 20-50 dedicated landing pages?",
          "score": 3,
          "created_utc": "2026-01-21 09:28:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0t7kt4",
          "author": "Fit_Path_6450",
          "text": "Focus collection pages.\n\nUnlike other niches, cannabis Ecom don't have many options in ads. SEO is your #1 channel.\n\nBut you can't rely on blog traffic..\nYou need traffic that convert.\n\nFor the last 6 years, I've been building links for some big players in cannabis industry and all of them prioritize their collection/products pages.\n\nMy suggestion:\n\n- pick your top performing collection pages.\n- finalize your anchor and landing pages.\n- start building links from relevant cannabis sites.\n\nBut don't press the padel blindly. \n\n- make anchor variations \n- divide links to home page + blogs + collection pages \n\nPlus check the competition on SERP, filter out the low hanging fruits first and target them.\n\nCannabis keywords are highly competitive and you might not be able to outrank big players with small budget.\n\nPro tip: I'm not saying that don't publish the blogs but focus more on money pages. You should push the pages that's gonna generate revenue for you.\n\nThis is what other successful cannabis companies are doing. Happy to share more insights and case studies if you need more help.",
          "score": 2,
          "created_utc": "2026-01-21 06:16:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0tkf13",
              "author": "Fresh-Shirt8047",
              "text": "This",
              "score": 1,
              "created_utc": "2026-01-21 08:10:33",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0tb2ts",
          "author": "kubrador",
          "text": "just accept that half your best marketing channels will deplatform you for selling the devil's lettuce and build an email list before they do.",
          "score": 2,
          "created_utc": "2026-01-21 06:46:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0wi6c6",
          "author": "Wrong-Finish7655",
          "text": "this is way too vague tbh. cannabis ecommerce lives or dies on repeat + owned channels, not “traffic.”  \npick one: email/sms retention, seo around product + education, or compliant paid traffic — not all three.  \nhappy to go deeper if you want?? dm me.",
          "score": 2,
          "created_utc": "2026-01-21 18:41:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0t2wib",
          "author": "MassiveMacaron170",
          "text": "Quick reality check: most cannabis eCom stores don’t fail because of traffic, they fail because they chase blocked channels and ignore conversion + owned media.\n\nWhat’s worked in real cases: SEO built around buyer intent (not blogs for the sake of blogs), email/SMS done properly, strong landing pages, and content that educates without triggering ad bans.\n\nIf you want, happy to sanity-check what you’re planning and tell you what’s actually worth doing vs wasting time.",
          "score": 1,
          "created_utc": "2026-01-21 05:39:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0t78a7",
          "author": "backlinksprovider",
          "text": "To increase your traffic and revenue you need to foucs on getting quality backlinks from high authority sites that will boost your websites and get you rank on top plus you should focus on good quality content too. On if my client is working on nicotine pouches in US we started with a brand new site and after starting our link building project our site DA was increased to 12 and now we are getting traffic of 300/day. If you need any help with link building let me know, i would love to discuss",
          "score": 1,
          "created_utc": "2026-01-21 06:13:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0u0l8t",
          "author": "signal_loops",
          "text": "for cannabis eCommerce, the biggest levers are SEO, content, and owned channels not paid ads. focus on search driven education local SEO if applicable, and email/SMS for repeat purchases . influencer and UGC on platforms that tolerate cannabis adjacent content can work, but consistency matters. paid ads are limited, so growth usually comes from organic traffic, retention, and partnerships rather than quick wins.",
          "score": 1,
          "created_utc": "2026-01-21 10:43:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0vb9qj",
          "author": "JMALIK0702",
          "text": "The most reliable stack I’ve seen is: SEO + content that answers buyer intent (effects, formats, dosage guides, “best for sleep/anxiety/pain” style pages where legal), strong email/SMS capture with flows (welcome, abandon cart, post-purchase, replenishment), and a tight repeat purchase engine (bundles, subscriptions if allowed, loyalty, referral). For acquisition, lean harder on influencers/affiliates, creator partnerships, and educational content distribution, because it stays compliant longer than “buy now” ads. Also make sure basics are airtight: age gating, geo compliance, shipping rules by state, and clear policies because that trust layer matters more in regulated categories.",
          "score": 1,
          "created_utc": "2026-01-21 15:29:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o12owpw",
          "author": "Pristine_Battle_2636",
          "text": "I would build a system for emails since it is the only thing you can control.",
          "score": 1,
          "created_utc": "2026-01-22 16:47:11",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qkbdsr",
      "title": "I mapped out a complete \"Inbound + Outbound\" growth stack for B2B SaaS (Tools, Costs, and Daily Volume limits)",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qkbdsr/i_mapped_out_a_complete_inbound_outbound_growth/",
      "author": "Aggressive_Light7892",
      "created_utc": "2026-01-23 00:11:05",
      "score": 8,
      "num_comments": 14,
      "upvote_ratio": 0.9,
      "text": "**This is gonna be completely helpful if you are an early stage founder doing everything by yourself.** \n\nI talk to a lot of founders who are trying to scale their ARR but get stuck in \"tool hell\"—buying random subscriptions without a cohesive system.\n\nOver the last few months, I’ve been refining a growth engine specifically for B2B SaaS. The goal was to maximize volume while keeping costs predictable. I wanted to share the current stack, the monthly burn, and the daily activity targets we hit.\n\nIf you are trying to build an internal growth team, feel free to steal this setup.\n\n# The Outbound Stack (Cold Outreach)\n\nThis is the heavy lifting. The goal here is direct contact with decision-makers.\n\n**Email Infrastructure** We run a hybrid setup to balance deliverability with volume.\n\n* **Data & enrichment:** Apollo io + Leadmagic\n* **Sending Infra:** Smartlead (for volume) + Lemlist (for high-touch/personalized sequences)\n* **Inbox Management:** Maildoso (essential for domain rotation)\n* **Verification:** Listkit\n* **Estimated Cost:** \\~$700 - $900/month depending on seat count.\n\n**LinkedIn Automation**\n\n* **Targeting:** Sales Navigator (Non-negotiable for B2B)\n* **Automation:** Expandi (Safe limits) + Waalaxy\n* **Daily Volume Target:** \\~40 Connection requests/day + 20 targeted DMs.\n\n**Twitter & Reddit (Guerrilla Outbound)** We use native web interfaces here to avoid API bans. It’s manual but effective.\n\n* **Twitter:** \\~100 DMs/day (requires warmed accounts).\n* **Reddit:** Up to \\~250 DMs/day (split across multiple accounts/niches).\n* **Cost:** $0 (Time-intensive).\n\n\n\n\n\n# The Inbound Stack (Content & Nurture)\n\nOutbound captures attention; Inbound builds trust so they actually reply. We aim for high-frequency \"sweat equity\" over paid ads.\n\n**Newsletter & Long-form**\n\n* **Tools:** Beehiiv (Newsletter) + Medium (SEO/Syndication)\n* **Cadence:** 3 emails/week. We treat the newsletter as a product, not just a notification channel.\n\n**Social Content Engine** This is where most founders burn out. The key is batching.\n\n* **LinkedIn:** 1 Post/day (Carousels work best here) + 5 strategic comments on big accounts (using Buffer).\n* **Instagram:** Meta Business Suite. Target: 6 Reels/day (repurposed short-form clips).\n* **Reddit:** 10 posts/day across 10 different relevant subreddits.\n* **Tools:** Canva (Visuals) + Buffer (Scheduling).\n* **Cost:** Mostly $0 for software, high cost in labor.\n\n\n\n\n\n# The Summary\n\n* **Total Monthly Tech Cost:** \\~$1,000 - $1,200 (varies by seat count)\n* **Total Daily Touchpoints:** 500+ across all channels.\n\n**My takeaway:** The tools are the easy part. The hard part is the consistency. Sending 100 emails is easy; sending emails every day for 90 days while managing replies, fixing broken domains, and producing 6 reels a day is where the scaling actually happens.\n\nI’m currently running this full engine for a few SaaS partners. It’s a beast to manage, but the pipeline looks healthy.\n\n**Question for the group:** For those scaling past $10k MRR, are you finding better ROI on high-volume email or high-effort LinkedIn content right now? I'm seeing a shift back to LinkedIn lately.\n\n",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qkbdsr/i_mapped_out_a_complete_inbound_outbound_growth/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o15a4is",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-23 00:11:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o15ewyi",
          "author": "kubrador",
          "text": "ah yes, the classic \"i've automated my way into a full-time job managing automations\" growth stack. you've basically described hiring yourself 3 times over while paying $1,200/month for the privilege.\n\nthe real question is whether spending 6 hours daily on reddit posts and instagram reels is actually scaling or just elaborate procrastination with a spreadsheet.",
          "score": 5,
          "created_utc": "2026-01-23 00:36:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1aiax4",
              "author": "Aggressive_Light7892",
              "text": "Well you can always hire a VA for those. Or I can help with this entire execution if you'd like.",
              "score": 0,
              "created_utc": "2026-01-23 19:16:39",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1bslq5",
          "author": "agonsenhauser",
          "text": "This is a solid setup, but I'm curious about the conversion side. With 500+ daily touchpoints across all these channels, what are you actually seeing in terms of reply rates and qualified pipeline from each? \n\nThe volume game makes sense early on, but the ROI math gets interesting when you start tracking which channels actually convert. Would be helpful to know if you're seeing, say, 2% reply rates on cold email vs 8% on warmed LinkedIn vs whatever Reddit/Twitter is doing. That breakdown would help validate whether spreading across this many channels beats going deeper on the 1-2 that actually move the needle.",
          "score": 2,
          "created_utc": "2026-01-23 22:57:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o15n8wt",
          "author": "aimdoc-ai",
          "text": "On the inbound side, those are definitely the right tools for generating content that can drive inbound, but there are also tools that help improve the B2B SaaS inbound buyer experience on the whole. We're actually building an AI buyer copilot specifically for B2B SaaS.\n\nIt can essentially categorize visitors by conversational intent (customer, prospect, trial user, etc.), qualify (is a prospect), schedule demos and will soon even be able to demo the software.\n\nI also think visitor ID (like RB2B, etc.) triggered outbound sequences can be powerful for B2B saas, if you make sure you are filtering by your ICP.",
          "score": 1,
          "created_utc": "2026-01-23 01:21:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1a99dz",
          "author": "Tiny-Celery4942",
          "text": "This is super helpful. I have seen so many founders get lost in the tool jungle. It is good you are sharing what works.\n\nFor us, LinkedIn content is doing better now. Email was great for a while, but it feels like everyone is getting so many emails that it is hard to stand out. LinkedIn feels more personal, and people are more likely to see your stuff if you are putting out good content.\n\nHere is how we do it:\n\nWe use Sales Navigator to find the right people. Then, we use Depost AI to create custom lists, engage few time to warm, then use depost ai to send connection requests and messages. For content, we plan everything out at the start of the week and use Depost AI to schedule posts. This way, we do not have to think about it every day. We also spend time commenting on other people's posts to get our name out there. It takes work, but it is worth it. What do you think?",
          "score": 1,
          "created_utc": "2026-01-23 18:35:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1aiq27",
              "author": "Aggressive_Light7892",
              "text": "Well, Email is still a volume game and needs ruthless targeting on ICP. And yes, LinkedIn does get you more visibility and brand authority.",
              "score": 1,
              "created_utc": "2026-01-23 19:18:38",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1bkgvi",
          "author": "SharpInsect3636",
          "text": "The part that gets tricky with stacks like this is that volume and coordination start compounding faster than learning. Once you are touching 500 plus people a day across channels, attribution gets fuzzy and it becomes hard to tell which signals are actually moving pipeline versus just keeping the machine busy. That is usually when founders feel productive but lose clarity on what to double down on. Curious whether you are seeing clean patterns in what actually converts or mostly blended lift.",
          "score": 1,
          "created_utc": "2026-01-23 22:16:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1l97bu",
          "author": "the-it-guy-og",
          "text": "Hi GPT",
          "score": 1,
          "created_utc": "2026-01-25 09:16:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1xddbb",
          "author": "New_Grape7181",
          "text": "I'd be curious how you're handling personalisation at that volume. 500+ daily touchpoints sounds great on paper, but I've found quality drops off fast when you're trying to scale that hard.  \n  \nWe scaled back from around 300 contacts/day to about 80 and actually saw better results. The difference was adding a 20-second personalised video to each LinkedIn DM and top-tier email prospect. It's more labour-intensive, but our reply rate went from about 4% to 18%.  \n  \nThe video doesn't need to be fancy. Just screen record their website or LinkedIn profile and talk through one specific observation about their business. Takes maybe 2 minutes per prospect once you get the rhythm down.  \n  \nI think the real unlock isn't more touchpoints, it's making each one feel less like spam. Especially on LinkedIn where everyone's running the same Expandi sequences now.  \n  \nWhat's your current reply rate across channels with this setup?",
          "score": 1,
          "created_utc": "2026-01-27 00:33:29",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qo6xaf",
      "title": "What’s the most popular CMS setup for B2B SaaS companies?",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qo6xaf/whats_the_most_popular_cms_setup_for_b2b_saas/",
      "author": "Fred-swe",
      "created_utc": "2026-01-27 07:10:23",
      "score": 7,
      "num_comments": 17,
      "upvote_ratio": 1.0,
      "text": "I’m working at a SaaS scale up and currently run our website on Wordpress with outsourced hosting and development. What alternatives do we have? In-house or outsourced dev? Hourly cost for dev?\n\nWordpress and cloud hosted?\n\nWebflow?\n\nHubSpot cms?\n\nImportant to have quick and efficient development and good access to talent. ",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qo6xaf/whats_the_most_popular_cms_setup_for_b2b_saas/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o1z5742",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-27 07:10:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1zc8q6",
          "author": "dOdrel",
          "text": "you have a plethora of options, if you already have wordpress and are mostly satisfied with it, just stick with it. if you don’t like the design or want faster load times, you can also use it as a headless CMS and use your own customer facing frontend solution.  in this line you can also look into Strapi. \n\ndeveloping your own makes sense only if you have special needs that no other solves, or you have the resources to develop one (internal or external). \n\nhourly rate depends a LOT on location and expertise, cheap offshore devs might do it for 10-20 bucks an hour, decent US/EU agencies might bill you over 100. a reasonable middle way is eastern europe with around 40-60. most of the times (but not always) you pay what you get for - don’t cheap out, quality will be terrible.",
          "score": 2,
          "created_utc": "2026-01-27 08:12:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o20l9nl",
              "author": "Fred-swe",
              "text": "Currently I pay around 80euro/h for a European dev company. I think it’s expensive. A couple of new moudules easily cost 5000-10000 euro to develop, test and deploy inc project management",
              "score": 1,
              "created_utc": "2026-01-27 13:56:30",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1z6m7l",
          "author": "theninjadesigner",
          "text": "You can also try Framer CMS, i am quite happy with it.",
          "score": 1,
          "created_utc": "2026-01-27 07:22:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1z8x2q",
          "author": "kubrador",
          "text": "hubspot cms if you want marketing to stop bugging engineering about landing pages, wordpress if you enjoy paying someone $80/hr to fix plugin conflicts at 2am. webflow's great until you need literally anything custom, then you're back to hiring developers anyway.",
          "score": 1,
          "created_utc": "2026-01-27 07:42:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1zc7uq",
          "author": "corwinsword",
          "text": "based on my experience it's Webflow and Framer now",
          "score": 1,
          "created_utc": "2026-01-27 08:12:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1zccjx",
          "author": "Exciting-Sir-1515",
          "text": "Define what you want to do first then look for solutions eg. A/B test, landing pages, blog posts, Personalisation, multi-language …..\n\nWhat you’ve said literally gives you a million options….",
          "score": 1,
          "created_utc": "2026-01-27 08:13:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1zlfqg",
          "author": "Just-a-torso",
          "text": "Taking everything into account I still think WP is the winner. It went downhill a few years ago but the recent updates have been great. If you know what you're doing you can do most things without dev support now. And, importantly for you, it scales up nicely. But the one caveat is, if you don't know what you're doing, it's very easy to end up with some Frankenstein horror show of broken plugins and dependencies.\n\nWebflow is good if you want to make a little portfolio site but it's a nightmare (and expensive) if you want to scale or do anything custom. I've been hearing good things about Framer as a Webflow replacement. \n\nHubspot if you already use it behind the scenes, but it's super limited. \n\nThere are also things like Adobe Experience Manager or Craft, but they're fully Enterprise and probably overkill.",
          "score": 1,
          "created_utc": "2026-01-27 09:38:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1zu2av",
              "author": "Fred-swe",
              "text": "What would be the best way to run WP successfully? In house developer? Custom themes?",
              "score": 1,
              "created_utc": "2026-01-27 10:55:38",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1zvz7i",
                  "author": "Just-a-torso",
                  "text": "Very unlikely you'll need a dedicated dev. As I mentioned with the newer WP versions you can do a lot of stuff without dev support. In most places I've worked that used Wordpress the engineering team would pitch in whenever we needed dev support - another advantage of WP is that it's very well documented and there's a huge community around it, so any decent developer will be able to pick it up quite quickly.\n\nThe best way, tbh, is to hire a marketing person who knows their way around Wordpress.\n\nAnd yes, probably custom theme is the way to go. Start with the built-in themes (Twenty Twenty Five or whatever) and add what you need. Don't be tempted by things like Elementor, they add huge bloat and they're impossible to get rid of once you start building with them.",
                  "score": 1,
                  "created_utc": "2026-01-27 11:11:45",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1zz95p",
          "author": "astillero",
          "text": "Salesforce / Pardot seems very popular but Wordpress might be more suited if speed and talent are key priorities.  \n\nI'm surprised you're not mentioning SEO - because you have the best CMS in the world but if it's not appearing Google or GEO search results it kind of defeats the whole purpose of a CMS.",
          "score": 1,
          "created_utc": "2026-01-27 11:38:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o208biy",
              "author": "Fred-swe",
              "text": "We have good SEO/GEO visibility thanks. I’m want to find a CMS that is easy to work with at scale. We are more enterprise SLG than startup/PLG so the demands are very different",
              "score": 1,
              "created_utc": "2026-01-27 12:43:12",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o20lqvx",
          "author": "nic2x",
          "text": "There are two types of CMS you should look into: no-code or headless. For no-code CMS the best option in the market is Webflow, providing everything you need for SEO/AEO purpose. For headless CMS, go for Sanity. I've used it on a client's site and thanks to its flexibility, we were able to build customized web components in the content page to retain the users for longer retention time.",
          "score": 1,
          "created_utc": "2026-01-27 13:58:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o21978u",
          "author": "BrilliantLow7403",
          "text": "We had an agency convince us to move over to strapi w/ sveltekit about a year and a half ago. We had been on wordpress and my team didnt have any experience with headless CMS. The agency barely completed the job, did not accurately set up our schema, no SEO in place, didnt train us how to use, I could write a novel about how screwed up they left us. We are completely reliant on dev and it takes a lifetime to make even minor aesthetic tweaks. \n\nHeadless is really interesting, but i've tried to teach myself so much while also writing the wrongs the agency created. Basically we are about to pay another agency thousands of dollars to re-do it. so beware",
          "score": 1,
          "created_utc": "2026-01-27 15:51:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o21fps4",
          "author": "mister_malarky",
          "text": "There’s nothing wrong with WordPress, but just curious. What’s the issue you’re facing right now? You mentioned developers charging a few grand for new modules, what’s the nature of the content you’re adding needs as your scale up grows?\n\nAre your challenges with cost, scalability, content flexibility??",
          "score": 1,
          "created_utc": "2026-01-27 16:19:56",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qi7f47",
      "title": "How do you actually find leads and close sales in 2025? (Cold outreach is dying)",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qi7f47/how_do_you_actually_find_leads_and_close_sales_in/",
      "author": "Soft-Dragonfruit6447",
      "created_utc": "2026-01-20 17:28:41",
      "score": 6,
      "num_comments": 23,
      "upvote_ratio": 1.0,
      "text": "My reality:\n\n* Cold emails: 2% reply rate\n* LinkedIn requests: ignored\n* Ads: expensive, low conversion\n\nWhat I want to know:\n\nWhere are you finding people who actually want to buy right now? Are you tracking buying signals or just blasting everyone?\n\nWhat's your process from \"found a lead\" to \"signed deal\"?\n\nI see people saying \"show up where your audience talks\" what does that mean practically?\n\nShare your actual workflow, not theory.",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qi7f47/how_do_you_actually_find_leads_and_close_sales_in/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o0p8g8n",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-20 17:28:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ql1ya",
          "author": "erickrealz",
          "text": "2% reply rate on cold email isn't dying, that's actually pretty normal if you're targeting right. The problem is people expect 20% and get discouraged when reality hits. Our clients doing real volume see similar numbers and still generate solid pipeline because they're sending to qualified lists, not random blasts.\n\n\"Show up where your audience talks\" means actually participating in communities without pitching. Like if you sell to e-commerce brands, join their Facebook groups, answer questions on Reddit, comment on relevant LinkedIn posts. Build credibility first, then people DM you asking what you do. It's slower but the leads are way warmer than cold outreach.\n\nFor finding people ready to buy, track intent signals. Companies hiring for roles your product supports, recent funding announcements, tech stack changes, competitor review sites showing frustration. These indicate actual pain happening now versus \"might need this someday.\" Use Sales Navigator job alerts or set up Google alerts for your target keywords plus funding/hiring news.\n\nYour workflow should be multi-touch. Email, LinkedIn connection, engage with their posts, email again in 5 days, call if you have their number. One touchpoint doesn't cut it anymore. Most deals take 7 to 12 touches before someone even responds, let alone buys. If you're giving up after one email, that's your problem right there.",
          "score": 3,
          "created_utc": "2026-01-20 21:11:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0pvezp",
          "author": "OkSundae8168",
          "text": "Have  you tried personalizing cold emails and scaling them ?",
          "score": 1,
          "created_utc": "2026-01-20 19:12:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0pwgea",
              "author": "OkSundae8168",
              "text": "if you send 200 personalized cold emails per day that is 6k per month if you send all the 30 days 2% of replay rate ( for personalized cold emails its more 6-13%) that is 120 potential leads if you close only 25% that comes out to 30 new clients per month \n\nand yes someone in this very community is talking about how you can check the comments of the person in your industry that gets traction you can lurk through there and many of them dont afford his service maybe they can afford yours",
              "score": 2,
              "created_utc": "2026-01-20 19:17:01",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0re5ob",
          "author": "RomainBlumberger",
          "text": "Yeah, so I’m running a mix of both.\n\nI always have evergreen and “blast” campaigns running in the background. Those are mainly for testing and keeping volume steady. On top of that, I run signal-based campaigns when there’s a clear trigger worth acting on.\n\nThe evergreen test campaign never stops. It gives me constant feedback on messaging. \n\nIn parallel, I keep a signal-based outbound system in the back. But for that to really work, I need to refresh and map my entire target market. Once I have the full market mapped, I can track signals properly.\n\nWho is your ICP by the way ?",
          "score": 1,
          "created_utc": "2026-01-20 23:35:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0rx091",
          "author": "TaxNearby9307",
          "text": "I have been focusing on reddit lately. Communities are actively asking questions and discussing problems they are facing. Then, there are some lead gen tools that find you leads according to your business or product. One of them that I personally use is Leadmatically. It exclusively generate reddit leads which are currently my focus. ",
          "score": 1,
          "created_utc": "2026-01-21 01:19:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0s6kx5",
          "author": "Alone_Ad_3375",
          "text": "First it's 2026 second it ain't dying it's just changing because the attention span is decreasing\n\nI think Reddit is the real deal in 2026 and beyond \n\nImo hire some beautiful women SDRs your 90% game will be sorted.",
          "score": 1,
          "created_utc": "2026-01-21 02:14:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ug2tq",
          "author": "LostContribution2056",
          "text": "Cold emails is a numbers game 2% reply rate is normal but if you scale the volume that's a lot of leads. We mostly use cold emails and Linkedin outreach, we use sales navigator to build lead lists it has the most reliable data we then use airscale to scrape and enrich for emails/phone numbers. Then start cold calls/emails.\n\nWe also sometimes run linkedin outreach campaigns using dripfy",
          "score": 1,
          "created_utc": "2026-01-21 12:42:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o107d00",
              "author": "TransitionNew7315",
              "text": "Hey, what is your experience with linkedin outreach? How do you approach it?",
              "score": 1,
              "created_utc": "2026-01-22 06:51:49",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0urkp9",
          "author": "Tiny-Celery4942",
          "text": "yup feeling like cold outreach was just shouting into the void. What actually worked for me wasn’t a magic trick, but making LinkedIn a daily habit instead of a \"post and pray\" situation.\n\nNow, I run a loop that books B2B calls: I start with a list of my ideal customers. Then, I make a \"mini feed\" of just those people. I warm them up with real comments, connect with a personal note, and send a first DM with one easy question. I treat follow ups like gold.\n\nTo keep a targeted feed and draft comments fast, I use Depost AI. It also tracks follow ups so I don't miss anyone.",
          "score": 1,
          "created_utc": "2026-01-21 13:50:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1a19x7",
              "author": "MajesticFox6",
              "text": "I do it in a similar way but curious what you mean by a \"mini feed\"? I usually just click their profile and comment on their latest post etc. Just wondering if there's an easier way to do it.\n\nAlso, after they answer your first DM, how long do you wait to pitch?",
              "score": 1,
              "created_utc": "2026-01-23 18:00:08",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0uxpxz",
          "author": "Dangerous_Bowler3286",
          "text": "Cold outreach is not dead, but blind outreach is. I run lead gen for a manufacturing company and early on I had the same issues low replies, wasted spend, lots of manual work.\n\nWhat works now is an end-to-end workflow: plan intent & ICP → find companies → gated enrich + verify → deliverability setup → send sequences → auto-replies & live qualification → book meetings → sync outcomes. Reply rates went up once targeting and timing improved, and it is budget-friendly since it runs on credit-based tasks.\n\nCurious how others are spotting real buying signals before outreach",
          "score": 1,
          "created_utc": "2026-01-21 14:23:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0wmln5",
          "author": "Longjumping-Check-76",
          "text": "Modern sales is about targeted relationship building, not mass outreach. Tools like LinkedIn Sales Navigator can help identify precise prospects, while platforms such as ThreadCatch enable more strategic connection tracking. The key is personalization and demonstrating genuine value before asking for anything.",
          "score": 1,
          "created_utc": "2026-01-21 19:00:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0xg49k",
          "author": "jeeves_inc",
          "text": "This actually lines up a lot with what we’ve seen on our side.\nCold outreach isn’t fully dead, but it’s way less effective as a starting point. What is dying is trying to sell before there’s any context or trust.\nFor us, it’s worked much better when people already “know” us before sales ever shows up. That usually happens through organic content, community participation, or just being visible in the right places. By the time someone reaches out or replies, the conversation doesn’t feel cold anymore.\nIn-person events have also been surprisingly effective again, but not big flashy ones. Smaller meetups, dinners, or industry events where you can actually talk. They don’t always turn into leads right away, but they speed up trust a lot.\nI don’t see it as events vs digital. Digital still matters, but impressions alone don’t do much. What helps is repeated exposure to how you think, not what you sell.\nSales works best when it comes later, once interest already exists. Cold messages with no context still get ignored. Messages that land after someone’s seen your content or met you once feel completely different.",
          "score": 1,
          "created_utc": "2026-01-21 21:14:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0zrjdd",
          "author": "Humble-Food8889",
          "text": "i've been running evergreen campaigns for a while now and building them around buying signals rather than static lists. i track things weekly like job posts and funding rounds etc and enrich those companies with context for example company size, roles they're hiring, tech stack etc before reaching out (databar's been solid for this workflow specifically). blasting emails without relevance will always be a dead-end imo so i'd suggest reaching out with a clear reason like \"hey saw you just hired A\" or \"noticed you're rolling out B\" and keep CTAs low-pressure. conversion is way higher when you're hitting people at the right moment",
          "score": 1,
          "created_utc": "2026-01-22 04:50:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o11xb6g",
          "author": "Tasty_Day_7050",
          "text": "SEO drives all of our lead gen right now and compounds every quarter. \n\nLots to unpack, but it's a combo of technical/on page SEO, optimized landing pages based on transactional keywords, and digital PR. All in-house.\n\nWe went from 2 qualified leads/month to 20+ in ~ 6 months\n\nTakes longer to see the results compared to other channels, but more consistent and scalable",
          "score": 1,
          "created_utc": "2026-01-22 14:38:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1jcdfq",
          "author": "New_Grape7181",
          "text": "I struggled with this exact problem last year. Cold outreach felt like shouting into the void.  \n  \nWhat changed things for me was switching from interruption to relevance. Instead of blasting 500 emails, I started tracking buying signals (funding announcements, new hires in relevant roles, tech stack changes on BuiltWith). Then I'd reach out to maybe 30-40 companies per week, but with actual context.  \n  \nHere's what worked: I'd comment on a founder's LinkedIn post about a problem we solve, wait a few days, then send them a short personalised video (like 45 seconds) referencing their post and showing exactly how we'd solve that specific issue. Not a demo, just a quick walkthrough.  \n  \nResponse rate went from that same 2% you're seeing to around 18-20%. The video format meant they could actually see the solution without committing to a call first.  \n  \nFor \"show up where your audience talks\", I joined two Slack communities where our buyers hang out. Answered questions for a month without pitching anything. Three deals came directly from that.  \n  \nThe workflow is slower but way more effective than volume plays.  \n  \nWhat signals are you currently tracking beyond just job titles and company size?",
          "score": 1,
          "created_utc": "2026-01-25 01:29:13",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qitsys",
      "title": "What's actually working for B2B fintech SaaS marketing in 2026 (long cycles, compliance buyers, and \"trust-first\" pipeline)",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qitsys/whats_actually_working_for_b2b_fintech_saas/",
      "author": "Sea-Environment-5938",
      "created_utc": "2026-01-21 09:52:17",
      "score": 6,
      "num_comments": 16,
      "upvote_ratio": 0.88,
      "text": "Hey everyone, I’m seeing a lot of fintech SaaS teams stuck in the same loop right now:\n\n* 6–12 month sales cycles\n* compliance/legal as a hard gate\n* buyers ghosting anything that feels generic\n* “We need more leads” when the real issue is quality, trust and timing\n\nI’ve been working in B2B fintech SaaS (payments APIs, fraud/risk, lending, compliance automation), and a few patterns are consistently working in 2026 without needing insane ad budgets.\n\n**1) Hyper-narrow ICP and positioning**\n\n“Secure fintech platform” is invisible now.\n\nThe teams winning are painfully specific, like:\n\n>“Real-time fraud APIs for mid-market fintechs processing 50k and tx/day who need lower false positives without killing approval rates.”\n\nThat level of clarity makes ABM, content, outbound, and even demo flows way easier to execute.\n\nQuick test: can your ICP fit on one line with a disqualifier?\n\n**2) Intent signals > volume**\n\nA lot of teams still run outbound like it’s 2021: big lists, sequences and hope.\n\nWhat’s working better is signal-based targeting, even if the list is smaller:\n\n* compliance hiring spikes\n* vendor migration chatter\n* sudden increase in security/legal content consumption\n* product pages visited after pricing pages (big one)\n\nIt’s less “spray and pray” and more “show up when the pain is awake.”\n\n**3) Thought leadership that’s about risk and ROI** \n\nFintech buyers don’t want “innovation.” They want:\n\n* “Will this break us?”\n* “Will regulators hate this?”\n* “Will this reduce chargebacks/fraud losses without nuking approvals?”\n\nContent that performs best tends to be:\n\n* risk frameworks (“how this fails”)\n* ROI math with assumptions\n* implementation timelines (what actually takes 2 weeks vs 3 months)\n* AI governance / explainability (especially for fraud and lending)\n\nThe trust-building content isn’t flashy it’s specific and defensible.\n\n**4) Partnerships are still the fastest path to warm pipeline**\n\nEmbedded finance is noisy, but partnership motion is very real when done right.\n\nThe best fit I keep seeing:\n\nFintech SaaS and vertical SaaS / platforms with distribution\n\n(ERP, procurement, commerce tools, industry-specific software)\n\nEven a lightweight co-marketing and integration narrative can create higher-intent conversations than cold outbound.\n\n**5) Interactive beats long PDFs**\n\nMost decision makers won’t read a 50-slide deck.\n\nThings that get better engagement:\n\n* short, personalized demo videos (3–5 mins)\n* self-serve “what would this save me?” simulators\n* implementation checklists (security and compliance friendly)\n\nYou don’t need to be fancy just reduce the effort to understand the value.\n\n**6) First-party data is the real advantage now**\n\nWith privacy and cookie loss, the compounding strategy is:\n\n* SEO that targets “switching” queries (migration, alternatives, comparisons)\n* gated tools (checklists, calculators, templates)\n* newsletters that attract the right buyer persona\n* lifecycle content that supports expansion (bowtie)\n\nThe teams that win are building a feedback loop, not a one-time funnel.\n\n**7) Bowtie mindset: marketing owns expansion too**\n\nIn fintech SaaS, expansion is where the unit economics get clean.\n\nMarketing can support this by building:\n\n* onboarding education (reduce time-to-value)\n* usage-based upsell triggers (feature adoption campaigns)\n* proof libraries for security/compliance objections\n* customer stories that show “what changed after implementation”\n\n# Curious what others are seeing\n\n**What’s killing fintech SaaS lead gen for you right now?**\n\nLong cycles? Trust barriers? Procurement/compliance drag? Crowded category?\n\nAnd are you leaning more into:\n\n* partnerships and distribution\n* intent and signal-based outbound\n* trust-first content (risk/ROI/implementation)\n\nWould love to hear what’s working in your niche.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qitsys/whats_actually_working_for_b2b_fintech_saas/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o0tv0mw",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-21 09:52:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0vvj2p",
          "author": "NoRegret9534",
          "text": "This lines up with what I’m seeing too, even outside fintech (most fields tbh).\n\nThe common thread across almost all B2B right now isn’t “more leads,” it’s **being early** ***and*** **credible at the same time**. Most teams are late *and* generic, which is a brutal combo.\n\nThe intent-signal point is huge. Volume-based outbound feels completely dead unless there’s a real reason for you to exist in someone’s inbox that week. Showing up when pain is *forming*, not after it’s been blasted by five vendors, changes the entire dynamic.\n\nI’d add one thing that seems under-discussed: **speed + freshness as a trust signal**. When buyers realize you’re reacting to *current* conditions instead of running recycled plays, it immediately lowers skepticism. Even strong content gets ignored if it feels like it was written “for everyone.”\n\nAlso agree on interactive > static. Anything that answers “what will this realistically look like for *me*?” beats polished thought leadership right now.\n\nCurious if others are seeing the same drop-off once something feels even slightly templated. It feels like relevance windows are getting shorter every quarter.",
          "score": 2,
          "created_utc": "2026-01-21 17:01:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0u5yh2",
          "author": "RevolutionaryKey7404",
          "text": "I was also thinking to start such startup from long days , can we chat?",
          "score": 1,
          "created_utc": "2026-01-21 11:29:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0ucxgc",
              "author": "Sea-Environment-5938",
              "text": "yes why not.",
              "score": 1,
              "created_utc": "2026-01-21 12:21:31",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0v0u5q",
                  "author": "RevolutionaryKey7404",
                  "text": "So what I see this whole Fintech area like PE,M&A etc etc, are very relation based industry , so how do you think you will get into and get your clients since for a connectionless guy how can such a person do and get clients , I mean in sure that cold message and calling is not possible here. Whats your thoughts on this?",
                  "score": 1,
                  "created_utc": "2026-01-21 14:39:37",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0urfbv",
          "author": "Tiny-Celery4942",
          "text": "I was in the same boat, seeing fintech SaaS teams struggle with long sales cycles and compliance hurdles. What actually worked for me wasn’t a tactic. It was turning LinkedIn into a boring daily system instead of a place I randomly post and pray.\n\nHere’s the loop I run now that consistently books B2B calls:\n\n\\-   Start with a hand built prospect list (not the feed) 50–150 ICP accounts + people in each.\n\n\\-  Create a “mini feed” just for those people. Each day I only look at posts from that list.\n\n\\-   Warm them with 5–10 real comments per day.\n\n\\-   Send connection requests only once they’re warm.\n\n\\-   First DM = context + one easy question.\n\n\\-   Treat follow ups like a pipeline, not an afterthought.\n\nWhat was a waste of time: Mass cold DMs, InMails without prior interaction, Posting more content hoping “leads will come”.\n\nThe system above still takes \\~30–45 minutes a day, but it made results predictable. To keep a targeted feed of prospects and run this system, I use Depost AI. It helps me build targeted feeds, draft comments and DMs and tracks follow ups so I don't miss anyone.",
          "score": 1,
          "created_utc": "2026-01-21 13:50:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0v2idg",
          "author": "Wrong-Finish7655",
          "text": "on outbound, intent beats volume by a mile. we stopped big list pulls and focused on smaller, signal-heavy segments, then sourced contacts cheaply so testing didn’t hurt (leadcourt helped keep costs low). fintech outreach only works when timing is right , otherwise you’re just noise. how are you actually detecting “pain is awake”?",
          "score": 1,
          "created_utc": "2026-01-21 14:48:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ze10d",
          "author": "agonsenhauser",
          "text": "Big yes on the first-party data point (SEO, gated tools, newsletters), but I'm curious how teams are handling the ROI timeline conversation internally. If your sales cycle is already 6-12 months, and you're investing in building this infrastructure now, you're realistically looking at 12-18+ months before you can clearly attribute pipeline to those efforts.\n\nHow are you justifying that investment when leadership is still pushing for near-term pipeline? Are you running it parallel to shorter-cycle tactics, or have you found ways to show leading indicators earlier (engagement quality, sales using content in cycles, etc.)?\n\nThe compounding value is real, but the \"trust us, this will pay off in 2027\" pitch is brutal when you need results in Q2.",
          "score": 1,
          "created_utc": "2026-01-22 03:24:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o184a1p",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-23 12:13:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o18qslk",
          "author": "stranmansky",
          "text": "You're missing the most critical element of de-risking a purchase: customer evidence. I don't mean the soaring, \"our business sucked, then we met Acme, now everything's awesome\" case studies. I mean the point in time snapshots from the customer lifecycle when you capture a compliance analyst sharing their \"a-ha!\" moment, or a CFO discussing specifically why he/she chose your solution over the hundreds of others available to them.",
          "score": 1,
          "created_utc": "2026-01-23 14:23:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1jmvba",
          "author": "New_Grape7181",
          "text": "I've found that point 5 about interactive content really does move the needle, especially in longer sales cycles like fintech.  \n  \nWe were stuck in that same ghosting pattern you mentioned. Sending decks and hoping for replies. What changed things for us was switching to short personalised videos (under 3 minutes) where we'd reference something specific about their use case or a signal we caught (like a recent compliance hire or a migration they mentioned publicly).  \n  \nThe reply rate jumped quite a bit because it felt human and showed we'd actually done the work to understand their situation. It also helped us stand out from the generic sequences everyone else was running.  \n  \nOne thing I'd add to your signal-based targeting point is combining LinkedIn activity with those intent signals. If someone from the target account is engaging with content around vendor migration or posting about fraud losses, that's when we'd send a video DM rather than just an email. It feels timelier and less intrusive.  \n  \nWhat's been your experience with timing on those signals? Do you wait for multiple triggers or jump on the first one?",
          "score": 1,
          "created_utc": "2026-01-25 02:26:35",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qn8ciz",
      "title": "No clients for 3 months, seeking advice on buying LI Sales Nav",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qn8ciz/no_clients_for_3_months_seeking_advice_on_buying/",
      "author": "TransitionNew7315",
      "created_utc": "2026-01-26 06:25:13",
      "score": 6,
      "num_comments": 38,
      "upvote_ratio": 0.88,
      "text": "Hey folks, first time posting here. I'm little discouraged, sorry. little bit of context - I found my first client here on reddit, I DMed bunch of folks in r/agency and one of them replied, he asked me to rebuild his site. that's how I got started, but after that I'm not able to land another client. I'm mostly sending cold DMs here on reddit, have some positive replies and interest but no contracts yet. \n\nI offer website rebuilds for b2b teams, I build sites in a way that help marketing team move faster and generate more leads with the site. my ICP is mostly b2b SaaS or businesses who want to step up their website marketing ops.\n\nafter trying bunch of free methods for landing clients, now I'm cosidering for paid tools\n\n\n\n**If you could answer these questions, I would really appreciate it.**  \n  \n1) Should I invest in LI Sales Nav   \n2) how to actually use Sales Nav to get clients\n\n  \nThanks",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qn8ciz/no_clients_for_3_months_seeking_advice_on_buying/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o1rvlpv",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-26 06:25:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1skw52",
          "author": "No_Hedgehog8091",
          "text": "Before spending on tools, fix your positioning. 'Website rebuilds' is too vague.\n\nReframe it: 'I help B2B SaaS reduce CAC by 30% through conversion-optimized sites.'\n\nFor outreach, target companies that just raised funding or hired new marketing leaders. They have budget and mandate for change.\n\nDM me if you want the exact sequence that landed me 8 clients last quarter.",
          "score": 4,
          "created_utc": "2026-01-26 10:05:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1slfa7",
              "author": "TransitionNew7315",
              "text": "Hey, just DMed you!",
              "score": 1,
              "created_utc": "2026-01-26 10:10:16",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o1tc2h4",
              "author": "NocturnalSaaS",
              "text": "Could I have that as well?",
              "score": 1,
              "created_utc": "2026-01-26 13:29:21",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1skpqw",
          "author": "lionstock555",
          "text": "Cold-call them, it’s another level of interaction",
          "score": 2,
          "created_utc": "2026-01-26 10:03:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1sksvx",
              "author": "TransitionNew7315",
              "text": "Man, this is little hard for me, english is not my first language. Does it work well for you?",
              "score": 1,
              "created_utc": "2026-01-26 10:04:38",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1z492m",
                  "author": "digital-dh",
                  "text": "It sound like you are running away instead of facing the problem. Coz soon or letr you have to face that challenges. You will feel may be uncomfortable but later you will be fine. Just go for it.",
                  "score": 1,
                  "created_utc": "2026-01-27 07:02:29",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1v6rz1",
          "author": "sagefrogmarketing",
          "text": "What’s probably stalling you isn’t tools, it’s positioning and motion. Cold DMs work early, but once you’ve proven value you need a tighter wedge: one clear problem, one buyer role, one trigger that makes outreach timely. Sales Nav can help if you use it to spot change (new hires, funding, site migrations, traffic drops), not just to blast messages. Treat it as a signal-finding tool, then start conversations around what just changed for them.",
          "score": 2,
          "created_utc": "2026-01-26 18:32:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1v7cbw",
              "author": "TransitionNew7315",
              "text": "Hey, could you be more case specific?\n\nLet’s say a SaaS company raised series A recently, I have the linkedin profile of vp of marketing, now what to do next?",
              "score": 1,
              "created_utc": "2026-01-26 18:35:12",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1yef4b",
          "author": "New_Grape7181",
          "text": "I'd hold off on Sales Nav for now. You're at 1 client total, so the issue isn't finding more prospects, it's probably your messaging or offer positioning.  \n  \nSales Nav is great for filtering and finding the right people, but if your cold outreach isn't converting now, paying for a bigger list won't fix it. Reddit DMs that get interest but no contracts usually means one of two things: either you're attracting the wrong fit, or there's a disconnect between initial interest and actually closing.  \n  \nBefore spending money on tools, I'd test your offer more directly. Find 20 B2B SaaS companies with outdated sites (you can spot these manually on LinkedIn or Google). Send each founder or marketing lead a quick loom video showing 2-3 specific things broken on their site and how you'd fix it. Make it about them, not your process.  \n  \nIf that converts even 1-2 clients, then yeah, Sales Nav makes sense to scale up the prospecting bit. But right now you need to prove the messaging works before paying to reach more people.  \n  \nWhat's your typical cold message look like when you reach out?",
          "score": 2,
          "created_utc": "2026-01-27 03:57:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1yhssj",
              "author": "TransitionNew7315",
              "text": "this is what I'm also thinking.\n\nI feel like I'm switching my targets quite often(I'm desperate😅, no client for 2-3 months). I've sent a lot of DMs to agency owners asking for work, actually I'vent targeted SaaS companies directly as I thought it would be hard to close. but now I'll do\n\nI'm planning to pick one SaaS that has recently raised series A and I'll make a loom video about things that can be improved on their site(many have webflow sites which is hard to scale). and then post it on linkedin and tagging them, \n\nwdyt?",
              "score": 1,
              "created_utc": "2026-01-27 04:18:19",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o20a118",
                  "author": "New_Grape7181",
                  "text": "I wouldn't call them out publicly for issues in their site. They won't want to work with you for sure, need to use more tact lol. \n\nThose who have raised is a decent signal, but I'd focus more on those with tangible website issues.",
                  "score": 1,
                  "created_utc": "2026-01-27 12:54:04",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1ryvne",
          "author": "Tiny-Celery4942",
          "text": "I get where you're coming from. It's tough when those initial wins dry up. Sending cold messages can feel like shouting into the void.\n\nWhat actually worked for me wasn’t a magic trick, it was turning LinkedIn into a daily habit.\n\nHere's the loop I run:\n\n\\-   I make a prospect list of 50 to 150 accounts.\n\n\\-   I check only posts from that list each day.\n\n\\-   I leave 5 to 10 real comments daily.\n\n\\-   I send connection requests only after they're warm.\n\n\\-   First message is short and specific.\n\n\\-   I treat follow ups like a pipeline.\n\nTo keep a targeted feed of prospects and run this system, I use Depost AI. It helps me draft comments and messages and tracks follow ups so I don't miss anyone, more you can integrate it into Sales navigator to run this loop, only Sales Nav will not solve you pain, you have to warm those leads, and run this loop to get the results.",
          "score": 4,
          "created_utc": "2026-01-26 06:51:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1v2tv5",
              "author": "Fast_Tiger_28",
              "text": "I’ve been trying to be more active on LI. What’s the results been like for you so far?",
              "score": 1,
              "created_utc": "2026-01-26 18:16:23",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1vbh9x",
                  "author": "Tiny-Celery4942",
                  "text": "Being consistent is what makes it work. First, warm up your leads by talking to them, then send a message made just for them. It takes time, but it pays off. You could also try automatic tools, but they don't work as well because you can't trust important leads to a fully automatic system. Tools such as Depost AI can help you find leads, make a list, see their posts, and write personalized comments, messages, but you still need to be involved. Never let automatic systems handle your best leads, it will ruin things.",
                  "score": 1,
                  "created_utc": "2026-01-26 18:52:25",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1szhxf",
          "author": "Dickskingoalzz",
          "text": "Paid ads, capture BOFU.",
          "score": 1,
          "created_utc": "2026-01-26 12:07:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1t1uzf",
              "author": "TransitionNew7315",
              "text": "Will it cost a lot of money, I've no exp running ads, where should I run?",
              "score": 1,
              "created_utc": "2026-01-26 12:24:46",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1xlc3r",
                  "author": "Dickskingoalzz",
                  "text": "I’m not sure what a lot of money is to you, but we spend $2000 - 5,000/month on ads but have clients who spend 100k+ monthly. \n\nGoogle LSA’s can be good with small budgets.",
                  "score": 1,
                  "created_utc": "2026-01-27 01:15:20",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1t4ur8",
          "author": "Fro2stly",
          "text": "same here, no clients.  \n  \nNote :  i don't do the same service you provide, i have an AI agency",
          "score": 1,
          "created_utc": "2026-01-26 12:45:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1tmd1j",
          "author": "imnotafanofit",
          "text": "You can land a client without it if your outreach is good and don't limit yourself on one platform. These tools you see on the internet are mostly just about finding the right leads efficiently. But you still gotta craft good messages and follow up consistently.",
          "score": 1,
          "created_utc": "2026-01-26 14:23:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ufmc5",
          "author": "Full_Cut_8705",
          "text": "In my opinion, LI sales nav is a MUST HAVE!\n\nThere is just so much to get out of it. Esspecially looking at all the data there (jib titles, branches company size, DMU) is to be found compared to the standard LinkedIn version.\n\nYou can build lead list, which you can then specifically target. And start conversations with. Also, you can build custom lists to then target with paid ads.\n\nWe use this in our agency for all of our clients (including ourselfs)",
          "score": 1,
          "created_utc": "2026-01-26 16:36:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1uhsh2",
          "author": "Rich-Emu-1561",
          "text": "Nav could be a great option but reddit is not bad either. I use a promotion tool to help myself with on reddit. It is a lead gen that can automatically find reddit posts and comments for your interest",
          "score": 1,
          "created_utc": "2026-01-26 16:45:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1visbq",
          "author": "CyberStartupGuy",
          "text": "Before you buy Sales Nav, see if just LinkedIn Premium is enough. Usually that's a much cheaper option and all you are really looking for is unlimited searching. If you need all the lead lists and saving CRM like capabilities then okay but many pay for it but then don't use them!",
          "score": 1,
          "created_utc": "2026-01-26 19:23:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1w44iy",
          "author": "Most-Repeat590",
          "text": "Before spending a ton of money on Sales Nav focus on your own network first. Make use of the connections you already have. Im using a free tool to map my network and all the relations that come with it, feel free to dm if that catches your interest",
          "score": 1,
          "created_utc": "2026-01-26 20:56:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1w6zte",
          "author": "OkDependent6809",
          "text": "honestly sales nav wont fix this if free outreach isnt working\n\nthe issue is probably your messaging or targeting not the tool. sales nav just gives you better filters and inmails but if people arent converting from free linkedin or reddit dms then paid tool wont change that\n\nbefore spending money id figure out why prospects are interested but not closing. are you talking to people who actually have budget? do they have pain right now or just like the idea? whats stopping them from signing?\n\nalso 3 months is rough but not crazy long for b2b. deals take time especially if youre selling to saas companies with actual buying processes\n\nif you do get sales nav focus on finding companies that just raised funding or recently hired marketing leaders. those are signals they might actually spend on a rebuild soon\n\nbut real talk fix your conversion problem first then add tools",
          "score": 1,
          "created_utc": "2026-01-26 21:09:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1waz5o",
          "author": "Shre_Marketing",
          "text": "I am not the biggest fan of LI sales navigator \nMainly because of the price. Are you already creating content on LinkedIn and adding people from your ICP on a weekly basis?",
          "score": 1,
          "created_utc": "2026-01-26 21:27:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1we179",
          "author": "Admirable_Swim_7805",
          "text": "sales nav is useful but its not going to magically get you clients. the tool helps you find the right people but you still need to know what to say and how to reach out without being spammy.\n\n\n\nbefore buying sales nav try this first. use regular linkedin and engage with your target customers posts. comment genuinely on their content. after a week send a connection request with a custom note that references something they posted. once connected send a short dm asking if theyd be open to a quick conversation about their website.\n\n\n\nif you cant get traction doing this manually sales nav wont fix it because the problem isnt finding people its getting them to respond.\n\n\n\nif you do get sales nav use it for advanced filters like company size recent job changes and technologies used. message people who just got promoted or switched jobs because theyre more likely to have budget and want to make changes.",
          "score": 1,
          "created_utc": "2026-01-26 21:41:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1wk0ks",
          "author": "aviral-bhutani",
          "text": "if you want, DM me.\n\nI can walk you through how I’d think about this and a few simple tweaks that can genuinely move the needle. \n\nNothing fancy or tool-heavy, just practical stuff that’s helped me improve sales by 2x over just the past 10 days. Happy to share notes.",
          "score": 1,
          "created_utc": "2026-01-26 22:07:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1xsdb2",
          "author": "Sitoshimama",
          "text": "Maybe try cold email with data from Apollo Or Leadcourt before buying sales nav.",
          "score": 1,
          "created_utc": "2026-01-27 01:53:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1z2zca",
          "author": "digital-dh",
          "text": "I think you need to work on clarity and positioning not tools. Coz once you are clear on positioning and clarity on ICP, it will make easy for you to approach, pitch, and close sales. If you need help with that then DM me. Happy to help :)",
          "score": 1,
          "created_utc": "2026-01-27 06:51:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o20mxdz",
          "author": "LostContribution2056",
          "text": "With sales navigator you first need to decide if your ICP are on LInkedin then can you easily find them with the filters (look into boolean search and other searching techniques) then if you can find them, you can build lists inside sales navigator.\n\nScrape and enrich with emails/phone numbers using airscale then start cold outreach/calls or you can use tools like dripify to start Linkedin campaigns.",
          "score": 1,
          "created_utc": "2026-01-27 14:05:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o21baxz",
          "author": "EntirePassion7993",
          "text": "Hey u/TransitionNew7315, try adding a chatbot to your website. It can engage visitors 24/7, answer common questions, and even capture leads while you sleep. I’ve seen sites boost conversions by up to 30% just by having a friendly chatbot ready to chat. It’s a game-changer for getting those leads in! Happy to share more about how it worked for us if you're interested.",
          "score": 1,
          "created_utc": "2026-01-27 16:00:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1tsamj",
          "author": "Rare_Date_3223",
          "text": "Connect with me.",
          "score": 0,
          "created_utc": "2026-01-26 14:53:04",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1ql9706",
      "title": "Why proving ROI in B2B marketing still feels like a constant uphill battle",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1ql9706/why_proving_roi_in_b2b_marketing_still_feels_like/",
      "author": "Strict-Hour1601",
      "created_utc": "2026-01-24 01:20:20",
      "score": 6,
      "num_comments": 12,
      "upvote_ratio": 0.88,
      "text": "Tbh, I don’t think I’ve met a single B2B marketing leader who hasn’t had that “wait, how do I prove this is actually driving revenue?” moment lol. Between data silos, misaligned KPIs, and changing exec priorities, it can feel like you’re constantly chasing a moving target. I’ve been there trying to balance strategic planning with day-to-day execution while also explaining to the CFO why certain demand-gen metrics actually matter in the long term.  I’ve been reading a lot about frameworks lately, like SiriusDecisions’ Demand Waterfall, and trying to implement parts of it to get better visibility into our funnel stages. It’s not perfect, but it’s helping spot bottlenecks faster. A colleague also mentioned Demand Revenue, which works with CMOs on creating clearer connections between marketing initiatives and business objectives. Never worked with them personally, but I like their idea of building marketing infrastructure that proves marketing’s contribution in tangible terms.  Honestly, what’s been helping us lately is running more joint pipeline reviews with sales. It’s messy but it forces alignment and helps us track where marketing actually moves the needle. Still, the hardest part is translating “brand equity” or “thought leadership” into numbers that the finance team buys into.  Curious how others here handle that. Do you use a specific attribution model that actually works in complex B2B environments? Or are you relying more on qualitative indicators like influenced revenue or sales feedback loops? Imo there’s no one-size-fits-all, but it’d be great to hear what’s been working (or totally failing) for the rest of you dealing with this same ROI headache. ",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1ql9706/why_proving_roi_in_b2b_marketing_still_feels_like/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o1ciwfb",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-24 01:20:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1el9jk",
          "author": "Even-Signature-5286",
          "text": "SEO perspective:  \nMost B2B marketing strategies try to take the potential customer through every stage of buyer's journey: awareness stage, consideration stage, buying or conversion stage. So, they publish enormous amounts of content especially for the first stages thinking the generated traffic to the website will automatically convert to leads and sales. Nothing is far from the truth. Because most of this content is informative, educational and will attract people who has no buying intent at all. Most of this content hardly generates any ROI.\n\nBut for most companies, there are a number people who're already in the buying stage. So, using a particular SEO strategy you can attract these people without having to take them through the awareness stage and consideration stages.\n\nThere are specific keywords that people in the buying stage use to find products they intend to buy.\n\n\"Best \\[industry\\]\\[use case\\] software/tool/app\" For people searching for a product relevant to their industry\n\n\"Best \\[software name/tool name/app name\\] Alternatives\".  For people trying to switch to another product that better meets their requirements.\n\nThese content strategies has great potential to generate revenue and soon one can estimate their ROI.",
          "score": 3,
          "created_utc": "2026-01-24 10:32:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1et8mg",
          "author": "Impressive-Amount255",
          "text": "I've had this battle for two decades, and I feel like I've fixed it about a year ago. And the fix is not complicated.\nWhat I realized the problem is, is that we constantly talk about channels. And when talking about ROI, like talking about attribution, we always talk about channel-level attribution and channel-level ROI. The problem is, most of your channels can hardly be linked to a specific outcome.\nFor example, doing ads in magazines, on TV, on radio, on billboards is the typical kind of stuff that you can hardly track. You can always talk about influence and try to explain that it had an impact, but you can't really prove it. And if you do, it's just gonna take you days and days of work that would just kill the original ROI anyway.\nWhat I found out has been working for me is to kill that entire attribution game and never, ever talk again about channel-level KPIs with the board. Obviously, I continue monitoring every channel one by one, optimizing them, but now I look for each channel, each activity, at what is expected from this channel.\nAnd I don't try to tell how much money a specific channel generated if its original purpose is not revenue generation, but influence.\nWhat I've done ultimately is to look at campaign-level ROI. So if I have a campaign with a specific focus, I'll tell you how much revenue it has generated, all channels, all activities, all assets included.\nWith that, now I can prove my total marketing ROI, and I refuse to get into the complexity of \" but is this channel performing better than the other?\" No, I'm the marketing expert. You are a CFO. You are a CSO. You are a CEO. You're going to have to trust me because on a campaign level, I'm generating revenue.\nTo achieve that, I've moved to a pretty strict framework that is audience first and campaign-level attribution. It's called the RIO framework if you want to look into it. But the most important thing here is don't talk about channels. Talk about integrated campaigns.\nYou're just going to move the battle to a different field, a field where you can show the outcome.",
          "score": 3,
          "created_utc": "2026-01-24 11:43:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1f7vrh",
              "author": "snuglitx",
              "text": "Couldn’t agree more. \n\nBy creating a datamart I was able to show campaign cause-effect correlation from content drops (syndicated across channels) to web traffic to demo requests. \n\nI’m having to continually teach my company that this the buyer journey funnel exists and that sales are driven by many touches down the funnel. \n\nExample: no one sees a Rivian ad and immediately buys one. We see talk to actual owners, watch YT videos, visit Reddit, research other cars and read reviews, on and on.\n\nThis multi touch decision making is exaggerated when a buying decision (or the wrong one) might hurt your career and income security.",
              "score": 2,
              "created_utc": "2026-01-24 13:30:31",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o1m3hpo",
              "author": "Maia9779",
              "text": "How does the RIO structure work?\n\n\nI've been using the method you mentioned to report results, and it really is the best way. But the question of channels always comes back. Even for me to understand which one to dedicate more effort and investment to. So it ends up being a challenge.",
              "score": 2,
              "created_utc": "2026-01-25 13:23:16",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1n89dj",
                  "author": "Impressive-Amount255",
                  "text": "Actually, what I'm saying is to consider your company is made of three kinds of people. The centerpiece is the campaign manager. Everyone working on specific channels with the campaign manager, I'll call them channel managers. And everyone else will be the third category.\n\nYour channel managers, they still need to look at very detailed channel-centric metrics because they're going to need that to optimize. So if you have a person managing LinkedIn, obviously, they need to look at CPL. Obviously, they need to look at impressions. Obviously, they need to look at leads or whatever other metrics make sense so that they can optimize this channel.\n\nEveryone else in the company should only be looking at campaign-level results because they are not qualified to understand or to judge the channel-level results. And even if they were qualified because they've been in marketing at some point in their career, they don't have the context, they don't know the day-to-day, they don't know the details, they don't know the setup. So basically, they just don't know enough to have an opinion. They should only look at campaign-level results and that's it.\n\nThe only exception is the campaign manager. In the RIO model, this is the person who orchestrates the entire campaign. Think of them as an architect. They have a foot on each side. They need to look at campaign-level results and report campaign-level results, but they should also understand enough of the channel-level results that they can have intelligent conversations with channel managers. They are the only one who should be looking at both. Everyone else should be in one category or the other.\n\n\nAs to your former question, how does the RIO framework work? Just do a quick search, “RIO integrated campaign framework” on Google. You'll find it in no time. I've stopped using the complete framework. I'm now just leveraging ChatGPT. I've basically asked ChatGPT to learn the framework and then assist me with it instead of me doing it manually. I don't regularly go check the framework in detail, but search it on Google and you'll find all the necessary details.\n\nWhat makes this framework really unique to me is that it does three things. First, it is audience-first, which I've always believed is the best approach for an integrated campaign. Second, it kills the attribution battle by looking at campaign-level results versus per-channel attribution. And third, with the right governance, structure, and integration, it actually looks at content creation in a completely different way that reduces the amount of content you need to be efficient with integrated campaigns.\n\nThese are the three elements that really convinced me to use this framework in the first place, and this is the reason why I've been using it for so long now.",
                  "score": 1,
                  "created_utc": "2026-01-25 16:44:18",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1fmj3h",
          "author": "agonsenhauser",
          "text": "You mentioned the joint pipeline reviews with sales have been messy but helpful. Curious what specific metrics you're actually tracking in those sessions that have resonated most with the sales team? \n\nI ask because I've found that getting alignment on the right leading indicators (vs just looking at lagging metrics like closed-won) makes a huge difference in demonstrating marketing's impact before it shows up in revenue. Things like velocity metrics or stage conversion rates seem to land better than just MQL counts, but wondering what's actually moved the needle in your reviews.",
          "score": 1,
          "created_utc": "2026-01-24 14:54:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1gg57c",
          "author": "TNT-Rick",
          "text": "I make trackable lead gen and revenue the focus of my reporting. Period.\n\nSecondarily, I'll report on actual clicks and notable engagement with target accounts.",
          "score": 1,
          "created_utc": "2026-01-24 17:12:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1kgbnq",
          "author": "umightfafo",
          "text": "1. **Stop the Attribution Debate:** Finance usually hates multi-touch attribution because it feels like \"creative accounting.\" I’ve found much more success moving to an **Inbound/Pipeline Revenue** model. It’s simple: how much actual pipeline did Marketing create vs. what did we spend to get it? It’s a language Finance speaks.\n2. **Separate the \"Motions\":** You mentioned the struggle of valuing \"brand equity.\" You can't measure a podcast the same way you measure a Google Search ad. Trying to force them into one model is how you end up with \"messy\" data.\n3. **Attribution:** Software is always going to miss the \"Dark SEO\" stuff, the podcasts, ChatGPT, and word-of-mouth that actually drive the big deals. I’m a huge fan of adding a mandatory **\"How did you hear about us?\"** field on high-intent forms. When you show the CFO a list of closed-won deals where the customer literally *typed* \"I heard your CEO on X podcast,\" the \"brand equity\" argument becomes a lot more tangible.",
          "score": 1,
          "created_utc": "2026-01-25 05:23:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ltmq6",
          "author": "EntirePassion7993",
          "text": "Hey u/Strict-Hour1601, have you tried using an AI chatbot to track and qualify leads on your site? It can help you gather data on visitor behavior and segment leads based on their engagement. This way, you can present clearer ROI metrics to your CFO. Plus, it automates responses, freeing you up for more strategic tasks. Happy to share more about how it’s worked for us if you're interested!",
          "score": 1,
          "created_utc": "2026-01-25 12:13:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1q6y9i",
          "author": "Goran-CRO",
          "text": "Clear decision rules based on proper stage- aware metrics combination is usually missed/secret ingredient.",
          "score": 1,
          "created_utc": "2026-01-26 00:33:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o20a3uu",
          "author": "Admirable-Grocery-42",
          "text": "Marketing in B2B is fairly simple:\n\n1) You have people actively looking for solutions like yours (via Google, ChatGPT, etc.) — in this case your job is to ensure people can find you (Google Ads, SEO/AI Optimization). \n\n2) You have people who are not actively looking for a solution, and may not even have a need at this stage — though they are in your ICP, and can potentially buy in the future. Your job here is to ensure that you are building awareness, staying on top of mind, and achieving credibility and trust. So whenever they have a need -> they consider going straight to you, and not just looking for competitors. \n\nAttribution in this case is fairly straightforward and simple last-click model is fairly OK. This explains why many successful startups have nothing more but last-click even past $10M ARR. \n\nBut for all demand gen activites — it's a nightmare. You have people consuming your content but not clicking on the website, you have people researching the product but then the actual demo comes from another person. I'm not even talking about the lengthy journeys when it comes to buying a B2B product.\n\nProbably this is the reason why attribution tools are common in B2C/DTC but in B2B, SaaS and PLG there are just few specialized companies doing attribution well enough -- 1) segmentstream 2) hockeystack 3) dreamdata.\n\nThe key to success here is in building proper identity graph and connecting disjointed data sources and using self-reported attribution to solve visibilty problem for activities that don't generate website clicks.\n\nHope that helps",
          "score": 1,
          "created_utc": "2026-01-27 12:54:34",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qkgo3z",
      "title": "Why does demand exist but inbound leads feel less “sales-ready”?",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qkgo3z/why_does_demand_exist_but_inbound_leads_feel_less/",
      "author": "Charles_R23",
      "created_utc": "2026-01-23 04:08:37",
      "score": 5,
      "num_comments": 16,
      "upvote_ratio": 1.0,
      "text": "Prospects engage with content, attend webinars, and download assets—but sales conversations stall early.",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qkgo3z/why_does_demand_exist_but_inbound_leads_feel_less/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o16gk8b",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-23 04:08:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o16h5oi",
          "author": "thesinnedknight",
          "text": "The current climate is about instant gratification and free things.  Anything beyond free terrifies them.\n\n\"Why can't you give this to me, make all my dreams come true, and make me win to my satisfaction - then we can worry about your pittance.\"",
          "score": 4,
          "created_utc": "2026-01-23 04:12:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o16jcu0",
              "author": "Ngoma_kudunda",
              "text": "Goated comment",
              "score": 1,
              "created_utc": "2026-01-23 04:26:03",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o16ojze",
          "author": "InevitableCamera-",
          "text": "Because a lot of inbound interest is “problem-aware” but not “solution-ready”",
          "score": 2,
          "created_utc": "2026-01-23 05:00:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o16w9cq",
          "author": "KissyyyDoll",
          "text": "Content engagement doesn’t always equal buying intent. People consume, but they’re not ready to commit.",
          "score": 2,
          "created_utc": "2026-01-23 05:55:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o17n7tg",
          "author": "Tiny-Celery4942",
          "text": "It is a puzzle, right? People show some interest, but then things stop fast.\n\nI think many leads are just doing research. They want info but are not ready to buy now.\n\nMy team changed how we talk to these leads. First, we ask what they are trying to learn. Then, we share useful stuff without pushing a sale. We try to be helpful and build trust. This way, when they are ready to buy, they think of us. It takes longer, but it gets better results. I use a tool also Depost AI, to keep track of my lead lists, my each engagement with user, and what is status, when I need to do followup.. \n\nAs some leads are interested but they forgot, they are busy somewhere else.. better is keep record of them, keep engaging with them, do not let them forget.. eventually they will buy..",
          "score": 1,
          "created_utc": "2026-01-23 09:51:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o18wlli",
          "author": "chaliques",
          "text": "Cause you're not doing good education early on?\n\nAre you listening to sales calls to see why they're not \"sales ready\"\n\nOr are you paying attention to the content they're consuming from your company?",
          "score": 1,
          "created_utc": "2026-01-23 14:53:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o19l3b9",
          "author": "Glad_Orchid6757",
          "text": "This is pretty common when you're casting a wide net with content. Those earlier touchpoints (webinars, downloads) attract people who are curious but not necessarily in buying mode yet, so they disengage when the conversation gets too sales-focused. One thing that's helped some teams is going where people are already asking questions with actual intent, like Reddit threads where prospects are actively looking for solutions.\n\nI've been seeing Community Mentions come up a lot lately for B2B brands trying to get into those conversations without coming off spammy. Seems like a different type of lead quality when people are already mid-problem vs just downloading a whitepaper becuase it looked interesting.",
          "score": 1,
          "created_utc": "2026-01-23 16:45:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o19s762",
          "author": "Commercial-Tutor-238",
          "text": "What are your sales callouts. And do you target and understand where your buyers are on their customer journeys, and do they know why they would need you at that moment?",
          "score": 1,
          "created_utc": "2026-01-23 17:18:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o19sejx",
          "author": "Responsible-Brick881",
          "text": "What sort of business are you in and who's your ICP?\nAlso, are you a challenger brand or more established?\n\nWhile content, webinars, etc. are great starting points for initial engagement, B2B buyers are typically a very considered purchase so you need multiple touch points across multiple channels to establish trust.",
          "score": 1,
          "created_utc": "2026-01-23 17:19:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ruv9c",
          "author": "supriya_l89",
          "text": "People show interest in your business but they do not yet want to make a purchase. Your content successfully reaches the appropriate job positions but it fails to attract candidates who have immediate needs and financial resources. The sales team must establish better connections between content subjects and actual customer objections while they need to reevaluate their lead scoring system because they mistakenly believe that customer engagement means customers are ready to buy. Your business needs better problem and impact descriptions because current methods do not yield necessary results.",
          "score": 1,
          "created_utc": "2026-01-26 06:19:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1xd9bw",
          "author": "New_Grape7181",
          "text": "I've noticed this gap too. The problem is usually that engagement doesn't equal intent.  \n  \nSomeone downloading a guide might be researching for a future project, benchmarking competitors, or just learning. They're not necessarily evaluating solutions right now.  \n  \nWe started tracking second and third actions instead of first touch. If someone downloads an asset AND visits pricing AND checks out case studies in your industry, that's a warmer signal than just one download.  \n  \nAlso helped to add a single qualification question to our forms instead of just email capture. Something like \"What's your timeline for implementing this?\" or \"What triggered you to look into this now?\" You'll get fewer conversions but the ones you get are actually ready to talk.  \n  \nThe other thing is making sure sales knows the context. If someone attended a webinar about topic X, the first question shouldn't be \"So what problems are you facing?\" It should reference what they engaged with and dig into their specific situation around that topic.  \n  \nWhat does your handoff process look like between marketing and sales right now?",
          "score": 1,
          "created_utc": "2026-01-27 00:32:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2054j2",
          "author": "Low-Cardiologist-432",
          "text": "Quality of engagement, less personalized leads won’t be ready to buy",
          "score": 1,
          "created_utc": "2026-01-27 12:21:40",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qk3nuk",
      "title": "Best AI tools",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qk3nuk/best_ai_tools/",
      "author": "2proud4u",
      "created_utc": "2026-01-22 19:10:52",
      "score": 5,
      "num_comments": 19,
      "upvote_ratio": 1.0,
      "text": "Hi marketers - what are some of your favorite tools with AI that you use to make your job more efficient? Could be anything related to campaigns, demand gen, websites, content. \n\n ",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qk3nuk/best_ai_tools/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o13l46s",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-22 19:10:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o13nlq9",
          "author": "Impressive-Amount255",
          "text": "For videos, I love heygen, flixier and turboscribe.\nFor images, I feel the basic nano babana from gemini is already a good start.\nFor text, I use a mix of LeChat and chatgpt.\nFor research, gemini.",
          "score": 1,
          "created_utc": "2026-01-22 19:22:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o16nwha",
          "author": "InevitableCamera-",
          "text": "For work it’s still ChatGPT for copy, ideation, and quick analysis, plus Midjourney for visuals. One less obvious one I use is Gensmo, handy for competitor research and price checks when you’re looking at product pages or ads",
          "score": 1,
          "created_utc": "2026-01-23 04:55:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o17ddbb",
          "author": "Odd-Home3418",
          "text": "Claude ai for Creating Dashboard, quick presentation s. For PPTs Gama ai is also good, Gemini Nano Banana for quick images, creatives. Even try Gigs to create prototypes, UI.",
          "score": 1,
          "created_utc": "2026-01-23 08:20:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o183a7c",
          "author": "Corgi-Ancient",
          "text": "ChatGPT for content and brainstorming, Jasper for quick copywriting, and Canva’s AI for visuals. If you need to build outreach lists fast, SocLeads is pretty solid for grabbing leads from places like LinkedIn and Google Maps. Worth checking out if you do a lot of cold outreach.",
          "score": 1,
          "created_utc": "2026-01-23 12:06:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o195dn7",
          "author": "AccomplishedLeave617",
          "text": "For marketing work, the biggest winning tools for me are the ones that cut down repetitive creative tasks. I’ve been using product creativity lab on mulerun to turn basic product images into multiple marketing visuals for ads like socials and all which saves a ton of time compared to doing everything manually. On top of that, Chatgpt for copy or ideas. The combo really helps move from idea generation to publishing much faster without burning hours on production.",
          "score": 1,
          "created_utc": "2026-01-23 15:35:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1clrpz",
          "author": "umightfafo",
          "text": "Started using NotebookLM to create content and it’s been a game changer for me.",
          "score": 1,
          "created_utc": "2026-01-24 01:37:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1frurj",
          "author": "MorganJIngram0",
          "text": "Claude for writing. Think it sounds the most human once you give it enough inputs.",
          "score": 1,
          "created_utc": "2026-01-24 15:21:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1y8f2p",
          "author": "alicia93moore",
          "text": "For generating product video ads with the help of AI, I would suggest Tagshop AI. A quick, cost-effective way to generate AI ads with an image, prompt or by the product url.",
          "score": 1,
          "created_utc": "2026-01-27 03:22:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2089bv",
          "author": "SERPArchitect",
          "text": "One of our enterprise clients uses Quattr to handle large-scale keyword research,generate competitor insights, create AI-driven content, and automated internal linking. Alongside Gemini for research and idea discovery, Nano Banana for visuals, and Surfer/Clearscope for on-page and semantic optimization. Together, this combo works really well.",
          "score": 1,
          "created_utc": "2026-01-27 12:42:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o14vnx6",
          "author": "kubrador",
          "text": "chatgpt for when you need to sound smart without thinking, apollo for when you need to sound like you've actually done research, and honestly just using spreadsheets to make pivot tables look like insights",
          "score": 0,
          "created_utc": "2026-01-22 22:55:40",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}