{
  "metadata": {
    "last_updated": "2026-02-22 08:50:00",
    "time_filter": "week",
    "subreddit": "b2bmarketing",
    "total_items": 20,
    "total_comments": 214,
    "file_size_bytes": 216283
  },
  "items": [
    {
      "id": "1r7395r",
      "title": "I need to make medical awareness slides with for upcoming presentation",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1r7395r/i_need_to_make_medical_awareness_slides_with_for/",
      "author": "juxhinam",
      "created_utc": "2026-02-17 11:12:50",
      "score": 31,
      "num_comments": 8,
      "upvote_ratio": 1.0,
      "text": "Doing a presentation on diabetes awareness for the community next month. Need to make it fun, engaging and easy to understand for general public. PowerPoint feels too formal and boring for this. What do you use for patient education presentations?",
      "is_original_content": false,
      "link_flair_text": "Support",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1r7395r/i_need_to_make_medical_awareness_slides_with_for/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o5uiovc",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-17 11:12:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ut1xq",
          "author": "e71469",
          "text": "Use Notebook LLM, you will love it",
          "score": 1,
          "created_utc": "2026-02-17 12:32:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5uvhyh",
          "author": "CommunicationNo2408",
          "text": "The tool matters less than the structure imo. For community audiences you want to make the slides super simple with one idea per slide, large visuals and minimal text. You or whoever's speaking needs to be animated and interesting rather than expecting the audience to read a whole lot of text. ",
          "score": 1,
          "created_utc": "2026-02-17 12:49:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5v0b21",
              "author": "posurrreal123",
              "text": "I agree 100% on all points, OmmunicationNo2408. If it's too flashy, they may be distracted and not pay attention to your message. \n\nYou could have a graphic with different elements. As you click, each element would appear to add to the bigger picture until it's complete. It's like a journey.",
              "score": 1,
              "created_utc": "2026-02-17 13:18:45",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r75zcg",
      "title": "4 months into B2B sales and still no traction. what am i doing wrong?",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1r75zcg/4_months_into_b2b_sales_and_still_no_traction/",
      "author": "Ok-University-2605",
      "created_utc": "2026-02-17 13:27:27",
      "score": 22,
      "num_comments": 59,
      "upvote_ratio": 1.0,
      "text": "Hi everyone.\n\nI’m about 4 months into an international B2B sales role at a Turkey-based industrial company, and I feel stuck. I’m starting from zero with no training or mentor, and despite trying cold emails, trade fair outreach, LinkedIn networking, and consistent follow-ups, I’m getting almost no responses. I’m also expected to sell across multiple very different product categories, which makes it hard to build a focused strategy. For those experienced in B2B sales, what should I prioritize to move past the “ignored” phase and start generating real conversations and closing deals? ",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1r75zcg/4_months_into_b2b_sales_and_still_no_traction/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o5v1sqj",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-17 13:27:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o60n70a",
          "author": "LuliProductions",
          "text": "Four months in B2B with no training is hard, especially across multiple product categories. You’re not failing. You’re overloaded. When you try to sell everything, your message becomes generic, and buyers ignore generic.\n\nNarrow down to one product and one clear ideal customer. Focus on one industry and one buyer role. Speak to a specific operational pain, not a product list. Your goal right now is replies, not closed deals. Study how competitors frame their value and sharpen your messaging. Even tools like GetHookd can help you see which angles and positioning patterns work in your niche so you stop guessing. Once conversations start, momentum follows.",
          "score": 7,
          "created_utc": "2026-02-18 07:57:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o69atsr",
              "author": "Ok-University-2605",
              "text": "thank you much.  \nactually i dont confuse people with multiple products. for example i search for potential customers for product A and other customers for product 2 and so on.",
              "score": 1,
              "created_utc": "2026-02-19 15:46:53",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5w4v69",
          "author": "Odd-Home3418",
          "text": "You’re probably not being ignored because of effort.  \nYou’re being ignored because of clarity.\n\nIn B2B, especially industrial, buyers don’t respond to activity.  \nThey respond to **decision readiness**.\n\nRight now, I see 3 likely gaps:\n\n1️⃣ **Recognition**\n\n2️⃣ **Explanation** \n\n3️⃣ **Yes-Safety**\n\nCold emails, LinkedIn, trade fairs — those are channels.  \nBut channels amplify clarity. They don’t create it.\n\nIf I were you, I would:\n\n• Pick ONE product category  \n• Pick ONE buyer persona  \n• Define ONE core problem you solve better than alternatives  \n• Rewrite outreach around that single positioning\n\nIn B2B, traction doesn’t come from doing more.  \nIt comes from removing hesitation.\n\nMost sales teams optimize volume.  \nThe real leverage is fixing the decision layer first.\n\nCurious — if you had to narrow down to one product + one buyer segment for the next 60 days, what would it be?",
          "score": 14,
          "created_utc": "2026-02-17 16:49:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5xc8cz",
              "author": "rishiroy19",
              "text": "This is a great advice!! Similar situation when I started my SaaS which was B2B focus. I wanted to showcase all my product features, and target different buyer personas, it took me a while to correct my mistakes. Narrow down!!!",
              "score": 2,
              "created_utc": "2026-02-17 20:13:41",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o5y1zb4",
              "author": "AccountAbilityB2B",
              "text": "Great advice! Key thing will be choosing which product category and buyer persona. Suggest leveraging insights on what is working for the business already. Who are their biggest customers, what do they do for them and why do they work with them - will help determine the one core problem.   \n  \nIs the business able to work with multiple clients with the same type of business? If yes, then you can do a look-a-like targeting strategy, so approach similar Accounts and offer them the same solutions and leverage case studies / testimonials to hook prospects in",
              "score": 1,
              "created_utc": "2026-02-17 22:15:40",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o69bjcr",
              "author": "Ok-University-2605",
              "text": "thank you for the advice!!  \ni can start with the weilding machine right away, but still i dont understand how to Pick ONE buyer persona.. ",
              "score": 1,
              "created_utc": "2026-02-19 15:50:20",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5w19wp",
          "author": "Kindly_Watercress416",
          "text": "Why doesn’t your company provide any information about the sales process, target audience, sales materials, what works and what doesn’t, or any info from the colleagues or the past employees? \nThat would be really helpful \n\nKolay gelsin",
          "score": 2,
          "created_utc": "2026-02-17 16:30:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o69clr1",
              "author": "Ok-University-2605",
              "text": "thanks, they are good people but propably just dont have so much time to sit and teach me. i super new to sales",
              "score": 2,
              "created_utc": "2026-02-19 15:55:30",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5vb22l",
          "author": "MiniGhost7",
          "text": "What are your numbers? what are your responses like? are they STOP or not interested or what? you can determine what you are doing wrong buy the current feedback.",
          "score": 2,
          "created_utc": "2026-02-17 14:18:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5vce32",
              "author": "Ok-University-2605",
              "text": "Unfortunately I’ve sent hundreds of emails and messages across the platforms but very few people responded and the response was (not interested) other than that I don’t any other feedbacks. \nMy messages normally are short I personalize the context according to the targeted audience, I give an introduction then a summary of the product with two or three sentences, then I ask if they’re interested and wait for the response. \nOne time I got a real response (that was the only time) and they’re asking about the type of the product, I gave more details into it and attached the catalog. But nothing happened after that.",
              "score": 2,
              "created_utc": "2026-02-17 14:26:02",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5vcch4",
          "author": "Mularkeyy",
          "text": "4 months in international industrial B2B isn’t that long, cycles are slow. So don’t assume you’re failing yet.\n\nThe bigger issue is you’re being asked to sell too many categories. That makes your outreach sound generic. I’d pick one product, one industry, and one target country and go deep for 30 days. Focus on getting conversations, not pitches. Learn how they buy, who the decision makers are, what triggers a supplier switch, and what objections come up. Then rewrite your outreach around that one segment.\n\nAlso, in industrial B2B, direct cold email is rarely enough. Start working distributors, agents, and importers in that market too. We talk about practical B2B lead gen approaches on r/LeadGenSEA if you want more ideas.",
          "score": 2,
          "created_utc": "2026-02-17 14:25:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5vcq4j",
              "author": "Ok-University-2605",
              "text": "Thank you so sooo much",
              "score": 1,
              "created_utc": "2026-02-17 14:27:47",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5x8gfi",
          "author": "ConfusionDull2183",
          "text": "\n\nIt’s hard - but it’s all about putting in the grind, learning, and getting smarter as you go.\n\nI’m an old dog in B2B - both marketing and sales.\n\nThe most important point to understand is this:\n\nAt any one time, who is actually in-market for these machines (or whatever B2B stuff you’re selling)?\n\nThe stats show that 95–99% of your market is NOT in-market.\n\nThey’re not interested.\nThey don’t have a problem that needs solving.\nThey don’t give a crap about what you’re selling.\nThey simply think what you offer is of zero need.\n\nYou’re invisible.\n\nLet that sink in.\n\nRarely --- but sometimes --- someone goes, “Wow, great timing, I’m looking.”\nBut it’s rare. It’s almost luck.\n\nThe exception is if you’re the brand everyone thinks of when they want to solve that problem.\n\nA potential buyer has two vendors in their mind before they even start looking for solutions.\n\nTheir day zero list.\n\nIf you have shit marketing, or you’re a lesser-known brand, you’ll always be fighting uphill.\n\nBeing on that day zero list is why big brands keep growing.\n\nI’ve always been in an uphill battle - and I’ve always grinded it out to find success - as you will. \n\nIt just takes time and learning.\n\nIf you want more shit advice look me up - Regan George on Linkedin.",
          "score": 1,
          "created_utc": "2026-02-17 19:55:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o69d38h",
              "author": "Ok-University-2605",
              "text": "thank so so much i needed to hear that. i am more than happy to check your page",
              "score": 1,
              "created_utc": "2026-02-19 15:57:51",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5yatl1",
          "author": "Finners_GrowthStrat",
          "text": "Yup this is not an uncommon story. I'd suggest going back to your core proposition. You'll have a core proposition per customer group or per product (ideally the former) your proposition is a compelling offer that resonates. It's something that your organisation does better than the competition in delivering a valued outcome to your client.\n\nIts not easy to get clarity on your proposition but there are fairly formulaic steps you can follow to get there. The first is taking a step back from tactics and trying to really understand your target customer. Not understand what needs they have for your product but truly understand what makes them tick. This can be a little desk research (googling or gpt) but really needs to include calls with clients. No-sales research interviews. It can feel hard to run these when all you wanna do is pitch but it helps things in the long run.\n\nCustomer is most important, doing that and then layering competitor and your product capability should through up some ideas for what your core value proposition is.\n\nIf helpful to lay it out a bit more let me know and I'll write something up.",
          "score": 1,
          "created_utc": "2026-02-17 23:01:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o69dtmk",
              "author": "Ok-University-2605",
              "text": "thank you so much,, yess please i need more guidance to learn how to lay it out",
              "score": 1,
              "created_utc": "2026-02-19 16:01:24",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5ydl1i",
          "author": "SignificanceBusy2136",
          "text": "Most people don’t respond unless your message hits a very specific need, so narrowing your focus can make a big difference. Pick one product category, learn the pain points, and build a simple, repeatable outreach angle around it.\n\nIt’s also worth checking whether your prospect list is the issue. Using more targeted B2B data sources like Techsalerator can help a lot since their global business datasets actually cover industries in places like Turkey, so you better could reach companies that matched what you are selling. You just need a clearer niche and cleaner targets. Keep iterating.",
          "score": 1,
          "created_utc": "2026-02-17 23:16:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5zm10j",
          "author": "inside-search-1974",
          "text": "Would you give some additional context?\nWhat specific industry, or product categories, type of customer, type of competition, etc.\nI’m open to give some advice but I guess with this level of information it could be very generic.",
          "score": 1,
          "created_utc": "2026-02-18 03:17:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5zo1au",
          "author": "SatisfactionBig7126",
          "text": "Cold B2B outreach is really rough at first. Small improvements in messaging and branding can make a big difference. Agencies like StudioT help craft content that actually gets noticed, which can save you from feeling like your emails are just disappearing into the void.",
          "score": 1,
          "created_utc": "2026-02-18 03:30:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5zvks6",
          "author": "Slight_Tutor1790",
          "text": "It might also help to change the goal of your first message. Right now it sounds like you are pitching and waiting for interest, but in industrial B2B most buyers are not actively looking. Instead of asking if they are interested, try asking a simple question about how they currently handle that specific problem or supplier. That shifts it from selling to starting a conversation. You may get more replies when people feel you are trying to understand their situation rather than sell a product.",
          "score": 1,
          "created_utc": "2026-02-18 04:17:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o69em2h",
              "author": "Ok-University-2605",
              "text": "thank you",
              "score": 1,
              "created_utc": "2026-02-19 16:05:15",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6059o2",
          "author": "svlease0h1",
          "text": "starting b2b sales without replies feels discouraging but it happens early on. focusing on one product and one buyer type usually helps conversations start. rewriting outreach with one clear problem and one result makes emails easier to read. a new rep narrowed focus for two weeks and finally booked meetings.",
          "score": 1,
          "created_utc": "2026-02-18 05:25:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o60tv5d",
          "author": "o1got",
          "text": "did you try analyzing your conversations/emails in Claude? you will get honest feedback and ideas for improvement",
          "score": 1,
          "created_utc": "2026-02-18 09:00:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o69exbq",
              "author": "Ok-University-2605",
              "text": "let me try that . thanks",
              "score": 1,
              "created_utc": "2026-02-19 16:06:44",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o61jowk",
          "author": "WannabeeFilmDirector",
          "text": "You've got some great advice on here, especially focusing on a market.  I started in B2B in a dinky company.  It was hellishly hard until we had some video customer testimonials.  Videos of customers saying it's a great product.  That was a gamechanger.\n\nWe were then bought by Reuters and the brand made everything so much easier.  Ridiculously easier.\n\nSo I'd recommend doing what other people have suggested but getting a little killer collateral.  Because who do prospects trust more?  Is it the salesperson selling to them or videos of customers saying you've got a great product?",
          "score": 1,
          "created_utc": "2026-02-18 12:34:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o62xirz",
          "author": "MembershipHorror404",
          "text": "Four months is still early for B2B, especially if you're selling across multiple product categories. That actually makes it harder because you can't refine one pitch.\n\nA few things that helped us when we were in a similar spot: pick one category and go deep on it first instead of spreading thin across all of them. Way easier to build momentum when you're not switching contexts every call.\n\nAlso, consistent follow-ups matter more than you think. We thought people were ignoring us, too but turns out B2B cycles are just long and people need like 5-7 touchpoints before they even respond. Set up a simple system to track who you've talked to and when to follow up again.\n\nAnd honestly, trade shows and LinkedIn might not be your best channels. What's worked better for us is finding where your buyers actually hang out: industry groups, forums, even niche Slack communities. Cold outreach from those places converts way better than generic LinkedIn messages.\n\nDon't give up yet. Four months is nothing in B2B. Most of our deals took 6-9 months from first contact to close.",
          "score": 1,
          "created_utc": "2026-02-18 16:47:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6653j4",
          "author": "Ancient-Sea-7807",
          "text": "U need to work on matching the customers' frequency! Its okay, all Start broad but when you engage with people, adapt your pitch on the fly. \n\nYou need to Understand their pain points and tailor your conversions to show how your product solves their specific needs. \n\nOnce you've got clarity, target similar audiences and repeat the process. \n\nEverything will help like Cold emails, trade fairs but your content should intrest them – it's all about bridging the gap between what they need and what you offer.",
          "score": 1,
          "created_utc": "2026-02-19 02:12:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o69bkr7",
          "author": "ProfessionalAir6580",
          "text": "B2b is itsself a hard game to crack and time taking as well what u need to do is first of all know your target audience then build connection from lower level first nail it without reference convincing client is difficult. Feel free to DM if u want help",
          "score": 1,
          "created_utc": "2026-02-19 15:50:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6a33y8",
          "author": "eviom_B2BMarketing",
          "text": "Hm, in dem Fall würde ich LinkedIn Ads empfehlen. Hast du das schon mal gemacht?",
          "score": 1,
          "created_utc": "2026-02-19 18:02:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6kc58k",
              "author": "Ok-University-2605",
              "text": "No let me tell the company to do so",
              "score": 1,
              "created_utc": "2026-02-21 07:02:57",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6b70nf",
          "author": "MarketingOB1",
          "text": "B2B requires patience and a long term strategic approach. Build credibility first. Google reviews. Service. Quality.",
          "score": 1,
          "created_utc": "2026-02-19 21:13:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6bd8gk",
          "author": "TightNectarine6499",
          "text": "I don’t see any numbers. Numbers speak.",
          "score": 1,
          "created_utc": "2026-02-19 21:44:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6kc6gc",
              "author": "Ok-University-2605",
              "text": "What do you mean ?",
              "score": 1,
              "created_utc": "2026-02-21 07:03:16",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6ljp46",
                  "author": "TightNectarine6499",
                  "text": "You tried cold emails, networking that all says nothing since you don’t give any numbers and it’s unclear what your approach is. You might not be nurturing, ask for sales before they are ready, or they are not looking for what you offer.\n\nAlso different industries have different habits.\n\nIf you’re not measuring what you’re doing you can’t steer, so you don’t know when to adjust your approach.\n\nAsk your boss for on the job training.\n\nThere are also a lot of free trainings online, check youtube, be specific\n\nMake sure it’s specific to your industry. Send an email to your manager ask for 20 min to discuss sales, show up prepaired so you can ask targeted questions to get to know their industry, typical behavior of their ideal clients.\n\nWhat works, what does not work?\n\nHow does their buying proces works, how many people are involved, at what level should I approach. Get to join in calls, meetings (be fly on the wall). Ask for onboarding.",
                  "score": 1,
                  "created_utc": "2026-02-21 13:35:56",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6ljv7v",
          "author": "TightNectarine6499",
          "text": "Ask chatgpt",
          "score": 1,
          "created_utc": "2026-02-21 13:37:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6matfl",
          "author": "Round_Bullfrog_4563",
          "text": "What's your service? Can you specify? Finding a top notch service is important. Problem I have is I've got 190k real estate, 450k ecommerce, 127k accounting and other leads. Now I need to figure out what to sell them.\n\nAnd you mentioned you're targeting Turkish clients. Why not US, UK, Aus clients? English speaking ones Is easier",
          "score": 1,
          "created_utc": "2026-02-21 16:07:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ng3l4",
          "author": "KissyyyDoll",
          "text": "Sounds like you’re juggling too much at once. Focus on one product line, one target persona, and build a strategy there before spreading thin.",
          "score": 1,
          "created_utc": "2026-02-21 19:33:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5vp8y0",
          "author": "Own-Skin-354",
          "text": "four months in b2b sales with no training and no clear product focus is honestly a very tough setup, so don’t beat yourself up too fast.\n\nfrom what you wrote, the biggest issue sounds like too much spread. too many product categories and one generic message. buyers switch off when the pitch feels broad.\n\npick one product line and one buyer type first. write to their specific problem in simple words. show that you understand their use case, not just your catalog.\n\nalso try to get on calls instead of only sending emails. even short intro calls help you learn faster than 100 ignored messages.\n\nif possible, ask your company for past customer data or old deals and study what actually worked. patterns are usually there.\n\nearly b2b sales is less about volume and more about relevance. once your message fits the buyer, replies start coming.",
          "score": 1,
          "created_utc": "2026-02-17 15:31:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5vqfer",
              "author": "Ok-University-2605",
              "text": "I actually do that \nI spent some time learning the machines , which don’t take a long time because I’m actually and engineering graduate. But I’m not a salesperson that’s where I’m struggling.\nI try to dedicate my days to focus on searching and finding customers , for example one day is only for the product A , and the next day is for product B and so on. \nI never email anyone to pitch about multiple products. \nI never tried calling actually. Maybe I should switch to that",
              "score": 2,
              "created_utc": "2026-02-17 15:37:14",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5w06js",
                  "author": "Kindly_Watercress416",
                  "text": "The fact that you’re not a sales person can be even better. You understand the tech side deeply and it can work for you. So don’t worry",
                  "score": 2,
                  "created_utc": "2026-02-17 16:25:12",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5xbti7",
          "author": "Tiny-Celery4942",
          "text": "Starting from zero with no mentor is tough, especially with too many products. I found that trying to reach everyone usually means reaching no one. I stopped the random cold outreach and moved to a daily loop that actually works. \n\nFirst, I pick twenty high value prospects and only follow their posts. I leave real comments on their content for a week before I ever send a message. This makes my name familiar. When I finally reach out, I mention a specific point they made. \n\nI use Depost AI to manage this workflow. it helps me keep a targeted feed of just those prospects and drafts my first comments and follow ups so I stay consistent. It keeps my DMs organized so I never miss a reply. Happy to share my daily checklist if it helps.",
          "score": 1,
          "created_utc": "2026-02-17 20:11:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o69cb06",
              "author": "Ok-University-2605",
              "text": "thank you for the advice, but how do i pick the high value prospects :(",
              "score": 1,
              "created_utc": "2026-02-19 15:54:04",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o69f2i6",
                  "author": "Tiny-Celery4942",
                  "text": "First start creating content around you ICP's, it will serve you much better then spraying cold DMs, Emails, daily you will find interested users you can engage them.. Finding high value prospects starts with looking at who is already active in your niche. Use LinkedIn search , SN to find people posting about your industry or commenting on your competitors posts. These are the warm leads because they are already talking about the problems you solve. I use Depost AI to save these specific people into a targeted feed so I can engage with them before sending a DM. This way I only talk to people who actually care about the product. \n\nYou may consider creating different accounts for each ICP, but it will move your funnel, build some authority by content, so you get listen.",
                  "score": 1,
                  "created_utc": "2026-02-19 16:07:25",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1rad461",
      "title": "How do I scale from 2k to 10k per month",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1rad461/how_do_i_scale_from_2k_to_10k_per_month/",
      "author": "This_Assignment_2188",
      "created_utc": "2026-02-21 00:52:27",
      "score": 19,
      "num_comments": 17,
      "upvote_ratio": 0.9,
      "text": "Hey all,\n\nI’ve been an avid reader of the subreddit for quite some time. Recently, I decided to leave my full time job and, with a bit of runway, start my own SaaS instead of working a regular 9-5.\n\nAnyway, it’s gone pretty well and I’ve hit approx 2k per month with a pretty decent profit margin.\n\nI’ve got to this point by product hunt launches and launching on other similar sites.\n\nI’ve got a super low churn rate, which is helpful! However, I don’t feel as though I have enough money to start doing paid ads.\n\nI’ve got approx $900 to work with each month. My question is this: how do I get to 10k per month without doing paid ads?\n\nIt’s a bit of a catch-22. I can’t scale without ads and I can’t get ads without scaling.\n\nMy tool is a SaaS that identifies visitors on your website and turns them into pipeline for you to sell to. See: Clickmodus.com\n\nAny advice would be much appreciated.",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1rad461/how_do_i_scale_from_2k_to_10k_per_month/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o6iw35k",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-21 00:52:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6iy1r3",
          "author": "I_trust_politicians",
          "text": "I'd start talking to the customers you've brought in. See why they signed up for your product (was there a trigger moment), and what specific problems it's solved for them/successful outcomes they've gotten from it. Look for similarities/are they from a specific industry etc. \n\nIf they are coming from a similar industry/use case, you could test linkedin ads with super-narrow targeting. I worry SEM will have too much competition, and you'll end up getting like 28 clicks for your $900. \n\nBut honestly, I'd probably look into a referral program for existing customers. Give them some sort of discount every time they refer someone. ",
          "score": 5,
          "created_utc": "2026-02-21 01:04:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6j0c2h",
              "author": "This_Assignment_2188",
              "text": "This is great, thank you. The nature of my product allows me to see my customers sites - I’m going to do a deep dive into that and see what I come up with. I am going to give more thought into the LinkedIn ads route.",
              "score": 2,
              "created_utc": "2026-02-21 01:18:36",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6iyfyf",
          "author": "kubrador",
          "text": "sounds like you need to pick a vertical and become the default answer for that problem instead of trying to be everything to everyone. $900/month goes way further doing outreach to 50 specific companies than running ads to the void.",
          "score": 2,
          "created_utc": "2026-02-21 01:06:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6j0l96",
              "author": "This_Assignment_2188",
              "text": "Interesting, could you explain this a bit further? My tool is quite broad in the fact that it helps almost all B2B sites - how do I decide what vertical to pick? I’m guessing something low competition although that is easier said than done!",
              "score": 2,
              "created_utc": "2026-02-21 01:20:09",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o6k5pij",
              "author": "fistminut",
              "text": "yeah this is the move. when you say \"pick a vertical\" how narrow are you thinking, like \"shopify agencies\" narrow or just \"b2b saas\"? and are you doing cold email or linkedin for those 50?",
              "score": 1,
              "created_utc": "2026-02-21 06:05:25",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6lcbac",
          "author": "GetCameraCrew",
          "text": "How did you get to 2k?",
          "score": 1,
          "created_utc": "2026-02-21 12:44:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6ld5c9",
              "author": "This_Assignment_2188",
              "text": "Launching on sites such as product hunt. Also trying to get some traction via Reddit but not seeing much success.",
              "score": 1,
              "created_utc": "2026-02-21 12:50:33",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6lgqpm",
                  "author": "GetCameraCrew",
                  "text": "Can you lunch 5 more times? and you'll get to 10k",
                  "score": 1,
                  "created_utc": "2026-02-21 13:16:20",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6mfejz",
          "author": "Confident_Box_4545",
          "text": "2k to 10k is not an ad problem. It is a distribution loop problem.\n\nIf churn is low, double down on referrals, case studies, and outbound to the exact ICP already converting.\n\nScale what already works before you pay to amplify it.",
          "score": 1,
          "created_utc": "2026-02-21 16:30:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6mmwfs",
          "author": "Wise-Trouble-653",
          "text": "The trap is thinking ads are the lever that takes you from 2k to 10k.\n\nAt 2k MRR, your issue isn’t traffic. It’s focus. Product Hunt gave you bursts, not a repeatable engine. Scaling now is about picking one distribution path and exhausting it.\n\nYou sell pipeline. That means your buyers care about revenue, not features. Can you niche down to one segment where the ROI is obvious and build direct outbound around that? 50 highly targeted conversations a week beats broad ads.\n\nLow churn means you have proof. Turn that into case studies and partner with agencies or consultants who already sell to your ICP.",
          "score": 1,
          "created_utc": "2026-02-21 17:07:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6nmrcz",
          "author": "_forgotmyownname",
          "text": "Yeah, $900 isn’t huge for ads. I’d try making awesome guides, case studies, or templates for your audience and share them on forums, LinkedIn, or relevant communities. Word-of-mouth + free channels can do a lot.\n\n",
          "score": 1,
          "created_utc": "2026-02-21 20:07:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ocbps",
          "author": "manufacturermarketer",
          "text": "I'm not SaaS person but here's couple of advice:\n1. Never put all of your eggs in one basket. Don't just rely on paid ads, do SEO/GEO, paid ads and cold emailing.\n2. Conversions are all about positioning, experience and trust.\n3. Don't focus on scaling from 2K to 10K focus on gradually going from 2K to 2.5K then 3K. Plan\n4. Most companies(especially b2b) build a strategy and then figure out things on the job.\n5. Place good systems and people in place which will focus on the actual data than their own assumptions.",
          "score": 1,
          "created_utc": "2026-02-21 22:24:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ktgge",
          "author": "Imaginary-Leg-2546",
          "text": "You can't get to 10k per month without running paid ads.",
          "score": 0,
          "created_utc": "2026-02-21 09:52:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6kugi8",
              "author": "This_Assignment_2188",
              "text": "At what point to I swap to paid ads? Do I just take all of my net profit for the month and put into ads? I thought the pixels on these sites needed time to learn etc.",
              "score": 1,
              "created_utc": "2026-02-21 10:02:19",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r9h0a7",
      "title": "How are you improving AI search visibility in 2026?",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1r9h0a7/how_are_you_improving_ai_search_visibility_in_2026/",
      "author": "purpleplatypus44",
      "created_utc": "2026-02-20 00:50:50",
      "score": 16,
      "num_comments": 20,
      "upvote_ratio": 1.0,
      "text": "Yo, i’ve been thinking a lot about AI visibility lately, not just classic Google SEO. Rankings and backlinks still matter, obviously, but I keep hearing people say they found brands through ChatGPT or Google AI Overviews instead of clicking search results. That kind of made me pause. It feels like LLM visibility and AI search optimization are becoming their own thing.\n\nWhat I’m trying to wrap my head around is what actually moves the needle here. Is it still mostly the traditional SEO stuff like topical authority and strong internal linking? Or is AI visibility more about clear positioning, solid comparison pages, tight FAQs, structured content, and consistent brand mentions across trusted sites? It’s a bit confusing tbh.\n\nFor anyone actively working on GEO or AEO, what has genuinely helped you get cited in AI answers? Are you tracking LLM mentions separately from normal rankings? And honestly, what mistakes have you made that others should avoid when trying to build long-term AI search visibility?",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1r9h0a7/how_are_you_improving_ai_search_visibility_in_2026/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o6catct",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-20 00:50:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6cbwfh",
          "author": "ronniealoha",
          "text": "OP, classic SEO still matters. Authority, internal links, backlinks, that’s the foundation. But that’s table stakes now. What really moves AI visibility is clarity. Clear positioning, strong comparison pages, direct answers, tight FAQs, and consistent mentions across the web. LLMs need to clearly understand what you are and when to recommend you.\n\nThe teams doing well treat GEO as a second layer. They still optimize for Google, but they also track a set of non-branded prompts in ChatGPT or Perplexity, log citations, and adjust content based on gaps. Some use tools like Meridian to make that tracking easier over time.\n\nBig mistake I see? Adding more content instead of making existing content clearer and more citable. AI rewards obvious authority, not just volume.",
          "score": 7,
          "created_utc": "2026-02-20 00:57:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6d7vlv",
              "author": "Forcepoint-Team",
              "text": "Well said",
              "score": 1,
              "created_utc": "2026-02-20 04:19:20",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6cbs1l",
          "author": "EldarLenk",
          "text": "Tbh I think most people are still stuck in more content equal more visibility mode. That worked years ago. Now? Not really. If your positioning is vague, you can publish 50 blog posts and LLMs still won’t know what box to put you in. I’d rather see 10 super clear, tightly focused pages than 100 random ones. Clarity beats volume every time.",
          "score": 2,
          "created_utc": "2026-02-20 00:56:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ccnzc",
          "author": "pumpkinpie4224",
          "text": "ngl, stop obsessing over mentions and start caring about citations. A mention is nice for ego. A citation means your page was trusted as a source. That’s the signal that matters. When I review this stuff, I literally ask, “Which URL got pulled?” If you can’t answer that, you’re just staring at vibes.",
          "score": 2,
          "created_utc": "2026-02-20 01:01:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6d18u9",
          "author": "SearchMaverick",
          "text": "What's working for us is treating AI visibility as a citation problem, not a content-volume problem. Build topical clusters around high-intent questions, add clear entity/context signals and publish evidence-rich pages that are easy to quote. \n\nThen track three things by topic - mention rate, citation rate and assisted conversions from AI referrals, not just raw traffic. Biggest mistake I keep seeing is publishing generic AI-written posts without a map, which creates output but not authority.",
          "score": 2,
          "created_utc": "2026-02-20 03:34:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6cd88j",
          "author": "Tchaimiset",
          "text": "For me, off site context matters more than people admit. Like with reddit threads, niche communities, review sites, podcasts, guest posts. LLMs don’t just read your homepage. They piece together who you are from the whole web.   \nIf your brand only exists on your own domain, that’s a weak entity signal. You need people talking about you elsewhere.",
          "score": 1,
          "created_utc": "2026-02-20 01:05:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6daoo3",
          "author": "celestialcascade012",
          "text": "I’ve been thinking about the exact same thing, I actually started working with SearchTides specifically to figure this out. Clear messaging alignment so AI consistently associates us with a specific category",
          "score": 1,
          "created_utc": "2026-02-20 04:39:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6eh1p3",
          "author": "LeadershipRare1908",
          "text": "Reddit is pretty useful to get mentionned by LLMs.  \nBtw Sam Altman personally owns around 8.7% of Reddit (making him the third-largest shareholder)  \n  \nI don't think this is insignificant ",
          "score": 1,
          "created_utc": "2026-02-20 10:55:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6eh98r",
          "author": "PerfectFinish94",
          "text": "Previously, the goal was to rank only on Google, which was fine with blogs and links, but now we need to be seen in AI answers, so we need to get as many mentions as possible, which we can now refer to as listicles and brand mentions, and we can't just rely on blog posting; we need to be active on all platforms.",
          "score": 1,
          "created_utc": "2026-02-20 10:56:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6fr9pr",
          "author": "Gotoclient",
          "text": "Reddit is definitely useful for LLM citations",
          "score": 1,
          "created_utc": "2026-02-20 15:33:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6grfrv",
          "author": "AdamYamada",
          "text": "You need a Reddit strategy. \n\nAlso helps to have other publications answer questions about your brand. Not just on your own website. \n\nI've even helped build-up a 3rd party publications to help with this. ",
          "score": 1,
          "created_utc": "2026-02-20 18:19:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6gvvns",
          "author": "Hopeful_Account_1370",
          "text": "Look, I get the confusion AI search feels like a whole new game in 2026, and yeah, people are finding brands via ChatGPT, Perplexity, or Google AI Overviews without clicking through. But let's cut the bullshit: it's **not** \"its own thing\" separate from SEO.\n\nI've run AEO for SaaS clients since 2024 one fintech jumped 7x in citations in 90 days by adding original benchmarks + advertorials on authority pubs, plus tracking via tools like Profound or Semrush AI Visibility. Zero magic; just consistent, citable content + off-site authority signals.\n\nMistakes killing most people: keyword stuffing (AI hates it), ignoring conversational/long-tail intent, stagnant content (freshness matters), or chasing \"simplified\" fluff that tanks real SEO.\n\nTrack LLM mentions separately yes, use visibility tools (Semrush, Conductor benchmarks show it's now a core KPI).\n\nIf you're still treating this as \"classic SEO + some FAQs,\" you're getting eaten alive. Build real authority with data no one else has, get mentioned everywhere trusted, and structure like AI wants to quote you. That's it no shortcuts.\n\nAI visibility isn't new tricks; it's traditional SEO on steroids with citation hunger.\n\nDo that, or watch your traffic evaporate",
          "score": 1,
          "created_utc": "2026-02-20 18:39:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6h0yf9",
          "author": "No-Perspective4464",
          "text": "Structured content, clear positioning, and getting mentioned on trusted third-party sites seem to be what actually moves the needle for LLM visibility.. tools like Semrush or VoxLabs can help you track where your brand is showing up and what's driving those mentions.",
          "score": 1,
          "created_utc": "2026-02-20 19:02:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6hcu0t",
          "author": "erickrealz",
          "text": "Stop treating this like a separate discipline. AI models pull from the same damn sources that rank well traditionally, authoritative content, strong brand signals, and consistent mentions across trusted sites.\n\nThe stuff that actually works is boring. Clear product positioning, solid comparison content, well structured FAQs, and getting mentioned naturally in industry discussions. That's it.\n\nBiggest mistake I see is people chasing \"AI optimization\" as some new shiny thing while ignoring fundamentals. Nail your topical authority first and the AI citations follow.",
          "score": 1,
          "created_utc": "2026-02-20 19:59:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6hj2qu",
          "author": "fishmatador",
          "text": "Mostly still strong SEO fundamentals, but the big win is clear, structured, question-focused content that’s easy for LLMs to quote, plus tracking AI citations separately from normal rankings.",
          "score": 1,
          "created_utc": "2026-02-20 20:30:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6pnm26",
          "author": "Thomas-at-Vanguard",
          "text": "For us it’s been layering on structure and reformatting to make it more easily digestible for LLMs but the same content types still work. \n\nFocusing on how much stuff costs, comparisons, best of type articles are heavily referenced because that’s what people are asking. The answer matters more than any ‘hack’.",
          "score": 1,
          "created_utc": "2026-02-22 03:18:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6dozv9",
          "author": "supriya_l89",
          "text": "The present situation demonstrates that organizations need to focus on their core business operations yet they must develop systems which machines can understand.   \n  \nTopical authority still matters. People who lack strong traditional SEO abilities will have difficulty appearing in AI responses. The following elements have contributed most to success:  \n  \nLLMs show better performance when presented with clear and precise positions.  \n  \nThe website contains two types of pages: comparison pages and use-case pages.  \n  \nThe website provides short FAQs which deliver precise answers to common inquiries from buyers.  \n  \nThe organization maintains a uniform presence on trustworthy websites through consistent brand mentions.   \n  \nWe monitor LLM visibility through two methods which include manual prompts and tools that track AI citations because rankings do not equal mentions.  \n  \nPeople make a major error by pursuing AI-specific marketing tactics which fail to produce practical content that delivers value through organized information. The AI system shows better results when it comprehends information through which it needs to evaluate the entire content of an article.",
          "score": 0,
          "created_utc": "2026-02-20 06:35:13",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r5nzqa",
      "title": "What’s the difference between buyer enablement and sales enablement?",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1r5nzqa/whats_the_difference_between_buyer_enablement_and/",
      "author": "Powoso",
      "created_utc": "2026-02-15 19:45:07",
      "score": 14,
      "num_comments": 3,
      "upvote_ratio": 1.0,
      "text": "I keep seeing both terms used in B2B sales conversations, buyer enablement and sales enablement, and they often get mixed together. On the surface they sound similar, but I’m starting to think they focus on different parts of the sales process.\n\nSales enablement feels more internal. Things like training reps, organizing content in tools like Seismic or Highspot, managing playbooks, and keeping messaging consistent. It’s about helping the sales team execute better.\n\nBuyer enablement seems more external. It’s about making it easier for the buyer to evaluate, align internally, and move toward a decision. I’ve seen platforms like Trumpet, Dock, or Aligned positioned more on that side because they focus on how proposals, pricing, and next steps are presented and shared after a demo.\n\nSo I’m trying to separate the two in my head. One supports the rep. The other supports the buyer.\n\nFor teams that have invested in both types of tools, how do you define the difference in practice? Where did you see the biggest impact?",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1r5nzqa/whats_the_difference_between_buyer_enablement_and/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o5k7741",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-15 19:45:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5m6qgy",
          "author": "yngbld5",
          "text": "This is a great question, and your segmentation is logical.  But I would define sales enablement as a subset of buyer enablement. \n\nTo explain, the best description of sales I’ve encountered, and adopted, is that “sales is about helping people buy.”  I also believe that today, the mission of marketing is to help people buy and retain the role of supporting sales.  But as B2B buyers increasingly self-direct their discovery and evaluation of business solutions, buyer enablement now carries 60%-80% of the buyer journey. \n\nThe things that buyers care about at the end of the sales cycle - the sales enablement stage, are the same things that they care about long before sales engagement.  Messaging, content depth, and tactics must progress to meet buyer stage needs throughout the process, before and after sales engagement.  In today’s B2B, sales enablement and buyer enablement are effectively shape-shifting to meet buyer's needs and help people buy. ",
          "score": 1,
          "created_utc": "2026-02-16 02:28:41",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r7whkl",
      "title": "B2B is harder than I thought.",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1r7whkl/b2b_is_harder_than_i_thought/",
      "author": "Key-Possibility-4494",
      "created_utc": "2026-02-18 07:24:16",
      "score": 14,
      "num_comments": 30,
      "upvote_ratio": 1.0,
      "text": "Basically, I’ve discovered that being good at B2B networking and socializing is crucial.\n\nI’ve found a few excellent tools that have been incredibly helpful. However, is there any way to bypass this requirement? ",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1r7whkl/b2b_is_harder_than_i_thought/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o60jifx",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-18 07:24:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o64impu",
          "author": "erickrealz",
          "text": "No. There's no shortcut around relationships in B2B. Tools help you find and reach people faster but they don't replace the trust that closes deals. The companies winning at B2B aren't the ones with the best tech stack, they're the ones where the founder picks up the phone and has real conversations.\n\nIf networking doesn't come naturally, start small. Join one industry community, comment thoughtfully, and build relationships with 5 people this month. B2B sales is just helping people solve problems through conversation. You don't need to be a damn extrovert, you just need to genuinely care about their business.",
          "score": 9,
          "created_utc": "2026-02-18 21:06:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o65kkon",
              "author": "Key-Possibility-4494",
              "text": "Thank you for the words of wisdom!",
              "score": 1,
              "created_utc": "2026-02-19 00:14:45",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o68q31b",
              "author": "Real_Round5353",
              "text": "This is a valuable comment, as it essentially describes how the world operates.",
              "score": 1,
              "created_utc": "2026-02-19 13:58:31",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o65amdp",
          "author": "Zealousideal-Job6344",
          "text": "Everything is hard! But as someone who has been b2b 2 decades, I love it. Is networking important, yes. But does that mean you need to be party animal.. no. The goal should be find your tribe. You will find people that speak your language. If you have the depth in your domain, that is generally enough to get you going. Don’t worry how you dress , how you speak , if drink or not. Just be yourself and b2b should take care of you. Ping me if you need help !",
          "score": 4,
          "created_utc": "2026-02-18 23:20:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o65kc1e",
              "author": "Key-Possibility-4494",
              "text": "Thank you for this! I will shoot you a DM and pick your brain more 👍🏻",
              "score": 2,
              "created_utc": "2026-02-19 00:13:26",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o6lezdw",
              "author": "TreeExtra525",
              "text": "As a fellow B2B founder I totally resonate with this. Would love to ping and connect we might be different industries but still sure we can align anyway on stuff :)",
              "score": 2,
              "created_utc": "2026-02-21 13:03:58",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6m722d",
                  "author": "Zealousideal-Job6344",
                  "text": "Sure would love to speak offline",
                  "score": 1,
                  "created_utc": "2026-02-21 15:48:32",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o64me3s",
          "author": "mariposa_marketing",
          "text": "Have you had any clients yet? If so, can they refer you? Also, I’d leverage speaking engagements and panel opportunities if you can.",
          "score": 3,
          "created_utc": "2026-02-18 21:23:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o65kvlq",
              "author": "Key-Possibility-4494",
              "text": "I have had a couple clients so far. I have done some speaking engagements, but not panel opportunities. This is interesting!",
              "score": 2,
              "created_utc": "2026-02-19 00:16:25",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o67f7kl",
          "author": "madhuforcontent",
          "text": "Build your personal brand so strong on the social media platforms",
          "score": 3,
          "created_utc": "2026-02-19 07:38:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o62fg6h",
          "author": "kubrador",
          "text": "you can't network your way out of not networking, my guy. that's like asking if there's a shortcut to the shortcut.",
          "score": 2,
          "created_utc": "2026-02-18 15:24:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o64h4nh",
              "author": "Key-Possibility-4494",
              "text": "I haven’t really looked at it that way. Shortcut to a shortcut does not end well 🙃. I will stick that in my pocket!",
              "score": 1,
              "created_utc": "2026-02-18 20:59:13",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o62hhze",
          "author": "Intrepid_Boss9449",
          "text": "Honestly, you can’t really skip the social part in B2B. But tools like SocListener help cut down the awkwardness by finding good posts and auto-making comments so you don’t have to start from zero every time. It’s not a full bypass but makes networking less painful.",
          "score": 2,
          "created_utc": "2026-02-18 15:34:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o64hgm2",
              "author": "Key-Possibility-4494",
              "text": "I have tried SocListener. It was good but felt very, robotic. I do not have a lot of experience with it, so it was probably user error vs the tool itself. I will try it again.",
              "score": 1,
              "created_utc": "2026-02-18 21:00:44",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o66gyhg",
          "author": "SignificanceBusy2136",
          "text": "B2B definitely leans heavily on networking, but it doesn’t have to be all handshakes and small talk. A lot of people make it easier by tightening their targeting first, so conversations start warmer and feel less forced. Clean firmographic data helps with that. Tools like Techsalerator can surface the right companies, roles, and direct contacts, which cuts down on random outreach and makes each interaction more intentional.\n\nFrom there, simple routines on LinkedIn go a long way. Commenting on posts, sending quick value‑first notes, and staying visible builds familiarity without needing to be a natural extrovert. When you’re reaching out to the right people and showing up consistently, the “networking” part feels a lot less daunting. Good targeting reduces how much social energy you need; consistency does the rest.",
          "score": 2,
          "created_utc": "2026-02-19 03:22:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o684x1j",
          "author": "GrouchyGovernment784",
          "text": "Totally fair. B2B *is* harder than it looks.\n\nLonger sales cycles, more decision-makers, higher trust needed and slower wins. It takes patience and strong relationships.\n\nBut once it clicks, the deals are bigger and more stable.",
          "score": 2,
          "created_utc": "2026-02-19 11:39:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o68a3ia",
          "author": "norfolk789",
          "text": "avoid free 'meetups' - most are a waste of time. If you can try join a paid entrepreneur community like EO. Pavillion and Exit5 are also pretty good for sales and marketing learning and connecting. ",
          "score": 2,
          "created_utc": "2026-02-19 12:18:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6d7jzp",
              "author": "Key-Possibility-4494",
              "text": "That makes sense. I think I am in the stage of wanting to learn and understand B2B at a deeper level. I am always drawn to rabbit trails and B2B seems to have infinite directions one can dive into. It seems as if the only limitations is one’s ability to get creative.",
              "score": 1,
              "created_utc": "2026-02-20 04:17:03",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o68kuev",
          "author": "beforeyoureyes",
          "text": "While I agree that networking is important in B2B marketing overall, the amount of how much you'll actually have to do in order to be successful varies significantly by the product/service/industry you're in. \n\nFor example, my previous marketing job was doing B2B at an Australian bank, and the networking/socialising component was surprisingly much less involved (Sales handled most of it) than in my job before that, when I worked with a hospitality SaaS company.  \n\nYou can't avoid/bypass networking in B2B (in fact, you should actually actively lean into it in a positive way; networking in some shape or form is a requirement of most marketing roles, either B2C or B2B, and it's healthy to get 'good' at it). However, just know that there are some B2B roles where it's not as large a part of the job as in others.",
          "score": 2,
          "created_utc": "2026-02-19 13:28:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6d75oe",
              "author": "Key-Possibility-4494",
              "text": "Interesting. So, depending on what type of B2B I am doing, this will affect the level of networking required. Not remove it, but potentially decide or increase it. Is this correct?",
              "score": 1,
              "created_utc": "2026-02-20 04:14:16",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6dknqj",
          "author": "KissyyyDoll",
          "text": "You can't really bypass the human element in B2B because trust is the primary currency for high-ticket deals. You can automate the lead gen and the initial outreach, but eventually, someone has to get on a call. Focus on building a repeatable process so the \"socializing\" part feels less like a chore and more like a checklist.\n\n",
          "score": 2,
          "created_utc": "2026-02-20 05:57:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6j1zgn",
          "author": "therealtricklowe",
          "text": "My business mantra is ‘friendship first, business always’.\n\nAnd I’ve NEVER found a product or service where this wasn’t true.\n\nIt’s not what you know, it’s who you know.\n\nThis is a fact that will never change.",
          "score": 2,
          "created_utc": "2026-02-21 01:28:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o60zfxm",
          "author": "lionstock555",
          "text": "No way bro. It’s the job itself",
          "score": 1,
          "created_utc": "2026-02-18 09:52:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o62qr3x",
              "author": "Key-Possibility-4494",
              "text": "Make sense! My introverted self was not ready for this awareness of the job 😆",
              "score": 2,
              "created_utc": "2026-02-18 16:16:30",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o62zo76",
                  "author": "lionstock555",
                  "text": "don't worry. Introverts can do very well in this field. It needs some methods...",
                  "score": 2,
                  "created_utc": "2026-02-18 16:56:47",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o610ccp",
          "author": "eloquent_t",
          "text": "What are the tools you are talking about?",
          "score": 1,
          "created_utc": "2026-02-18 10:00:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o64gl48",
              "author": "Key-Possibility-4494",
              "text": "I have been using Lusha. It has been good. I also use Campaign.ceo they have been good. They curate leads to my clients. Very simple, but very useful. B2B seams to get so complex sometimes. Keeping things simple helps me a ton.",
              "score": 2,
              "created_utc": "2026-02-18 20:56:44",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o68ta9k",
          "author": "ViceCityVixen",
          "text": "I felt the same starting out. In B2B, trust is the product, so networking isn’t optional, but you can make it easier. Pick a tight niche, show real case studies, and let warm intros do the heavy lifting. You don’t need to be a social butterfly, just consistently visible and useful.",
          "score": 1,
          "created_utc": "2026-02-19 14:16:13",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1ra34sb",
      "title": "This is how sales actually happen, not the way most people think.",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1ra34sb/this_is_how_sales_actually_happen_not_the_way/",
      "author": "JunaidRaza648",
      "created_utc": "2026-02-20 18:21:53",
      "score": 13,
      "num_comments": 9,
      "upvote_ratio": 1.0,
      "text": "Just think about the buyer’s journey.\n\nThey had a problem and heard about your solution, probably on LinkedIn, Reddit, X, in a listicle, or through an email.\n\nWhat’s the next step?\n\nThey’ll want to learn more about you:\n\n1. Your online credibility\n\n2. Your brand story\n\n3. Your relevance\n\n4. Your reviews and case studies\n\nAll of this adds up to building trust in your product.\n\nThen one day, often through a search engine, they land on your website or landing page and reach out to you.\n\nThat’s how sales actually happen, not the way most people think.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1ra34sb/this_is_how_sales_actually_happen_not_the_way/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o6grwo5",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-20 18:21:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6gteh9",
          "author": "Pat_Coyle",
          "text": "Sure. That’s all „problem aware stage“ - but how convert „unaware“?",
          "score": 2,
          "created_utc": "2026-02-20 18:28:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6gttfi",
              "author": "JunaidRaza648",
              "text": "Educate them first, but after that, the journey is the same:\n\n1. Credibility\n\n2. Branding\n\n3. Persuasion\n\n4. Social proof",
              "score": 2,
              "created_utc": "2026-02-20 18:30:22",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o6hbvwm",
              "author": "lisrelac",
              "text": "yeah thats the missing piece. \"unaware\" usually converts off pain-trigger content + distribution, not brand pages. what channel are you seeing work most for that right now, LinkedIn ads or SEO?",
              "score": 1,
              "created_utc": "2026-02-20 19:54:50",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o6i4k1k",
              "author": "Zealousideal-Job6344",
              "text": "Consistent messaging. At any given point, 80% people you reach out to will not be interested in buying your service right away. What art is to be a top of mind recall when they do. Hence awareness and consistency in messaging matters.",
              "score": 1,
              "created_utc": "2026-02-20 22:17:32",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6jkedo",
          "author": "Sophiaw9",
          "text": "Spot on. B2B sales are all about slow trust-building with content and credibility way before the demo. Great way to explain the hidden buyer journey. Thanks for this!",
          "score": 1,
          "created_utc": "2026-02-21 03:26:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ktd7n",
          "author": "Imaginary-Leg-2546",
          "text": "I'm guessing you're not very good at marketing.....?",
          "score": 1,
          "created_utc": "2026-02-21 09:51:37",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r9uiwk",
      "title": "How do you actually measure b2b lead quality before they hit the sales team?",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1r9uiwk/how_do_you_actually_measure_b2b_lead_quality/",
      "author": "Xev007",
      "created_utc": "2026-02-20 12:51:19",
      "score": 12,
      "num_comments": 28,
      "upvote_ratio": 1.0,
      "text": "The same argument keeps happening internally where marketing says the leads are fine and sales says they're garbage and nobody has a good framework for resolving it. MQL counts look healthy but conversion to opportunity is terrible which could mean the leads are bad or could mean sales isn't working them properly. Building some kind of scoring or qualification layer before handoff would help but everything so far just adds friction without actually improving outcomes. What are other people doing to bridge this gap?  \n",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1r9uiwk/how_do_you_actually_measure_b2b_lead_quality/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o6ewm91",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-20 12:51:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6f66g0",
          "author": "StayAtHomeAstronaut",
          "text": "The leads are weak.\n\nThe leads are weak...? The fucking leads are weak!?\"\n\nNo. You're weak! \n\nIf you cannot close the leads to which you are given, then you can't close shit, YOU ARE SHIT, hit the bricks pal!",
          "score": 10,
          "created_utc": "2026-02-20 13:46:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6eyc30",
          "author": "Dry-Case3175",
          "text": "So at my company we figured this out by reframing the idea about the leads being good to what actual evidence do we have that X person and Y account are in-market right now, and did we follow up correctly:\n\n1. Define lead quality as a small set of measurable pre-sales signals: account fit grade, role relevance, and intent signals tied to specific interests (pricing, integration, implementation, security, product pages). Add a recency layer so a lead that surged this week is treated differently than one that engaged once a month ago.\n2. Make handoff rules explicit: what qualifies for a sales touch, what the response time SLA is, and what dispositions sales must log (bad fit, no need, wrong person, timing). Audit a weekly sample together.\n3. Surface why a lead is prioritized, not just a score.\n\nIf you want tooling, 6Sense, SalesWings, and DemandBase are all worth looking into.",
          "score": 1,
          "created_utc": "2026-02-20 13:02:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6hkhry",
              "author": "liaxampee",
              "text": "yeah this framing is the only one thats ever stopped the sales vs marketing food fight for me. what are you using to track those intent hits, 6sense or just ga4 + hubspot events?",
              "score": 1,
              "created_utc": "2026-02-20 20:37:13",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6fa9xw",
          "author": "Everyd4yAudioGuy",
          "text": "This is super common. The fix is usually agreeing on one shared definition of a good lead, then measuring it with pipeline outcomes, not MQL volume.\n\nThe cleanest framework I’ve seen is tracking lead quality based on what happens after handoff. Things like % that become sales accepted leads, % that become opportunities, and win rate by source. If a channel produces a lot of MQLs but almost no opps, it’s not a lead gen win.\n\nScoring only works if it’s tied to real intent signals. Pricing page visits, demo page views, repeat visits from the same company, ROI tool usage, and job title fit tend to correlate better than downloads.\n\nAlso, add a simple feedback loop. Sales should tag leads with reasons like no budget, wrong persona, not a priority, competitor locked in. After a few weeks, you’ll see patterns and marketing can adjust targeting instead of guessing.\n\nIt’s less about adding friction and more about closing the loop with actual pipeline data. We talk about lead scoring and readiness frameworks on r/LeadGenSEA too if you want more examples",
          "score": 1,
          "created_utc": "2026-02-20 14:08:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6ftv1l",
              "author": "Dapper-Condition6041",
              "text": "\\>>Things like % that become sales accepted leads, % that become opportunities, and win rate by source.\n\nThis is a needless step. There's no need for a \"sales accepted lead.\" \n\nThe definition of an MQL is jointly defined by Sales and Marketing - if it meets the criteria, it is, a priori, a sales accepted lead.\n\nAll that's needed is a simple diqual / reject feedback mechanism from Sales to Marketing for leads that turn out to be not-qualified, to tune the model.",
              "score": 1,
              "created_utc": "2026-02-20 15:46:02",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6fdikl",
          "author": "osiris_rai",
          "text": "Added a verification and enrichment step before anything gets marked as an MQL, basically checking that contact info is valid and company actually fits ICP.",
          "score": 1,
          "created_utc": "2026-02-20 14:25:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6fdogd",
          "author": "Live_Cheetah_3800",
          "text": "Part of the problem might be counting leads that aren't even reachable as qualified, verifying emails through anymail finder before they hit the CRM and filtering out invalid ones helped a lot with the perception problem because sales isn't wasting time on contacts that were never going to connect anyway.",
          "score": 1,
          "created_utc": "2026-02-20 14:26:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6fiu6p",
          "author": "ProfessionIll5518",
          "text": "The framework that works is basically fit plus engagement plus reachability, if any of those three is missing it doesn't pass to sales. Sounds simple but took forever to get alignment on what each one actually means in practice ngl",
          "score": 1,
          "created_utc": "2026-02-20 14:52:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6fqa1c",
          "author": "kubrador",
          "text": "before you build another scoring model nobody will use, find out what your sales team actually closes. backtrack from won deals, what did those leads look like day one? industry, company size, problem they mentioned, how they found you, whatever. that's your real qualification criteria, not what seemed logical in a spreadsheet.\n\nthen you can actually compare: are incoming leads matching that profile or are they systematically different? if they are, marketing's genuinely handing off worse stuff. if they're the same quality, sales might just be bad at working them (or the product doesn't close those kinds of deals, which is a different problem).\n\nthe friction thing is real though. most qualification layers fail because they're too rigid and marketing finds ways around them. if you go",
          "score": 1,
          "created_utc": "2026-02-20 15:29:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6fseve",
          "author": "_forgotmyownname",
          "text": "You need to map fit against intent. Use a data enrichment tool to verify the job title and company size before it even reaches a rep. If it doesn't match your ICP, it's not a lead.\n\n",
          "score": 1,
          "created_utc": "2026-02-20 15:39:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6fsjic",
          "author": "Dapper-Condition6041",
          "text": "Perhaps Lead Scoring and MQLs etc. are b.s. as someone else in this forum suggested, but lead scoring - by fit to ICP (Fit Score) and behavior (Lead Score) are the time-honored practices for measuring lead quality before passing to sales.\n\nPutting aside criticisms, the entire premise was assigning a numerical value to each lead, and setting a threshold in a Sales/Marketing SLA below which Marketing would NOT pass to Sales and above which Marketing WOULD pass to sales. \n\nThat numerical threshold is the MQL - marketing qualified it according to previously agreed standards specifications with Sales as documented in the SLA.\n\nThere needs to be an ongoing feedback loop from Sales to Marketing to provide adjustments to the scoring model to fine tune it.\n\nIt's imperfect, but workable. It sounds like you have a poorly implemented version of this model.",
          "score": 1,
          "created_utc": "2026-02-20 15:39:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6g01hs",
          "author": "Gratefulanddriven",
          "text": "This is about misalignment. Marketing needs to work with sales to agree on ICP, and lead definitions. This needs to be approved by senior management. What are the shared definition of an MQL and SQL. Then marketing is working toward goals that sales have given them. If they’re not working then you all sit down again and iterate. Of closed/won, what aligns with your shared definitions? You should also have some shared KPIs otherwise you’re just fighting with each other. Sales can iterate faster but it takes a while for a marketing demand engine to get going so these need to be established. I’ve worked in marketing and sales.  It’s a failure of both the head of marketing and head of sales to align.",
          "score": 1,
          "created_utc": "2026-02-20 16:14:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6haas7",
          "author": "Hopeful_Account_1370",
          "text": "Look, I've been in the trenches running RevOps for a mid-stage B2B SaaS company (we scaled from $8M to $35M ARR in 3 years), and this exact fight marketing bragging about \"healthy MQL counts\" while sales drowns in garbage happens everywhere. The brutal truth? Your low MQL-to-opportunity conversion screams **bad leads**, not lazy sales (though sales execution can suck too).\n\nThe fix that actually worked for us (and I've replicated the same at 3 other shops):\n\n1. Kill pure MQL handoff. Co-build a **pre-handoff qualification layer** with sales: Use fit (ICP firmographics) + behavioral scoring (e.g., pricing page views, demo requests, multiple touches) + light BANT/MEDDIC via forms or intent data. Threshold: Only hand off at 70+ score or clear intent signal.\n2. Closed-loop feedback: Sales rates every lead 1-5 on quality weekly; marketing sees the data live in CRM. We cut junk by 60% in 4 months, MQL volume dropped 40%, but SQL-to-opp jumped 2.5x.\n3. Measure real lead quality pre-sales: Track **pre-handoff conversion to meeting booked** or **early-stage progression velocity**. Volume KPIs die; revenue attribution lives.\n\nYour post is classic symptom of misaligned incentives marketing chases leads, sales chases pipeline. Stop patting backs on MQLs; they're meaningless without conversion data.\n\nIf conversions suck, leads are bad. Fix the scoring model together, or keep fighting. We did it, pipeline quality soared, and the blame game ended.",
          "score": 1,
          "created_utc": "2026-02-20 19:47:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6hthmi",
          "author": "Hopeful_Account_1370",
          "text": "I've run RevOps at a mid-stage SaaS firm. We had the same finger-pointing war until we killed vanity MQLs. Switched to a pre-handoff layer: combined firmographic + behavioral scoring (e.g., multiple page views, intent data via Bombora-style tools, demo-like actions weighted heavy).\n\nAdded a quick SDR \"pre-qual\" call (5-min BANT/CHAMP check) before full handoff. Result? MQL volume dropped 40%, but MQL-to-opp jumped from \\~9% to 28% in six months. Pipeline velocity doubled, sales stopped hating marketing, and we closed more with fewer dials.\n\nStop the blame game. Align on a real scoring model (not just demographics), measure pre-sales quality via conversion rates + feedback loops, and prioritize intent over volume.",
          "score": 1,
          "created_utc": "2026-02-20 21:21:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6hv8jl",
          "author": "Scared_Yak5572",
          "text": "stop blaming each other, pick a gate and test it, mql counts alone mean nothing. define a short joint acceptance checklist, eg fit signal, intent signal, contactability, require 2 of 3 before handoff. enforce a 48h sla for first outreach and force a rejection reason to be logged, track conversion by source, campaign and owner. run a two week blind audit on a sample of passed leads to see if sales is actually working them, if fail rate stays high tighten scoring or add a 1 call sdr triage. i have used this and it shows fast where the leak actually is.",
          "score": 1,
          "created_utc": "2026-02-20 21:30:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ihkb0",
          "author": "harisenbon",
          "text": "The argument never gets resolved because marketing measures quantity at the top and sales measures quality at the bottom, and nobody owns the middle.\n\nPick one metric both teams agree on (usually \"opportunities created\" or \"pipeline generated\") and measure marketing's contribution to that number, not to MQLs. MQL counts are a vanity metric that lets marketing declare victory before anything actually happened. If 200 MQLs produce 3 opportunities, it doesn't matter that the MQL number looks healthy.",
          "score": 1,
          "created_utc": "2026-02-20 23:28:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6lmywt",
          "author": "murtuza78",
          "text": "The real trick is aligning on what a \"good\" lead actually means for both teams and then tracking what happens to those leads after handoff rather than just pre-handoff signals. Tie quality to sales accepted, opportunities created and actual outcomes instead of MQL volume. Add a feedback loop where sales logs why leads get dropped or progressed so both sides see the reality. This setup beats any scoring system that just adds more hoops for leads to jump through.",
          "score": 1,
          "created_utc": "2026-02-21 13:56:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6f03m9",
          "author": "LeadGenDotCom",
          "text": "Measuring lead quality misses the point. It's like putting lipstick on a pig. The problem is the underlying process, and the lack of accountability (usually by Marketing.) MQL, for example, was a concept invented by the CRM firms and some consultants because they wanted marketing programs to get credit for producing junk. The same with Lead Scoring; it's nonsense. The best solution we know of is Funnel Management. Marketing has to be measured on the accuracy of the Sales Forecast. We have an entire training course on it, but the short answer is that you can only measure lead quality in retrospect. ",
          "score": 1,
          "created_utc": "2026-02-20 13:12:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6f0dht",
              "author": "Radiant-Security-347",
              "text": "but he said nobody has solved this vexing problem",
              "score": 2,
              "created_utc": "2026-02-20 13:14:16",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6f0zqh",
                  "author": "LeadGenDotCom",
                  "text": "He is wrong. It was solved 50 years ago. You just have to use the technique, and stop listening to the noise. I'll give you an example. We do lead generation (among other things) for our clients. And we participate in their sales meetings, with their sales teams. That means we have to listen to them yell at us if we send them out on time-wasters. We have to participate in the creation of the sales forecast. If we (collectively) exceed it, we get to join the celebration. If we miss it (which we usually don't) we get spanked. And as a third party, that spanking can hurt.",
                  "score": 2,
                  "created_utc": "2026-02-20 13:17:56",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o6fshy3",
              "author": "_forgotmyownname",
              "text": "Totally agree with you! ",
              "score": 1,
              "created_utc": "2026-02-20 15:39:35",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o6glrvq",
              "author": "Dapper-Condition6041",
              "text": "I found your website..... but I can't yet find a page that articulates the model you proscribe that makes Lead Scoring and MQL/SQL useless.... could you pls DM me with a URL? thx.",
              "score": 1,
              "created_utc": "2026-02-20 17:54:24",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r6s1qw",
      "title": "Planning on refreshing our 5 year old Wordpress site looking for redesign advice",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1r6s1qw/planning_on_refreshing_our_5_year_old_wordpress/",
      "author": "purpleplatypus44",
      "created_utc": "2026-02-17 01:11:09",
      "score": 12,
      "num_comments": 17,
      "upvote_ratio": 1.0,
      "text": "We built our WordPress site about five years ago and it’s starting to show. The design feels really dated, mobile UX is clunky, and the messaging doesn’t match where our business is now.\n\nWe’re planning a website redesign with a budget under $10k. Not DIY, but not a big agency either. I’m debating whether to stick with WordPress or move to a simpler website builder for easier long-term management.\n\nIf you’ve gone through a redesign recently and had a good experience, I’d love recommendations or lessons learned.",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1r6s1qw/planning_on_refreshing_our_5_year_old_wordpress/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o5scqm7",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-17 01:11:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5sd70z",
          "author": "philbrailey",
          "text": "Yo, with kinda budget under $10k you’re in a decent spot, but I’d first get clear on what this really is. Is it just a visual refresh, or does the structure and messaging need a full rethink? A lot of the time clunky mobile UX and weak copy can be fixed without blowing everything up. But if WordPress feels bloated with plugins and constant maintenance, that’s usually the sign it’s the stack, not just the design.\n\nSome teams stay on WordPress and clean it up with a lighter theme and fewer plugins. Others use the redesign as a reset and move to a more opinionated builder so updates are easier long term. I’ve seen people switch to simpler setups like Durable for that reason, especially when the goal is clean pages, smoother lead flow, and less backend babysitting.",
          "score": 7,
          "created_utc": "2026-02-17 01:13:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5sdeze",
          "author": "ronniealoha",
          "text": "Honestly, before you even touch design, I’d zoom out and ask what’s actually broken. Is it just ugly, or is it not converting? Big diff. I’ve seen companies spend $$$ on a redesign and nothing changes because the messaging was the real issue. Tighten the copy, clarify the offer, simplify the nav. Sometimes that alone feels like a new site without nuking everything.",
          "score": 4,
          "created_utc": "2026-02-17 01:15:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5sdpei",
          "author": "EldarLenk",
          "text": "Sub $10k is solid, but be careful with “cheap but looks good” agencies. Ask to see real live sites they built 2+ years ago. Not Dribbble shots. Real URLs. Do they still load fast? Do they feel modern? If they can’t show long term work, that’s a red flag. A good website redesign is about structure and UX, not just swapping fonts.",
          "score": 3,
          "created_utc": "2026-02-17 01:16:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5sqa8d",
          "author": "f1zombie",
          "text": "Great advice here. I would also consider prototyping structure, content and maybe design with AI to get a better view on what you want. We've started doing this for all our engagements and it makes it very easy to understand what works and doesn't work. It also helps that you can use actual content and data to design.",
          "score": 2,
          "created_utc": "2026-02-17 02:32:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5sdyhb",
          "author": "pumpkinpie4224",
          "text": "If WordPress hasn’t been a nightmare for you, you might not need to leave it. A lighter theme, fewer plugins, and a cleaner layout can go a long way. But if you’re constantly fighting updates, security, and random plugin drama, that’s energy you could spend elsewhere. Some teams switch to more opinionated builders just to reduce maintenance stress and move faster",
          "score": 1,
          "created_utc": "2026-02-17 01:18:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5se38g",
          "author": "Diamond_handzz_420",
          "text": "with the ai coding tools out now.. vibe code the new website",
          "score": 1,
          "created_utc": "2026-02-17 01:19:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5sjzuh",
          "author": "No-Belt7254",
          "text": "Depends a lot on the type of product, but a good sight is built on knowing exactly why customers and prospects come to your site.",
          "score": 1,
          "created_utc": "2026-02-17 01:54:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5tmf4j",
          "author": "algatesda",
          "text": "Yes 5 years old Wordpress needs really upgrade .Always keep updating your website every 2 years to have updated UI and UX to attract your right audience .$10K is pretty much decent to revamp your website in latest web technologies \n\nIf you are into B2B then website is your first touch point in your buyers journey .\nJava or Bootstrap gives you premium and liquid flow of pages for better experience",
          "score": 1,
          "created_utc": "2026-02-17 06:15:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5u7gzh",
          "author": "SatisfactionBig7126",
          "text": "Since you want to avoid big agencies but stay under $10k, check out StudioT. They are solid for performance driven design and UX audits which would fix that mobile clunkiness. They can also help you decide if you should stick with WordPress or jump to a new builder while keeping the messaging on point.",
          "score": 1,
          "created_utc": "2026-02-17 09:30:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ut4ra",
          "author": "RandyCanuck",
          "text": "I would change the messaging including images. first and measure the conversions.  That will guide you in the direction u need to go",
          "score": 1,
          "created_utc": "2026-02-17 12:33:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5y0twr",
          "author": "just_a_freak_teen",
          "text": "Web developer, and I’ve worked with many clients who asked for the exact same thing. However, after delivering the redesign, they often complain that it didn’t bring them more business. Since you’re planning a redesign, it’s important to keep in mind that design alone usually won’t create a huge impact on lead generation. You also need to tighten the copy, improve the page structure, and add strong CTAs that direct users to forms that aren’t too long.",
          "score": 1,
          "created_utc": "2026-02-17 22:09:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ze92g",
          "author": "Rounak147",
          "text": "Hey.. what line of business are you in? Do you sell online (eCommerce) or are you a service business looking for lead gen?\n\nLike what exactly is the purpose of the website?\n\nIs it to generate leads, or sales, or is it just a vanity piece? You need to define that clearly. If it's just a vanity item, focus more on the design and transitions and creative styling than anything else. However, rarely do businesses ever want a website just for aesthetics. \n\nAlso, do you run paid ads? Because if yes, you're going to need to think about conversion much more than anything else. \n\nSo my guess is that it is a little bit of both for you - lead gen/sales + aesthetic. In this case, before jumping into aesthetics, just visualize your ideal client's funnel. How do they find you, what do they wnat to know about you once they find you, and what are the key decision making factors that enable purchase or conversion? Once you know all of this - then build out the website. \n\nI run a performance marketing agency and our proecss for this is similar. We send out a questionnaire that gets this info out of you, then we jump to wire framing - which helps you visualize your funnel, then we jump to the actual branding and designing of the website.  Happy to answer any follow-up questions. \n\n  \nAs for the platform, it really doesn't matter THAT much. If you want you can stick to wordpress and just built a better looking and converting website. \n\nAlso, FYI, for a 10K budget, we could build you a great website that's both aesthetic and high-converting. Canadian mid-size agency. Feel free to DM.",
          "score": 1,
          "created_utc": "2026-02-18 02:33:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6djkm2",
          "author": "KissyyyDoll",
          "text": "Stick with WordPress since you already know the backend. Move to a lightweight theme or a modern builder like Bricks or Breakdance to fix the speed issues. Five years is a long time in tech so a clean install is probably better than patching the old one. Under 10k is doable for a solid freelancer.",
          "score": 1,
          "created_utc": "2026-02-20 05:48:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6fe6ey",
          "author": "Top-Buy-4207",
          "text": "u/purpleplatypus44 sent dm, please check!",
          "score": 1,
          "created_utc": "2026-02-20 14:29:01",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r5v8n5",
      "title": "What’s the right way to track brand accuracy in AI search?",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1r5v8n5/whats_the_right_way_to_track_brand_accuracy_in_ai/",
      "author": "alizastevens",
      "created_utc": "2026-02-16 00:45:13",
      "score": 11,
      "num_comments": 24,
      "upvote_ratio": 1.0,
      "text": "We’ve been testing a bunch of prompts about our company across AI tools.\n\nSome responses nailed it but ohers were half-right in a way that feels worse than fully wrong. \n\nIs anyone actually tracking this? Are you all auditing this somehow\n\n",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1r5v8n5/whats_the_right_way_to_track_brand_accuracy_in_ai/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o5lqfss",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-16 00:45:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5lqmra",
          "author": "albrasel24",
          "text": "We found out by accident. Someone was doing an internal demo and asked ChatGPT about us and it kept pulling from this TechCrunch article from 2021.\n\nWe'd completely rebranded since then but that one piece was apparently glued into the training data somehow. Worst part was we had no clue how widespread it was.\n\nStarted using Meridian just to figure out the actual scope of it and it was worse than we thought. Showing up across a bunch of query types not just direct brand searches.\n\nWe did a content push to basically drown out the old stuff with more recent mentions and tracked it over a few months. It moved the needle but slowly.\n\nIt didn't fix it magically or anything but it turned our vague concern into an actual project with data behind it.\n\n",
          "score": 8,
          "created_utc": "2026-02-16 00:46:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5lqpfy",
          "author": "goarticles002",
          "text": "We started doing this manually about 6 months ago. Built a spreadsheet with 40 core prompts about our company across ChatGPT, Perplexity, Claude and Gemini. Run them weekly, log the responses verbatim, then score them against a \"brand truth\" document we wrote internally. It's tedious but it showed us patterns we never would have caught otherwise. The half-right problem you mentioned is real and honestly harder to deal with than fully wrong answers because it's harder to flag internally.",
          "score": 1,
          "created_utc": "2026-02-16 00:46:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5m0itj",
              "author": "Ok_Face_2942",
              "text": "Are you also running these prompts on a certain number of accounts internally? Are you also modifying the core prompt slightly for close variants? Super curious!",
              "score": 1,
              "created_utc": "2026-02-16 01:48:51",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5lqrsl",
          "author": "pouldycheed",
          "text": "The half-right thing is actually what makes this so hard to prioritize internally. If AI says something completely wrong it's easy to escalate. But if it says something that's like 70% accurate with the wrong framing or outdated positioning, stakeholders kind of shrug. I've been trying to frame it as a reputation risk issue rather than a search issue and that seems to get more traction in meetings.",
          "score": 1,
          "created_utc": "2026-02-16 00:47:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5lsi66",
          "author": "gptbuilder_marc",
          "text": "The tricky part isn’t when it’s fully wrong.\n\nIt’s when it’s half right. That’s what quietly reshapes perception.\n\nAre you dealing with straight factual errors, subtle positioning shifts, or just outdated info getting resurfaced? Those point to very different root causes.",
          "score": 1,
          "created_utc": "2026-02-16 00:57:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5n33xz",
              "author": "United_Parking_1683",
              "text": "The half right issue is usually a narrative problem, not just a prompt problem. We think about it in 3 layers   \nWhat the AI says  \nWhat sources it pulls from  \nWhat public conversations are shaping those sources  \nMost teams only measure 1.",
              "score": 1,
              "created_utc": "2026-02-16 06:24:08",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5v3sdz",
                  "author": "gptbuilder_marc",
                  "text": "Yeah, that third layer is where it gets weird.\n\nIf the stuff out there about you is fuzzy, the model just blends it all together. You can tweak prompts forever and it’ll still average the same messy inputs.\n\nThe fix usually isn’t arguing with outputs. It’s cleaning up how your brand is described in the places that keep getting cited. If the same two or three sources show up over and over, that’s probably where the ambiguity lives.",
                  "score": 1,
                  "created_utc": "2026-02-17 13:38:54",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5mygbr",
          "author": "Old-Environment8760",
          "text": "Just made the post on how fix that to some extent:\n\nhttps://www.reddit.com/r/b2bmarketing/s/cuaNIdYkaU\n\nOverall for commercial prompts tracking we use nobori.ai, built for B2B specifically. Probably you haven't heard about it.",
          "score": 1,
          "created_utc": "2026-02-16 05:45:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5mzuav",
          "author": "luminouscascade78",
          "text": "Yeah, I’ve been in the same boat. I’ve been using Searchtides to track how our brand shows up across different AI tools, and it’s been really helpful. Since I started using them, I’ve been able to quickly spot issues and fix misleading info before it spreads, and it’s saved me a lot of time and stress",
          "score": 1,
          "created_utc": "2026-02-16 05:56:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5n34nu",
          "author": "supriya_l89",
          "text": "The most practical method for tracking this condition requires the implementation of SEO monitoring systems. The testing procedure should involve a fixed prompt set which includes brand and product and competitors and use cases. The scoring system will evaluate responses based on three criteria:  \n  \nFactual accuracy  \n  \nCompleteness  \n  \nBrand positioning alignment  \n  \nRisk level (misleading vs harmless)  \n  \nThe system requires documentation of all patterns which occur in the process rather than recording solely the events which occur once.   \n  \nB2B companies which have a larger size should include their communications and legal teams whenever critical business claims require verification. The models require validation of their source materials because outdated content and third-party sites represent common sources of content.   \n  \nThe existing process requires improvement because the current system needs both preliminary audits and assessment methods.",
          "score": 1,
          "created_utc": "2026-02-16 06:24:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ncs2y",
          "author": "Slight_Tutor1790",
          "text": "We started treating this less like a search problem and more like a messaging drift problem. Instead of only scoring accuracy, we track how often the core story shows up correctly across different query types. Not just who we are, but what problem we solve and for who.\n\nWhat helped was mapping prompts to stages of the buyer journey and seeing where the narrative shifts. Sometimes AI is accurate on facts but wrong on positioning during comparison or use case queries. That usually points to gaps in public content rather than model behavior.",
          "score": 1,
          "created_utc": "2026-02-16 07:51:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5nj5hy",
          "author": "Difficult_Buffalo544",
          "text": "I've been down this rabbit hole too. The problem is that most models just hallucinate your brand's logic when they don't have a clear anchor. Auditing is basically impossible if you're just throwing random prompts at the wall.\n\nYou really need a dedicated logic layer that forces the AI to stick to your specific style and vocabulary rules. We've been using Atom Writer for our content because it has this Brand Anchor tech that actually keeps things on track. It's way more reliable than standard tools because it won't just make things up to fill the gaps. Are you seeing these inaccuracies mostly in the tone or the actual facts about your product?",
          "score": 1,
          "created_utc": "2026-02-16 08:51:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5nqc9f",
          "author": "ConfidentElevator239",
          "text": "yeah the half-right thing is actually way more dangerous because it sounds credible enough that people don't question it. We've been seeing more companies start to audit this systematically instead of just spot-checking when they remeber to. Few ways people are handling it: you could build your own tracking system if you have eng resources (time intensive but totally customizable), Brandlight is what I've seen people using for enterprise monitoring since it tracks mentions across different AI tools and flags when something's off, or you could hire an agency to do manual audits monthly (expensive but hands-off).\n\nReally depends on whether you want ongoing alerts or periodic snapshots. The half-accurate stuff is tricky to catch without some kind of regular system though.",
          "score": 1,
          "created_utc": "2026-02-16 10:00:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5nz66e",
          "author": "AleksandrMovchan",
          "text": "Totally get the frustration. We treat this like SEO but for LLMs (some call it GEO). The issue usually isnt your site, its the conflicting info elsewhere that confuses the model.\n\nHere is the quick fix checklist we use to force accuracy:\n\n\\- Consistency is king. Ensure your short company bio is identical on LinkedIn, Crunchbase, and your footer. If they differ, the AI tries to combine them and hallucinates.\n\n\\- Structured Data. If you dont have Organization Schema setup with the sameAs property linking your social profiles, the AI barely knows you exist as a distinct entity.\n\n\\- The About Page. Rewrite it for a 5th grader. No buzzwords. Just say: We do X for Y price. LLMs struggle to parse marketing fluff.\n\n\\-Third party weight. AI trusts G2, Trustpilot, and Reddit threads more than your own blog. If those are outdated, the AI output will be too.\n\nWe just audit it manually once a month with prompts like \"What does Company actually do?\" to see if the changes stick.",
          "score": 1,
          "created_utc": "2026-02-16 11:20:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5p310z",
          "author": "Guruthien",
          "text": "The half-right responses are brutal because they're harder to catch and fix. You need systematic tracking across all the major LLMs, not just spot checks. We've been using limyai to monitor which prompts trigger mentions of our brand and track accuracy over time. It is better than manual spreadsheets and shows us the actual scope. What's your current process for catching these issues?",
          "score": 1,
          "created_utc": "2026-02-16 15:26:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5pa5xs",
          "author": "hollee-o",
          "text": "No one’s mentioning context personalization. Particularly if you’re using the same account to retest your queries repeatedly.",
          "score": 1,
          "created_utc": "2026-02-16 16:00:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5qxsrm",
          "author": "LocalBizAI",
          "text": "You need to track this systematically across all the major AI tools since those half-right responses will confuse potential customers more than complete unknowns. Set up regular audits with the same prompt sets and track which platforms consistently get your info wrong.",
          "score": 1,
          "created_utc": "2026-02-16 20:40:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5uxzj8",
          "author": "Odd-Home3418",
          "text": "Bing Webmaster - Now Businesses can find for which user queries, their site or answers being cited.",
          "score": 1,
          "created_utc": "2026-02-17 13:04:51",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r5erd3",
      "title": "Anyone here actually using TikTok for B2B?",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1r5erd3/anyone_here_actually_using_tiktok_for_b2b/",
      "author": "catchinghappy",
      "created_utc": "2026-02-15 13:34:10",
      "score": 11,
      "num_comments": 32,
      "upvote_ratio": 1.0,
      "text": "I work in B2B marketing and and have been hearing some chatter about TikTok being “the next channel” for B2B.\n\nGenuinely curious what people here are actually doing in practice:\n\n\\- Are you using TikTok at all for B2B?\n\n\\- Organic, paid, or both?\n\n\\- What kind of businesses (SaaS, services, industrial, healthcare, etc.)?\n\n\\- Is it just awareness, or have you seen real leads / pipeline?\n\nWould love to hear honest takes. ",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1r5erd3/anyone_here_actually_using_tiktok_for_b2b/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o5i6cg0",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-15 13:34:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ib3sd",
          "author": "Still-Lengthiness180",
          "text": "tiktok wont even come close to youtube and instagram\n\nnot for online businesses\n\neven hormozi says that his b2b consultancy program gets almost 0 leads from tiktok\n\n",
          "score": 2,
          "created_utc": "2026-02-15 14:03:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5j2b0y",
              "author": "Royal_Machine_9524",
              "text": "Ohh really ",
              "score": 2,
              "created_utc": "2026-02-15 16:25:33",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o5ihugd",
              "author": "catchinghappy",
              "text": "oooh. do you recall what video this was? curious how insta vs tiktok differs",
              "score": 1,
              "created_utc": "2026-02-15 14:42:07",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5ijbl9",
                  "author": "Still-Lengthiness180",
                  "text": "i guess if you search \"hormozi best content platforms\" you'd find something",
                  "score": 0,
                  "created_utc": "2026-02-15 14:50:06",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5jaiwb",
          "author": "AffableSparsh",
          "text": "I am planning to start my work on TikTok within next 2 months. Havent used it lately.\n\nAny quick grower tips are welcomed",
          "score": 2,
          "created_utc": "2026-02-15 17:05:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5jrv81",
              "author": "Zealousideal-Job6344",
              "text": "Not tik tok but I tried Instagram and it was not at all helpful. It took too much time to create and the ROi was next to zero",
              "score": 1,
              "created_utc": "2026-02-15 18:29:41",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5jskg5",
                  "author": "AffableSparsh",
                  "text": "For D2C, IG is creampie.\n\nBut if you're targeting B2B B2C SaaS, maximize on Reddit. I dont kbow about others, we literraly survived the fall because of Reddit. 20-30 organic leads just of Reddit",
                  "score": 1,
                  "created_utc": "2026-02-15 18:33:05",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5istek",
          "author": "appu49",
          "text": "I know a person who onows person that's been telling a person how cool is tiktok for B2B, its whole new audience that we can tap into and get some fresh leads and that person has never done it himself when ask about.\nSo my take is it wont work. The decision makers are not on tiktok, mainly for SaaS, but may be there is few genz and boomer audience for b2c but not much for b2b.",
          "score": 1,
          "created_utc": "2026-02-15 15:39:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5j1v16",
          "author": "No_Boysenberry_6827",
          "text": "honest take from someone in B2B SaaS: tiktok drove awareness but the conversion path is brutal. what actually moved pipeline for us was automated outbound that adapts based on how prospects respond. the system learns which messaging converts for each segment and just keeps getting better. way higher ROI per dollar than any social channel. are you seeing actual pipeline from tiktok or mostly top of funnel?",
          "score": 1,
          "created_utc": "2026-02-15 16:23:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5j9t11",
              "author": "Pale-Web3080",
              "text": "Which platform did you use the most?",
              "score": 1,
              "created_utc": "2026-02-15 17:01:34",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5jbomq",
                  "author": "No_Boysenberry_6827",
                  "text": "email was the biggest driver but it only worked once we stopped doing generic blasts. the system we use now researches each prospect and writes personalized outreach based on their actual situation. completely different from the spray and pray approach. are you running outbound currently or mostly relying on inbound from content?",
                  "score": 1,
                  "created_utc": "2026-02-15 17:10:45",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5jfoop",
          "author": "Tiny-Clue-136",
          "text": "It was such a pain to setup, get verified, etc. that we got turned off before really starting",
          "score": 1,
          "created_utc": "2026-02-15 17:30:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5jsnok",
          "author": "Responsible-Brick881",
          "text": "Yeah from what I've heard from various clients that have tried tiktok its not really a runner for them.\n\nThats not to say it doesn't work for every b2b though - I'm sure there's some sort of niche that it could work for.\n\nWhat sort of product have you got and what channels are you using for paid?",
          "score": 1,
          "created_utc": "2026-02-15 18:33:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5jzprq",
          "author": "igorfortalezan8n",
          "text": "TikTok is terrible even for B2C, let alone B2B.",
          "score": 1,
          "created_utc": "2026-02-15 19:07:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5k0xc5",
          "author": "racy_quill",
          "text": "I tried it for about 7 months, I think it’s great for building a following and even getting clear on your niche because day to day application in business and translating to short form are two completely different things. \n\nI think I had a lot of great traction there, but I can can’t say that translated to leads.",
          "score": 1,
          "created_utc": "2026-02-15 19:13:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5kj5c9",
          "author": "canalcityrunner",
          "text": "Launching TikTok for personal branding - I’m agency side. One month in… the grind continues",
          "score": 1,
          "created_utc": "2026-02-15 20:46:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5kjriu",
          "author": "Wise-Trouble-653",
          "text": "The real question isn’t whether TikTok works for B2B. It’s whether your buyers spend time there in a mindset that supports buying.\n\nA lot of the “next channel” talk is really about cheap reach, not qualified demand. Awareness is easy to generate; intent is harder.\n\nIn practice, most B2B wins I’ve seen are founder-led, insight-heavy content driving top-of-funnel attention, then retargeting elsewhere. Pipeline rarely closes natively on-platform.\n\nThe companies seeing traction tend to be SaaS or agencies with a clear POV, not industrial firms chasing trends.\n\nAre you trying to open new conversations, or accelerate deals already in motion?",
          "score": 1,
          "created_utc": "2026-02-15 20:49:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5mgsex",
          "author": "CerealKiller5609",
          "text": "From what I’ve seen, it works better for positioning and authority than direct conversions.",
          "score": 1,
          "created_utc": "2026-02-16 03:34:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ngw95",
          "author": "svlease0h1",
          "text": "people are testing tiktok for b2b but results depend on audience behavior. short product clips and founder stories seem to work better than polished ads. one saas team posted weekly demos for two months and got a few real inbound messages. awareness grows faster than pipeline here.",
          "score": 1,
          "created_utc": "2026-02-16 08:30:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5nhcw9",
              "author": "catchinghappy",
              "text": "do ya have the account of the saas team?",
              "score": 1,
              "created_utc": "2026-02-16 08:34:48",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5nitk4",
                  "author": "svlease0h1",
                  "text": "yeah, i have",
                  "score": 1,
                  "created_utc": "2026-02-16 08:48:39",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5nwf6b",
          "author": "Corgi-Ancient",
          "text": "I’ve seen some B2B folks use TikTok mostly for brand awareness and to humanize their SaaS or service companies. Paid ads can work but it’s still tricky to get solid leads directly from TikTok unless your content really clicks. ",
          "score": 1,
          "created_utc": "2026-02-16 10:56:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5idkd4",
          "author": "Equivalent-Salt4475",
          "text": "Not yet, but the b2c channels for b2b ads is real right now!  We're using Vector to target specific contacts on reddit, X, Meta...seeing great results because they show us who's clicking and not converting too. ",
          "score": 0,
          "created_utc": "2026-02-15 14:17:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5ihxmw",
              "author": "catchinghappy",
              "text": "do you mind if I send you a message to learn more about how you’re running ads? thanks so much in advance!",
              "score": 1,
              "created_utc": "2026-02-15 14:42:36",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5ke9ma",
                  "author": "Equivalent-Salt4475",
                  "text": "sure thing",
                  "score": 1,
                  "created_utc": "2026-02-15 20:21:21",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1r6b2rw",
      "title": "Got 2x more quality replies by tightening my lead lists, not by writing better copy",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1r6b2rw/got_2x_more_quality_replies_by_tightening_my_lead/",
      "author": "Remote_Knowledge_398",
      "created_utc": "2026-02-16 14:29:25",
      "score": 8,
      "num_comments": 16,
      "upvote_ratio": 1.0,
      "text": "A few months ago I sent 200 emails to \"ecommerce brands in Miami.\" Got 3 replies. Last month I sent 50 emails to \"Shopify apparel shops in Miami with active Instagram.\" Got 19 replies. Thats when i realized most local lead gen fails before the first email is even sent, usually because the list is too broad. When you target \"local businesses\" or \"ecommerce brands,\" you’re forced to guess the pain points and guess the relevance. You end up writing \"personalization” that doesn't actually mean anything to the prospect.\n\n**Tightening the denominator:** I didnt write better emails, I made my lists so narrow that the offer became obvious.\n\nInstead of \"Ecommerce brands in Miami\" I started building lists like “Apparel shops in Miami” that\n\n* Were using Shopify or WooCommerce\n* With an active Instagram presence\n\nOnce the list is that specific, you aren't selling services, you’re continuing a conversation they’re already having.\n\n* The offer becomes a logical fit.\n* The language matches how they actually talk.\n* Personalization stops feeling like a tactic and starts feeling like actual research\n\n**Reading reviews** **:** Once I had a tight, narrow list, I read some reviews for more context-\n\n* Staff names: Mentioning \"I saw Joey gets a lot of love for same-day installs\" hits 10 times harder when your offer is actually relevant to them.\n* Customer Wins: What do people actually praise? Speed? Trust? Reliability?\n\n**Reducing reply friction :** I also stopped asking for 15 minute calls (high friction). If the list is high-quality, the reply should be low effort.\n\n* \"Worth a quick look? A) Yes B) Not a fit C) Ask me in a month.\"\n* Rule of thumb: If it takes more than 5 seconds to decide how to reply, they won't.\n\nYou can do all of this manually, personally I got tired of the research taking 10-12 minutes per lead, so I built a tool to automate this, run a search like “Apparel Shops in Miami, using Shopify or WooCommerce, with Instagram presence” and then:\n\n* Builds tightly filtered local leads lists ( with emails, socials, tech stack).\n* Firmographics and all other details.\n* Gives you decision makers mentioned, their bios, standout staff, review insights, etc.\n* Gives you context based personalization snippets and outreach hints, so you can focus on offer and CTA.\n\nThe goal isn’t \"AI written spam.\" It's about automating the manual research step so you can actually scale a narrow ICP.\n\nI’m running a beta for this, currently have 2 agencies and 3 others testing it out in beta and using the tool’s data in real outreach, if this seems useful to you, please DM. Feel free to ask questions.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1r6b2rw/got_2x_more_quality_replies_by_tightening_my_lead/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o5orxa1",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-16 14:29:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5oux5u",
          "author": "Mularkeyy",
          "text": "This is 100% true. List quality is the real lever, not endlessly rewriting subject lines.\n\nOnce you narrow the ICP enough, the pain points basically write themselves and personalization stops feeling forced. The Shopify plus active IG filter is a great example because it signals they’re already trying to grow.\n\nAlso love the low-friction CTA. If replying takes effort, people just won’t.\n\nIf your tool can genuinely automate that research without spitting out generic AI fluff, that’s actually useful. We talk a lot about tight ICP building and local lead gen like this on r/LeadGenSEA too if anyone wants more insights.",
          "score": 2,
          "created_utc": "2026-02-16 14:45:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5ov5zr",
              "author": "Remote_Knowledge_398",
              "text": "Thanks, would love to check out the subreddit as well.",
              "score": 1,
              "created_utc": "2026-02-16 14:46:35",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o5p1kfn",
              "author": "Guruthien",
              "text": "i also agree with these insights and will check the sub ",
              "score": 1,
              "created_utc": "2026-02-16 15:19:21",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o5q48ej",
              "author": "Alternative-Bit7867",
              "text": "same I'll check the sub",
              "score": 1,
              "created_utc": "2026-02-16 18:19:31",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o5vs68u",
              "author": "Left-Instruction9074",
              "text": "exactly this. when you're targeting shopify stores specifically, cart abandonment is basically a guaranteed pain point. buddy of mine pitches sms recovery to shopify brands and his open rate on cold emails is wild because the problem is so universal. mentions txtcart results in his outreach and it resonates immediately because every store owner has felt that pain. ",
              "score": 1,
              "created_utc": "2026-02-17 15:45:45",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5pczzw",
          "author": "Finners_GrowthStrat",
          "text": "Question, did you send the same message you sent to the 200? If you tailored it to the 50 then I'd argue 'it's a bit of both' right? But that's just me fence sitting in the great 'list' vs 'copy' debate...\n\nHaha, I'm more a 'what's your proposition or offer' kinda guy. Which brings ICP targeting, product, pricing, messaging, etc all together, you can't really just change one aspect and expect it suddenly to work or not work.\n\nAs you've found tailoring so the message resonates is absolutely key.",
          "score": 1,
          "created_utc": "2026-02-16 16:13:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5pe4ta",
              "author": "Remote_Knowledge_398",
              "text": "Yeah copy changed for the tighter list, it's just that once a list is narrow it's easier to talk the language of that ICP, so offer becomes a logical fit. It's a bit of both list and copy as you said.",
              "score": 1,
              "created_utc": "2026-02-16 16:18:46",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5po8ir",
          "author": "AmphibianNo9959",
          "text": "I've been using Leadmatically to automate the Reddit research side of this finding those hyper-specific conversations where my service actually fits. It reduces a lot of time from manual searches.",
          "score": 1,
          "created_utc": "2026-02-16 17:05:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5qwn63",
          "author": "LocalBizAI",
          "text": "You've cracked the main issue - most people waste time perfecting copy when the real problem is list quality. Set up a systematic process to pull that business context automatically so you can focus on the actual outreach instead of spending 10+ minutes researching each lead.",
          "score": 1,
          "created_utc": "2026-02-16 20:34:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5qz566",
          "author": "Tiny-Celery4942",
          "text": "spot on, tight lists beat clever copy every time. when the target is specific the offer reads itself, personalization actually matters, and low friction replies are everything. reading reviews and calling out staff names is high leverage. i just use Depost AI for linkedin workflows tbh, and i have a short playbook i can share if anyone wants it.",
          "score": 1,
          "created_utc": "2026-02-16 20:47:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5sko98",
          "author": "SignificanceBusy2136",
          "text": "That sounds awesome. Super dialed breakdown. Narrow ICPs can almost always outperform broad buckets. Most outreach problems come from weak list foundations, not weak messaging. Starting with cleaner, more structured datasets before layering on the custom filters is helpful. Some use broad data providers like Techsalerator since their business and decision maker data is already cleansed and segmented by industry, size, and location, which makes it easier to build those hyper targeted “Shopify apparel shops in Miami” style lists without doing everything manually. The combo of tight targeting, real context, and low friction CTAs is the real unlock here.  \nPlus AI written spam is def something to be avoided here, lord knows there is enough out there at this point.   \nGood work. ",
          "score": 1,
          "created_utc": "2026-02-17 01:58:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5xcgts",
          "author": "Wise-Trouble-653",
          "text": "Better results didn’t come from better emails. They came from tighter targeting. Broad lists force generic messaging while narrow lists make the offer obvious and relevant. I read reviews to find real language and that helps me lower reply friction. Fix the denominator first, then scale.",
          "score": 1,
          "created_utc": "2026-02-17 20:14:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o60o2uv",
          "author": "New_Grape7181",
          "text": "I've seen this play out the same way. Narrower lists feel scary at first because the volume looks tiny, but the reply quality jumps so much that it's worth it.  \n  \nOne thing I'd add is to layer in timing signals when you can. Like if you're targeting Shopify apparel shops, checking which ones just launched a new collection or posted about a stockout issue gives you a much stronger reason to reach out. The narrow ICP gets you in the door, but the trigger event makes the timing feel less random.  \n  \nFor the review mining part, I used to do this manually too and it's proper tedious. Sounds like your tool could save a lot of time there. The staff name callout trick is underrated, feels really different when someone mentions something specific vs just \"I saw your great reviews.\"  \n  \nWhat's been the biggest difference in reply quality between your 200-email approach and the 50-email approach, beyond just the numbers?",
          "score": 1,
          "created_utc": "2026-02-18 08:06:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o61kggs",
          "author": "Abhi_deep",
          "text": "100 percent agree on the power of tight lists. When you know exactly who you're talking to, the relevance does half the heavy lifting and suddenly all that “personalization” is just common sense. Most folks would save way more time narrowing the ICP than obsessing over small tweaks to the email copy anyway. Streamlining the boring context research is really what unlocks actual scale without turning into spammy nonsense.",
          "score": 1,
          "created_utc": "2026-02-18 12:39:55",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rakxl1",
      "title": "AI headshots for 10-person B2B team?",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1rakxl1/ai_headshots_for_10person_b2b_team/",
      "author": "patata-chip",
      "created_utc": "2026-02-21 07:28:04",
      "score": 8,
      "num_comments": 8,
      "upvote_ratio": 0.62,
      "text": "Looking for affordable headshots for our B2B team page. We need professional headshots for 10 people (sales, marketing, executives) but the headshot photographer quotes near me are $250-400 per person which adds up to $3,000+ total.\n\nThat's a huge chunk of our marketing budget. I've been researching cheaper alternatives and keep seeing AI headshot generators mentioned. Has anyone here used AI headshots for B2B company websites or should I keep looking for a more affordable headshot photographer ?\n\nSomeone mentioned they tried **Looktara** for their team's professional headshots and spent under $300 total instead of thousands, but I'm worried about quality and whether it looks unprofessional for B2B.\n\nFor B2B marketers - what's your recommendation? Find a cheap headshot photographer, use an AI headshot generator, or just pay the premium for traditional photography? Looking for suggestions on best options for professional headshots on a tight budget.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1rakxl1/ai_headshots_for_10person_b2b_team/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o6ketc1",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-21 07:28:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6kf4m4",
          "author": "athousand_miles",
          "text": "we’ve never seen headshots move conversion in B2B.",
          "score": 5,
          "created_utc": "2026-02-21 07:31:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6lpqx2",
          "author": "lemadfab",
          "text": "Second time I see that ad… Geebus.",
          "score": 2,
          "created_utc": "2026-02-21 14:13:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6kfh35",
          "author": "Utakata11",
          "text": "we used AI headshots for our team page last year because coordinating 10 people for a shoot was a nightmare.\nkept 1 solid photo per person, deleted the rest. no prospects ever commented, metrics didn’t change.",
          "score": 1,
          "created_utc": "2026-02-21 07:34:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6kg7m3",
          "author": "makingsalescoolagain",
          "text": "Ask your team members to submit 3 closeup selfie/photos each. Throw it in an image generation model and ask it to generate professional headshots keeping the character consistent (VEO-3/Nanaobana are the best suited). Would take 30 mins to generate headshots for a team of 10, literally no one would say it is AI.\n\nFeel free to Dm for the prompt or sample headshots",
          "score": 1,
          "created_utc": "2026-02-21 07:41:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6lv9rh",
          "author": "Tampa89",
          "text": "Spam slop post!",
          "score": 1,
          "created_utc": "2026-02-21 14:45:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6mlafh",
          "author": "StayAtHomeAstronaut",
          "text": "Not even subtly pushing your shitty apps anymore",
          "score": 1,
          "created_utc": "2026-02-21 16:59:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6kfunw",
          "author": "After_Diamond2098",
          "text": "a startup i advised used Looktara for their team page to save budget.",
          "score": -1,
          "created_utc": "2026-02-21 07:38:08",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r8ae3y",
      "title": "Is it just me who wants my entire business running from my own custom platform?",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1r8ae3y/is_it_just_me_who_wants_my_entire_business/",
      "author": "harrison_W_stevens",
      "created_utc": "2026-02-18 18:05:16",
      "score": 7,
      "num_comments": 10,
      "upvote_ratio": 0.82,
      "text": "Maybe this is just me, but I’ve started valuing having everything run inside one unified environment.\n\nNot stitched together.Not synced across five platforms. Actually unified. Not just because everything runs smoother although it does, but because it changes how you operate. Decisions are faster. Nothing hides in another tab. You’re not second guessing where something lives or whether it’s up to date. Not only that, but I own my infrastructure, I have control / customisation, and I’m not adapting to a tool which wasn’t meant to adapt to how I operate.\n\nI know the common approach is “best tool for each function,” but at some point that turns into constant switching and invisible friction. Think about the time wasted.\n\nAm I overcorrecting here, or are more people starting to see consolidation as the real upgrade?",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1r8ae3y/is_it_just_me_who_wants_my_entire_business/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o63eyxt",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-18 18:05:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o64h0zx",
          "author": "erickrealz",
          "text": "You're overcorrecting. Building a custom platform to replace proven tools sounds like control but it's actually just creating a full-time job maintaining software instead of running your business.\n\nEvery founder who goes down this path underestimates maintenance. Stripe updates their API, you have to update. Email deliverability changes, you have to fix it. CRM needs a new feature, you have to build it. Meanwhile Salesforce has 500 engineers handling that for you.\n\nThe \"invisible friction\" of switching tabs costs way less than the very visible friction of debugging your custom platform at midnight when something breaks before a client meeting. Use 2-3 best-in-class tools connected with Zapier and spend your time on revenue, not playing damn software engineer for your own business.",
          "score": 3,
          "created_utc": "2026-02-18 20:58:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o64p9ff",
              "author": "NotSoShyAlbatross",
              "text": "For reals, Stripe changed their API right after I bid a custom payment portal. I had to eat all that time brushing up on new protocols.\n\nThere are a lot of times you don’t even need Zapier. Tons of tools have webhooks and endpoints built in. It’s great if you don’t want another $59 sub (needed for multi-step zaps) and yet another thing to have to check on.",
              "score": 1,
              "created_utc": "2026-02-18 21:36:28",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o65o825",
          "author": "Dapper-Condition6041",
          "text": "Yes. I think you should focus on developing your own marketing platform rather than your product.",
          "score": 2,
          "created_utc": "2026-02-19 00:34:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o63limj",
          "author": "martinjsalgado",
          "text": "I’ve had the same thought but there are so many moving parts that actually working on building it was a full time job in itself. Following to see if anyone has an answer to this.",
          "score": 1,
          "created_utc": "2026-02-18 18:33:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o64glr4",
          "author": "NotSoShyAlbatross",
          "text": "I like people like you. I actually build the systems, but I’ve been able to help people take what they have and connect it better. You don’t always need another tool or to burn it all down and start with over.\n\nFeel free to DM me your “stack”, I might have some free insight that can save you some time.",
          "score": 1,
          "created_utc": "2026-02-18 20:56:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o67otag",
          "author": "AmeliaUnlikely",
          "text": "Yeah, have you looked at Odoo?",
          "score": 1,
          "created_utc": "2026-02-19 09:11:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o67szg2",
          "author": "Soft_Lick_Baby",
          "text": "I don’t think you’re overcorrecting at all. I’ve also been through the phase of having 7 tools open and integrations causing more friction than value. A unified platform gives clarity and faster decision-making. The real challenge is long-term maintenance. If you have the resources to maintain and scale it, it can be a serious advantage.",
          "score": 1,
          "created_utc": "2026-02-19 09:52:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6cx780",
          "author": "Nat_from_Doodle",
          "text": "are you building this yourself or stitching APIs into something centralized?\n\nI’ve noticed people feel the pain most when integrations are shallow. When tools truly talk to each other well, the “five platforms” problem feels less painful.",
          "score": 1,
          "created_utc": "2026-02-20 03:08:21",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r76qqt",
      "title": "B2B marketing is quietly shifting again.",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1r76qqt/b2b_marketing_is_quietly_shifting_again/",
      "author": "aksjonov_se",
      "created_utc": "2026-02-17 13:59:50",
      "score": 7,
      "num_comments": 12,
      "upvote_ratio": 0.82,
      "text": "For years the game was: Rank in Google → get traffic → convert.   \nNow more decision-makers are asking AI tools for answers before ever clicking a website. That changes the funnel.   \n  \nIf AI doesn’t mention your company when someone asks about your category, you might never enter the consideration stage.   \n  \nFrom testing this across B2B SaaS and service businesses, a few patterns stand out:  \n• Ranking alone does not guarantee AI visibility    \n• Clear, definition-first content gets reused more often    \n• Structured pages outperform clever copywriting    \n• Original data increases the likelihood of being referenced    \n• Strong SEO still matters, but it’s now the foundation, not the finish line    \n  \nSome are calling this GEO (Generative Engine Optimization). Not replacing SEO. Layering on top of it.  \n  \nSEO drives discoverability. AI-driven answers influence perceived authority.  \n  \nCurious how others here are thinking about this: Are you actively testing whether your brand appears in AI-generated answers within your niche?\n\n",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1r76qqt/b2b_marketing_is_quietly_shifting_again/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o5v7kqd",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-17 13:59:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5w21k6",
          "author": "Impressive-Amount255",
          "text": "I honestly think not much has changed.\n\nYou’re right. In the past, there was a big focus on getting traffic to your website. Today, there’s a big focus on whether you appear in LLMs. But it has never been only about your website.\n\nIn B2B, it has always been multi-touch.\nNow, the number of touches depends on what you’re selling:\nIf you’re targeting small businesses with a low-ticket offer paid by credit card, the journey might be short.\nIf you’re targeting large enterprises with long sales cycles and six-figure contracts, the journey is much longer.\n\nBut at no point was it ever enough to:\nRank first on Google →\nHave someone type the right keyword →\nSee you in position one →\nAnd immediately enter their credit card details.\n\nThat has never been how serious B2B decisions work.\nIt has always been a mix of touchpoints, such as:\nFinding your website and reading a few blog posts\nSeeing an ad in a magazine\nAsking peers what tools they use\nChecking what industry analysts are saying\nReading media rankings of the best solutions\nLooking at conversations on LinkedIn\nAttending events and trade shows to explore options\n\nWith AI, people are acting like the entire game has changed.\nYes, it’s true that LLMs are a new tool.\nYes, they may take time away from traditional search engines.\nBut no one ever made a serious B2B decision based solely on Google. \n\nAnd I don’t believe buyers will suddenly start making six-figure decisions based solely on a ChatGPT response either.\nMaybe it’s different for a $10 purchase.\nIt’s definitely different for a $500,000 contract.\nBut overall, multi-touch remains the foundation.\n\nTo me, AI and LLMs are simply one more channel to integrate into an existing strategy.\nAn important channel? Absolutely.\nA game-changer that replaces everything else? No.\nIf you already operate with a strong, disciplined integrated campaign framework, it’s not a revolution. It’s an addition.\n\nFor me, using the RIO Integrated Campaign Framework gives the structure to build well-orchestrated campaigns. Adding LLM visibility is simply about incorporating another touchpoint into the mix.\nIt doesn’t fundamentally change how I do marketing.\n\nIt’s just one more channel to influence buyers the right way.",
          "score": 4,
          "created_utc": "2026-02-17 16:34:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5w6o6z",
              "author": "f1zombie",
              "text": "This! \n\nWe are actively building demand gen pipelines that are omni-channel, but more importantly non-linear. Buying committees are over all the place, and each at a different maturity in understanding. AI would be another addition. \n\nSpeaking of - have any of you seen results with optimising for AI?",
              "score": 3,
              "created_utc": "2026-02-17 16:58:43",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o5xkcq4",
              "author": "aksjonov_se",
              "text": "I agree that multi-touch has always been the foundation in B2B. Where I see a shift is not in replacing the journey, but in where early perception is formed.   \n  \nLLMs don’t close six-figure deals. But they increasingly shape first impressions and shortlists. And that changes how clarity and positioning need to work across channels.",
              "score": 1,
              "created_utc": "2026-02-17 20:52:33",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5zp7q1",
          "author": "CoyotePrize4287",
          "text": "I think the biggest shift isn’t just visibility in AI answers, it’s corroboration. LLMs tend to surface brands that are consistently mentioned across multiple trusted sources, not just those with strong on-site SEO. So distribution and third-party validation may matter even more than before.",
          "score": 3,
          "created_utc": "2026-02-18 03:37:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5vbt0z",
          "author": "Mularkeyy",
          "text": "Yeah I’ve noticed this shift too. People aren’t just Googling and clicking anymore, they’re asking ChatGPT or Perplexity and taking the summary as truth.\n\nAnd you’re right, ranking doesn’t automatically mean you show up in AI answers. The stuff that gets pulled tends to be clear, structured, definition-style content, plus pages with actual data or strong examples. SEO still matters, but now it feels like the baseline. The real question is whether you’re becoming the default source AI models keep referencing.\n\nWe’ve been testing this by literally searching our category prompts weekly and tracking if we get mentioned. It’s a new layer of brand protection. We talk about this kind of AI-driven discovery shift on r/LeadGenSEA too if you want more examples and experiments.",
          "score": 2,
          "created_utc": "2026-02-17 14:22:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5xklux",
              "author": "aksjonov_se",
              "text": "That’s a great point about structure and definition-style clarity. What we’re seeing is similar,  it’s less about “ranking” and more about being consistently referenceable.   \n  \nPages that clearly define who they’re for, what they solve, and how they differ seem to get pulled more often. I like the idea of treating it as brand protection. It’s not just visibility, it’s whether the model understands you correctly.\n\n",
              "score": 1,
              "created_utc": "2026-02-17 20:53:45",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5zvnja",
          "author": "Slight_Tutor1790",
          "text": "I think the part that is underestimated here is messaging consistency across every channel. If someone asks an AI tool about your category and then checks your site, LinkedIn, or reviews, the positioning needs to match everywhere. If it is fragmented, the model might still mention you, but the buyer will feel the disconnect. So maybe the real shift is not just optimizing for AI answers, but tightening your overall narrative so it is clear and repeatable wherever it shows up.",
          "score": 2,
          "created_utc": "2026-02-18 04:18:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o63n6qx",
          "author": "Lemonshadehere",
          "text": "The funnel shift is real but I think a lot of people are still underestimating how fast it's happening\n\nwe work with B2B clients and the pattern is consistent: prospects show up to sales calls already having asked ChatGPT or Perplexity for vendor recommendations. if you're not in that initial AI-generated shortlist, you're not even being considered\n\nwhat's actually working from what we've seen:\n\nthird-party validation is everything. your own content matters but AI systems heavily weight what others say about you. strong G2/Capterra presence, getting mentioned in comparison articles, actual customer discussions in communities - that stuff carries way more influence than perfectly optimized landing pages\n\nentity clarity matters more than keyword optimization. if AI can't quickly understand \"company X solves Y problem for Z customers\" by pulling from multiple external sources, you get skipped or lumped into generic results\n\nthe definition-first approach is spot on. but it's not just about structure on your own site - it's about how consistently you're described across the web\n\nbiggest challenge is the measurement gap. clients still want to see \"rankings\" and \"traffic\" but those metrics don't capture whether you're actually showing up in the AI answers that matter\n\nhave you noticed any difference in how established brands vs newer companies show up? feels like newer B2B companies are getting buried even harder in AI results compared to traditional search",
          "score": 2,
          "created_utc": "2026-02-18 18:41:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6f7o67",
          "author": "Imaginary-Leg-2546",
          "text": "I don't need to check AI my traffic comes from other sources that do very well for us.",
          "score": 2,
          "created_utc": "2026-02-20 13:54:42",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r7wkqo",
      "title": "What Can I Gain or Benefit to Lead Generation?",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1r7wkqo/what_can_i_gain_or_benefit_to_lead_generation/",
      "author": "National-Cancel1200",
      "created_utc": "2026-02-18 07:29:41",
      "score": 7,
      "num_comments": 9,
      "upvote_ratio": 1.0,
      "text": "Lately, I’ve been thinking a lot about lead generation and how it fits into growing a business effectively. It seems like so many people focus just on collecting contacts or building email lists, but I feel there’s a bigger picture, like finding the right prospects, building meaningful relationships, and creating a steady flow of opportunities without wasting time on the wrong leads. I’m curious about how others approach it and what they consider the most valuable outcomes from investing time and effort into lead generation.\n\nI’d really love to hear your insights and experiences. Have you tried strategies or tools that made a real difference in finding quality leads or improving conversions? Are there methods that surprised you with unexpected benefits, like better client relationships, clearer targeting, or even internal process improvements? Any advice, suggestions, or lessons learned would be incredibly helpful, not just for me, but for anyone looking to understand the real impact of lead generation beyond just numbers.\n\n",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1r7wkqo/what_can_i_gain_or_benefit_to_lead_generation/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o60k3x9",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-18 07:29:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o62aclv",
          "author": "New_Grape7181",
          "text": "I think you're spot on about the bigger picture. Most people get stuck chasing volume when quality is what actually moves the needle.  \n  \nFrom my experience, the shift happened when I stopped treating lead gen as a numbers game and started focusing on intent signals. Instead of cold outreach to static lists, I began tracking company triggers like funding announcements, job postings, leadership changes, or even just engaged LinkedIn activity. That context let me reach out at the right moment with something relevant, rather than interrupting randomly.  \n  \nThe unexpected benefit wasn't just better conversion rates. It was shorter sales cycles and higher deal values because these prospects were already in motion. They had a reason to care right then, not in six months.  \n  \nI also found that personalisation at scale is possible if you use the right approach. For us, sending quick personalised videos instead of text-only emails completely changed response rates. People actually replied because it felt human, not automated.  \n  \nThe internal benefit you mentioned is real too. Better lead quality means your sales team stops wasting time on tyre kickers and actually enjoys their pipeline.  \n  \nWhat's your current process for identifying which leads to prioritise?",
          "score": 2,
          "created_utc": "2026-02-18 15:00:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o60kgtl",
          "author": "albrasel24",
          "text": "Lead gen isn’t about more emails. It’s about better fits.\n\nWhen you nail your ICP, everything improves: messaging, sales calls, conversion rates.\n\nI’d rather have 20 solid prospects than 200 random ones. Quality > volume.",
          "score": 1,
          "created_utc": "2026-02-18 07:32:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o60zdgz",
              "author": "Tahanchin",
              "text": "Agree. But these days, you need 2000 quality leads to reach at least a few. Channels are overloaded, and each company is trying (successfully) to choke outreachers.",
              "score": 1,
              "created_utc": "2026-02-18 09:51:53",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o60qxww",
          "author": "B2BScaler",
          "text": "Comprehensive understanding of channels and outcomes.\n\nMessage me for full breakdown.\n\nMany shortcut it as a pain point solve and pay up and regret from not asking what you just did intelligently before embarking.",
          "score": 1,
          "created_utc": "2026-02-18 08:32:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o629nmo",
          "author": "New_Grape7181",
          "text": "I think you're spot on about the bigger picture. Most people get stuck chasing volume when quality is what actually moves the needle.  \n  \nFrom my experience, the shift happened when I stopped treating lead gen as a numbers game and started focusing on intent signals. Instead of cold outreach to static lists, I began tracking company triggers like funding announcements, job postings, leadership changes, or even just engaged LinkedIn activity. That context let me reach out at the right moment with something relevant, rather than interrupting randomly.  \n  \nThe unexpected benefit wasn't just better conversion rates. It was shorter sales cycles and higher deal values because these prospects were already in motion. They had a reason to care right then, not in six months.  \n  \nI also found that personalisation at scale is possible if you use the right approach. For us, sending quick personalised videos instead of text-only emails completely changed response rates. People actually replied because it felt human, not automated.  \n  \nThe internal benefit you mentioned is real too. Better lead quality means your sales team stops wasting time on tyre kickers and actually enjoys their pipeline.  \n  \nWhat's your current process for identifying which leads to prioritise?",
          "score": 1,
          "created_utc": "2026-02-18 14:57:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o62nqca",
          "author": "chanchalll_21",
          "text": "Lead generation gives you a consistent pipeline of potential customers. Instead of chasing sales randomly, you build a system that brings interested prospects to you regularly.",
          "score": 1,
          "created_utc": "2026-02-18 16:02:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o68mo8r",
          "author": "Wrong-Finish7655",
          "text": "Lead gen done right gives you predictable pipeline, cleaner ICP clarity, and way less time wasted on bad fits — it’s not about list size, it’s about control over revenue.\n\nWhat actually moved the needle for us was tightening targeting (industry + title + company size) and fixing data quality first; clean inputs improved replies, conversions, and even how sales handled calls.",
          "score": 1,
          "created_utc": "2026-02-19 13:39:21",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r89w36",
      "title": "Why is B2B Reddit marketing dominated by 'ghost' accounts? We just hit 4M views with a corporate handle and the experience was... eye-opening.",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1r89w36/why_is_b2b_reddit_marketing_dominated_by_ghost/",
      "author": "jeeves_inc",
      "created_utc": "2026-02-18 17:47:42",
      "score": 7,
      "num_comments": 22,
      "upvote_ratio": 1.0,
      "text": "We recently had a post go viral (hit 4M+ views), which was a massive surprise. But as soon as the numbers spiked, the 'brand tax' hit us: we got banned from several major subreddits. The moderators' logic was simple: 'You’re a brand, so this is marketing, regardless of the content.'\n\nNow that the dust has settled, I’m looking at these 'vanity metrics' and feeling a bit lost. On one hand, we have 4.3M views and decent karma. On the other hand, we are now 'blacklisted' from the very places where our audience hangs out.\n\nMy question for the veterans here: > Does having a 'high-authority' corporate account actually translate into leads or sales in the B2B world? Or is the friction with moderators and the community so high that it’s better to just stick to personal handles or paid ads?",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1r89w36/why_is_b2b_reddit_marketing_dominated_by_ghost/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o63ax7x",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-18 17:47:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o63ygfx",
          "author": "Alone_Ad_3375",
          "text": "Personally I think whoever is running your marketing on Reddit is really naive and pushing ai slop everywhere.\n\nProbably damaging your brand reputation in the long term.\n\nI remember someone from your team approached me regarding reddit marketing.\n\nIt's good that you have been able to increase your karma to 5,000 in under a month.\n\nBut I still think that is not going to drive any revenue to the business and if at all it would.\n\nI think it should be right for you to start establishing yourself as an authority instead of pushing out a narrative that you are actually a real human under the name of your brand name.\n\nThis activity works best on X not on Reddit in my opinion.\n\nMind you I'm handling reddit marketing for an enterprise worth over $20B so I can tell what I'm seeing.",
          "score": 7,
          "created_utc": "2026-02-18 19:31:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6450vd",
              "author": "CommunicationRare603",
              "text": "Strange times we are living brands pushing ai slop in search of ai citation",
              "score": 2,
              "created_utc": "2026-02-18 20:02:07",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o64od71",
                  "author": "hollee-o",
                  "text": "So much bullshit in the “aeo/aio” gambit. Tell me where I’m wrong in this assessment:  1) What ai says to people is so shaped by context the supposed monitoring is worthless. 2) The monitoring itself is just a gpt wrapper, and its repeated polling of gpts is generating its own context, skewing the result. 3) The end-game already seems obvious: each major model will sell “brand management” tools directly to brands to fill their coffers. No monitoring needed.",
                  "score": 2,
                  "created_utc": "2026-02-18 21:32:17",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o65yaii",
              "author": "Zealousideal-Job6344",
              "text": "Is there a mid way to do that ? I mean Reditt has better conversions than LinkedIn now and it’s where many buyers are . How do we find the balance where we do want to push out message but then don’t want to make this into another marketing competition",
              "score": 2,
              "created_utc": "2026-02-19 01:32:58",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o67eprg",
                  "author": "Alone_Ad_3375",
                  "text": "simple answer is help people with decisions solve their problems and only add your product wherever it is relevant \n\nreddit is not a distribution channel it is a channel to help the community and if you do a good job at that the community will reward you in ways you never expected",
                  "score": 3,
                  "created_utc": "2026-02-19 07:34:02",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o67zong",
          "author": "AleksandrMovchan",
          "text": "Apparently, this all has a combined effect\n\n1. The motivation for brands to move to paid features.\n2. Reddit's value lies in human interaction, so brands should run their own communities (as I understand it).\n3. Essentially, using a brand name and participating in discussions is PR (yes).",
          "score": 6,
          "created_utc": "2026-02-19 10:54:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o66ro4c",
          "author": "CoyotePrize4287",
          "text": "Reddit communities really do trust people more than brands, and your experience shows why. Corporate handles tend to trigger spam flags and moderator instincts even when the content is solid, so you end up paying the “brand tax” instead of getting genuine engagement.\n\nI’ve found Reddit works better as a long-term trust play. Real subject-matter experts who show up consistentlyy and add value usually go further than a branded account trying to go viral. If you want predictable scale, paid ads are cleaner, but organically,, it’s mostly about reputation over time.",
          "score": 4,
          "created_utc": "2026-02-19 04:30:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6bcxnz",
              "author": "RedditforBusiness",
              "text": "That point at \"predictable scale\" is a really salient one. Reddit is a platform that fundamentally values personal interaction, and sometimes, that can get conflated with common lead generation tactics. Because of that, it can be easy to think that it's just adapting existing lead gen tactics into a new format, but the reality is much more specific to Reddit. \n\nReddit has a high-intent audience, sure, but it's also an audience that likes to handle its own decision-making, as well as congregating in defined communities that they *trust*, most importantly. Similarly, you as a brand have to gain trust the same way, by being a member of the community that shows respect and consistency for the community's rules and guidelines while *expecting* nothing in return. Is that less defined than a paid campaign? For sure. But when it's done right, lasting trust not only retains your audience, it becomes advocacy.",
              "score": 2,
              "created_utc": "2026-02-19 21:42:39",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6brsyv",
                  "author": "Southern_Audience120",
                  "text": "I've been using Leadmatically to handle the discovery part. It just finds those relevant conversations where my service could actually help. so I can focus my own time on being that authentic, helpful member in the replies.",
                  "score": 1,
                  "created_utc": "2026-02-19 23:00:14",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o63c8vi",
          "author": "Dapper-Condition6041",
          "text": "I thinking breaking the rules - \"no marketing\" - is breaking the rules, regardless...",
          "score": 1,
          "created_utc": "2026-02-18 17:53:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o63jbof",
          "author": "gptbuilder_marc",
          "text": "4M views sounds great until the account gets boxed out.\n\nThat’s not a content problem. That’s distribution access getting tighter. Corporate handles tend to trip wires even when the posts are fine.\n\nWere those posts linking to your product at all, or just discussion?",
          "score": 1,
          "created_utc": "2026-02-18 18:24:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o64hezy",
          "author": "erickrealz",
          "text": "4M views and banned from your target subreddits is the perfect summary of why corporate accounts don't work on Reddit. You won the battle and lost the war.\n\nThe answer is obvious and it's why everyone uses personal accounts. Reddit communities trust people, not logos. A founder sharing genuine insights gets upvoted. The same content from a branded account gets reported. That's not a bug, it's how the platform works.\n\nYour 4M views almost certainly generated near zero pipeline because viral Reddit posts attract random eyeballs not qualified buyers. The B2B companies quietly generating leads from Reddit are doing it through personal accounts, helpful comments, and zero branding in their username. They'll never go viral and they don't need to because 10 genuine conversations in niche subreddits with decision makers beats 4M views from people who'll never damn buy anything.",
          "score": 1,
          "created_utc": "2026-02-18 21:00:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o64ks15",
          "author": "Fresh_Refuse_4987",
          "text": "I use Leadmatically to find relevant discussions where our product actually solves a problem, and it keeps replies contextual so they don't feel like marketing. It's helped us get solid B2B leads without the bans.",
          "score": 1,
          "created_utc": "2026-02-18 21:16:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o65woq8",
          "author": "New_Grape7181",
          "text": "I've seen this play out a few times now. The corporate account paradox is real on Reddit because moderators (and users) are trained to spot and reject anything that feels like marketing, even when the content is genuinely valuable.  \n  \nFrom what I've observed, the personal account approach works better for a few reasons. You can participate in communities without triggering automatic suspicion, your advice lands better because it's coming from a person rather than a brand, and you actually build relationships over time rather than just broadcasting.  \n  \nThat said, I wouldn't write off the corporate account entirely. Use it for your own subreddit if you have one, for official announcements, and for responding when people specifically ask about your company. Just don't try to be everywhere with it.  \n  \nThe 4M views are nice for awareness, but you're right to be sceptical about lead gen impact. Most B2B buyers aren't going from \"saw a Reddit post\" to \"submitted a demo request\" in one go. It's more about staying top of mind and building trust gradually.  \n  \nWhat was the actual post about that went viral? Sometimes understanding why something hit can help you figure out where to lean in next.",
          "score": 1,
          "created_utc": "2026-02-19 01:23:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o67bhni",
          "author": "Sin_In_Silks",
          "text": "ddit kinda hates being marketed to, even when it’s not obvious. I’ve seen solid posts nuked just because the username smelled corporate. Personal accounts slip through because they feel normal, not strategic.",
          "score": 1,
          "created_utc": "2026-02-19 07:05:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o696o0z",
          "author": "Intrepid_Boss9449",
          "text": "High-authority corporate accounts usually get more heat from mods no matter what you post. From what I’ve seen, personal handles or smaller accounts blend in better and avoid bans. If you want to scale without risking blacklists, tools like SocListener can help you find real sales leads and engage without shouting \"brand\" all over the place.",
          "score": 1,
          "created_utc": "2026-02-19 15:26:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o63fx71",
          "author": "adithyank0001",
          "text": "man, getting banned from major subreddits after hitting 4 million views sounds frustrating. that brand tax is a real pain. you might want to consider focusing on building relationships in niche communities where your audience is genuinely engaging, rather than relying solely on a corporate handle.\n\ni've seen many founders struggle with this exact issue. brands often face pushback, while personal accounts can connect more authentically. if you're looking for a way to streamline the process of finding leads, my tool LeadRabbit monitors Reddit 24/7 to alert you about high-intent buyers, helping you engage promptly. it's just 59 dollars for a lifetime, which might save you a lot of time and headaches.",
          "score": 0,
          "created_utc": "2026-02-18 18:09:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o63vg6u",
              "author": "Radiant-Security-347",
              "text": "drops his company to rub it in. ",
              "score": 3,
              "created_utc": "2026-02-18 19:17:58",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r9vk0f",
      "title": "Legit way to find list of IT companies (1000-5000 employees)",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1r9vk0f/legit_way_to_find_list_of_it_companies_10005000/",
      "author": "TurbulentMarketing14",
      "created_utc": "2026-02-20 13:37:03",
      "score": 7,
      "num_comments": 15,
      "upvote_ratio": 1.0,
      "text": "What are some ways you find these companies? I assume this is a paid service, so not expecting a free ride.  What platforms have you had some success with?   \nAlso considering a workflow that can scrape sites and pull basic info from mostly static pages. ",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1r9vk0f/legit_way_to_find_list_of_it_companies_10005000/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o6f4dhl",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-20 13:37:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6fdnb2",
          "author": "BusySeedAgency",
          "text": "Some paid data platforms you can use are LinkedIn Sales Navigator, Apollo, ZoomInfo, and Crunchbase. Paid platforms are usually worth it.",
          "score": 5,
          "created_utc": "2026-02-20 14:26:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6fmhi5",
              "author": "TurbulentMarketing14",
              "text": "These are platform names that keep coming up. ",
              "score": 1,
              "created_utc": "2026-02-20 15:10:58",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o6g2om3",
              "author": "KissyyyDoll",
              "text": "Which one specifically? ",
              "score": 1,
              "created_utc": "2026-02-20 16:26:43",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o6gnsww",
              "author": "sundsipa",
              "text": "yeah this list is basically the starter pack. quick question: for 1000-5000 headcount IT, do you trust Sales Nav more than ZoomInfo on employee counts, or nah?",
              "score": 1,
              "created_utc": "2026-02-20 18:03:38",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6f9wcg",
          "author": "Everyd4yAudioGuy",
          "text": "If all 5 of your test emails are landing in spam, it’s almost always a reputation hit, not just a DNS problem. DFY accounts can still get cooked if Gmail starts seeing bad signals.\n\nQuick checks: did bounce rate creep up, are you using open tracking or links, did volume change recently, and is the copy basically the same across inboxes. Gmail flags patterns fast, even with text-only. I’d pause cold sends for a few days, keep warmup running, and run the domains through GlockApps or Mail Tester to see what’s failing before buying new domains.\n\nAlso, if list quality is part of the issue, The Grid can help for SEA targeting since the data tends to be fresher than generic databases.\n\nWe talk deliverability and lead sourcing on r/LeadGenSEA too if you want more insights.",
          "score": 2,
          "created_utc": "2026-02-20 14:06:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6laiow",
              "author": "OkConversation8289",
              "text": "yeah this tracks. ive seen Gmail nuke brand new domains just from the same template + link tracking. do you trust GlockApps more than Mail-Tester for catching rep issues early?",
              "score": 1,
              "created_utc": "2026-02-21 12:30:04",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6m6pv2",
          "author": "BodybuilderHorror718",
          "text": "Apollo 100%",
          "score": 2,
          "created_utc": "2026-02-21 15:46:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6g2km0",
          "author": "KissyyyDoll",
          "text": "Filter by headcount on Sales Navigator. It’s the most accurate for mid-market companies because it’s based on real-time employee profiles. Just export the list and verify the domains manually.",
          "score": 1,
          "created_utc": "2026-02-20 16:26:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6nn7i1",
          "author": "Reasonable-Pen-8529",
          "text": "There are tons of companies that sell data lists. I would look into one like Techsalerator, as it has large, customizable datasets so you'll probably be able to find what you need.",
          "score": 1,
          "created_utc": "2026-02-21 20:10:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6nsho7",
          "author": "salestoolsss",
          "text": "Use Tomba.io’s Reveal tool  it’s the easiest way to get more complete data, especially since most B2B companies and leads are active on LinkedIn.",
          "score": 1,
          "created_utc": "2026-02-21 20:38:11",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r9s7uj",
      "title": "this is how I get B2B client in my agency",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1r9s7uj/this_is_how_i_get_b2b_client_in_my_agency/",
      "author": "LeadershipRare1908",
      "created_utc": "2026-02-20 10:50:13",
      "score": 7,
      "num_comments": 17,
      "upvote_ratio": 1.0,
      "text": "For the context, I run a Linkedin cold outreach agency (around $25k/mo)\n\nOur acquisition is Linkedin content + Outreach + Word of mouth.\n\nBut if I go deeper on this, here's what works so well.\n\n**1/ I create lead magnet (either Notion doc or private YT video)**  \n\\-> disclaimer : needs to be really helpful for your ICP, not just a Claude PDF done in 2min.\n\n**2/ I publish a post on Linkedin to promote it, and ask for a comment to receive the doc**  \nKey points for a viral post are :  \n\\- strong hook with numbers  \n\\- Attractive visual (GIF, Document blurred, ..)  \n\\- answer every comment in the first hour after the post for an algo boost\n\n**3/ I scrap commenters and send automatic DM**\n\n**4/ few days after, I ask people (only that are in my ICP)** :  \n\"curious to know why you asked for the ressource, are you interested in {{topic}} at the moment ?\"\n\nNote : don't ask 'have you seen my doc?'. 90% won't check it. And it doesn't matter.\n\nWhat matters is the signal they send you, they're interested in the topic right now. They often need help and are looking for agencies.\n\nHope it helps and give you insights.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1r9s7uj/this_is_how_i_get_b2b_client_in_my_agency/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o6eghl1",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-20 10:50:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ejw4f",
          "author": "Silly_Newt4788",
          "text": "If you had to how would you do this if your were in gaming industry? Would your workflow still remain the same?",
          "score": 1,
          "created_utc": "2026-02-20 11:19:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6ep7ru",
              "author": "Relevant_Fee1017",
              "text": "yeah same skeleton works in gaming, you jsut change the magnet: eg a UA creative teardown Notion or a private vid on Steam page conversion. are you targeting indie devs or publishers?",
              "score": 1,
              "created_utc": "2026-02-20 12:00:35",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6f39br",
                  "author": "Silly_Newt4788",
                  "text": "Targeting gaming studios that are looking for QA, Art an Dev services.",
                  "score": 1,
                  "created_utc": "2026-02-20 13:30:55",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6eqfh0",
          "author": "eviom_B2BMarketing",
          "text": "Danke für deinen Beitrag! Lass uns gern über Agentur Lead Akquise austauschen",
          "score": 1,
          "created_utc": "2026-02-20 12:09:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ey85u",
          "author": "SnooPeppers1256",
          "text": "How would you do this for an instagram marketing agency?",
          "score": 1,
          "created_utc": "2026-02-20 13:01:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6fnm3k",
              "author": "Lazy-Mind-2980",
              "text": "Yeah same basic flow works on IG too. Reels + a pinned comment CTA to DM \"guide\", then you auto-reply and follow up. What niche are you targeting? Ecommerce, coaches, local? I've seen diffrent angles work.",
              "score": 1,
              "created_utc": "2026-02-20 15:16:22",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6f17hj",
          "author": "Radiant-Security-347",
          "text": "Tonto, is that you?",
          "score": 1,
          "created_utc": "2026-02-20 13:19:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6fl9fl",
          "author": "exomatsolutions",
          "text": "Kindly send me a DM.",
          "score": 1,
          "created_utc": "2026-02-20 15:05:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6g66cq",
          "author": "Individual-War3274",
          "text": "Does your outreach have typos?",
          "score": 1,
          "created_utc": "2026-02-20 16:42:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6iceqq",
          "author": "Immediate_Bear_6132",
          "text": "I did the same for my agency. I write an insane lead magnet on Twitter and DM all commenters. I think it's the smartest technique",
          "score": 1,
          "created_utc": "2026-02-20 22:59:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6kefoc",
          "author": "Exciting-Sir-1515",
          "text": "What’s the tool you use to reply to messages?",
          "score": 1,
          "created_utc": "2026-02-21 07:24:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ln02g",
          "author": "murtuza78",
          "text": "This is honestly solid and nails the intent-first part of outreach most folks skip. The doc is just bait but the real value is in the signal from commenters. The follow-up is where deals actually start so dialing in that message makes all the difference. Love that you’re not stressing whether they viewed it because true leads just surface through the convo anyway.",
          "score": 1,
          "created_utc": "2026-02-21 13:56:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6gj2fw",
          "author": "EntranceBest",
          "text": "Solid breakdown. The insight about not asking \"did you see my doc\" is underrated. The signal matters more than the consumption.\n\nRunning a similar value-first approach but on Reddit instead of LinkedIn right now. Answering real questions from business owners in eCommerce and B2B subreddits with no pitch, just genuinely useful replies. The inbound is slower to start but the intent is high when it comes in because they've already read your thinking before they reach out.\n\nDifferent channels, same principle: give before you ask, and let the signal tell you who's ready.",
          "score": 0,
          "created_utc": "2026-02-20 17:42:04",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r954f5",
      "title": "ChatGPT ads are live (sort of). Here's what B2B marketers actually need to know.",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1r954f5/chatgpt_ads_are_live_sort_of_heres_what_b2b/",
      "author": "stevehetr",
      "created_utc": "2026-02-19 17:17:17",
      "score": 6,
      "num_comments": 5,
      "upvote_ratio": 0.87,
      "text": "Scroll to the end for a TL;DR\n\nWe were asked a variant of the question, \"ChatGPT is making ads why aren't we doing this?\"\n\nSo, we did some digging, here's what we found:\n\nChatGPT ads are live (sort of). Here's what B2B marketers actually need to know.\n\nSome quick background to assure you guys we know what we're talking about: We run a B2B agency name **Obility**, that handles paid search, paid social, SEO, and GEO for tech and SaaS companies. We've been doing it for a hair over 15 years now.\n\nSo, \"can we run ads in ChatGPT?\"\n\nThe short answer is no. Not yet. And probably not for a while if you're in B2B.\n\nWe wanted to lay out what's actually happening, what it means for B2B, and what's worth doing instead.\n\nWhat's actually happening with ChatGPT ads:\n\nOpenAI started testing ads in the U.S. on February 9, 2026. Here's how it works:\n\n\\- Ads have started showing up for logged-in users on the Free and Go ($8/month) tiers\n\n\\- Plus, Pro, Business, Enterprise, and Education users don't see any ads for now\n\n\\- Ads appear as labeled sponsored boxes at the bottom of ChatGPT's responses, not inside the answer itself\n\n\\- OpenAI says ads do not influence what ChatGPT tells you\n\n\\- The pricing model is impression-based, not CPC\n\nThis is a closed, invite-only pilot. OpenAI is calling it the Ad Pilot Program. The companies in it so far are large:\n\n\\- Adobe is testing ads for Acrobat Studio and Firefly\n\n\\- Omnicom secured placements for over 30 of its clients\n\n\\- WPP is involved as an agency partner\n\nThe reported minimum commitment for the beta is $200,000. There's no self-serve platform. No way to just log in and set up a campaign. If you don't have a direct relationship with OpenAI or one of the pilot agencies, you're not getting in right now.\n\nIt seems to be serious about privacy and restrictions issues\n\nOpenAI set some hard boundaries around targeting and data:\n\n\\- Targeting is contextual, based on conversation topic only\n\n\\- Advertisers don't get access to chat history, memories, or personal details\n\n\\- They only receive aggregate data (views, clicks)\n\n\\- Ads are blocked from conversations about health, mental health, politics, and other sensitive topics\n\n\\- Users under 18 won't see ads\n\n\\- Free tier users can opt out of ads, but doing so reduces their daily message limit\n\nThis doesn't matter for most B2B companies yet\n\nThe format is built mostly for consumer use cases right now. The examples OpenAI has shown are:\n\n\\- Someone asks about trips to Santa Fe, sees an ad for a cottage rental\n\n\\- Someone asks about hiking boots, sees a shopping suggestion\n\n\\- Someone asks about dinner party recipes, sees an ad for hot sauce\n\nThat's all B2C.\n\nYou guys know B2B buying doesn't work that way. A few reasons:\n\n\\- Your prospects aren't querying ChatGPT \"which ERP system should I buy?\" and then clicking an ad\n\n\\- B2B purchase cycles involve multiple stakeholders and long evaluation periods\n\n\\- The users seeing ads are on Free and Go tiers, which skews younger (18-34) and more price-conscious\n\n\\- The decision-makers evaluating enterprise software are more likely on paid, ad-free plans\n\nPlus we aren't sure there is a willingness in B2B clients to spend $200K on a test budget for a platform with no self-serve option.\n\nNone of this means ChatGPT ads will never matter for B2B. OpenAI has said they'll expand the program with new formats and buying models over time. A self-serve platform is expected sometime in 2027. So, we have time.\n\nWhat B2B companies should actually focus on right now\n\nIf you or your prospects want to show up in ChatGPT (or any other LLM), the way to do it is is through Generative Engine Optimization (GEO or Answer Engine Optimization if you will).\n\nIn case anyone reading doesn't know, GEO is the practice of making your brand and content more likely to appear in AI-generated responses. It's not the same as SEO, though there's overlap. Most AI search engines pull heavily from top-ranking organic results, so the two work together (we can talk more about that in the comments, we've a lot of experience there).\n\nHere's what we know works:\n\nGet your product data into Reddit conversations, major directories and merchant feeds. LLMs (not exclusively ChatGPT) pulls from these when generating answers. If you are currently in conversations, you will show up.\n\nPublish content that directly answers buyer questions. Not vague no blatantly AI-generated thought leadership. Real, detailed answers to things people type into AI tools:\n\n\\- \"What's the difference between X and Y?\"\n\n\\- \"How much does Z typically cost?\"\n\n\\- \"What should I look for in a \\[category\\] vendor?\"\n\nGet mentioned in third-party sources. AI models weigh information from multiple independent sources more than a single brand's own claims. Reviews, comparison articles, analyst coverage, and earned media all feed into how these systems rank and present information.\n\nOrganize your content clearly. AI models parse well-organized content better than walls of text. Use descriptive headings. Define your terms. Make information easy to extract.\n\nTrack your AI visibility. Monitor whether your brand shows up in AI overviews and AI search engine results. Track which queries surface your content and which don't. Treat it like you'd treat keyword rankings in traditional SEO, because that's what it is now.\n\nIt doesn't have the turnaround time of a paid channel, but it is a viable content and visibility strategy. And for B2B right now, it matters far more than trying to buy into an ad platform that's designed around consumer shopping queries.\n\nThe Big Picture (as of today)\n\nWe're seeing people treat ChatGPT ads like they're going to replace Google Ads. We've seen projections by analysts proposing that OpenAI's ad business could hit $25 billion in annual revenue by 2030, and we've seen some people publish long strategy guides about conversation funnel bidding and contextual intent targeting.\n\nSome of that will probably come true eventually. but it is hypothetical at this point, here's what we are able to surmise from OpenAI's published papers is that:\n\n\\- The platform is in a closed beta with a handful of large advertisers\n\n\\- The targeting is basic\n\n\\- The format is simple\n\n\\- The measurement infrastructure barely exists\n\n\\- The whole thing is built around consumer intent patterns\n\nIf you're in B2B and your boss or client is asking about ChatGPT ads, the honest advice is to save the budget. Put it into making sure your brand shows up in AI-generated answers organically.\n\nThe paid side will come. When it does, companies that already have strong organic AI visibility will be in a much better position to run ads in that environment than companies starting from zero.\n\n\\---\n\nTL;DR\n\n\\- ChatGPT ads launched as a U.S.-only, invite-only beta on February 9, 2026\n\n\\- Only Free and Go tier users see ads. Paid plan users don't.\n\n\\- Minimum commitment is reportedly $200K. No self-serve platform.\n\n\\- The format is built around consumer use cases: shopping, travel, local services\n\n\\- B2B companies can't buy in right now, and the format doesn't fit B2B buying patterns anyway\n\n\\- What B2B should focus on instead: GEO. Make your brand visible in AI-generated answers through content, structured data, and third-party mentions.\n\n\\- The paid opportunity will come. Building organic AI visibility now is what actually matters",
      "is_original_content": false,
      "link_flair_text": "News",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1r954f5/chatgpt_ads_are_live_sort_of_heres_what_b2b/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o69tnmf",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-19 17:17:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o69y11h",
          "author": "BodybuilderHorror718",
          "text": "Good recap of what's going on. ChatGPT ads doesn't seem like a b2b play yet, it's more b2c. And $200k investment? I'll put my ad dollars elsewhere for now",
          "score": 1,
          "created_utc": "2026-02-19 17:38:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6am1l3",
              "author": "stevehetr",
              "text": "Thank you,   \n  \nalso, unrelated: love the username! ",
              "score": 1,
              "created_utc": "2026-02-19 19:31:45",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6cekzh",
          "author": "Jamin_Hekle",
          "text": "ChatGPT ads are interesting but pricey and unproven for niche B2B like crypto—I've had way better luck with Victoria Olsina's LLM SEO tactics that got our project cited in organic responses. Her free resources on YouTube nailed the frameworks without the ad spend guesswork.",
          "score": 1,
          "created_utc": "2026-02-20 01:13:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6dubug",
          "author": "New_Grape7181",
          "text": "I've been thinking about this a lot lately. The consumer vs B2B distinction you've made is spot on.  \n  \nThe thing that worries me about waiting for self-serve in 2027 is that by then, buying behaviour will have already shifted. People aren't using ChatGPT to compare vendors yet, but they're absolutely using it to research problems, understand terminology, and build their shortlists before they ever hit a demo request form.  \n  \nYour GEO advice is solid. I'd add one thing though: video content seems to get indexed and referenced more than most people realise. We've had snippets from webinars and product walkthroughs show up in AI-generated answers when the equivalent blog post didn't. The transcript makes it easy to parse, and if it's hosted somewhere public (YouTube, LinkedIn), it gets picked up.  \n  \nThe Reddit point is interesting too. I've noticed ChatGPT will sometimes cite \"discussions on Reddit\" when answering software comparison questions. Not linking directly, just using it as source material.  \n  \nHave you seen any patterns yet in which types of B2B content get surfaced most consistently in AI responses?",
          "score": 1,
          "created_utc": "2026-02-20 07:23:46",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}