{
  "metadata": {
    "last_updated": "2026-02-16 09:18:16",
    "time_filter": "week",
    "subreddit": "b2bmarketing",
    "total_items": 20,
    "total_comments": 297,
    "file_size_bytes": 263592
  },
  "items": [
    {
      "id": "1r0b4sj",
      "title": "Anyone here actively using Reddit for lead gen?",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1r0b4sj/anyone_here_actively_using_reddit_for_lead_gen/",
      "author": "Only_Egg_6976",
      "created_utc": "2026-02-09 17:51:53",
      "score": 62,
      "num_comments": 56,
      "upvote_ratio": 0.89,
      "text": "Not talking about blasting links or DM spam, but actually picking up real leads from comments or threads where people already have a problem. Fairly new at this, seen a few options like F5bot, Syften etc but never used anything  like that. If you are doing this successfully, I’d love to hear what’s working for you.",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1r0b4sj/anyone_here_actively_using_reddit_for_lead_gen/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o4gwqi1",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-09 17:51:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ljikj",
          "author": "IdealUprising",
          "text": "I still use Syften, but way more as a passive radar than a lead gen tool. I track a small set of problem phrases and a few subs I already read anyway. Alerts go to Slack and most of them I just ignore. The goal isn’t to reply to everything, it’s to notice the couple of threads a week I would’ve missed otherwise. When I do reply, I’m not trying to convert anyone. I’ll usually just share how I’d think about the problem or what I tried in the past. Sometimes the conversation goes nowhere, sometimes people ask follow ups or check your profile later. That’s where anything “lead-like” comes from.",
          "score": 13,
          "created_utc": "2026-02-10 11:33:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4m5xy3",
              "author": "Only_Egg_6976",
              "text": "I think everyone agrees with this, chasing every lead can be time consuming and useless, only chase the ones that you can contribute to. Appreciate the advice!",
              "score": 1,
              "created_utc": "2026-02-10 13:59:31",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o56he20",
              "author": "TheGONetwork",
              "text": "This is great to know as a newbie on Reddit (from a company, at least) Appreciate it.",
              "score": 1,
              "created_utc": "2026-02-13 15:37:56",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4hwtm1",
          "author": "Extra-Pomegranate-50",
          "text": "been doing this manually for a few weeks now in the email deliverability niche. no tools, no bots — just searching for posts where people describe problems my service solves and dropping genuine technical advice in the comments.\n\nwhat actually works: answer the question properly first. if someone asks why their emails land in spam, i explain the technical reason (SPF/DKIM/DMARC misconfiguration, blacklists, etc). no pitch, no link. just help.\n\nwhat happens: people DM you, save your comments, and check your profile. the ones who need more help reach out naturally. ive had threads where the OP came back 3-4 times with follow-up questions.\n\nthe key is picking posts where you can add something the other commenters havent said. if everyone already covered the answer, skip it. if theres a technical gap nobody mentioned, thats your opening.\n\nits slow but the lead quality is way higher than any automated tool because youre only talking to people who already have the exact problem you solve.",
          "score": 8,
          "created_utc": "2026-02-09 20:46:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4m6ct6",
              "author": "Only_Egg_6976",
              "text": "Nice, also glad it's working out for you. idk about chasing them manually but I've been doing something pretty similar, and I agree with your point about answering the question first and foremost, genuine help is more appreciated than people think.",
              "score": 1,
              "created_utc": "2026-02-10 14:01:48",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4mmefb",
                  "author": "Extra-Pomegranate-50",
                  "text": "yeah the manual part is definitely the tradeoff — its not scalable in the traditional sense. but the signal-to-noise ratio is way better than blasting linkedin or running paid ads to cold traffic. the people who DM you after reading a technical comment are already pre-qualified because they saw you solve their exact problem.",
                  "score": 1,
                  "created_utc": "2026-02-10 15:25:25",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4hcb4i",
          "author": "No_Hedgehog8091",
          "text": "Yes, been doing this for years actually.\n\n  \nThe tools you mentioned work fine for keyword alerts, but the real game is in your response quality. Most people blow it by being too eager or too vague.\n\n  \nWhat works: answer the actual question first, show you understand their specific situation, then let curiosity do the rest. Your profile does the selling, not your comment.\n\n  \nBiggest mistake I see? People responding to every alert instead of picking threads where they genuinely have something useful to add.",
          "score": 11,
          "created_utc": "2026-02-09 19:04:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4k8d34",
              "author": "CCMALLC",
              "text": "🧨 Explosive resonse...well expressed! SERVE INSTEAD OF SELLING",
              "score": 3,
              "created_utc": "2026-02-10 04:36:57",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o4hzkk7",
              "author": "TaxNearby9307",
              "text": "For automating the discovery of conversations where you can genuinely add value, I use Leadmatically. It handles the continuous monitoring across subreddits, so I can focus entirely on crafting those helpful, contextual replies you mentioned",
              "score": 2,
              "created_utc": "2026-02-09 20:59:28",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4qrkz3",
                  "author": "CCMALLC",
                  "text": "Good deal!",
                  "score": 1,
                  "created_utc": "2026-02-11 04:11:51",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o4m62ym",
              "author": "Only_Egg_6976",
              "text": "Response quality is the most important thing for leads, I said the same to another comment, apprecaite the comment",
              "score": 2,
              "created_utc": "2026-02-10 14:00:18",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o4n4n65",
              "author": "YoukBos",
              "text": "Might be a stupid question, but I’m new to this: how does you profile do the selling?",
              "score": 2,
              "created_utc": "2026-02-10 16:50:32",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o4xpec9",
              "author": "Affectionate_Lab9365",
              "text": "100%. And profile only works if youre consistently present in the right threads. What Ive seen is most people either monitor too broadly noise or too narrowly miss intent. The sweet spot is tracking the language buyers use right before they start evaluating options.",
              "score": 1,
              "created_utc": "2026-02-12 05:47:09",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o56hqq1",
              "author": "TheGONetwork",
              "text": "What tips would you give to optimise a Reddit profile? Other than social handles? Great tips btw",
              "score": 1,
              "created_utc": "2026-02-13 15:39:38",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4i07ne",
          "author": "phillcivi_1286",
          "text": "Our team have tested these and other tools before, but honestly, the old school way of manually monitoring reddit subthreads has been the best method so far for us.   \n  \nWe had trouble getting programs to understand the nuance of what we were looking for and felt like we were spending just as much time, if not more, going through their \"results\" than perusing the subreddits ourselves looking for areas we could provide genuine feedback/tips.\n\nSince Reddit can be a rabbit hole that's hard to crawl out of, we're testing having interns or entry-level marketing/sales employees spend an hour or so a few times a week looking at threads and sharing posts we could engage with in a dedicated slack channel. Then our subject experts review and jump in where they feel is most appropriate and helpful.\n\nIt's only been a month or so of this practice but this rhythm feels good for our team and helps us participate in a more true-to-Reddit way. \n\nAnd I'll second what other commenters have shared: focusing on quality of comments over quantity. It is evident which comments are posted just to catch fish vs which are shared out of true helpfulness, and Redditors respond accordingly. \n\n",
          "score": 3,
          "created_utc": "2026-02-09 21:02:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4kah8b",
              "author": "CCMALLC",
              "text": "Tried and tested and true",
              "score": 1,
              "created_utc": "2026-02-10 04:51:52",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o4m6lg7",
              "author": "Only_Egg_6976",
              "text": "yup everyone shares the same consensus it seems, quality of comments matters the most, manual leads I feel like take too much time, I'd prefer automating it since it seems less tiring. thanks for the comment",
              "score": 1,
              "created_utc": "2026-02-10 14:03:08",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4hfdoh",
          "author": "DudeWaitWut",
          "text": "Yes, the biggest things are publishing consistently, providing real value, and not overly promoting your product. I would say 95/5 (95% just answers questions or provide helpful responses, 5% actually mentioning your product). Maybe 90/10. But if you overdoit, people notice. You'll get flagged, moderated, removed, banned, etc. Or, people will just have a low opinion of you and your product.\n\nThere are a ton of tools in this space now. I see a new one pop up every week. Most miss the point, and lack features that actually help you find relevant mentions. F5bot is okay. It's really bare bones. Same with Syften. They don't really have advanced features for contextual keyword filtering, negative keywords, keyword types, subreddit-specific monitoring, etc. They're okay if you're just starting up but not something I'd recommend for a more advanced Reddit campaign.\n\nI'd also agree with the other person here. Pick your battles. Don't just spam every post. Pick ones where you can provide actual value.",
          "score": 1,
          "created_utc": "2026-02-09 19:19:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4hv6r8",
          "author": "Accomplished_Echo376",
          "text": "How *you* doin?",
          "score": 1,
          "created_utc": "2026-02-09 20:37:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4hzcb4",
          "author": "NecessarySoftware569",
          "text": "Yes , I've been doing it , been using a tool that can find and reach out to leads through various social platforms ( Reddit included) , its been a game changer.",
          "score": 1,
          "created_utc": "2026-02-09 20:58:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4icyti",
              "author": "Open-Papaya-2703",
              "text": "Mind sharing the tools name?",
              "score": 1,
              "created_utc": "2026-02-09 22:06:21",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4if2z9",
                  "author": "NecessarySoftware569",
                  "text": "Would love to ! Dm me",
                  "score": 2,
                  "created_utc": "2026-02-09 22:17:12",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4hzw7k",
          "author": "Kindly_Watercress416",
          "text": "I found a couple of clients this way. Not the best quality lol, but still okay.\nAlso, I found a lot of services for myself, so it worked for them I guess",
          "score": 1,
          "created_utc": "2026-02-09 21:01:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4m6up1",
              "author": "Only_Egg_6976",
              "text": "All that matters is that you found them, glad you doing well",
              "score": 2,
              "created_utc": "2026-02-10 14:04:32",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4i8ktf",
          "author": "unicorn69love",
          "text": "ive been testing reddbot for reddit lead gen in b2b saas handles the 24/7 monitoring and spits out decent comment drafts way better than manual hunts or basic alerts like f5bot. still gotta edit em to nail that genuine vibe tho, or it flops hard. saves tons of time if youre scaling multiple niches",
          "score": 1,
          "created_utc": "2026-02-09 21:44:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4i9ei5",
          "author": "erickrealz",
          "text": "Reddit lead gen works but only if you're genuinely helpful first. Set up keyword alerts for your niche problems and show up with real answers. The lead comes naturally when people check your profile or ask for more help.\n\nThe moment you start dropping links or pitching in comments you'll get downvoted to hell and banned. Patience is everything here. Think of it as planting seeds, not harvesting. Some of my best clients came from Reddit comments I forgot I even wrote.",
          "score": 1,
          "created_utc": "2026-02-09 21:48:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4lry4n",
              "author": "Humble-Food8889",
              "text": "liked the analogy on planting seeds, not harvesting. and also agree on the key takeaway: patience ",
              "score": 1,
              "created_utc": "2026-02-10 12:35:57",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o4m701b",
              "author": "Only_Egg_6976",
              "text": "love the analogy, pretty much everyone here agrees with your take, thank you",
              "score": 1,
              "created_utc": "2026-02-10 14:05:21",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4j97m4",
          "author": "addictedtosoda",
          "text": "I just signed up for leadverse",
          "score": 1,
          "created_utc": "2026-02-10 01:01:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4k2tt4",
          "author": "New_Grape7181",
          "text": "I've been doing this for about 6 months now and it's surprisingly effective when done right.  \n  \nI use a mix of manual browsing and keyword alerts. The manual part matters more than people think because you catch context that tools miss. I spend 20 mins each morning scanning relevant subreddits where my audience hangs out.  \n  \nFor alerts, I tried F5bot but found it too noisy. Switched to a combination of Google Alerts with specific Reddit operators and just setting up custom feeds in my Reddit app for key terms. Nothing fancy, but it works.  \n  \nThe key thing I learned is timing and tone. If someone posted 2 days ago, they've likely moved on or already found a solution. I try to catch threads within the first few hours. And I focus on being genuinely helpful rather than pitching. Most of my comments don't mention my company at all, I'm just sharing what's worked from experience.  \n  \nLeads come indirectly. People check your profile, see your post history, and reach out if they're interested. I probably get 3-4 genuine conversations a month that turn into calls.  \n  \nWhat subreddits are you thinking of targeting?",
          "score": 1,
          "created_utc": "2026-02-10 03:59:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4k39qf",
          "author": "Hereemideem1a",
          "text": "Yes, but it’s slow and very manual. The only times it works for me are when I reply early to very specific problem posts with genuinely helpful context and no pitch.",
          "score": 1,
          "created_utc": "2026-02-10 04:02:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4m770u",
              "author": "Only_Egg_6976",
              "text": "of course you have to be helpful first, also have you used any of the tools I mentioned? wanting to get rid of doing everything manualy, like you say it's pretty slow overall.",
              "score": 1,
              "created_utc": "2026-02-10 14:06:25",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4l6yev",
          "author": "Kindly_Rate_2614",
          "text": "Yes I do.   \nJust manual keyword search daily.  \nReaching to prospect that requires a solution.\n\nBtw, I am doing this on other platform. Haven't reach the stage where automation is required yet.\n\n",
          "score": 1,
          "created_utc": "2026-02-10 09:39:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4m7dte",
              "author": "Only_Egg_6976",
              "text": "neither I for the automation but want to learn it earlier so I can be ready when it's needed",
              "score": 2,
              "created_utc": "2026-02-10 14:07:26",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4q6mvh",
                  "author": "Kindly_Rate_2614",
                  "text": "I find most automation required $$.\n\nI will stick it with manual process until I find one that works.",
                  "score": 1,
                  "created_utc": "2026-02-11 02:00:24",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4lhgi2",
          "author": "Soft-Dragonfruit6447",
          "text": "Yep. Reddit works if you’re genuinely helpful first. I just answer questions properly with no pitch. People who need more help usually check your profile and reach out.\n\nI’m picky about which threads I reply to. Fewer comments, better quality.",
          "score": 1,
          "created_utc": "2026-02-10 11:15:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ljv4j",
          "author": "Kooky-Ad-7084",
          "text": "We used an agency once that promised that they're going to be scheduling 10 meetings a month. They did outreach on Reddit for us. They had some sort of a bar to do this, some sort of adamation. Eventually we got three meetings from this. Across a period of 90 days.",
          "score": 1,
          "created_utc": "2026-02-10 11:36:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ln6xt",
          "author": "Right-Will8093",
          "text": "Yes, it's what I do for SaaS / service brands\n\nWe focus on jumping in conversations where someone's complaining about a relevant pain point or seeking insights \n\nBut you have to give real value, not sell\n\nIf you wanna do this, I'm not sure what softwares there are to monitor subreddits because we've built our own but whatever you use, prioritise making real connections\n\n",
          "score": 1,
          "created_utc": "2026-02-10 12:01:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4m7lnj",
          "author": "InevitableCamera-",
          "text": "Yep, but it’s very hands-on. I’ve only seen real leads come from replying early to very specific pain-point posts with genuinely useful advice and zero pitching, people DM you on their own if it resonates.",
          "score": 1,
          "created_utc": "2026-02-10 14:08:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4mhi67",
          "author": "Hefty-Affect5112",
          "text": "I’ve tried a few tools and Soclistener helped me spot posts where people need solutions instead of just blasting links. Worth checking.",
          "score": 1,
          "created_utc": "2026-02-10 15:00:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4oqda9",
          "author": "launchpanion",
          "text": "Hmm I'm mostly using for extra validation of user issues at the moment. ",
          "score": 1,
          "created_utc": "2026-02-10 21:17:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ou4ai",
          "author": "erickrealz",
          "text": "Keyword monitoring tools are useful but the real work is showing up consistently and being helpful without any agenda. The leads come to you when people check your profile after a good answer.\n\nDon't pitch anything for at least 2 weeks in any subreddit. Build karma, answer questions genuinely, become a recognizable name. I've closed five-figure deals from Reddit comments where I never once dropped a link. People DM you when they trust you. Trying to shortcut that process gets you shadowbanned damn fast.",
          "score": 1,
          "created_utc": "2026-02-10 21:34:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4pmlpz",
          "author": "Clarify_B2B",
          "text": "Great place to network!",
          "score": 1,
          "created_utc": "2026-02-11 00:02:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4r9v0u",
          "author": "Smartitstaff",
          "text": "It works if you play the long game answer niche questions genuinely and let people DM you.  \nMonitoring tools help, but credibility > cold pitching every time.",
          "score": 1,
          "created_utc": "2026-02-11 06:33:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4rgmkz",
          "author": "Scared_Yak5572",
          "text": "Yes, you can pick up real leads on Reddit. I use Syften mostly as a passive radar to catch threads I would have missed.\n\nMake your alerts very specific so you get fewer false positives. Only jump into threads where you can add something new, answer the question fully, and avoid pitching or dropping links.\n\nThis usually fails because people try to reply to everything or they pitch too early. Which subs or keywords are you tracking so far?",
          "score": 1,
          "created_utc": "2026-02-11 07:34:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4sojjv",
          "author": "Mysterious_Bet3560",
          "text": "Yes...but through Ads. Reddit Ads are pretty low cost and untapped in B2B because targeting is so hard to make the ROI worth it. Using Vector for that contact targeting. Much better to use a system that adds B2C ad ID's to my CRM contacts. ",
          "score": 1,
          "created_utc": "2026-02-11 13:34:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4xvxii",
          "author": "sh4ddai",
          "text": "Here's the simple playbook for Reddit marketing:\n\n\n\n1. Make a list of all relevant subreddits where your target audience hangs out.\n\n\n\n2. Participate in relevant conversations by adding value. In other words, post comments or replies that HELP people, above all else. \n\n\n\n3. Profit??? ;)\n\n\n\nHonestly though, that's all you gotta do. Just be real, be helpful, be authentic. And do it consistently, at scale. Be sure your Reddit profile has a link to your website in it so people can find your business. \n\n\n\nAsk ChatGPT to make a list of all relevant subs for your business. And there are tools that you can use to automatically find people talking about your target keywords so you can jump in and contribute in relevant convos. ChatGPT and other LLMs train on Reddit data, and they cite Reddit more than any other source. So the more you participate in relevant Reddit discussions, the more LLM citations and referrals you'll get, too. \n\n\n\nTLDR, just be a helpful person on Reddit in relevant communities. Be consistent, and you'll see results.",
          "score": 1,
          "created_utc": "2026-02-12 06:44:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4yiqt1",
          "author": "Own-Skin-354",
          "text": "I am quite new here and want to use it for lead gen. Would love to know from people who have already used it",
          "score": 1,
          "created_utc": "2026-02-12 10:24:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4z91w6",
          "author": "EgorSlovinskij",
          "text": "Yeah, but it’s slow and very relationship-based. Most leads come from just being helpful in comments over time, not from hunting them down.\n\nWhen people see you consistently giving solid advice, they’ll check your profile or reach out on their own. It’s more long-term than quick wins, but it does work.",
          "score": 1,
          "created_utc": "2026-02-12 13:40:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o50k8lj",
          "author": "techtom9",
          "text": "Very interesting! I didn't know there were tools for that; I thought it could only be done by hand.",
          "score": 1,
          "created_utc": "2026-02-12 17:32:48",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r59tdw",
      "title": "I manage outbound for 6 B2B clients. Here's my LinkedIn infrastructure setup that gets zero bans.",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1r59tdw/i_manage_outbound_for_6_b2b_clients_heres_my/",
      "author": "TheHealthlover101",
      "created_utc": "2026-02-15 08:49:41",
      "score": 36,
      "num_comments": 20,
      "upvote_ratio": 0.77,
      "text": "Been running LinkedIn outbound for B2B clients for about 2 years now. Learned everything the hard way.\n\n\n\nHere's what I've landed on for infrastructure:\n\n\n\nFirst thing — never run outbound from a client's personal LinkedIn. Ever. One ban and you've torched their professional network, their content history, everything. Not worth it.\n\n\n\nWhat works instead: dedicated accounts specifically for outbound. Separate from anyone's personal brand.\n\n\n\nThe setup for each client:\n\n\n\n\\- 3-5 LinkedIn accounts per client depending on volume needed\n\n\\- Each account warms up for 2-3 weeks before any outreach (10 connections/day, engage with content, join groups)\n\n\\- Connection requests capped at 20-25/day per account. LinkedIn's limit is technically higher but the sweet spot for avoiding flags is lower\n\n\\- Rotate messaging across accounts so no single account is sending the same template 50x\n\n\\- Residential proxies, one per account. Datacenter IPs get flagged instantly\n\n\\- Activity patterns that mimic real users — no blasting 50 requests at 3am\n\n\n\nThe results across my 6 clients last quarter: \\~800 connections/week total, 12-15% accept rate, zero bans in the last 6 months.\n\n\n\nThe biggest mistake I see people make is trying to scale volume on one account. LinkedIn's detection is behavior-based now. One account sending 100+ requests/day with templated messages is the fastest way to get restricted.\n\n\n\nScale horizontally (more accounts) not vertically (more volume per account).",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1r59tdw/i_manage_outbound_for_6_b2b_clients_heres_my/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o5h9mxt",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-15 08:49:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5hb5yh",
          "author": "Tiny-Celery4942",
          "text": "Managing multiple accounts is the only way to scale without losing a personal profile. I follow a similar horizontal path but focus heavily on the engagement side to keep those accounts safe. LinkedIn rewards real interactions over just sending requests.\n\nMy daily loop looks like this:\n\n1. Use a targeted feed to see only posts from my lead list.\n\n2. Leave 5 thoughtful comments to get my name known.\n\n3. Send a note referencing their specific post.\n\n4. Track every reply to ensure no one slips through.\n\nI use Depost AI to handle this workflow. it helps me manage the targeted feed, draft comments in my style, and track follow ups. It makes the process repeatable without the ban risk. Happy to share my tracking sheet if it helps.",
          "score": 3,
          "created_utc": "2026-02-15 09:04:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5hsjav",
          "author": "Mularkeyy",
          "text": "This is a solid setup and pretty much how you avoid getting nuked.\n\nBig yes on not risking the client’s personal account. One restriction and you’ve basically killed their brand presence overnight. Scaling horizontally is the only sustainable way, and keeping connection volume low per account is smart. Most people get banned because they push limits too early or run everything from one profile.\n\nOnly thing I’d add is making sure each account looks real. Profile completeness, light posting, and normal browsing patterns matter as much as proxies.\n\nOverall though, this is one of the more realistic LinkedIn infra breakdowns I’ve seen. We talk about setups like this on r/LeadGenSEA too if anyone wants more lead gen insights.",
          "score": 2,
          "created_utc": "2026-02-15 11:49:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5jopn8",
              "author": "johnstonmarketing1",
              "text": "I appreciate the idea. I will have to try this for my personal brand. I do business research and ai optimization posts on Facebook, Reddit and LinkedIn. How would I start multiple LinkedIn accounts that look legit?",
              "score": 0,
              "created_utc": "2026-02-15 18:14:28",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5ky8d6",
          "author": "Finners_GrowthStrat",
          "text": "Do you use tools or do it all manual? What tools?\n\nAlso the other profiles, are they fake people? How does that work? Or just managing more real people's accounts in the same business?\n\nThanks for the info so far, keen to learn more.",
          "score": 2,
          "created_utc": "2026-02-15 22:03:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5hl8k0",
          "author": "scrapingtryhard",
          "text": "This mirrors my setup almost exactly. The one per account proxy thing is non-negotiable — I learned that the hard way when two accounts shared an IP and both got restricted the same day.\n\nOnly thing I'd add is sticky sessions matter a lot for LinkedIn specifically. You want the same residential IP for the full session, not rotating every request. I've been using Proxyon for this and their sticky sessions hold well enough that LinkedIn doesn't flag the IP switching mid-session.\n\nAlso +1 on the horizontal scaling point. Ran into the same wall trying to push volume on fewer accounts. Way safer to just add more.",
          "score": 1,
          "created_utc": "2026-02-15 10:42:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5hpwls",
          "author": "rdem341",
          "text": "What's the reply rate?\n\nHow many converts to paying customers?",
          "score": 1,
          "created_utc": "2026-02-15 11:25:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5hyf3u",
              "author": "TheHealthlover101",
              "text": "25% , around 30-40% of those converrt to bookings",
              "score": 1,
              "created_utc": "2026-02-15 12:38:23",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5ie7ob",
          "author": "kawasakikas",
          "text": "How do you create credibility with LinkedIn outreach accounts with limited connections?",
          "score": 1,
          "created_utc": "2026-02-15 14:21:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5iicmn",
              "author": "TheHealthlover101",
              "text": "Who said they were limited? Who said you would lose credibility?\n\n\nIs everything oh so black and white?",
              "score": 1,
              "created_utc": "2026-02-15 14:44:50",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5jbjp4",
          "author": "[deleted]",
          "text": "[deleted]",
          "score": 1,
          "created_utc": "2026-02-15 17:10:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5jd8vh",
          "author": "shattariddim",
          "text": "Isn't setting up fake profiles violates the ToS?",
          "score": 1,
          "created_utc": "2026-02-15 17:18:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5jf6gc",
          "author": "sh4ddai",
          "text": "Doesn’t this all mean you need to set up fake LI profiles at scale? Or are you using some vendor who already does that?",
          "score": 1,
          "created_utc": "2026-02-15 17:27:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5likpm",
          "author": "alexboyd08",
          "text": "How many actual customers did your clients generate?",
          "score": 1,
          "created_utc": "2026-02-15 23:58:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5lszhc",
          "author": "EnDureXD3Ad",
          "text": "what do you use? meet alfred?",
          "score": 1,
          "created_utc": "2026-02-16 01:00:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5mvq40",
          "author": "New_Grape7181",
          "text": "I've been testing something similar but didn't realise residential proxies made that much difference. We got flagged twice last year using datacenter IPs before switching.  \n  \nOne thing I'd add is varying the connection request copy itself, not just rotating which account sends it. We noticed even with multiple accounts, if the message pattern looks identical (same length, same structure, same call-to-action positioning), it still triggers something. Now we write 4-5 different versions per campaign and rotate those too.  \n  \nAlso curious about your 12-15% accept rate. That feels low compared to what I'm seeing when we send personalised video messages instead of text. We're averaging around 22-24% accepts when the video references something specific about their company or a recent post they made.  \n  \nWhat type of messaging are you using in the connection requests?",
          "score": 1,
          "created_utc": "2026-02-16 05:23:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5n3xbv",
              "author": "Right-Influence-2460",
              "text": "Interesting setu .Im seeing more teams move from volumebased outbound to signalbased outreach instead fewer accounts, fewer messages, but triggered by intent (hiring, tech installs, public discussions, etc.).Lower volume, higher timing.Curious if you’ve tested that vs pure scale",
              "score": 1,
              "created_utc": "2026-02-16 06:31:18",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5hodni",
          "author": "HyHoang",
          "text": "Just do inbound man. Outbound is just too much effort for too little results.",
          "score": 0,
          "created_utc": "2026-02-15 11:11:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5hozxn",
              "author": "TheHealthlover101",
              "text": "inbound is literally months of posting before you even get a single lead, outbound is instant, also much more scaleable and guaranteed. it's only too much effort if you don't like to take some risks",
              "score": 2,
              "created_utc": "2026-02-15 11:17:27",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5hsmsr",
                  "author": "HyHoang",
                  "text": "How many meetings have you booked from these connections?",
                  "score": 2,
                  "created_utc": "2026-02-15 11:50:22",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1r1rbph",
      "title": "I don't think AI is coming for b2b marketing (for now)",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1r1rbph/i_dont_think_ai_is_coming_for_b2b_marketing_for/",
      "author": "Far-Panic3458",
      "created_utc": "2026-02-11 07:52:49",
      "score": 27,
      "num_comments": 54,
      "upvote_ratio": 0.69,
      "text": "I have been running my own marketing agency for quite a few years now and have been interacting with various clients. From startups to corporations, I have done marketing for them all. And I can hardly recall using the same strategy for more than 2 clients. Each one has their own flair, their own style or a “human touch” as i like to say that makes their marketing unique. Sure there are now tools like Blobr AI, LocalQ or Ryze AI that can automate reports but to say that they can replace our work is downplaying our role, undermining our experiences. How does AI train itself? By regurgitating information that humans have already done in the past. Hypothetically, if humans were to be replaced, there would come a point where AI wouldn’t be able to offer any sort of new or beneficial suggestions. And who would come to its aid then? So, the next time anyone says that marketing is going to be majorly automated, do enlighten them :)\n\nWhat do you think?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1r1rbph/i_dont_think_ai_is_coming_for_b2b_marketing_for/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o4rimtl",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-11 07:52:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4rlyni",
          "author": "ppcbetter_says",
          "text": "The main defeater for AI currently is hallucinations. \n\n95 times out of 100 AI is at least as good as an entry level employee with a little experience. The other 5 times it just makes stuff up in some way that would be embarrassing for a B2B company.\n\nYou can use AI for marketing, but if a skilled person doesn’t do a thorough debug, it will embarrass the client.\n\nI’d bet the result will be an endless cycle of clients buying AI that claims to not have this problem, customers finding the problem, client buys a new AI, same problem….",
          "score": 6,
          "created_utc": "2026-02-11 08:24:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4rrrcc",
              "author": "bhuvan3000",
              "text": "Hard disagree. I’ve been in B2B for several years and have recently been deeply involved with AI. Everything you mentioned can be solved with proper prompting, filters, and clear rules. We’re already running our entire outreach using AI and seeing exceptional results.",
              "score": 6,
              "created_utc": "2026-02-11 09:20:01",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4s211k",
                  "author": "Muted_Grass_9879",
                  "text": "Can you elaborate?\n\n",
                  "score": 3,
                  "created_utc": "2026-02-11 10:53:59",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o4tzwea",
                  "author": "dproma",
                  "text": "Exactly. I’ve been using AI for a year. It’s pretty scary yet exciting how far AI has come. Most people don’t realize how fast it’s advancing.\n\nYou still need to understand and proof the information for any edits. But the fact that it can write a business / marketing plan in seconds when it normally would take weeks and cost thousands is crazy. IMO it’s going to replace 60%+ of the workforce.",
                  "score": 2,
                  "created_utc": "2026-02-11 17:28:59",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o4xfg3a",
                  "author": "Shubh_srd",
                  "text": "I partially agree with you here. The key here is proper prompting. This requires knowing how to do it manually and then creating prompts to automate it. Most new age marketers think they can skip this part and directly use AI for everything marketing. I hate to break it to them that there’s no replacement for “experience“.\n\nAt least one of the two elements involved in this equation should have experience, in almost all cases neither the newbie has experience, and AI definitely doesn’t have it.\n\nIf one can’t troubleshoot what AI spits out, they’ll embarrass themselves in front of someone with experience and demoralise themselves.",
                  "score": 1,
                  "created_utc": "2026-02-12 04:30:10",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o4sne6y",
              "author": "Radiant-Security-347",
              "text": "it’s all in how you use it. people who get bad output start with bad input. ",
              "score": 2,
              "created_utc": "2026-02-11 13:27:51",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4ttwt5",
                  "author": "ppcbetter_says",
                  "text": "Yeah. People like you will be the salespeople who overpromise.\n\nWhat model do you think doesn’t hallucinate given that the top tier models from OpenAI Anthropic and xAI all do?",
                  "score": 2,
                  "created_utc": "2026-02-11 17:00:47",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o4xfnva",
                  "author": "Shubh_srd",
                  "text": "This 🔥",
                  "score": 1,
                  "created_utc": "2026-02-12 04:31:42",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o4wi8oz",
              "author": "iloveb2bleadgen",
              "text": "If your models are still hallucinating, it’s typically a you problem (respectfully) I haven’t seen a hallucination in months.",
              "score": 1,
              "created_utc": "2026-02-12 01:01:28",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4wldwy",
                  "author": "ppcbetter_says",
                  "text": "Unlikely.\n\nI just got one today drafting email copy. ChatGPT spit out a headline about like “stop torching your budget in 2023”.\n\nYou can “your prompt isn’t good enough” at me all you want, but when you say that some significant percentage of AI output does not contain hallucinated data you’re just demonstrating that you don’t really know the tech.",
                  "score": 1,
                  "created_utc": "2026-02-12 01:20:44",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4rp8z0",
          "author": "OkDependent6809",
          "text": "you're right but also missing where ai actually helps\n\nlike yeah it's not replacing strategy or understanding why customers care. that needs real conversations.\n\nbut the tedious stuff? writing briefs, analyzing data, drafting test emails? if ai handles that so i can focus on actual strategy, great.\n\nthe real work is still talking to customers. getting on calls, understanding their problems. no ai is doing that. \n\nso ai isn't replacing anyone but it's changing what we waste time on. which is good because reports suck lol",
          "score": 6,
          "created_utc": "2026-02-11 08:56:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4sn7i8",
              "author": "Radiant-Security-347",
              "text": "I’m literally doing a workshop on this very subject showing how top consultants use AI - not for writing social posts but for analysis, pattern recognition, synthesis, correlation, data clean up - all the grunt work. \n\nyou are exactly right. ",
              "score": 3,
              "created_utc": "2026-02-11 13:26:46",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4rn0ib",
          "author": "AnywayMarketing",
          "text": "It works but not in a way \"click-and-forget\"",
          "score": 4,
          "created_utc": "2026-02-11 08:34:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5j2pp1",
              "author": "Royal_Machine_9524",
              "text": "Yes agreed ",
              "score": 1,
              "created_utc": "2026-02-15 16:27:31",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4wtem0",
          "author": "Wise-Trouble-653",
          "text": "You’re right that AI isn’t replacing competent B2B marketers right now.\n\nEspecially in agency work where every client has different internal politics, risk tolerance, sales cycles, brand voice, and weird constraints. That “human touch” you’re talking about is usually less about creativity and more about judgment. AI doesn’t sit in tense board meetings. It doesn’t sense when a founder is insecure about positioning. It doesn’t read between the lines on why a strategy will fail culturally even if it works on paper.\n\nThat part isn’t getting automated anytime soon.\n\nBut here’s the nuance: AI doesn’t need to replace your strategy to compress your edge.\n\nIt’s already replacing average execution. It’s accelerating research. It’s leveling the floor. That means what used to feel like differentiation (clean messaging, solid funnels, decent ads) becomes baseline faster.\n\nSo maybe the real question isn’t “Will AI replace B2B marketing?”\n\nMaybe it’s “Which parts of B2B marketing become commodity, and which parts become more valuable because AI exists?”\n\nMy bet is strategic thinking and category creation go up in value. Tactics get cheaper.\n\nhave you noticed clients expecting more strategic depth now that tools make execution faster?",
          "score": 2,
          "created_utc": "2026-02-12 02:09:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4wyles",
              "author": "yngbld5",
              "text": "Well said",
              "score": 1,
              "created_utc": "2026-02-12 02:40:24",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o51h5qr",
                  "author": "Wise-Trouble-653",
                  "text": "Thank you!",
                  "score": 1,
                  "created_utc": "2026-02-12 20:08:09",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o54b1ln",
          "author": "vermaharsh321",
          "text": "I think you’re right about the “human touch” part, especially in B2B where context, politics, and relationships matter a lot. But I don’t see AI as a replacement, more like leverage. The agencies that win might be the ones using AI to speed up research, testing angles, and reporting, and then layering real strategy and creativity on top.\n\nMaybe it’s less AI vs marketers and more AI augmented marketers vs everyone else. Curious, have you started using it anywhere in your workflow yet?",
          "score": 2,
          "created_utc": "2026-02-13 06:04:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4rrrzk",
          "author": "bhuvan3000",
          "text": "Hard disagree. I’ve been in B2B for several years and have recently been deeply involved with AI. Everything you mentioned can be solved with proper prompting, filters, and clear rules. We’re already running our entire outreach using AI and seeing exceptional results.",
          "score": 1,
          "created_utc": "2026-02-11 09:20:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4rsotr",
              "author": "Effective-Cow-620",
              "text": "Would like to connect with you and need some services for my product",
              "score": 2,
              "created_utc": "2026-02-11 09:28:48",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4sukp2",
                  "author": "bhuvan3000",
                  "text": "Hey, Would love to help.\n\nCheck out youtwinn.com to see what we do.\n\nHappy to jump on and walk you through a demo if it looks interesting. You can book a call directly through the website.",
                  "score": 1,
                  "created_utc": "2026-02-11 14:07:55",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4rsmo9",
          "author": "Effective-Cow-620",
          "text": "Would like to connect with you.. I need some guidance and services for my product",
          "score": 1,
          "created_utc": "2026-02-11 09:28:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4rwffn",
          "author": "PuzzleheadedBag3608",
          "text": "Good luck!",
          "score": 1,
          "created_utc": "2026-02-11 10:03:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4sadag",
          "author": "whatafounder",
          "text": "Yeah, I think the play is in understanding where human intervention can make a difference. For instance we make explainer video and demos for saas and enterprise products at WhatAStory and there are so many ways in which ai has disrupted the video production industry. Scripts, visuals, motion-design and edit all can be generated online, but the thing is you need humans to appeal to humans. A script supervisor to know if the emotions are really being paid attention to, a visual artist to know the right from wrong in terms of what kind of visuals can work, a motion designer to stitch it all together cohesively to differentiate your video from mere slop. None of the core skills have changed, ai has just pushed us to upgrade and get better at them, otherwise the industry just keeps on producing generic work. ",
          "score": 1,
          "created_utc": "2026-02-11 12:02:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4sho91",
          "author": "WarAromatic474",
          "text": "Maybe AI isn't replacing B2B but definitely parts of it. Things like strategy, positioning, customer insights all need humans. But reporting, drafts, data crunching and first pass outreach could move faster with AI. \n\nThe risk isn't that AI might take our jobs but charging for work that AI can do now faster and cheaper. ",
          "score": 1,
          "created_utc": "2026-02-11 12:52:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4so6g2",
          "author": "Mysterious_Bet3560",
          "text": "I think AI will enhance marketers, not take over their role. Similar to how Cursor has allowed an average Eng. to become a 10x engineer. AI will be the assistant to the CMO (and might take over agency work), but will allow the CMO to be a superpower. ",
          "score": 1,
          "created_utc": "2026-02-11 13:32:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4t3idz",
          "author": "Mularkeyy",
          "text": "Yeah I mostly agree with this. AI can speed up parts of the work, but it’s not replacing B2B marketing anytime soon.\n\nThe real value in B2B isn’t writing a post or generating a report, it’s understanding the market, positioning the offer, knowing what the buyer actually cares about, and making smart tradeoffs. AI can help execute faster, but it still needs someone to decide what matters and what to say.\n\nIf anything, AI is replacing the low-effort stuff. The strategy, judgment, and messaging that actually converts is still very human.",
          "score": 1,
          "created_utc": "2026-02-11 14:55:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4t9uza",
          "author": "mveela",
          "text": "What’s this you posted this on digital marketing sub too. Word per word",
          "score": 1,
          "created_utc": "2026-02-11 15:26:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4torbe",
              "author": "AlsonaTool",
              "text": "It’s marketing. 🙂",
              "score": 1,
              "created_utc": "2026-02-11 16:36:46",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4twdnl",
          "author": "anhln111",
          "text": "It already came and there are lots of movements now. On operation side, lots of use case you can do with AI (build system for content research, training it to write with your brand voice, personalized outreach email based on intent, etc...scaping and managing ads, creating video with AI as well). I dont know why you say AI is not coming for B2B. In my opinion, it is and the most powerful thing is combing AI with human in the loop.",
          "score": 1,
          "created_utc": "2026-02-11 17:12:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4up1li",
          "author": "Embarrassed_Scene962",
          "text": "Humans arent being replaced, the humans that dont use ai are being /will be replaced by the ones who are… simple",
          "score": 1,
          "created_utc": "2026-02-11 19:25:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4uzq3b",
          "author": "MarcoMusings",
          "text": "I’m seeing serious commoditisation in certain areas. Events are in full force - most I attend are having record attendances this year. People clearly still want to meet people, perhaps even more.",
          "score": 1,
          "created_utc": "2026-02-11 20:17:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4viltv",
          "author": "SmoothAssistant3190",
          "text": "As much as I believe, marketing and sales can never be fully replaced by AI. \nHowever, in other domains it still needs lot of work.\nAI, sometimes is helpful by speeding up the work but its quality is still compromised in most of the cases and time.",
          "score": 1,
          "created_utc": "2026-02-11 21:48:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4vpzpw",
          "author": "Nat_from_Doodle",
          "text": "I’d frame it less as “AI vs marketers” and more as “AI vs average output.”\n\nIf your value was execution speed or basic content production, yeah, pressure is coming.\n\nIf your value is understanding messy org dynamics, niche audiences, internal politics, positioning that’s still very human territory.",
          "score": 1,
          "created_utc": "2026-02-11 22:24:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4wyjvp",
          "author": "yngbld5",
          "text": "“I can hardly recall using the same strategy for more than 2 clients.”  Truth. Marketing is not a cookie-cutter stencil. Each business and market are different. Nuance is vital and clarity wins the day. This is why “best practices”, blindly applied, fail.",
          "score": 1,
          "created_utc": "2026-02-12 02:40:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4xhr1n",
          "author": "Striking_Day_9664",
          "text": "AI is great at speeding up execution (drafts, reports, summaries, even first-pass strategy ideas), but B2B marketing is so tied to positioning, internal politics, sales alignment, and nuanced buyer psychology that it’s hard to fully automate. Most of the real leverage comes from understanding this specific founder, this sales cycle, this market dynamic.\n\nI’ve seen AI work best as a multiplier, not a replacement. It makes good marketers faster. But it doesn’t replace taste, judgment, or the ability to read between the lines on a client call.\n\nIf anything, the bar just shifts. The generic stuff gets automated, and the strategic layer becomes even more valuable.",
          "score": 1,
          "created_utc": "2026-02-12 04:47:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4xq1ib",
          "author": "Affectionate_Lab9365",
          "text": "I dont think AI is replacing B2B marketing. I think its compressing mediocre execution.If your value was writing good enough content or building basic funnels, yes thats under pressure.But understanding buyer intent, timing, internal politics, category positioning thats still human.The real shift isnt AI replacing marketers. Its marketers who use AI replacing those who dont",
          "score": 1,
          "created_utc": "2026-02-12 05:52:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ymo5b",
          "author": "Admirable_Charity513",
          "text": "using AI has made my life simpler TBH in conversations or to be clear in understanding what another party is saying because many times the communication is harder from other party side so it can really help you to understand context",
          "score": 1,
          "created_utc": "2026-02-12 11:00:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4zg2vf",
          "author": "murtuza78",
          "text": "Totally feel this. AI is great for shaving off grunt work but actual marketing needs real people who can read the room and switch gears when stuff gets weird or unexpected. Clients want that spark or gut instinct that an algorithm just doesn't get. Not worried about being replaced for a long time unless robots learn how to make awkward small talk and salvage a campaign gone sideways.",
          "score": 1,
          "created_utc": "2026-02-12 14:19:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o535qy0",
          "author": "Aislot",
          "text": "i kind of agree but with a twist ai isn’t coming for b2b marketing as a whole it’s coming for the repetitive layers reporting drafts first pass research campaign setup the human edge is still in positioning nuance politics inside the client org and reading the room on strategy no model fully understands that yet but ignoring ai is risky too agencies that use it to move faster and think deeper will win the ones defending manual work as identity will struggle it’s less replacement more compression the bar just moved up curious how much ai you’re already using behind the scenes without calling it ai",
          "score": 1,
          "created_utc": "2026-02-13 01:26:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o53al1z",
          "author": "MrPS01",
          "text": "Ai is exploding yet to see more in coming years",
          "score": 1,
          "created_utc": "2026-02-13 01:56:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o57v3uz",
          "author": "Zealousideal-Job6344",
          "text": "While I don’t disagree with you, there is definitely big impact of Ai for B2B marketing. We are a b2b marketing studio working with growth stage companies. A large part of our workflow is automated and leverages AI. This allows us to provide enterprise level support for workflow and project management, quality assurance and creative development. Not only is allows us to deliver this via small teams, it enables us to do more for the customer. What works for us is the customer management and planning is done by senior marketing professionals. Hence planning and marketing alignment to business goals is still human, but our reliance on graphic designers, data analysts, CRM experts has reduced considerably. So yes Ai does impact B2B marketing as well",
          "score": 1,
          "created_utc": "2026-02-13 19:36:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5nd1ew",
          "author": "Slight_Tutor1790",
          "text": "I get what you are saying about the human touch, but I also think the bigger shift is in expectations. Clients now assume faster turnaround, more personalization, and more data behind every decision because AI exists. So even if it does not replace B2B marketers, it definitely raises the bar. The role might become less about producing assets and more about making better judgment calls on positioning, tradeoffs, and long term brand direction.",
          "score": 1,
          "created_utc": "2026-02-16 07:54:00",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r02m3o",
      "title": "My friend spent $2,000 on Reddit Ads for his SaaS. Here is the honest ROI breakdown.",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1r02m3o/my_friend_spent_2000_on_reddit_ads_for_his_saas/",
      "author": "aashrun",
      "created_utc": "2026-02-09 12:13:35",
      "score": 27,
      "num_comments": 28,
      "upvote_ratio": 0.91,
      "text": "Everyone says \"Reddit Ads are cheap.\"\n\nEveryone also says \"Redditors hate ads.\"\n\nSo I decided to talk to this guy who burnt $2,000 to find out which is true.\n\nHere is the exact breakdown of his campaign for a B2B SaaS tool.\n\n# The Campaign Setup\n\n* **Budget:** $2,000\n* **Duration:** 30 days\n* **Targeting:** Subreddits (r/marketing, r/entrepreneur, r/sales)\n* **Creative:** 3 variations (Meme style, \"Native\" text style, Standard banner)\n\n# The Metrics (The Good, The Bad, The Ugly)\n\n**1. Impressions (The Good)**\n\n* **CPM:** $4.50 (Cheaper than LinkedIn's $30+ CPM)\n* **Total Impressions:** \\~440k\n* *verdict:* Reaching people on Reddit is incredibly cheap.\n\n**2. Clicks (The Bad)**\n\n* **CPC:** $0.85\n* **CTR:** 0.52%\n* *verdict:* Getting clicks isn't hard, but it's not \"high intent.\" A lot of fat-finger clicks or curiosity clicks.\n\n**3. Conversion (The Ugly)**\n\n* **Signups:** 14\n* **CAC:** $142.85\n* **Paying Customers:** 1\n* **ROI:** \\-85%\n\n# The \"Oh Sh*t\" Realization 💡\n\nWhile the ads were running, he spent 20 minutes a day manually commenting on threads in the *same* subreddits.\n\n* **Cost:** $0\n* **Time:** 10 hours total\n* **Signups:** 42\n* **Paying Customers:** 6\n\n**The Difference?**\n\n**Trust.**\n\nOn Reddit, an ad is an interruption.\n\nA comment is a contribution.\n\nWhen he tried to \"scale\" with ads, he lost the one thing that made Reddit work: **Authenticity.**\n\n# Key Lessons for SaaS Founders\n\n1. **Banner Blindness is Real:** Redditors are pro-level scrollers. Unless your ad looks *exactly* like a post, they skip it.\n2. **Comments > Creatives:** The \"real\" ad slot on Reddit isn't the feed. It's the comment section. That's where decisions are made.\n3. **Intent Mining vs. Interruption:** Ads target *demographics* (people interested in marketing). Comments target *intent* (people asking \"how do I do marketing?\"). The latter converts 10x better.\n\n# Conclusion\n\nIf you have a venture budget and need brand awareness? Sure, Reddit Ads are cheap eyeballs. If you are bootstrapping and need **customers**? Keep your wallet closed. Open the comment section instead.\n\n\n\n**Has anyone else cracked the code on Reddit Ads for B2B? Or is it just a graveyard for ad spend?**",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1r02m3o/my_friend_spent_2000_on_reddit_ads_for_his_saas/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o4f5yia",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-09 12:13:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ig4kq",
          "author": "Kamel_Ben_Yacoub",
          "text": "Most advertisers don't understand placements on Reddit ads. If you want to get results, this starts with understanding how targeting and placement works.\n\nAudience Targeting:\n\n* Communities: Highly relevant targeting if you're targeting qualified communities because they are native users.\n* Keyword: Traffic could be from non-native Reddit users (e.g., Google search), so depending on the keywords used, the quality could be not as relevant as communities.\n* Interest: Too broad, not worth testing it.\n\nAds Placement:\n\n* Conversation: Conversations attract both native and non-native Reddit users who find posts through referrals from organic search and AI suggestions. These platforms don't link people to Reddit communities. They link people to the exact posts that answer their question.\n* Feed (the home and community feeds with various posts): Mostly native users and overall ads are more visible than conversation.\n\nConversation Ads look quite small and traffic is not as relevant as feed ads placement for communities. I usually like to use this placement for remarketing audiences or keyword targeting to be sure I have more qualified traffic. When people search on Google and land on Reddit threads, intent is higher so Conversation ads can work better.\n\n**If you enable both placements, most of your budget flows to Conversation Ads because the CPM is cheaper.**\n\nOur go-to setup:\n\n* Communities with Feed placement only.\n* Keyword targeting or Remarketing with Conversation ads placement.",
          "score": 5,
          "created_utc": "2026-02-09 22:22:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4gjjpv",
          "author": "techmars1996",
          "text": "I got the exact same results with the same amount of money.",
          "score": 3,
          "created_utc": "2026-02-09 16:49:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4uem55",
              "author": "aashrun",
              "text": "Guess who's on the same boat",
              "score": 1,
              "created_utc": "2026-02-11 18:37:16",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4ibdxk",
          "author": "AffableSparsh",
          "text": "Really well put.",
          "score": 2,
          "created_utc": "2026-02-09 21:58:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4uen7m",
              "author": "aashrun",
              "text": "Thanks Sparsh",
              "score": 1,
              "created_utc": "2026-02-11 18:37:24",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4kwmg2",
          "author": "kkgohel",
          "text": "Awesome. I didn't try reddit ads. But interested into.",
          "score": 2,
          "created_utc": "2026-02-10 07:58:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4uer82",
              "author": "aashrun",
              "text": "Divert your interest into organic reddit traffic. Will thank me later.",
              "score": 2,
              "created_utc": "2026-02-11 18:37:55",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4n5p3z",
          "author": "OverAgentRoger",
          "text": "You give me an idea for an experiment.\n\nI think the reason why Reddit ads are treated so terrible is because of the ad format.\n\nAd are produced as ads but what if they were produced as conversations?\n\nNo Images but instead of posts that are relevant to the subreddit.\n\nTherefore, I am going to experiment with this by customizing my Reddit ads as conversation on a per-subreddit basis so that people will comment and engage with it.\n\nMy hypothesis: \"Reddit Ads are terrible because of the format, targeting, community targeting, and content associations.\n\nIf this experiment works, we should have people who are interested in the product.\n\n\nThe goal would be to generate posts.",
          "score": 2,
          "created_utc": "2026-02-10 16:55:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4src2e",
          "author": "EnDureXD3Ad",
          "text": "I consider myself one of the most seasoned when it comes to Reddit ads.  \nWith my previous company, we spent around $3k/month. \n\nWe targeted developers for hackathons.\n\nI can't help but agree with this post. Bottomline is that reddit ads are CHEAP but they do not convert.   \nTo the average user, it is an interruption to their experience.\n\nIts very difficult to get right. Happy to be proven wrong.",
          "score": 2,
          "created_utc": "2026-02-11 13:50:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4uf7kv",
              "author": "aashrun",
              "text": "For obvious reasons, Reddit is a QnA platform. Putting in ads here seems foolish.",
              "score": 1,
              "created_utc": "2026-02-11 18:40:01",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4vorpw",
                  "author": "EnDureXD3Ad",
                  "text": "Couldn't agree more",
                  "score": 1,
                  "created_utc": "2026-02-11 22:18:08",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4tze09",
          "author": "More-Car9727",
          "text": "This is such a golden nugget",
          "score": 2,
          "created_utc": "2026-02-11 17:26:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ueh8l",
              "author": "aashrun",
              "text": "Appreciate the appreciation! :D",
              "score": 1,
              "created_utc": "2026-02-11 18:36:38",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4qb82v",
          "author": "Dazzling-Principle45",
          "text": "Nice breakdown 👏",
          "score": 1,
          "created_utc": "2026-02-11 02:27:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4va920",
          "author": "Due_Cockroach_4184",
          "text": "Had no idea. I was really thinking about spending some money here but this ROI is the worst I have seen.\n\nThanks.",
          "score": 1,
          "created_utc": "2026-02-11 21:08:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4vrei3",
          "author": "Ok-Wealth-3171",
          "text": "cool !  \nso the conclusion here > reddit ads ❌ reddit comments ✅",
          "score": 1,
          "created_utc": "2026-02-11 22:31:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4zdapb",
          "author": "hackfleisch069",
          "text": "How did he comment? With a company account or with a normal account?",
          "score": 1,
          "created_utc": "2026-02-12 14:04:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o54391s",
          "author": "NicolasChapa",
          "text": "sure",
          "score": 1,
          "created_utc": "2026-02-13 05:04:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5g47m8",
          "author": "Zealousideal-Job6344",
          "text": "Not sure what your friend was selling but I don’t feel surprised. Let’s breakdown how companies buy. The purchase decision is typically taken by the finance and/or tech guy who are typically more familiar with LinkedIn or You Tube. Many of them don’t trust information from reditt ( not saying they are right, but that is how it is). So if the developer community clicks on the ad it may not lead to purchase. The burn on LinkedIn is high but then so are the buyers. The challenge is that LinkedIn has become like Facebook and most buyers don’t respond any more.",
          "score": 1,
          "created_utc": "2026-02-15 03:00:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5i5vlv",
          "author": "otwtocmo",
          "text": "this is a lovely breakdown. thank you!",
          "score": 1,
          "created_utc": "2026-02-15 13:31:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5iaj8q",
          "author": "Mysterious_Bet3560",
          "text": "Have you tried using Vector? if you can enrich your CRM contacts with ad identifiers that b2c channels need, you can open up many more options in targeting. ",
          "score": 1,
          "created_utc": "2026-02-15 13:59:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4lz4xz",
          "author": "Abhi_deep",
          "text": "Honestly Reddit Ads for B2B feel like tossing cash into a wishing well if you’re chasing signups over awareness. People here scroll past banners like it’s a reflex and anyone who actually stops is probably just curious not committed. Real traction seems to come from showing up in threads as a human and actually being useful. Feels less like marketing and more like earning trust one comment at a time.",
          "score": 1,
          "created_utc": "2026-02-10 13:21:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4uevp8",
              "author": "aashrun",
              "text": "Exactly what I spoke about. 😂",
              "score": 1,
              "created_utc": "2026-02-11 18:38:30",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r37cg2",
      "title": "Agency owners: what tool actually helped you land more clients this year?",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1r37cg2/agency_owners_what_tool_actually_helped_you_land/",
      "author": "Muhammadusamablogger",
      "created_utc": "2026-02-12 22:19:02",
      "score": 24,
      "num_comments": 48,
      "upvote_ratio": 0.93,
      "text": "I'm trying to separate the best from the noise here. We've tested plenty of tools that promise more leads, better outreach, or AI-driven sales, and most of them ended up being interchangeable once the novelty wore off.\n\n\n\nI'm specifically looking for examples where a tool or platform had a clear impact on acquiring new clients. Not theoretical value or it looks good in demos, but something that actually contributed to deals moving through the pipeline and closing.\n\n\n\nI'm open to all approaches, whether that's outbound, inbound, marketplaces, or workflow tools, but I'm most interested in what helped agencies scale acquisition without simply throwing more people at the problem. If something failed or was a waste of time, that's useful too.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1r37cg2/agency_owners_what_tool_actually_helped_you_land/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o528jsa",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-12 22:19:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o55hfn8",
          "author": "Right-Will8093",
          "text": "Reddit and online communities has been a goldmine for us \n\nBut the biggest thing is setting up a system to actively monitor posts and comments and rank them for intent \n\nBut you get more responses and conversations that way because you’re joining in on an active conversation instead of spamming someone’s inbox with cold emails \n\nor burning through money to jus spam ads",
          "score": 5,
          "created_utc": "2026-02-13 12:19:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5ld07s",
              "author": "SouhaibUSA",
              "text": "Please can you help me with list of stacks your using for this.",
              "score": 1,
              "created_utc": "2026-02-15 23:25:29",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5nhoii",
                  "author": "Right-Will8093",
                  "text": "Sure, let’s connect in DM",
                  "score": 1,
                  "created_utc": "2026-02-16 08:37:52",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o58v44h",
          "author": "Character_Cable_1531",
          "text": "I don't use many tools, I just try and have a strong repeatable structure. I mainly do outbound through cold emailing and linkedin. I have a really tight, strong ICP and a domain with good deliverability. Then, I gather leads through Linkedin through job postings as this shows some intent of a need of a specific skill/expertise.  I then research each lead a bit and reference something specific in my opening email so it doesn't feel spammy, and I don't pitch at all in my opening email - I just ask a question about their business to create conversation.",
          "score": 2,
          "created_utc": "2026-02-13 22:36:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o52hk68",
          "author": "Fiestaman",
          "text": "The biggest shift for us wasn't finding a tool that writes better emails, but one that fixed our targeting. Most AI outreach tools just scrape LinkedIn for surface-level fluff, but we started scaling once we focused on analyzing a prospect's actual website to find the gap between what they have and what we offer. I ended up building ColdGenius AI to automate that specific process of identifying an ICP and writing copy based on business needs rather than just job titles. If you can show a lead you understand their specific technical or marketing hurdles in the first two sentences, your reply rates will jump because you are solving a problem instead of just pitching a service.",
          "score": 2,
          "created_utc": "2026-02-12 23:06:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o53bxz8",
              "author": "Barnegat16",
              "text": "You said fluff",
              "score": 2,
              "created_utc": "2026-02-13 02:04:40",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o53inw6",
                  "author": "Fiestaman",
                  "text": "What I was trying to convey is that analyzing your prospect's website and noting where their gap is compared to competitors, then messaging them and letting them know how you can fill that gap-- is a successful personalization strategy. It's what I use. Maybe I'm not conveying that right.",
                  "score": 1,
                  "created_utc": "2026-02-13 02:45:57",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o52am9j",
          "author": "Mommyjobs",
          "text": "The biggest difference for us wasn't lead volume, it was response time and closing. Tools that made it harder to forget follow-up did more for our revenue than anything else.",
          "score": 1,
          "created_utc": "2026-02-12 22:29:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o52b19r",
          "author": "BlueDolphinCute",
          "text": "Most tools don't fail because they're bad they fail because teams don't change how they work after adopting them.",
          "score": 1,
          "created_utc": "2026-02-12 22:31:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o52c0e1",
          "author": "sweetcake_1530",
          "text": "Cold outbound still works, but it's brutal unless you have systems in place to handle the potential influx. We saw better results when conversations started warmer, even if the total lead count was lower.",
          "score": 1,
          "created_utc": "2026-02-12 22:36:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o52t9tr",
          "author": "KnightXtrix",
          "text": "LinkedIn",
          "score": 1,
          "created_utc": "2026-02-13 00:12:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o53aazf",
          "author": "Late-Acanthaceae-950",
          "text": "LinkedIn lol. Just building your brand, providing actual value and outreaching + connecting with potential clients. ",
          "score": 1,
          "created_utc": "2026-02-13 01:54:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o53n8th",
          "author": "Raidrew",
          "text": "We smash B2B with META ads. Creatives are king for us. We will do nothing except the meta ads first. The client get results and stick with us. Then, they are stupid and they can’t sell but is not our problem lol",
          "score": 1,
          "created_utc": "2026-02-13 03:14:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o53no88",
          "author": "ObjectiveFerret9017",
          "text": "Honestly, the biggest needle-mover was anything that made outreach and follow up brain-dead simple for the team. Automation helped get messages out quicker but the real win was tools that made it nearly impossible to let warm leads slip through the cracks. Lead gen feels the same across most platforms but if you can keep your pipeline moving and not drop the ball on timing, you close more without needing to hire extra hands. Most of the flashy promise-everything stuff just ended up being extra steps.",
          "score": 1,
          "created_utc": "2026-02-13 03:17:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5435jl",
          "author": "sculptsocial",
          "text": "This year? The year has just begun 😅 Landing clients isn't typically a tech problem or solution. I wonder if you're throwing too much at the wall?\n\nWhere are you in your business stage, and what's your definition of scale look like?\n\nYou can build a substantial business with just 1-2 channels dialed in. Our agency focuses on enterprise, for instance, which is 95% inbound (RFPs from SEO/AEO) and referrals.",
          "score": 1,
          "created_utc": "2026-02-13 05:03:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o54b45q",
          "author": "supriya_l89",
          "text": "The most significant benefits came from execution tools which generated more leads for us. The combination of a reliable CRM system which automated follow-ups and provided pipeline visibility together with an outbound stack that included personalized email and LinkedIn workflows allowed us to advance deals more efficiently. A case-study driven landing page builder with scheduling tool on the inbound side showed unexpected success in generating conversions. The most unproductive resource for our organization turned out to be attractive AI outreach technologies which failed to deliver valuable dialogue. The tools which provide continuous process support are more valuable than the tools which claim to deliver miraculous outcomes.",
          "score": 1,
          "created_utc": "2026-02-13 06:05:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o54ckwv",
          "author": "svlease0h1",
          "text": "we stopped chasing new lead gen tools and started showing prospects something practical instead. one example was sharing a quick interactive assessment that calculated marketing readiness for agencies. people spent a few minutes with it and conversations felt easier afterward. interactive content from outgrow worked well as a proof piece during outreach.",
          "score": 1,
          "created_utc": "2026-02-13 06:17:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o54p5v1",
          "author": "corwinsword",
          "text": "content marketing: linkedin / x / substack / reddit",
          "score": 1,
          "created_utc": "2026-02-13 08:09:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o54qncr",
          "author": "AleksandrMovchan",
          "text": "Your audience is where your actual clients hang out. There is zero point pitching SEO in SEO communities-that’s a total red ocean. It makes way more sense to go into niche communities where SMB owners talk shop and vent about their problems.\n\nBut you can't just shove a full-service package down their throats immediately. The ideal approach:\n\n\\- Give actionable advice or a roadmap they can execute themselves (DIY).\n\n\\- Network - exchange opinions and genuine value.\n\n\\- Once you've built some rapport in the community, you can drop a soft offer (like a free audit, a marketing roadmap, or a specific, high-impact one-off task).\n\nMy point is: it’s about *where* you are and *how* you frame it (help, don't sell). It fundamentally shifts your marketing - you feel it in your gut. The logic moves from 'quick cash' to long-term partnership and mutual understanding.\n\nCall it business empathy, I guess :)))",
          "score": 1,
          "created_utc": "2026-02-13 08:23:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o555u21",
          "author": "Embarrassed_Scene962",
          "text": "Reddit app and linkedin",
          "score": 1,
          "created_utc": "2026-02-13 10:46:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5595mr",
          "author": "Slight_Tutor1790",
          "text": "I think a lot of people are focusing on tools when the real leverage might be packaging. The agencies I see landing better clients are not using some secret platform, they just productized a clear outcome with tight positioning. When the offer is specific and easy to understand, even basic outreach works better because prospects know exactly why they should reply. Tools help with efficiency, but clarity in what you sell probably moves the needle more.",
          "score": 1,
          "created_utc": "2026-02-13 11:15:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o55cm8u",
          "author": "Clarify_B2B",
          "text": "Sales Navigator",
          "score": 1,
          "created_utc": "2026-02-13 11:43:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o565ek8",
          "author": "Techenthusiast_07",
          "text": "Ai appointment booking software that handles most manual tasks automatically with less human interaction.",
          "score": 1,
          "created_utc": "2026-02-13 14:38:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5698d5",
          "author": "KissyyyDoll",
          "text": "tbh tried a few “AI sales” tools and most were meh. what actually helped was automating follow-ups, saved a ton of headache.",
          "score": 1,
          "created_utc": "2026-02-13 14:58:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o56e0ie",
          "author": "TheGONetwork",
          "text": "We’re new to the Reddit space… but this is exactly the problem we’re built around.\n\nThe GO Network connects agencies directly to brands with live briefs, prioritising alignment over volume. No spray-and-pray outreach, no bloated prospect lists. Just qualified introductions designed to move deals forward.\n\nWith over 900 brand-agency partnerships formed over 8 years, we know a thing or two. \n\nHappy to share how it works if useful.",
          "score": 1,
          "created_utc": "2026-02-13 15:21:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o56tlgc",
          "author": "Dull_Bill990",
          "text": "Building agentic workflow focused on looking for high intent leads based on our ICP, scoring them and creating cold outreach copy with freebies.",
          "score": 1,
          "created_utc": "2026-02-13 16:35:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5aoqc8",
              "author": "Any-Rooster2350",
              "text": "How does this work? I’d be up for being a beta tester :)",
              "score": 1,
              "created_utc": "2026-02-14 05:45:14",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o56xw9q",
          "author": "Wrong-Finish7655",
          "text": "Outbound works when you feed it good data — fancy AI messaging didn’t move the needle much for us. We pull lists from LeadCourt with tight role/industry filters, then verify emails/phones before sequencing; that’s booked real meetings that turned into clients, not just clicks or opens. Other things that *didn’t* help much: expensive “lead engine” platforms with recycled data and tools that promise AI will write your way into deals.",
          "score": 1,
          "created_utc": "2026-02-13 16:56:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o574yzj",
          "author": "Intrepid_Boss9449",
          "text": "SocListener helped me find clients by spotting sales posts on Reddit that I wouldn’t have seen otherwise. It auto-generates comments and DMs that feel personal enough to get replies. If you want to try a different angle on outreach without adding more people, it’s worth testing.",
          "score": 1,
          "created_utc": "2026-02-13 17:30:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o57m0bn",
          "author": "Keyqlix",
          "text": "reddit has helped us the most!\n\n",
          "score": 1,
          "created_utc": "2026-02-13 18:52:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o58rsvn",
          "author": "SignificanceBusy2136",
          "text": "LinkedIn, Techsalerator and their business datasets, and Lusha are some could players for attracting new clients. LinkedIn especially is one of the kings for b2b with it's current meta.",
          "score": 1,
          "created_utc": "2026-02-13 22:19:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5a1qqf",
          "author": "InnerBuilding7949",
          "text": "Has anyone ever succeeded with no-tool strategy? I have been doing market research, outreach manually (yes manually) to Linkedin accounts (otherwise dont know where I can do it) for 3 weeks but stil quiet and nothing positive. \nJust want to ask if there is any way to get clients without spending money on ads and tool. FYI, i start working as a freelancer for sales conversion review for b2b services. But start no money and do everything manually. \n\nSo struggling now",
          "score": 1,
          "created_utc": "2026-02-14 02:56:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5bz3ix",
          "author": "shivangibedi",
          "text": "So I have tried many tools for my saas start up and according to my ICP search leads gave me good clients so that I can close the deals with real time verification status as well. They also provide 1k free trial credits for use in which it will only charges credits for valid leads.",
          "score": 1,
          "created_utc": "2026-02-14 12:52:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5jb7wu",
          "author": "AccountAbilityB2B",
          "text": "Our specialism is Account Based Growth so (unsurprisingly) this answer is going to lean into that. Account Based Marketing / Sales when implemented properly and optimised is an engine for client aquisition but the tools you use will depend on the size. For example, 6Sense is an incredible enterprise tool that shows intent by Organisation but for SMB agencies it's probably not worth the effort of implementation. Have you tried any account based or category/sector based growth strategies? Or are you looking specifically for tech platforms to help you automate (or reduce the human labour and thinking) your client acquisition? ",
          "score": 1,
          "created_utc": "2026-02-15 17:08:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o52ahuv",
          "author": "HearthString",
          "text": "We evaluated a few platforms that tried to be more than just prospecting tools. Vendasta came up because it ties lead discovery and sales workflows together instead of leaving reps to manage everything manually. It didn't replace selling, but it reduced friction.",
          "score": 1,
          "created_utc": "2026-02-12 22:28:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o53bztk",
              "author": "Barnegat16",
              "text": "Screw vendasta",
              "score": 2,
              "created_utc": "2026-02-13 02:04:59",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r0xsvh",
      "title": "Are we wasting tons of money creating content that never gets used?",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1r0xsvh/are_we_wasting_tons_of_money_creating_content/",
      "author": "Final-Assistance-332",
      "created_utc": "2026-02-10 11:02:00",
      "score": 23,
      "num_comments": 36,
      "upvote_ratio": 1.0,
      "text": "The other day, I read some crazy statistics online that said that 60 to 70% of B2B marketing content is never used. Meaning, you create it, you eventualy post it once, and at the end of the story, it sits on a shelf and starts acumulating dust.\n\nNow, that data is a little bit old. It seems to be 2016, so 10 years old, so it might have changed entierly since then, but my gut feeling is this is still very much true today.\n\nI don't know if it's 60, 70%, but I can tell that a good portion of what my marketing team is creating in terms of content is just sitting there on a shelf.\n\nAnd if I'm being totally transparent, it's not just the marketing team. We are in a B2B SaaS, so we also have a bunch of sales engineers that like to create their own content, white paper, that's not always on brand nor beautifull, by the way.\n\nAnd they create it once for one customer, send it to the marketing team as the new shiny object to use everywhere, and then it just sits on the shelf and no one ever uses it.\n\nI feel like we waste tons of money and efforts by creating a bunch of stuff that never gets used.\n\nIs it just me or is that a common trend? Do you guys have that experience as well?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1r0xsvh/are_we_wasting_tons_of_money_creating_content/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o4lfv7e",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-10 11:02:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4m3bvt",
          "author": "twhap76",
          "text": "The best approach I've found is to create a couple of larger, pillar content pieces for the year and utilize nuggets from those pillars throughout the year. It's about working smarter, not harder. So how do you approach repositioning content that you've already created? We've found success with it on social, email, etc.",
          "score": 9,
          "created_utc": "2026-02-10 13:45:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4njcwx",
              "author": "Final-Assistance-332",
              "text": "Love that!\nI do it too. I've been leveraging the RIO framework and it calls it the \"Big Rock Content\" strategy: create a big rock content then turn it into pebbles. ",
              "score": 1,
              "created_utc": "2026-02-10 17:58:27",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4lh4ft",
          "author": "Soft-Dragonfruit6447",
          "text": "totally relatable post",
          "score": 4,
          "created_utc": "2026-02-10 11:12:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4mpti7",
          "author": "Mularkeyy",
          "text": "No, it’s not just you. This happens a lot in B2B SaaS.\n\nMost “unused content” isn’t bad, it just has no clear home. It gets made without a specific channel, owner, or moment in the funnel to plug it into, so it gets posted once and dies. The sales engineer one off PDFs are a classic too. Useful for that one deal, but nobody knows how to turn it into something repeatable.\n\nWhat usually fixes it is a simple rule. Don’t create anything unless you already know where it will be used and who owns distribution. And instead of making new stuff every time, build a few core assets and intentionally break them into smaller pieces for sales, email, website, and social.\n\nIt’s less a content problem and more a workflow and reuse problem.\n\nWe talk about this kind of demand gen and content reuse on r/LeadGenSEA too if you want more examples.",
          "score": 3,
          "created_utc": "2026-02-10 15:41:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4opvda",
          "author": "OkDependent6809",
          "text": "honestly yeah we have so much content just sitting in google drive doing nothing.\n\nthe problem is we create stuff because someone had an idea or a customer asked once, then it gets posted to linkedin one time and just dies.\n\nwe've tried to get better by asking \"will we actually use this more than once\" before building anything. still not perfect but at least we make less dead content now.\n\nthe 60 70% number seems low tbh lol",
          "score": 3,
          "created_utc": "2026-02-10 21:14:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4or84v",
              "author": "Final-Assistance-332",
              "text": "Thank you, I feel less alone! 🤣",
              "score": 1,
              "created_utc": "2026-02-10 21:21:02",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4lncpx",
          "author": "Kooky-Ad-7084",
          "text": "ofc its true. Id say it's probably much higher. these reports, whitepapers etc - who reads them?  \n\nI asked a founder who told me that they produce a lot of content - what was his favourite piece of content?\n\n  \nhe couldnt think of a signle one! \n\nthey procude a ton of content and he doesnt remember any of it\n\n  \nyou treat your content like a chore and it will look like it\n\nwhat I encourage teams to do is to create time-specific micro content. then push that\n\nno content calendar crap\n\nwhat's hot today -> short content > promote a bit\n\n  \nthat and webinars.",
          "score": 2,
          "created_utc": "2026-02-10 12:03:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4p6bmf",
          "author": "QuantumWolf99",
          "text": "This is painfully accurate and honestly most B2B content fails because it's created backwards... someone decides to make a white paper or case study without validating if anyone actually wants it or if it maps to a specific stage in the buyer journey.\n\nFor lead gen clients I work with the content that actually performs is stuff that directly supports paid campaigns... landing pages with specific pain points, comparison guides that address objections, ROI calculators that qualify leads. Everything else is just marketing theater that makes internal stakeholders feel productive but doesn't move revenue.\n\nThe sales engineers creating one-off content is the worst part because it fragments messaging and nobody knows what's been tested or what converts... better to have three pieces of proven content getting reused constantly than 50 pieces sitting unused in a folder somewhere.",
          "score": 2,
          "created_utc": "2026-02-10 22:33:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4qoy8k",
          "author": "deep_singh3106",
          "text": "Our team used to create content on a close request (\"sales needs a PDF\"). Once the immediate request is done, the asset has no owner, no distribution plan and no second life. Now, we have started asking one simple question before creating anything and that is, \"Where will this live and how will we reuse it at least 3 times? If there is no clear answer then we dont bother to make it.",
          "score": 2,
          "created_utc": "2026-02-11 03:53:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4rc57k",
              "author": "Final-Assistance-332",
              "text": "Sounds like the right way to do it!\nSo you have a clear mapping of your campaigns, to figure out where to insert the content? ",
              "score": 1,
              "created_utc": "2026-02-11 06:53:17",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4xclsk",
                  "author": "deep_singh3106",
                  "text": "Oh yes we do. So, we map the content to specific stages. For example, before creating anything, we decide 3 things.\n\nWhich stage of the funnel it supports?   \nWho own distribution (marketing, SDR, CE, etc.)  and   \nWhere it will b used (email, LinkedIn, sales follow-up, website and others).\n\nTo create impact we have to clearly place it into existing motion. ",
                  "score": 2,
                  "created_utc": "2026-02-12 04:09:55",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4lprkv",
          "author": "imaginary_name",
          "text": "How do you know the content is not being used by your customers during their journey to the bottom of your funnel?",
          "score": 1,
          "created_utc": "2026-02-10 12:20:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4lzd6j",
              "author": "Final-Assistance-332",
              "text": "What's a data said was that companies were not doing anything with that content not promoting it not utilizing it it did not say that customers were not reading it which is another story entirely ",
              "score": 1,
              "created_utc": "2026-02-10 13:23:00",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4m0alo",
                  "author": "imaginary_name",
                  "text": "My question is, do you analyze whether \"the content you are wasting money on\" pops up during the customer journey?   \nIs it really dead weight? Does it have any backlinks, does it have any traffic at all or even from attributed conversions, is it being cited or mentioned by your customers LLM during their customer journey? Questions you either know the answers to or you should before cutting costs on content production.",
                  "score": 1,
                  "created_utc": "2026-02-10 13:28:21",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4mel3s",
          "author": "threedogdad",
          "text": "go look at your analytics and tell me what you see.",
          "score": 1,
          "created_utc": "2026-02-10 14:45:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4mk2zg",
          "author": "Intrepid_Boss9449",
          "text": "Yeah I’ve seen that too. A lot of content gets made and then just forgotten. One thing that helped me is focusing on repurposing stuff and using tools that find where your audience actually hangs out, like Reddit, so you don’t waste effort on content no one sees.",
          "score": 1,
          "created_utc": "2026-02-10 15:13:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4mqjjp",
          "author": "yngbld5",
          "text": "Very common issue in B2B",
          "score": 1,
          "created_utc": "2026-02-10 15:45:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4o20mx",
          "author": "Advanced-Editor-847",
          "text": "100%",
          "score": 1,
          "created_utc": "2026-02-10 19:23:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4oyvbo",
          "author": "aimdoc-ai",
          "text": "I guess you have to ask yourself: why are you creating content in the first place? A lot of the times it's for buyer enablement, exactly what you're just describing. And of course, it's not scalable to have to continue to do that for every single buyer and create unique content for that buyer. \n\nWe used to see that problem with a lot of our customers. Not every page speaks to each buyer specifically on the website. Not every white paper and case study will do a good job at communicating how exactly those results or success stories apply to a specific customer. It's something we've partially solved with our product, and it allows buyers to explore your product and value proposition at their own pace in an AI native way. There's a lot of value in simply providing fast answers and fast value.",
          "score": 1,
          "created_utc": "2026-02-10 21:56:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4pcnj9",
          "author": "Kamel_Ben_Yacoub",
          "text": "Content marketing doesn't work without distribution.\n\nAmplification and distribution is just as important as the content itself. If the content stays in an echo chamber to a limited audience, it's useless.\n\nContent efficiency = Create once → Repurpose into different formats → Distribute with paid amplification\n\nHere what works for our LinkedIn ads clients:\n\n**1. Create content that resonates with your ICP**\n\nEspecially if it's founder-led content or from executives with deep expertise, this is even better.\n\n**2. Repurpose into different formats**\n\nYou create one big piece, then break it into multiple content formats:\n\n* LinkedIn posts highlighting key insights\n* Video breakdowns\n* Document ads\n* Carousels\n* Single image ads with key stats\n\nOne whitepaper → 10+ different pieces of content\n\n**3. Distribute it to relevant channels and amplify with paid ads like LinkedIn Ads**:\n\nPost organically to test what resonates and amplify winners with LinkedIn ads.\n\n* Thought Leader Ads promoting your best organic posts\n* Document ads with whitepapers and guides\n* Video Views campaigns with demos and testimonials\n* Target your exact ICP (job titles, company sizes, industries)\n\nSame content reaches thousands of qualified prospects instead of 200 followers.",
          "score": 1,
          "created_utc": "2026-02-10 23:06:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4plohy",
          "author": "Abacus_Mode",
          "text": "Now that’s the conversation to start having with your customers. Make it public. Listen to them. Engage in the process transparently. Get input as to what they want more of. Less of. What makes them open your emails? What makes them hit delete? \n\nDo something different to everyone else in your sector. Put yer brave pants on and face this in public and show leadership through it all. You’ll win customers. And hopefully column inches in the trades.",
          "score": 1,
          "created_utc": "2026-02-10 23:57:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4qv0yy",
          "author": "soy_carloco",
          "text": "Pretty common if the strategy is curate-ive instead of create-ive. The former would probably go for making a bunch of stuff, filing them away, and then grabbing bits and pieces as needed and come up with something. The latter involves more work at the beginning (front loaded) planning exactly what is needed and making just those (maybe a littl extra for cushion). Not objectively bad or good just different.",
          "score": 1,
          "created_utc": "2026-02-11 04:36:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4sxbrt",
          "author": "Strong_Teaching8548",
          "text": "hat's incredibly common and i think the problem runs deeper than just \"unused content.\" i think building zignalify, i noticed something similar with how companies handle seo content, they create it, publish once, and then have zero visibility into whether it's actually driving traffic or ranking\n\nthe real issue isn't that content sits unused. it's that teams create without a feedback loop. you don't know what's working, so you keep creating the same way. your sales engineers creating one-off white papers? they have no idea if marketing already made something similar last year because there's no system tracking it\n\nwhat you need is visibility into what content actually moves the needle, then build a process around repurposing and amplifying that. stop creating new stuff until you've squeezed every ounce of value from what exists :)",
          "score": 1,
          "created_utc": "2026-02-11 14:22:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4sy2x3",
          "author": "filename_tbd",
          "text": "One off content is very common and not the best use of time. Our team builds large pieces of pillar content (usually ebooks), and then branch off smaller, more digestible pieces of content (one pagers, quizzes, etc). It's helpful to make sure everything gets used to the full extent and minimizes random one purpose projects.\n\nWe also keep everything centralized in a DAM so that teams can find and self-serve what they need. It really helps minimize content requests!",
          "score": 1,
          "created_utc": "2026-02-11 14:26:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o57vyah",
          "author": "ChrisCollinsSrDotCom",
          "text": "Just a story.I heard from two founders of this company kept posting the same video.They got like no views.I think they posted on tiktok.Got no views kept posting it.Eventually, something kicked it off, and they ended up with eighty million views within about a year of course that helped boost their marketing.  I just wanted to share that.",
          "score": 1,
          "created_utc": "2026-02-13 19:40:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4llml2",
          "author": "Impressive-Amount255",
          "text": "Oh we definitely are!\nI had seen that data float but 10 years is a long time for data. I'd love to see a fresher study and I'm ready to bet it only got worse.\nWith AI generating random content by the ton, it can't be any better.",
          "score": 1,
          "created_utc": "2026-02-10 11:50:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4mpb3x",
          "author": "SolutionsForAllNet",
          "text": "A huge amount of B2B content is never used, never seen, and never influences a single deal — and yes, companies burn staggering amounts of money on it. The core issue isn’t “content creation.” It’s content misalignment.\n\nMost B2B teams produce content for internal comfort, not for external consumption.\n\n---\n\nWhy so much B2B content goes unused\n\n- It’s created for the wrong audience — written for executives, approved by legal, but irrelevant to the actual buyer pains.\n- It’s built for campaigns, not workflows — PDFs, whitepapers, and case studies that don’t map to how buyers search, evaluate, or share information.\n- It’s too product‑centric — B2B buyers search for problems, not solutions. Most content jumps straight to “our platform does X.”\n- It’s too long, too formal, too slow — modern buyers want clarity, not corporate essays.\n- It’s created without distribution in mind — content teams ship assets that sales never use and marketing never repurposes.\n- It’s not SEO‑aligned — meaning it never ranks, never gets discovered, and never compounds.\n- It’s not tied to revenue — no clear path from content → conversation → opportunity.\n\nThis is why 60–80% of B2B content sits in SharePoint or HubSpot folders untouched.\n\n---\n\nThe deeper truth\nUnused content isn’t a production problem.  \nIt’s a strategy and workflow problem.\n\nWhen content is built around:\n- buyer pains  \n- search intent  \n- daily workflows  \n- evergreen problems  \n- high‑demand solutions  \n\n…it gets used, shared, ranked, and repurposed automatically.\n\nThis is exactly why your approach — daily SEO‑optimized content tied to high‑demand B2B solutions — works. You’re not creating “assets.” You’re creating answers.\n\nAnswers get used. Assets get buried.\n\n---\n\nThe real question\nDo you want to diagnose why B2B teams waste content, or do you want to position your content engine as the antidote to that waste?\n\nEither direction can turn into a powerful authority piece for your brand.",
          "score": 0,
          "created_utc": "2026-02-10 15:39:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4nju0n",
              "author": "Final-Assistance-332",
              "text": "Feels like you're just dumping a chatgpt answer here.... ",
              "score": 8,
              "created_utc": "2026-02-10 18:00:36",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4lht6k",
          "author": "Desperate_Pop_1578",
          "text": "You know what? That's actually driving me nuts! The way companies just *waste* time and money on content. I’m not some marketing veteran, but from what I’ve seen, most places just throw stuff at the wall because “the competitor did it,” or “the boss had an idea,” or “a customer asked for it.” No plan, no strategy, just reaction after reaction. And then we wonder why nothing sticks.\n\nI’ve been digging into integrated campaigns lately, trying out different frameworks, and the one that’s actually *clicked* for me is the RIO Integrated Campaign Framework. It forces you to think about content *differently*. Instead of just tossing a brief to the content team after everything’s already decided, you bring them in *early*, like, when you’re still figuring out the strategy. That way, the content actually *fits* the campaign, instead of feeling like an afterthought.\n\nNow, for me, it’s not a huge change. I’m basically a one-person band, handling everything from strategy to content (with a little freelance help). But I’ve seen bigger teams skip this step, and honestly? It’s a mess. Content ends up disconnected, campaigns feel patchy, and everyone’s scrambling to make sense of it all.\n\nSo yeah, if there’s one thing I’ve learned, it’s this: **involve your content people from the start.** It’s not just about making *more* content, it’s about making content that *works*. Otherwise, you’re just adding to the noise. And who needs more of that?",
          "score": -3,
          "created_utc": "2026-02-10 11:18:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4lnijl",
              "author": "Kooky-Ad-7084",
              "text": "omg bro.... change prompt...",
              "score": 6,
              "created_utc": "2026-02-10 12:04:21",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o4lkgth",
              "author": "Final-Assistance-332",
              "text": "Love the perspective, thank you for sharing!\nAnd yes, totally agree, the best move is to involve your content team from day 1 so they're part of the strategy. ",
              "score": -2,
              "created_utc": "2026-02-10 11:41:10",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o4llr2c",
              "author": "Impressive-Amount255",
              "text": "Excellent reference, this framework is my Bible, and I couldn't agree more: give your content people a seat at the table!",
              "score": -1,
              "created_utc": "2026-02-10 11:51:04",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r1xal0",
      "title": "Medical/healthcare marketers: What do you use for reporting tools?",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1r1xal0/medicalhealthcare_marketers_what_do_you_use_for/",
      "author": "WarAromatic474",
      "created_utc": "2026-02-11 13:24:41",
      "score": 22,
      "num_comments": 10,
      "upvote_ratio": 1.0,
      "text": "Working for a regional hospital network and need to report on campaign performance, patient acquisition costs, all that stuff to the executive team monthly. \n\nCurrently using a mix of GA screenshots and Excel spreadsheets but have no idea if that's what healthcare clients expect of if there are better tools or formatting I should be using be using. ",
      "is_original_content": false,
      "link_flair_text": "Support",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1r1xal0/medicalhealthcare_marketers_what_do_you_use_for/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o4smupj",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-11 13:24:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4st21s",
          "author": "DullCandidate4060",
          "text": "Screenshots and spreadsheet dumps will lose exec attention very quickly. Build a simple dashboard in your tool of choice with 5 metrics like cost per qcquisition, conversion rate by service line, month over month trends, and patient lifetime value projections. \n\nYou need to tell a story rather than just data. When host a monthly meeting I avoid just focusin on numbers, I explain trends and how we're capitalizing on them. ",
          "score": 1,
          "created_utc": "2026-02-11 13:59:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4suujx",
          "author": "CO_Oked_COO",
          "text": "Make a one pager with things like total qualified leads, scheduled appointments, cost per scheduled appointment, and channel performacne ranked by efficiency. Finish with a so what section at the bottom. Three bullets explaining the biggest win, concern, and what you're testing next month. ",
          "score": 1,
          "created_utc": "2026-02-11 14:09:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4vacja",
          "author": "ClayGouws",
          "text": "u/WarAromatic474 Im not in healthcare marketing, but have been looking into this myself. What are your distribution channels (social, website etc) that you need to collate into a report? I may have few ideas for you.",
          "score": 1,
          "created_utc": "2026-02-11 21:08:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4vi7qt",
          "author": "erickrealz",
          "text": "Looker Studio (free) connected to GA4 and your ad platforms will replace those screenshots overnight. Build one dashboard that auto-updates and you'll never copy-paste into Excel again.\n\nFor healthcare specifically, make sure whatever you use is HIPAA compliant in how it handles patient data. Don't pipe any personally identifiable patient info into standard analytics tools. Track conversions as appointment requests, not individual patients. Your executive team just wants to see cost per acquisition and which channels drive volume, keep the dashboard to those core metrics and skip the vanity numbers. Execs tune out the second you show them click-through rates instead of damn revenue impact.",
          "score": 1,
          "created_utc": "2026-02-11 21:46:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4zgo94",
          "author": "BuiltCorrect",
          "text": "The main challenge with reporting in healthcare is often the sheer volume of disparate data sources, not just the tools themselves. When I was building BuiltCorrect, our team realized that pulling data from EHRs, scheduling systems, and marketing platforms into one coherent view was a massive pain point. We initially tried to integrate with everything, but that was a nightmare.\n\nWhat worked for us was focusing on a centralized dashboard that could ingest key metrics from various sources. We built out custom connectors for common systems, allowing us to track client details, appointment schedules, and financial metrics all in one place. It's not a silver bullet, and integrating with every legacy system is impossible, but having that core hub made a huge difference.\n\nMy advice would be to prioritize what your executive team actually cares about most. Likely patient acquisition cost, retention, and revenue. And then find a tool that can consolidate those specific data points. Don't try to report on everything just because you can.",
          "score": 1,
          "created_utc": "2026-02-12 14:22:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o54nla2",
          "author": "Key-Catch3996",
          "text": "Honestly, screenshots and spreadsheets are pretty common but execs get bored of those fast. If you can swing it, building one clean dashboard that updates itself with your core metrics makes a huge difference, even if it’s just pulling from your usual sources. Just focus on stuff they actually care about like cost per acquisition, channel performance, and trends that matter for the business. Keeping it simple and story-driven usually lands better than dumping a bunch of raw data.",
          "score": 1,
          "created_utc": "2026-02-13 07:55:05",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r031aj",
      "title": "We switched to $35 AI headshots - nobody noticed, saved $2,800 for actual marketing",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1r031aj/we_switched_to_35_ai_headshots_nobody_noticed/",
      "author": "Vegetable-Feed-9305",
      "created_utc": "2026-02-09 12:34:46",
      "score": 20,
      "num_comments": 17,
      "upvote_ratio": 0.64,
      "text": "Running B2B marketing for a SaaS company with 8 team members who needed professional headshots for website, proposals, and LinkedIn. Professional photographers quoted $500-700 per person which would total $4,000-5,600 for everyone. Tried **Looktara** AI headshots instead at $35 each for $280 total. Everyone uploaded casual photos from their phones and got professional headshots back in 15 minutes.\n\nUsed them everywhere for 3 months - website, email signatures, client proposals, LinkedIn posts. Zero clients or prospects mentioned anything about the photos. Nobody could tell they were AI-generated. Professional perception stayed exactly the same but saved $2,800+ that went straight into Google Ads and content creation instead. B2B decision makers care about your product and pricing, not whether your headshot cost $35 or $600.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1r031aj/we_switched_to_35_ai_headshots_nobody_noticed/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o4f8ss8",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-09 12:34:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4fe2y5",
          "author": "TheArchitect_7",
          "text": "You don’t THINK people noticed.\n\nWe quietly cringe at these things all the time and never once mentioned them to the person or company.",
          "score": 7,
          "created_utc": "2026-02-09 13:10:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ffy4t",
          "author": "Several-Chef-9068",
          "text": "Wondering why this even deserved a thread",
          "score": 6,
          "created_utc": "2026-02-09 13:22:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4fgnby",
              "author": "nachosareafoodgroup",
              "text": "Almost certainly hacked and used for advertising if you look at the rest of the persons profile.",
              "score": 4,
              "created_utc": "2026-02-09 13:26:24",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o4fgle4",
              "author": "Radiant-Security-347",
              "text": "it’s an ad",
              "score": -12,
              "created_utc": "2026-02-09 13:26:04",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4fjvqq",
                  "author": "reasonwashere",
                  "text": "Yup",
                  "score": 1,
                  "created_utc": "2026-02-09 13:45:53",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4fa7xw",
          "author": "centurytunamatcha",
          "text": "AI will eat the low-stakes, utilitarian headshot use cases. photographers will still own branding, lifestyle, and high-touch work.",
          "score": 3,
          "created_utc": "2026-02-09 12:44:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4fjsrk",
          "author": "PearlsSwine",
          "text": "unsure if this shit, obvious spam was your idea or your boss' idea. \n\neither way, it's fucking shit. ",
          "score": 2,
          "created_utc": "2026-02-09 13:45:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4fbkm9",
          "author": "bala523",
          "text": "I’ve seen a few AI headshots (including from looktara) that honestly blended right in with studio photos.",
          "score": 1,
          "created_utc": "2026-02-09 12:53:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4gcowm",
          "author": "salko_salkica",
          "text": "Shitty ad for a shitty product",
          "score": 1,
          "created_utc": "2026-02-09 16:16:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4lqxgo",
          "author": "Kooky-Ad-7084",
          "text": "why does the ceo has 6 fingers?",
          "score": 1,
          "created_utc": "2026-02-10 12:28:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4faunz",
          "author": "Top-Statement-9423",
          "text": "As a buyer, i don’t need artistry for LinkedIn. i need looks like me, looks professional and if AI gives me that for $40, I’m not paying 10x unless i want the experience.",
          "score": 1,
          "created_utc": "2026-02-09 12:49:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4fm3xw",
          "author": "PrettyGraphic",
          "text": "Nice ad bro",
          "score": -40,
          "created_utc": "2026-02-09 13:58:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4kojo9",
              "author": "King_Kahun",
              "text": "Not sure why you're getting down voted. Maybe OP has downvoting bots LOL",
              "score": 2,
              "created_utc": "2026-02-10 06:44:00",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4l4lm8",
                  "author": "PrettyGraphic",
                  "text": "Lmao honestly dude the state of reddit in 2026",
                  "score": 2,
                  "created_utc": "2026-02-10 09:15:57",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4fpd9w",
          "author": "Shama_lala",
          "text": "Absolutely love this move. Why blow thousands on headshots when you can funnel that cash into what actually matters? Clients care about the value you bring, not how polished your profile pic is. ",
          "score": 0,
          "created_utc": "2026-02-09 14:17:33",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r0zz27",
      "title": "What tools do you recommend for automating B2B lead generation and follow-up?",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1r0zz27/what_tools_do_you_recommend_for_automating_b2b/",
      "author": "Cute_Olivia_Park",
      "created_utc": "2026-02-10 12:55:35",
      "score": 18,
      "num_comments": 45,
      "upvote_ratio": 0.92,
      "text": "I'm looking for the best tools to help automate lead generation and follow-up in a B2B environment. Specifically, I'm interested in tools that can:\n\n* Capture and qualify leads automatically\n* Personalize outreach (e.g., email sequences, LinkedIn messages, etc.)\n* Nurture leads through automated follow-up\n* Integrate with CRM systems for seamless workflow\n* Improve efficiency and reduce manual tasks for sales teams\n\nWhat platforms or software have you found to be the most effective for these purposes? Would love to hear about your experiences and any tools you've used that made a big impact on your lead generation process!",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1r0zz27/what_tools_do_you_recommend_for_automating_b2b/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o4lux0p",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-10 12:55:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4morkt",
          "author": "brifromapollo",
          "text": "This is almost EXACTLY what we built Apollo for but let me break down where it fits vs. where you need other tools since I work there.  \n  \nApollo excels at the intent and firmographic filtering piece like finding companies showing buying signals and building those snazzy multichannel sequences with email, LinkedIn, phone touches etc. That said....if you're looking for full marketing automation with complex nurture workflows, HubSpot or Marketo might be better fits.   \n  \nThe traffic and leads you generate are only as good as your data quality and targeting which is where Apollo shines but tbh most teams end up with a stack approach rather than trying to force one tool to do everything.  \n  \nWhat's your current setup and team size? That usually determines whether you need the enterprise ABM platforms or can start with something more integrated!! ",
          "score": 6,
          "created_utc": "2026-02-10 15:36:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4nxwey",
              "author": "DudeWaitWut",
              "text": "I would second Apollo. That's what I use for outreach, and you can build out some pretty complex sequences, adding both automatic and manual steps. I have multiple sequences, one for each of my target audiences, and another sequence that uses a more personalized approach of manual email, creating Loom videos, etc. (I add contacts from the other sequences to this one if I see engagement, so I can focus my time on prospects most likely to engage)",
              "score": 2,
              "created_utc": "2026-02-10 19:04:26",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4m1tfl",
          "author": "Less-Bite",
          "text": "Automating B2B lead gen usually comes down to how you're sourcing the data. Tools like Apollo, purplefree, and PhantomBuster are all solid options for capturing leads without doing the manual legwork. purplefree is great if you want to focus on social media signals to find prospects who are already talking about their pain points.",
          "score": 3,
          "created_utc": "2026-02-10 13:36:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4m6twj",
          "author": "No_Hedgehog8091",
          "text": "Don't look for an all-in-one unicorn.\n\nThe best workflow combines cloud-based LinkedIn automation with a dedicated cold email sequencer.\n\nEnsure your scraper uses waterfall enrichment for validity before syncing to the CRM.\n\nPersonalization leverages recent activity data, not just static job titles, for higher conversion rates.",
          "score": 3,
          "created_utc": "2026-02-10 14:04:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4lzznr",
          "author": "Impressive_Share_212",
          "text": "I use an automation that does 70% of the things ypu do. Still need human involvement but it saves time",
          "score": 1,
          "created_utc": "2026-02-10 13:26:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4m9vv0",
          "author": "HowdyGrowthHack",
          "text": "A lot of this depends on where your leads are coming from and how complex your sales cycle is. In practice, I’ve seen the best results from splitting things up: -One tool to source + enrich leads (so you’re not chasing bad data), -One tool to run sequences (email + maybe LinkedIn), -A CRM to track context and follow-ups, not just store contacts.\n\nFor qualification, even basic rules help a lot (company size, role, recent activity) before anything hits a rep. You don’t need perfect scoring, just enough to avoid wasting time. For follow-up, simple multi-step sequences usually beat fancy personalization. A few relevant touches spaced out well > over-automated messaging. Most CRMs can handle this part fine once the data is clean - tools like HubSpot, Pipedrive, Salesforce, or even newer lighter fully automated tailor made ones like RealTech CRM, Attio, GHL, Zoho CRM, etc all work if they’re set up cleanly. The tooling matters less than keeping the workflow simple and consistent. If I had to optimize one thing- reduce manual handoffs. That’s where most B2B follow-up breaks down.",
          "score": 1,
          "created_utc": "2026-02-10 14:21:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4n057p",
          "author": "DrJoeAngelInvestor",
          "text": "Data quality and targeting are crucial in any marketing strategy. So before you get started with AI SDR, get your ICP right. Without the right ICP, all you are doing is getting more efficient at contacting the wrong people. AI SDR won't find your ICP",
          "score": 1,
          "created_utc": "2026-02-10 16:29:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4os23f",
          "author": "Designer_Money_9377",
          "text": "In my experience, the biggest challenge with automation is keeping the outreach genuinely personal. I've tried a few different platforms for email sequences and LinkedIn, and while they save time, the conversion often drops if you're not careful.\n\nFor finding leads on Reddit specifically, I've been checking out LeadsRover lately. It scans for high-intent leads, which is a neat feature for niche markets, though I'd still recommend personalizing the final message heavily.\n\nAlways review and tweak automated messages before sending them out.",
          "score": 1,
          "created_utc": "2026-02-10 21:24:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4p06sh",
          "author": "aimdoc-ai",
          "text": "We've built a pretty powerful product that is an AI buyer co-pilot that basically sits on your website, integrates with your communication channels (Slack), your CRM, engages warm visitors, figures out which company they're at, qualifies them, captures information, and then syncs it all to your CRM in real time.\n\nWe're really built for B2B SaaS, and we're going even further in terms of streamlining and automating the B2B SaaS buyer journey, all the way from first touch on the website, engagement, qualification, through the AI onboarding new customers in your product.\n\nWorth a look if you are B2B SaaS.",
          "score": 1,
          "created_utc": "2026-02-10 22:02:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4p5ko1",
          "author": "Apprehensive_Bit310",
          "text": "Sent you a DM.",
          "score": 1,
          "created_utc": "2026-02-10 22:29:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4pp2m1",
          "author": "algatesda",
          "text": "Lately I have tested more than 10 tools for LinkedIn and found a tool which helps automate without policy breach for Linekdin,Now I have automated my Linekdin outreach and getting calls booked atleast 15 -20 appointments.need to know pls DM will share the  tool and process",
          "score": 1,
          "created_utc": "2026-02-11 00:16:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4qo2z9",
          "author": "colocioai",
          "text": "You need to match your outreach to signals. Happy to show you what I do to make it effective for B2B",
          "score": 1,
          "created_utc": "2026-02-11 03:48:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4rkjy8",
          "author": "GrowthWithNina",
          "text": "Tools help, but most automation problems in b2b aren’t tool problems, they’re targeting and sequencing problems.\n\nif your ICP isn’t tight and your messaging isn’t relevant, automating it just scales the noise.\n\nthe stack matters less than having a clear system for:  \n– identifying high-fit accounts  \n– sequencing touches intentionally  \n– responding fast when someone shows intent\n\nonce that’s clear, most decent tools can execute it.",
          "score": 1,
          "created_utc": "2026-02-11 08:10:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4sdus3",
          "author": "svlease0h1",
          "text": "automation usually works once capture and follow up live in the same system. score leads when forms are submitted, send five emails across ten days, push qualified contacts into crm automatically. a small b2b team reduced manual follow up time from half a day weekly to about one hour after doing this. results improve once lead volume crosses around one hundred per month.",
          "score": 1,
          "created_utc": "2026-02-11 12:27:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4stheh",
          "author": "Mysterious_Bet3560",
          "text": "So many of the channels you suggested have lost momentum. I'm not trying to claim email and LI messages are dead, but damn, they are not good. \n\nHave you tried to nurture through Ads? More expensive than email obviously, but that's the moat that differentiates you when everyone has cheap email.  \n\nUse that contact list for nurture emails and build contact level ad audiences in all the major social channels. B2B targeting has been hard here, but now tools like Vector will provide HEMs and MAIDs to target only your contact list. ",
          "score": 1,
          "created_utc": "2026-02-11 14:01:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4su753",
          "author": "HourOpportunity9678",
          "text": "Personally, I just can't justify the time and expense to send hundreds of thousands of emails for MAYBE a couple of replies. Seems like we're forcing this channel to be alive when we just need more creativity. \n\nWe've been using Vector to build ad audiences. Match rate increases allowed us to use Reddit, X, or Meta B2B targeting in B2C channels...obviously been strong for LI and Google too.  ",
          "score": 1,
          "created_utc": "2026-02-11 14:05:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4xmb1r",
          "author": "Waste_Historian_3361",
          "text": "Most folks end up piecing together a stack that covers each step since no single tool does it all well. Go for something that scrapes and enriches leads automatically, hooks into your CRM, and lets you set up personalized drip outreach across email and socials. Make sure it’s easy for sales to jump in and tweak things so you’re not stuck with rigid flows. The right setup takes a lot of busywork off your team but you still need to keep an eye on personalization or it all just ends up in spam folders.",
          "score": 1,
          "created_utc": "2026-02-12 05:21:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o54rkt1",
          "author": "Educational_Jello666",
          "text": "There are also newer systems that try to go a bit deeper into the *actual work* by helping with calls, scheduling, and follow-ups automatically, instead of just pipeline automation. One example I know of is RealTech CRM (by Howdy Analytics)  it tries to reduce the manual busy work teams deal with every day, like inbound calls, appointment booking, conversation logging, and reminders.\n\nNot saying it’s the best for everyone  you still need the right fit for your stack  but if your biggest bottlenecks are the repetitive tasks that eat up time, that’s something worth looking into.\n\nWhat part of your workflow do you want automated the most  email follow-ups, scheduling, data cleaning, or something else?",
          "score": 1,
          "created_utc": "2026-02-13 08:32:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5cz74y",
          "author": "Dxstinity",
          "text": "i use mailly for this kind of thing. it really helps with personalizing outreach and automating follow-ups. definitely worth checking out if you're looking to streamline your lead gen process!",
          "score": 1,
          "created_utc": "2026-02-14 16:21:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5d3vqx",
          "author": "ailead108",
          "text": "Most B2B teams don’t actually need “more tools.”\n\nThey need fewer tools that connect properly.\n\nFrom what I’ve seen, the stack usually breaks into 3 layers:\n\n1. Lead sourcing (e.g., Sales Nav, Apollo, etc.)\n\n2. Outreach automation (email + LinkedIn sequencing)\n\n3. CRM + follow-up automation\n\nThe biggest leak usually isn’t generation — it’s inconsistent follow-up and poor prioritization.\n\nIf your CRM doesn’t:\n\n– auto-score leads\n\n– trigger follow-ups\n\n– centralize conversations\n\n– and show clear pipeline visibility\n\nyou’ll still end up doing manual work.\n\nAre you starting from scratch or trying to fix an existing stack?\n\n",
          "score": 1,
          "created_utc": "2026-02-14 16:44:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4r9yts",
          "author": "GTMSignals",
          "text": "In my workflow I am using different tools for different set of work choosing the one with the best feature that helps my task to performs smoothly.",
          "score": 0,
          "created_utc": "2026-02-11 06:34:10",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r0173h",
      "title": "What AI tools are you actually using daily?",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1r0173h/what_ai_tools_are_you_actually_using_daily/",
      "author": "nicofromprontohq",
      "created_utc": "2026-02-09 10:54:42",
      "score": 17,
      "num_comments": 34,
      "upvote_ratio": 1.0,
      "text": "Everyone's hyped about AI but hard to know what's actually useful. Looking for feedback from real people working in marketing who actually unlock new use case with AI. Thanks!",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1r0173h/what_ai_tools_are_you_actually_using_daily/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o4ewn3k",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-09 10:54:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4g35d1",
          "author": "Intrepid_Boss9449",
          "text": "I use SocListener daily to find sales leads on Reddit and it saves me a ton of time by auto-generating comments and DMs that actually get responses. If you’re doing marketing on Reddit, it’s worth checking out to unlock new ways to engage without spending hours searching posts. Other than that, simple AI tools for content ideas and scheduling are my go-tos.",
          "score": 2,
          "created_utc": "2026-02-09 15:30:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o54i79c",
          "author": "Kml777",
          "text": "As I already mentioned, and repeat the same thing, I use Perplexity AI, as this tool is super useful when you are researching something. This tool is helpful when you need the answers with the references from trusted resources. \n\nTagshop AI, when it comes to generating realistic AI video ads with the product url, image or by the script. A quick and cost-effective tool to generate video ads for social media, ecomm and other ad platforms.",
          "score": 2,
          "created_utc": "2026-02-13 07:05:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ey0b4",
          "author": "emma-clarke1",
          "text": "i use ChatGPT for ideation, research & drafts. also some automation tools like Gumloop and Zapier",
          "score": 1,
          "created_utc": "2026-02-09 11:07:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ez4f4",
          "author": "GTMSignals",
          "text": "I am using Chatgpt for content drafting and perplexity for research part",
          "score": 1,
          "created_utc": "2026-02-09 11:17:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4f0btg",
          "author": "iram_shaikh_",
          "text": "I use ChatGPT for ideas and writing, and Perplexity for quick research. Both help a lot every day.",
          "score": 1,
          "created_utc": "2026-02-09 11:27:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4f5ts4",
          "author": "SergiePoe",
          "text": "I use Claude inside a workspace to offload routine stuff, like not writing meeting summaries myself or getting reminders about upcoming meetings - handling small operational tasks. And for marketing-related things, an AI agent helps a lot: it analyzes users who sign up for my product and gives me a concise summary about them, some key insights, so I can then do warm outreach.",
          "score": 1,
          "created_utc": "2026-02-09 12:12:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4g5qcr",
          "author": "Dangerous_Bowler3286",
          "text": "For me, the only AI I actually use daily is around sales and email outreach, not random shiny tools.\n\nI run an agentic AI setup specifically for email campaigns, and that’s where I’ve seen real impact.\n\nThe system handles the heavy lifting: multiple inboxes, dedicated domains, warm-ups, safe send limits, inbox rotation, and verified contacts before anything goes out. Emails are personalized automatically, follow-ups run on their own, and inbox health is watched so things pause before issues happen.\n\nThe AI isn’t “writing magic copy”  it’s managing execution cleanly at scale.\n\nCurious what others are actually using AI for that saves time, not just demos.",
          "score": 1,
          "created_utc": "2026-02-09 15:43:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4gw3vd",
              "author": "Muted_Grass_9879",
              "text": " Can you tell more about this setup??",
              "score": 2,
              "created_utc": "2026-02-09 17:48:52",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o54zfri",
              "author": "anthoandria",
              "text": "I am really interested if you can share",
              "score": 1,
              "created_utc": "2026-02-13 09:47:04",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4h6kod",
          "author": "Alone_Ad_3375",
          "text": "honestly I am using coldemailkit along with claude everyday",
          "score": 1,
          "created_utc": "2026-02-09 18:37:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4hfn7x",
          "author": "DudeWaitWut",
          "text": "Claude and Perplexity. Claude for idea generation, content outlines, deep research, etc. Perplexity for quick answers.",
          "score": 1,
          "created_utc": "2026-02-09 19:20:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4k1rf2",
          "author": "Hereemideem1a",
          "text": "I use Vomo pretty much daily for meetings and internal syncs. It records or takes uploaded audio and gives me clean notes, summaries, and action items I can drop right into briefs or CRM.",
          "score": 1,
          "created_utc": "2026-02-10 03:52:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4kpe5k",
          "author": "The-FrozN",
          "text": "Depends. What would you use it for? For me, I use fiddlart to make UGC, social ads, product visuals and short videos for my clients.",
          "score": 1,
          "created_utc": "2026-02-10 06:51:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4lo9eq",
          "author": "GurAffectionate9119",
          "text": "Honestly, the AI tools I actually use daily are the boring ones that save time, not the flashy stuff.\n\nChatGPT for first-pass captions, content angles, and rewriting things faster than starting from scratch.\n\nCanva’s AI features are mostly for quick resizing, background cleanup, and basic video tweaks.\n\nWhere AI really helps me is consistency. I batch ideas, then let scheduling handle the rest, so I’m not context-switching",
          "score": 1,
          "created_utc": "2026-02-10 12:09:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4m75ed",
          "author": "InevitableCamera-",
          "text": "Daily it’s still the basics: ChatGPT for copy, ideas, and quick thinking. For marketing visuals, I sometimes use VidMage to quickly generate face-swap video snippets or hooks for short ads, not an everyday tool, but useful when you want something eye-catching without a full production setup.",
          "score": 1,
          "created_utc": "2026-02-10 14:06:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4n1kw7",
          "author": "Tight_Tree8390",
          "text": "Canva and Cubeo AI are my daily go-to tools",
          "score": 1,
          "created_utc": "2026-02-10 16:36:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ngl5n",
          "author": "sahaksg",
          "text": "I also use ChatGPT 5.2 and Krea AI for graphical material creation",
          "score": 1,
          "created_utc": "2026-02-10 17:45:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4o5cz9",
          "author": "thatsupercoolguykyle",
          "text": "I use Onlyinsight for meta ads - it's like chat gpt but connected to my entire meta ads account",
          "score": 1,
          "created_utc": "2026-02-10 19:39:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4qd2rk",
          "author": "Traditional-Dog-2850",
          "text": "Use Google ai mode and chatgpt. Those two give me breadth and diversity. ",
          "score": 1,
          "created_utc": "2026-02-11 02:39:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4rfspb",
          "author": "United_Broccoli_4032",
          "text": "If you’re running Meta ads, something like Didoo AI is a game changer. It’s not just hype-this tool actually studies your business and automatically spins up fresh, targeted ads that find profitable buyers without you having to guess or manually tweak audiences. Instead of spending forever testing creatives and targeting, Didoo AI constantly optimizes for you, shifting budget to what’s really working in real time. It’s like having a smart assistant that keeps poking the algorithm until your ads get traction, saving you tons of time and wasted spend. Definitely worth checking out if you want AI to actually do the heavy lifting for marketing.",
          "score": 1,
          "created_utc": "2026-02-11 07:26:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o50jmpd",
          "author": "stagetrekker",
          "text": "Adden AI and Claude for ad performance analysis ",
          "score": 1,
          "created_utc": "2026-02-12 17:29:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o54px1k",
          "author": "ikrashaikh",
          "text": "For analysis I am using Claude & for new new research I am using ChatGPT ..",
          "score": 1,
          "created_utc": "2026-02-13 08:16:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5k031k",
          "author": "LieAccurate9281",
          "text": "Daily marketing is far less ostentatious than Twitter portrays it. The majority of folks I know use Midjourney for consistent images, ChatGPT for brainstorming, hooks, and copy rewriting, and one video layer to convert that into content. While platforms like Vimerse Studio are helpful when you want to quickly remix photographs into motion without juggling five programs, solutions like CapCut or Runway handle simple edits for short-form. Speed, faster testing, iterations, and shipping, is the true value, not \"AI magic.\" Anything that doesn't immediately save time is typically dropped.",
          "score": 1,
          "created_utc": "2026-02-15 19:09:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4qe9vi",
          "author": "TillPatient1499",
          "text": "For daily work it’s still ChatGPT for copy, positioning, and idea validation. On the creative side, I’ve been using VidMage occasionally to generate quick face-swap video hooks for social clips.",
          "score": 0,
          "created_utc": "2026-02-11 02:46:22",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r2ox1r",
      "title": "My website traffic was converting at roughly 1.5%. Made ONE change. Now it's at 2.5%. Revenue up over 60%.",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1r2ox1r/my_website_traffic_was_converting_at_roughly_15/",
      "author": "Gamify123",
      "created_utc": "2026-02-12 09:21:45",
      "score": 16,
      "num_comments": 19,
      "upvote_ratio": 0.9,
      "text": "I run a cold emailing business. Was getting decent traffic (\\~12-14K/month) but conversion was stuck at 1.5% ish. Most visitors would browse and leave without contacting us.\n\nThe problem was that people were visiting our website and had a lot of questions, but getting their answers required manually scrolling through the website and searching, and sometimes the answer wasn't even available on the site. This is how 99% of websites are today and the UX is horrible. Customers are lazy and want instant answers without any manual searching.\n\nLast week of December, I got an agency to implement an AI-Assistant that answers common visitor questions immediately - no waiting for email responses or business hours.\n\n**Results after 30 days:**\n\n* Lead ratio: 1.3% → 2.5%\n* Leads: 156 → 354\n* Revenue: $6,943 → $11,324\n\nSame ads. Same website. Just instant answers when visitors need them.\n\nThe wildest part was that most of the leads come after 6pm and on weekends - times when we'd normally lose them. People scroll the internet more during after work hours.\n\nNot trying to sound like a guru here. Just sharing because I know a lot of you struggle with website conversion like I did. Sometimes it's not about more traffic - it's about helping the traffic you already have.\n\nHappy to answer questions if anyone's curious about the implementation.\n\n",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1r2ox1r/my_website_traffic_was_converting_at_roughly_15/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o4ycbjj",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-12 09:21:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4yikb1",
          "author": "Own-Skin-354",
          "text": "This actually makes a lot of sense. Most sites are built like brochures, not like conversations. If someone has to hunt for answers, you’ve already added friction.\n\nI work in B2B marketing and we see this a lot... intent is there, but clarity is missing in the moment it matters. Real-time answers reduce hesitation. That alone can move conversion more than redesigns or extra traffic.\n\nOnly thing I’d watch is answer quality. If the AI gives vague or wrong replies, it can hurt trust fast. But if it’s trained properly on your FAQs, pricing logic, and objections... it’s basically a 24/7 pre-sales rep.\n\nCurious, did you notice what % of conversions were directly influenced by assistant chats vs normal form fills? That’d be interesting to track.",
          "score": 1,
          "created_utc": "2026-02-12 10:22:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ykf1i",
              "author": "Gamify123",
              "text": "Yes exactly! I provided them with the knowledge bank that I wanted the bot to refer to, so the quality of answers has been solid. As for the % of conversions that were influenced by AI, thats a great question! I just assumed it would be the difference in the lead count but you're right maybe I should ask them to track that as well.",
              "score": 2,
              "created_utc": "2026-02-12 10:40:11",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o54rrvi",
                  "author": "Own-Skin-354",
                  "text": "yeah then you’ve done the hard part right... good source material makes or breaks these bots.\n\nif you can get them to tag leads that interacted with the assistant vs those who didn’t, you’ll get a much clearer picture. sometimes you’ll find faster decisions too.\n\nalso worth checking what questions people ask most... that’s basically a free objection + messaging report for your site.\n\nnice lift btw.",
                  "score": 1,
                  "created_utc": "2026-02-13 08:33:56",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4zky6b",
          "author": "ninefouro",
          "text": "Is it a saas or an agency?",
          "score": 1,
          "created_utc": "2026-02-12 14:44:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4zliuh",
              "author": "Gamify123",
              "text": "mine? or the one i used for this? i mean both are agencies either way lol",
              "score": 1,
              "created_utc": "2026-02-12 14:47:49",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o4zur7m",
              "author": "Gamify123",
              "text": "unable to see your other comment for some reason but yes cold email absolutely works, just needs to be done right. in fact, when starting out its your best bet",
              "score": 1,
              "created_utc": "2026-02-12 15:33:31",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4zsfyr",
          "author": "Emotional-Cherry-532",
          "text": "This is impressive. Is it an AI chatbot or something else customized according to your industry?",
          "score": 1,
          "created_utc": "2026-02-12 15:22:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4zt2tn",
              "author": "Gamify123",
              "text": "Its essentially an AI chatbot but yes customised to my brand specifically.",
              "score": 2,
              "created_utc": "2026-02-12 15:25:25",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5483nx",
          "author": "kaancata",
          "text": "I really feel like this subreddit is heavy on cold emailing strategies. What works well for us, as well as my clients is a funnel consisting of paid ads with webinars > viewers > email nurture > sale.\n\nPretty surprised to see so many utilizing cold emailing.",
          "score": 1,
          "created_utc": "2026-02-13 05:41:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o54y4a6",
          "author": "deep_singh3106",
          "text": "Damn... 1.3% to 2.5% seems low but if you run the math thats double the buying intent.. Most founders would spend months trying to drive 2 times the traffic rather than fixing the issue in front of them.",
          "score": 1,
          "created_utc": "2026-02-13 09:34:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o552un0",
              "author": "Gamify123",
              "text": "exactly and such a simple fix as well",
              "score": 1,
              "created_utc": "2026-02-13 10:18:58",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o56nwql",
          "author": "KissyyyDoll",
          "text": "Nice, that makes total sense. Quick answers keep people engaged instead of bouncing.",
          "score": 1,
          "created_utc": "2026-02-13 16:08:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5a863c",
          "author": "New_Grape7181",
          "text": "I've noticed something similar with timing - we get way more engagement outside business hours too. People are researching solutions when they actually have time to think, not during their chaotic workday.  \n  \nQuick question about your AI assistant setup: is it mainly handling pre-sales questions like pricing and features, or are you also using it to qualify leads before they hit your calendar? I'm wondering if there's a way to route the higher-intent visitors differently based on their questions.  \n  \nThe jump from 156 to 354 leads is impressive, but I'm curious if you noticed any difference in lead quality. Did the easier access to information attract more tyre-kickers, or did instant answers actually help serious buyers self-qualify faster?",
          "score": 1,
          "created_utc": "2026-02-14 03:40:01",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r0tgat",
      "title": "How do you market B2B when your product is nice to have",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1r0tgat/how_do_you_market_b2b_when_your_product_is_nice/",
      "author": "No_Hold_9560",
      "created_utc": "2026-02-10 06:32:34",
      "score": 14,
      "num_comments": 31,
      "upvote_ratio": 0.94,
      "text": "Our product is valuable, but it’s not a burning emergency. Prospects usually agree it’s useful, but it keeps getting pushed down their priority list. We’ve tried pricing promos and feature messaging, but the problem is deeper than that. How do you market something that’s clearly beneficial without relying on fear-based selling or constant discounting?",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1r0tgat/how_do_you_market_b2b_when_your_product_is_nice/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o4kn8ha",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-10 06:32:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4koeqj",
          "author": "Coachbonk",
          "text": "Product 101: QS&S\n\nThere are three basic value levers that can be pulled to accelerate adoption of change - quality, speed and service. It is generally regarded as possible to be excellent in all three. Ideally you have hard facts messaging on two of them with validation. \n\nI’m happy to help you unpack this, but a generalized word salad may just help you get more lost. Can you share the type of product, who it’s for and what your USP is?",
          "score": 3,
          "created_utc": "2026-02-10 06:42:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4l8mu7",
              "author": "No_Hold_9560",
              "text": "For us it’s mainly speed and service, not quality. The challenge is creating urgency when nothing is “on fire.” Happy to share specifics if you think it helps ground the discussion.",
              "score": 1,
              "created_utc": "2026-02-10 09:55:27",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4lms85",
                  "author": "Coachbonk",
                  "text": "Yeah please do",
                  "score": 0,
                  "created_utc": "2026-02-10 11:58:52",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4knv56",
          "author": "SolutionsForAllNet",
          "text": "Hey everyone! So, I've been thinking a lot lately about marketing a product that's more of a \"nice-to-have\" than an absolute necessity in the B2B space. It's definitely a different ballgame, right? You can't just hit them with the \"you *need* this\" urgency. Instead, it feels like you have to gently nudge them towards seeing the value.\n\nMy current approach is focusing on how this \"nice-to-have\" can actually make their jobs easier or more enjoyable. We're trying to highlight the benefits that might not be immediately obvious, but would still be really appreciated. Think about how it could improve employee satisfaction or boost team morale.\n\nWe're also exploring ways to showcase its potential to free up valuable time for their teams. If your product can help them focus on more critical tasks, that's a huge win, even if it wasn't on their immediate radar. Ultimately, it's about demonstrating how it enhances their overall business environment in a positive, albeit not critical, way. It's a subtle art, for sure!",
          "score": 1,
          "created_utc": "2026-02-10 06:38:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4l8qpq",
              "author": "No_Hold_9560",
              "text": "it’s less about urgency and more about making everyday work easier. We’re focusing on time saved, smoother workflows, and quality-of-life gains that add up, even if nothing is “broken” today.",
              "score": 1,
              "created_utc": "2026-02-10 09:56:30",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4kvq3g",
          "author": "Surbhimarketing",
          "text": "When a product is “nice to have,” the strategy usually isn’t to create urgency, it’s to anchor the product to an initiative that already has budget and exec attention.\n\nWe’ve seen better results by narrowing to one concrete use case, proving value there, and then expanding, rather than leading with broad benefit messaging.\n\nThe other unlock is buyer enablement: giving champions a clear internal story (ROI, outcomes, why-now) so prioritization becomes easier.\n\nCurious how others approach this, do you focus more on wedge use cases, timing the market, or helping buyers build internal momentum?",
          "score": 1,
          "created_utc": "2026-02-10 07:49:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4l8tc5",
              "author": "No_Hold_9560",
              "text": "This resonates. We’ve had more traction when we anchor to a specific initiative and lead with a tight use case, then expand. Buyer enablement has mattered more than broad value messaging. Still experimenting on timing vs internal momentum.",
              "score": 1,
              "created_utc": "2026-02-10 09:57:13",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4kz8e0",
          "author": "SergiePoe",
          "text": "try LTDs!! they're exactly the kind of users who are constantly on the lookout for something interesting, new, and just about to break out. LTDs like SaaSMantra or Prime Club give you visibility within closed communities, and platforms like AppSumo or RocketHub are the real storefronts where you can sell and tell your story. Gumroad is a nice option here too.",
          "score": 1,
          "created_utc": "2026-02-10 08:23:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4l8w6b",
              "author": "No_Hold_9560",
              "text": "We’ve considered LTDs as an early distribution + validation channel, especially for visibility and feedback. Curious which platforms you’ve seen work best beyond AppSumo.",
              "score": 1,
              "created_utc": "2026-02-10 09:57:58",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4mptg6",
                  "author": "SergiePoe",
                  "text": "All I mentioned before + Dealify. We are about to try it with the Prime Club team and see how it goes. Also, I noticed people are doing handmade LTDs right here, and it works pretty well for some.",
                  "score": 1,
                  "created_utc": "2026-02-10 15:41:53",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4lpqc5",
          "author": "Kooky-Ad-7084",
          "text": "there are a few ways - I'm gonna assume that you've made SOME sales before (otherwise maybe there's no fit at all)\n\nThere are 2 angles to dealing with this\n\n  \n1. The product is NOT really \"nice to have\"  - \n\n**Options 1: product is selling to a new market who doesnt feel this level of pain.**\n\nmost companies build a product for a few close design partners \n\nSay a company is selling to SMBs who are willing to pay $10k /yr for it and they love it. really solves a pain.\n\nbut then, when they try and sell it more broadly they discover that a bigger company is interested and is willing to pay $50k/yr . \n\nCEO thinks :\" bro we discovered another market \". updates investors and now it's in the company goals.\n\nbut the basic product was solving a pain for SMB but only ads some value to the Enterprise.\n\nnow sales and marketing struggle because what's been used before wont work now.\n\n  \n**Option 2: market research was done poorly**\n\nnew product should start with finding an audience that's waiting for it AND capturing all the measurable ways that your product delivers value \n\n  \nmost teams dont do it well. \n\nThis shows in the ads, outreach, partnerhsip but im most cases it's a market research problem.\n\n \n\n2. The product IS \"nice to have\"\n\n  \nIf your product is really nice to have then welcome to the big boys.\n\nOnly in SaaS we think that we invented marketing of \"nice to have\"\n\nbro , literrally all products are nice to have. \n\ndo you buy premium soap? food? organic? recycleable? \n\nthe way to stand out where there is competition is by **create an identity and raising their status**\n\n\"sure we can do it ourselves - but we are an AI first company so we will buy an AI tool\"\n\n\"sure our devs can write a script for that - but we are not the kind of company who waste time of such things - we have bigger fish to fry\"\n\nand easy way to apply this to your product is \n\n1. Pretend 2 people with the same job having lunch. one has your product and the other doesnt. \n\n2. write 5 friendly insults the one with your product can say to the other.\n\nthere's you identity back bones.   ",
          "score": 1,
          "created_utc": "2026-02-10 12:20:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4lsnus",
              "author": "Radiant-Security-347",
              "text": "I’m going to assume the level of marketing research done is zero.",
              "score": 2,
              "created_utc": "2026-02-10 12:40:49",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o4o029c",
              "author": "No_Hold_9560",
              "text": "Makes sense. Even if it’s “nice-to-have,” framing it as what serious teams use can make it a priority.",
              "score": 1,
              "created_utc": "2026-02-10 19:14:24",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4ls6ig",
          "author": "Right-Will8093",
          "text": "I'd focus on active intent and using the concept of chaining actions\n\nIf you monitor active communities and see someone complaining about a relevant pain point or seeking insights/solutions then you can jump into the conversation and add value\n\nThen you can lead that conversation to a sales call\n\nMaybe you offer consultation first and lead it to your solution, or make a new offer that's better for cold audiences at the frontend which you then use to upsell your current solution\n\nWhat do you offer exactly?",
          "score": 1,
          "created_utc": "2026-02-10 12:37:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4o0b6v",
              "author": "No_Hold_9560",
              "text": "We focus on following relevant communities, joining conversations where the pain shows up, and offering value first—sometimes a consult or smaller offer—then guiding it toward our main solution.",
              "score": 1,
              "created_utc": "2026-02-10 19:15:33",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4m3f2v",
          "author": "Goran-CRO",
          "text": "1.) ORGANIC - PLG- Inbound- vertical social networks - where people looking for solutions or complaining about incumbents. If you can’t get organic traction (paid customers) then investing as learning tax depends on your product/service/market type, business model, pricing, growth stage. \n2.) PAID \n\n2.1.) Social - If you sell hyped AI vertical agents to the impulsive  “tourists” driven by FOMO with high churn rate and $ 10 price tag then even for B2B makes sense to experiment with social networks (according to demographics/firmographics/use case/ICPs).\n\n2.2.) \n- Partnerships (cooperation with B2B providers/solutions bought by your ICP\n- ABM \n- Paid search \nThe more complex, expensive product/service with more stakeholders involved the ABM and paid search (check some of my posts to squeeze as much as possible)\n\nDon’t “spray & pray” - go channel by channel\n\nRemember: marketing (same as Ai) is only amplifier not s fixer (no PMF, poor/wrong positioning, pricing, workflows…)",
          "score": 1,
          "created_utc": "2026-02-10 13:45:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4mapjx",
          "author": "AleksandrMovchan",
          "text": "1. Strategic Positioning (ICP)/ Define who you sell to, and exactly what job you solve.\n\nin my Marketing B2B Strategies - fisrt phase (link in dm if u want) ",
          "score": 1,
          "created_utc": "2026-02-10 14:25:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4mq5dk",
          "author": "globetrotter-vienna",
          "text": "Just a few options: Luxury (Look i can afford this), i am the First one to own this, it is local / patriotic, it is environmental friendly,...",
          "score": 1,
          "created_utc": "2026-02-10 15:43:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ncqch",
          "author": "Aunker",
          "text": "This is usually a positioning problem, not a promotion problem. If it’s useful but not urgent, prospects don’t feel a cost to delaying. So the move is to reframe the cost of inaction without turning it into fear.\nThat can be time bleed, hidden ops drag, missed upside, or future pain that compounds quietly. People rarely act on benefits. They act when doing nothing feels like a decision with consequences.\nAnother angle is anchoring it to a moment. Onboarding, audits, hiring, growth phases. Not everyone needs it now, but some people need it right now.\nIf everyone says makes sense and then disappears, it usually means the trigger is missing, not the value.",
          "score": 1,
          "created_utc": "2026-02-10 17:27:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4o0j4t",
              "author": "No_Hold_9560",
              "text": "People act when doing nothing has a cost, not just for benefits. Anchoring to the right moment,onboarding, audits, growth phases,makes the product feel needed now.",
              "score": 1,
              "created_utc": "2026-02-10 19:16:33",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4pnik6",
                  "author": "Aunker",
                  "text": "Exactly. Once it’s tied to a moment, it stops being abstract. It’s no longer a good idea for later, it’s a tool for this phase. That shift usually does more than any feature list or discount ever will.",
                  "score": 1,
                  "created_utc": "2026-02-11 00:07:40",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4nvq7k",
          "author": "MundaneBase2915",
          "text": "What is your marketing strategy currently based on?",
          "score": 1,
          "created_utc": "2026-02-10 18:54:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4oq4gu",
          "author": "OkDependent6809",
          "text": "this is tough. nice to have products are hard because even if people see the value, theres always something more urgent.\n\nhonestly the only thing thats worked for us is finding the specific moment when it becomes urgent for someone. like our product isnt urgent for everyone, but for companies dealing with X problem right now, it suddenly becomes top priority.\n\nso instead of broad messaging about general benefits, we got really specific about who has that problem right now and went hard after them. way smaller audience but they actually buy instead of saying \"lets revisit next quarter\"\n\nalso helps to talk to customers who did buy and figure out what made them pull the trigger. usually theres some trigger event that made it urgent. then you can look for more companies in that same situation.",
          "score": 1,
          "created_utc": "2026-02-10 21:15:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4otsqh",
          "author": "erickrealz",
          "text": "Attach your product to a problem they already care about. Nobody buys \"nice to have\" but they buy \"this makes your existing priority easier.\" Reframe every piece of messaging around their urgent pain, not your features.\n\nCase studies are your best weapon here. Show how a similar company used your tool and got a specific measurable result tied to something leadership already tracks. \"Saved 12 hours a week on reporting\" beats \"powerful reporting dashboard\" every time. Make the ROI so obvious that ignoring you feels like leaving money on the table. That's the only way to climb up a damn priority list.",
          "score": 1,
          "created_utc": "2026-02-10 21:32:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4p1hsf",
          "author": "aimdoc-ai",
          "text": "I don't actually think that products that succeed are ever a \"nice to have\" to the ideal customer. So if you think your products are \"nice to have,\" you're just going to have to keep iterating until you find the type of buyer that literally cannot live without it.\n\nI really do think that this is how most of the \"nice to haves\" early on eventually figure out who they're selling to and how to find product-market fit. Because in the very beginning, I felt like our product fell into the same category. But over time, we've found (and are still working to find) the customers who, once they try it and they understand the value, can never turn back. ",
          "score": 1,
          "created_utc": "2026-02-10 22:09:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4qmak1",
          "author": "New_Grape7181",
          "text": "I've found that \"nice to have\" products need a different approach. You're not selling urgency, you're selling the cost of inaction over time.  \n  \nWhat worked for us was reframing the conversation around what they're losing every month they delay. Not fear-based, just maths. If your product saves 5 hours a week per person, that's 20 hours a month, which is real money walking out the door.  \n  \nWe also started targeting moments when the pain becomes real, even if temporarily. Like end of quarter when teams are scrambling, or right after they've hired someone new and realised onboarding is chaos. Timing matters more than the pitch itself.  \n  \nAnother thing is making it stupidly easy to start. We cut our onboarding from 2 weeks to 2 days because every delay gave prospects time to deprioritise us. The faster someone sees value, the harder it is for them to push it aside.  \n  \nWhat's your typical sales cycle length right now? That usually tells you if it's a positioning issue or a friction issue.",
          "score": 1,
          "created_utc": "2026-02-11 03:36:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5mvjiq",
          "author": "Deniuswriter1",
          "text": "Nice-to-have products often need a **trigger moment** to convert: new hire, growth milestone, new compliance rule, new tech stack, new leadership, budget refresh, etc.  \nIf you build campaigns around those triggers, urgency becomes natural. thewayhow is worth checking for that kind of GTM strategy.",
          "score": 1,
          "created_utc": "2026-02-16 05:21:34",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r3esyn",
      "title": "How We Got Our First 100 Customers (The Unusual Way)",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1r3esyn/how_we_got_our_first_100_customers_the_unusual_way/",
      "author": "AffableSparsh",
      "created_utc": "2026-02-13 03:48:34",
      "score": 13,
      "num_comments": 20,
      "upvote_ratio": 0.93,
      "text": "I'm a content marketer and here's how we got our first 100 customers the unusual way. \n\nNo ads. No cold calls and No traditional outbound. Just content mapped to buyer intent + Reddit.\n\nHere's the exact system we used:\n- The Content Funnel Approach\nMost companies create random content and pray they start ranking on Google or LLMs. We did the opposite, mapped every single piece to where people were in their buying journey.\n\n- For awareness (TOFU), we created SEO-optimized blog posts answering specific \"how to\" questions our ICP was searching for. We wrote listicles that ranked on Google, things like \"10 ways to solve X problem\" or \"Best tools for Y.\" And we made viral Reels and YouTube Shorts to reach people who weren't actively searching but needed to discover us.\n\nThe goal here was simple: get them into the funnel.\n\nOnce they knew about us, we moved them to consideration (MOFU). This meant in-depth guides comparing different approaches to solving their problem, email nurture sequences that educated without being salesy, and product demo videos showing exactly how our solution worked.\n\nWe weren't trying to close them yet, just building trust and demonstrating expertise.\n\nThe conversion happened at the bottom of the funnel (BOFU). We used alternative guides and more showing specific results, but the real game-changer was our free plan.\n\nWe let people experience the value first before asking for money. This experience-first approach removed all friction. They could test it, see results, then decide to upgrade.\n\nFinally, the Reddit Strategy\n\nHere's where it gets interesting. We heavily targeted high-intent subreddits where our ICP actually lived and asked questions. Not the generic r/marketing or r/business, those are too broad and full of diverse audience, we wanted niche aud.\n\nWe found the specific communities where our ideal customers hung out. Then we did something most marketers won't do: we spent two full weeks just observing and commenting. No promotion. No links. Just genuine, helpful answers to people's questions.\n\nWe built the authority first. Only when it was directly relevant did we mention our product. The leads from Reddit? Highest quality we've ever had. Because they came from real conversations, not orthodox marketing.\nThe Results: 100 customers. All organic without any ad spend.\n\nThe content brought thousands into the funnel through blogs, listicles, and Shorts. The BOFO educated them and built trust. The free plan let them experience value firsthand. And Reddit gave us the most qualified, high-intent leads because we showed up where they were already asking for help.\nThe Real Lesson\nStop creating content randomly. Map every piece to buyer intent.\n\nAnd go where your customers are asking questions, even if that's Reddit.\n\nQuestion for Founders and SaaS team: So what's your approach? Are you creating across the full funnel or just focusing on awareness?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1r3esyn/how_we_got_our_first_100_customers_the_unusual_way/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o53sgic",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-13 03:48:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o550cqv",
          "author": "magsus11",
          "text": "This is a really good example of distribution psychology. You didn’t just create content you matched intent + platform behavior + timing. Blogs for search intent. Shorts for passive discovery. Reddit for active problem-solving.",
          "score": 3,
          "created_utc": "2026-02-13 09:55:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5b6j6b",
          "author": "aviral-bhutani",
          "text": "this lines up with what I’ve seen work when content actually turns into customers, not just traffic.\n\nthe big difference here isn’t Reddit or TOFU/MOFU frameworks, it’s intent discipline. Most teams create good content but don’t decide who it’s for or what decision it’s supposed to move. So they end up with awareness that never compounds.\n\ni especially agree with the two-week observation phase on Reddit. The moment you try to shortcut trust in those communities, you’re dead. The highest-quality leads always come from answering one very specific problem really well, in public, without pitching.\n\nover the last few years I’ve been on the GTM and sales side of B2B and helped scale three businesses to around $1.2M ARR each, and this exact pattern shows up every time. Growth usually unlocks not by doing more channels, but by tightening who you sell to and forcing value discovery earlier in the journey.\n\ncurious how you decided what qualified as BOFU content versus “still education.” that handoff point is where I see most funnels quietly leak.",
          "score": 3,
          "created_utc": "2026-02-14 08:28:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o54x2aj",
          "author": "Designer_Money_9377",
          "text": "For me, the full-funnel content approach is definitely the way to go. I've tried just focusing on TOFU before, thinking volume would eventually convert, but it just created a lot of noise without moving the needle much on actual sales.\n\nI've been using a similar Reddit strategy, and it's gold for finding high-intent leads. I use LeadsRover to scan subreddits for specific keywords and questions, which helps me jump into relevant conversations faster. It even drafts initial responses, though I always tweak them to sound more like me. It's a huge time-saver for finding those niche communities you mentioned.\n\nMy advice would be to really lean into the specific problem-solving content at every stage. People on Reddit especially appreciate direct answers over generic advice.",
          "score": 2,
          "created_utc": "2026-02-13 09:24:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o54d5pp",
          "author": "kubrador",
          "text": "ah yes, the classic \"we ignored every marketing channel except the ones that worked\" playbook. truly revolutionary stuff. basically just did marketing correctly and documented it like it was a secret.",
          "score": 1,
          "created_utc": "2026-02-13 06:22:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o54mm1a",
          "author": "bankybanx",
          "text": "What was your product if I may ask? And was it a B2C or B2B?",
          "score": 1,
          "created_utc": "2026-02-13 07:46:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o56fkcq",
              "author": "AffableSparsh",
              "text": "B2B SaaS",
              "score": 1,
              "created_utc": "2026-02-13 15:29:05",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o559bn8",
          "author": "Slight_Tutor1790",
          "text": "Interesting breakdown. I think the underrated part here is the discipline of saying no to channels that do not match your buyer stage. A lot of teams say they are full funnel, but they are really just producing TOFU content and hoping it converts later. The intent mapping plus free plan combo probably did more heavy lifting than people realize.\n\nAlso curious how you measured Reddit impact. Was it direct signups, assisted conversions, or just qualitative signal from conversations. That part is usually where most teams struggle to prove value.",
          "score": 1,
          "created_utc": "2026-02-13 11:16:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o56fd2q",
              "author": "AffableSparsh",
              "text": "Just having TOFU is plain suicide. One should definitely double down on MOFU and BOFU with high quality different format content not just blogs/listicles/guides.\n\nAbout Reddit, it was somewhat direct signups, somewhat brand mentions but not promotional promotional, wherever I felt like our product couldnt solve their problem, I upfront said you should go with better alternatives than us.",
              "score": 1,
              "created_utc": "2026-02-13 15:28:06",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o57elqr",
          "author": "kafkeano",
          "text": "This is a really interesting breakdown! I've found that the observe first, engage later approach on niche communities is incredibly effective. It takes patience, but the quality of engagement and resulting leads is so much higher than just dropping links everywhere. Building that genuine presence first really pays off. For us, mapping content to intent was key too, especially for those in the consideration phase, providing detailed comparisons and use cases really helped move people down the funnel.",
          "score": 1,
          "created_utc": "2026-02-13 18:16:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5apgf4",
          "author": "InnerBuilding7949",
          "text": "Congrats mate! Just curious abt how often you post the content and how long it took to generate the very first client? I am doing the sales conversion review and struggling to verify the market demand... Been doing some outreach for weeks on Linkedin and no positive signs...just want to here from your story and advice if possible.",
          "score": 1,
          "created_utc": "2026-02-14 05:51:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5eo7dz",
          "author": "YoukBos",
          "text": "Totally agree with this approach! As I have heard quite some different ideas about his: what type of MOFU and BOFU content topics really work for you for selling SaaS?",
          "score": 1,
          "created_utc": "2026-02-14 21:37:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5gyyih",
              "author": "AffableSparsh",
              "text": "Case studies, alternative page perform really well on SERP and in LLMs but only if you structure them well.\n\nMost SaaS do it wrong, I mean from a user perspective they look terrible.\n\nBest Tool pages, free tools",
              "score": 2,
              "created_utc": "2026-02-15 07:06:34",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5hxeih",
          "author": "corwinsword",
          "text": "SEO-optimized blog posts for top of funnel content is a huge risk now. For most of these queries Google AI overview will eat your clicks.",
          "score": 1,
          "created_utc": "2026-02-15 12:30:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5ju09g",
              "author": "AffableSparsh",
              "text": "Surely our TOFU has taken a hit of around 100-150k/mo but it is still relevant and essential. We doubled down on MOFU AND BOFU especially when I came up differsnt plans like different formats and more",
              "score": 1,
              "created_utc": "2026-02-15 18:40:02",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r5nzqa",
      "title": "What’s the difference between buyer enablement and sales enablement?",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1r5nzqa/whats_the_difference_between_buyer_enablement_and/",
      "author": "Powoso",
      "created_utc": "2026-02-15 19:45:07",
      "score": 13,
      "num_comments": 2,
      "upvote_ratio": 1.0,
      "text": "I keep seeing both terms used in B2B sales conversations, buyer enablement and sales enablement, and they often get mixed together. On the surface they sound similar, but I’m starting to think they focus on different parts of the sales process.\n\nSales enablement feels more internal. Things like training reps, organizing content in tools like Seismic or Highspot, managing playbooks, and keeping messaging consistent. It’s about helping the sales team execute better.\n\nBuyer enablement seems more external. It’s about making it easier for the buyer to evaluate, align internally, and move toward a decision. I’ve seen platforms like Trumpet, Dock, or Aligned positioned more on that side because they focus on how proposals, pricing, and next steps are presented and shared after a demo.\n\nSo I’m trying to separate the two in my head. One supports the rep. The other supports the buyer.\n\nFor teams that have invested in both types of tools, how do you define the difference in practice? Where did you see the biggest impact?",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1r5nzqa/whats_the_difference_between_buyer_enablement_and/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o5k7741",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-15 19:45:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5m6qgy",
          "author": "yngbld5",
          "text": "This is a great question, and your segmentation is logical.  But I would define sales enablement as a subset of buyer enablement. \n\nTo explain, the best description of sales I’ve encountered, and adopted, is that “sales is about helping people buy.”  I also believe that today, the mission of marketing is to help people buy and retain the role of supporting sales.  But as B2B buyers increasingly self-direct their discovery and evaluation of business solutions, buyer enablement now carries 60%-80% of the buyer journey. \n\nThe things that buyers care about at the end of the sales cycle - the sales enablement stage, are the same things that they care about long before sales engagement.  Messaging, content depth, and tactics must progress to meet buyer stage needs throughout the process, before and after sales engagement.  In today’s B2B, sales enablement and buyer enablement are effectively shape-shifting to meet buyer's needs and help people buy. ",
          "score": 1,
          "created_utc": "2026-02-16 02:28:41",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r2z7tp",
      "title": "Pre event emails outperform everything",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1r2z7tp/pre_event_emails_outperform_everything/",
      "author": "AmazingSetting3838",
      "created_utc": "2026-02-12 17:13:49",
      "score": 9,
      "num_comments": 6,
      "upvote_ratio": 0.67,
      "text": "We tested a bunch of stuff around an event (LinkedIn/ads/follow ups etc.) and the weird winner was the most boring thing, plain pre event emails.\n\n  \n Not even a pitch just 'saw you’re going to this event, got 10 mins?'\n\n  \n During the conference it felt like nobody read anything. After, people were tired and slow.\n\n  \nAm I the only one seeing this pattern?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1r2z7tp/pre_event_emails_outperform_everything/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o50g8sh",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-12 17:13:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o50gw5b",
          "author": "ExitUnited6807",
          "text": "Yep 100%. During the event everyone’s brain is fried so pre event is the only time it feels like a normal work week where people actually respond.",
          "score": 2,
          "created_utc": "2026-02-12 17:16:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o50qdpb",
              "author": "These_Armadillo_9497",
              "text": "True. The bottleneck is always building the target list. Saw Pullalist mentioned for this they give you verified attendee lists in a spreadsheet so you’re not piecing it together manually.",
              "score": 3,
              "created_utc": "2026-02-12 18:01:28",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o50ob6c",
          "author": "MarcoMusings",
          "text": "Always been the way. People are too rushed at the actual thing and knackered after. They’re just getting on with what they need to do. \n\nThere’s a real sweet spot before events too. Not too early, not too close.",
          "score": 2,
          "created_utc": "2026-02-12 17:52:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o52c3r9",
          "author": "Real_Assistant6298",
          "text": "thx for this! very helpful",
          "score": 1,
          "created_utc": "2026-02-12 22:37:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o55a02p",
          "author": "Slight_Tutor1790",
          "text": "Yeah this tracks. Before the event people are still in planning mode, calendars are open and they are deciding who is worth meeting. During the event they are in survival mode.\n\nWe saw similar results when we framed it around a specific reason to meet, not just a generic intro. Something like referencing a recent launch or shared customer segment made it feel intentional, not random outreach.\n\nThe window before the event is basically prime buying attention. After that it is just recovery.",
          "score": 1,
          "created_utc": "2026-02-13 11:22:20",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r53pjq",
      "title": "Where or how can I find AI agents to help with my business?",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1r53pjq/where_or_how_can_i_find_ai_agents_to_help_with_my/",
      "author": "Moist-Inspector840",
      "created_utc": "2026-02-15 03:02:32",
      "score": 9,
      "num_comments": 12,
      "upvote_ratio": 1.0,
      "text": "Guys, I have a big question.\n\n\n\nWhen your company suddenly needs to automate activities and therefore use, for example, an AI agent, where do you usually look for these AI agents?\n\nDo you usually search on LinkedIn?\n\nDo you access the websites of companies that might develop them?\n\nDo you contact the person who is a software developer?\n\n\n\nOr is there another way?\n\n\n\nP.S.: Considering that perhaps your companies don't have a software team.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1r53pjq/where_or_how_can_i_find_ai_agents_to_help_with_my/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o5g4koh",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-15 03:02:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5hgff1",
          "author": "CommunicationRare603",
          "text": "I think looking at specific directories can help for example I use coldemailkit .com for finding sales tools for your use case you can just use them or self host openclaw if you are technical ",
          "score": 2,
          "created_utc": "2026-02-15 09:55:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5gcatp",
          "author": "Techenthusiast_07",
          "text": "Great question. I usually start with LinkedIn to see real case studies, then check niche communities and tool directories. If there’s no dev team, I look for no-code AI builders or agencies with clear results.",
          "score": 1,
          "created_utc": "2026-02-15 03:57:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5h68lw",
          "author": "Qazicious",
          "text": "It depends like for which purpose you required AI automation. Sometimes, your business don't need AI automation it only needs automated workflow which is different from AI automation. \nCan you describe that for what purpose you need AI Automation?",
          "score": 1,
          "created_utc": "2026-02-15 08:16:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5htec9",
          "author": "Mularkeyy",
          "text": "Start with the problem, not the tool. Be clear on what you want automated first.\n\nIf you don’t have a dev team, your best bets are marketplaces like Upwork for custom builds, small AI automation agencies, or no code tools like Zapier and Make that already have AI features built in. LinkedIn is good for finding consultants, but I’d look for someone who can ship a small working automation fast, not just sell strategy.\n\nIf you share what you want to automate, I can suggest a more specific route. We also talk about AI workflows and lead gen on r/LeadGenSEA if you want more ideas.",
          "score": 1,
          "created_utc": "2026-02-15 11:56:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5izgcv",
          "author": "Moist-Inspector840",
          "text": "Guys, I’m receiving countless messages in my inbox where many people are asking whether they could develop some AI Agent for my company.\n\nTo be very clear, I did not create that post to look for a developer or a development team to build a software solution for me.\n\nThe purpose of that post is simply to discuss an idea, and I noticed that several people also shared very interesting perspectives.\n\nI just wanted to have a discussion about, for example, if I have numerous spreadsheets to work with and would like to use an AI agent to consolidate them, where I would look for such a software solution.\n\nOnce again, this is only a discussion of ideas.",
          "score": 1,
          "created_utc": "2026-02-15 16:11:54",
          "is_submitter": true,
          "replies": []
        },
        {
          "id": "o5izm7w",
          "author": "Noahm0902",
          "text": "These guys did good check them out they’re amtechai . Also there’s companies that do texts for if you miss calls so that’s what helped me most I can send a link for them too. Both really helpful 👍",
          "score": 1,
          "created_utc": "2026-02-15 16:12:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5lvmwr",
          "author": "Grouchy_Possible6049",
          "text": "If you're looking to implement AI for your business without a software team, I'd suggest starting by looking at specialized AI solution providers or freelance platforms like Upwork or LinkedIn. You can also check platforms like Vendasta, which offers AI powered tools for businesses. Whatever you choose, make sure the AI solution fits your specific business needs.",
          "score": 1,
          "created_utc": "2026-02-16 01:17:25",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r5erd3",
      "title": "Anyone here actually using TikTok for B2B?",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1r5erd3/anyone_here_actually_using_tiktok_for_b2b/",
      "author": "catchinghappy",
      "created_utc": "2026-02-15 13:34:10",
      "score": 9,
      "num_comments": 31,
      "upvote_ratio": 1.0,
      "text": "I work in B2B marketing and and have been hearing some chatter about TikTok being “the next channel” for B2B.\n\nGenuinely curious what people here are actually doing in practice:\n\n\\- Are you using TikTok at all for B2B?\n\n\\- Organic, paid, or both?\n\n\\- What kind of businesses (SaaS, services, industrial, healthcare, etc.)?\n\n\\- Is it just awareness, or have you seen real leads / pipeline?\n\nWould love to hear honest takes. ",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1r5erd3/anyone_here_actually_using_tiktok_for_b2b/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o5i6cg0",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-15 13:34:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ib3sd",
          "author": "Still-Lengthiness180",
          "text": "tiktok wont even come close to youtube and instagram\n\nnot for online businesses\n\neven hormozi says that his b2b consultancy program gets almost 0 leads from tiktok\n\n",
          "score": 2,
          "created_utc": "2026-02-15 14:03:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5j2b0y",
              "author": "Royal_Machine_9524",
              "text": "Ohh really ",
              "score": 2,
              "created_utc": "2026-02-15 16:25:33",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o5ihugd",
              "author": "catchinghappy",
              "text": "oooh. do you recall what video this was? curious how insta vs tiktok differs",
              "score": 1,
              "created_utc": "2026-02-15 14:42:07",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5ijbl9",
                  "author": "Still-Lengthiness180",
                  "text": "i guess if you search \"hormozi best content platforms\" you'd find something",
                  "score": 1,
                  "created_utc": "2026-02-15 14:50:06",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5jaiwb",
          "author": "AffableSparsh",
          "text": "I am planning to start my work on TikTok within next 2 months. Havent used it lately.\n\nAny quick grower tips are welcomed",
          "score": 2,
          "created_utc": "2026-02-15 17:05:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5jrv81",
              "author": "Zealousideal-Job6344",
              "text": "Not tik tok but I tried Instagram and it was not at all helpful. It took too much time to create and the ROi was next to zero",
              "score": 1,
              "created_utc": "2026-02-15 18:29:41",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5jskg5",
                  "author": "AffableSparsh",
                  "text": "For D2C, IG is creampie.\n\nBut if you're targeting B2B B2C SaaS, maximize on Reddit. I dont kbow about others, we literraly survived the fall because of Reddit. 20-30 organic leads just of Reddit",
                  "score": 1,
                  "created_utc": "2026-02-15 18:33:05",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5istek",
          "author": "appu49",
          "text": "I know a person who onows person that's been telling a person how cool is tiktok for B2B, its whole new audience that we can tap into and get some fresh leads and that person has never done it himself when ask about.\nSo my take is it wont work. The decision makers are not on tiktok, mainly for SaaS, but may be there is few genz and boomer audience for b2c but not much for b2b.",
          "score": 1,
          "created_utc": "2026-02-15 15:39:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5j1v16",
          "author": "No_Boysenberry_6827",
          "text": "honest take from someone in B2B SaaS: tiktok drove awareness but the conversion path is brutal. what actually moved pipeline for us was automated outbound that adapts based on how prospects respond. the system learns which messaging converts for each segment and just keeps getting better. way higher ROI per dollar than any social channel. are you seeing actual pipeline from tiktok or mostly top of funnel?",
          "score": 1,
          "created_utc": "2026-02-15 16:23:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5j9t11",
              "author": "Pale-Web3080",
              "text": "Which platform did you use the most?",
              "score": 1,
              "created_utc": "2026-02-15 17:01:34",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5jbomq",
                  "author": "No_Boysenberry_6827",
                  "text": "email was the biggest driver but it only worked once we stopped doing generic blasts. the system we use now researches each prospect and writes personalized outreach based on their actual situation. completely different from the spray and pray approach. are you running outbound currently or mostly relying on inbound from content?",
                  "score": 1,
                  "created_utc": "2026-02-15 17:10:45",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5jfoop",
          "author": "Tiny-Clue-136",
          "text": "It was such a pain to setup, get verified, etc. that we got turned off before really starting",
          "score": 1,
          "created_utc": "2026-02-15 17:30:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5jsnok",
          "author": "Responsible-Brick881",
          "text": "Yeah from what I've heard from various clients that have tried tiktok its not really a runner for them.\n\nThats not to say it doesn't work for every b2b though - I'm sure there's some sort of niche that it could work for.\n\nWhat sort of product have you got and what channels are you using for paid?",
          "score": 1,
          "created_utc": "2026-02-15 18:33:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5jzprq",
          "author": "igorfortalezan8n",
          "text": "TikTok is terrible even for B2C, let alone B2B.",
          "score": 1,
          "created_utc": "2026-02-15 19:07:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5k0xc5",
          "author": "racy_quill",
          "text": "I tried it for about 7 months, I think it’s great for building a following and even getting clear on your niche because day to day application in business and translating to short form are two completely different things. \n\nI think I had a lot of great traction there, but I can can’t say that translated to leads.",
          "score": 1,
          "created_utc": "2026-02-15 19:13:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5kj5c9",
          "author": "canalcityrunner",
          "text": "Launching TikTok for personal branding - I’m agency side. One month in… the grind continues",
          "score": 1,
          "created_utc": "2026-02-15 20:46:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5kjriu",
          "author": "Wise-Trouble-653",
          "text": "The real question isn’t whether TikTok works for B2B. It’s whether your buyers spend time there in a mindset that supports buying.\n\nA lot of the “next channel” talk is really about cheap reach, not qualified demand. Awareness is easy to generate; intent is harder.\n\nIn practice, most B2B wins I’ve seen are founder-led, insight-heavy content driving top-of-funnel attention, then retargeting elsewhere. Pipeline rarely closes natively on-platform.\n\nThe companies seeing traction tend to be SaaS or agencies with a clear POV, not industrial firms chasing trends.\n\nAre you trying to open new conversations, or accelerate deals already in motion?",
          "score": 1,
          "created_utc": "2026-02-15 20:49:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5mgsex",
          "author": "CerealKiller5609",
          "text": "From what I’ve seen, it works better for positioning and authority than direct conversions.",
          "score": 1,
          "created_utc": "2026-02-16 03:34:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ngw95",
          "author": "svlease0h1",
          "text": "people are testing tiktok for b2b but results depend on audience behavior. short product clips and founder stories seem to work better than polished ads. one saas team posted weekly demos for two months and got a few real inbound messages. awareness grows faster than pipeline here.",
          "score": 1,
          "created_utc": "2026-02-16 08:30:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5nhcw9",
              "author": "catchinghappy",
              "text": "do ya have the account of the saas team?",
              "score": 1,
              "created_utc": "2026-02-16 08:34:48",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5nitk4",
                  "author": "svlease0h1",
                  "text": "yeah, i have",
                  "score": 1,
                  "created_utc": "2026-02-16 08:48:39",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5idkd4",
          "author": "Equivalent-Salt4475",
          "text": "Not yet, but the b2c channels for b2b ads is real right now!  We're using Vector to target specific contacts on reddit, X, Meta...seeing great results because they show us who's clicking and not converting too. ",
          "score": 0,
          "created_utc": "2026-02-15 14:17:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5ihxmw",
              "author": "catchinghappy",
              "text": "do you mind if I send you a message to learn more about how you’re running ads? thanks so much in advance!",
              "score": 1,
              "created_utc": "2026-02-15 14:42:36",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5ke9ma",
                  "author": "Equivalent-Salt4475",
                  "text": "sure thing",
                  "score": 1,
                  "created_utc": "2026-02-15 20:21:21",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1r3y461",
      "title": "How do you handle marketing analytics when attribution gets messy?",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1r3y461/how_do_you_handle_marketing_analytics_when/",
      "author": "k5survives",
      "created_utc": "2026-02-13 19:10:00",
      "score": 8,
      "num_comments": 17,
      "upvote_ratio": 1.0,
      "text": "Dealing with the classic attribution nightmare. We're running campaigns across paid social, search, display and our mobile app, but every platform claims credit for the same conversion. Google Analytics says one thing, Facebook another and our internal BI shows completely different numbers. \n\nThe disconnect is making it impossible to optimize spend or prove ROI to leadership. What's your approach to getting a single source of truth for marketing analytics?",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1r3y461/how_do_you_handle_marketing_analytics_when/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o57pqkl",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-13 19:10:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o58au5b",
          "author": "Impressive-Amount255",
          "text": "To your question about having a single source of truth for marketing analytics, my answer is simple: I look at campaign level only, always. And that’s the only thing I’ve ever seen actually work.\n\nI’ve worked almost my entire career in B2B SaaS, so attribution has always been a battle. I’ve never seen a company using first-touch attribution. Most of the companies I’ve worked with were either on last-touch or multi-touch.\nLast-touch misses 90% of the marketing efforts.\nMulti-touch is a mess to set up, and once it’s set up, it’s highly unreliable.\nThe only thing I’ve found to be working is stepping away from that.\n\nThere’s a bit of a learning curve to work with leadership to move past attribution, but once that’s done, it’s a huge relief for both you and them.\n\nSo how does it work, basically?\nYou stop bothering with channel-level attribution and start looking at campaign-level attribution.\nThis obviously requires super clear and tightly integrated marketing campaigns around specific audiences.\n\nFor example, let’s say you have one audience made of CMOs. You build one campaign around this audience and integrate all your channels inside that campaign. Now, any time a CMO comes in, regardless of which channel they came from, since everything is tightly integrated, you consider it a campaign win, not a channel win.\n\nThen you look at ROI at the campaign level:\ntotal budget spent on the campaign\ntotal revenue generated by the campaign\n\nThis does a few things:\nIt saves you a ton of time building reports and trying to make data from multiple platforms tell the same story.\nIt saves you time explaining that story to leadership.\nMost importantly, it prevents leadership from cutting channels just because you can’t “prove” attribution, even though you know deep down that those channels are actually critical to your success.\n\nIf you don’t mind doing a bit of reading, I strongly suggest looking into the RIO integrated campaign framework that explains exactly how to do this and why it helps.\n\nThis is what I started moving toward a couple of years ago, and quite frankly, it now saves me multiple hours every week and a ton of headaches.",
          "score": 3,
          "created_utc": "2026-02-13 20:55:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o58b3kg",
          "author": "cjsb28",
          "text": "What helped us was implementing server-side tracking alongside client-side. Also got an MMP to reconcile everything. Still not perfect but way better than trusting Meta's self-reported numbers.",
          "score": 2,
          "created_utc": "2026-02-13 20:56:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5n6by5",
              "author": "k5survives",
              "text": "I don't we've a perfect set up with all the changes these days",
              "score": 1,
              "created_utc": "2026-02-16 06:52:30",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o57rjhn",
          "author": "Responsible-Brick881",
          "text": "Whats the customer journey out of interest? Is it a direct buy on site, or lead - demo - close type of thing?",
          "score": 1,
          "created_utc": "2026-02-13 19:18:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5n6hv6",
              "author": "k5survives",
              "text": "Mostly starts with lead to demo and then close, with a few self-serve signups mixed in. The long cycle def makes attribution even messier.",
              "score": 1,
              "created_utc": "2026-02-16 06:53:58",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o580vg4",
          "author": "missMJstoner",
          "text": "Multi-touch attribution is your friend here. Set up UTM parameters consistently and use last-click as baseline but also track first-touch and assisted conversions. Visualize the overlap somehow.",
          "score": 1,
          "created_utc": "2026-02-13 20:05:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5n6jzn",
              "author": "k5survives",
              "text": "I'll check this approach and see if it works",
              "score": 1,
              "created_utc": "2026-02-16 06:54:28",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5f4l0n",
          "author": "AndreiSfarc",
          "text": "We have been doing BI for marketing performance and I can tell that always will be inconsistency between GA4 and DSPs.\n\nGA4 is using an approximation algorithm and that is the first point of inconsistency.\n\nAlso, exported data from GA4, will be different as a total from what you see in there.\n\nThe BI team might receive the data later and not be always at 100% accuracy.\n\nMy opinion is too pick a source of truth that will be used for the reports BI teams is doing.\n\nSome KPIs can be from Facebook, some from GA4.\nThis is the only combination that can bring you the closest to the real picture.\n\nOr ask for attribution model views, to switch the KPI view between Facebook and GA4.",
          "score": 1,
          "created_utc": "2026-02-14 23:09:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5n6qxl",
              "author": "k5survives",
              "text": "perfect alignment’s impossible and we're a good example. Picking one source of truth per KPI is essential.",
              "score": 1,
              "created_utc": "2026-02-16 06:56:10",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5gle1f",
          "author": "murtuza78",
          "text": "Attribution is always going to be a bit of guesswork since every platform wants to take the win. What I find works best is to zoom out and look at broader trends like overall lift and quality of leads coming in, then use consistent tracking like UTMs to spot patterns. Most leadership doesn’t care about which platform deserves the medal, they just want to see the business results moving. I’d focus on aligning your reporting around campaign or audience groups instead of getting stuck in the weeds about which platform’s numbers are \"right\" because honestly—they’re all a little off",
          "score": 1,
          "created_utc": "2026-02-15 05:07:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5n6u5x",
              "author": "k5survives",
              "text": "We burned hands trying to chase accuracy",
              "score": 1,
              "created_utc": "2026-02-16 06:56:57",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5ifgup",
          "author": "TilenVeliki",
          "text": "This is painfully familiar. I ran an e-commerce store for 15 years and lived this exact problem.\n\nGoogle took credit, Meta took credit, Organic took credit,etc ... At the end final numbers  told a different story entirely.\n\nThe core issue is very simple. every platform is incentivized to make itself look good. They're not lying exactly, they're just each telling their own version of the truth.\n\nWhat finally worked for me was stopping the platform-level reconciliation game altogether. I built Enalitica to work backwards from actual orders — each order gets enriched with the real touchpoints (first touch, last touch, what happened in between) based on click IDs and UTMs, not platform reporting.\n\nSo instead of asking \"which platform is right?\" I just look at: \"This order came from someone who first clicked a Meta ad, then came back through Google, then bought direct.\"\n\nNo weighting. No modeling. Just what happened.\n\nIt won't make the numbers perfectly match ( nothing will) but it gives you one version of truth that's based on your actual sales, not platform claims.",
          "score": 1,
          "created_utc": "2026-02-15 14:28:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5n6wsb",
              "author": "k5survives",
              "text": "Will try working backwards for real orders",
              "score": 1,
              "created_utc": "2026-02-16 06:57:37",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5nctbk",
          "author": "Slight_Tutor1790",
          "text": "At some point you have to accept that attribution will never be perfectly clean, especially with a long lead to demo cycle. What helped us was separating optimization from reporting. For optimization we look at directional signals at the channel level. For reporting to leadership we anchor everything to pipeline and closed revenue from the CRM.\n\nInstead of trying to reconcile every number, we define which system owns which metric and stick to it. That way the story stays consistent even if the platforms disagree.",
          "score": 1,
          "created_utc": "2026-02-16 07:51:55",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r4jk6m",
      "title": "The golden rule of Reddit marketing",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1r4jk6m/the_golden_rule_of_reddit_marketing/",
      "author": "Healthy_Dot3964",
      "created_utc": "2026-02-14 12:35:29",
      "score": 8,
      "num_comments": 11,
      "upvote_ratio": 1.0,
      "text": "The golden rule of Reddit marketing is '**Provide Value, Don't Sell.**'\n\nWhen you find a relevant question, focus on giving the best, most specific answer possible. Don't be afraid to share your expertise freely. This builds trust and authority.\n\nInstead of a sales pitch, your detailed response acts as a demonstration of your skills. If a user finds your answer helpful, they are more likely to click on your profile to learn more about you and your business.\n\nThis 'soft sell' approach feels authentic and is highly effective on a platform that dislikes overt advertising. The goal is for potential clients to come to you because they've already seen the value you provide.\n\n **Is there anything you would like to add?**",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1r4jk6m/the_golden_rule_of_reddit_marketing/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o5bwv6s",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-14 12:35:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5bxrny",
          "author": "AdamYamada",
          "text": "I agree. \n\n\nIt's simple yet most brands and companies on here come and mess it up. 🤷🏽‍♂️",
          "score": 1,
          "created_utc": "2026-02-14 12:42:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5byab4",
              "author": "Healthy_Dot3964",
              "text": "yeah the same thing I noticed after trying reddit in the bad way",
              "score": 1,
              "created_utc": "2026-02-14 12:46:25",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5cf7d6",
          "author": "Designer_Money_9377",
          "text": "When I jump into Reddit threads, I always try to give a full answer without immediately pushing my product. I've found that just dropping a link or a sales pitch usually gets ignored or downvoted.\n\nI've been using LeadsRover to spot relevant questions, and it drafts responses that mention my tool pretty naturally. It's helped me stick to the \"value first\" rule while still getting the product in front of people. It's not a magic bullet, but it helps.\n\nThe key is to genuinely help, then let your expertise do the talking.",
          "score": 1,
          "created_utc": "2026-02-14 14:35:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5cs2so",
          "author": "RecognitionHot9149",
          "text": "I’m still waiting for an AI to come post and shill",
          "score": 1,
          "created_utc": "2026-02-14 15:45:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5dmea2",
          "author": "Radiant-Welcome4876",
          "text": "I use Leadmatically to automate finding those exact Reddit conversations where providing genuine value is most relevant. It handles the discovery, so you can focus entirely on crafting those helpful replies.",
          "score": 1,
          "created_utc": "2026-02-14 18:17:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5fx1m1",
          "author": "ChrisCollinsSrDotCom",
          "text": "Why does every reply have to lead to making a sale....I  already know that people are here to make sales, the question is how smoth they can be.\n\nI feel like I I'm a pretty lady and everyone that interacts with my post just wants to go on a date.\n\nI  feel its hard to find interaction that doesnt have the desire to accept my money. \n\nI am OK with that, I dont mind someone saying... hey I  sell a solution to your problem. \n\nI do have a problem  with the way its supposed  to go....\n\nYou know, forst the answer  then the back and forth messages and then the aha I  sell the solution. \n\nOf course. This changes a little bit from one situation to another, but you get the gist of what I'm saying? Am I alone here if I am so be it, but am I?",
          "score": 1,
          "created_utc": "2026-02-15 02:10:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5hl0um",
              "author": "Healthy_Dot3964",
              "text": "**Yeah, sometimes I feel like everyone wants to sell you something, especially since Reddit has its own way for people to interact with each other not like LinkedIn or X.**",
              "score": 1,
              "created_utc": "2026-02-15 10:40:04",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5j1p3s",
                  "author": "ChrisCollinsSrDotCom",
                  "text": "?",
                  "score": 1,
                  "created_utc": "2026-02-15 16:22:35",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5imskx",
          "author": "CX-Phil",
          "text": "I’m happy to almost give our services away to folk I chat to on here that need help. At least low cost / low effort ones. I look at it as a loss leader to what larger fees / commissions / sales we may gain from a client and the lower cost of acquiring that from giving our time away is usually better than trade shows, marketing or outbound.",
          "score": 1,
          "created_utc": "2026-02-15 15:08:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5mpyyz",
          "author": "Gold-Region-2166",
          "text": "The other key thing is to actually hang around and engage outside your own threads. Upvote good answers, drop a helpful comment, and just be part of the community. People spot the “drive-by” marketers quick, so if you’re here for the long haul and actually show up, your advice feels way more genuine. That’s what gets you long-term trust, not just a one-off answer.",
          "score": 1,
          "created_utc": "2026-02-16 04:39:43",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r5v8n5",
      "title": "What’s the right way to track brand accuracy in AI search?",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1r5v8n5/whats_the_right_way_to_track_brand_accuracy_in_ai/",
      "author": "alizastevens",
      "created_utc": "2026-02-16 00:45:13",
      "score": 8,
      "num_comments": 14,
      "upvote_ratio": 0.91,
      "text": "We’ve been testing a bunch of prompts about our company across AI tools.\n\nSome responses nailed it but ohers were half-right in a way that feels worse than fully wrong. \n\nIs anyone actually tracking this? Are you all auditing this somehow\n\n",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1r5v8n5/whats_the_right_way_to_track_brand_accuracy_in_ai/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o5lqfss",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-16 00:45:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5lqmra",
          "author": "albrasel24",
          "text": "We found out by accident. Someone was doing an internal demo and asked ChatGPT about us and it kept pulling from this TechCrunch article from 2021.\n\nWe'd completely rebranded since then but that one piece was apparently glued into the training data somehow. Worst part was we had no clue how widespread it was.\n\nStarted using Meridian just to figure out the actual scope of it and it was worse than we thought. Showing up across a bunch of query types not just direct brand searches.\n\nWe did a content push to basically drown out the old stuff with more recent mentions and tracked it over a few months. It moved the needle but slowly.\n\nIt didn't fix it magically or anything but it turned our vague concern into an actual project with data behind it.\n\n",
          "score": 5,
          "created_utc": "2026-02-16 00:46:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5lqpfy",
          "author": "goarticles002",
          "text": "We started doing this manually about 6 months ago. Built a spreadsheet with 40 core prompts about our company across ChatGPT, Perplexity, Claude and Gemini. Run them weekly, log the responses verbatim, then score them against a \"brand truth\" document we wrote internally. It's tedious but it showed us patterns we never would have caught otherwise. The half-right problem you mentioned is real and honestly harder to deal with than fully wrong answers because it's harder to flag internally.",
          "score": 1,
          "created_utc": "2026-02-16 00:46:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5m0itj",
              "author": "Ok_Face_2942",
              "text": "Are you also running these prompts on a certain number of accounts internally? Are you also modifying the core prompt slightly for close variants? Super curious!",
              "score": 1,
              "created_utc": "2026-02-16 01:48:51",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5lqrsl",
          "author": "pouldycheed",
          "text": "The half-right thing is actually what makes this so hard to prioritize internally. If AI says something completely wrong it's easy to escalate. But if it says something that's like 70% accurate with the wrong framing or outdated positioning, stakeholders kind of shrug. I've been trying to frame it as a reputation risk issue rather than a search issue and that seems to get more traction in meetings.",
          "score": 1,
          "created_utc": "2026-02-16 00:47:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5lsi66",
          "author": "gptbuilder_marc",
          "text": "The tricky part isn’t when it’s fully wrong.\n\nIt’s when it’s half right. That’s what quietly reshapes perception.\n\nAre you dealing with straight factual errors, subtle positioning shifts, or just outdated info getting resurfaced? Those point to very different root causes.",
          "score": 1,
          "created_utc": "2026-02-16 00:57:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5n33xz",
              "author": "United_Parking_1683",
              "text": "The half right issue is usually a narrative problem, not just a prompt problem. We think about it in 3 layers   \nWhat the AI says  \nWhat sources it pulls from  \nWhat public conversations are shaping those sources  \nMost teams only measure 1.",
              "score": 1,
              "created_utc": "2026-02-16 06:24:08",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5mygbr",
          "author": "Old-Environment8760",
          "text": "Just made the post on how fix that to some extent:\n\nhttps://www.reddit.com/r/b2bmarketing/s/cuaNIdYkaU\n\nOverall for commercial prompts tracking we use nobori.ai, built for B2B specifically. Probably you haven't heard about it.",
          "score": 1,
          "created_utc": "2026-02-16 05:45:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5mzuav",
          "author": "luminouscascade78",
          "text": "Yeah, I’ve been in the same boat. I’ve been using Searchtides to track how our brand shows up across different AI tools, and it’s been really helpful. Since I started using them, I’ve been able to quickly spot issues and fix misleading info before it spreads, and it’s saved me a lot of time and stress",
          "score": 1,
          "created_utc": "2026-02-16 05:56:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5n34nu",
          "author": "supriya_l89",
          "text": "The most practical method for tracking this condition requires the implementation of SEO monitoring systems. The testing procedure should involve a fixed prompt set which includes brand and product and competitors and use cases. The scoring system will evaluate responses based on three criteria:  \n  \nFactual accuracy  \n  \nCompleteness  \n  \nBrand positioning alignment  \n  \nRisk level (misleading vs harmless)  \n  \nThe system requires documentation of all patterns which occur in the process rather than recording solely the events which occur once.   \n  \nB2B companies which have a larger size should include their communications and legal teams whenever critical business claims require verification. The models require validation of their source materials because outdated content and third-party sites represent common sources of content.   \n  \nThe existing process requires improvement because the current system needs both preliminary audits and assessment methods.",
          "score": 1,
          "created_utc": "2026-02-16 06:24:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ncs2y",
          "author": "Slight_Tutor1790",
          "text": "We started treating this less like a search problem and more like a messaging drift problem. Instead of only scoring accuracy, we track how often the core story shows up correctly across different query types. Not just who we are, but what problem we solve and for who.\n\nWhat helped was mapping prompts to stages of the buyer journey and seeing where the narrative shifts. Sometimes AI is accurate on facts but wrong on positioning during comparison or use case queries. That usually points to gaps in public content rather than model behavior.",
          "score": 1,
          "created_utc": "2026-02-16 07:51:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5nj5hy",
          "author": "Difficult_Buffalo544",
          "text": "I've been down this rabbit hole too. The problem is that most models just hallucinate your brand's logic when they don't have a clear anchor. Auditing is basically impossible if you're just throwing random prompts at the wall.\n\nYou really need a dedicated logic layer that forces the AI to stick to your specific style and vocabulary rules. We've been using Atom Writer for our content because it has this Brand Anchor tech that actually keeps things on track. It's way more reliable than standard tools because it won't just make things up to fill the gaps. Are you seeing these inaccuracies mostly in the tone or the actual facts about your product?",
          "score": 1,
          "created_utc": "2026-02-16 08:51:45",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}