{
  "metadata": {
    "last_updated": "2026-01-19 16:49:57",
    "time_filter": "week",
    "subreddit": "b2bmarketing",
    "total_items": 20,
    "total_comments": 223,
    "file_size_bytes": 196394
  },
  "items": [
    {
      "id": "1qbfbsh",
      "title": "I ran Reddit marketing for 10+ SaaS companies, and here's what actually works",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qbfbsh/i_ran_reddit_marketing_for_10_saas_companies_and/",
      "author": "toastybread124",
      "created_utc": "2026-01-13 02:34:09",
      "score": 83,
      "num_comments": 26,
      "upvote_ratio": 0.94,
      "text": "Hey everyone, I've spent the last few years running Reddit campaigns for clients across different industries, and I keep seeing the same mistakes over and over. Most brands either treat Reddit like Twitter (big mistake) or ignore it completely because they think it's just memes and arguments.\n\nHere's what actually drives results:\n\n**1. Reddit SEO is Evergreen (and Most People Are Sleeping on It)**\n\nUnlike every other social platform where your post dies in 24 hours, Reddit content lives forever and keeps bringing traffic.\n\nReddit posts rank insanely well on Google. A huge chunk of Reddit threads land in the top 5 search results, especially for product searches and review queries.\n\nTraffic compounds over time. A well-placed post from 6 months ago can still drive clicks daily if you targeted the right keywords.\n\nBoth broad and hyper-specific keywords work. The key is knowing which subreddits your audience actually hangs out in.\n\nHow to find opportunities:\n\nUse Ahrefs Keyword Explorer to find high-volume keywords that are trending up\n\nLook at your competitors' blog posts that rank well—then create Reddit discussions around similar topics with broader angles and similar keywords\n\nYour Reddit post will often rank right next to (or above) those blog posts if you do it right\n\n**2. Brand Protection on Reddit Isn't Optional Anymore**\n\nHere's something that caught a lot of companies off guard: ChatGPT and other AI tools now pull from Reddit threads to answer questions about products and companies.\n\nYour potential customers are asking AI \"what do people think about \\[your company\\]?\" and getting answers based on Reddit discussions\n\nSome competitors have figured this out and actively use Reddit to trash-talk other brands\n\nIf you're selling high-ticket products/services, your buyers are 100% reading Reddit threads about you during their research\n\nThe shift is real: Reddit used to be niche, but it's becoming more mainstream. More people = more conversations about brands = bigger impact on your reputation.\n\nWhat to do:\n\nUse F5Bot (free tool) to monitor mentions of your brand name across Reddit\n\nSet up alerts so you know when people are talking about you\n\nJump into conversations early before narratives form without your input\n\n**3. Reddit Cold DMs Can Work (But You Need to Be Smart About It)**\n\nCold outreach on Reddit works way better than most people think, but only if you're not spammy about it.\n\nRedditors can smell a sales pitch from a mile away. Your DM needs to be genuinely relevant to something they posted or commented on. Generic templates get you blocked immediately.\n\nThe Real Strategy: LM SEO + Brand Protection + Genuine Engagement\n\nMost successful Reddit strategies focus on three things:\n\nLM SEO and evergreen traffic - Creating content that ranks and drives visitors for months/years\n\nBrand reputation management - Monitoring and participating in discussions about your company\n\nBuilding actual relationships - Engaging authentically in relevant communities over time\n\nReddit isn't a growth hack. It's not about going viral or getting instant conversions. It's about long-term positioning and making sure you're part of the conversation when people research your space.\n\nThe brands winning on Reddit right now aren't the ones running ads or posting promotional content. They're the ones consistently showing up, providing value, and building trust over time.\n\nYour audience is already on Reddit talking about your industry. The only question is whether you're there too.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qbfbsh/i_ran_reddit_marketing_for_10_saas_companies_and/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "nza5h3g",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-13 02:34:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzcqs74",
          "author": "Alternative-Cake3773",
          "text": "Thanks for the share man. Appreciate it. The second one is really something I need to keep in mind. I didn't really know that brands would do that on this ol Reddit.",
          "score": 4,
          "created_utc": "2026-01-13 14:04:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzd79ke",
          "author": "signalpath_mapper",
          "text": "From the ops side, the evergreen part is real, but it cuts both ways. We saw old Reddit threads drive traffic months later, and suddenly support tickets spiked from context that was outdated. Brand protection matters because those same threads turn into screenshots customers send to support when something goes wrong. Cold DMs are where I get nervous, most of the fallout lands in the inbox when people feel creeped out or misled. What actually helped for us was having clear, current answers we could point to publicly so support was not rewriting the same explanation all day. Curious how you’ve seen teams keep old threads accurate once they start ranking.",
          "score": 2,
          "created_utc": "2026-01-13 15:28:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzhy9mz",
          "author": "Realestate_Uno",
          "text": "Great info",
          "score": 2,
          "created_utc": "2026-01-14 06:47:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzklqeb",
              "author": "toastybread124",
              "text": "Thank you!! :)",
              "score": 1,
              "created_utc": "2026-01-14 17:20:27",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzp0wxc",
          "author": "JayOppoy",
          "text": "Thanks for sharing, definitely helpful.",
          "score": 2,
          "created_utc": "2026-01-15 08:13:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzdqb6a",
          "author": "chandj054",
          "text": "This post is a great reality check for anyone still treating reddit like a billboard because the seo value is actually insane right now. The point about ai tools pulling from threads is something most founders completely miss until they see a hallucination or a bad review cited in a chat response. It is also worth noting that if you are pulling leads from these discussions to move them into an email sequence you have to be careful with deliverability. Using tools like emailverfier is a must because reddit users often use burner emails or old accounts that will bounce and kill your sender reputation. Authenticity is definitely the only way to survive here without getting banned by a mod on a power trip.",
          "score": 1,
          "created_utc": "2026-01-13 17:05:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzfaf07",
          "author": "agm_93",
          "text": "This is spot on. I worked at a private equity venture studio and im turning their internal tool into a product for founders. would be happy to share it with anyone interested\n\nit's the fastest workflow: ai learns keyword fit (frequency used / relevant) -> ux that allows you to personalize at scale without spamming",
          "score": 1,
          "created_utc": "2026-01-13 21:24:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzkfpfz",
          "author": "Good-Budget7176",
          "text": "lovely u/toastybread124 \\- this is great info anyway. I learned about the F5 bot from you, so thank you.\n\nMeanwhile, if we run a sub-reddit, any growth hack strategies that you want to recommend?",
          "score": 1,
          "created_utc": "2026-01-14 16:53:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzkk706",
              "author": "Wide_Brief3025",
              "text": "One thing that works for subreddit growth is actively engaging with relevant threads outside your own sub and inviting thoughtful users to participate. Also, target discussions where your audience hangs out. If you want to catch mentions of specific keywords in real time, ParseStream has made this process a lot easier for me without missing out on high intent leads.",
              "score": 1,
              "created_utc": "2026-01-14 17:13:25",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nzkqe5p",
              "author": "toastybread124",
              "text": "Hey man,  \nI haven’t really done anything with subreddit growth yet. We’re starting to mess around with it on the agency side, and if it ends up working, I’ll reach out.",
              "score": 1,
              "created_utc": "2026-01-14 17:41:40",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzkzg9z",
          "author": "zabiranik",
          "text": "Really great insights!",
          "score": 1,
          "created_utc": "2026-01-14 18:21:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzlnqtx",
          "author": "Kamel_Ben_Yacoub",
          "text": "Reddit Ads is also a great paid channel for B2B SaaS companies if you have the right approach and an active audience.",
          "score": 1,
          "created_utc": "2026-01-14 20:10:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzojrq0",
          "author": "crazyreaper12",
          "text": "Thank you for putting the effort to share these tips",
          "score": 1,
          "created_utc": "2026-01-15 05:45:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzxnz1z",
          "author": "StayYoung007",
          "text": "Thanks for sharing this.",
          "score": 1,
          "created_utc": "2026-01-16 15:27:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o07ep1b",
          "author": "Mother_Tell4995",
          "text": "You have to be able to make Reddit ads work as well because you can’t just post about your company and expected to drive revenue. I recommend hiring some people to recommend your software strategically in comments where no one knows they’re working for you.",
          "score": 1,
          "created_utc": "2026-01-18 00:41:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzax3y7",
          "author": "rooom40",
          "text": "This pretty much lines up with what I've seen as well. I think especially the evergreen SEO angle. I think a lot of people are still underestimating how much reddit threads can outrank blog content in general.If you can hop on a thread that gains a lot of traction, it's becomes an asset that doesn't go away. One thing I'd add is that the companies that succeed, I feel like a lot of times they separate their identity from the company agenda. I think it's really important to build a persona that doesn't just feel like it's pushing something right down your throat. I think the ones that build karma by being helpful before their brand is mentioned is way more credible when they do jump in. I'm curious how you've seen teams handle internal buy-in on this. I feel like Reddit doesn't have the cleanest attribution and I could see how it would be a hard sell compared to channels with dashboards and immediate ROI.",
          "score": 1,
          "created_utc": "2026-01-13 05:16:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzb5trc",
          "author": "Slight_Tutor1790",
          "text": "Something else I have seen work is treating Reddit more like long term product research than a marketing channel. The posts that age best are the ones where someone from the team explains tradeoffs, mistakes, or decisions in plain language. Those threads end up getting bookmarked and resurfaced in search months later. Internally it helps when teams align on letting real people speak, even if the answers are not perfectly polished or sales friendly. That honesty tends to do more for trust than any planned campaign.",
          "score": 1,
          "created_utc": "2026-01-13 06:23:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzchfce",
              "author": "toastybread124",
              "text": "I completely agree",
              "score": 1,
              "created_utc": "2026-01-13 13:12:14",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qe12wn",
      "title": "Is Reddit marketing actually effective for B2B leads?",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qe12wn/is_reddit_marketing_actually_effective_for_b2b/",
      "author": "Tchaimiset",
      "created_utc": "2026-01-16 00:33:40",
      "score": 46,
      "num_comments": 49,
      "upvote_ratio": 0.96,
      "text": "I’ve been building a small startup and kept hearing mixed things about Reddit. Some say Reddit marketing is great for leads, others say it’s a waste and no real buyers are here.\n\nI started with SEO and traditional B2B marketing, but progress was slow and ads got expensive. Then I noticed how often Reddit threads rank on Google, which made me rethink it as part of an SEO and demand discovery play.\n\nCurious what others have seen. Has Reddit marketing actually brought you leads, esp for B2B? If so, what types of posts or communities worked for you?",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qe12wn/is_reddit_marketing_actually_effective_for_b2b/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "nztyg31",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-16 00:33:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nztzg1w",
          "author": "ronniealoha",
          "text": "Reddit works, but only if you stop thinking of it like a marketing channel. It’s more about discovery and trust. I stick to a few niche subs where my buyers actually hang out and just answer questions I genuinely know. The moment it feels like a pitch, people tune out fast.",
          "score": 15,
          "created_utc": "2026-01-16 00:39:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzxnn49",
              "author": "PersonalityWest5546",
              "text": "I agree with you",
              "score": 1,
              "created_utc": "2026-01-16 15:26:16",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o0015je",
              "author": "RedditforBusiness",
              "text": "Thinking about it first and foremost as a dialogue/conversation is a subtle, but significant change brands are beginning to see on Reddit. Your \"pitch\" is not a pitch anymore, it's about the reputation/involvement you have in a community. The more you have people in those communities vouching \"they actually answered my question\" or \"they've been a solid part of the space for a while\", the easier it is for buyers to come to their own conclusions based on the input of others. That's vital, both for the research-based decisions Redditors make, and for how your brand shows up in search overall.",
              "score": 1,
              "created_utc": "2026-01-16 21:53:06",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nztz1en",
          "author": "CarryturtleNZ",
          "text": "Yup, reddit can def bring leads, tho just not in a direct sales way. It works more like demand discovery than outbound B2B. The real wins come from commenting in problem focused or comparison threads. Those often rank on Google, so one good reply can send traffic for months. The key is sounding like a peer, not a pitch.\n\nIf I were helping you, I’d map your product to a few core problems and only engage in subreddits that match your niche. Show up early, stay helpful, and let interest build. Some teams track high-intent threads so they don’t miss chances. odd angles media works in that low-key lane. Reddit works for B2B when you treat it like conversations, not campaigns.",
          "score": 13,
          "created_utc": "2026-01-16 00:36:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzu0qd9",
              "author": "EldarLenk",
              "text": "Yup, agree with this. Reddit works only if you're helping people than advertising.",
              "score": 3,
              "created_utc": "2026-01-16 00:45:57",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nzu86xr",
              "author": "Wide_Brief3025",
              "text": "It really comes down to showing up where the right conversations happen and being helpful without pushing an agenda. Staying on top of threads with your target keywords is key but tough to do manually. I found that using ParseStream’s keyword alerts made it way easier to jump into high value B2B discussions as soon as they pop up, instead of missing out.",
              "score": -1,
              "created_utc": "2026-01-16 01:27:43",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nztzq8e",
          "author": "purpleplatypus44",
          "text": "I’ve seen the best results from threads where people are already comparing tools or asking what to use. If you reply early with a thoughtful answer, those posts tend to rank on Google later and keep sending traffic long after the thread is dead.",
          "score": 4,
          "created_utc": "2026-01-16 00:40:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzwi002",
              "author": "Holiday-Draw-8005",
              "text": "Agree. Those threads usually already have traction, and the top replies sit high in the ranking for a long time, which honestly isn't very friendly to later replies.",
              "score": 2,
              "created_utc": "2026-01-16 11:26:06",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzv969g",
          "author": "Zestyclose-Watch-227",
          "text": "I knew the Parsestream fella would comment on OP's question. He writes: \"It really comes down to showing up where the right conversations happen and being helpful without pushing an agenda.\"\n\nLOL. No agenda for him, right?  \n  \nThere's your answer OP... it's generally a waste (works ok in certain product/service use cases).\n\nReddit has been conquered by Prompt Pushers and Loveable Creator Bros like the Parsestream dude.",
          "score": 3,
          "created_utc": "2026-01-16 05:05:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzyqtzi",
              "author": "TheQueenOfStorms",
              "text": "The ParseStream bullshit is getting tiring.\n\n\nAlmost every single time this topic comes up, you see a user mentioning the app. Funnily enough, now I distrust the tool. Their marketing is so spammy.",
              "score": 1,
              "created_utc": "2026-01-16 18:19:33",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzu0674",
          "author": "philbrailey",
          "text": "Commenting has been way more effective than posting for me. Posting puts you under a spotlight, commenting feels natural. I mostly reply in 3–5 subs and learn how each one talks before jumping in.",
          "score": 2,
          "created_utc": "2026-01-16 00:42:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzu8b7o",
          "author": "Azra_Nysus",
          "text": "Reddit is phenomenal for lead gen as long as you can provide value upfront. Don't spam and just share as much insight as you can about the subjects you are an expert in. I still get leads from posts I commented on 2-3 years ago. If the right person finds it, they will reach out.",
          "score": 2,
          "created_utc": "2026-01-16 01:28:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzu98ey",
              "author": "Wide_Brief3025",
              "text": "You nailed it, consistency and being genuinely helpful go a long way on Reddit. I track niche conversations and jump in only when I can add real insights. For staying on top of leads without having to monitor everything manually, I’ve had good luck with ParseStream since it surfaces posts matching my interests and helps filter out low quality stuff.",
              "score": 1,
              "created_utc": "2026-01-16 01:33:43",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nztyzju",
          "author": "alizastevens",
          "text": "Yeah, it can work, but not like ads.\n\nReddit is good for demand discovery and trust, not quick conversions. I’ve seen B2B leads come from answering very specific problems in niche subs, not promo posts. Threads ranking on Google is a real bonus too.\n\nIf you’re helpful, consistent, and patient, leads show up later. If you try to sell directly, it’s dead on arrival.",
          "score": 1,
          "created_utc": "2026-01-16 00:36:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzu74q9",
          "author": "Wide_Brief3025",
          "text": "Reddit can absolutely work for B2B if you join the right subs and engage in real conversations instead of just promoting. AMAs and helpful comment threads get good traction. For finding leads faster, I tried ParseStream and it let me track keyword mentions and filter out the noise so I could focus on legit opportunities. Made Reddit feel a lot less overwhelming.",
          "score": 1,
          "created_utc": "2026-01-16 01:21:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzuglv2",
          "author": "deadplant5",
          "text": "I did a campaign and it underperformed Facebook and LinkedIn",
          "score": 1,
          "created_utc": "2026-01-16 02:14:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzulsbq",
          "author": "toastybread124",
          "text": "In my experience, Reddit can be a hit or miss for B2B leads. It really depends on the subreddit and how you engage with the community. If you're providing valuable content and not just blatantly promoting your product, people tend to respond better. Have you tried looking at industry-specific subreddits where your target audience might hang out?",
          "score": 1,
          "created_utc": "2026-01-16 02:43:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzumrsi",
          "author": "MontrealKyiv4477",
          "text": "Reddit is great if done smart in terms of participating in relevant discussions and providing genuine info. People then start reaching out directly with questions. Junk is not working so post something that actually honestly provide valuable info on the subject. And then paid traffic from Reddit is fairly cheap and depending on your niche could generate legit leads.",
          "score": 1,
          "created_utc": "2026-01-16 02:49:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzutfed",
              "author": "Wide_Brief3025",
              "text": "You’re spot on about needing to add real value and participate in discussions rather than just dropping links. Targeting the right conversations makes a massive difference for B2B. If you want to save time keeping up with leads and relevant threads, ParseStream can help by highlighting quality opportunities based on your keywords. Makes it a lot easier to avoid the noise.",
              "score": 1,
              "created_utc": "2026-01-16 03:26:31",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzviyaa",
          "author": "madhuforcontent",
          "text": "Yes, Reddit marketing is actually effective for B2B leads.",
          "score": 1,
          "created_utc": "2026-01-16 06:17:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzvkztz",
          "author": "KissyyyDoll",
          "text": "tbh I’ve seen small startups get clients from Reddit just by answering questions and being helpful in niche subs. ads don’t convert much, but good posts do.",
          "score": 1,
          "created_utc": "2026-01-16 06:33:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzvs2t6",
          "author": "UwU_MilkDrop",
          "text": "It can work, but only if you target niche subreddits where your audience hangs out. General posts get ignored.",
          "score": 1,
          "created_utc": "2026-01-16 07:33:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzvuhyb",
          "author": "al_tanwir",
          "text": "100%, but you have to be smart with it, it can backfire on your business and brand if you're just posting on Reddit to promote.",
          "score": 1,
          "created_utc": "2026-01-16 07:55:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzw2fm6",
          "author": "MarcusAureliusWeb",
          "text": "Here's why Reddit is effective for any type of marketing.\n\n1) Your customers live here. They ask questions, look for help, and post about their pain points here regularly (sometimes even complain about your competitors) - which is where you come in...\n\n2) Reddit is one of the most cited sources in LLM grounding (when a user asks about a product review or information about a service, 5 or 6 times out of 10, a post from Reddit gets pulled).\n\n3) You increase your brand/business visibility indirectly. Every time you post a response to someone looking for help or guidance (considering you actually provide help), you are demonstrating experience + expertise not only to the person who posted, but to anyone else who reads your comment.\n\n4) Reddit posts and comments will exist on the internet for as long as Reddit lives. So, even if your posts get ignored today, it might go viral tomorrow (or in a few years).\n\nOther marketers on Reddit, what am I missing?",
          "score": 1,
          "created_utc": "2026-01-16 09:07:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzwa6e4",
          "author": "Dangerous-Guava-9232",
          "text": "🙂‍↕️",
          "score": 1,
          "created_utc": "2026-01-16 10:19:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzwh8my",
          "author": "AdamYamada",
          "text": "Yes. \n\n\nMost do it wrong though. You have to show-up and good advice and answers to questions. ",
          "score": 1,
          "created_utc": "2026-01-16 11:19:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzxb390",
          "author": "hollee-o",
          "text": "Paid media on Reddit also works. I’ve run a few dozen campaigns focused on IT developers head-to-head with LinkedIn. It consistently performs at around 30% of LinkedIn volume for click-thrus at roughly the same CPM. It also seems to deliver fewer bots. The targeting isn’t nearly as focused—Reddit targets by sub rather than user profile—(em dash!), and the UX is a bit clunky, but I’m sticking with it because I think LinkedIn quality is fading.",
          "score": 1,
          "created_utc": "2026-01-16 14:25:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzxnw55",
          "author": "PersonalityWest5546",
          "text": "Reddit is also a really great channel to help do damage control for some brands",
          "score": 1,
          "created_utc": "2026-01-16 15:27:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzy31bs",
          "author": "Sudden-Context-4719",
          "text": "Reddit can work for B2B leads but only if you engage in the right niche subs and add real value, not just sales pitches. I’ve used SocListener to spot posts where people actually ask for solutions, then drop helpful comments that start convos. It’s not a quick fix but can bring leads if you’re patient and targeted.",
          "score": 1,
          "created_utc": "2026-01-16 16:34:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzy7wns",
          "author": "Leading-Visual-4939",
          "text": "Reddit is great, but don't think of it as a marketing channel. If you do, you will lose time there, because people don't like when we promote our tools\n\nJust bring value in niche communities that are relevant for you. And only talk about your product when it's relevant ! \n\nYou can use tools to monitor Reddit also in real-time to get alerted when a post is relevant for you. Maybe that's a great solution also to engage where it matters",
          "score": 1,
          "created_utc": "2026-01-16 16:55:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o002h6u",
          "author": "OkDependent6809",
          "text": "tried reddit marketing for our b2b fintech. results were... mixed?\n\nwe posted in a couple relevant subreddits (r/smallbusiness, some finance ones). got like 200 upvotes, 30ish signups, maybe 3-4 actual customers. hard to track attribution though so who knows if those customers came from reddit or found us some other way.\n\nwhat worked: being genuinely helpful, not salesy. answered questions, shared experience. people can smell self-promo immediately and will downvote you to hell.\n\nwhat didn't work: trying to post the same thing in multiple subs (got called out for spam), anything that felt like an ad.\n\nhonestly the roi is unclear. took a lot of time for not many leads. but if you're already active on reddit anyway it's worth trying. just don't expect it to be your main channel.",
          "score": 1,
          "created_utc": "2026-01-16 21:59:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o00718a",
              "author": "Wide_Brief3025",
              "text": "Totally get where you’re coming from. Measuring ROI on Reddit is tricky since attribution tools are limited. What really helps is setting up alerts for keyword mentions so you can jump into conversations when leads are most engaged. If you need something to automate that and spot high quality posts, ParseStream is worth a look. It saves a lot of time by zeroing in on actual opportunities instead of noise.",
              "score": 1,
              "created_utc": "2026-01-16 22:21:47",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o00cdmv",
          "author": "Drumroll-PH",
          "text": "Reddit can work for B2B, but it’s more for demand discovery and building credibility than direct sales. Posts that share real insights, case studies, or practical tips in the right niche communities get attention. You’ll rarely convert straight from a Reddit thread, but it can drive traffic, improve SEO, and start conversations that turn into leads.",
          "score": 1,
          "created_utc": "2026-01-16 22:48:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o00j8ve",
              "author": "Wide_Brief3025",
              "text": "Targeting the right subreddits and offering genuine value is huge for B2B on Reddit. Consistent engagement and sharing practical insights build trust over time. If you want to catch relevant lead opportunities as they pop up, a tool like ParseStream helps you track key conversations and filter out the noise so you can focus your energy where it counts.",
              "score": 1,
              "created_utc": "2026-01-16 23:25:26",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o00hj21",
          "author": "basitmakine",
          "text": "I have an entire workflow on TaskAGI that tracks keywords, brands, competitors etc, qualifies the leads using Claude. And saves the ones that are worty of replying in a Google sheet. works like a charm. In fact that's how I found out about this post. It's free to deploy if you want. \n\nJust search reddit lead generation in agent templates on TaskAGI.",
          "score": 1,
          "created_utc": "2026-01-16 23:16:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o00ivto",
              "author": "Wide_Brief3025",
              "text": "You are already ahead of the game if you have a solid TaskAGI workflow set up. For B2B leads, Reddit can be a goldmine because conversations are real and intent driven. If you ever want something built specifically for surfacing high quality leads and filtering the noise, ParseStream has some pretty smart filtering and instant alerts that make the outreach process way faster.",
              "score": 1,
              "created_utc": "2026-01-16 23:23:26",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o03ew7d",
          "author": "ramen-AI-SDR",
          "text": "LinkedIn is much better.",
          "score": 1,
          "created_utc": "2026-01-17 12:25:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o03t63s",
          "author": "FengLi_25",
          "text": "Yes, Reddit marketing is actually effective for B2B leads.",
          "score": 1,
          "created_utc": "2026-01-17 13:59:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o04zzg2",
          "author": "ZookeepergameGreen94",
          "text": "I’ve had mixed results honestly. It’s not like leads just start flowing in, but I’ve seen a few posts bring surprisingly good conversations and even a couple of solid opportunities. What stood out to me was that the threads where people shared genuine experiences or asked thoughtful questions performed way better than anything that felt promotional.",
          "score": 1,
          "created_utc": "2026-01-17 17:30:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0aq75i",
          "author": "New-Decision722",
          "text": "Yes, reddit is very effective..",
          "score": 1,
          "created_utc": "2026-01-18 14:48:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ayvlv",
          "author": "jellyturtsy",
          "text": "I think it depends on the industry. I've got a mate who is killing it for B2B clients and another one who is struggling. Both in differing industries though",
          "score": 1,
          "created_utc": "2026-01-18 15:33:15",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qcf93f",
      "title": "complexity of use cases in enterprise sales makes generic outreach completely useless",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qcf93f/complexity_of_use_cases_in_enterprise_sales_makes/",
      "author": "Dangerous-Guava-9232",
      "created_utc": "2026-01-14 05:45:59",
      "score": 27,
      "num_comments": 13,
      "upvote_ratio": 0.85,
      "text": "Selling into fortune 500 accounts where each division has different use cases, different pain points, different buying processes. Generic messaging about \"increase efficiency\" or \"reduce costs\" gets ignored immediately\n\nI need to understand specific use case complexity for each division we're targeting. Manufacturing division cares about supply chain visibility, finance cares about compliance reporting, hr cares about global workforce management etc\n\nSame company, completely different value propositions needed. How do enterprise teams handle this level of use case complexity without having dedicated research teams for each account?",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qcf93f/complexity_of_use_cases_in_enterprise_sales_makes/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "nzhquip",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-14 05:46:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzieshm",
          "author": "Substantial_Bid110",
          "text": "we started mapping divisions manually at first but it was taking forever. now using a platform that pulls dept structure from public sources and surfaces relevant info automatically. still have to validate everything but saves hours per account.",
          "score": 13,
          "created_utc": "2026-01-14 09:22:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o029o6r",
              "author": "_forgotmyownname",
              "text": "That makes sense. Even imperfect automation beats starting from zero every time.",
              "score": 1,
              "created_utc": "2026-01-17 06:12:45",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzhrrfl",
          "author": "kubrador",
          "text": "this is literally why most enterprise AE's are glorified note-takers for the 2-3 deals they actually understand\n\n you probably can't do it well across 50 accounts. pick 10-15 where you can actually go deep, build division-specific POVs, and let the rest get the \"good enough\" nurture treatment until timing works out.\n\nthe teams that do this well usually have one person who becomes the account expert and builds a living doc of division-level pain points over 12-18 months. not sexy, just grinding linkedin, earnings calls, glassdoor complaints, and talking to anyone who'll take the call.\n\n\"dedicated research teams\" is consultant-speak for \"we hired 2 SDRs who are good at google\"",
          "score": 3,
          "created_utc": "2026-01-14 05:53:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzhxxkc",
          "author": "Realestate_Uno",
          "text": "You can use AI to help you get a lot of this research and analysis done, especialy for F500 they have tones of public info you can leverage for this",
          "score": 3,
          "created_utc": "2026-01-14 06:44:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzlkdfc",
              "author": "astillero",
              "text": "What's your favourite AI tool for this?",
              "score": 1,
              "created_utc": "2026-01-14 19:55:20",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzm2xrc",
                  "author": "Realestate_Uno",
                  "text": "Google/Erplexity/CGPT, I will run the same promopt in all 3 usually and then combine and then throw in NotebookLM to summarise etc but also use that info to create an info source for latter use.",
                  "score": 1,
                  "created_utc": "2026-01-14 21:19:55",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzls0zt",
          "author": "Sudden-Context-4719",
          "text": "You gotta get super specific with each division or your messages just get lost. Without big research teams, use tools that pull real conversations from places like Reddit to see what people actually care about. SocListener can help by finding those real pain points so you can tailor your outreach better without guessing.",
          "score": 2,
          "created_utc": "2026-01-14 20:30:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzm4cej",
              "author": "Wide_Brief3025",
              "text": "Digging into actual discussions is a game changer for outreach, especially when selling to complex orgs. I used to waste hours manually searching for these threads until I switched to a tool like ParseStream. It sends real time alerts based on keywords, so I only see relevant convos and can respond fast to what people really need. Makes personalizing outreach so much easier.",
              "score": 1,
              "created_utc": "2026-01-14 21:26:15",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzmdqov",
          "author": "erickrealz",
          "text": "The division-level targeting problem is real and it's why generic enterprise outreach has such abysmal response rates. The \"increase efficiency\" messaging gets deleted because it could apply to literally anyone and signals zero understanding of their specific situation.\n\nThe practical approach without dedicated research teams:\n\nBuild division-specific messaging templates once, then customize lightly per account. You probably have 5-7 common divisions you sell into. Create the core value prop and pain point messaging for each division type, then add account-specific context when you reach out. The manufacturing value prop stays mostly consistent across manufacturers, you're just adding details about their specific situation.\n\nThe account research that matters takes 15-20 minutes, not hours. LinkedIn for org structure and recent hires, earnings calls and 10-Ks for strategic priorities, news for recent initiatives or pain points. Our clients doing enterprise outreach usually find that one relevant detail about their specific situation beats pages of generic research.\n\nThe multi-threading approach works better than going deep on one division initially. Light touches across multiple divisions in the same account surface where actual budget and urgency exists. The division you thought was the entry point often isn't.\n\nThe signal-based prioritization helps focus effort. Look for divisions that just hired for roles related to your solution, ones posting jobs that suggest relevant projects, and executives engaging with content about problems you solve. Those signals indicate where actual budget and urgency exist, making deeper research worthwhile.",
          "score": 1,
          "created_utc": "2026-01-14 22:08:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0f5k42",
          "author": "Slight_Tutor1790",
          "text": "I have seen this work better when teams stop thinking in terms of accounts and start thinking in terms of jobs that show up across divisions. You end up with a small set of repeatable problem narratives that map to real work people are trying to get done. Outreach then becomes about spotting which job is active right now instead of trying to fully understand the entire org upfront.",
          "score": 1,
          "created_utc": "2026-01-19 04:20:20",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qb9zd3",
      "title": "video generation tools for creating b2b promotional shorts or tiktoks",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qb9zd3/video_generation_tools_for_creating_b2b/",
      "author": "Shantell_Raspberry",
      "created_utc": "2026-01-12 22:48:55",
      "score": 15,
      "num_comments": 6,
      "upvote_ratio": 1.0,
      "text": "currently looking for tools that can help create short promotional videos for paid and organic use. ideally something that handles visual generation without looking fake. i’m looking for something that fits into a real marketing workflow. our current one is batching, iterations, exports, captions + different hook versions. right now i’m testing a workflow where I use Runway for visuals and shots + Argil for script-to-talking-head clips when we need a consistent talking person without the need to film all the time. looking to collect different experiences so please share with me if you’ve found an AI video tool stack that worked for you. thanks in advance",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qb9zd3/video_generation_tools_for_creating_b2b/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "nz8zhbj",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-12 22:48:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzaf0ch",
          "author": "Far_Day3173",
          "text": "What's wrong with Gemini Veo3.1 if I may ask?",
          "score": 1,
          "created_utc": "2026-01-13 03:25:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzj2x7u",
          "author": "AndreeaM24",
          "text": "Your workflow is already pretty much how most teams end up doing it.\n\nFrom my experience, there’s no single AI tool that does everything well. The stacks that work are modular. Generate visuals or talking heads with AI, then assemble and iterate fast. Tools that try to be “one-click ads” usually fall apart once you need real testing.\n\nI use AI mostly to speed up inputs, not to replace the whole process. After visuals are ready, I usually pull everything into Flixier to cut multiple hook versions, resize for placements, add captions, or do quick voiceovers. That part matters more than the generation step when you’re batching and testing.\n\nFor B2B especially, content that looks slightly imperfect and native tends to win. If a tool helps you move faster without locking you into an AI-looking style, it’s doing its job.",
          "score": 1,
          "created_utc": "2026-01-14 12:43:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzxozkt",
          "author": "stealthagents",
          "text": "Have you tried using Descript? It’s great for editing and also has a decent AI voice feature. It might streamline your process a bit more since you can handle everything in one place, plus it integrates well with other tools.",
          "score": 1,
          "created_utc": "2026-01-16 15:32:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o00z8kd",
          "author": "Responsible-Brick881",
          "text": "What kind of product are you selling and what channels are you running the videos on?",
          "score": 1,
          "created_utc": "2026-01-17 00:57:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o02jq0k",
          "author": "DeltaFirmware",
          "text": "You need very realistic one?",
          "score": 1,
          "created_utc": "2026-01-17 07:41:25",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qed232",
      "title": "Do you use AI in your CRM to score leads or dig up insights? Do you trust it?",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qed232/do_you_use_ai_in_your_crm_to_score_leads_or_dig/",
      "author": "sassyvixen123",
      "created_utc": "2026-01-16 11:00:51",
      "score": 15,
      "num_comments": 10,
      "upvote_ratio": 1.0,
      "text": "Right now we're demoing a bunch of CRMs and the trendy claim seems to be that Al can score leads and do research. I mean things like surfacing which leads are worth chasing now and pulling useful context from calls, emails, notes, and the web without a rep doing manual digging.\n\nOn one hand I'm pretty neutral towards most Al stuff. I think it can be very useful but it's oftentimes imperfect and people will use it as a crutch and their work suffers. So if some of these CRMs can produce quality Al outputs then that's great but if it's full of hallucinations then I can only imagine the havoc it'd wreak on our pipeline.",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qed232/do_you_use_ai_in_your_crm_to_score_leads_or_dig/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "nzwey4v",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-16 11:00:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzwnih7",
          "author": "imnotafanofit",
          "text": "As with most Al, a big part of it is the prompting. If your CRM gives you a lot of control over the Al inputs then you can fine tune the outputs. We are able to define the questions we want the Al to answer when it comes to qualifying leads (have they raised capital, estimated number of employees, what is their business model, etc). Some others I've seen just kinda have a black box classification system where the Al will tell you how good or bad a lead is and it can be extremely hit or miss.",
          "score": 10,
          "created_utc": "2026-01-16 12:08:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzwu0l2",
              "author": "Fit-Donkey-3181",
              "text": "We hacked together a similar functionality with zapier and chatgpt but it's kind of annoying how much we need to build with 3rd party integrations to get useful Al stuff beyond just generic summaries of email threads.",
              "score": 1,
              "created_utc": "2026-01-16 12:51:53",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzwzx9g",
                  "author": "imnotafanofit",
                  "text": "Yeah that's why it needs to be integrated into the CRM. We get a lot more use out of Al by using it to clean up unstructured data and classification than we do most of the hyped up gen Al stuff. We're on Attio and it's pretty easy to use where you'd like with a good amount of control so been happy so far.",
                  "score": 1,
                  "created_utc": "2026-01-16 13:27:03",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzwwru3",
          "author": "Still_Effective_8858",
          "text": "We're still on HubSpot and their Al is... alright. It's sometimes helpful but a lot of it still feels surface level. A lot like gmail drafts and summaries. It's just kinda meh and I end up not using it.",
          "score": 2,
          "created_utc": "2026-01-16 13:08:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzx38ur",
              "author": "Inevitable_Tree_2296",
              "text": "9 times out of 10 it feels like the dev team was just blindly told to add Al just so marketing could claim they have Al. Feels like it was just slapped on.",
              "score": 1,
              "created_utc": "2026-01-16 13:45:03",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzwxjvs",
          "author": "signalpath_mapper",
          "text": "I am pretty skeptical of trusting it end to end. In ops and support, anything that auto scores without clear rules tends to drift and people stop questioning it. The useful stuff I have seen is summarization and pattern surfacing, not deciding what to chase. Once reps treat the score as truth, bad inputs turn into bad pipeline fast. I would only trust it if you can see why something was scored a certain way and override it easily. Otherwise it becomes noise that looks smart.",
          "score": 2,
          "created_utc": "2026-01-16 13:13:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzy3c9r",
          "author": "Sudden-Context-4719",
          "text": "AI lead scoring can be hit or miss depending on the CRM. I’ve seen some tools that pull decent context from emails and calls but often they miss key details or make stuff up.",
          "score": 1,
          "created_utc": "2026-01-16 16:35:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o082std",
          "author": "signal_loops",
          "text": "yes, a lot of teams are using AI inside CRMs for lead scoring and insight extraction, but trust is still very conditional. where it works best today is summarization and pattern surfacing pulling themes from calls, flagging buying signals, highlighting recent activity or intent because those are compressive tasks where being 80–90% right is still useful. where teams get burned is when they let AI decide rather than suggest, especially for lead scoring. if the model doesn’t understand your ICP nuances, deal cycles, internal definitions of  sales-ready, or your historical win/loss data, it will confidently score the wrong things and reps will either chase ghosts or ignore good leads.",
          "score": 1,
          "created_utc": "2026-01-18 02:49:50",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qbctms",
      "title": "Best free headshot generator for my sales and marketing team?",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qbctms/best_free_headshot_generator_for_my_sales_and/",
      "author": "A_black_caucasian",
      "created_utc": "2026-01-13 00:44:22",
      "score": 11,
      "num_comments": 10,
      "upvote_ratio": 0.87,
      "text": "We’re trying to clean up our brand presence and realized our team page + LinkedIn photos are a mess (random lighting, old selfies, cropped wedding pics, you name it). Instead of booking a photographer, we’re experimenting with AI headshots so everyone can get a consistent look without coordinating calendars. Trying to keep this pretty cheap since were a bit bootstrapped, anyone have tools to recommend that are not going to have my director hate me?\n\n",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qbctms/best_free_headshot_generator_for_my_sales_and/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "nz9l6ax",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-13 00:44:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz9m2ov",
          "author": "Pristine-Put-5712",
          "text": "We looked for something “free” too and honestly most actual free headshot generators were pretty rough for a sales-facing team. What worked for us was InstaHeadshots since you can upload photos, see all the results first, and only pay if you like them, so it felt basically risk-free. It was fast, the shots actually looked like our team members, and way easier than coordinating a photographer for everyone. Biggest thing is using good input photos so the results don’t look off.",
          "score": 6,
          "created_utc": "2026-01-13 00:49:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o09l32i",
              "author": "Different_Pain5781",
              "text": "Had the same issue with a sales team. free generators made everyone look uncanny. reviewing results first saved us from wasting money.",
              "score": 1,
              "created_utc": "2026-01-18 09:41:26",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nza6g6q",
          "author": "Practical_Draw_6862",
          "text": "That seems the opposite way to build trust ",
          "score": 2,
          "created_utc": "2026-01-13 02:39:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzae7g6",
          "author": "kubrador",
          "text": "if this is an ad for looktara i swear..",
          "score": 2,
          "created_utc": "2026-01-13 03:21:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz9pbqd",
          "author": "iwanttolearnecomm",
          "text": "To be honest if you want to do it right get it professionally done, human pattern recognition for ai is getting better and better. You’ll throw off some people who notice it and don’t like it",
          "score": 1,
          "created_utc": "2026-01-13 01:06:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzaxij3",
          "author": "rooom40",
          "text": "Honestly I did our companies headshots in nano banana (just in the gemini chat) and they came out great. If you've got google workspace they give you plenty free to do like 20 or so image generations a day. I just uploaded an image of the employee and told it to add the proper background or change whichever feature.",
          "score": 1,
          "created_utc": "2026-01-13 05:19:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzes0m8",
              "author": "askoshbetter",
              "text": "Yeah. I had nana banana put me in a blazer but keep everything else the same.",
              "score": 1,
              "created_utc": "2026-01-13 19:57:49",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzghu3b",
          "author": "RichChocolateDevil",
          "text": "Hire a college art major with a focus on photography.  It will be huge for them. ",
          "score": 1,
          "created_utc": "2026-01-14 01:06:28",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qddx9p",
      "title": "Why Is Manual Prospecting So Exhausting?",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qddx9p/why_is_manual_prospecting_so_exhausting/",
      "author": "Soft_Attention3649",
      "created_utc": "2026-01-15 08:13:54",
      "score": 11,
      "num_comments": 22,
      "upvote_ratio": 1.0,
      "text": "Anyone figured out how to make manual prospecting manageable? My week starts with a list of 50-100 companies we think might be a fit. I try sending personalized messages, following up a few days later, and tracking opens and replies in a spreadsheet that feels like it’s growing faster than i can manage. Meanwhile, new leads keep piling in, campaigns are running, and I have zero visibility into what’s actually working versus what’s just noise.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qddx9p/why_is_manual_prospecting_so_exhausting/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "nzp0yf0",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-15 08:13:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzqq9r4",
          "author": "Euphoric-View-9876",
          "text": "Manual prospecting gets exhausting when selection and execution are mixed together. The real drain isnt sending messages, its deciding who actually deserves personalization. What helped us was splitting the stack use competitor + audience data first (whos already engaging with similar tools or agencies), then enrich and message only that slice. We usually pair something like Followerli for competitor audiences with Clay for light enrichment, and suddenly the list shrinks from 100  maybes to 15 people worth real effort. Same work, way less noise, and tracking actually starts to mean something.",
          "score": 2,
          "created_utc": "2026-01-15 15:27:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzp8jmt",
          "author": "Surbhimarketing",
          "text": "Very relatable.\nManual prospecting gets unmanageable when effort grows faster than insight. Spreadsheets pile up, personalization turns rushed, and you’re busy without knowing what’s actually working.\n\nIn my experience, the fix isn’t more activity or tools, it’s narrowing focus. Fewer, better-fit accounts, simple follow-up rules, and tracking real conversations instead of vanity metrics. Once you reduce the noise, the work becomes manageable again",
          "score": 1,
          "created_utc": "2026-01-15 09:27:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzphug0",
              "author": "SkylineAnalytics",
              "text": "My guess is this is the right answer. People need to stop with the volume. Get super specific and add value.",
              "score": 1,
              "created_utc": "2026-01-15 10:55:11",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nzpf39x",
              "author": "Wide_Brief3025",
              "text": "Focusing on fewer high quality conversations makes such a difference in managing prospecting without burning out. Tracking where the real engagement is happening has been more valuable than keeping endless spreadsheets. If you ever want help surfacing those good fit leads faster, ParseStream has been useful for cutting through the noise and highlighting the most relevant Reddit discussions for outreach.",
              "score": 0,
              "created_utc": "2026-01-15 10:30:24",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzpdmmm",
          "author": "Sad_Place421",
          "text": "U need like a platform that helps prioritize the right leads, automates outreach, and tracks responses so you actually know what’s working, me and team been using onfire ai, huge time saver and makes managing even a big list way less painful",
          "score": 1,
          "created_utc": "2026-01-15 10:16:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzr68gf",
              "author": "FeatheredTouch-000",
              "text": "Tools can help, but only after focus is fixed. If the list and message are wrong, automation just burns you out faster. Prioritization first, tools second.",
              "score": 2,
              "created_utc": "2026-01-15 16:39:11",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o04tym3",
                  "author": "skorpion234",
                  "text": "Bingo Bongo, who your targeting and what do they should care is absolutely key before we even start thinking about building lists and the tools to help you streamline things.",
                  "score": 1,
                  "created_utc": "2026-01-17 17:02:09",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzpf9j9",
          "author": "JMALIK0702",
          "text": "Been doing the same and I can totally relate with you here",
          "score": 1,
          "created_utc": "2026-01-15 10:32:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzpo0p5",
          "author": "likenotmrw",
          "text": "i d convert your process to 1 pipeline with segments, like new/contacted/and etc, using crm (hubspot has a free tire), even in excel you can do it ( more manual work). if you have a huge value of data, i d recommend to use crm with automations",
          "score": 1,
          "created_utc": "2026-01-15 11:47:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzq8pl1",
          "author": "Sudden-Context-4719",
          "text": "Manual prospecting gets crazy fast with tracking and follow ups. I found using tools that automate some outreach and help spot what’s working saves a ton of time. If you’re open to Reddit leads, SocListener can find good posts and even draft messages so you don’t have to do all that by hand.",
          "score": 1,
          "created_utc": "2026-01-15 13:59:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzr49dt",
          "author": "sagefrogmarketing",
          "text": "Manual prospecting gets overwhelming when everything is treated as a one-off. Batch prospects by why you’re reaching out (same trigger, same role, same problem) so personalization happens at the angle level, not line-by-line. Track only what matters: messages sent, replies, real conversations.",
          "score": 1,
          "created_utc": "2026-01-15 16:30:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzr66ji",
          "author": "FeatheredTouch-000",
          "text": "Manual prospecting is exhausting because effort grows faster than learning. You send more messages but insight stays flat. The fix is not more volume. Cut your list to fewer companies that match one clear ICP. Lock a simple follow up rule, for example one follow up after three days, then stop. Track only replies and booked calls. Ignore opens. Once you see which segment replies, double down there and drop the rest.",
          "score": 1,
          "created_utc": "2026-01-15 16:38:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzum5sa",
          "author": "Electronic-Cat185",
          "text": "manual prospecting is exhaustiing because you’re doing three jobs at once: research, messaging, and analytiics, all without feedback loops. the mental load comes from constantly switching contexts and not knowing which effort actuallly matters. most teams burn out because they optimiize for volume before they have a repeatable signal. even small structure changes, like narrowiing ICP harder or killiing anything you can’t measure cleanly, usually reduce fatigue more than adding new tools. the work itself isn’t the problem, the ambiguity is.",
          "score": 1,
          "created_utc": "2026-01-16 02:45:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzvlbh9",
          "author": "Blackx_1",
          "text": "I can help you for this",
          "score": 1,
          "created_utc": "2026-01-16 06:36:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzvtals",
          "author": "UwU_MilkDrop",
          "text": "It’s exhausting because it’s repetitive and never-ending. You need a system or tool to track replies and prioritize leads.",
          "score": 1,
          "created_utc": "2026-01-16 07:44:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o01nykp",
          "author": "unicorn69love",
          "text": "manual prospecting is a soul-crushing grind when youre drowning in spreadsheets and half-assed personalization. switched to clienthunter for auto-scraping qualified leads based on my exact criteria then it spits out timed emails and tracks real replies dropped my list from 100 nobodies to 20 hot ones and actually closed some deals without the burnout. game changer if youre stuck in that loop",
          "score": 1,
          "created_utc": "2026-01-17 03:34:18",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qcojto",
      "title": "We pay for B2B traffic, but most visitors stay anonymous. Is that just the new normal?",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qcojto/we_pay_for_b2b_traffic_but_most_visitors_stay/",
      "author": "Intelligent_Bet_9947",
      "created_utc": "2026-01-14 14:23:39",
      "score": 10,
      "num_comments": 26,
      "upvote_ratio": 0.92,
      "text": "We run Go⁤ogle Ads and Lin⁤kedIn Ads and get clicks from the right industries, but most visitors never convert. It is hard to tell whether the problem is the ads, the website, or just how B2B buyers behave now.\n\nHow do you evaluate paid traffic when conversions are low but engagement seems real? Are there better ways to understand whether ads are actually attracting interested companies?",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qcojto/we_pay_for_b2b_traffic_but_most_visitors_stay/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "nzjk7ap",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-14 14:23:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzkexwl",
          "author": "JennyAtBitly",
          "text": "A lot of buyers research quietly across multiple sessions and devices before they ever fill out a form.\n\nWhen conversions are low, it helps to shift the question from “who converted” to “who engaged.” Look at repeat visits, time on key pages, content depth, and whether the same companies keep showing up over time. That usually tells you more about ad quality than raw form fills.\n\nMany teams also separate evaluation windows. Paid traffic might not convert today, but it influences demos or pipeline weeks later. If engagement is real and consistent by account or industry, the ads are probably doing their job.",
          "score": 6,
          "created_utc": "2026-01-14 16:49:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzmcvll",
          "author": "erickrealz",
          "text": "The anonymous visitor problem is real and getting worse. B2B buyers do way more research before ever identifying themselves, and privacy changes mean less tracking works than it used to. That said, \"most visitors never convert\" on paid traffic usually signals something fixable rather than just market behavior.\n\nThe diagnostic questions that matter: what's your landing page conversion rate? If you're below 2-3% on targeted B2B traffic, the page is probably the problem, not the ads. What happens after the click? Are people bouncing immediately or spending time and leaving without converting? Those are different problems.\n\nThe engagement-without-conversion pattern usually means one of a few things: the offer isn't compelling enough to justify giving up contact info, there's a mismatch between ad promise and landing page delivery, or the form is asking for too much too early. Our clients seeing this gap often fix it by lowering the commitment ask. \"Get a demo\" converts worse than \"see how it works\" which converts worse than ungated value.\n\nThe intent tools like Clearbit Reveal, RB2B, or Leadfeeder can identify some percentage of anonymous company-level traffic. Won't catch everyone but helps you see if the right companies are visiting even when individuals don't convert.\n\nThe LinkedIn versus Google comparison matters too. LinkedIn traffic is expensive but should be highly targeted. If that traffic isn't converting, your landing page or offer is almost certainly the issue. Google traffic might just be less qualified depending on keywords.",
          "score": 3,
          "created_utc": "2026-01-14 22:04:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzk2e6k",
          "author": "Tsundere5",
          "text": "That’s pretty much the new normal in B2B. Most buyers are researching quietly and won’t convert on first touch. When conversions are low I’d judge paid traffic by quality signals instead of forms like time on page, scroll depth, repeat visits, page paths and whether people come back later via branded or direct. Light intent actions like pricing views or case studies help too and company level intent or IP data can show if the right accounts are visiting. If engagement is solid from the right industries, the ads are probably working. The gap is usually timing or mid funnel not traffic quality",
          "score": 1,
          "created_utc": "2026-01-14 15:52:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzkb1r1",
          "author": "Due-Tip-4022",
          "text": "For me, I had a professional create and run my B2B adds. \nI got probably a couple dozen leads from it or so. But when I looked at who the leads were, they clearly had nothing to do with my industry. There was no way they would ever convert. The only one to respond to my message said \"not interested\" and a few were clearly people trying to sell to me. Al.ost $10k lesson.",
          "score": 1,
          "created_utc": "2026-01-14 16:31:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzlmbjy",
          "author": "Glittering_Fan_9772",
          "text": "Well yea.... people research for months before they raise their hands. They are looking at you and 10 of other providers. Just throw a person id pixel on there from Visitor InSites or a company Id pixel from Lead Forensics. then they are not long anonymous. Market to them till they convert.",
          "score": 1,
          "created_utc": "2026-01-14 20:04:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzlt4uj",
          "author": "Independent_Host582",
          "text": "We had the same frustration with paid traffic. Clicks were coming in, engagement looked decent, but conversions stayed low.\n\nUsing Lead⁤info showed us that many companies clicking our ads were still researching and revisiting key pages, even if they did not convert right away.",
          "score": 1,
          "created_utc": "2026-01-14 20:35:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzmev00",
          "author": "jtrinaldi",
          "text": "On LinkedIn you need to be running ads to video content within LinkedIn instead of your site.",
          "score": 1,
          "created_utc": "2026-01-14 22:13:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzms02o",
          "author": "carrzo",
          "text": "So many variables. Targeting by title? Geo? Time of year in budget cycle?  Department? Budget authority? Landing them on pages that talk their lexicon? What's your conversion form look like - how many fields, etc \n\nGet a chatbot on your site, you may think they don't convert but when visitors are ready after all those trips to the site, you'd be surprised at the conversions.",
          "score": 1,
          "created_utc": "2026-01-14 23:19:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzn480q",
          "author": "Euphoric-View-9876",
          "text": "This is pretty normal now, but the mistake I see is treating paid traffic as anonymous forever. The real question isnt “why didn’t they convert,” its who actually showed up. We stopped judging ads by forms and started cross checking visitors against competitor and category audiences. If the same companies engaging with your competitors also keep landing on your site (even anonymously), ads are doing their job timing isnt. That insight alone changed how we evaluate LinkedIn spend.",
          "score": 1,
          "created_utc": "2026-01-15 00:25:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzo5fli",
          "author": "_forgotmyownname",
          "text": "It's definitely the new normal. Most B2B buyers do extensive research anonymously before they ever fill out a form or identify themselves. You should look into deanonymization tools like 6sense or Clearbit to see which companies are visiting, even if the individuals don't convert.",
          "score": 1,
          "created_utc": "2026-01-15 04:03:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzokb6r",
          "author": "madhuforcontent",
          "text": "Give some reasons why your target audience should trust you and project it.",
          "score": 1,
          "created_utc": "2026-01-15 05:49:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzomgse",
          "author": "kawaiij",
          "text": "Once we started evaluating PPC traffic through engagement and revisit patterns, things changed.\nLeadinfo made it easier to see which companies repeatedly landed on high-intent pages, giving us a clearer signal of whether campaigns were attracting the right audience.",
          "score": 1,
          "created_utc": "2026-01-15 06:06:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzp2s3w",
          "author": "DeltaFirmware",
          "text": "What do you do? Show them what you can do",
          "score": 1,
          "created_utc": "2026-01-15 08:31:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzpoomn",
          "author": "gallantfarhan",
          "text": "Anonymous traffic is normal, especially in B2B where buyers research extensively before acting. The real question isn't who the visitors are, but whether the website gives the right ones a compelling reason to stop researching and start a conversation. If conversions are low, the gap is almost always between what the ads promise and what the landing page delivers.",
          "score": 1,
          "created_utc": "2026-01-15 11:52:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzqelh4",
          "author": "hotdoogs",
          "text": "Damn so much slop here. Just use a ID tool to identify them. There are a few good ones out there",
          "score": 1,
          "created_utc": "2026-01-15 14:30:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o00zq9o",
          "author": "Responsible-Brick881",
          "text": "Linkedin ads are crazy expensive from what I've seen. What sort of CPMs have you been getting there?",
          "score": 1,
          "created_utc": "2026-01-17 01:00:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzjtnjy",
          "author": "JunaidRaza648",
          "text": "The problem isn't with traffic, the problem is your positioning. [Read this post to understand.](https://www.reddit.com/r/SmallBusinessOwners/s/wJ9hl5Zj9G)",
          "score": -2,
          "created_utc": "2026-01-14 15:11:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzlrhno",
              "author": "SafiCakes",
              "text": "How do you know what OP's positioning is? Or is this just a way to insert a bit of promotion under the guise of assistance?",
              "score": 2,
              "created_utc": "2026-01-14 20:27:52",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzo7wgg",
                  "author": "JunaidRaza648",
                  "text": "If your 'target paid audience' remains anonymous, it’s a positioning issue.\n\n\nYour copy doesn’t resonate with your audience enough to drive action.\n\nIt's very common issue.\n\nWith ads, either your competitors click for research purposes or your prospects click with buying intent.\n\nPS: Unless, of course, you have very poor ad copy or you’ve targeted the wrong audience.",
                  "score": 0,
                  "created_utc": "2026-01-15 04:19:40",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qdb34m",
      "title": "How are you keeping lead management human as volume scales?",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qdb34m/how_are_you_keeping_lead_management_human_as/",
      "author": "Just-Maximum-5679",
      "created_utc": "2026-01-15 05:31:32",
      "score": 10,
      "num_comments": 27,
      "upvote_ratio": 1.0,
      "text": "I'm curious how teams maintain that personal touch when lead volume explodes. Are you using smart automation to handle the routine stuff while keeping the meaningful interactions manual or have you found ways to automate follow-ups that still feel genuine? What's your sweet spot between efficiency and that human connection that actually converts?",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qdb34m/how_are_you_keeping_lead_management_human_as/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "nzoi08w",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-15 05:31:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzokdvx",
          "author": "KissyyyDoll",
          "text": "Honestly, most teams automate first touches and quick follow-ups, then leave the real conversations to humans. Keeps it personal where it counts.",
          "score": 4,
          "created_utc": "2026-01-15 05:49:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzol4fu",
              "author": "Just-Maximum-5679",
              "text": "The ideal scenario. We find ourselves losing it sometimes",
              "score": 2,
              "created_utc": "2026-01-15 05:55:41",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "nzp1ff8",
              "author": "Living_Truth_6398",
              "text": "This is actually perfect",
              "score": 1,
              "created_utc": "2026-01-15 08:18:23",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzok1w0",
          "author": "No_Duty8925",
          "text": "human in the loop has been the only thing that actually scales for us and our clients.\n\nwe use automation to handle volume and consistency. lead capture, routing, tagging, reminders, and light follow-ups so nothing slips. but automation never “closes the loop” on its own.\n\nthe moment there’s intent, a reply, or even a signal that someone’s warm, a real person takes over. that person sees the full context, adjusts tone, and decides the next move. that’s what keeps it human even when volume goes up.\n\nwe run our own agency the same way. systems create speed and visibility, humans create trust and conversions. every time we’ve tried to automate past that line, quality drops fast.\n\nthe sweet spot for us has been automation for structure + humans for judgment.",
          "score": 2,
          "created_utc": "2026-01-15 05:47:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzokklm",
              "author": "Just-Maximum-5679",
              "text": "You've a clearly laid out strategy! We've a lot of leads coming in esp during holidays and that's where we drop the ball most times.",
              "score": 1,
              "created_utc": "2026-01-15 05:51:17",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzokr0q",
                  "author": "No_Duty8925",
                  "text": "what industry are you in? i would be able to give you better advice if you tell me :)",
                  "score": 1,
                  "created_utc": "2026-01-15 05:52:42",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nzoovwj",
              "author": "Wide_Brief3025",
              "text": "You nailed it with humans closing the loop. What helped us was setting up smarter lead alerts so the handoff to a person was even faster and more relevant. For Reddit and Quora, using something like ParseStream made monitoring intent keywords way less manual, which let our team focus only where real trust building was needed.",
              "score": 1,
              "created_utc": "2026-01-15 06:26:24",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzoj2qq",
          "author": "Nastya_Tan",
          "text": "Honestly? We cap automation hard. If it can’t sound human, it doesn’t ship.",
          "score": 1,
          "created_utc": "2026-01-15 05:39:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzok1ym",
              "author": "Just-Maximum-5679",
              "text": "Balancing the hard and scaling the automation is the tricky bit",
              "score": 1,
              "created_utc": "2026-01-15 05:47:14",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzojvps",
          "author": "crazyreaper12",
          "text": "We automate the boring, not the talking. Scoring, tagging, nudges are automated. First real message is always written by a human with context. If a lead smells a template, they bounce. Efficiency without empathy is just spam with better analytics.",
          "score": 1,
          "created_utc": "2026-01-15 05:45:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzok6xr",
              "author": "Just-Maximum-5679",
              "text": "We tried the first message human rule and it did't work. Not when you have a lot of leads coming in.",
              "score": 1,
              "created_utc": "2026-01-15 05:48:18",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzom97g",
                  "author": "crazyreaper12",
                  "text": "You've to find a way out!",
                  "score": 1,
                  "created_utc": "2026-01-15 06:04:45",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzom2kr",
          "author": "TurnoverEmergency352",
          "text": "What’s worked for us is treating automation like scaffolding, not the building. It handles intake, routing, prioritization and reminders so nothing gets lost. The second a lead shows real interest, a human owns it.\n\nHaving everything visible in a crm helps a lot for context, past touches, signals. Monday crm works for us and helps reps respond like real people, not scripts. The mistake we see is letting automation finish conversations. It’s great for speed and coverage, but trust still comes from judgment, tone and timing. **Scale the system, not the relationship.**",
          "score": 1,
          "created_utc": "2026-01-15 06:03:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzw6hgs",
              "author": "Just-Maximum-5679",
              "text": "I like that, scale the system not the relationship!",
              "score": 1,
              "created_utc": "2026-01-16 09:45:43",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzosjqb",
          "author": "MelbourneBestAdviser",
          "text": "Automate first email thanking and advising human contact with option for client to book meeting",
          "score": 1,
          "created_utc": "2026-01-15 06:57:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzp2occ",
          "author": "mr-onlinemarketer",
          "text": "Actually I use leadsnipe io that helps me find warm prospects and then sort them into categories. A useful tool for warm outreach and keeping record of your process and tasks.",
          "score": 1,
          "created_utc": "2026-01-15 08:30:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzq8ick",
          "author": "Sudden-Context-4719",
          "text": "I’ve found using smart automation for routine follow-ups helps keep things efficient but still personal if you customize messages well. Tools like SocListener can help by auto-generating tailored comments and DMs on Reddit so you don’t lose that human feel even as volume grows. The key is to automate the first touch but jump in manually when the lead shows real interest.",
          "score": 1,
          "created_utc": "2026-01-15 13:58:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzqy6rh",
          "author": "mjain_entrepreneur",
          "text": "I can consider myself an expert here since I run a SaaS firm Scalenut, and this is something we’ve had to solve as volume scaled.\n\nWhat’s worked for us is being very intentional about what gets automated and what stays human. We automate the unopinionated stuff like routing, reminders, basic follow-ups, and nudges based on inactivity  but anything that needs context or judgment stays manual. This improves trust factor.\n\nUsing intent and behavior signals instead of generic timelines made a big difference for us. Follow-ups based on what someone actually did (or didn’t do) feel far more genuine than canned sequences.\n\nThe sweet spot is letting automation decide who to engage and when, while humans focus on how to engage.",
          "score": 1,
          "created_utc": "2026-01-15 16:03:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzr875w",
          "author": "kalwani_vikas",
          "text": "The struggle is real when volume spikes during peak times. “Keep it human” sounds great until you’re staring at 300 unworked leads and a burnt-out team.\n\nWhat’s helped teams I’ve seen is splitting by intent. High-intent stuff like demo requests stays fully manual. Cold LinkedIn outreach? That’s where automation actually saves you without killing quality.\n\nIf you're doing any linkedin prospecting, tools like HeyReach or Expandi can handle the volume side safely. HeyReach is nice because it lets you run multiple accounts without the constant ban paranoia, which is clutch when you're scaling. You can push serious volume across profiles, like 1000+ touches per week, but it's distributed so nothing looks spammy.\n\nThe trick is using it to open doors, not close them. Any reply or engagement gets flagged, then a real person jumps in with full context. Automation handles the grunt work, humans handle the trust building. That handoff is where most teams win or lose.\n\nAre you mostly inbound or is outbound part of the strategy too?",
          "score": 1,
          "created_utc": "2026-01-15 16:47:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzrt2pj",
          "author": "Rise_and_Grind_Pro",
          "text": "A bit of personalization can go a long way. Do you use AI to help you with that?",
          "score": 1,
          "created_utc": "2026-01-15 18:21:36",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qde0cp",
      "title": "How do I create a marketing funnel that consistently converts instead of just generating leads?",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qde0cp/how_do_i_create_a_marketing_funnel_that/",
      "author": "Living_Truth_6398",
      "created_utc": "2026-01-15 08:19:19",
      "score": 10,
      "num_comments": 19,
      "upvote_ratio": 0.86,
      "text": "We’re getting leads, but our funnel doesn’t seem to convert them into paying customers reliably. How do you structure a funnel that ensures consistent conversions rather than just lead volume?",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qde0cp/how_do_i_create_a_marketing_funnel_that/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "nzp1j1g",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-15 08:19:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzp35m1",
          "author": "Wide_Brief3025",
          "text": "You might want to look at where your leads drop off and make sure your follow ups are personalized and timely. Tweaking your messaging to fit each stage of the funnel really helps. I started using ParseStream for notifications when key topics popped up on Reddit and it made a big difference in focusing on higher quality leads that are actually ready to convert.",
          "score": 3,
          "created_utc": "2026-01-15 08:35:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzvmjms",
              "author": "Living_Truth_6398",
              "text": "That makes sense. I’ve been hearing the same thing from a few people  I’ll take a closer look at where we’re losing momentum and adjust from there. Out  of curiosity, which stage usually gives you the biggest drop-off.",
              "score": 1,
              "created_utc": "2026-01-16 06:46:38",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o05a7mn",
              "author": "Dapper-Condition6041",
              "text": "Does ParseStream also support posting replies?",
              "score": 1,
              "created_utc": "2026-01-17 18:17:58",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzpo94m",
          "author": "Impressive-Amount255",
          "text": "The \"leads but no sales\" trap is the absolute worst. It’s like throwing a party where everyone shows up for the free drinks but nobody stays for the actual event. If you're getting volume but zero revenue, it usually means your funnel isn't a funnel: it’s just a bunch of random touchpoints that don't actually talk to each other.\n​The breakdown usually happens because the \"vibe\" shifts. You lure them in with a cool ad, but then the landing page feels generic, and the follow-up emails feel like they were written by a robot from 2005. People drop off the second they feel a \"dead end\" or get confused about what they’re supposed to do next.\n​I used to have this exact problem until I stopped thinking about individual ads and started thinking about the whole flow. Personally, I've been leveraging the RIO integrated marketing campaign framework for a bit now and it completely changed my way of doing marketing. It makes sure everything is actually connected so you aren't just wasting cash on clicks.\n\n​Here is how I’d fix it:\n​First, you gotta Rally your message. If your top-of-funnel is promising a specific solution, your middle-of-funnel better be doubling down on that same \"messaging house.\" If there’s a gap between what they signed up for and what you’re selling, they’ll bounce every time.\n​Then, you have to Integrate the journey. This is where most funnels leak. You need to map it out so there are zero dead ends. If they download a PDF, the very next email should be a logical \"part two\" of that conversation. If they visit your pricing page but don't buy, your retargeting ads should hit them with a case study. It’s all about connecting the pipes so they can’t fall out.\n​Finally, you Orchestrate the timing. Conversion is a slow burn. You can't just scream \"buy now\" the second they give you an email. You gotta time your touches—educational stuff first to build trust, then some social proof, then the hard offer.\n\n​When you actually integrate your channels like this, the conversion part feels way more natural. You're not \"selling\" as much as you are just guiding them to the next step.",
          "score": 3,
          "created_utc": "2026-01-15 11:49:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzvmq8e",
              "author": "Living_Truth_6398",
              "text": "Really appreciate the tips .When you started using that framework, which part of the journey did you find was leaking the most for you  top-to-middle or post-demo/final push?",
              "score": 1,
              "created_utc": "2026-01-16 06:48:08",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzvojr1",
                  "author": "Impressive-Amount255",
                  "text": "Neither, really.\nTop to middle, in my domain that has long sales cycles, may be multi nths, quarters, sometimes years. So I wouldn't say it leaks, but it may stagnate. I this case, constant nurturing was key to remain top of mind until the time came.\nDown conversion you usually face three scenarios:\n1. It convert (yeah)\n2. It doesn't convert because the time isn't right - - > keep nurturing\n3. It doesn't convert because the target isn't right (no budget, need) - - > trash (but I wouldn't call it leak, because it's on purpose)",
                  "score": 1,
                  "created_utc": "2026-01-16 07:03:18",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzqs7tb",
          "author": "Euphoric-View-9876",
          "text": "Most funnels dont fail at conversion, they fail before the lead ever enters. If the first touch is generic, the rest of the funnel is just damage control. What changed things for us was starting upstream sourcing leads based on competitor audiences and active problem signals, then feeding only those into the funnel. When someone already follows or engages with tools like yours (or your competitors), the funnel feels natural instead of forced. We pair that kind of signal discovery with Clay for enrichment + sequencing, and suddenly the same funnel converts without adding steps. Volume stayed the same intent didnt.",
          "score": 2,
          "created_utc": "2026-01-15 15:35:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzqx2yr",
          "author": "GetNachoNacho",
          "text": "Focus on nurturing leads with value and trust at each stage to ensure consistent conversions.",
          "score": 2,
          "created_utc": "2026-01-15 15:58:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzvmy3r",
              "author": "Living_Truth_6398",
              "text": "That doess really makes sense. You're not the firsy I've heard say the “trust gap” is usually where things stall, not the lead capture itself.\n\nWhen you’re nurturing, what’s been most effective for you in actually building that trust",
              "score": 1,
              "created_utc": "2026-01-16 06:49:57",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzq8rpp",
          "author": "Sudden-Context-4719",
          "text": "You need to focus on warming up leads with real value before pitching. On Reddit, that means engaging in relevant posts with helpful comments that build trust. Tools like SocListener can help find those posts and automate tailored replies so you don’t just get leads but start real conversations that convert better.",
          "score": 1,
          "created_utc": "2026-01-15 13:59:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzrw1v1",
          "author": "PuzzleheadedTrade763",
          "text": "By not using a funnel mindset.",
          "score": 1,
          "created_utc": "2026-01-15 18:34:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzwv694",
          "author": "sarkhem",
          "text": "First, I stopped sending everyone to the same page.  \nCold traffic doesn’t want a pitch. It wants clarity.  \nIf they don’t know *what problem you solve*, they won’t buy.\n\nSecond, I learned to filter instead of nurture.  \nMy best funnels don’t convince. They **disqualify**.  \nIf someone isn’t ready, I let them go instead of spamming emails.\n\nThis is my simple framework now:\n\n1. **One problem per funnel** If your funnel solves three problems, it solves none. One pain. One promise. One next step.\n2. **Proof before persuasion** I show outcomes early. Screenshots, numbers, or mistakes I made. No hype. People smell that fast.\n3. **Micro-commitment before offer** Before selling, I ask them to do something small. Read a guide. Try a checklist. Watch a short demo. If they don’t move here, they won’t buy later.\n4. **Match the offer to awareness** Most funnels fail because they sell too early. If someone just discovered the problem, don’t push a paid solution yet.\n\nWhat finally made my funnels convert was understanding *what users already know* when they enter.  \nOnce I matched the message to their awareness level, conversions followed.\n\nLeads didn’t increase much. Sales did.",
          "score": 1,
          "created_utc": "2026-01-16 12:59:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0g0ake",
          "author": "smartyladyphd",
          "text": "I think thewayhow.com has practical guides for building conversion-focused funnels. They walk through lead nurturing, scoring, and engagement tactics so leads don’t just enter the funnel, they become customers.",
          "score": 1,
          "created_utc": "2026-01-19 08:25:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzptvzj",
          "author": "Radiant-Security-347",
          "text": "another post with a complex question and absolutely zero information.\n\nHeres a suggestion for all. give us the type of business, industry, some specific ics about what you are doing, whether you have marketing experience or not, size of business, target customer …\n\nAnyone who knows what they are doing won’t give an answer based on zero info. And those that do are just giving generic advice based on assumptions.",
          "score": 0,
          "created_utc": "2026-01-15 12:30:26",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qcyk5y",
      "title": "Pitching journalists is making me realize how easy b2b sales actually is",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qcyk5y/pitching_journalists_is_making_me_realize_how/",
      "author": "CutieChick2",
      "created_utc": "2026-01-14 20:33:02",
      "score": 7,
      "num_comments": 15,
      "upvote_ratio": 0.82,
      "text": "I have been trying to get some press for our new product launch and holy crap journalists are a completely different breed compared to the prospects i usually deal with. In sales you can usually get away with a bit of fluff or a generic opening but if you try that with a writer they will literally block you before the second sentence. i have sent like 50 personalized pitches this week and i am getting zero bites despite having a pretty cool product.\n\nI am starting to think that my \"sales brain\" is actually hurting my PR efforts. Has anyone here actually cracked the code on getting reporters to respond without spending 10 hours on every single pitch? I am open to any workflows or tools that make this less of a nightmare because right now i am just shouting into a void.",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qcyk5y/pitching_journalists_is_making_me_realize_how/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "nzlsln3",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-14 20:33:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzmx0c4",
          "author": "kubrador",
          "text": "journalists get like 500 pitches a day and they've developed an immunity to corporate speak that would make a cockroach jealous. your sales brain is absolutely sabotaging you because reporters don't care about your \"innovative solution\" they care about stories their readers will click on.\n\nthe cheat code is to stop pitching your product and start pitching a story angle that happens to feature your product. \"we launched a new b2b platform\" = delete. \"here's weird data about how \\[industry trend\\] is changing and we have the receipts\" = maybe opens email.\n\nbuild relationships before you need them but i'm guessing you needed coverage yesterday so that ship has sailed directly into the sun",
          "score": 11,
          "created_utc": "2026-01-14 23:46:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzol3cz",
              "author": "KissyyyDoll",
              "text": "Exactly, story > product. If the angle isn’t compelling, reporters won’t bite no matter how “innovative” you think it is.",
              "score": 2,
              "created_utc": "2026-01-15 05:55:27",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzmwg6l",
          "author": "carrzo",
          "text": "Former journo. Can guarantee your sales brain is a huge turn off. They did not want to hear you say it's a great product, they want to have found it by themselves, or at least have them think they did. Target with a 20 second as authentic as possible UGC like video about how fed up someone was about a problem and how this finally fixed it, etc.",
          "score": 3,
          "created_utc": "2026-01-14 23:43:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nznkue9",
          "author": "signalpath_mapper",
          "text": "Different muscle entirely. In sales you can steer the convo, with journalists you either give them something usable fast or you are noise. What worked for us was treating it like support triage, clear hook in the first line, why their audience cares, and concrete data or outcome they can lift without a call. If it takes more than 30 seconds to understand, it’s already dead. Also volume helps, most replies came weeks later, not immediately.",
          "score": 3,
          "created_utc": "2026-01-15 01:59:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nznhvl1",
          "author": "Practical_Draw_6862",
          "text": "Post one of your emails to them",
          "score": 2,
          "created_utc": "2026-01-15 01:42:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzokvr0",
          "author": "KissyyyDoll",
          "text": "The challenge is that journalists receive dozens of pitches daily, so relevance and timing matter more than volume. Segmenting your list by beat, referencing recent work, and keeping the first 2 sentences hyper-specific increases response rates. Templates can help if you tweak them per reporter, but automation without personalization will tank. It’s less about hours per pitch and more about hitting the right story angle.",
          "score": 1,
          "created_utc": "2026-01-15 05:53:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzpqhfl",
          "author": "Radiant-Security-347",
          "text": "The cheat code is to know what you are doing.",
          "score": 1,
          "created_utc": "2026-01-15 12:05:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzqg8ff",
          "author": "Corgi-Ancient",
          "text": "Honestly, journalists want super specific and quick value in your pitch. Try cutting the fluff and lead with a clear, unique angle that fits their beat. Also, tools like SocLeads can help you find the right contacts fast so you’re not wasting time pitching the wrong people.",
          "score": 1,
          "created_utc": "2026-01-15 14:38:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzttm9t",
              "author": "hollee-o",
              "text": "I mean, honestly, journalists don’t want your pitch at all. I’ve been a journalist as well as an editor, and the number of stories I published that came in over the transom was vanishingly small. Good PR people (also vanishingly small in number) spend years building relationships with editors and journalists. Cold outreach getting traction is hard to imagine unless you can prove you just solved cold fusion.",
              "score": 1,
              "created_utc": "2026-01-16 00:07:33",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzvpogn",
          "author": "sperks12",
          "text": "I think this is where bigger brands with considerable brand equity will always have an advantage. I’m fortunate to work in a large financial services firm. Our media team will, largely, get strong pick up on the self promoting content, like product launches or enhancements, with journalists in our specific trade publications. Yet they’ve had years/decades of relationship building. \n\nAs everyone else has commented. You need to make their life as easy as possible and something genuinely interesting and insight-led. If you’ve done a heap of research, can articulate that story and then bolt on that you’ve solved a problem off the back of it you may have more luck.\n\nAdmittedly. Easier said than done.",
          "score": 1,
          "created_utc": "2026-01-16 07:12:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o07fvsh",
          "author": "JillsideStrangler",
          "text": "How about getting to know them? My biggest turn off is when I accept a new LinkedIn invite and the immediate turnaround is a sales pitch. Which is why I rarely accept them from sales people. \n\nWhy don’t you follow or friend your target audience a bit, get to know their personalities and their styles, invite them to an industry event or dinner, and then work on your sales pitch.",
          "score": 1,
          "created_utc": "2026-01-18 00:47:49",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qca3yf",
      "title": "Is anyone actually tracking if ChatGPT is recommending their product?",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qca3yf/is_anyone_actually_tracking_if_chatgpt_is/",
      "author": "zabiranik",
      "created_utc": "2026-01-14 01:39:37",
      "score": 7,
      "num_comments": 32,
      "upvote_ratio": 0.89,
      "text": "Hey all,\n\nI was looking at some buyer journey data for 2026 and realized how much of our \"discovery\" phase is now just happening inside ChatGPT or Perplexity.\n\nIt’s starting to feel like we’re flying blind. If a prospect asks AI for the \"best tool for X,\" and we aren't mentioned, we basically don't exist to them. But unlike Google, I don't have a Search Console to see what's happening...\n\nIs anyone here actually measuring this? If so:\n\n* Are you just doing manual spot-checks/spreadsheets?\n* Have you found any tools that aren't enterprise-priced or just \"SEO tools rebranded\"?\n* Or are we all just hoping for the best and watching branded search traffic?\n\nGenuinely curious if this is a priority for your teams right now or if I’m overthinking this...",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qca3yf/is_anyone_actually_tracking_if_chatgpt_is/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "nzgnlws",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-14 01:39:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzgvixi",
          "author": "askoshbetter",
          "text": "Definitely a priority. \n\n1. Google Analytics report on AI referral \n\n2. SERP analysis but with each AI for brand and top queries. \n\n3. All forms have a self attribution field. People are putting ChatGPT",
          "score": 3,
          "created_utc": "2026-01-14 02:24:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzjc3nz",
          "author": "Critical-Ad-9390",
          "text": "ga 4 shows you source\n\nbut there are tools like mentions. so etc on the market.",
          "score": 2,
          "created_utc": "2026-01-14 13:39:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzkwbpk",
              "author": "zabiranik",
              "text": "GA4 does show you the “source,” but it’s still web-centric. I am currently reviewing few other tools.",
              "score": 1,
              "created_utc": "2026-01-14 18:07:58",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzimzz5",
          "author": "Fred-swe",
          "text": "We track 50+ prompts weekly/monthly with the help of Scrunch Ai. This way we can track how often we are included in a couple of likely prompts that buyers will use. \n\nWe can also see how we show up compared to our competitors, how we are progressing etc. When we started we had around 5-10% visibility and now we have more than doubled in a couple of months",
          "score": 1,
          "created_utc": "2026-01-14 10:39:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzkvxbq",
              "author": "zabiranik",
              "text": "The competitor comparison part is what I’m most curious about. Seeing “you’re up / you’re down” relative to others feels way more useful than raw visibility numbers.",
              "score": 1,
              "created_utc": "2026-01-14 18:06:12",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzlbj7l",
                  "author": "Fred-swe",
                  "text": "Yes you will see how you compare vs completion in a very visual way. I shared this with commercial management every month.",
                  "score": 1,
                  "created_utc": "2026-01-14 19:15:19",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzj1oau",
          "author": "saturdayborn",
          "text": "Yup. I sell IT consulting and services. I check chatGPT, Gemini and a few others (Claude) etc monthly for all our service offerings then tweak our page accordingly.",
          "score": 1,
          "created_utc": "2026-01-14 12:35:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzjpyxc",
          "author": "corwinsword",
          "text": "Everybody waits for Search Console in ChaGPT or Gemini. Without that the only thing we can do is track visibility only by short list of prompts",
          "score": 1,
          "created_utc": "2026-01-14 14:53:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzkwxbl",
              "author": "zabiranik",
              "text": "Everyone’s basically waiting for a “Search Console for ChatGPT”",
              "score": 2,
              "created_utc": "2026-01-14 18:10:37",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzkifis",
          "author": "WizCommerceOfficial",
          "text": "Yes a lot of companies do track it",
          "score": 1,
          "created_utc": "2026-01-14 17:05:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzljzr8",
          "author": "Shoddy_Island_1283",
          "text": "I would like to know how a 3rd party service can have access to private interactions with an ai model to collect mentions...",
          "score": 1,
          "created_utc": "2026-01-14 19:53:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzll3wa",
          "author": "JohanAdda",
          "text": "my question to you is more: are you cited by ChatGPT / Gemini about your product? Or you want to understand how it works?   \nNot knowing what you do I would say: like GSC, check first if all your technical foundation are AI Engine friendly. Audit tools first. Then E.E.A.T, then tracking. Make sense?",
          "score": 1,
          "created_utc": "2026-01-14 19:58:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzlt6ij",
          "author": "mada299",
          "text": "I'm using Graphite - the CEO gave me access to a self-serve tool that aggregates everything in one place.",
          "score": 1,
          "created_utc": "2026-01-14 20:35:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzltf5y",
              "author": "mada299",
              "text": "Also looking at my competitors and the content LLMs use as reference for their mentions is giving me a lot of good ideas for what content to write...",
              "score": 1,
              "created_utc": "2026-01-14 20:36:47",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzme43p",
          "author": "erickrealz",
          "text": "The concern is legitimate but the measurement tools are barely functional right now. The space is too new and the AI platforms don't provide any referral data the way search engines do. You're not overthinking it, you're just early to a problem nobody has solved well yet.\n\nThe manual spot-check approach is what most people are stuck with. Search your brand, your product category, competitor comparisons, and common buying queries in ChatGPT and Perplexity periodically. Screenshot results, track changes over time. Not scalable but currently the most accurate method.\n\nThe tools claiming to track AI mentions are mostly overselling their capabilities. Our clients who've tried them usually find the data is directional at best and the methodology is opaque. Some are literally just running the same manual queries you could do yourself and charging monthly for it.\n\nThe signals that actually tell you something: branded search volume trends, direct traffic patterns, and asking new customers how they found you. If AI discovery is happening, some percentage will search your brand name afterward or mention \"ChatGPT recommended you\" when asked.\n\nThe optimization side might matter more than the measurement side right now. Creating content that answers specific questions clearly, building citations and mentions across authoritative sources, and having consistent product information that AI can pull from. You can't track recommendations perfectly, but you can influence whether they happen.",
          "score": 1,
          "created_utc": "2026-01-14 22:10:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzn7ef2",
          "author": "rainmakerdigital",
          "text": "We've manually been spot-checking. Nothing beyond that right now.\n\nIs Perplexity really that big of a factor for your business? All the numbers we've seen indicate that Perplexity isn't much of the market, but if you're in certain niches there may be more people using it.",
          "score": 1,
          "created_utc": "2026-01-15 00:42:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzo56ry",
          "author": "_forgotmyownname",
          "text": "There isn't a \"Search Console\" for LLMs yet, so most people are just using manual prompting or third-party scrapers. You can track branded search lift, but attributing it directly to an AI recommendation is mostly guesswork right now. It’s definitely a major blind spot for B2B.",
          "score": 1,
          "created_utc": "2026-01-15 04:01:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzr0fa6",
          "author": "mjain_entrepreneur",
          "text": "Yes. We at Scalenut do check that and evaluate it accordingly. Rather, we have built our own tool, GEO Watchtower, within our SaaS to know how many times our own or anyone's brand has been mentioned on AI platforms.\n\nWhat I feel is that there is still no perfect tool available for the same, but improving your brand authority on AI platforms is a go-to task to keep getting valuable leads. So what I advise is follow set patterns of optimization and keep tracking the graph of overall leads. This will help you evaluate whether your ways are improving the numbers or not.",
          "score": 1,
          "created_utc": "2026-01-15 16:13:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzvzldy",
          "author": "Old-Environment8760",
          "text": "Yes, we do it through nobori.ai",
          "score": 1,
          "created_utc": "2026-01-16 08:41:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzxkzh6",
          "author": "Brilliant-Trade-8671",
          "text": "yeah we are tracking this, and it is actually pretty straightforward\n\nopenai already appends utm style parameters to outbound links when it references a site, so we just read and track those like any other channel. when that traffic lands on our site, we can clearly see chatgpt or other ai tools as the source in analytics\n\nthe more interesting part is we pass those openai generated utm params straight into our on site ai agent. we use aimdoc, which is an ai agent that lives on the website. it takes utm and referrer context as input, so it knows this visitor likely came from chatgpt and can adjust how it answers, what it explains, and what it prioritizes\n\nthat way we are not flying blind and can tie ai discovery directly to conversations and outcomes instead of just watching branded search traffic",
          "score": 1,
          "created_utc": "2026-01-16 15:14:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzh5hn1",
          "author": "arjb67",
          "text": "Take a look at Rankscale",
          "score": 0,
          "created_utc": "2026-01-14 03:21:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzgwbze",
          "author": "Ok_Revenue9041",
          "text": "Manual spot checks and spreadsheets can help, but they miss a lot and definitely get tedious fast. Some teams are starting to use dedicated tools that focus on how AI platforms mention brands. MentionDesk is one service I’ve tried for this exact thing, since it tracks how often your brand shows up in AI answers and gives real data instead of just hoping for the best.",
          "score": -1,
          "created_utc": "2026-01-14 02:28:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzkvoly",
              "author": "zabiranik",
              "text": "once you’re manually checking prompts and dumping into sheets, it turns into a part-time job real fast 😅  \nI will check MentionDesk btw",
              "score": 0,
              "created_utc": "2026-01-14 18:05:08",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qelj7s",
      "title": "Looking for A Demand / Lead Gen Agency Partner",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qelj7s/looking_for_a_demand_lead_gen_agency_partner/",
      "author": "Variable_Interest",
      "created_utc": "2026-01-16 17:00:41",
      "score": 6,
      "num_comments": 18,
      "upvote_ratio": 0.88,
      "text": "I am the media director at a mid-sized, full service agency that works exclusively in the B2B space.  We're category agnostic.  My background is primarily brand advertising.  I know enough about lead gen to fake it in a pitch but we can't really activate well against it.\n\nOur primary model with bigger clients is to work with partner agencies in order to leverage scale when possible.  We have a proven partner for the brand space.  We need one for demand/lead gen.  Right now we are relying on a (somewhat flakey) freelancer to run our Google Ads accounts.  I run LinkedIn and other socials with the one junior on my team.\n\nI'm looking for either an agency or a rock solid freelancer that we can white label and bring on when necessary.  Definitely need to see some solid DG/LG case studies in addition to standard creds. We've lost pitches because we don't have this capability.\n\nFor case studies, I'm not sure exactly what we're looking for but maybe something that talks about lead quality (% that converted to SALs for example) or direct ties to closed /won $$$.\n\nI've been challenged by our CEO to come up with a short list of agencies to RFP.  Trying to Google this topic is a hellscape so I figured I'd start here.  Feel free to comment or hit my Reddit DMs.\n\nedit:\nSomeone sent me DM about cold emails and I fat fingered it and hit \"ignore\". Apologies for that.  Regardless, cold email is not what we're looking for.",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qelj7s/looking_for_a_demand_lead_gen_agency_partner/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "nzy91h3",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-16 17:00:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzz694g",
          "author": "erickrealz",
          "text": "The white-label demand gen partner search is tricky because the agencies good enough to produce SAL conversion data and closed-won attribution usually have their own client roster and aren't hungry for white-label arrangements. The ones actively seeking white-label work are often the B-tier players who couldn't build their own book.\n\nThe exception is smaller shops or senior freelancers who prefer the referral model over business development. They exist but they're not advertising \"white label demand gen\" because their pipeline comes from relationships exactly like what you're describing.\n\nThe case study red flags to watch for: agencies showing MQL volume without downstream metrics are hiding poor lead quality. Anyone who can't speak to sales feedback loops or lead-to-opportunity conversion probably isn't measuring what matters. Our clients evaluating demand gen partners usually find that the willingness to discuss what didn't work is more telling than polished success stories.\n\nThe RFP criteria worth emphasizing: ask specifically about their process for feedback loops with sales teams, how they define and measure lead quality beyond form fills, and what their approach is when a campaign produces volume but sales says the leads are garbage. The good partners have answers because they've navigated this tension before.\n\nThe sourcing approach since Google is useless: LinkedIn posts from demand gen practitioners you respect, asking peers at non-competing agencies who they've partnered with, and honestly the HubSpot and 6sense partner directories sometimes surface capable smaller shops.\n\nThe freelancer versus agency question: a senior freelancer with 10+ years of B2B demand gen experience might outperform a mid-tier agency and be more flexible on white-label terms.",
          "score": 5,
          "created_utc": "2026-01-16 19:28:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzz7ed4",
              "author": "Variable_Interest",
              "text": "This is super helpful.  Thank you.",
              "score": 2,
              "created_utc": "2026-01-16 19:33:22",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o00qkuy",
              "author": "KingNine-X",
              "text": "Really well said. This advice also applies to broader white-label partnerships with freelancers and boutique agencies. If you're looking for reliability, an experienced freelancer or small specialized shop is likely to provide much more than any mid-tier agency with churn & burn. Especially true for timeliness and deliverables in demand gen work, whether that's nurture campaigns, paid social, or search and display ads.",
              "score": 1,
              "created_utc": "2026-01-17 00:07:01",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o0g38s1",
              "author": "Critical-Fix-8162",
              "text": "I’m with B2BinDemand. We partner with B2B agencies as a white-label demand/lead gen extension and we can share down-funnel case studies (SAL/SQL rates + pipeline influence) if anyone’s building an RFP shortlist.",
              "score": 1,
              "created_utc": "2026-01-19 08:52:47",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzydhk4",
          "author": "OkCardiologist1426",
          "text": "Just sent you a DM. Hopefully it is helpful.",
          "score": 2,
          "created_utc": "2026-01-16 17:20:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzyg1dx",
          "author": "International_Rip706",
          "text": "Not affiliated, but I’ve mentioned The B2B Playbook a few times because i got the most use out of their content and they seem like nice people. They mentioned on their podcast that they do agency work specifically in this space. Might be worth having a look",
          "score": 2,
          "created_utc": "2026-01-16 17:31:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzzagl7",
          "author": "Competitive-Run1666",
          "text": "I do paid sales consulting gig. Help companies set-up their sales team. Got experience of more than 18+yrs in IT Sales (Service Based) B2B and B2C). Dm me if you need help.",
          "score": 1,
          "created_utc": "2026-01-16 19:47:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzzcyka",
          "author": "Temporary_Basket7149",
          "text": "When you say someone sent you a DM about cold emails do you mean you're not interested in the email channel? Curious - I'm an exec at a full service agency, overseeing the performance marketing/lead gen business. We produce 7 figures monthly for large brands on a lead gen/performance model. Reach out if you want to chat happy to provide my email.",
          "score": 1,
          "created_utc": "2026-01-16 19:59:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o034rof",
          "author": "kubrador",
          "text": "this is a solid question but you're gonna have way better luck asking in the actual b2b marketing slack communities or reaching out to your existing brand agency partner to ask who they know in demand gen. reddit's gonna give you 90% agencies trying to spam you in dms lol.\n\nthat said, if you want actual leads: check who's winning awards at b2b marketing conferences (like demandcon or similar), look at case studies on g2 filtered by \"demand generation\" and sort by verified reviews, or just ask your network directly who they're using successfully. people are weirdly willing to recommend agencies that aren't their direct competitors.",
          "score": 1,
          "created_utc": "2026-01-17 10:58:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o03xfem",
          "author": "signal_loops",
          "text": "if I were in your seat, I’d anchor the RFP less on channels and more on proof of revenue impact, because that’s where mos lead gen partners fall apart. ask for case studies that show the full funnel  ICP definition → offer → channel mix → MQL → SAL → pipeline → closed/won, with clear acceptance criteria and timelines, not just CPL screenshots. strong demand partners will be comfortable talking about lead rejection rates, sales feedback loops, and how they course correct when volume is high but quality is low. in B2B especially, look for teams that specialize in LinkedIn + Google together  , have experience integrating with CRMs and sales teams, and can articulate how they qualify intent beyond form fills  . a good white label partner should also be operationally boring documented processes, consistent reporting, predictable communication, and no heroics required.",
          "score": 1,
          "created_utc": "2026-01-17 14:22:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o05zwhg",
          "author": "ppcbetter_says",
          "text": "I’ve been doing lead gen via paid search and social for 20 years. Can scale with hires if needed.\n\nSend a DM or check my links in bio if you’d like to explore a fit. Case studies on my YouTube",
          "score": 1,
          "created_utc": "2026-01-17 20:20:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o080yvx",
          "author": "DIGITIFYU",
          "text": "Hey yes best way to scale faster is leveraging and collaborating with other agencies.we can help you in lead generation through Google ads \n\nLet's connect and explore how we can help you",
          "score": 1,
          "created_utc": "2026-01-18 02:39:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ebft6",
          "author": "Euphoric-View-9876",
          "text": "If I were in your seat, Id filter less on channel expertise and more on operating maturity. The partners that actually work in white label setups are the ones who can speak clearly about lead quality, sales feedback loops, and what they do when volume looks good but sales says “these are trash.” Id ask for one case study that walks end to end from ICP -- offer -- channel mix -- SAL -- pipeline -- closed-won, including what broke and how they fixed it. The best fits are usually senior freelancers or small specialist shops who value referrals over branding and are comfortable being invisible.",
          "score": 1,
          "created_utc": "2026-01-19 01:29:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0g1ujm",
          "author": "SubjectIllustrious93",
          "text": "If I were in your position, I would disregard 90% of the online chatter about \"lead gen agencies.\" The majority of it is either thin case studies with no down-funnel proof or vanity CPL flexing.  \n  \nAsking a few direct questions up front is the fastest method I've found to distinguish real partners from slide decks:  \n  \nWho approves sales or marketing and what qualifies as \"qualified\"? (Run if they avoid this.)  \n  \nWhat is the average percentage of leads that become SAL/SQL? Not \"500 leads were generated.\"  \n  \nHow do you respond to reasons for rejection? (Good partners don't make excuses; they have a close feedback loop.)  \n  \nCould you provide one or two instances of pipeline/closed-won being connected to the program? evenly orientated.  \n  \nOperationally, how do they integrate with your workflow? (CRM tags, SLAs, reporting cadence)\n\nIn terms of operations, how do they integrate with your process (CRM tags, SLAs, reporting cadence) to prevent chaos?\n\nIt's also important to note that larger clients will be far more interested in \"we can deliver sales-accepted leads reliably\" than in \"we run Google and LinkedIn.\"",
          "score": 1,
          "created_utc": "2026-01-19 08:39:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0hugq8",
          "author": "Acrobatic_Horror_623",
          "text": "What type of business are u trying to get leads for?",
          "score": 1,
          "created_utc": "2026-01-19 16:00:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0i13xh",
          "author": "Conscious-Gear-1484",
          "text": "Hi everyone,\n\nNot here to promote any agency.\n\nQ2 2025 was our worst quarter, especially from a lead quality standpoint. At the time, we were working with a lead agency that delivered volume, but the conversion was terrible - roughly 1–2 closes per 1,000 leads.\n\nAs Head of Data Acquisition, I decided to switch providers and moved to a US-based startup agency. The difference was noticeable: significantly better data quality at nearly half the cost.\n\nIn the following quarter, our deal closures increased substantially.\n\nIf anyone’s interested, I’m happy to share the company name or answer questions about what we changed.",
          "score": 1,
          "created_utc": "2026-01-19 16:30:40",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qbh772",
      "title": "What signals do you trust most to identify real buying intent when most B2B buyers avoid forms and sales calls early on?",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qbh772/what_signals_do_you_trust_most_to_identify_real/",
      "author": "Charles_R23",
      "created_utc": "2026-01-13 03:59:01",
      "score": 6,
      "num_comments": 21,
      "upvote_ratio": 0.88,
      "text": "*Sales says leads aren’t ready. Marketing says interest is high. Buyers are researching quietly, leaving almost no visible signals behind.*",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qbh772/what_signals_do_you_trust_most_to_identify_real/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "nzakzkt",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-13 03:59:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzbi7jp",
          "author": "kubrador",
          "text": "the honest answer is you're probably overthinking it\n\nintent data vendors will sell you \"signals\" but most of it is garbage - oh they visited a pricing page, groundbreaking stuff\n\nwhat actually works: people talking to your existing customers, engaging with ungated deep-dive content (not your ebook, your weird specific blog post about a niche problem), or lurking in your community spaces for months before surfacing\n\nsales wants form fills because it's easy. marketing wants to count clicks because dashboards. neither tells you much about actual readiness to buy\n\nbest signal i've seen? when someone reaches out and already knows your pricing, your competitors, and has specific implementation questions. everything before that is just... research",
          "score": 5,
          "created_utc": "2026-01-13 08:14:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "nze2551",
              "author": "iammahdali",
              "text": "So you are suggesting content marketing if i am not mistaken?",
              "score": 1,
              "created_utc": "2026-01-13 18:02:00",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nzpbzpg",
              "author": "Leather_Database_409",
              "text": "This is dead on because real buying intent shows up when someone already did the homework and just wants to know if you can actually solve their specific mess.",
              "score": 1,
              "created_utc": "2026-01-15 10:01:23",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzbdcpg",
          "author": "stacktrace_wanderer",
          "text": "From the ops side, we learned to trust behavioral signals over declared interest. Things like repeated returns to the same workflow pages, deeper usage of docs, or multiple people from the same account showing up close together mattered more than form fills. What did not help was trying to score everything. That just created arguments between teams. The most reliable signal was when someone tried to fit the product into an existing process, even quietly. By the time sales noticed, support was often already seeing more specific, less exploratory questions.",
          "score": 4,
          "created_utc": "2026-01-13 07:28:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzdgijb",
          "author": "Sudden-Context-4719",
          "text": "I find that real buying intent shows up in niche community posts where people ask specific product or problem questions. Since most B2B buyers avoid forms early, tools like SocListener help by spotting those Reddit posts and letting you jump in with tailored replies before they go cold. It’s way better than waiting for leads to fill out forms or take calls.",
          "score": 2,
          "created_utc": "2026-01-13 16:11:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzb5n4f",
          "author": "lucas-reid3",
          "text": "Usually it’s not one big signal. It’s when the same company keeps coming back to pricing or comparison pages that it starts to feel real.",
          "score": 1,
          "created_utc": "2026-01-13 06:22:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzccohj",
              "author": "xxtoni",
              "text": "I'm a marketing newbie, our or curiosity how do you measure it's the same company?",
              "score": 2,
              "created_utc": "2026-01-13 12:41:34",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzoe7ia",
                  "author": "1st_sailonsilvergirl",
                  "text": "Subscribe to a website visitor deanonymization software.",
                  "score": 1,
                  "created_utc": "2026-01-15 05:03:33",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzbxmhs",
          "author": "madhuforcontent",
          "text": "Multiple visits to pricing, case studies, or product pages, checking out your team or company page, opening multiple emails, or clicking specific CTAs and repeat website visits in a week.",
          "score": 1,
          "created_utc": "2026-01-13 10:41:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzck0u4",
              "author": "RandyCanuck",
              "text": "Or at least strong interest. What gets me, is that when the buyer actually does reach out, the sales team starts selling. And that is often too early. The person/ company never comes back.",
              "score": 1,
              "created_utc": "2026-01-13 13:27:43",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzef7od",
          "author": "BarkingMadJosh",
          "text": "Category share of search and brand search volume.",
          "score": 1,
          "created_utc": "2026-01-13 18:59:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzeydux",
          "author": "AchieveItDigital",
          "text": "The problem with most intent data is that it’s too broad. The more specific you get the better.\n\nYou need to prioritize repeat site visitors, email opens/clicks, and multi-touch engagement because that shows a pattern of research rather than a one-off click.\n\nEngagement in niche online communities is huge and can be tracked. It’s a strong signal that a prospect has already crossed the trust barrier. When you see multiple people from the same domain hitting your site and active participation in your niche communities",
          "score": 1,
          "created_utc": "2026-01-13 20:27:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzgokxi",
          "author": "_forgotmyownname",
          "text": "I've noticed the best signs are usually the ones they don't think we see. High intent for me is when someone from the same company visits the pricing page or a specific case study multiple times in a week.\n\nAlso, if they're downloading a technical guide or a comparison sheet rather than just a generic ebook, they’re usually deep in the research phase. It’s all about watching those \"silent\" repeats on high-value pages.",
          "score": 1,
          "created_utc": "2026-01-14 01:45:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzh384g",
          "author": "TNT-Rick",
          "text": "Depends on who the buyer is.\nRegardless, one of the highest intent signals is filling out a form to request a demo.\nDon't avoid trying to drive these conversions. Depending on the audience and offering, you may not be able to drive huge volumes of these demo requests but they're super valuable.\nSome marketers act like prospects are surprised or offended when a business invites them to check out their product, but in actuality they expect it.",
          "score": 1,
          "created_utc": "2026-01-14 03:07:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzi141w",
          "author": "OwnRule52",
          "text": "Set up website visitor id tools and see the pages they are checking out, like pricing and product pages. Check if they are interacting with your LinkedIn posts.",
          "score": 1,
          "created_utc": "2026-01-14 07:12:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzi4tv8",
          "author": "seth_willians0101",
          "text": "Totally fair pushback.  \nOn their own, most of these *are* weak signals.\n\nWhere they become actionable is when **multiple signals stack**:\n\n* same account\n* increasing frequency\n* moving closer to decision-stage content\n* appearing across roles\n\nAt that point, you’re not predicting intent - you’re **observing buying motion**.\n\nSales doesn’t need perfect certainty early.  \nThey need **better prioritization than random outreach**, and these patterns usually outperform first-touch form fills.\n\nQuiet ≠ low intent.  \nIt just means buyers are validating privately before engaging.",
          "score": 1,
          "created_utc": "2026-01-14 07:46:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzqbzp8",
          "author": "Excellent_Ranger4752",
          "text": "The signals I trust most are the ones that show a buyer is making internal tradeoffs.\n\nWhen someone starts looping in other stakeholders, referencing budget, or talking about how a change would affect their current process, that tells me the problem is real. Quiet research is common, but intent shows up when priorities and decisions start shifting.",
          "score": 1,
          "created_utc": "2026-01-15 14:16:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o03j1wu",
          "author": "New_Grape7181",
          "text": "I've found the strongest signals aren't the obvious ones like form fills. They're behaviors that suggest someone's actively solving a problem right now.  \n  \nThings like:  \n\\- Job postings for roles adjacent to what you sell  \n\\- Recent funding rounds (you can set alerts for this)  \n\\- Leadership changes, especially new VPs who want quick wins  \n\\- Company posting content about a problem you solve  \n  \nThe trick is catching them when they're in problem-awareness mode, not solution-shopping mode. That's when they're actually open to conversations.  \n  \nWe stopped waiting for inbound forms entirely and started reaching out based on these signals instead. The quality of conversations changed immediately because we were reaching people at the right time, not interrupting them.  \n  \nOne thing that really helped was layering signals. Like if a company just hired a Head of Sales AND posted about scaling challenges on LinkedIn, that's way stronger than either signal alone.  \n  \nHow are you identifying accounts right now, using intent data providers or building your own signal system?",
          "score": 1,
          "created_utc": "2026-01-17 12:56:23",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qedgag",
      "title": "Best Tech Content Marketing Agency for AI startup?",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qedgag/best_tech_content_marketing_agency_for_ai_startup/",
      "author": "SidLais351",
      "created_utc": "2026-01-16 11:23:14",
      "score": 6,
      "num_comments": 8,
      "upvote_ratio": 1.0,
      "text": "We are a bootstrapped AI startup looking for tech content marketing. We're looking to get started with blogs, tutorials, and guides for LLM tools and AI infra. Who can we connect with to help with this?",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qedgag/best_tech_content_marketing_agency_for_ai_startup/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "nzwhn8u",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-16 11:23:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzwiqu5",
          "author": "Practical_Tank8083",
          "text": "DM ME",
          "score": 1,
          "created_utc": "2026-01-16 11:32:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzwjq3l",
          "author": "algatesda",
          "text": "I can help you ,let’s connect",
          "score": 1,
          "created_utc": "2026-01-16 11:39:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzwp3l2",
          "author": "imnotafanofit",
          "text": "Whoever you hire, make them do a sample based on your product. It’s way easier to see if they actually understand your stack.",
          "score": 1,
          "created_utc": "2026-01-16 12:19:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzwuko4",
          "author": "cornelmanu",
          "text": "Are you looking for automated content, or high-quality AI-assisted content?",
          "score": 1,
          "created_utc": "2026-01-16 12:55:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzyjgq9",
          "author": "smarkman19",
          "text": "For an early-stage AI infra startup, I’d skip generic “AI marketing agencies” and look for 2 things: deep devtools background and founders-as-SMEs. I’ve had better luck with small shops like Animalz or Draft.dev than big agencies, plus vetted freelancers via Superpath or MarketerHire. \n\nWhatever you choose, run a 4–6 week pilot with clear goals: 3–5 bottom-of-funnel pieces (tutorials, benchmarks, integration guides) tied to signup or demo metrics, not just traffic. Also, tools like Ahrefs, Clearscope, and Pulse alongside something like Hootsuite can help you find real questions devs are asking and plug your content into those conversations on Reddit and elsewhere.",
          "score": 1,
          "created_utc": "2026-01-16 17:46:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o03ukkb",
          "author": "jellycessh",
          "text": "tech content marketing for AI is such a specific niche, you'll definitely want someone who gets the technical side. I've heard good things about Brandlight for this kind of work, they seem to focus on helping tech companies with content that actually resonates with technical audiences. From what I understand they work with startups on creating the kind of educational content you're talking about, like the tutorials and guides for developers.\n\nMight be worth reaching out to see if they're a good fit for your budget and timeline.",
          "score": 1,
          "created_utc": "2026-01-17 14:06:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0guyjn",
          "author": "Past-Signal8747",
          "text": "if you’re bootstrapped and focused on AI content, the real win isn’t just blogs and tutorials. its content that actually answers the questions your users are literally Googling right now.\n\nai startups have a weird rhythm ppl dont search “best ai product” they search things like “how to integrate LLM into workflow”, “reduce inference cost”, “ai monitoring best practices”, etc. the deeper you answer those exact problems, the more trust + leads you get.\n\ngood content marketing for tech isnt just publishing pieces, it’s publishing solutions that feel like answers people wrote themselves. that’s what brings organic demand and inbound leads.\n\nif you want leads and not just traffic, think in terms of:\n\n• problem first content (not feature first)\n\n• code + examples + open source snippets\n\n• tutorials that solve urgent pain\n\ncurious if you’ve already mapped the exact search problems you want to own?",
          "score": 1,
          "created_utc": "2026-01-19 12:52:34",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qeio3d",
      "title": "Anyone know about Meta closing down their B2B business globally?",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qeio3d/anyone_know_about_meta_closing_down_their_b2b/",
      "author": "DrHusband",
      "created_utc": "2026-01-16 15:16:45",
      "score": 5,
      "num_comments": 4,
      "upvote_ratio": 1.0,
      "text": "I have just been informed to halt work on all Meta B2B integrations as they are closing down this aspect of their business but have not seen anything publicly announced. Has anyone else heard anything?",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qeio3d/anyone_know_about_meta_closing_down_their_b2b/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "nzxlixn",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-16 15:16:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o02qzw2",
          "author": "Wise-Artichoke-3808",
          "text": "I also would be interested.",
          "score": 1,
          "created_utc": "2026-01-17 08:48:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o033enn",
          "author": "kubrador",
          "text": "i'd check their official newsroom/blog before panicking, sounds like internal gossip that hasn't hit the public yet. if it's actually happening they usually telegraph this stuff, so either the info is wrong or you're getting the news before everyone else.",
          "score": 1,
          "created_utc": "2026-01-17 10:45:54",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qg9t56",
      "title": "identify high-intent buyers",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qg9t56/identify_highintent_buyers/",
      "author": "colinbyprospectai",
      "created_utc": "2026-01-18 14:21:51",
      "score": 5,
      "num_comments": 7,
      "upvote_ratio": 1.0,
      "text": "How many times have you tried to scale your agency but got stuck wasting hours a day manually reaching out to people?\n\nWe are german based cold email partners, building and running the outbound side for you. With our deep research capabilities, we actually book around 30 - 40 meetings in the first few weeks.\n\nIk, very selly, but you need clients and we can deliver. LMK!",
      "is_original_content": false,
      "link_flair_text": "Support",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qg9t56/identify_highintent_buyers/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o0al9gt",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-18 14:21:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0aw375",
          "author": "kubrador",
          "text": "\"we book 30-40 meetings\" = you send 10,000 emails and 30-40 people don't immediately delete them. still sounds like a deal though",
          "score": 3,
          "created_utc": "2026-01-18 15:19:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0ctcys",
              "author": "colinbyprospectai",
              "text": "no, volume means nothing. usually the campaigns range from 100 - 600 prospects",
              "score": 1,
              "created_utc": "2026-01-18 20:48:29",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0chd7q",
          "author": "Lonely_Noyaaa",
          "text": "If you’re actually booking 30 to 40 meetings in a few weeks, the real differentiator would be how many of those turn into paying clients, not the meeting count",
          "score": 2,
          "created_utc": "2026-01-18 19:50:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0ctgre",
              "author": "colinbyprospectai",
              "text": "So we handle the lead gen up until the closing. When your offer is good and you know the business, then 60-70% can be closed due to the pre qualification.",
              "score": 2,
              "created_utc": "2026-01-18 20:49:02",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0e0qjb",
          "author": "Euphoric-View-9876",
          "text": "The real question isnt meetings vs volume, its where the list comes from. If youre only hitting 100–600 prospects and still booking that many calls, the edge is clearly upstream who you target, when, and why now. Most outbound breaks because teams confuse activity with signal.",
          "score": 1,
          "created_utc": "2026-01-19 00:31:01",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qeerya",
      "title": "I Put Together a Beginner’s Guide to SaaS Affiliate Marketing for B2B Teams",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qeerya/i_put_together_a_beginners_guide_to_saas/",
      "author": "Rewardful",
      "created_utc": "2026-01-16 12:34:06",
      "score": 5,
      "num_comments": 4,
      "upvote_ratio": 1.0,
      "text": "No intro needed, I’ll skip the fluff and go straight to what actually worked for us and for other B2B/SaaS teams I’ve seen do it well:\n\n# 1. Make sure you’re ready\n\nAffiliate programs amplify what’s already working. If you don’t have product–market fit, happy customers, or predictable conversions, affiliates won’t fix that. What they will do is bring you more of what’s already converting.\n\nRule of thumb: wait until you can confidently say, “If I drive 100 visitors to my site, X will become paying customers.”\n\n# 2. Decide on commission structure\n\nThis is where SaaS differs from e-commerce. Most SaaS affiliate programs use recurring commissions, because affiliates love predictable income streams.\n\n* Typical range: 20–30% of subscription revenue\n* Duration: 12–24 months (some even go lifetime if margins allow)\n* Hybrid model: one-time signup bonus + recurring percentage\n\nMake it attractive enough that affiliates feel long-term upside, but sustainable for you.\n\n# 3. Recruit the right affiliates\n\nThe biggest mistake I see is thinking affiliates equal influencers. In SaaS/B2B, the best partners are usually:\n\n* Agencies/consultants serving your ICP\n* Freelancers/contractors who recommend tools daily\n* Community leaders (Slack groups, LinkedIn, Reddit mods)\n* Content creators who write reviews, tutorials, or comparison posts\n\nStart with people who already trust your brand or work with your customers.\n\n# 4. Onboard and activate them\n\nSigning someone up isn’t enough. Affiliates succeed when you make promotion frictionless. That means:\n\n* Clear onboarding (walkthrough of your product and program basics)\n* Access to promo resources (banners, swipe copy, FAQs, case studies)\n* Education (what messaging works best, who your ICP is)\n* A point of contact for questions (affiliates love human support)\n\n# 5. Track properly\n\nNothing kills a program faster than bad tracking. Affiliates need to trust that you’ll track their referrals accurately and pay them fairly.\n\n# 6. Start small and then scale (don't rush!)\n\nStart with a hand-picked group of affiliates. Work closely with them, optimize messaging, fix tracking issues, and learn what converts.\n\nOnce you’ve nailed these, you can scale recruitment with:\n\n* Affiliate directories\n* Outreach campaigns\n* Community partnerships\n* Even running paid ads to “recruit affiliates”\n\nIn a nutshell you need to remember that affiliate marketing in SaaS isn't just about sharing links. It takes time and effort so you need to know this before kicking it off.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qeerya/i_put_together_a_beginners_guide_to_saas/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "nzwr9e5",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-16 12:34:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzwti9m",
          "author": "macromind",
          "text": "Solid guide, especially the point about affiliates amplifying what already converts. One thing that helped us was treating onboarding like a mini enablement kit (positioning, 2-3 best use cases, and a couple ready-to-share comparison angles) so partners do not default to generic promo. If you are collecting more SaaS marketing playbooks and teardown-style examples, you might like https://www.reddit.com/r/Promarkia/ too, a bunch of folks there share what is working week to week.",
          "score": 1,
          "created_utc": "2026-01-16 12:48:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzwzqcw",
              "author": "Rewardful",
              "text": "That's a great tip about onboarding! Did you build a library or sharing these assets via email?",
              "score": 1,
              "created_utc": "2026-01-16 13:25:58",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qg4uzd",
      "title": "Launching a B2B Product in 2026: Is LinkedIn Still the Right Channel?",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qg4uzd/launching_a_b2b_product_in_2026_is_linkedin_still/",
      "author": "kevinbaur",
      "created_utc": "2026-01-18 10:04:19",
      "score": 5,
      "num_comments": 31,
      "upvote_ratio": 0.78,
      "text": "Hi,\n\nover the past six months, I have developed a product that I now want to bring to market. It is a B2B tool designed to preserve operational and project knowledge when an employee leaves the company. Through my network, I already have several companies testing the product and providing feedback. However, my goal is to be successful internationally, as I believe this could be a valuable solution for many organizations. That said, I have read (including in this subreddit) that LinkedIn is increasingly filled with bots, bots that create posts and other bots that comment on them...\n\nGiven this, does it even make sense in 2026 to try to build reach on the platform?\n\nAdditionally, in my situation, what would work better: posting from my personal profile (around 80 followers) or building reach from a brand-new company profile?\n\nThank you in advance for any responses.",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qg4uzd/launching_a_b2b_product_in_2026_is_linkedin_still/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o09njye",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-18 10:04:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o09zsup",
          "author": "astillero",
          "text": "I think you're overestimating LinkedIn. Like you, I used to think, that LinkedIn was this massive international melting pot online. Unfortunately, it's not like that. \n\nMore and more on LInkedin, you've got groups of cliques slapping each others backs and soothing each others egos hanging by the virtual watercooler. For the most part, their main goal seems to be building awareness of their own products and services. And it, just like networking in real-life, it's the same heads all the time. This wears very thin after a while. \n\nThe actual \"do-ers\" on the other don't seem to be continually LinkedIn. They're probably too busy doing the actual work. And, for your IP / data protection tool, these are the people you need to target.\n\nSo, maybe the best route for you here could be using webinars, inbound content or events targeting personas such as CISO / Systems Administrators / IT Managers / Compliance Managers, MSSPs and in-house Data Protection officers.  A cold-outreach strategy should also be considered but bear in mind that cohorts like system administrators and IT manager can be very averse, even hostile, to cold outreach so you might want to keep this strategy limited to other personas mentioned above.",
          "score": 3,
          "created_utc": "2026-01-18 11:54:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0a4ia2",
              "author": "kevinbaur",
              "text": "I think you’re probably right, and I’ve had similar thoughts myself. The people who would actually make this decision, especially founders or CEOs in smaller companies, are likely too busy to spend much time on LinkedIn. On top of that, the product is usually only searched for when the problem becomes urgent. It’s not something most people proactively look for months in advance just because they saw a post or a campaign. That definitely makes it harder to market, especially while the category itself is still relatively unknown.",
              "score": 1,
              "created_utc": "2026-01-18 12:33:04",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0ejs3c",
                  "author": "Responsible-Brick881",
                  "text": "I wouldn't complete right it off, but equally I wouldn't be going all in on it. What I've seen as someone who started posting regularly since December in advance of launching my b2b business at the start of Jan. Baring in mind I had about 3500 connections having been on their for about 12 years but never really posted that much before.\n\nI post 3 times per week:\nMonday; Build in public weekly update\nThen 2 other posts during the week that are an observation, or sharing my thoughts on how I look at things in my industry (adtech) that are related to how im doing things in my company. Not pitching. \nI probably spend about 30 mins making the content each week - but I have opened some great opportunities with people i wohldnt have without it.\n\nDon't post from the business page if you do it - post from your personal page as you'll get more traction.\n\nUltimately though, if youre looking to scale internationally you'll likely need outside help - but need to be smart about. \n\nFor context, I'm from Ireland and mainly focusing on the US. I've brought in outside help to scale quickly.\n\nAlways happy to share notes and chat so feel free to drop me a message if ya like. Not looking to sell you anything!!",
                  "score": 2,
                  "created_utc": "2026-01-19 02:15:35",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0aipjz",
          "author": "signalpath_mapper",
          "text": "From an operator side, reach matters less than signal. LinkedIn is noisy, but the right people still read posts that are specific and grounded in real problems. Broad thought leadership gets eaten by bots, but concrete \"here’s what broke, here’s what fixed it\" posts still cut through. Personal profiles usually work better early, even with a small following, because they feel real and get engagement faster than empty company pages. The biggest mistake I see is trying to scale reach before messaging is tight. If your testers are giving you real stories and outcomes, start there and see what actually gets responses before worrying about platform saturation.",
          "score": 3,
          "created_utc": "2026-01-18 14:07:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o09x1hx",
          "author": "Kindly_Watercress416",
          "text": "LinkedIn is fine. Use your personal profile, it’s way more alive/engaging than a faceless company page.\n\nAbout Reddit: it’s survivorship bias in reverse :) People come here with worries and problems to solve, while lots of people are doing great and never post.\n\nI used to read the Facebook Ads and Cold email subreddits - and it felt like nothing ever works. Like nothing at all.\nMeanwhile, you see projects IRL that are clearly successful",
          "score": 2,
          "created_utc": "2026-01-18 11:30:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0a3qn0",
              "author": "kevinbaur",
              "text": "Thank you for your reply. I was thinking the same about using my personal profile, especially since I already have around 70 followers from my previous role, so at least there is some starting point. \n\nReddit is pretty tough for me, I hadn’t really used it before and it feels hard to figure out how to get attention, what actually makes a good post and which subreddits are worth spending time in. \n\nI also tried ads before, Google Ads specifically, but that didn’t work well at all because people are not really searching for the problem the way my product solves it. Most searches are around offboarding topics or checklists, not for a more complete solution like the one I am building.",
              "score": 2,
              "created_utc": "2026-01-18 12:26:58",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0a0lrh",
          "author": "kunalkhatri12",
          "text": "u/kevinbaur LinkedIn still works if you treat it like a research channel, not a broadcast one.  \npost from your personal profile about real situations you see during pilots(knowledge loss moments, handover failures and FIXES) then turn the comments and DMs into product and SEO language.  \nBots don't buy b2b tools, humans do, and they still lurk on personal posts that sound specific, unpolishd and experience driven",
          "score": 2,
          "created_utc": "2026-01-18 12:01:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0eo2z5",
          "author": "DaCmanLou",
          "text": "Your product sounds like a great idea. Absolutely post on LinkedIn under your personal account. Personal accounts do much better than company pages. Don't worry about the bots. If there's an audience for your product there's 1.3 billion people on LinkedIn. They'll find you.",
          "score": 2,
          "created_utc": "2026-01-19 02:38:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0f3mdk",
          "author": "Slight_Tutor1790",
          "text": "Something I do not see mentioned much is that LinkedIn can be useful even if it never drives scale. It works well as a feedback surface where you test language and framing in public. If a short post about a specific handover failure gets saves or quiet DMs from operators, that is a strong signal you are describing the problem in the right way. You can then reuse that exact wording for landing pages, SEO, or outreach. In that sense the value is not reach, it is message clarity before you invest heavily elsewhere.",
          "score": 2,
          "created_utc": "2026-01-19 04:07:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o09sdvf",
          "author": "JunaidRaza648",
          "text": "It looks like a great product.\n\nWhat are your goals for 2026? The channel depends on your goals and targets.",
          "score": 1,
          "created_utc": "2026-01-18 10:48:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o09vyol",
              "author": "kevinbaur",
              "text": "Thank you.\n\nFor 2026, my main goal is to build steady organic traction rather than rapid scale. I want to generate some consistent traffic to the website, attract early users, and start establishing visibility so that when people search for solutions in this area, they can find my product.\n\nI am not aiming for massive user numbers at this stage. Instead, the focus is on gathering high-quality feedback, iterating on the product, and improving it as much as possible. The priority is to ensure that the users who adopt it are genuinely satisfied and that I can confidently say I am building a strong, valuable product.",
              "score": 3,
              "created_utc": "2026-01-18 11:21:02",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o09xoky",
                  "author": "JunaidRaza648",
                  "text": "Then I would recommend highly targeted campaigns with SEO (bottom funnel) and personalized cold outreach.",
                  "score": 1,
                  "created_utc": "2026-01-18 11:36:22",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0aoj4m",
          "author": "Top_Friend_6248",
          "text": "I sell on LinkedIn, but first I need to build trust.",
          "score": 1,
          "created_utc": "2026-01-18 14:39:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0cr10q",
          "author": "AdamYamada",
          "text": "People use LI because they feel they have to. \n\nNot because they want to.",
          "score": 1,
          "created_utc": "2026-01-18 20:37:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0djpol",
          "author": "cornelmanu",
          "text": "A personal profile works better on LI, I grew from 600 to 1200+ in 4 months. Let's have a chat and I can give you some pointers!",
          "score": 1,
          "created_utc": "2026-01-18 23:02:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0dweia",
          "author": "OkCardiologist1426",
          "text": "LinkedIn has some reach but people buy from people they trust in LinkedIn. For B2B you need multiple channels to reach the right audience.",
          "score": 1,
          "created_utc": "2026-01-19 00:07:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0dydog",
          "author": "Euphoric-View-9876",
          "text": "LinkedIn still works, just not as a broadcast channel. Personal profiles outperform company pages early, even with small followings, because trust travels through people. The real value now is watching who reacts to specific problems (offboarding chaos, knowledge loss, compliance gaps) and engaging there, not trying to win the feed. Treat it as a signal + conversation layer, not a reach game.",
          "score": 1,
          "created_utc": "2026-01-19 00:18:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0e05tm",
          "author": "DIGITIFYU",
          "text": "Hey I am using LinkedIn profile of mine and using little bit of automation which helped me book 5 appointments with in 15 days of my ICP\nTo achieve that atleast you reach 1K followers so that LI policy wil not ban you",
          "score": 1,
          "created_utc": "2026-01-19 00:27:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0exuwp",
          "author": "ramen-AI-SDR",
          "text": "It works really well if you have your target market down.",
          "score": 1,
          "created_utc": "2026-01-19 03:31:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0f5u2k",
          "author": "marketermarisa",
          "text": "LinkedIn would be your primary social channel, but it’s only one part of a comprehensive launch strategy.",
          "score": 1,
          "created_utc": "2026-01-19 04:22:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0g9pd3",
          "author": "UpperLifeguard8284",
          "text": "First of all, I think that's a great product that you're building. KT can be really tedious if I got your product right. I think you should spend some time on linkedin to build your own profile not companies. Individual profiles do better. Even 15-30 mins 3 days a week should be good. It will help you in the future.",
          "score": 1,
          "created_utc": "2026-01-19 09:54:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0garwt",
          "author": "parthoasis",
          "text": "Company profiles dont work so well. Focus on personal brands, its all that linkedin is pushing at this stage.\n\nI run a linkedin lead gen firm so here are my thoughts: make sure you get your elevators pitches straight.\n\nWith lower attention spans, you will need to get to the point faster and more creatively.\n\nLinkedIn is great for qualification and striking conversations. Build it from there to conversion needs more work.",
          "score": 1,
          "created_utc": "2026-01-19 10:04:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0gayym",
          "author": "tzarhirovito",
          "text": "I do believe that LinkedIn can still be useful, especially for visibility in B2B which still does matter, posting from your personal profile often works better at first, even with a smaller audience, because it feels more human and people engage with actual founders rather than brand pages. Sharing thoughtful posts about your product and insights from your testing can help spread awareness. You could also explore targeted outreach if it aligns with your business goals, since reaching the right decision-makers directly often still pays off in B2B, I had a positive experience with it",
          "score": 1,
          "created_utc": "2026-01-19 10:06:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0gp73r",
          "author": "svlease0h1",
          "text": "linkedin still works, just not the way blogs say it does. posting alone is quiet, commenting with specifics gets replies. personal profiles beat empty company pages early, even with tiny follower counts.",
          "score": 1,
          "created_utc": "2026-01-19 12:10:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0h4jfq",
          "author": "Sudden-Context-4719",
          "text": "LinkedIn is still useful but yeah, bots are everywhere now so organic reach is tough. If you only have 80 followers, start with your personal profile to build some real connections before trying a company page. Focus on genuine posts and comments to cut through the noise.",
          "score": 1,
          "created_utc": "2026-01-19 13:51:41",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qfcp0t",
      "title": "The 80/20 of e-commerce advertising (what actually matters)",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qfcp0t/the_8020_of_ecommerce_advertising_what_actually/",
      "author": "Wide-Tap-8886",
      "created_utc": "2026-01-17 13:03:28",
      "score": 5,
      "num_comments": 7,
      "upvote_ratio": 1.0,
      "text": "After 2 years and $60k in ad spend, here's what actually moves the needle:\n\n  \n**20% of efforts that drive 80% of results:**\n\n1. **Testing creative volume** (biggest impact)\n   * More creative = more winners\n   * I went from 5 tests/month to 50 tests/month\n   * Revenue increased 3x\n\n\n\n1. **Killing losers fast** (second biggest)\n   * If CTR < 2% after $50 spend → kill it\n   * Don't let losers eat budget\n   * Most of my budget waste was being too patient\n\n\n\n1. **Scaling winners aggressively** (third)\n   * If CTR > 3.5%, scale fast\n   * I used to be too conservative\n   * Winners don't last forever, scale while they work\n\n\n\n**80% of efforts that drive 20% of results:**\n\n* Perfect targeting (broad works fine)\n* Fancy landing pages (basic Shopify theme is enough)\n* Email sequences (nice to have, not critical)\n* Influencer partnerships (expensive, unpredictable)\n* SEO (too slow for paid traffic businesses)\n\n\n\n**My focus now:**\n\n90% of my time: Creating and testing more creative 10% of my time: Everything else\n\nRevenue went from $8k/month to $25k/month by focusing on the 20%.\n\nStop majoring in minor things, and start feed Meta with AI UGC",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qfcp0t/the_8020_of_ecommerce_advertising_what_actually/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o03k27h",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-17 13:03:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o03xk9j",
          "author": "shiftwithai",
          "text": "What do you use for creating ugc?",
          "score": 1,
          "created_utc": "2026-01-17 14:23:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0612m2",
          "author": "Kabeerymalik",
          "text": "Its alway addrun n seo...",
          "score": 1,
          "created_utc": "2026-01-17 20:26:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o086lac",
          "author": "kubrador",
          "text": "guy really said \"i made money by trying more things\" and wrapped it in pareto principle like he discovered cold fusion. the $60k tuition to learn that volume beats perfection is expensive but at least he's honest about it.",
          "score": 1,
          "created_utc": "2026-01-18 03:11:07",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}