{
  "metadata": {
    "last_updated": "2026-02-10 09:20:00",
    "time_filter": "week",
    "subreddit": "b2bmarketing",
    "total_items": 20,
    "total_comments": 242,
    "file_size_bytes": 227845
  },
  "items": [
    {
      "id": "1r0b4sj",
      "title": "Anyone here actively using Reddit for lead gen?",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1r0b4sj/anyone_here_actively_using_reddit_for_lead_gen/",
      "author": "Only_Egg_6976",
      "created_utc": "2026-02-09 17:51:53",
      "score": 45,
      "num_comments": 20,
      "upvote_ratio": 0.83,
      "text": "Not talking about blasting links or DM spam, but actually picking up real leads from comments or threads where people already have a problem. Fairly new at this, seen a few options like F5bot, Syften etc but never used anything  like that. If you are doing this successfully, I’d love to hear what’s working for you.",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1r0b4sj/anyone_here_actively_using_reddit_for_lead_gen/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o4gwqi1",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-09 17:51:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4hcb4i",
          "author": "No_Hedgehog8091",
          "text": "Yes, been doing this for years actually.\n\n  \nThe tools you mentioned work fine for keyword alerts, but the real game is in your response quality. Most people blow it by being too eager or too vague.\n\n  \nWhat works: answer the actual question first, show you understand their specific situation, then let curiosity do the rest. Your profile does the selling, not your comment.\n\n  \nBiggest mistake I see? People responding to every alert instead of picking threads where they genuinely have something useful to add.",
          "score": 9,
          "created_utc": "2026-02-09 19:04:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4hzkk7",
              "author": "TaxNearby9307",
              "text": "For automating the discovery of conversations where you can genuinely add value, I use Leadmatically. It handles the continuous monitoring across subreddits, so I can focus entirely on crafting those helpful, contextual replies you mentioned",
              "score": 1,
              "created_utc": "2026-02-09 20:59:28",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o4k8d34",
              "author": "CCMALLC",
              "text": "🧨 Explosive resonse...well expressed! SERVE INSTEAD OF SELLING",
              "score": 1,
              "created_utc": "2026-02-10 04:36:57",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4hwtm1",
          "author": "Extra-Pomegranate-50",
          "text": "been doing this manually for a few weeks now in the email deliverability niche. no tools, no bots — just searching for posts where people describe problems my service solves and dropping genuine technical advice in the comments.\n\nwhat actually works: answer the question properly first. if someone asks why their emails land in spam, i explain the technical reason (SPF/DKIM/DMARC misconfiguration, blacklists, etc). no pitch, no link. just help.\n\nwhat happens: people DM you, save your comments, and check your profile. the ones who need more help reach out naturally. ive had threads where the OP came back 3-4 times with follow-up questions.\n\nthe key is picking posts where you can add something the other commenters havent said. if everyone already covered the answer, skip it. if theres a technical gap nobody mentioned, thats your opening.\n\nits slow but the lead quality is way higher than any automated tool because youre only talking to people who already have the exact problem you solve.",
          "score": 5,
          "created_utc": "2026-02-09 20:46:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4i07ne",
          "author": "phillcivi_1286",
          "text": "Our team have tested these and other tools before, but honestly, the old school way of manually monitoring reddit subthreads has been the best method so far for us.   \n  \nWe had trouble getting programs to understand the nuance of what we were looking for and felt like we were spending just as much time, if not more, going through their \"results\" than perusing the subreddits ourselves looking for areas we could provide genuine feedback/tips.\n\nSince Reddit can be a rabbit hole that's hard to crawl out of, we're testing having interns or entry-level marketing/sales employees spend an hour or so a few times a week looking at threads and sharing posts we could engage with in a dedicated slack channel. Then our subject experts review and jump in where they feel is most appropriate and helpful.\n\nIt's only been a month or so of this practice but this rhythm feels good for our team and helps us participate in a more true-to-Reddit way. \n\nAnd I'll second what other commenters have shared: focusing on quality of comments over quantity. It is evident which comments are posted just to catch fish vs which are shared out of true helpfulness, and Redditors respond accordingly. \n\n",
          "score": 3,
          "created_utc": "2026-02-09 21:02:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4kah8b",
              "author": "CCMALLC",
              "text": "Tried and tested and true",
              "score": 1,
              "created_utc": "2026-02-10 04:51:52",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4hfdoh",
          "author": "DudeWaitWut",
          "text": "Yes, the biggest things are publishing consistently, providing real value, and not overly promoting your product. I would say 95/5 (95% just answers questions or provide helpful responses, 5% actually mentioning your product). Maybe 90/10. But if you overdoit, people notice. You'll get flagged, moderated, removed, banned, etc. Or, people will just have a low opinion of you and your product.\n\nThere are a ton of tools in this space now. I see a new one pop up every week. Most miss the point, and lack features that actually help you find relevant mentions. F5bot is okay. It's really bare bones. Same with Syften. They don't really have advanced features for contextual keyword filtering, negative keywords, keyword types, subreddit-specific monitoring, etc. They're okay if you're just starting up but not something I'd recommend for a more advanced Reddit campaign.\n\nI'd also agree with the other person here. Pick your battles. Don't just spam every post. Pick ones where you can provide actual value.",
          "score": 1,
          "created_utc": "2026-02-09 19:19:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4hv6r8",
          "author": "Accomplished_Echo376",
          "text": "How *you* doin?",
          "score": 1,
          "created_utc": "2026-02-09 20:37:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4hzcb4",
          "author": "NecessarySoftware569",
          "text": "Yes , I've been doing it , been using a tool that can find and reach out to leads through various social platforms ( Reddit included) , its been a game changer.",
          "score": 1,
          "created_utc": "2026-02-09 20:58:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4icyti",
              "author": "Open-Papaya-2703",
              "text": "Mind sharing the tools name?",
              "score": 1,
              "created_utc": "2026-02-09 22:06:21",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4if2z9",
                  "author": "NecessarySoftware569",
                  "text": "Would love to ! Dm me",
                  "score": 2,
                  "created_utc": "2026-02-09 22:17:12",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4hzw7k",
          "author": "Kindly_Watercress416",
          "text": "I found a couple of clients this way. Not the best quality lol, but still okay.\nAlso, I found a lot of services for myself, so it worked for them I guess",
          "score": 1,
          "created_utc": "2026-02-09 21:01:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4i8ktf",
          "author": "unicorn69love",
          "text": "ive been testing reddbot for reddit lead gen in b2b saas handles the 24/7 monitoring and spits out decent comment drafts way better than manual hunts or basic alerts like f5bot. still gotta edit em to nail that genuine vibe tho, or it flops hard. saves tons of time if youre scaling multiple niches",
          "score": 1,
          "created_utc": "2026-02-09 21:44:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4i9ei5",
          "author": "erickrealz",
          "text": "Reddit lead gen works but only if you're genuinely helpful first. Set up keyword alerts for your niche problems and show up with real answers. The lead comes naturally when people check your profile or ask for more help.\n\nThe moment you start dropping links or pitching in comments you'll get downvoted to hell and banned. Patience is everything here. Think of it as planting seeds, not harvesting. Some of my best clients came from Reddit comments I forgot I even wrote.",
          "score": 1,
          "created_utc": "2026-02-09 21:48:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4j97m4",
          "author": "addictedtosoda",
          "text": "I just signed up for leadverse",
          "score": 1,
          "created_utc": "2026-02-10 01:01:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4k2tt4",
          "author": "New_Grape7181",
          "text": "I've been doing this for about 6 months now and it's surprisingly effective when done right.  \n  \nI use a mix of manual browsing and keyword alerts. The manual part matters more than people think because you catch context that tools miss. I spend 20 mins each morning scanning relevant subreddits where my audience hangs out.  \n  \nFor alerts, I tried F5bot but found it too noisy. Switched to a combination of Google Alerts with specific Reddit operators and just setting up custom feeds in my Reddit app for key terms. Nothing fancy, but it works.  \n  \nThe key thing I learned is timing and tone. If someone posted 2 days ago, they've likely moved on or already found a solution. I try to catch threads within the first few hours. And I focus on being genuinely helpful rather than pitching. Most of my comments don't mention my company at all, I'm just sharing what's worked from experience.  \n  \nLeads come indirectly. People check your profile, see your post history, and reach out if they're interested. I probably get 3-4 genuine conversations a month that turn into calls.  \n  \nWhat subreddits are you thinking of targeting?",
          "score": 1,
          "created_utc": "2026-02-10 03:59:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4k39qf",
          "author": "Hereemideem1a",
          "text": "Yes, but it’s slow and very manual. The only times it works for me are when I reply early to very specific problem posts with genuinely helpful context and no pitch.",
          "score": 1,
          "created_utc": "2026-02-10 04:02:04",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1quokic",
      "title": "I sent 217,000 cold emails in 2025. Here's why I switched to LinkedIn social listening and the results so far",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1quokic/i_sent_217000_cold_emails_in_2025_heres_why_i/",
      "author": "Soft-Dragonfruit6447",
      "created_utc": "2026-02-03 10:34:45",
      "score": 44,
      "num_comments": 24,
      "upvote_ratio": 0.9,
      "text": "Started noticing deliverability fatigue around email 150K. Reply rates dropped from 2.1% to 0.7%. Domains were getting burned faster than I could warm new ones.\n\nThe breaking point: spending more time managing infrastructure (SPF records, inbox rotation, warmup sequences) than actually talking to prospects.\n\nWhat I switched to:\n\nInstead of blasting cold emails, I started tracking buying signals on LinkedIn. When someone posts about their pain point or mentions a competitor, I engage there first. Warm intro before any DM or email.\n\nResults after 90 days:\n\n* Reply rate: 12% (vs 0.7% with cold email)\n* Meetings booked: 34 (vs 8-12/month with email)\n* Time spent on infrastructure: basically zero\n\nStack I'm using:\n\n* OutX to track keywords + competitors on LinkedIn automatically\n* Sales Navigator for additional research\n* Clay for data enrichment and list building\n* Apollo for contact verification and backup outreach\n* Instantly for the few cold emails I still send (way less volume now)\n* Notion to track conversations and buying signals\n* ChatGPT to help personalize responses at scale\n\nThe tradeoff: this doesn't scale to 1000+ touches/day like cold email. But I'd rather have 50 warm convos than 500 cold bounces.\n\nAnyone else making this shift or am I crazy for ditching cold email volume?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1quokic/i_sent_217000_cold_emails_in_2025_heres_why_i/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o3bj3ue",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-03 10:34:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3brzft",
          "author": "InnerBuilding7949",
          "text": "How u can find people posting about their pain points and their competitors?",
          "score": 3,
          "created_utc": "2026-02-03 11:50:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3j0v0l",
              "author": "raccoonsleepy712",
              "text": "same question",
              "score": 1,
              "created_utc": "2026-02-04 13:40:53",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3enxxi",
          "author": "CodSpiritual8618",
          "text": "Please die. As early as possible.\n\nI report 10-20 guys like you each day. Low effort no outcome.",
          "score": 3,
          "created_utc": "2026-02-03 20:36:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3g53w3",
              "author": "therealtricklowe",
              "text": "Just curious, what would you report these people for?",
              "score": 0,
              "created_utc": "2026-02-04 01:05:52",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3ghaz0",
          "author": "and-so-what-78",
          "text": "217k is a lot, that only means there's something wrong with your cold email system. I sent 2 cold emails in a week, both prospects responded and of them turned into a closed deal. That's how you do cold email the right way. Quality over quantity",
          "score": 3,
          "created_utc": "2026-02-04 02:14:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3e0qqg",
          "author": "Recent_Lab_5442",
          "text": "Is no one seeing that this is a promo for OutX? 🙄",
          "score": 5,
          "created_utc": "2026-02-03 18:48:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3g71bt",
              "author": "benclarkereddit",
              "text": "They’re all bots or as good as bots",
              "score": 0,
              "created_utc": "2026-02-04 01:16:43",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3bq93k",
          "author": "KissyyyDoll",
          "text": "Not crazy at all. Cold email at scale feels pretty broken right now",
          "score": 1,
          "created_utc": "2026-02-03 11:37:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3cnk5r",
          "author": "ecom-strategist",
          "text": "Looks interesting, worth trying",
          "score": 1,
          "created_utc": "2026-02-03 14:59:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3cuvzb",
          "author": "Majestic_Hornet_4194",
          "text": "Sounds like a smart move to me. Cold email volume burns out fast and LinkedIn signals are way more targeted",
          "score": 1,
          "created_utc": "2026-02-03 15:35:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3cxogf",
          "author": "Public_Quiet_3624",
          "text": "Great man. Cold emails and linkedin are enough to find clients. Even I help people in finding emails and linkedin id. I've currently got like 320 thousand emails and linkedins",
          "score": 1,
          "created_utc": "2026-02-03 15:48:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3dabks",
          "author": "OverAgentRoger",
          "text": "Make sense.\n\nSpend $100 a month. Reach out to leads.\n\nAlso, Google is burning \"spam emails\" so you have to be more careful now.",
          "score": 1,
          "created_utc": "2026-02-03 16:47:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3g4z2i",
          "author": "therealtricklowe",
          "text": "I'd love to get to know a little more about this strategy.\n\nI use a couple automated tools for cold outreach, but I know I'm really not using email as well as I could be. ",
          "score": 1,
          "created_utc": "2026-02-04 01:05:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3nvle2",
              "author": "and-so-what-78",
              "text": "You can DM me. My SDR just brought in a lead who bought a $200k USD course for a whale client through cold calling. We also do cold emails but for high tickets, we're seeing great results with cold calls esp if you're targeting whales.",
              "score": 1,
              "created_utc": "2026-02-05 04:33:42",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3utmxe",
          "author": "New_Grape7181",
          "text": "I made a similar shift last year after burning through domains way too fast. The infrastructure management becomes a full-time job.  \n  \nOne thing I'd add to your approach is using video messages after you've engaged on their post. So you comment on their LinkedIn content, wait a day or two, then send a short personalised video referencing what they posted about. I've found it bridges that gap between \"random commenter\" and \"actual conversation\" really well.  \n  \nThe combination of social listening plus video has been way more effective than either alone. Someone already knows who you are from the comment, and the video feels like a natural follow-up rather than cold outreach.  \n  \nYour 12% reply rate is solid. I'm curious though, are you finding certain types of posts convert better than others? Like are pain point posts getting you better responses than announcement posts?",
          "score": 1,
          "created_utc": "2026-02-06 05:54:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3vtqba",
          "author": "_forgotmyownname",
          "text": "This is a massive shift, but it makes total sense given how aggressive spam filters have become lately. 217k emails is a huge volume, and seeing your reply rate drop to 0.7% is a clear signal that the \"spray and pray\" era is dying. Moving toward social listening might be slower, but a 12% reply rate is incredible. It’s better to be a sniper than a machine gunner when everyone has their shields up.",
          "score": 1,
          "created_utc": "2026-02-06 11:21:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3wzf4f",
          "author": "minipouceRAP",
          "text": "You should check buska (to do same as LinkedIn but for all social networks man)",
          "score": 1,
          "created_utc": "2026-02-06 15:28:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3zdej3",
          "author": "Extra-Pomegranate-50",
          "text": "the infrastructure fatigue is so real. ive seen this pattern a lot - people scale cold email, the DNS management becomes a full time job, and the actual selling takes a back seat\n\none thing tho - a lot of that SPF/inbox rotation pain comes from the authentication not being set up right from the start. if each domains got clean SPF (under 10 lookups), DKIM signing with the actual sending domain, and DMARC on at least quarantine, domains last way longer before burning. most people skip this or let thier tools auto-configure it which usually means its half broken\n\nyour shift to warm outreach makes total sense tho. \"50 warm convos vs 500 cold bounces\" is the best summary of this ive seen. cold email still works but only when the foundation is solid, and at 217k volume thats a lot of foundation to maintain",
          "score": 1,
          "created_utc": "2026-02-06 22:25:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o40ahj0",
          "author": "Interesting-Wheel350",
          "text": "Silly question but are all those cold contacts your ICP? Nowadays it’s super tough to gain trust, what I’ve started doing is something I’ve coined called Credibility Engineering, my work involves PR outreach to some degree but I usually align an opportunity with a prospect to get a piece of coverage in exchange for a testimonial and I usually align a conversation off the back of that. It’s a bit more effort but with my offer I need to have leads warm and show them proof of concept so they’re already somewhat intrigued as my offer is quite pricey",
          "score": 1,
          "created_utc": "2026-02-07 01:35:24",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qydpe3",
      "title": "I cold emailed 500,000 business owners.",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qydpe3/i_cold_emailed_500000_business_owners/",
      "author": "Glass-Ad3933",
      "created_utc": "2026-02-07 13:23:48",
      "score": 41,
      "num_comments": 16,
      "upvote_ratio": 0.93,
      "text": "I run lead gen mostly through cold email, boring b2b stuff like lending, transportation, manufacturing, insurance, and marketing agencies. Over the last few months we pushed just over **500,000 emails** to business owners and execs and I want to share what *really* happened, not twitter math or tool affiliate takes.\n\nFirst thing people get wrong is thinking volume fixes bad targeting. It doesn’t. We split those 500k across very specific slices. For lending we only emailed owners doing 1M–25M rev, mostly service businesses, titles like owner, founder, managing partner. For transportation we avoided owner operators completely and only went after fleet owners with at least 10 trucks. Manufacturing was plant managers + ops directors, not CEOs. Insurance was agency owners only, never brokers. Marketing was founders who already had 3–10 clients and were hiring.\n\nSame inboxes, same infra, different outcomes.\n\nOverall numbers across all verticals  \nOpen rate hovered around low 40s most weeks, sometimes dipped to high 30s when a domain got tired.  \nReply rate averaged **3.6–3.9 percent** depending on the vertical.  \n“Interested” replies ended up roughly **1 per 250–300 emails**, which sounds low until you realize that’s normal if you’re not lying to yourself.\n\nSome specifics that surprised me.\n\n**Lending**  \nThis was the weirdest one. Lowest reply rate overall, but the *fastest* replies. If someone was interested they replied within 12 hours, usually short messages like “how much” or “send details”. Long emails here killed performance. Anything over 65 words dropped replies hard. Also a trick people don’t mention: subject lines that looked internal worked better than curiosity. Think “RE: review for {{company}}” not “quick question”.\n\n**Transportation**  \nMost sensitive to sender reputation. One bad domain and it nukes the whole batch. Also these guys read emails on phones at 5–6am. We tested send times heavily and early mornings crushed afternoons. A line like “saw you’re running routes out of Dallas” beat any fancy personalization. Fake hyper personalization got ignored instantly.\n\n**Manufacturing**  \nLowest opens, highest quality replies. These people don’t reply unless it’s real. We once sent a batch with a small data mistake in employee count and replies literally called it out. But when it hit, it hit hard. One email sequence here generated 11 demos from 2,800 sends which is insane for manufacturing. Key thing nobody says: they hate marketing language, even soft marketing. Write like an engineer, not a sales rep.\n\n**Insurance**  \nThis one shocked me. Agency owners reply a lot but half of it is negative if you’re sloppy. We learned to put a soft exit line like “if this isn’t relevant just say no and I’ll close the loop”. That single sentence reduced angry replies by more than half and didn’t hurt positive replies at all. Also never email them on Mondays. Just don’t.\n\n**Marketing agencies**  \nHighest reply rate, lowest close rate. Tons of “sounds interesting” ghosts. You need to qualify in the first reply or you’ll waste your life. Asking one blunt question like “how are you getting clients right now” filtered serious people fast. Also founders respond more to slightly messy emails, perfect grammar actually hurt us here.\n\nUnknown stuff people never mention.\n\nEmail verification isn’t binary. “Valid” emails still bounce differently depending on provider. Google accepts garbage longer than Outlook. Outlook punishes patterns faster.  \nRotating inboxes isn’t enough, you need to rotate *intent*. Same offer phrased slightly differently kept domains alive longer.  \nFollow ups matter less than people think. Email 1 + Email 2 drove almost all results. Email 4 and 5 mostly just create spam complaints.  \nYour CRM tagging matters. We tagged replies by tone and used that to rewrite copy. Polite no’s teach you more than yes’s.\n\nBiggest takeaway after 500k sends: cold email still works, but only if you treat it like operations not hacks. Most people fail because they copy scripts without copying the thinking behind them.\n\nNot selling anything here, just sharing numbers because I wish someone did this before I burned a few domains learning it the hard way. If you’re doing cold email at scale I’m curious what vertical surprised you the most.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qydpe3/i_cold_emailed_500000_business_owners/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o42qqh6",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-07 13:23:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o43sbg2",
          "author": "SAAS-Agency",
          "text": "Thanks for sharing.  \n  \nCan you go into more detail about what your list building process was like?\n\nP.S. subjects like RE: review for {{company}}” not “quick question are not can spam compliant.\n\n",
          "score": 7,
          "created_utc": "2026-02-07 16:44:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o462nnq",
          "author": "Giujus",
          "text": "What email marketing software did you use?",
          "score": 2,
          "created_utc": "2026-02-08 00:03:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o47b89i",
          "author": "kingoptimo1",
          "text": "How do you obtain 500k valid emails",
          "score": 1,
          "created_utc": "2026-02-08 04:49:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o47vwk0",
          "author": "_forgotmyownname",
          "text": "Dang 😅 500k emails and all the little tweaks you mentioned… I’d never survive the testing grind. Manufacturing being picky but high quality makes total sense tho.",
          "score": 1,
          "created_utc": "2026-02-08 07:46:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ch5me",
          "author": "Alone_Ad_3375",
          "text": "How much are you paying monthly on your total stack?",
          "score": 1,
          "created_utc": "2026-02-09 00:20:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4gbm3r",
          "author": "unicorn69love",
          "text": "targeting like that is key, anything else is just spam   i burned out scraping lists manually for similar b2b verticals til clienthunter automated finding those exact slices (rev range, titles, etc) and personalized the emails. replies held steady around 3-4% without me grinding, def worth checking if youre scaling.",
          "score": 1,
          "created_utc": "2026-02-09 16:11:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ikeye",
          "author": "Finners_GrowthStrat",
          "text": "This is really good insight thanks. What was it you were selling in the emails? Were a consultancy so trade on relationships, never tried cold layer much if anything.",
          "score": 1,
          "created_utc": "2026-02-09 22:44:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o43jvqu",
          "author": "satishpyrite",
          "text": "Surprisingly you didn’t mention any tech stack! What tools are you using and what is your take on that?",
          "score": 1,
          "created_utc": "2026-02-07 16:02:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o44rfy1",
              "author": "ImYouJoeGoldberg",
              "text": "These tech stack pleas are annoying",
              "score": 2,
              "created_utc": "2026-02-07 19:38:41",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o4eg4z0",
              "author": "Affectionate_Lab9365",
              "text": "Honestly, the absence of a stack breakdown is part of why this post is valuable. People fixate on tools because its easier than fixing targeting and sequencing.Same infra, same inboxes, wildly different outcomes across verticals tells you the stack wasnt the lever. Segment logic and timing were.Tooling only matters once youve earned the right to scale otherwise you just automate mistakes",
              "score": 1,
              "created_utc": "2026-02-09 08:12:21",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o45s61j",
          "author": "lichoudini",
          "text": "Seems legit, thanks for the insights",
          "score": 0,
          "created_utc": "2026-02-07 22:58:03",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qwl0g8",
      "title": "AI headshot recommendations?",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qwl0g8/ai_headshot_recommendations/",
      "author": "miss_raipelarmzz",
      "created_utc": "2026-02-05 13:17:11",
      "score": 26,
      "num_comments": 22,
      "upvote_ratio": 0.91,
      "text": "\nLooking for affordable headshots for our B2B team page. We need professional headshots for 10 people (sales, marketing, executives) but the headshot photographer quotes near me are $250-400 per person which adds up to $3,000+ total.\n\nThat's a huge chunk of our marketing budget. I've been researching cheaper alternatives and keep seeing AI headshot generators mentioned. Has anyone here used AI headshots for B2B company websites or should I keep looking for a more affordable headshot photographer ?\n\nSomeone mentioned they tried **Looktara** for their team's professional headshots and spent under $300 total instead of thousands, but I'm worried about quality and whether it looks unprofessional for B2B.\n\nFor B2B marketers - what's your recommendation? Find a cheap headshot photographer, use an AI headshot generator, or just pay the premium for traditional photography? Looking for suggestions on best options for professional headshots on a tight budget.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qwl0g8/ai_headshot_recommendations/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o3pmnoe",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-05 13:17:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3puxvr",
          "author": "No_Hedgehog8091",
          "text": "USING TIER A FOR THIS RESPONSE:\n\nTest AI on one person first, compare side-by-side with real photo.",
          "score": 5,
          "created_utc": "2026-02-05 14:04:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3r0r11",
          "author": "Old-Education-6879",
          "text": "You can try using Pixelbin.io. It gives good quality headshot images and also has a reasonable pricing plans.",
          "score": 3,
          "created_utc": "2026-02-05 17:27:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4f5rfg",
          "author": "aligg2019",
          "text": "AI headshots can work well for B2B teams if you keep things subtle and consistent, InstaHeadshots is one option since you can test it on one person first before rolling it out to everyone.",
          "score": 2,
          "created_utc": "2026-02-09 12:12:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4kf62h",
              "author": "Different_Pain5781",
              "text": "Yeah this makes sense to me. As long as the photos don’t look over processed, AI headshots can work well, and testing on a single person first is a smart way to avoid issues.",
              "score": 1,
              "created_utc": "2026-02-10 05:26:30",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3q0jv5",
          "author": "PLT1789",
          "text": "Just use google nanobanana\nGenerate the first headshot as a « template »\nthen use it to replicate style across the 10 other people\nDon’t spend your time and money on these thin AI wrappers",
          "score": 1,
          "created_utc": "2026-02-05 14:34:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3uzkhz",
          "author": "kaancata",
          "text": "I can really recommend using Antigravity for AI headshot. I think you'd be surprised how far this area has moved. If you have a clear photo of each individual, and some photos of your office environments, it'll get you 90% of the way there. ",
          "score": 1,
          "created_utc": "2026-02-06 06:43:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3vdyu4",
          "author": "tamnvhust",
          "text": "Nano Banana Pro",
          "score": 1,
          "created_utc": "2026-02-06 08:56:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3vz938",
          "author": "_forgotmyownname",
          "text": "For a B2B team page, consistency is actually more important than absolute perfection. AI generators are great at this because you can choose a specific background and lighting style for everyone. If you use a cheap photographer, you might end up with different lighting and quality for each person. At under $300 for the whole team, it is worth a shot. If one or two come out looking a bit \"off,\" you can always have those specific people re-do them or edit them.",
          "score": 1,
          "created_utc": "2026-02-06 12:04:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o427ebq",
          "author": "No-Emu77",
          "text": "AI headshots can actually get the job done for most B2B team pages if you feed them decent photos to start with and keep the edits subtle. The trick is to avoid turning everyone into slightly-too-perfect mannequins so ask for some touchups till your team looks like themselves on a good day. If budget is tight just test with one team member and check if the vibe fits your brand before rolling it out. Unless your industry is totally old-school, most folks won’t notice or care as long as everyone looks professional and consistent.",
          "score": 1,
          "created_utc": "2026-02-07 10:46:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o469q0y",
          "author": "GeoJoy1",
          "text": "We used Aragon.ai",
          "score": 1,
          "created_utc": "2026-02-08 00:45:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4jhz35",
          "author": "GlitchyToad",
          "text": "I can see you everywhere posting the same lol",
          "score": 1,
          "created_utc": "2026-02-10 01:53:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3pnw0c",
          "author": "Doug-Mansfield",
          "text": "Even in the B2B space I feel like scales have tipped from professional studio headshots to favoring more authentic and candid photos. Though it depends on the nature of the business and what their clients are looking for to validate them. A financial services company might still prefer the studio headshot route. But, I wouldn't discount the possibility that more candid DIY shots of people in their place of work would be suitable for more companies than in years past. It has a more approachable feel.",
          "score": 1,
          "created_utc": "2026-02-05 13:24:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3polod",
          "author": "kiillazy",
          "text": "\nwe used AI headshots for our team page last year because coordinating 10 people for a shoot was a nightmare.\nkept 1 solid photo per person, deleted the rest. no prospects ever commented, metrics didn’t change.",
          "score": 1,
          "created_utc": "2026-02-05 13:28:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3q64hk",
          "author": "Voltalyze",
          "text": "Just use ChatGPT or Grok\n\nUpload the picture there and tell it to replace the background with a plain white color, and also tell it to crop it to be a headshot. \n\nIf this helps, you owe me 10$",
          "score": 1,
          "created_utc": "2026-02-05 15:03:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4f617j",
              "author": "aligg2019",
              "text": "if it works I’ll Venmo you $10, if not you owe me a new LinkedIn photo 😂",
              "score": 1,
              "created_utc": "2026-02-09 12:14:09",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3pr28w",
          "author": "Positive_Load1595",
          "text": "a startup i advised used Looktara for their team page to save budget.",
          "score": -1,
          "created_utc": "2026-02-05 13:42:40",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r031aj",
      "title": "We switched to $35 AI headshots - nobody noticed, saved $2,800 for actual marketing",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1r031aj/we_switched_to_35_ai_headshots_nobody_noticed/",
      "author": "Vegetable-Feed-9305",
      "created_utc": "2026-02-09 12:34:46",
      "score": 20,
      "num_comments": 16,
      "upvote_ratio": 0.64,
      "text": "Running B2B marketing for a SaaS company with 8 team members who needed professional headshots for website, proposals, and LinkedIn. Professional photographers quoted $500-700 per person which would total $4,000-5,600 for everyone. Tried **Looktara** AI headshots instead at $35 each for $280 total. Everyone uploaded casual photos from their phones and got professional headshots back in 15 minutes.\n\nUsed them everywhere for 3 months - website, email signatures, client proposals, LinkedIn posts. Zero clients or prospects mentioned anything about the photos. Nobody could tell they were AI-generated. Professional perception stayed exactly the same but saved $2,800+ that went straight into Google Ads and content creation instead. B2B decision makers care about your product and pricing, not whether your headshot cost $35 or $600.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1r031aj/we_switched_to_35_ai_headshots_nobody_noticed/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o4f8ss8",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-09 12:34:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4fe2y5",
          "author": "TheArchitect_7",
          "text": "You don’t THINK people noticed.\n\nWe quietly cringe at these things all the time and never once mentioned them to the person or company.",
          "score": 11,
          "created_utc": "2026-02-09 13:10:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ffy4t",
          "author": "Several-Chef-9068",
          "text": "Wondering why this even deserved a thread",
          "score": 7,
          "created_utc": "2026-02-09 13:22:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4fgnby",
              "author": "nachosareafoodgroup",
              "text": "Almost certainly hacked and used for advertising if you look at the rest of the persons profile.",
              "score": 5,
              "created_utc": "2026-02-09 13:26:24",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o4fgle4",
              "author": "Radiant-Security-347",
              "text": "it’s an ad",
              "score": -12,
              "created_utc": "2026-02-09 13:26:04",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4fjvqq",
                  "author": "reasonwashere",
                  "text": "Yup",
                  "score": 1,
                  "created_utc": "2026-02-09 13:45:53",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4fa7xw",
          "author": "centurytunamatcha",
          "text": "AI will eat the low-stakes, utilitarian headshot use cases. photographers will still own branding, lifestyle, and high-touch work.",
          "score": 3,
          "created_utc": "2026-02-09 12:44:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4fbkm9",
          "author": "bala523",
          "text": "I’ve seen a few AI headshots (including from looktara) that honestly blended right in with studio photos.",
          "score": 1,
          "created_utc": "2026-02-09 12:53:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4fjsrk",
          "author": "PearlsSwine",
          "text": "unsure if this shit, obvious spam was your idea or your boss' idea. \n\neither way, it's fucking shit. ",
          "score": 1,
          "created_utc": "2026-02-09 13:45:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4fpd9w",
          "author": "Shama_lala",
          "text": "Absolutely love this move. Why blow thousands on headshots when you can funnel that cash into what actually matters? Clients care about the value you bring, not how polished your profile pic is. ",
          "score": 1,
          "created_utc": "2026-02-09 14:17:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4gcowm",
          "author": "salko_salkica",
          "text": "Shitty ad for a shitty product",
          "score": 1,
          "created_utc": "2026-02-09 16:16:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4faunz",
          "author": "Top-Statement-9423",
          "text": "As a buyer, i don’t need artistry for LinkedIn. i need looks like me, looks professional and if AI gives me that for $40, I’m not paying 10x unless i want the experience.",
          "score": 1,
          "created_utc": "2026-02-09 12:49:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4fm3xw",
          "author": "PrettyGraphic",
          "text": "Nice ad bro",
          "score": -40,
          "created_utc": "2026-02-09 13:58:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4kojo9",
              "author": "King_Kahun",
              "text": "Not sure why you're getting down voted. Maybe OP has downvoting bots LOL",
              "score": 1,
              "created_utc": "2026-02-10 06:44:00",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4fkvj6",
          "author": "Kindly_Watercress416",
          "text": "Yeah guys, this is an ad but we can at least learn smth from it",
          "score": -21,
          "created_utc": "2026-02-09 13:51:40",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qvk104",
      "title": "Why do B2B marketing agencies make you choose between brand building and demand gen? Am I missing something?",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qvk104/why_do_b2b_marketing_agencies_make_you_choose/",
      "author": "wolfybelfy",
      "created_utc": "2026-02-04 09:25:29",
      "score": 19,
      "num_comments": 43,
      "upvote_ratio": 0.93,
      "text": "I've been shopping for a b2b marketing agency for the past month and I keep\n\nrunning into the same thing - agencies are either brand-focused (pretty\n\ndecks, awareness campaigns, thought leadership) or demand-focused (MQLs,\n\npipeline, conversion rates).\n\nWhy is it so hard to find someone who can do both? Our CEO wants brand\n\npresence, our CRO wants pipeline. Seems like these shouldn't be opposing\n\nforces but every agency I talk to picks a lane.\n\nIs this just how the industry works or am I looking in the wrong places?\n\nFor context: Series B SaaS company, \\~$20M ARR, selling to mid-market.",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qvk104/why_do_b2b_marketing_agencies_make_you_choose/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o3i3ckh",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-04 09:25:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3iob00",
          "author": "HelpfulSlip1954",
          "text": "I run a small b2b agency (we cap at 6 clients but we're not cheap) that runs both sides - to do this level of work it requires very specific talent which almost no one has. A lot of demand gen agencies are simply performance marketing (ads) and a lot of brand agencies are simply logos and colors. You need something radically different hard to find.",
          "score": 10,
          "created_utc": "2026-02-04 12:23:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3jqpav",
              "author": "_FalseProphet",
              "text": "I'm a Creative Director with +20years of experience in b2c, but looking to make the jump to a remote work b2b agency! let me know if I can send you my book! :))",
              "score": 1,
              "created_utc": "2026-02-04 15:51:02",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3ioxbt",
          "author": "Kamel_Ben_Yacoub",
          "text": "The issue isn't finding one agency that does both. It's finding agencies that understand how brand and demand work together in a full-funnel strategy, not as separate silos.\n\nAlso, most B2B marketing agencies are generalists and do everything (SEO, PPC, outreach, emailing, sales enablement, etc.), so it's quite difficult to understand what they really do well. You can't be an expert at everything and it's easy to spot when you look at the services they offer. Deep expertise matters.\n\nYou can hire a SEO/content marketing agency and a PPC agency who does demand capture (paid search) and demand gen (paid social). You'll get better results than one large agency with ton of different services.\n\nMost of our B2B SaaS clients hire us for their PPC activities for this reason. Better to get specialists than generalists.",
          "score": 7,
          "created_utc": "2026-02-04 12:28:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3o7l5m",
              "author": "davmav71",
              "text": "the silo problem is usually the real issue, not capability on paper. Specialists can work great, but only if someone is actually owning the full-funnel strategy and making sure those pieces talk to each other.",
              "score": 1,
              "created_utc": "2026-02-05 06:01:29",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3j6q4v",
          "author": "LeadGenDotCom",
          "text": "There are several reasons why this happens. First, many marketing agencies specialize. In practice, many are really tech companies, not really marketing agencies per se, and many others are specialized with respect to a particular service (SEO, telemarketing, etc.) Second, the schools and the industry have moved away from traditional (i.e. Kotler) functions of marketing (which incudes things like market research, strategy development and positioning, not just branding, etc.,), as well as formal linkages to sales because being accountable is risky. Think MQL - which was an invention of the major CRM developer, but which is a nonsense concept. Third, everyone is being victimized, to a degree, by the platforms that control access to the market. There are agencies out there that can do what you're looking for, and maybe this perspective will help you find one.",
          "score": 3,
          "created_utc": "2026-02-04 14:12:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3kuxra",
              "author": "adriandahlin",
              "text": "great point about accountability -- look for agencies/consultants that talk about how you can measure their success and hold them accountable without you even asking",
              "score": 1,
              "created_utc": "2026-02-04 18:54:39",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3icwq6",
          "author": "Impressive-Amount255",
          "text": "I totally get the frustration, and you are absolutely right. It’s kind of difficult to trust one agency to handle your branding efforts and another agency to handle your demand gen or lead gen efforts. These three elements should flow naturally, and not having one agency manage the entire thing is the best way to make sure the experience is broken, not to mention that you’re probably going to pay more than you should.\n\nThat being said, why this happens actually makes sense. There are a couple of reasons. First, it’s not the same skill set. Some of the agencies you’re describing are very creative. They hire the right talent to make your brand stand out, create a message that resonates, define your identity, and distribute it so this identity is visible to everyone.\n\nThe other type of agency you’re describing hires teams laser-focused on optimizing and generating business.\nAnother element is that most agencies really want clarity on your goals. When your goal is “do everything,” agencies often anticipate trouble. You might end up saying, “Yes, but I expected more leads,” and they are forced to shift focus from awareness to lead gen. Or you might say, “My brand isn’t as visible as I wanted,” and they pivot back to awareness, reducing leads. Basically, agencies are used to clients being unclear about what they want, and trying to do too much in one shot ends up causing constant changes in direction until things break, or worse, until the agency gets fired.\nThat may explain what you’re seeing. That being said, I’m totally with you. I’m a huge believer that campaigns should be properly integrated: start with awareness and go all the way down to lead gen.\n\nMy recommendation would be to first work with an agency to define your brand: what it should look like, what you stand for, and what your values are. Once that’s clear, work with a dimensional agency to build truly integrated campaigns that cover the entire customer journey, properly integrating all channels, not just making branding consistent, but ensuring the right message reaches the right audience with a perfect flow, so no customer is mishandled.\n\nOnce you have this in place, you can have the same agency manage distribution for your brand awareness elements. This part is actually easy. Be explicit with them: the goal of this brand awareness campaign is purely impressions and visibility for the right audience. You’re not trying to generate leads from this campaign; other campaigns will handle lead gen.\n\nIf you have the resources, it’s even better to do this in-house. If you lack experience, there are plenty of frameworks available. If you type “integrated campaign framework” into Google, you’ll find many that are easy to use. My favorite one is the RIO framework, but there are many others.\n\nIf you rely on an agency, make sure they integrate everything properly and don’t go rogue: building a patchwork of random activities that may generate some short-term leads but will be a disaster to manage in the long run.",
          "score": 4,
          "created_utc": "2026-02-04 10:53:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ij8ku",
          "author": "Mass_Metric",
          "text": "This comes up a lot at the Series B stage.\n\nIt’s usually not that agencies *can’t* do both. It’s that most of them were built with one core DNA, and that bias shows up in how they operate.\n\nBrand-led agencies tend to come from creative or comms backgrounds, so they think in terms of storytelling, positioning, and visibility. Demand-led agencies usually come from performance marketing or RevOps, so everything gets reduced to leads, CPL, and pipeline math.\n\nBoth are optimizing for what they know how to measure.\n\nThe problem is structural. Brand teams get judged on perception. Demand teams get judged on revenue. So agencies mirror that split and pick a lane.\n\nBut for a $20M ARR SaaS company, those two can’t really be separated anymore.\n\nBrand creates trust and familiarity, which lowers CAC and improves conversion.  \nDemand captures that trust and turns it into pipeline.\n\nIf you only run brand, you look great but struggle to prove ROI.  \nIf you only run demand, you burn budget chasing cold buyers forever.\n\nThe companies that scale well usually treat brand as demand infrastructure, not a separate function. Things like category POV, strong messaging, customer proof, and thought leadership directly improve ad performance, outbound response rates, and sales conversations.\n\nSo it’s less “brand vs demand” and more “brand feeding demand.”\n\nYou’re not looking in the wrong places. It’s just that many agencies are specialized silos. You probably want a team that thinks in terms of full-funnel or revenue marketing rather than either creative or performance alone.",
          "score": 1,
          "created_utc": "2026-02-04 11:46:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ikoap",
          "author": "aashrun",
          "text": "whats the struggle tho, meeting ceo n cro expectations?",
          "score": 1,
          "created_utc": "2026-02-04 11:57:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3izjh4",
          "author": "another_sleeve",
          "text": "because SaaS marketing is ass-backwards. in the real world an agency would do both, in SaaS land these are treated as seperate disciplines.\n\nfwiw just figure out how you want to split the budget between brand and demand and roll with that, but keep in mind that brand needs continous investment and it will affect how well the demand agency performs",
          "score": 1,
          "created_utc": "2026-02-04 13:33:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3o7of8",
              "author": "davmav71",
              "text": "brand isn’t optional overhead, it’s the thing that makes demand gen cheaper and actually work. Splitting budget is fine, but treating brand as a one-off instead of a continuous input is where teams shoot themselves in the foot.",
              "score": 1,
              "created_utc": "2026-02-05 06:02:13",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3opnio",
                  "author": "another_sleeve",
                  "text": "I'm not the one who needs convincing, it's the CFOs who treat brand like arts n crafts",
                  "score": 1,
                  "created_utc": "2026-02-05 08:44:27",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3izoqe",
          "author": "Responsible-Brick881",
          "text": "I can do both and likely something a bit different from what you've had put in front of you by everyone else....would be delighted to chat more and bring a new perspective!",
          "score": 1,
          "created_utc": "2026-02-04 13:34:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3j8v9j",
          "author": "appu49",
          "text": "There are very few agencies who are working in Brand to Revenue strategy.\nMy agency (where I work) is one of them, I wont brag about my agency name in the comment section but feel free to DM me if you have any questions or would like to know more about the Brand to Revenue model.\nAnd we have been doing this for more than 2 years.",
          "score": 1,
          "created_utc": "2026-02-04 14:23:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3jtupw",
          "author": "seanrrwilkins",
          "text": "The bifurcation is due to the completely  different skill sets and team needs. \n\nAlso, most clients, especially in your growth phase, aren’t looking for or able to pay for both at the same time. \n\nThat said, managing your leadership needs is never easy. \n\nAre you looking for one agency because you’re not familiar with partnering with agencies and one sounds better than two? \n\nIf you had to prioritize, brand or pipeline, for the next 12 months, what makes the most sense to support your business goals and growth story?",
          "score": 1,
          "created_utc": "2026-02-04 16:05:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3jym7l",
          "author": "agonsenhauser",
          "text": "The split exists because many agencies treat brand as \"vibes\" and demand as \"math,\" but they are actually part of the same infrastructure. Brand reputation is essentially the \"demand infrastructure\" that ensures you are on the shortlist of 4 or 5 vendors a buyer already has in mind before they ever engage. If you only focus on the capture side, you are fighting a losing battle against the 77 percent of buyers who have already formed a preference before they even start an active search. Find an agency that understands and appreciated both!",
          "score": 1,
          "created_utc": "2026-02-04 16:27:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3kgru5",
          "author": "datagirl2318",
          "text": "this actually frustrates me to read because in my mind, brand and demand are almost synonmous (obvi they're different..) but one does not exist without the other!!!!\n\nyou could have the best demand gen strategy in the world, have the most seasoned marketers, have the most clean workflows...but if nobody knows who you are, knows where you stand against competitors, or knows your value prop, good luck. there is no 'demand' without brand.\n\ni think the problem with these agencies is finding good talent that actually know how both work across the entire marketing funnel. unfortunately people in agency are severely underpaid and it's a lucrative business - this is my hunch as to why these agencies treat them seperate and as a result, there are siloes. \n\ni wish things were different. i'd be curious to know of an agency that does both these things exceptionally well, but i also have never seen one :( good luck on your search!",
          "score": 1,
          "created_utc": "2026-02-04 17:50:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3knw8e",
          "author": "ThatGuytoDeny165",
          "text": "We tell people brand 2 demand. We do both but it a very prescriptive approach. Quickly analyze brand and see what’s there and what works. Make minor adjustments as needed then get it into the world and start leveraging for demand. \n\nThe key is to constantly be looking at data and adjusting. A lot of times people spend way too much time in pursuit of perfection but until you get into the market you really don’t know how it’ll respond.",
          "score": 1,
          "created_utc": "2026-02-04 18:23:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3l07a9",
          "author": "ConfusionDull2183",
          "text": "Mostly in comes from B2B client demand - they are underspending on brand and over spending on performance. Agencies follow this demand. \n\nThe big B2B agencies do both - some well.",
          "score": 1,
          "created_utc": "2026-02-04 19:18:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3l2eui",
          "author": "kalol_",
          "text": "Doing both requires specialized skills and years and years of experience. Most agencies offering demand gen will only do ads, or cold emails. Not to mention an agency doing both will charge just as much. Branding requires experience that doesn't necessarily overlaps with experience needed for Demand gen.  \n\nI just started my agency last year but I have worked in b2b marketing space for 11 years now, doing both branding and demand gen. I am growing things slowly but in the end, you have to pitch these services separately (as people looking for both branding and lead gen are scarce or don't have the budget) and hence most agencies ends up picking a side that gives them most clients.",
          "score": 1,
          "created_utc": "2026-02-04 19:28:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3l2pqr",
          "author": "Euphoric-View-9876",
          "text": "They get separated because agencies optimize for what they can be measured and blamed for. Brand without pipeline feels safe, pipeline without brand feels accountable. The teams that actually connect the two usually dont sell it as brand + demand, they start from buyer reality and let both emerge from the same audience and message.",
          "score": 1,
          "created_utc": "2026-02-04 19:30:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3ogllg",
              "author": "Thin-Opportunity8732",
              "text": "What gets lost in that model is when buyers actually form preferences, which usually happens long before anything is measurable in a dashboard. Teams that anchor on buyer attention earlier dont have to force a brand vs demand tradeoff later.",
              "score": 2,
              "created_utc": "2026-02-05 07:19:23",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3qrbuk",
                  "author": "Euphoric-View-9876",
                  "text": "Exactly. By the time something shows up as demand, the decision has usually been narrowed to a short list already. Thats why agencies end up arguing about brand versus pipeline instead of focusing on where attention forms in the first place.",
                  "score": 1,
                  "created_utc": "2026-02-05 16:43:05",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3m9hd2",
          "author": "chaliques",
          "text": "As a agency that does both I'll explain. \n\nFor context been running my Revenue Markering agency for 5 years. Started off as a Demand Gen agency. We're doing about $5m+\n\n**Not trying to sell.**\n\nSo we literally only focus on brand once leadership signs off. Because as an agency, we can only touch things that show direct attribution to revenue growth. \n\nOtherwise it may look like we're underperforming if leadership isn't aligned with the goals.",
          "score": 1,
          "created_utc": "2026-02-04 22:57:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3mje34",
          "author": "therevenueramp",
          "text": "It’s the binary thinking of outsourcing must mean traditional b2b agencies who by design specialize in solving a problem. There are full end to end managed services, marketing-as-service firms that don’t force the choice between brand and demand. IT, Finance, HR all mastered different forms of outsourcing yet marketing thinks in house marketers OR traditional b2b agencies.",
          "score": 1,
          "created_utc": "2026-02-04 23:51:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3mpl4p",
          "author": "Strong_Teaching8548",
          "text": "most agencies specialize because they're built around one motion, brand folks are designers and strategists, demand folks are performance marketers. they're different skill sets and incentive structures\n\nbut here's what i've noticed building something in the adjacent space: the agencies that do both well usually have one person who bridges it. someone who understands that brand work actually impacts demand gen (better positioning = easier selling) and vice versa (demand work reveals what resonates)\n\nat your stage with mid-market, you probably need both but sequenced right, nail positioning first, then let demand gen leverage it. most agencies just don't have that person who thinks holistically about it :/",
          "score": 1,
          "created_utc": "2026-02-05 00:26:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3o7ion",
          "author": "davmav71",
          "text": "brand and demand only get split because agencies are built and measured around one motion. The good ones tie both to revenue, they’re just harder to find and don’t usually market it that way.",
          "score": 1,
          "created_utc": "2026-02-05 06:00:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3of0m8",
          "author": "Overall-Fondant-882",
          "text": "This split usually exists because agencies organize around services, not buyer behavior. From the buyer side, brand is what gets you onto the shortlist and demand is what captures intent once you’re already there. Teams that start from audience attention instead of tactics tend to blur that line naturally.",
          "score": 1,
          "created_utc": "2026-02-05 07:05:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ku3bv",
              "author": "Thin-Opportunity8732",
              "text": "This framing is key. From the buyer side there isnt a brand vs demand moment theres just attention forming over time. Brand shapes preference before its measurable, demand captures it once it surfaces. Teams that organize around tactics instead of attention end up arguing about the split instead of fixing the root problem.",
              "score": 1,
              "created_utc": "2026-02-10 07:34:10",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3oilu8",
          "author": "Sourabh_Apage",
          "text": "Primary reason I see this from the performance side is that brand doesn’t show up immediately in attribution while demand gen does. Agencies end up optimizing for what they can defend in monthly reviews. Working with two separate agencies isn’t really the issue as long as someone in-house or a consultant is actually tying branding work to demand execution so they don’t operate in silos. Clear KPIs for both sides matter otherwise it’s hard to tell whether brand is helping demand or just drifting.",
          "score": 1,
          "created_utc": "2026-02-05 07:37:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3t0jjv",
          "author": "B2BScaler",
          "text": "My agency is literally developing tech to address this as we speak and has working demo models in play to address all channel issues with corresponding suggested fixes or additions (if absent from tech stack/advertising/marketing approach present).\n\nAgencies pigeon hole themselves often tricking themselves that channel or tool specialization means an edge over a competitor, while making the error of disregarding a tailored, all in one but not overly convoluted solution. \n\nThe perception you CAN'T do both is a limiting belief out of fear generated by infatuation with a strong suit channel or approach.\n\nFull stack, well rounded agencies that can execute at scale whether it be through internal headcount and skill sets, external teams and solid flows, white label, outsource/offshore, you name it - they all require a legit, top down view of approach on channels before sending a final proposal and promising an end result. \n\nIf you want me to give an example of what sort of proposal structure I use that I believe has an edge you can also message me if that sort of solution seems elusive to you.",
          "score": 1,
          "created_utc": "2026-02-05 23:10:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3tnmx8",
          "author": "lichoudini",
          "text": "2 different kinds of people, two different kinds of teams. So more expenses. More difficulties to optimize.",
          "score": 1,
          "created_utc": "2026-02-06 01:22:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o40bvoi",
          "author": "Interesting-Wheel350",
          "text": "This is an interesting read as I’m building a brand authority growth agency to align both the executive brand building with the business brand build through founder-led marketing campaigns and PR. The aim is to use the executive profile raising and brand building to convert into opportunities for revenue growth and sales. I spent a decade working across agencies and only one actually translated their marketing into revenue all the others spent time aligning with vanity metrics that didn’t move the needle",
          "score": 1,
          "created_utc": "2026-02-07 01:44:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o47mczy",
              "author": "Any-Rooster2350",
              "text": "Any case studies of this yet? Sounds like something a few founder friends would want. Drop me a msg!",
              "score": 2,
              "created_utc": "2026-02-08 06:19:29",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o48al6a",
                  "author": "Interesting-Wheel350",
                  "text": "Not for this particular offer yet I spent the last few days developing and refining it so now I’m looking to work with a few founders in the B2B professional services space but I’ve been using myself as a case study, will drop a message🫡",
                  "score": 1,
                  "created_utc": "2026-02-08 10:05:24",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qxwka3",
      "title": "Our boring email strategy is outperforming creative campaigns by 3x",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qxwka3/our_boring_email_strategy_is_outperforming/",
      "author": "Content_thought55",
      "created_utc": "2026-02-06 22:49:17",
      "score": 19,
      "num_comments": 35,
      "upvote_ratio": 0.92,
      "text": "Saw a post on this sub a few days ago about how a small YouTube channel with barely any subscribers was pulling more leads than their polished content, and that's exactly what I'm seeing in high ticket B2B. We spent months on a creative LinkedIn campaign with custom graphics, clever hooks, and trendy formats. It got decent engagement but generated maybe 3 qualified leads.\n\nMeanwhile, our boring weekly email with a simple case study breakdown and one actionable takeaway has driven 40+ demos in the same timeframe. Same thing with our plain LinkedIn posts that just share a customer problem and how we solved it. Zero creativity, just consistent value.\n\nI'm starting to think B2B marketers chase creativity because it's more fun, not because it works better. The fundamentals are boring but they actually move pipeline.\n\nOur best performing content is the stuff that feels too simple or repetitive. Our buyers don't care about creative, they care about whether we understand their problem.\n\nThe creative campaigns get more internal praise and look better in portfolio decks. The boring stuff actually closes deals. That gap is wild tbh.\n\nWhat boring tactics are driving results for you?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qxwka3/our_boring_email_strategy_is_outperforming/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o3zhyi7",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-06 22:49:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o404crl",
          "author": "New_Grape7181",
          "text": "I've noticed the same thing. The stuff that feels embarrassingly simple usually works best because decision makers are drowning in noise and just want to know if you can actually help them.  \n  \nWe tested this directly with outreach last quarter. The \"creative\" sequence with GIFs and clever subject lines got opened more but converted terribly. The plain text emails that looked like they came from a real person and referenced a specific problem we noticed at their company converted at nearly 4x the rate.  \n  \nI think the issue is that creativity in B2B often becomes about us (look how clever we are) instead of them (here's your problem and a solution). Your case study emails work because they're showing proof, not personality.  \n  \nThe repetition point you mentioned is interesting too. I used to worry about sending similar content too often, but our buyers aren't reading everything we publish. They need to see the same core message multiple times before it clicks, especially for high ticket stuff where the buying cycle is long.  \n  \nWhat's the typical time from first email open to booked demo for you? Curious if the boring approach also shortens the cycle or just increases volume.",
          "score": 4,
          "created_utc": "2026-02-07 00:57:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4aasvt",
              "author": "Content_thought55",
              "text": "The time from first email to demo is usually 2-4 weeks for us. The boring approach doesn't really shorten the cycle but it does increase qualified volume like you said.\n\nWhat we noticed is the creative stuff gets fast responses from tire kickers who aren't actually ready to buy. The plain case study emails take longer to convert but when they do book a call, they've already done their research and the conversation is way more productive.",
              "score": 1,
              "created_utc": "2026-02-08 17:40:53",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4i3kr6",
                  "author": "New_Grape7181",
                  "text": "Makes sense, finding the serious people is half the battle. Do you do email only or try via other channels too?",
                  "score": 1,
                  "created_utc": "2026-02-09 21:19:12",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3zok1z",
          "author": "Responsible-Brick881",
          "text": "Ever considered video on premium publishers like business insider, forbes, etc?",
          "score": 2,
          "created_utc": "2026-02-06 23:26:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4abq9n",
              "author": "Content_thought55",
              "text": "We haven't tested premium publisher placements yet. Have you seen that work for B2B? Would love to know more on this",
              "score": 1,
              "created_utc": "2026-02-08 17:45:21",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4acil0",
                  "author": "Responsible-Brick881",
                  "text": "I have. I've worked in online for 12+ years and with the right set up, its a great way to get in front of your target audience. \nLinkedIn is crazy expensive - other socials can be tricky, particularly for targeting senior execs - and standard online advertising generally means you don't know what sites your ads are actually being served on. Mind if I drop you a DM?",
                  "score": 2,
                  "created_utc": "2026-02-08 17:49:04",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3zsnky",
          "author": "PracticalCap4638",
          "text": "Commenting to follow ⭐️ to boring but consistent!!",
          "score": 2,
          "created_utc": "2026-02-06 23:49:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o47bdje",
          "author": "murtuza78",
          "text": "Totally relate to this. The stuff that’s almost boring to make is what buyers want because it’s just clear and useful. For me, plain text outreach and short posts that focus on one real solution have gotten way more traction than anything flashy. People just want to know you get their actual problems and can help—not that you won a design award. The creative work keeps the team happy but the simple stuff keeps the sales team fed.",
          "score": 2,
          "created_utc": "2026-02-08 04:50:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ab4dg",
              "author": "Content_thought55",
              "text": "I love the way you put my exact thoughts into words. I've had internal teams push back on sending the same format multiple times because it feels lazy to them, but our buyers literally don't remember what we sent two weeks ago. They're juggling fifty other things.",
              "score": 1,
              "created_utc": "2026-02-08 17:42:25",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4csd8z",
          "author": "Alarming-Pack6389",
          "text": "Totally true. One of our top-performing pieces of content is a simple listicle. It has generated more leads than all of our landing pages. What makes it so special is that it solves the single most painful problem of the majority of the audience. ",
          "score": 2,
          "created_utc": "2026-02-09 01:23:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4d4oo0",
          "author": "Slight_Tutor1790",
          "text": "This also lines up with how buying committees work. Most people reading these emails are forwarding them internally, so plain text and simple PDFs are easier to skim and pass along. Flashy formats look nice in a feed but feel awkward to share in a Slack thread or email chain. Boring wins because it travels better inside real companies.",
          "score": 2,
          "created_utc": "2026-02-09 02:29:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o42thb6",
          "author": "astillero",
          "text": "You're right boring beats creative in B2B. \n\nMine?\n\nBoring email.\n\nBoring follow-up (via phone or email)",
          "score": 1,
          "created_utc": "2026-02-07 13:40:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ab7s3",
              "author": "Content_thought55",
              "text": "Boring follow up is underrated fr!",
              "score": 2,
              "created_utc": "2026-02-08 17:42:54",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o47rizq",
          "author": "ColdOpening2892",
          "text": "Who cares for creativity (unless you are coca cola or someone where marketing is for brand recognition and not lead generation). The only metric that matters are quality leads. ",
          "score": 1,
          "created_utc": "2026-02-08 07:06:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4acymj",
              "author": "Content_thought55",
              "text": "Hard agree tbh, I think when u get into marketing in general, the focus automatically leans towards impressive engagement numbers/ impressions and creativity rather than focusing on client goals. This sentiment commonly gets shared around the marketing subs as well here on reddit if you have noticed, but moving away from those metrics to see the business POV and how to make marketing work for the client is what makes the difference.",
              "score": 1,
              "created_utc": "2026-02-08 17:51:11",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o49ttcp",
          "author": "Any-Rooster2350",
          "text": "I think it’s less “creative vs boring” and more the client wins and success stories you’re sharing , along with your process. Did your flashy LinkedIn campaign feature these customer case studies too? Agree that clear beats clever from a messaging perspective in b2b, but also, amplifying that boring message can still be creative imho. Congrats on the success !",
          "score": 1,
          "created_utc": "2026-02-08 16:18:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4adkkg",
              "author": "Content_thought55",
              "text": "Good question, the flashy campaign did feature customer stories but they were packaged with infographics and carousel formats. The boring emails are literally just text with a link to a simple PDF breakdown. Same stories, way different presentation. I think the plain format makes it feel less overwhelming for clients..",
              "score": 1,
              "created_utc": "2026-02-08 17:54:08",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4e8l20",
                  "author": "Kindly_Bat_9088",
                  "text": "Sometimes i just want to read texts. Not graphics, not the nth video (i am increasingly getting tired of videos), just text. \n\nHowever, text can also be packaged in a beautiful way. Think about those beautiful, big books with text+ images like interior design books for instance.",
                  "score": 1,
                  "created_utc": "2026-02-09 07:01:14",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o4egw0e",
              "author": "Affectionate_Lab9365",
              "text": "Agree and Id go one step further its not format, its timing.The same boring case study works wildly differently depending on whether the buyer is actively evaluating or just browsing.Thats why intent signals matter more than presentation. Surfacing people who are already engaging with competitor content or problem adjacent discussions (where tools like Followerli help) usually beats polishing the asset itself.",
              "score": 1,
              "created_utc": "2026-02-09 08:19:46",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4a09xi",
          "author": "jrpollock",
          "text": "As B2B marketers, I feel like we always want to try something new. But in reality, we forget that our evergreen content is new to the prospects that are seeing it today. It’s new to them and that’s what matters and it answers their questions and addresses their needs.",
          "score": 1,
          "created_utc": "2026-02-08 16:49:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4adn0t",
              "author": "Content_thought55",
              "text": "This is such a good point. We reuse the same 5-6 case study formats over and over with different customer examples plugged in. To us it feels repetitive but to prospects seeing it for the first time it's exactly what they needed to read that week.",
              "score": 2,
              "created_utc": "2026-02-08 17:54:27",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4bdve4",
          "author": "KissyyyDoll",
          "text": "Yep. Same here. Every time we “spice things up,” pipeline drops. Plain emails explaining one problem + one fix keep winning. Buyers aren’t bored, marketers are",
          "score": 1,
          "created_utc": "2026-02-08 20:48:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4c6woa",
          "author": "Digi-Dave",
          "text": "For your boring simple emails (case study and actionable takeaway)what stage in the funnel are your recipients usually in?",
          "score": 1,
          "created_utc": "2026-02-08 23:20:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4dt9j2",
          "author": "realvaluehere",
          "text": "Excellent set of points. Realising, we were trying to be creative and wasting a lot of time. Now I think I will just be consistent in sending out the boring messages.",
          "score": 1,
          "created_utc": "2026-02-09 04:56:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4e7ry9",
          "author": "Kindly_Bat_9088",
          "text": "Have you AB tested and tried publishing those useful cases with beautiful design and custom graphics? So what I mean is: same text, same content, one option is simple design, the other option is beautiful and custom design.",
          "score": 1,
          "created_utc": "2026-02-09 06:53:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4iaesk",
          "author": "serial_entrepreneur_",
          "text": "What CTA are you using to get the demo's?  Is it an email only campaign or using multi-channel?  Thanks for sharing!",
          "score": 1,
          "created_utc": "2026-02-09 21:53:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o455hl8",
          "author": "Awkward_Leah",
          "text": "This lines up with what Ive seen too. The emails that perform best are usually simple, problem focused and sent at the right time, not the most creative ones. What made the biggest difference for me was letting behavior drive everything and Activecampaigns AI makes that easier than it used to be. Ive been impressed with how its Active Intelligence suggests automations, segments and reporting based on what people actually do, so theres less manual setup and more focus on repeating whats already working",
          "score": 0,
          "created_utc": "2026-02-07 20:54:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4abfwc",
              "author": "Content_thought55",
              "text": "The behavior driven piece is key. We track which case studies get opened and forwarded internally, then double down on those specific problems in future emails.",
              "score": 1,
              "created_utc": "2026-02-08 17:43:59",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o49rd0l",
              "author": "Old-Cash-4910",
              "text": "👆🏻 Speaking of marketing messages.",
              "score": 0,
              "created_utc": "2026-02-08 16:06:18",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qusna3",
      "title": "Cold emails in Europe are a gift from heaven.",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qusna3/cold_emails_in_europe_are_a_gift_from_heaven/",
      "author": "colinbyprospectai",
      "created_utc": "2026-02-03 13:59:23",
      "score": 16,
      "num_comments": 41,
      "upvote_ratio": 0.69,
      "text": "I run a cold email agency for B2B outbound from Germany with international clients.\n\nI had many clients from the US, Canada, and Australia, all English-speaking, before specializing in Europe. Why? The strong home bias and the incredibly impressive results here.\n\nInstead of struggling for a 3% reply rate in English-speaking countries, we get 5-20% reply rates for our Dutch, Belgian, French, and German clients, and that's the norm. It's all about intent-based outreach with our personalized message framework that works.\n\nWe get 10-30 meetings here with B2B decision makers. I love it and never want to go back.\n\nIf you're in Europe or want to expand, lmk!",
      "is_original_content": false,
      "link_flair_text": "Support",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qusna3/cold_emails_in_europe_are_a_gift_from_heaven/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o3cc4cn",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-03 13:59:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ckzpx",
          "author": "Ok_Attention8694",
          "text": "How are you dealing with GDPR issues - especially in Germany, which is an opt-in jurisdiction?",
          "score": 17,
          "created_utc": "2026-02-03 14:46:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3dkedz",
              "author": "Any-Editor8768",
              "text": " I would also like to know that. Cold mails are forbidden in Germany and you can get fined for it. My assumption is, that the ROI is still worth the risk for some business.",
              "score": 3,
              "created_utc": "2026-02-03 17:34:33",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3fqg3a",
                  "author": "Full-Competition-762",
                  "text": "this. we’re building a startup and I receive cold emails 2-3x a week. we could report them, but we don’t care since I think that that rule is nonsense. \n\nOP is just trying to promote their agency so while the topic is interesting, the post is bs",
                  "score": 6,
                  "created_utc": "2026-02-03 23:45:22",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3cs3ki",
          "author": "h_2575",
          "text": "How do you get consent? I mean uwg §7.2 is pretty clear.  If people don't expect your message or e-mail you cannot assume consent. This is considered unfair competition in most of Europe. Besides this, gdpr requires consent as well if you use personal E-Mails addresses. Same holds for cold phone calls or any other electronic way to get in touch.",
          "score": 9,
          "created_utc": "2026-02-03 15:22:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3d77ar",
              "author": "xxtoni",
              "text": "I thought for B2B if it is a business email and you have legitimate interest it was fair game",
              "score": 1,
              "created_utc": "2026-02-03 16:33:31",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3djwnx",
                  "author": "Any-Editor8768",
                  "text": "According to lawsuits selling sth. to a business does not count as a legitimate interest to use their mail address. Its only allowed over phone calls. Companies that still do this risk cease-and-desist letters high fines.",
                  "score": 3,
                  "created_utc": "2026-02-03 17:32:14",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o3vezhz",
                  "author": "AtomicMacaroon",
                  "text": "We recently cold-emailed a business, asking for a meeting at an upcoming trade show we were both attending to discuss if our services would perhaps be a good fit for them. Got a cease-and-desist letter from their lawyer asking for 500 Euros and a promise to never send them unsolicited marketing emails again. We could have fought this in court, but that would have cost as much as settling, so we just paid the fine and moved on.",
                  "score": 3,
                  "created_utc": "2026-02-06 09:05:51",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3ccdvt",
          "author": "EffectiveLet2117",
          "text": "Are you selling a service or a product?",
          "score": 4,
          "created_utc": "2026-02-03 14:00:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3cczq8",
              "author": "colinbyprospectai",
              "text": "God hoped this post was clear enough 😂 we are a agency, it's a dfy service.",
              "score": -1,
              "created_utc": "2026-02-03 14:04:10",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3cd69y",
                  "author": "EffectiveLet2117",
                  "text": "Yes but what kind of clients do you service \n\n They are 2 different worlds",
                  "score": 1,
                  "created_utc": "2026-02-03 14:05:09",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3ceh64",
          "author": "Imaginary-Fuel-7804",
          "text": "saw the same but my agency is in the us",
          "score": 2,
          "created_utc": "2026-02-03 14:12:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3j0l74",
          "author": "AioliPublic3177",
          "text": "That matches what I’ve seen too. Europe still feels *way less saturated* compared to US/Canada, and buyers there actually read emails if the message is relevant and localized. Language + cultural context seems to act like a natural filter against spammy outreach.",
          "score": 2,
          "created_utc": "2026-02-04 13:39:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3j73zv",
              "author": "colinbyprospectai",
              "text": "100%!",
              "score": 1,
              "created_utc": "2026-02-04 14:14:22",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3w0bop",
          "author": "Live-Conference-1718",
          "text": "Seems like OP doesn't want to answer questions on how he's getting around the legal challenges...",
          "score": 2,
          "created_utc": "2026-02-06 12:12:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3czpr2",
          "author": "ConfusionDull2183",
          "text": "Email them in native language, then flip them to English?",
          "score": 1,
          "created_utc": "2026-02-03 15:58:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3d1jzh",
              "author": "colinbyprospectai",
              "text": "We email them on behalf of our clients that are in the specific language.",
              "score": 1,
              "created_utc": "2026-02-03 16:07:12",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3dv3a9",
                  "author": "ConfusionDull2183",
                  "text": "Are they then moving to English or keeping it in mother tongue?  Thanks",
                  "score": 1,
                  "created_utc": "2026-02-03 18:22:45",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3hkoom",
          "author": "SendPotionDotCom",
          "text": "I wonder what the reason behind this is",
          "score": 1,
          "created_utc": "2026-02-04 06:35:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3htdd0",
          "author": "More-Car9727",
          "text": "Cold outreach in native languages are always better",
          "score": 1,
          "created_utc": "2026-02-04 07:51:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3hwik8",
          "author": "Mobile-Ambition-3714",
          "text": "Cold outreach in Europe can be surprisingly fruitful if you get the personalization right and respect the local culture but it does mean staying sharp about legal boundaries since the rules are a bit stricter. Those reply rates make sense when you tap into that home market trust and actually talk like a real person instead of sounding like a bot. The trick is keeping it relevant and not just spraying out templated pitches which people are just numb to. Always worth double-checking your process for compliance so the good results don’t come back to bite you.",
          "score": 1,
          "created_utc": "2026-02-04 08:20:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3hysgj",
          "author": "After-Park-2477",
          "text": "Bullshit 😂",
          "score": 1,
          "created_utc": "2026-02-04 08:42:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ll9vm",
          "author": "Ambitious_Escape8867",
          "text": "Talk to me",
          "score": 1,
          "created_utc": "2026-02-04 20:58:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3ormni",
              "author": "colinbyprospectai",
              "text": "Shoot a dm if interested brother",
              "score": 1,
              "created_utc": "2026-02-05 09:03:32",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3tfefi",
                  "author": "Ambitious_Escape8867",
                  "text": "you shoot a dm if you are interested brother",
                  "score": 1,
                  "created_utc": "2026-02-06 00:33:53",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3vyahx",
          "author": "No-Remote1647",
          "text": "English speaking markets are way more saturated. Many EMEA markets are still a complete playground",
          "score": 1,
          "created_utc": "2026-02-06 11:57:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o44d8z3",
          "author": "kutchrodeo",
          "text": "Have you ran campaigns in Spain before?",
          "score": 1,
          "created_utc": "2026-02-07 18:27:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3cwe9n",
          "author": "grafikolabs",
          "text": "We run a Creative Studio in india and would love to connect with Eu businesses.",
          "score": 1,
          "created_utc": "2026-02-03 15:42:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3d1a3e",
              "author": "colinbyprospectai",
              "text": "If you have budget for a german based agency lets talk 😃",
              "score": 1,
              "created_utc": "2026-02-03 16:05:53",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3iig0l",
                  "author": "grafikolabs",
                  "text": "Sure we can discuss.",
                  "score": 1,
                  "created_utc": "2026-02-04 11:40:40",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3chk0y",
          "author": "Leather-Warthog-8076",
          "text": "We have a B2B startup focused on services such as email marketing, cold calling, demand generation and cold lead generation. We have one of our decision makers in the Europe but are major workflow comes from our team in India. Please DM me if we can be of any help.",
          "score": -1,
          "created_utc": "2026-02-03 14:28:43",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qxdf83",
      "title": "what we do to generate 200+ leads a month",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qxdf83/what_we_do_to_generate_200_leads_a_month/",
      "author": "Glass-Ad3933",
      "created_utc": "2026-02-06 09:48:28",
      "score": 15,
      "num_comments": 21,
      "upvote_ratio": 0.86,
      "text": "alright posting this because i keep seeing the same recycled advice everywhere and it honestly doesnt match what happens in real businesses, we run a b2b operation and cold email alone brings us **200 to 300 plus inbound leads every single month**, real companies in lending saas transportation manufacturing and marketing, not course buyers not wanna be founders, actual decision makers with budgets.\n\nthe first mistake people make is thinking cold email starts with copy, **it starts with who you target**, and for us that is always **c suite and executives only**, ceo founder co founder managing partner cfo head of growth director level minimum, anything below that just slows deals down and kills reply quality.\n\n**how we actually pull leads**  \nwe use **Apollo and RocketReach together**, never just one, inside apollo we go very specific, united states only, employee count usually **10 to 200**, industry filtered tight depending on the offer, then we layer titles like **CEO, Founder, Co Founder, Managing Partner, CFO, Head of Growth, Director**, then comes the most important part which most people skip, manual exclusions, we remove banks, credit unions, nonprofits, trucking associations, churches, foundations, anything that cant buy or needs a board vote.\n\nexample from last month, we targeted lending companies and pulled **12,400 contacts** initially, sounds great right, after exclusions and cross checking with rocketreach that list dropped to **6,100**, then after verification it dropped again to **3,900**, that smaller list outperformed every bigger list weve ever sent.\n\n**email verification is not optional**  \nwe dont trust one verifier ever, we run the list through our verifier then we break it down by provider, **gmail outlook yahoo corporate**, if gmail bounces even smell risky we kill the batch, we literally deleted **8,400 manufacturing leads** last month because early testing bounced too much, rebuilt a tighter list of **3,100 execs**, that list alone generated **47 replies and 11 booked calls**, this is where most people lose before they even send.\n\n**inboxes matter more than copy**  \nwe use **Puzzle Inbox, Slicey, and Premium Inboxes**, typical setup is **3 inboxes per domain** sending **15 to 20 emails per inbox per day**, so one domain does around **45 to 60 emails daily**, when we want to scale we dont touch volume we add domains, one saas campaign ran on **18 domains with 54 inboxes**, sending just under **900 emails per day**, deliverability stayed clean for weeks.\n\nif youre sending 100 emails from one inbox youre already done you just havent felt it yet.\n\n**sending tools**  \nwe rotate between **Instantly and Smartlead**, instantly when we want speed and simplicity, smartlead when reply routing matters more, no links no images no tracking pixels, plain text only, first email is intentionally simple and slightly confusing.\n\nexample first email that still works insanely well  \nhey john quick question are you the right person for partnerships at company name\n\nthats it.\n\n**copy that actually gets replies**  \nwe write like humans not marketers, structure is always **relevance credibility low pressure question**, one of our highest performing emails for a transportation company had a typo in the first line and still booked **9 calls in two weeks**, people reply to intent not perfection.\n\nexample  \nhey mike saw you run operations at a mid sized freight company and figured id ask  \nwe help transportation teams book inbound demos without hiring more sales people  \nopen to me sending over how it works or should i disappear\n\nno pitch deck no calendar link no pressure.\n\n**crm and reply handling**  \nwe keep it boring on purpose, **HubSpot or GoHighLevel**, every reply is tagged manually at first, positive neutral negative out of office unsubscribe, this is how patterns show up, last month we noticed **lending CEOs reply between 6am and 8am eastern**, while **saas founders reply late night around 9 to 11pm**, we adjusted send windows and reply volume jumped without changing copy at all.\n\n**real numbers so this doesnt sound like fluff**  \nmarketing agency campaign  \n**22,400 emails sent**  \n**312 total replies**  \n**84 positive replies**  \n**19 booked calls**  \n**4 closed deals**  \naverage deal size **7k monthly**\n\nfunding company campaign  \n**15,000 emails sent**  \n**61 replies**  \n**14 asked directly for options**\n\nall cold email.\n\nlast thing ill say is this, cold email is not dead and its not about tricks, **its about clean data slow sending boring copy and respecting the inbox**, if youre getting zero replies its not because the channel is broken its because something upstream is.\n\nhappy to answer questions but if your inbox setup is trash templates wont save you.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qxdf83/what_we_do_to_generate_200_leads_a_month/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o3vje4b",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-06 09:48:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3xgzt0",
          "author": "hollee-o",
          "text": "Lol. \n\nGullibles reading this: They are selling lead gen. if they were as successful doing this as claimed, why would they be here spending time sharing secrets? Hint: they wouldnt. They’d be too busy running their process printing money. \n\nThe absolute worst content hole on the web has long been and continues to be selling lead gen.",
          "score": 3,
          "created_utc": "2026-02-06 16:50:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o42q2im",
              "author": "Glass-Ad3933",
              "text": "why wouldnt i. some people think differently. stop hating :)",
              "score": 1,
              "created_utc": "2026-02-07 13:19:34",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o439hmg",
                  "author": "hollee-o",
                  "text": "stop hating spam that escalates everyone’s cost of acquisiton, enshitifies the internet and crams everyones consciousness with automated shit? start thinking different yourself.",
                  "score": 1,
                  "created_utc": "2026-02-07 15:10:54",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3vnsal",
          "author": "UbaidJoyzAI",
          "text": "what's your TOAS?\n\nall this setup and the money you burnt vs what you  closed?\n\n",
          "score": 2,
          "created_utc": "2026-02-06 10:29:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3vqvvh",
              "author": "Glass-Ad3933",
              "text": "i have around a 3-4x return.",
              "score": 2,
              "created_utc": "2026-02-06 10:56:56",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3ybhw7",
          "author": "Finners_GrowthStrat",
          "text": "What are you selling? I find that what you're actually selling influences which channels work well. We're selling consulting projects and haven't found much cold of anything to be that successful. Intros, referrals, people warmed up on social has been more successful, for us that is.",
          "score": 2,
          "created_utc": "2026-02-06 19:16:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3yn9p1",
              "author": "Glass-Ad3933",
              "text": "i sell lead gen",
              "score": 1,
              "created_utc": "2026-02-06 20:14:09",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3z22jz",
                  "author": "Finners_GrowthStrat",
                  "text": "Interesting. I assume then that you do lead gen for non-lead-gen businesses? Using the same method? What's the success rate of that? Same/better/worse? What's your typical client? What are they selling?\n\nSorry for all the questions just trying to build my understanding of what works/doesn't. Thanks.",
                  "score": 1,
                  "created_utc": "2026-02-06 21:28:06",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o421kyi",
              "author": "United_Parking_1683",
              "text": "Cold email tends to work best when youre selling something that already has a clear, budgeted pain. Lead gen fits that bill because execs can say yes without reworking internal processes. The same playbook usually performs worse for consultative or ambiguous offers where the problem isnt already acknowledged.",
              "score": 1,
              "created_utc": "2026-02-07 09:49:34",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3xeiym",
          "author": "AmphibianNo9959",
          "text": "For automating the discovery of those genuine conversations on Reddit as alternative channel, I use Leadmatically. It can find like more than 30 leads for one business. If you remove some irrelevant leads from them, I will still be way more than 200/month figure.",
          "score": 1,
          "created_utc": "2026-02-06 16:39:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o403x86",
          "author": "New_Grape7181",
          "text": "I've been running cold outreach for a while now and honestly your point about targeting being more important than copy is spot on. We had the same realisation about six months back.  \n  \nOne thing that's worked really well for us alongside email is layering in video messages to the people who respond positively. When someone replies saying \"yeah tell me more\" or asks a question, instead of another text email we send a quick personalised video walking through exactly what we mentioned. It's maybe 45 seconds, references their company specifically, and the conversion from interested reply to booked call went from around 30% to nearly 60% for us.  \n  \nThe reason it works is the same as your boring copy approach. It's human, low friction, and doesn't feel like you're being pushed through a sales machine.  \n  \nCurious though, when you get those positive replies back, are you jumping straight on a call or do you nurture them a bit first with more context?",
          "score": 1,
          "created_utc": "2026-02-07 00:55:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4090j9",
          "author": "kubrador",
          "text": "this is the kind of post that makes people go \"oh so i just need to do the actual work instead of buying another course\" and then never do it\n\n\n\nthe real tell is that you deleted 8,400 leads because they smelled wrong. most people would've sent them anyway and complained cold email doesn't work.",
          "score": 1,
          "created_utc": "2026-02-07 01:26:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o40car6",
          "author": "boomerific816",
          "text": "Are you posting to get hired? Or selling one of the tools you mention",
          "score": 1,
          "created_utc": "2026-02-07 01:46:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o413tnd",
          "author": "Aislot",
          "text": "this is one of the more grounded cold email breakdowns I’ve seen lately and the upstream point is dead on most people obsess over copy when the real damage is bad targeting bad data and burned inboxes also like the focus on execs only that alone filters a ton of noise first 50 customers are almost always founder driven anyway and cold email done like this is basically founder led distribution at scale keep pushing once this works referrals and warm intros usually start compounding on their own curious how you decide when to kill a campaign early versus letting it run longer",
          "score": 1,
          "created_utc": "2026-02-07 04:47:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ehuxs",
              "author": "Affectionate_Lab9365",
              "text": "The key thing here is restraint.Low volume per inbox, exec only targeting, manual exclusions thats the opposite of spray and pray.Cold email gets a bad reputation because most people skip those constraints and then blame the channel.",
              "score": 1,
              "created_utc": "2026-02-09 08:29:25",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4d66nu",
          "author": "Slight_Tutor1790",
          "text": "This reads less like a hack and more like a process discipline post. The part that stood out to me is how much filtering and killing happens before anything is sent. Most teams skip that patience step because it feels slow and expensive, but it seems like that is where most of the leverage actually comes from. Cold email usually fails quietly upstream and people only notice once they blame copy or tools.",
          "score": 1,
          "created_utc": "2026-02-09 02:37:14",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qwmset",
      "title": "anyone tried ai social listening tools for campaign tracking?",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qwmset/anyone_tried_ai_social_listening_tools_for/",
      "author": "Sorry_Team_3451",
      "created_utc": "2026-02-05 14:31:14",
      "score": 15,
      "num_comments": 37,
      "upvote_ratio": 0.94,
      "text": "i’m running a campaign next month and trying to avoid repeating a mistake from our last one.\n\nwe used pretty basic monitoring before, and by the time we caught sentiment turning negative, it was already too late to fix the messaging. this time, i’m looking for AI-powered social listening that can surface issues in hours, not days.\n\nwhat i actually need from a tool:\n\n* real-time sentiment (not daily summaries)\n* spike detection when something starts taking off\n* share of voice vs 3 main competitors\n* geographic breakdown across 5 markets\n* context-aware insights, not just keyword matching\n\ni keep hearing mixed things about Meltwater, especially around Mira that does automated insights but i haven't tried it.\n\ni’ve also looked at Brandwatch, Sprinklr, and cheaper options like Brand24 and Buzzsumo, but Meltwater seems to come up the most when people talk about “enterprise-grade” listening.\n\nfor those who’ve actually used Meltwater during an active campaign:\n\n* did it help you catch issues early, or was it still reactive?\n* where does it work really well, and where does it fall short?\n* how does it compare to Brandwatch or Sprinklr when things start moving fast?\n* what Meltwater metrics or insights have your leadership actually cared about?\n\nbudget isn’t unlimited, but we can justify spend if it genuinely helps teams react faster and avoid missed opportunities like last quarter.\n\ncurious to hear real experiences especially from people who’ve used Meltwater in the wild.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qwmset/anyone_tried_ai_social_listening_tools_for/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o3pzxbm",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-05 14:31:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3y6cok",
          "author": "daviswbaer",
          "text": "this looks an awful lot like astroturfing by the Meltwater team...\n\nThe odds that 2 separate human people say exactly \"used Meltwater during live campaigns\" is basically 0...\n\nIf anyoen needs a social listening tool from a real human team, I'm the founder of a social media management tool\n\nOur social listening feature supports Reddit, YouTube, X, and Bluesky (plus more to come)",
          "score": 4,
          "created_utc": "2026-02-06 18:51:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3q0q0g",
          "author": "flamefreeze_YT",
          "text": "I’ve used Meltwater during live campaigns and it helped more by giving early heads-ups than perfect insights. When you catch spikes and sentiment shifts fast enough you can just prevent it from snowballing uk? It’s not magic and still needs human judgment, but compared to basic monitoring it felt way less reactive, especially when things started moving quickly across channels.",
          "score": 2,
          "created_utc": "2026-02-05 14:35:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3q10ek",
              "author": "Sorry_Team_3451",
              "text": "alright definitely gonna try meltwater!",
              "score": 1,
              "created_utc": "2026-02-05 14:36:58",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3q1b1e",
                  "author": "flamefreeze_YT",
                  "text": "You should tbh...it's worked for me... definitely worth a try",
                  "score": 2,
                  "created_utc": "2026-02-05 14:38:30",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3q0vww",
          "author": "vermaharsh321",
          "text": "We’ve used Meltwater during live campaigns and it did help catch sentiment shifts early — especially with spike alerts and share of voice. Mira’s insights aren’t perfect, but they’re good enough to flag issues fast so a human can dig in. Definitely more proactive than basic monitoring.",
          "score": 2,
          "created_utc": "2026-02-05 14:36:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3q2sks",
              "author": "Sorry_Team_3451",
              "text": "okay I got it will give it a try!",
              "score": 1,
              "created_utc": "2026-02-05 14:46:13",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3q7k3f",
          "author": "ActuaryTall2681",
          "text": "Meltwater, Sprinklr and YouScan are very nice to keep track of topics and alert you when it starts increasing. What you need for proactive situations is to use the right methodology when creating the queries and the correct framework, and it helps if the tool alerts you when you reach a certain threshold (being impressions, interactions, volume of mentions, or sensibilty). But from my PoV, the key is to create correctly those parameters for the alerts, so you dont need to be checking a dashboard or jumping when it's too late. There are specific courses that can teach you that.",
          "score": 2,
          "created_utc": "2026-02-05 15:10:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3qd7cu",
              "author": "Sorry_Team_3451",
              "text": "but most of the people are recommending meltwater. I'll probably go for that.",
              "score": 1,
              "created_utc": "2026-02-05 15:37:56",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3q9not",
          "author": "CommunicationRare603",
          "text": "Meltwater's real-time alerts have been a game changer for us. We link social sentiment with media coverage so nothing slips through the cracks between different data sources.",
          "score": 2,
          "created_utc": "2026-02-05 15:21:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3qdhys",
              "author": "Sorry_Team_3451",
              "text": "gotcha! I'll give it a try",
              "score": 2,
              "created_utc": "2026-02-05 15:39:19",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3q1kz8",
          "author": "rainbow_dude98",
          "text": "That's a very cool observation. Have you tried any other tool other than these?",
          "score": 1,
          "created_utc": "2026-02-05 14:39:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3q37vv",
              "author": "Sorry_Team_3451",
              "text": "I think it will work for me I will try it for sure",
              "score": 1,
              "created_utc": "2026-02-05 14:48:26",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3q1l1r",
          "author": "yj292",
          "text": "used meltwater for a launch last year... caught sentiment shift 4-6 hours before we would've noticed manually\n\nspike detection solid if you configure thresholds right...\n\nmira good for exec summaries but context still shallow on nuanced criticism",
          "score": 1,
          "created_utc": "2026-02-05 14:39:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3q3uzn",
              "author": "Sorry_Team_3451",
              "text": "got a lot of positive responses on meltwater and mira. will definitely use it!",
              "score": 1,
              "created_utc": "2026-02-05 14:51:44",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3q2ti4",
          "author": "manithedetective",
          "text": "Yeah i've been using meltwater for a few months now, the real-time sentiment is solid, way better than waiting for daily rollups. We caught a product complaint thread picking up steam on reddit around hour 3 instead of finding out the next morning. Spike detection works but you gotta tune the thresholds or you'll get false alarms on random stuff, share of voice tracking is straightforward, does what it says.",
          "score": 1,
          "created_utc": "2026-02-05 14:46:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3q4ml7",
              "author": "Sorry_Team_3451",
              "text": "good to hear that information I think meltwater will work for me.",
              "score": 1,
              "created_utc": "2026-02-05 14:55:40",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3q4wla",
          "author": "Developer_Akash",
          "text": "yeah the real issue with most of those tools is they're built for brand tracking, not campaign speed. you're gonna need something that actually flags intent shifts and sentiment spikes in real-time across platforms, not just keyword volume. CatchIntent does exactly that - AI-powered detection across Reddit, Twitter, LinkedIn and catches problems hours before they blow up. happy to show you how it compares to Meltwater for your timeline if you wanna try it out.",
          "score": 1,
          "created_utc": "2026-02-05 14:57:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3qc690",
              "author": "Sorry_Team_3451",
              "text": "I'll keep this in mind let's see what works for me.",
              "score": 1,
              "created_utc": "2026-02-05 15:33:09",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3q8ynd",
          "author": "DudeWaitWut",
          "text": "What social platforms are most important for you to monitor?",
          "score": 1,
          "created_utc": "2026-02-05 15:17:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3qdeu6",
              "author": "Sorry_Team_3451",
              "text": "social listening majorly",
              "score": 1,
              "created_utc": "2026-02-05 15:38:55",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3s1wc0",
                  "author": "DudeWaitWut",
                  "text": "I meant like Reddit, Twitter, Facebook, etc. Is there a specific one(s) that is most important? There are some good dedicated platforms depending on what you're looking for. \n\nThreadlytics is good if you need Reddit monitoring, Share of Voice, competitive insights, contextual-keyword filtering, per keyword sentiment, etc. But it's Reddit only.\n\nMeltwater is going to be really expensive. Think tens of thousands per year, with annual commitments. \n\nSprout Social is okay. It does have social listening. Though the listening features are a bit basic compared to other platforms. Sprout's social listening feels like it's geared more for crisis or brand reputation monitoring rather than proactive social marketing. It's missing some of the more complex features like advanced contextual filtering, keyword-specific sentiment, etc.",
                  "score": 1,
                  "created_utc": "2026-02-05 20:19:13",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3qh5cg",
          "author": "Anurag6162",
          "text": "Oof, that too late to fix feeling is the worst I used one of the beefier platforms for a campaign last year, and the spike alerts and geo maps were legit so helpful Leadership loved the simple competitor dashboards pretty graphs always win budgets But a heads-up you still gotta check it regularly The AI can flag something fast, but you need a human to decide if it’s real trouble or just noise If your team can glance at it a few times a day, it’s an absolute game-changer for reacting in those first few hours",
          "score": 1,
          "created_utc": "2026-02-05 15:56:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3qjguv",
              "author": "Sorry_Team_3451",
              "text": "okay I get what you're saying I'll keep this in my mind next time.",
              "score": 1,
              "created_utc": "2026-02-05 16:06:50",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3vbovo",
          "author": "Drumroll-PH",
          "text": "I’ve used Meltwater and it’s solid for broad monitoring, but it’s not truly real time when things move fast it still feels slightly reactive. Brandwatch is better for live sentiment shifts and spike detection, especially during active campaigns, while Sprinklr shines if you need workflow and response coordination across teams. Leadership usually only cares about trend direction, spike alerts, and share of voice not the fancy AI summaries. If speed is the priority, Brandwatch first, Meltwater second.",
          "score": 1,
          "created_utc": "2026-02-06 08:34:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3wihlx",
              "author": "Sorry_Team_3451",
              "text": "thank you for assisting I'll try meltwater for sure",
              "score": 1,
              "created_utc": "2026-02-06 14:01:39",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3xq986",
          "author": "Abhi_deep",
          "text": "Real-time alerts and spike detection are definitely stronger on the more advanced platforms but you still need to babysit the setup if you want issues surfaced in real-world speed. Most of these tools push out a ton of data and it’s easy to drown in it if your alert rules and keyword groups aren’t tight. As for metrics, leadership tends to care about share of voice and sentiment graphs especially when compared to competitors so those dashboards get the most eyeballs. Honestly nothing is truly set-and-forget but with some tuning these tools can give you a fighting shot at spotting trouble before it’s all over social.",
          "score": 1,
          "created_utc": "2026-02-06 17:35:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4f9jnb",
              "author": "Sorry_Team_3451",
              "text": "i get it but which tool do you suggest? i've heard a lot about meltwater.",
              "score": 1,
              "created_utc": "2026-02-09 12:40:03",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o42lq3n",
          "author": "ActuaryTall2681",
          "text": "NewsWhip is great! you should take a look at it. It is focused on crisis prevention and detection on media and its impact on SoMe, but they recently partnered with a social listening tool so they should cover social media as well..",
          "score": 1,
          "created_utc": "2026-02-07 12:50:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3q6job",
          "author": "Loud-Commercial-3386",
          "text": "I built a small thing called GoAlche for myself for this. It watches reddit conversations and helps catch issues, competitor mentions, and when people are clearly looking to buy. it’s been handy, at least for me",
          "score": 0,
          "created_utc": "2026-02-05 15:05:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3qc9t3",
              "author": "Sorry_Team_3451",
              "text": "omg okay I got it.",
              "score": 1,
              "created_utc": "2026-02-05 15:33:36",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qyjr9s",
      "title": "What is a Digital Sales Room and when does it make sense to use one?",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qyjr9s/what_is_a_digital_sales_room_and_when_does_it/",
      "author": "SmythOSInfo",
      "created_utc": "2026-02-07 17:27:55",
      "score": 14,
      "num_comments": 6,
      "upvote_ratio": 1.0,
      "text": "I’ve been hearing the term Digital Sales Room more often lately and I’m trying to understand what it really means in practice, not just the definition.\n\nFrom what I gather, it’s a shared space where buyers can review proposals, decks, pricing, and next steps instead of everything being scattered across emails and attachments. Some tools like Trumpet seem to focus on keeping the entire post-demo experience in one place.\n\nFor people who’ve used a Digital Sales Room, how would you explain it in simple terms? When does it actually add value, and when is it overkill?\n\nWould love to hear how people are using them in real sales workflows.",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qyjr9s/what_is_a_digital_sales_room_and_when_does_it/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o4417mc",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-07 17:27:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o445mu7",
          "author": "CommonReasonable2998",
          "text": "So imagine you have sent in the proposal and decks to the customer over on email as an attachment, there will be no visibility, if it was accessed/viewed.\n\nWith digital sales room, how time and who spent time on them becomes visible.\nYou can take your next steps accordingly.\n\nI have used aligned and dock in my work.\nIf you have long sales cycle and multiple stakeholders, it makes sense to use a sales room.",
          "score": 2,
          "created_utc": "2026-02-07 17:49:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o44ryy3",
              "author": "Responsible-Brick881",
              "text": "Well there are and have been solutions to tell you this for quite some time - i was using clearslide more than 10 years ago which I could send in an email as a link and would tell me when and for how long a client had accessed it so its not completely new!\n\nHowever, i do like the sounds of this digital sales room though as it sounds like the next stage of this.",
              "score": 1,
              "created_utc": "2026-02-07 19:41:27",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o47bady",
          "author": "murtuza78",
          "text": "Think of a digital sales room as a shared workspace for deals where everything buyers need sits in one spot—proposals, decks, price details, timelines, all that. It keeps things organized and you can see who’s actually looking at what so you’re not just guessing if your follow-up emails are being ignored or not. Makes the most sense for longer deals with multiple people involved, not really worth it for quick, one-off sales. It’s handy for keeping everyone on the same page and keeping the whole process moving without losing stuff in email threads.",
          "score": 1,
          "created_utc": "2026-02-08 04:49:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4i60nd",
          "author": "erickrealz",
          "text": "It's basically a shared webpage where your buyer sees everything in one place instead of digging through email threads. Proposals, pricing, contracts, all of it.\n\nIt makes sense when you're selling to buying committees with multiple stakeholders. Keeps everyone aligned without playing telephone. For simple one-call closes it's total overkill though.\n\nIf your average deal involves 3+ decision makers and a long sales cycle, it's worth trying. Anything simpler and you're just adding crap nobody asked for.",
          "score": 1,
          "created_utc": "2026-02-09 21:31:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o45roxp",
          "author": "carrzo",
          "text": "Like many tools they are exceptional when used, really good visibility into who ELSE at the prospect company is looking at what materials and for how long. Also help when a deal is rekindled after going cold simply turn the access back on (you can set expiration dates for access, most default to 30 days).\n\nAlso can be good for completed deals when turned over to implementation teams as materials, contracts and even call recordings are in one place.\n\nHighly recommend.",
          "score": 0,
          "created_utc": "2026-02-07 22:55:17",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r02m3o",
      "title": "My friend spent $2,000 on Reddit Ads for his SaaS. Here is the honest ROI breakdown.",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1r02m3o/my_friend_spent_2000_on_reddit_ads_for_his_saas/",
      "author": "aashrun",
      "created_utc": "2026-02-09 12:13:35",
      "score": 12,
      "num_comments": 6,
      "upvote_ratio": 0.88,
      "text": "Everyone says \"Reddit Ads are cheap.\"\n\nEveryone also says \"Redditors hate ads.\"\n\nSo I decided to talk to this guy who burnt $2,000 to find out which is true.\n\nHere is the exact breakdown of his campaign for a B2B SaaS tool.\n\n# The Campaign Setup\n\n* **Budget:** $2,000\n* **Duration:** 30 days\n* **Targeting:** Subreddits (r/marketing, r/entrepreneur, r/sales)\n* **Creative:** 3 variations (Meme style, \"Native\" text style, Standard banner)\n\n# The Metrics (The Good, The Bad, The Ugly)\n\n**1. Impressions (The Good)**\n\n* **CPM:** $4.50 (Cheaper than LinkedIn's $30+ CPM)\n* **Total Impressions:** \\~440k\n* *verdict:* Reaching people on Reddit is incredibly cheap.\n\n**2. Clicks (The Bad)**\n\n* **CPC:** $0.85\n* **CTR:** 0.52%\n* *verdict:* Getting clicks isn't hard, but it's not \"high intent.\" A lot of fat-finger clicks or curiosity clicks.\n\n**3. Conversion (The Ugly)**\n\n* **Signups:** 14\n* **CAC:** $142.85\n* **Paying Customers:** 1\n* **ROI:** \\-85%\n\n# The \"Oh Sh*t\" Realization 💡\n\nWhile the ads were running, he spent 20 minutes a day manually commenting on threads in the *same* subreddits.\n\n* **Cost:** $0\n* **Time:** 10 hours total\n* **Signups:** 42\n* **Paying Customers:** 6\n\n**The Difference?**\n\n**Trust.**\n\nOn Reddit, an ad is an interruption.\n\nA comment is a contribution.\n\nWhen he tried to \"scale\" with ads, he lost the one thing that made Reddit work: **Authenticity.**\n\n# Key Lessons for SaaS Founders\n\n1. **Banner Blindness is Real:** Redditors are pro-level scrollers. Unless your ad looks *exactly* like a post, they skip it.\n2. **Comments > Creatives:** The \"real\" ad slot on Reddit isn't the feed. It's the comment section. That's where decisions are made.\n3. **Intent Mining vs. Interruption:** Ads target *demographics* (people interested in marketing). Comments target *intent* (people asking \"how do I do marketing?\"). The latter converts 10x better.\n\n# Conclusion\n\nIf you have a venture budget and need brand awareness? Sure, Reddit Ads are cheap eyeballs. If you are bootstrapping and need **customers**? Keep your wallet closed. Open the comment section instead.\n\n\n\n**Has anyone else cracked the code on Reddit Ads for B2B? Or is it just a graveyard for ad spend?**",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1r02m3o/my_friend_spent_2000_on_reddit_ads_for_his_saas/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o4f5yia",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-09 12:13:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ig4kq",
          "author": "Kamel_Ben_Yacoub",
          "text": "Most advertisers don't understand placements on Reddit ads. If you want to get results, this starts with understanding how targeting and placement works.\n\nAudience Targeting:\n\n* Communities: Highly relevant targeting if you're targeting qualified communities because they are native users.\n* Keyword: Traffic could be from non-native Reddit users (e.g., Google search), so depending on the keywords used, the quality could be not as relevant as communities.\n* Interest: Too broad, not worth testing it.\n\nAds Placement:\n\n* Conversation: Conversations attract both native and non-native Reddit users who find posts through referrals from organic search and AI suggestions. These platforms don't link people to Reddit communities. They link people to the exact posts that answer their question.\n* Feed (the home and community feeds with various posts): Mostly native users and overall ads are more visible than conversation.\n\nConversation Ads look quite small and traffic is not as relevant as feed ads placement for communities. I usually like to use this placement for remarketing audiences or keyword targeting to be sure I have more qualified traffic. When people search on Google and land on Reddit threads, intent is higher so Conversation ads can work better.\n\n**If you enable both placements, most of your budget flows to Conversation Ads because the CPM is cheaper.**\n\nMy go-to setup:\n\n* Communities with Feed placement only.\n* Keyword targeting or Remarketing with Conversation ads placement.",
          "score": 3,
          "created_utc": "2026-02-09 22:22:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4gjjpv",
          "author": "techmars1996",
          "text": "I got the exact same results with the same amount of money.",
          "score": 1,
          "created_utc": "2026-02-09 16:49:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ibdxk",
          "author": "AffableSparsh",
          "text": "Really well put.",
          "score": 1,
          "created_utc": "2026-02-09 21:58:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4kwmg2",
          "author": "kkgohel",
          "text": "Awesome. I didn't try reddit ads. But interested into.",
          "score": 1,
          "created_utc": "2026-02-10 07:58:04",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qxsr9k",
      "title": "Came back from CES feeling defeated",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qxsr9k/came_back_from_ces_feeling_defeated/",
      "author": "Fearless-Flan-880",
      "created_utc": "2026-02-06 20:21:58",
      "score": 11,
      "num_comments": 7,
      "upvote_ratio": 0.87,
      "text": "Went to CES in Vegas and I can’t shake this strange feeling about it.\n\n It wasn’t a disaster at first. We had good conversations lots of scanned badges even booked follow ups. But when I look back at the week, it’s hard to pinpoint  anything concrete that actually moved.\n\nWhat messed with me was watching how different people experienced the same event. Some reps looked fried by day two sprinting booth to booth. Others were oddly calm, ducking out for coffees not stressing at all.\n\nI keep wondering if that calm comes from experience or if they just did the work before hopping on the plane. This was my third big show and I still feel like I’m guessing half the time.\n\nTips and tricks from experienced people would be more than welcome",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qxsr9k/came_back_from_ces_feeling_defeated/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o3you4y",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-06 20:21:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3z3fj4",
          "author": "NoKale8220",
          "text": "I have to agree on this one and I think that calm comes from knowing who you want to talk to before even landing. Some teams get there via internal lists, some glance at attendee data from places like PullAList before the show.",
          "score": 4,
          "created_utc": "2026-02-06 21:34:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3yqjl3",
          "author": "Embarrassed_Dare_180",
          "text": "Completely normal. The contrast you’re describing exists, the calm people aren’t trying to win the event they’re executing a plan, at least that's how it feels or they're just too rich and don't really care about any of it.",
          "score": 2,
          "created_utc": "2026-02-06 20:30:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o408mli",
          "author": "kubrador",
          "text": "the calm ones probably pre-qualified their list instead of treating the show floor like a slot machine. also they're not counting badges like badges convert to revenue.",
          "score": 1,
          "created_utc": "2026-02-07 01:23:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o45gg9d",
          "author": "CompetitiveTry346",
          "text": "Very normal feeling.  We do three months in two months after campaigns  and either pull lists from vendors, scrape social from last year’s events, or do local or icp campaigns to book meetings there or Atleast try and get recognizable when there.  It’s tough to run booth to booth cold at events.  Been there plenty of times and it’s exhausting and more spinning your wheels than getting anywhere.",
          "score": 1,
          "created_utc": "2026-02-07 21:52:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o48d1ag",
              "author": "Rounak147",
              "text": "Yeah this is an awesome strategy. We just built an AI agent for our client that reaches out to 1000s of past prospects and new leads to book meetings at trade shows a couple weeks beforehand.",
              "score": 1,
              "created_utc": "2026-02-08 10:28:23",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qywz8q",
      "title": "I sent 1 billion cold emails in Jan 2026…",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qywz8q/i_sent_1_billion_cold_emails_in_jan_2026/",
      "author": "Calm_Professor_1989",
      "created_utc": "2026-02-08 02:33:25",
      "score": 11,
      "num_comments": 17,
      "upvote_ratio": 0.87,
      "text": "You people need to get a grip on reality. Too much BS on here. ",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qywz8q/i_sent_1_billion_cold_emails_in_jan_2026/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o46r0i2",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-08 02:33:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o47bk1l",
          "author": "reasonwashere",
          "text": "“I’m a self proclaimed spammer. AMA.”",
          "score": 9,
          "created_utc": "2026-02-08 04:51:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o46rbzx",
          "author": "James2504",
          "text": "I find it strange that cold emailing is 85% of the tactic discussed on this sub.",
          "score": 4,
          "created_utc": "2026-02-08 02:35:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4d58c5",
          "author": "Slight_Tutor1790",
          "text": "Honestly the funniest part is how volume became the headline instead of intent. At some point cold email stops being a channel and turns into background noise that trains buyers to ignore everything. A tiny list with real relevance usually beats industrial scale every time. The math only looks impressive until you look at the human on the other side.",
          "score": 4,
          "created_utc": "2026-02-09 02:32:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4a1r0h",
          "author": "CommentWinter5930",
          "text": "How many responses did you get ??",
          "score": 2,
          "created_utc": "2026-02-08 16:56:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ctdyw",
              "author": "Calm_Professor_1989",
              "text": "Just one. I think I’ll tweak the subject line next time.",
              "score": 1,
              "created_utc": "2026-02-09 01:30:11",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4cg70l",
          "author": "Alone_Ad_3375",
          "text": "that's a rookie number, \"i sent 7 Billion emails in January and made $1 every email\"",
          "score": 2,
          "created_utc": "2026-02-09 00:15:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4dbx9l",
          "author": "Gold-Region-2166",
          "text": "Cold emails on that scale are like shouting into a void and hoping for a handshake. At some point, it stops being outreach and turns into pure noise. Would love to know if you got anything besides a sore click finger and some angry replies. The tactic is getting old, results matter way more than raw numbers.",
          "score": 2,
          "created_utc": "2026-02-09 03:07:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o48g77o",
          "author": "emma-clarke1",
          "text": "So what were the actual results? How many responses did you get?",
          "score": 1,
          "created_utc": "2026-02-08 10:58:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o49uv31",
              "author": "Ambitious-Map5299",
              "text": "i think its a satire,  how can one send 1 billion cold mails ",
              "score": 3,
              "created_utc": "2026-02-08 16:23:35",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o49c3qp",
          "author": "jroberts67",
          "text": "People on this sub constantly pitching cold emails are all 32 living with their parents. ",
          "score": 1,
          "created_utc": "2026-02-08 14:47:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o49ukgu",
          "author": "Ambitious-Map5299",
          "text": "i agree with you man ",
          "score": 1,
          "created_utc": "2026-02-08 16:22:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4a6v25",
          "author": "Existing-Board5817",
          "text": "1B? come on!\n\nI do it all on autopilot, I prefer LinkedIn, I do it with Starnus and max I do 200-300 reach outs per week and get 8-15 meetings",
          "score": 1,
          "created_utc": "2026-02-08 17:21:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4awt7i",
          "author": "Alternative-Cake3773",
          "text": "Hahaha! Insane in the membrane!",
          "score": 1,
          "created_utc": "2026-02-08 19:23:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4axdej",
          "author": "Silly_Newt4788",
          "text": "And?",
          "score": 1,
          "created_utc": "2026-02-08 19:26:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4dij9i",
          "author": "catmambo",
          "text": "Fcking don’t….",
          "score": 1,
          "created_utc": "2026-02-09 03:45:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4gbioq",
          "author": "unicorn69love",
          "text": "cold emailing dominates this sub but most of its straight spam qualify leads first or gtfo. clienthunters ai nails that by scraping real prospects and personalizing sequences, cut my bs ratio in half no cap",
          "score": 1,
          "created_utc": "2026-02-09 16:10:56",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qydv6m",
      "title": "I need ur help!! Its urgent ‼️",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qydv6m/i_need_ur_help_its_urgent/",
      "author": "Dangerous-Soil6167",
      "created_utc": "2026-02-07 13:31:05",
      "score": 11,
      "num_comments": 29,
      "upvote_ratio": 0.93,
      "text": "Hey guys, I’m about to take a major decision pls help me validate my idea:\n\nAs a saas company founder would you be interested in something like this?\n\n\\- if someone can help you create a full fledged educational course of your product then get YT influencers + LinkedIn influencers to promote that course.\n\nThis way you can get people to know not just about your product but the use cases as well.\n\nWhat do u think of this offer?\n\nWould you be interested in going for something like this?",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qydv6m/i_need_ur_help_its_urgent/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o42rw8y",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-07 13:31:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o42wuv5",
          "author": "pawsomedogs",
          "text": "So a founder would need to pay you for your service (creating and deploying the course), and then pay the influencers for their service (promoting the course)? \n\nSounds expensive, and where is the proof this could work?",
          "score": 2,
          "created_utc": "2026-02-07 14:00:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o42xf21",
              "author": "Dangerous-Soil6167",
              "text": "We did this for a company and got them over millions of views and 300K+ people inside their community witj 10K+ paid sign ups in the first day of launch. \n\nWe charged $90K for this. (Doesn’t include influencers)\n\nAs per influencers they had a budget of $30K only on LinkedIn so we did a massive launch each of the influencers got over 100K+ views with the lead magnet formula. \n\nThe company had a solid funding. \n\nSo now we are planning to offer the same.",
              "score": 1,
              "created_utc": "2026-02-07 14:04:06",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o42yegg",
                  "author": "Radiant-Security-347",
                  "text": "10k paid users day one? Very doubtful.\n\nThis is such a trend created by online “influencers” that tell people to wildly exaggerate their experience and results. To the point where it’s not even close to believable for anyone who has been in the business for years.\n\nThey aren’t fooling anyone. ",
                  "score": 1,
                  "created_utc": "2026-02-07 14:09:45",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o43vltc",
                  "author": "bacchus32x",
                  "text": "This is a pure lie.\n\nWhy would you ask for market validation on reddit when you have first hand market validation?",
                  "score": 1,
                  "created_utc": "2026-02-07 17:00:11",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o48agn6",
                  "author": "PearlsSwine",
                  "text": "Sorry, no way those numbers are true. Getting 10,000 paid users in 24 hours is unheard of. You're lying. ",
                  "score": 1,
                  "created_utc": "2026-02-08 10:04:12",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o44mfg0",
          "author": "yngbld5",
          "text": "As SaaS founder, it would depend on my target market and buyers of that product, as well as the influencers.  It seems it would have more potential in DTC than B2B.  But the value of the video content goes well beyond your isolated use case.",
          "score": 2,
          "created_utc": "2026-02-07 19:12:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o453q8b",
          "author": "Own-Skin-354",
          "text": "I’ll be honest... most SaaS founders won’t buy “course + influencers” as a package. Not because it’s a bad idea, but because it’s framed wrong.\n\nCourses don’t create demand by default. Distribution and buyer intent do.\n\nA few things to pressure-test:\n\n• Is this for top-of-funnel education or bottom-of-funnel adoption? Those are two different plays.  \n• Who is the course actually for- users, buyers, or implementers?  \n• Why would an influencer promote a product course vs a problem-led learning asset?  \n• How will you tie this to pipeline, not just views?\n\nWhat *does* work: problem-first education → use-case walkthroughs → proof → then product.\n\nIf you position it as “category education with embedded product workflows” instead of “product course,” your odds go way up.\n\nTest it with 3 to 5 founders first before productizing it. You’ll get your real answer there.",
          "score": 2,
          "created_utc": "2026-02-07 20:44:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o47q2o0",
              "author": "Dangerous-Soil6167",
              "text": "Hey this was super helpful thank u very much",
              "score": 1,
              "created_utc": "2026-02-08 06:52:58",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o42u475",
          "author": "Voltalyze",
          "text": "This would be very handy for those in need. If you can do that in an efficient way that would end up bringing qualified leads, it would be a great thing. \n\nVery good idea!\n\n Just be cautious how you display your ideas online -with a few prompts made with ChatGPT, any SaaS can be replicated easily. \n\nBest of luck",
          "score": 1,
          "created_utc": "2026-02-07 13:44:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o43lo26",
          "author": "Lopsided_Doubt5803",
          "text": "I can help in delivering YT and LinkedIn videos.Also will help in providing help in connecting influencers for the two platforms to promote your course.",
          "score": 1,
          "created_utc": "2026-02-07 16:11:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o43q1b5",
              "author": "Dangerous-Soil6167",
              "text": "Hey dm me pls",
              "score": 1,
              "created_utc": "2026-02-07 16:32:51",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o45wd4a",
          "author": "BeingAppropriate9674",
          "text": "Yes, It's a great idea",
          "score": 1,
          "created_utc": "2026-02-07 23:22:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4d06ed",
          "author": "Key_Data_4416",
          "text": "Educational content is honestly a sleeper move for SaaS since it solves the “how do I actually use this” problem before someone even signs up. My only worry with relying purely on influencers is that you're often paying for broad reach rather than specific intent.",
          "score": 1,
          "created_utc": "2026-02-09 02:06:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4d4hsn",
          "author": "Slight_Tutor1790",
          "text": "From a SaaS side, I would look at this less as marketing and more as activation and retention. A solid course can shorten time to value, reduce support load, and give sales a clear proof asset. If you can tie it to activation lift, feature adoption, or expansion after launch, the spend becomes easier to justify. Influencers then act as distribution for a learning asset, not the product itself, which may land better with teams focused on pipeline quality.",
          "score": 1,
          "created_utc": "2026-02-09 02:28:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ecsah",
          "author": "Gorilyft",
          "text": "Why not",
          "score": 1,
          "created_utc": "2026-02-09 07:40:24",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r0173h",
      "title": "What AI tools are you actually using daily?",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1r0173h/what_ai_tools_are_you_actually_using_daily/",
      "author": "nicofromprontohq",
      "created_utc": "2026-02-09 10:54:42",
      "score": 10,
      "num_comments": 19,
      "upvote_ratio": 1.0,
      "text": "Everyone's hyped about AI but hard to know what's actually useful. Looking for feedback from real people working in marketing who actually unlock new use case with AI. Thanks!",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1r0173h/what_ai_tools_are_you_actually_using_daily/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o4ewn3k",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-09 10:54:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ey0b4",
          "author": "emma-clarke1",
          "text": "i use ChatGPT for ideation, research & drafts. also some automation tools like Gumloop and Zapier",
          "score": 1,
          "created_utc": "2026-02-09 11:07:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ez4f4",
          "author": "GTMSignals",
          "text": "I am using Chatgpt for content drafting and perplexity for research part",
          "score": 1,
          "created_utc": "2026-02-09 11:17:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4f0btg",
          "author": "iram_shaikh_",
          "text": "I use ChatGPT for ideas and writing, and Perplexity for quick research. Both help a lot every day.",
          "score": 1,
          "created_utc": "2026-02-09 11:27:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4f5ts4",
          "author": "SergiePoe",
          "text": "I use Claude inside a workspace to offload routine stuff, like not writing meeting summaries myself or getting reminders about upcoming meetings - handling small operational tasks. And for marketing-related things, an AI agent helps a lot: it analyzes users who sign up for my product and gives me a concise summary about them, some key insights, so I can then do warm outreach.",
          "score": 1,
          "created_utc": "2026-02-09 12:12:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4g35d1",
          "author": "Intrepid_Boss9449",
          "text": "I use SocListener daily to find sales leads on Reddit and it saves me a ton of time by auto-generating comments and DMs that actually get responses. If you’re doing marketing on Reddit, it’s worth checking out to unlock new ways to engage without spending hours searching posts. Other than that, simple AI tools for content ideas and scheduling are my go-tos.",
          "score": 1,
          "created_utc": "2026-02-09 15:30:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4g5qcr",
          "author": "Dangerous_Bowler3286",
          "text": "For me, the only AI I actually use daily is around sales and email outreach, not random shiny tools.\n\nI run an agentic AI setup specifically for email campaigns, and that’s where I’ve seen real impact.\n\nThe system handles the heavy lifting: multiple inboxes, dedicated domains, warm-ups, safe send limits, inbox rotation, and verified contacts before anything goes out. Emails are personalized automatically, follow-ups run on their own, and inbox health is watched so things pause before issues happen.\n\nThe AI isn’t “writing magic copy”  it’s managing execution cleanly at scale.\n\nCurious what others are actually using AI for that saves time, not just demos.",
          "score": 1,
          "created_utc": "2026-02-09 15:43:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4gw3vd",
              "author": "Muted_Grass_9879",
              "text": " Can you tell more about this setup??",
              "score": 2,
              "created_utc": "2026-02-09 17:48:52",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4h6kod",
          "author": "Alone_Ad_3375",
          "text": "honestly I am using coldemailkit along with claude everyday",
          "score": 1,
          "created_utc": "2026-02-09 18:37:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4hfn7x",
          "author": "DudeWaitWut",
          "text": "Claude and Perplexity. Claude for idea generation, content outlines, deep research, etc. Perplexity for quick answers.",
          "score": 1,
          "created_utc": "2026-02-09 19:20:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4k1rf2",
          "author": "Hereemideem1a",
          "text": "I use Vomo pretty much daily for meetings and internal syncs. It records or takes uploaded audio and gives me clean notes, summaries, and action items I can drop right into briefs or CRM.",
          "score": 1,
          "created_utc": "2026-02-10 03:52:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4kpe5k",
          "author": "The-FrozN",
          "text": "Depends. What would you use it for? For me, I use fiddlart to make UGC, social ads, product visuals and short videos for my clients.",
          "score": 1,
          "created_utc": "2026-02-10 06:51:25",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qus7hb",
      "title": "B2B Business Owner looking for Marketing Advice",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qus7hb/b2b_business_owner_looking_for_marketing_advice/",
      "author": "arjunmurali1993",
      "created_utc": "2026-02-03 13:41:01",
      "score": 9,
      "num_comments": 13,
      "upvote_ratio": 0.92,
      "text": "A quick intro about my business. I run a garment manufacturing company in India and we have an excellent setup (stitching factory owned by my business partner). We already do a ton of corporate orders, orders for brands and so on within India through B2B platforms like Indiamart, Justdial and we also run some Google Ads within India to get leads. We have a good technical sales team who convert these leads to orders.\n\nAt the moment, our order size typically averages in the hundreds to a few thousand units. However, we have to confirm and execute about 10 to 15 orders each month just to cover our monthly overheads.\n\nI want to start targeting bigger customers like clothing brands from Europe, Australia, etc. to grow the order volume significantly.\n\nI'm sure the decision makers of these brands aren't actively searching for manufacturers in Google so Google Ads and SEO might not be the right channel for us.\n\nI've read quite a lot on how cold emails work starting from data gathering and enrichment through Clay or other data sources followed by sending using platforms like Instantly. I can personally try it out myself and learn and improve and go ahead but I'm not too keen on that. I would rather prefer paying an agency who know what they are doing.\n\nWill cold emails work for our scenario?  \nWhat are the things I should look for when hiring an agency to handle cold emails for our business?\n\nIf not, should I look at LinkedIn marketing or other channels?   \n  \nI know I have everything in my business primed for success, and proper marketing seems to be the last missing piece of the puzzle that I really want to crack.",
      "is_original_content": false,
      "link_flair_text": "Support",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qus7hb/b2b_business_owner_looking_for_marketing_advice/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o3c8sye",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-03 13:41:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3coe33",
          "author": "Intrepid_Boss9449",
          "text": "Cold emails can work but only if the agency really knows your niche and can get you good quality leads, not just spammy lists. When hiring, ask for proof of past success with B2B garment or fashion brands and how they handle follow-ups. \n\nLinkedIn might be better for targeting decision makers in Europe and Australia since it’s more professional and you can build relationships over time.",
          "score": 2,
          "created_utc": "2026-02-03 15:04:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3fxbdh",
          "author": "Responsible-Brick881",
          "text": "Have you tried any kind of advertising in the past?",
          "score": 1,
          "created_utc": "2026-02-04 00:23:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3glcgz",
          "author": "OkDependent6809",
          "text": "talk to your biggest customers first and ask how they found you and why they picked you\n\nthis will tell you way more than guessing at cold email or linkedin. international brands probably buy differently than domestic ones\n\nmost agencies will just spam generic emails. save your money until you understand how your target customers actually make buying decisions",
          "score": 1,
          "created_utc": "2026-02-04 02:37:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3hwurj",
          "author": "ObjectiveFerret9017",
          "text": "Cold outreach can get you in front of some European or Australian brand folks but response rates are pretty rough unless the messaging feels truly personal and you understand their pain points. If you’re hiring an agency I’d press them hard on how they source and qualify leads plus how they handle warm follow ups without coming off spammy. LinkedIn is usually better for opening a door and trading some real conversation before trying to close anything, especially in B2B apparel where relationships drive trust. Honestly if you have a strong visual story or case studies, sometimes just DMing or commenting thoughtfully on relevant posts can get you further than blasting a thousand cold emails.",
          "score": 1,
          "created_utc": "2026-02-04 08:23:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ng57j",
          "author": "whskme",
          "text": "I happened to come across this post and coincidentally we are exactly what we are looking for. We run a LinkedIn & Email Outbound Agency with a core expertise in GTM (creating a targeted list of companies who are likely to buy from you) \n\nShoot me a DM and let’s talk",
          "score": 1,
          "created_utc": "2026-02-05 02:56:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3odnlc",
          "author": "Crazy-Ask-3510",
          "text": "If you want serious buyers then go participate in trade shows in those countries \n\nThat’s the strategy  most apparel companies who export get their initial set of Clients\n\nP.s I run a business with exposure to US and UK clients partly",
          "score": 1,
          "created_utc": "2026-02-05 06:53:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3p7gnk",
          "author": "Desperate_Pop_1578",
          "text": "Oh man, so I’m *super* new to all this marketing stuff (I’m literally in the middle of launching my first integrated campaign, so take this with a grain of salt) but here’s what I’d probably do if I were you: skip the fancy campaign for now and just chase referrals. Like, is there *anyone* in your current customer base who could hook you up with a bigger player? Or maybe someone in your network who can make an intro? That first customer is always the hardest to land, but once you’ve got one, you can ride that word-of-mouth wave and use their success story to open doors with others.\n\nHonestly, at this stage, I’d lean more into a sales approach than a full-blown marketing one. Like, just get that first win however you can, and then you can build from there. It’s way easier to sell when you’ve got a happy customer singing your praises. Just my two cents, still figuring this out myself, so grain of salt and all that!",
          "score": 1,
          "created_utc": "2026-02-05 11:30:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3utr0l",
          "author": "New_Grape7181",
          "text": "I've worked with a few manufacturing businesses trying to crack international markets, and cold email can work but there's a catch with your specific situation.  \n  \nThe challenge is that clothing brands typically have existing manufacturer relationships and switching costs are high (quality control, minimum orders, logistics). Cold email works best when you're solving an active problem, but most brands aren't actively looking to change manufacturers unless something's gone wrong.  \n  \nWhat I've seen work better is a two-step approach. First, identify brands that are actually in buying mode like new sustainable fashion labels, brands expanding into new product lines, or companies posting jobs for production managers. These are real signals they might need new manufacturing partners.  \n  \nSecond, instead of just email, try sending a short personalised video showing your factory floor, quality control process, or a similar product you've made. It builds trust way faster than text when you're asking someone to trust you with their entire production. Brands need to see your capabilities, especially when you're overseas.  \n  \nLinkedIn could work too, but I'd focus on building relationships with production managers and supply chain people rather than just cold pitching founders.  \n  \nHave you got any case studies or samples from your existing brand work that you could showcase?",
          "score": 1,
          "created_utc": "2026-02-06 05:55:17",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r030nv",
      "title": "I realized cold email wasn’t failing, our b2b go-to-market was",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1r030nv/i_realized_cold_email_wasnt_failing_our_b2b/",
      "author": "GrowthWithNina",
      "created_utc": "2026-02-09 12:33:54",
      "score": 8,
      "num_comments": 31,
      "upvote_ratio": 0.83,
      "text": "for a long time, we treated cold email like a copy problem. better subject lines, more personalization, more follow-ups.\n\nit barely moved replies.\n\nwhat clicked later was simple: buyers don’t live in one channel.\n\nthey see your name on linkedin.  \nthey notice you in comments.  \nthey recognize it later in their inbox.\n\nemail works better once there’s *some* familiarity.\n\nnot pitching everywhere, just showing up consistently so the second or third touch doesn’t feel cold anymore.\n\nit made me rethink b2b outreach as a system, not a channel.\n\ncurious how others here think about this:  \ndo you still see single-channel outreach working, or has multi-touch become table stakes in b2b?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1r030nv/i_realized_cold_email_wasnt_failing_our_b2b/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o4f8oc7",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-09 12:33:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4fnvtd",
          "author": "AiExpertReviewer",
          "text": "This is spot on. Multi-touch isn’t just nice to have anymore, it’s baseline for B2B trust.  People need to see you in 3-4 contexts before cold outreach feels warm—LinkedIn activity, maybe a comment thread, then email lands way differently.  Single-channel feels like your hunting them, omnichannel feels like showing up.",
          "score": 2,
          "created_utc": "2026-02-09 14:09:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4hc2il",
              "author": "GrowthWithNina",
              "text": "exactly. that shift from being hunted to being familiar is the big difference. same message, totally different perception once they’ve seen you a few times.",
              "score": 1,
              "created_utc": "2026-02-09 19:03:34",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4fwmhg",
          "author": "BadTraditional2538",
          "text": "I’ve seen the same thing where email alone feels like shouting into the void, but once someone’s seen your name on LinkedIn or in comments, the reply rate changes a lot. \n\nIt’s less about “more touches” and more about familiarity across places. Feels like single-channel can still work in super niche cases, but for most B2B, multi-touch is basically the way to go now.",
          "score": 2,
          "created_utc": "2026-02-09 14:57:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4hcht6",
              "author": "GrowthWithNina",
              "text": "well put. familiarity across places matters more than piling on touches in one channel.",
              "score": 1,
              "created_utc": "2026-02-09 19:05:38",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4h17tu",
          "author": "Alone_Ad_3375",
          "text": "same observation, if they know you they will respond to you it's a no brainer\n\nwhat's your stack looks like though?",
          "score": 2,
          "created_utc": "2026-02-09 18:12:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4hdmpi",
              "author": "GrowthWithNina",
              "text": "pretty simple setup tbh. the real leverage has been knowing where to engage and when, not adding more software.",
              "score": 2,
              "created_utc": "2026-02-09 19:11:02",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4hdww0",
                  "author": "Alone_Ad_3375",
                  "text": "Haha nailed it",
                  "score": 1,
                  "created_utc": "2026-02-09 19:12:24",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4iqa8a",
          "author": "SignificanceBusy2136",
          "text": "Totally agree. Cold email performs way better when it’s part of a system instead of the only touch. Multichannel makes the message feel warmer, especially when you’re hitting the right ICP. One thing that helps is starting with a super targeted list so you’re showing up in front of the same high‑fit accounts across channels. A provider like Techsalerator can help with that since their B2B data lets you segment pretty tightly, which makes the multi‑touch approach way more effective. For most B2B it feels like multichannel is the new baseline.",
          "score": 2,
          "created_utc": "2026-02-09 23:15:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4kd582",
              "author": "GrowthWithNina",
              "text": "yeah, starting with a really tight ICP makes everything else work better. when the same accounts see you across channels, the touches add up instead of feeling random",
              "score": 1,
              "created_utc": "2026-02-10 05:11:14",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4k2ymb",
          "author": "New_Grape7181",
          "text": "I've seen the same shift. Single-channel feels like shouting into the void now, especially with how flooded inboxes are.  \n  \nThe familiarity piece you mentioned is spot on. I started layering LinkedIn engagement before sending anything, just genuine comments on posts or reshares, nothing salesy. Then when the email lands a few days later, it's not truly cold anymore. They've seen the name, maybe even checked the profile already.  \n  \nOne thing that surprised me though was how much faster video cuts through compared to text when you're doing that second or third touch. People are used to scanning text emails in 3 seconds, but a short personalised video makes them pause. We went from 2% reply rates to over 20% when we added video into the sequence after the initial LinkedIn touchpoints.  \n  \nThe system approach you're describing is right. It's not about being everywhere constantly, it's about being intentional with the order and timing so each touch builds on the last one.  \n  \nWhat's your typical sequence look like now? Are you running this manually or using tools to coordinate the timing across channels?",
          "score": 2,
          "created_utc": "2026-02-10 04:00:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4kcjfe",
              "author": "GrowthWithNina",
              "text": "yeah this resonates a lot. the sequencing and timing piece is really the unlock, each touch should make the next one feel more natural, not louder.\n\ni’ve been keeping things fairly simple and intentional rather than overly automated, mainly to avoid it feeling mechanical.",
              "score": 1,
              "created_utc": "2026-02-10 05:06:44",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4ff8jg",
          "author": "emma_lorien",
          "text": "cold email is a forever channel",
          "score": 1,
          "created_utc": "2026-02-09 13:17:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4g3nfa",
          "author": "Intrepid_Boss9449",
          "text": "Multi-touch is definitely table stakes now. Cold email alone feels weird to buyers if they never saw you anywhere else first.",
          "score": 1,
          "created_utc": "2026-02-09 15:33:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4hbppl",
              "author": "GrowthWithNina",
              "text": "yeah exactly. email on its own can feel out of context now. even a light touch elsewhere makes the conversation feel way more natural.",
              "score": 1,
              "created_utc": "2026-02-09 19:01:53",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4g3ng7",
          "author": "Odd-Librarian-3292",
          "text": "I had a similar realization.\n\nFor a while I kept tweaking subject lines and copy like it was purely a messaging problem. Sometimes that helps, but it rarely changes the game.\n\nWhat actually moved things for us was exactly what you’re describing, familiarity.\n\nWhen someone has:\n\n* seen your name in comments\n* noticed you engage in their space\n* maybe connected on LinkedIn\n\nthen the email doesn’t feel like a random interruption. It feels contextual.\n\nThat said, I don’t think multi touch means “be everywhere aggressively.” It’s more about coordinated presence. Same positioning, same angle, just reinforced across channels.\n\nSingle channel can still work, especially if timing is right. But in most B2B markets now, recognition is doing more heavy lifting than clever copy.",
          "score": 1,
          "created_utc": "2026-02-09 15:33:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ghimt",
          "author": "kubrador",
          "text": "this is the \"we were bad at sales, so we blamed the email\" energy and i respect the self-awareness. multi-touch has been table stakes for like five years though. you're describing omnichannel go-to-market like it's a hot take when it's basically the baseline now. the real question is whether you're orchestrating it intentionally or just spamming every platform and calling it a strategy.",
          "score": 1,
          "created_utc": "2026-02-09 16:39:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4hecyt",
              "author": "GrowthWithNina",
              "text": "fair take. i’m not saying multi-touch is new, more that a lot of teams still execute it poorly. the difference for me was moving from “being everywhere” to actually orchestrating touches with intent, not just activity.",
              "score": 1,
              "created_utc": "2026-02-09 19:14:33",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4gmerx",
          "author": "Right-Will8093",
          "text": "System thinking is so key when it comes to landing clients.\n\nIt's definitely good to be active on many channels but the biggest thing that helped was setting up a system to track posts where our target audience was complaining or seeking insights\n\nThen jumping in on the conversation, that way you build real relationships with people (which is what they really want before spending a big amount of money on someone)",
          "score": 1,
          "created_utc": "2026-02-09 17:02:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4hd1a4",
              "author": "GrowthWithNina",
              "text": "yeah this is a really good point. showing up where people are already talking about their problems feels way more natural than pushing outreach into random places.",
              "score": 1,
              "created_utc": "2026-02-09 19:08:13",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4hdn41",
                  "author": "Right-Will8093",
                  "text": "yeah exactly, curious what you offer?",
                  "score": 1,
                  "created_utc": "2026-02-09 19:11:06",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4ih8kk",
          "author": "unicorn69love",
          "text": "single channel outreach is straight up dead for most b2b buyers ignore you unless theyve seen your name pop up 2-3x first. ive been messing with ClientHunter lately, it scrapes qualified leads across linkedin/social then spits out timed personalized emails, reply rates actually improved bc it builds that familiarity without me grinding manually. multi-touch as a system is table stakes now imo",
          "score": 1,
          "created_utc": "2026-02-09 22:28:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4kc8fz",
              "author": "GrowthWithNina",
              "text": "yeah agreed, that familiarity piece is the real lever. seeing a name a few times in relevant contexts changes how outreach is perceived way more than the channel itself",
              "score": 1,
              "created_utc": "2026-02-10 05:04:30",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4k25nt",
          "author": "OkDependent6809",
          "text": "honestly this resonates. we obsessed over subject lines for months, reply rates stayed at 2-3%.\n\nthen we talked to people who actually replied. most had seen us on linkedin first. email just reminded them we existed.\n\nnow we do linkedin engagement before cold emails. reply rates went to 6-7%. still not amazing but way better.\n\nthe annoying part is attribution becomes impossible. did they reply because of email or linkedin? idk but it works so we keep doing it.\n\nsingle channel only works if you already have strong brand recognition imo.",
          "score": 1,
          "created_utc": "2026-02-10 03:54:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4kctub",
              "author": "GrowthWithNina",
              "text": "yeah that’s exactly it. the email isn’t doing all the work anymore, it’s just the trigger once there’s some familiarity. attribution gets messy, but if replies are up, the system’s doing its job",
              "score": 1,
              "created_utc": "2026-02-10 05:08:52",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4kvdpb",
          "author": "Surbhimarketing",
          "text": "Completely agreed! In modern B2B, the question isn’t “what channel converts?” But “how does this fit into the broader buying journey?” Single channel can still work, but it’s no longer resilient.",
          "score": 1,
          "created_utc": "2026-02-10 07:46:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4kx8lg",
          "author": "svlease0h1",
          "text": "multi touch outreach usually works better than cold email alone. people reply faster when they have seen your name before. commenting on linkedin sharing helpful posts and using one simple interactive quiz from outgrow can build familiarity before email outreach.",
          "score": 1,
          "created_utc": "2026-02-10 08:03:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4fasv0",
          "author": "Impressive-Amount255",
          "text": "Reading your post felt surreal. I genuinely had the reaction of “wait… did I write this?” You are absolutely spot on. This is what I’ve been repeating for years.\nYes, of course, every channel can always be optimized.\nYour emails can have better subject lines, a cleaner database, stronger CTAs.\n\n\nYour LinkedIn ads can use better visuals, sharper targeting, smarter timing.\nYour events can benefit from a bigger booth, better staffing, smoother execution.\n\nBut let’s be honest.\nThose tweaks rarely change the game. They might give you a few extra points of performance here and there. What usually makes the real difference is something else entirely.\n\n\nWhat’s missing most of the time is proper integration across channels. And this is exactly where integrated marketing campaigns become critical.\nYour customers do not live inside your channels. They live in their own world.\n\nThey see you in the street. On their phone. On social media. In their inbox. In articles. On billboards. On TV. On the radio. What builds trust and brand preference is not one single touchpoint performing well in isolation. It’s the accumulation of all these interactions over time that creates familiarity, credibility, and eventually preference.\n\n\nAnd this is also where I think a lot of CFOs get it wrong.\nBeing able to read a P&L or a channel performance dashboard does not mean you understand how marketing actually works. Killing or scaling channels purely based on attribution models misses the bigger picture of how people experience brands in real life.\n\n\nFor me, the real eye-opener came when I started looking for a way to properly structure campaigns. I had read about models like PESO and the broader SOSTAC theories. They are solid, but often very theoretical. At the time, I couldn’t afford expensive marketing courses, so I was relying purely on free public resources. That’s when I came across the RIO integrated campaign framework, and it genuinely changed how I think about marketing.\n\nIt forced me to stop looking at performance purely through a channel ROI lens and start thinking in terms of customer experience and campaign coherence. It made painfully obvious how vital true integration is if you want your marketing to actually work in the real world.\n\n\nSo yes. The post you wrote is spot on.\nThanks for putting into words what a lot of marketers intuitively feel but struggle to articulate clearly.",
          "score": 1,
          "created_utc": "2026-02-09 12:48:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4fb8sb",
          "author": "Impressive-Amount255",
          "text": "By the way, I got so caught up reacting to your post that I forgot to answer your initial questions. My bad.\n\n\nYes, of course, you can and should measure single-channel performance. Optimizing at channel level matters. You want your email to perform well as email. Your ads to perform well as ads. Your events to perform well as events.\n\nBut that should never be the full story. You need to look at the bigger picture.\n\nAnd honestly, I think multi-touch attribution is close to a utopia. I’ve worked in three different companies that either wanted to implement it or actually tried to roll it out. On paper, it sounds amazing. You measure exactly how each channel contributes. You finally get “the truth” behind performance.\nIn reality, it’s a nightmare.\n\nIt takes forever to configure properly. The data is fragile. The models are complex. And once you finally have something that works, anyone can tweak the weightings and percentages to tell whatever story they want to tell. Suddenly, attribution becomes less about truth and more about politics.\n\nThat’s why, for me, the only approach that really makes sense is campaign-level attribution. Kill the whole first-touch, last-touch, multi-touch battle altogether.\nLook at campaigns as coherent systems. Measure whether Campaign A, as a whole, created impact. Then optimize channels inside the campaign for execution quality, not for credit-taking.\n\n\nJust my two cents.",
          "score": 0,
          "created_utc": "2026-02-09 12:51:40",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qvrrck",
      "title": "How did you get your first 10 customers?",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qvrrck/how_did_you_get_your_first_10_customers/",
      "author": "InevitableSense7507",
      "created_utc": "2026-02-04 15:36:32",
      "score": 7,
      "num_comments": 19,
      "upvote_ratio": 1.0,
      "text": "Hi everyone, I’m Kane from Atlanta. I'm a 2x founder building an AdTech product.   \n  \nWe’re at about $2k/mo and growing steadily. I’m looking for the real story on first customers, not the generic stuff I'm mainly seeing on YT.  \n  \n**How did you get your first 10? Where did you find them, what did you say, and what did you do repeatedly until it worked?**\n\n",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qvrrck/how_did_you_get_your_first_10_customers/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o3jnkv3",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-04 15:36:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3kxr0s",
          "author": "No_Hedgehog8091",
          "text": "Talk with them, not at them. My first 10 came from commenting helpfully in niche Facebook groups, solving real problems before mentioning my solution.",
          "score": 3,
          "created_utc": "2026-02-04 19:07:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3njutt",
              "author": "InevitableSense7507",
              "text": "thanks!",
              "score": 1,
              "created_utc": "2026-02-05 03:18:37",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3mi856",
          "author": "agm_93",
          "text": "honestly for my first 10 it was a lot of manual work - i spent hours finding people talking about the exact problem i was solving on reddit and other communities, then reaching out directly. it's time consuming but you get real feedback and those early customers actually care about what you're building.\n\nfor context, i built inreach (a chrome extension) specifically because that manual search process was eating up so much of my time, but the direct outreach approach itself is what worked to get those initial customers.",
          "score": 3,
          "created_utc": "2026-02-04 23:45:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3nqf4a",
          "author": "algatesda",
          "text": "You want story how to get first customer in Ad tech space or any other space /industry?",
          "score": 2,
          "created_utc": "2026-02-05 03:59:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3puff0",
              "author": "InevitableSense7507",
              "text": "Not first we're past that just wanted to hear your stories",
              "score": 2,
              "created_utc": "2026-02-05 14:01:24",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3puu7d",
                  "author": "algatesda",
                  "text": "I reached out to my contacts who is potential to give business and then I joined in a referral network .Then I defined my ICP to outreach to whom my expertise and solution will help them.Once I setup my outbound system I can able to reach $6K MRR for my service business",
                  "score": 2,
                  "created_utc": "2026-02-05 14:03:42",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3u2ayy",
          "author": "KissyyyDoll",
          "text": "Congrats on the progress! 2k monthly is a solid start.\n\nFor us, it was all about LinkedIn outbound but in a very low key way. I didn't send pitches. I just messaged people in my niche asking for a quick feedback call on a specific feature I was building.\n\nMost people are happy to give advice if you don't try to sell them something right away. Out of every 10 calls, maybe 2 would ask \"so how much does this cost?\" and those became the first customers. It’s a grind but it builds a better product too.",
          "score": 2,
          "created_utc": "2026-02-06 02:49:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3u329m",
              "author": "InevitableSense7507",
              "text": "Dude this is great advice!",
              "score": 1,
              "created_utc": "2026-02-06 02:53:50",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o3u35jq",
              "author": "InevitableSense7507",
              "text": "We’re already doing LinkedIn Outbound so that would be useful to incorporate into our flow",
              "score": 1,
              "created_utc": "2026-02-06 02:54:21",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3vulfh",
          "author": "Nihcas_Sachin",
          "text": "try finding first degree connects of founders, investors, customers, employees who could be within your ICP",
          "score": 2,
          "created_utc": "2026-02-06 11:28:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3wsw9u",
              "author": "InevitableSense7507",
              "text": "👏",
              "score": 1,
              "created_utc": "2026-02-06 14:55:49",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3wn1e8",
          "author": "No_Item_1508",
          "text": "Yup, generally agree with the above comments, the first 10 will come from 1st and 2nd degree connections. You need to ask for intro’s, leverage connections and most important ASK QUESTIONS and try to solve their problem not sell your product.",
          "score": 2,
          "created_utc": "2026-02-06 14:25:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3wsuml",
              "author": "InevitableSense7507",
              "text": "💯",
              "score": 1,
              "created_utc": "2026-02-06 14:55:35",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3q9h5q",
          "author": "Intrepid_Boss9449",
          "text": "I found my first 10 customers by hunting down niche Reddit threads where people openly asked for help or solutions related to my product. I just dropped honest, helpful comments and followed up with DMs only if they showed interest. Tools like SocListener can speed this up by finding those posts and suggesting what to say, so you don’t waste time searching or guessing.",
          "score": 1,
          "created_utc": "2026-02-05 15:20:10",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qx6blh",
      "title": "New to Local Lead Gen and Looking for Advice on Getting Started the Right Way",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qx6blh/new_to_local_lead_gen_and_looking_for_advice_on/",
      "author": "Ill-Explorer-5001",
      "created_utc": "2026-02-06 03:12:54",
      "score": 7,
      "num_comments": 10,
      "upvote_ratio": 1.0,
      "text": "I’m looking to get my feet wet in the local lead generation space and could really use some guidance from people who’ve actually been in the trenches.\n\nRight now, I’m not a business owner yet. I’m at the very beginning stages and trying to learn the right way before jumping in. My long-term goal is to build something that lets me work from home while my wife works full time, so I can be there for our kids and help care for our special needs daughter.\n\nHaving flexibility and stability is extremely important to my family. It’s very difficult trying to work around each other’s schedules to provide adequate supervision and care around the clock for our daughter. We don’t have outside help or government assistance. It’s just my wife and I.\n\nI’m also not working at the moment. I left my previous employer so my wife could work full time while I job hunt and watch the kids.\n\nA little about me:\n\n1.) I already have experience with scripting\n\n2.) I’m comfortable with prospecting\n\n3.) I have some cold calling skills\n\n4.) I’m not afraid of outreach or rejection\n\nWhat I’m hoping to learn from you all:\n\n1.) What’s the best way to get started in local lead generation with little to no experience?\n\n2.) I’m mainly interested in service-based lead gen for local companies in my area.\n\n3.) How did you land your first client?\n\n4.) What beginner mistakes should I watch out for?\n\n5.) What would you recommend learning first?\n\n6.) What niches would you recommend looking into?\n\n7.) What tools are best to start out with (preferably free or cheap)?\n\nRight now, I’m seriously considering targeting epoxy flooring companies as my main niche. Part of the reason is because I’ve worked with epoxy before and have done flooring in the past, so I already understand the product, the process, and what customers usually care about. I’ve checked with Google Maps and have seen there are plenty of companies in my area with little to no reviews and plenty more with no online presence. \n\nThat said, I’m still not 100% sure if epoxy will pan out long-term or scale well, so I’m very open to hearing other niche ideas too.\n\nI’m motivated, willing to put in the work, and in this for the long haul. I’m not looking for shortcuts. I just want to avoid wasting time going down the wrong paths.\n\nAny advice, resources, or personal experiences would mean a lot.\n\nAND PLEASE DO NOT TRY TO SELL ME ON YOUR AI PRODUCT. NOT INTERESTED. \n\nTIA y’all!",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qx6blh/new_to_local_lead_gen_and_looking_for_advice_on/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o3u685p",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-06 03:12:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4027ri",
          "author": "New_Grape7181",
          "text": "I worked in local service business marketing for a while, and epoxy flooring is actually a solid pick. The margins are high enough that they can afford to pay for leads, and you're right that most are invisible online.  \n  \nSince you're comfortable with cold calling, here's what I'd do first. Ring 10 epoxy companies in your area and ask them straight up how they currently get customers. You'll learn more in those conversations than any course will teach you. Most will actually tell you because they're not used to people asking smart questions.  \n  \nFor your first client, don't sell lead gen as a service yet. Offer to run a small test campaign for just the cost of ad spend (if you go that route) or do it purely on commission per lead. This removes all their risk and gets you a case study fast.  \n  \nTools to start: Google Business Profile optimisation costs nothing and actually works for local. If you want to run ads later, Google Local Services Ads convert well for home services.  \n  \nOne thing I'd caution against is building sites you don't own yet. Some people do the \"rank and rent\" model but it takes months to see results, and you need cash flow now.  \n  \nWhat's your plan for actually generating the leads once you land a client?",
          "score": 2,
          "created_utc": "2026-02-07 00:45:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o40l24z",
              "author": "Ill-Explorer-5001",
              "text": "You’re just validating everything that I’ve been thinking about on how to navigate all of this! I plan is to build my own website first, run ads and draw in traffic then sell them for a commission per lead to build that case study. (I don’t know how I’m going to do all of this yet, but I’m figuring it out as I go.) I just got my laptop back from a friend today who was a software engineer. I had him fix some bug issues to speed it up. I’m currently sitting in front of it now downloading tools necessary for the job. \n\nAny more tips you may have for where I’m at now?\nDoes my game plan so far sound like I’m taking the right path?\nThank you!",
              "score": 1,
              "created_utc": "2026-02-07 02:40:53",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3wu7xe",
          "author": "Ash_Skiller",
          "text": "sounds like you've got a solid foundation with your scripting and cold calling background, that'll serve you well in lead gen. For finding those local service businesses to target (like your epoxy flooring idea), I came across SMB Sales Boost recently and it looks like it could be useful for building out prospect lists. It's basically a database that shows you newly registered businesses in your area so you can reach out to them early before they're getting hit by everyone else.\n\nOne thing I'd add about epoxy flooring as a niche - it's pretty seasonal in some areas and the market can be saturated depending on where you are. Might be worth also looking at HVAC, plumbing, or electrical companies since they tend to have more consistent year-round demand and higher customer lifetime value. The fact that you have hands-on experince with epoxy is definitely valuable though, maybe use that as your starting point to land the first client and build proof of concept before branching out.",
          "score": 1,
          "created_utc": "2026-02-06 15:02:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3xyx09",
          "author": "ActivitySmooth8847",
          "text": "Start by picking one niche and really learn what their customers want. Epoxy flooring sounds good since you know the product, but also check out plumbers or landscapers since they always need leads. For cheap tools, try Google Maps and free CRM like HubSpot, and if you want to speed up lead lists, SocLeads can help pull contacts fast without much hassle.",
          "score": 1,
          "created_utc": "2026-02-06 18:16:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ysr11",
          "author": "erickrealz",
          "text": "Epoxy flooring is actually a damn solid niche pick, especially since you already know the industry. That knowledge alone puts you ahead of 90% of people starting out because you can actually speak the language when talking to these business owners. Don't overthink the niche selection, just commit and go.\n\nYour scripting and cold calling background is honestly the perfect skill set for this. With our clients who sell lead gen services to local businesses, the ones who crush it early all started the same way. They picked up the phone, called local companies with crappy online presence, and offered to bring them leads. No fancy pitch deck, no website needed, just \"hey I can get your phone ringing, want to try it out.\" Landing that first client is always the hardest part so consider doing the first one free or on a pay per lead basis just to get proof that your system works.\n\nFor tools on a budget, grab Apollo for prospecting and building contact lists of local business owners. Use Google My Business to identify companies with weak online presence like you're already doing. For the actual lead gen delivery, start with a simple landing page through Carrd or a free WordPress setup paired with Google Local Service Ads. Those convert like crazy for home services and the barrier to entry is low.\n\nBiggest mistake I see beginners make is trying to offer everything to everyone. Stick with epoxy flooring, learn exactly what works to generate those leads, document your results obsessively, then use that proof to sign paying clients in the same niche. Rinse and repeat until you've got a system that runs predictably before even thinking about adding another niche.",
          "score": 1,
          "created_utc": "2026-02-06 20:41:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3yt02y",
          "author": "Tomsonx232",
          "text": "What is your product/service? You're going to do lead generation for epoxy flooring companies aka you're going to find customers for the epoxy flooring companies?",
          "score": 1,
          "created_utc": "2026-02-06 20:42:55",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}