{
  "metadata": {
    "last_updated": "2026-01-25 16:49:57",
    "time_filter": "week",
    "subreddit": "b2bmarketing",
    "total_items": 20,
    "total_comments": 287,
    "file_size_bytes": 253314
  },
  "items": [
    {
      "id": "1qi7inr",
      "title": "The best B2B marketing teams I work with are ruthless about focus",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qi7inr/the_best_b2b_marketing_teams_i_work_with_are/",
      "author": "Adept_Masterpiece777",
      "created_utc": "2026-01-20 17:32:10",
      "score": 67,
      "num_comments": 20,
      "upvote_ratio": 1.0,
      "text": "Working with clients across B2B, the biggest difference I see between teams that feel calm and teams that feel overwhelmed isn’t budget or tools, it’s focus. The strongest teams are very intentional about where human effort goes. They don’t try to deeply analyze everything. They use systems to handle the background work and save their thinking time for positioning, messaging, and decisions that actually move the needle.\n\nOn a lot of accounts, the messy part isn’t creativity, it’s the in-between work. Research, list cleanup, checking whether accounts are still relevant, keeping data in sync. When that layer is handled cleanly, clients are able to spend more time on strategy instead of maintenance. I’ve seen teams use tools like Clay for research and signals, HubSpot as the source of truth, and Notion to keep plans visible. The exact stack varies, but the mindset stays the same.\n\nThe pattern that keeps showing up is this: the better the focus, the less the team feels the need to overbuild process. They automate the boring parts, stay thoughtful about the rest, and move faster without feeling rushed.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qi7inr/the_best_b2b_marketing_teams_i_work_with_are/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o0p97an",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-20 17:32:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0pxted",
          "author": "NervousObjective9280",
          "text": "I mostly agree, but I think focus is sometimes the *result* of clarity, not the cause.\n\nI’ve seen teams automate a ton and still feel overwhelmed because they never aligned on what actually mattered. They had systems everywhere, but no shared conviction on positioning or priorities, so every signal felt urgent.\n\nWhere it really clicked wasn’t just automating the in between work, but first deciding what problems were worth thinking about at all. Once that was clear, the tools helped. Without it, even a clean stack just makes the noise move faster.",
          "score": 10,
          "created_utc": "2026-01-20 19:23:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0rd6t8",
              "author": "Euphoric-View-9876",
              "text": "This is a really good distinction. Ive seen the same thing teams automate themselves into being busy faster, not clearer. What helped in practice was being ruthless about which signals even get surfaced to humans in the first place. When you narrow inputs to things that show real intent or change (actual conversations, shifts in behavior, explicit pain), focus becomes a byproduct. Without that filter, every dashboard just creates another false “priority.”",
              "score": 2,
              "created_utc": "2026-01-20 23:29:53",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o0s8i63",
              "author": "yngbld5",
              "text": "Agree. Clarity enables focus",
              "score": 2,
              "created_utc": "2026-01-21 02:24:53",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o0zqdyp",
              "author": "_forgotmyownname",
              "text": "That’s fair. Without clarity, focus just turns into faster confusion.",
              "score": 1,
              "created_utc": "2026-01-22 04:42:48",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o13waps",
              "author": "theguywhobuilds",
              "text": "Fair point, and I think we’re mostly saying the same thing from different angles.\n\nFocus doesn’t come from discipline alone  it comes from knowing what actually matters, but once that clarity exists the teams that win are the ones that can hold that focus and not get pulled into every new signal or tool.\n\nI’ve seen things fall apart is when clarity is there but execution keeps drifting, or when tools start driving priorities instead of the other way around. Clarity sets direction, focus keeps it from unraveling.",
              "score": 1,
              "created_utc": "2026-01-22 20:01:44",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0t1fvn",
          "author": "signalpath_mapper",
          "text": "This matches what I’ve seen too. Teams usually aren’t drowning because of bad ideas, they’re drowning because attention is spread across too many half important tasks.\n\nWhen the background work is predictable and boring by design, people can actually think. The calm teams tend to say no more often and don’t feel the need to optimize every tiny thing. Focus does more than any new tool.",
          "score": 1,
          "created_utc": "2026-01-21 05:28:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0t44q9",
          "author": "signal_loops",
          "text": "the teams that look ahead aren’t necessarily smarter or better funded, they’re just disciplined about where attention goes. they accept that not everything deserves deep analysis and they design systems to quietly handle the repetitive, error prone work so humans can stay focused on positioning, narrative, and decision making. once research, data hygiene, and account relevance are mostly automated or at least standardized, strategy stops feeling like a luxury and starts becoming the default. the interesting part is that focus actually reduces process bloat when priorities are clear, teams don’t feel the urge to layer on more tools or meetings to compensate.",
          "score": 1,
          "created_utc": "2026-01-21 05:48:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0tbupf",
          "author": "deep_singh3106",
          "text": "I would argue that focus comes from constraints as well. Some of the best teams that I have seen deliberately limit what the system is allowed to surface even if it means missing some signals because constant optionality creates anxiety. When everything is technically visible, nothing feels sage ignore. Designing systems that intentionally hide 80% of the noise can feel risky at first, but that's usually where real leverage shows up.",
          "score": 1,
          "created_utc": "2026-01-21 06:52:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0trp55",
          "author": "Sea-Environment-5938",
          "text": "This is so real. Most \"marketing chaos\" is just attention fragmentation dressed up as process. The calm teams usually have 2-3 priorities and say no to everything else.",
          "score": 1,
          "created_utc": "2026-01-21 09:20:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0uji6m",
          "author": "SilentUniversity1304",
          "text": "I see this all the time. Focus does more for speed than any new tool. When teams are clear on what matters, they stop overprocessing and actually move.",
          "score": 1,
          "created_utc": "2026-01-21 13:04:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0uyhck",
          "author": "ActivitySmooth8847",
          "text": "Totally agree that automating the boring stuff frees up brainpower for strategy.",
          "score": 1,
          "created_utc": "2026-01-21 14:27:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0x05qv",
          "author": "TNT-Rick",
          "text": "This feels like an ad...",
          "score": 1,
          "created_utc": "2026-01-21 20:01:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0zqa9y",
          "author": "_forgotmyownname",
          "text": "This tracks. Focus beats tools every time. Most overwhelm comes from trying to care about everything.",
          "score": 1,
          "created_utc": "2026-01-22 04:42:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o13p5bq",
          "author": "theguywhobuilds",
          "text": "That’s been my experience too. The best teams arent chasing every new tactic, they’re aligned on why they’re doing something and who its actually for.\n\nWhen product, sales, and marketing agree on the problem they’re solving and the language they use to explain it, execution gets simpler and results compound. When that alignment is missing, even good tactics look random and underperform.\n\nStrong teams feel boring from the outside because they repeat the same message consistently, but that consistency is usually the reason they win.",
          "score": 1,
          "created_utc": "2026-01-22 19:29:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o16t96q",
          "author": "KissyyyDoll",
          "text": "Automating repetitive tasks and centralizing data frees cognitive bandwidth for strategic work. Teams that enforce this focus show higher output velocity and lower operational friction, regardless of the tech stack.",
          "score": 1,
          "created_utc": "2026-01-23 05:33:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1fc3lr",
          "author": "AzemaGlitch",
          "text": "Agree. They know what success looks like and don’t take moral victories about stuff that doesn’t really matter.",
          "score": 1,
          "created_utc": "2026-01-24 13:55:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1jcae2",
          "author": "New_Grape7181",
          "text": "I've noticed the same thing. The teams that seem to have their act together aren't doing more, they're doing less but with way more intention.  \n  \nOne thing that helped us was splitting work into \"decide once\" and \"decide often\" buckets. Decide once means automating it or documenting the process so tightly that nobody has to think about it again. List hygiene, signal tracking, basic qualification criteria, that stuff shouldn't need a meeting every week.  \n  \nThe decide often bucket is where the actual brain power goes. Messaging angles, which accounts to prioritise this quarter, what content to create. That's where the differentiation happens.  \n  \nWe used to spend hours manually researching accounts and prepping outreach. Now we've automated most of the research layer, which frees up time to actually personalise the message in a way that matters. The hard part was trusting the system enough to let go of the manual checks.  \n  \nWhat's been the biggest time sink for your clients before they get this sorted?",
          "score": 1,
          "created_utc": "2026-01-25 01:28:44",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qj0ds3",
      "title": "2-3k/mo budget for LinkedIn ads even worth it?",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qj0ds3/23kmo_budget_for_linkedin_ads_even_worth_it/",
      "author": "Ok_Secretary4782",
      "created_utc": "2026-01-21 15:09:35",
      "score": 34,
      "num_comments": 73,
      "upvote_ratio": 0.98,
      "text": "We're a super small bootstrapped AI b2b saas startup. We have a proven product and great social proof from our mid-market customers, but we're just struggling to find a repeatable channel.\n\nI've dabbled in Google search ads with little to no success. I always turn them off after a few hundred bucks because they typically drive junk traffic (despite turning off display network and setting location to US only). I am not a Google ads expert and don't have the budget to hire one, so I basically decided to stop trying there.\n\nLinkedIn ads feel far less complicated, and the audience targeting makes logical sense if you've used sales navigator or just spend a lot of time on linkedin.\n\nI'm committing \\~$1.5k to a week long thought leader ad experiment (our biggest issue is that our ideal customer doesn't know we exist).\n\nWill this level of spend move the needle?",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qj0ds3/23kmo_budget_for_linkedin_ads_even_worth_it/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o0v6xtc",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-21 15:09:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0v8ojw",
          "author": "cornelmanu",
          "text": "Short answer: $1.5k will not “move the needle” in terms of revenue. But it can still be useful if you set the right goal.\n\nA few straight points:\n\n1. This is not a channel problem yet. If Google ads brought junk traffic and LinkedIn feels easier, the real issue is probably messaging and ICP clarity, not the platform. Paid just amplifies what already works.\n2. Thought leader ads = learning, not pipeline. With $1.5k over a week, expect signals, not demos. You are testing awareness and message resonance, not demand. Judge success by comments, profile visits, and DMs, not conversions.\n3. Ads only work after messaging is proven. The best LinkedIn ads come from posts and DMs that already get replies organically. If you have not validated that yet, ads will feel random.\n4. This is where fractional makes sense. You are too early to hire a paid ads specialist, but too far along to guess. A fractional growth setup focuses on ICP, messaging, organic validation, then turns on paid as a multiplier, not a gamble. That is exactly how I work with bootstrapped B2B SaaS teams.\n\nIf you want a quick sanity check, share your ICP and deal size and I can tell you if this test is worth running or better paused.",
          "score": 16,
          "created_utc": "2026-01-21 15:17:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o10k0p1",
              "author": "nopaxx2k",
              "text": "this one of the smartest things ive ever read in the ppc jungle",
              "score": 3,
              "created_utc": "2026-01-22 08:45:49",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o17dnej",
              "author": "Ceylen_White",
              "text": "Professional feedback, learn a lot",
              "score": 2,
              "created_utc": "2026-01-23 08:22:32",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o0v9x3u",
              "author": "Ok_Secretary4782",
              "text": "This is great feedback. I appreciate it. Mind if I shoot you a DM?",
              "score": 1,
              "created_utc": "2026-01-21 15:23:39",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0vaeb8",
                  "author": "cornelmanu",
                  "text": "Sure",
                  "score": 1,
                  "created_utc": "2026-01-21 15:25:54",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o15h23p",
                  "author": "ActionOverThoughts",
                  "text": "We also want answer here. If you can leave the private details, would appreciate for the learning!",
                  "score": 1,
                  "created_utc": "2026-01-23 00:47:33",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0w3511",
          "author": "likethestonx",
          "text": "I'd take an organic approach to LI first, gather some data on what works, and go from there.\n\nIn the past I used an organic + ads specialist who showed me how to run both simultaneously, as well as the power of organic only with a hypertargeted campign. \n\nHappy to DM you their contact info.",
          "score": 2,
          "created_utc": "2026-01-21 17:35:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0x2ttw",
              "author": "Minute-Nose9876",
              "text": "Totally agree – with some clever hooks, it's still possible to get seen organically (and rather fast too).",
              "score": 2,
              "created_utc": "2026-01-21 20:14:02",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o11z5br",
              "author": "Ok_Secretary4782",
              "text": "I am trying but it appears the algorithm despises my account. I was at least getting a few likes and comments here and there but now it looks like my posts are genuinely getting no visibility. I guess I just need to keep trying.",
              "score": 2,
              "created_utc": "2026-01-22 14:48:04",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o122el0",
                  "author": "likethestonx",
                  "text": "What worked for me was focusing on 4 things that needed to be in alignment before even thinking about content. \n\nProfile,\nAudience,\nEngagement,\nMessaging.",
                  "score": 1,
                  "created_utc": "2026-01-22 15:03:56",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o0w3mua",
              "author": "likethestonx",
              "text": "Oh, forgot to mention. Yes, 1.5k ad spend is too much at first.",
              "score": 1,
              "created_utc": "2026-01-21 17:37:35",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o11zbof",
                  "author": "Ok_Secretary4782",
                  "text": "I will likely kill it early. Performance is good (CPM, CPC), not clear it is driving anything meaningful at all. but it also super early - only on day 2.",
                  "score": 1,
                  "created_utc": "2026-01-22 14:48:56",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            },
            {
              "id": "o10hm7b",
              "author": "Stunning-Bad-5805",
              "text": "That sounds smart I always find starting organic first saves so much headache later",
              "score": 1,
              "created_utc": "2026-01-22 08:23:08",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o10i5od",
              "author": "Just-Fennel8301",
              "text": "How would you take organic approach?",
              "score": 1,
              "created_utc": "2026-01-22 08:28:17",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0v8ip5",
          "author": "Responsible-Brick881",
          "text": "Hard to say if it'll move the needle, especially as the CPM's are crazy expensive from what I've seen $150+!!\nHow many people in your company?",
          "score": 1,
          "created_utc": "2026-01-21 15:17:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0v9mbx",
              "author": "Ok_Secretary4782",
              "text": "Very small, 2 people.",
              "score": 1,
              "created_utc": "2026-01-21 15:22:14",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0va2tg",
                  "author": "Responsible-Brick881",
                  "text": "I hear ya... Solopreneur here!! Are you actively pushing out content from your personal pages...stats suggest they're up to 20X more engaging than pushing out from a company page",
                  "score": 2,
                  "created_utc": "2026-01-21 15:24:24",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0vgojx",
          "author": "colombow1",
          "text": "LI ads are crazy expensive as cold outreach channel. I would rather invest the money into lead enrichment tool so that your sales can bug people through DM woth relevant content.\n\nWhat worked for us with lower budgets were gated whitepapers with solid case on solving the issue your product solves. LI now allows form-gated PDFs as medium, gathering contact info for those who download – those translate well to hot leads.",
          "score": 1,
          "created_utc": "2026-01-21 15:54:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0xddig",
              "author": "sanfranciscolady",
              "text": "My b2b agency is about to publish a big (and we think good!) gated whitepaper like this on LinkedIn. We're excited to see how it goes, we've never used this feature before. Any tips on how to position the content, or examples of a successful campaign using gated content?? (TIA if you have any!!!)\n\nAgree with everyone else that founder thought leadership (to reinforce all the messaging) and a great outbound campaign would be smart here. We use a manual list generator in the Phillipines for a few clients to make super enriched, targeted lists for LinkedIn, then we run the outbound program on Alfred. We've used a few others but Alfred is cheap and gets the job done.\n\nALSO- this might be an emporers' new clothes situation here--- but have you tried Reddit? Organic reddit, not paid. IFYKYK.",
              "score": 1,
              "created_utc": "2026-01-21 21:01:45",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0y8m2w",
                  "author": "colombow1",
                  "text": "Some random bits and bobs:\n– We made the whitepaper in neutral visual to enhance the positioning as expert material, not sales material. Keep it honest, do not push commercial CTAs (link to your product where appropriate, though), keep push for sales team\n– We connected the form directly with Hubspot through native integrations to keep it in our funnel mapping\n– It needs to be clearly positioned as concrete answer to a concrete problem (not vague like \"get more leads\") or as a valid research result. Ours was in style of \"Comparison of time spent with methods X and Y for calculating steel connections\", which got enough engineers (our target group) to want to read it in exchange for their e-mail\n– Beware, LI does not automatically store the lead LI url unless you tell it otherwise, it was a pain to search for everyone since we only stored e-mails\n– It brought dozens of leads with CPA ~€15 in multiple regions (EU, Middle East)\n\nIf you need further consultation, I am open to coop :)",
                  "score": 1,
                  "created_utc": "2026-01-21 23:33:32",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0vhntf",
          "author": "kubrador",
          "text": "$2-3k/mo on linkedin won't move the needle if your icp doesn't know you exist. you're basically hoping to build awareness on a platform that charges $15+ per click. that's like 150-200 clicks for your budget with zero guarantee any convert.\n\nyour real problem isn't the channel, it's that you haven't found \\*any\\* repeatable channel yet. before spending on ads, figure out how to get one customer through word of mouth, content, or sales outreach. then scale that. right now you're just lighting money on fire to solve a discovery problem that ads alone won't fix.",
          "score": 1,
          "created_utc": "2026-01-21 15:58:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0vj3hh",
          "author": "BarkingMadJosh",
          "text": "Yes, and sounds like you're doing it the right way - distributing content to plant seeds with ICP versus lead gen.   \n  \nWhat's your audience size and avg. CPM so far? I'll run it through my budget calculator to see what your ideal budget should be. \n\nDo you have Audience Expansion and Audience Network off?  Those waste a ton of money.",
          "score": 1,
          "created_utc": "2026-01-21 16:05:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0vl7jy",
          "author": "ArtemLocal",
          "text": "$1.5k won’t prove a channel, but it can tell you if you’re directionally right or completely wrong. Thought leader ads are awareness, not demand capture. Expect impressions, profile views, maybe some site traffic. Not pipeline in a week. If you judge it on leads, you’ll kill it too early like Google. The bigger risk is message, not platform. If the ICP doesn’t already feel the pain when they see the ad, targeting won’t save it. With mid market proof, I’d care less about CTR and more about whether the right people start engaging repeatedly over a few weeks. What specific action would tell you this is worth continuing after the test?",
          "score": 1,
          "created_utc": "2026-01-21 16:14:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1d9dc1",
              "author": "kindie123",
              "text": "Check ",
              "score": 1,
              "created_utc": "2026-01-24 03:57:49",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0vu2bt",
          "author": "noinluence",
          "text": "That budget probably will not directly drive revenue, but it can still be useful if expectations are set right. LinkedIn ads at that spend level work better for visibility and message testing than actual pipeline, especially for a two person team. If the goal is getting the right people familiar with the product and validating which messages land, then it is worth running. It usually helps a lot if founders are also posting organically, since ads tend to perform better when they reinforce content people are already engaging with.",
          "score": 1,
          "created_utc": "2026-01-21 16:54:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0vvl8u",
          "author": "Chupacabra1987",
          "text": "The thing is, google ads isn’t „easy“ to do and a couple 100s isn’t enough to say anything about it. I started 2 years ago from 0 and just a couple months ago it clicked all togetherness lading page, what campaigns, what copy, a lot of A/B testing. If you get everything right there is not much that is more profitable in marketing",
          "score": 1,
          "created_utc": "2026-01-21 17:01:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0wxf9i",
          "author": "sagefrogmarketing",
          "text": "At that spend the goal isn’t conversions, it’s signal. A week and $1.5k can tell you whether the message, ICP, and hook resonate enough to earn attention and engagement. Thought leader ads tend to work best when they validate positioning and spark conversations you can then follow up on manually, not when you expect direct pipeline. If you treat this as a learning sprint (what gets saves, comments, profile visits), it can absolutely move the needle in clarity, even if it doesn’t in revenue yet.   \n  \nAlso Google search ads work best when there's plenty of historical data to work off of so I'd recommend leaving them on, even if the spend is minimal.",
          "score": 1,
          "created_utc": "2026-01-21 19:49:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0x2e1u",
          "author": "kailfarr",
          "text": "I run both Google ads and LinkedIn ads. Google leads are typically lower than LinkedIn leads, with the exception of document ads. Document ads are great on LinkedIn, but you really need to know who your customer is by title and industry. The document also needs to be compelling for the user to want to download. For Google ads, you need to give the system a lot of information, for example, are your conversion pixels setup properly? Are you passing information for offline conversions back to Google? You can get help with setting this up via AI. Claude is a great option and can walk you through it. Google needs to have about 7-14 days to learn, so if you are strapped for cash, try running one campaign at $40/day. Be very tight with your keywords and don't touch the system for at least a couple of days. You can check out the search terms report and block irrelevant searches. Also, try and modify your bids to remove mobile traffic or at least bid very low for it.",
          "score": 1,
          "created_utc": "2026-01-21 20:12:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0x47pu",
          "author": "shitisrealspecific",
          "text": "They claim audio advertising is better. Maybe try that...",
          "score": 1,
          "created_utc": "2026-01-21 20:20:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0xig19",
          "author": "Kamel_Ben_Yacoub",
          "text": "B2B sales cycles typically take 2–6 months from first contact to a closed deal, so a one-week ad campaign even with $1.5k would likely be a waste of money. This amount should be the minimum spend for a full month, and you will need to maintain that effort for several months to start seeing real results.\n\nHere is what I would do instead:\n\n1. Start with posting organic post to leverage your founder personal  brand (showing more testimonial best practices, teardowns, feature highlights, case studies...)\n2. invest in influencer partnerships that serve your ICP. partner with 10-20 people that post about your tool monthly (long term collaborations, not one offs)\n3. Then boost founder posts ( the most engaging organic post ). + influencers posts via thought leader ads",
          "score": 1,
          "created_utc": "2026-01-21 21:24:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0xj1om",
          "author": "romerogers",
          "text": "\\- i would focus on SEO\n\n\\- automate blogs, info hubs etc\n\n\\- create a linkedin posting bot with claude code + opus",
          "score": 1,
          "created_utc": "2026-01-21 21:27:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0xkgwt",
          "author": "carrzo",
          "text": "1. Spend amount is Ok and you should be seeing some data and traction at that level. Remember, pipeline is irrelevant if you're really doing it for awareness - which may sound nice but remember in the end someone will be asking where is the revenue right quick so be ready for awareness vs. pipeline chat.\n2. Immediately turn off any Week 1 ads with some decent impression count compared to the rest, but are below 1% CTR\n3. Keep in mind depending on your spend, timing (weekends turned off or on? That's another thread entirely) geo targeting, titles, etc, even your best ads will fatigue within 10 days or so. You'll start to notice because last week's CTR winner is this week's not so much, especially when impressions per unique tap out at 5+. The catch 22 is the best clicked ads get shown more by the algorithm until people see them 3+ more repeated times and they ignore.\n4. You may be able to turn the best ones back on a few weeks later - or of course with a different targeting set - but know they will decay.\n5. Yes as stated before definitely turn OFF audience expansion no matter what pablum messaging is in the interface encouraging you to do so.\n6. I assume this Phillipines thing is sending you targeting emails that you are uploading as Audiences in Linkedin for specific targeting?\n7. The titles field is powerful for segmentation - know your vertical and understand if Managers have budget or does it start with Director and above.\n8. Again, if it's awareness, any broad targeted clicks by whatever title may work but be ready to push back when asked about ROI and \"where is the Pipeline from all this  spend?\" And in the end it always comes down to it so I'd put the awareness spend at no more than 20% effort.\n9. North star is CTR above 3% - and keep in mid it's all about the visuals as you want people to stop scrolling, especially on their phones.\n10. That said, white papers are great for thought leadership and positioning but depending on your vertical, they attract researchers, students, interns, data analysts, who are all great people but likely don't have huge budget or need to buy your full product, or the internal pull to make it happen. Again, awareness vs. ROI. Case studies work.\n11. And the same whitepaper can be positioned differently for those budget-conscious personas to get their attention.\n12. Pro tip: Mention  \"career,\" \"job,\", \"Your team\", \"falling behind\", \"becoming irrelevant,\" \"getting ahead,\" \"stay updated,\" etc because in the end it's a career preservation social platform. Good luck and keep us posted.\n\n(Edited for numbering)",
          "score": 1,
          "created_utc": "2026-01-21 21:34:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0xum66",
          "author": "MontrealKyiv4477",
          "text": "Ads are working only if you know what you want to achieve by running them. Google ads can drive traffic and boost your online presence especially if you run ads for branded queries or against competitor brand names. Then it’s up to your site and technics you are using to convert that traffic - depending on your product, business model and sales cycle. That could be trials, gated content, optimised content assets, etc. Now on LinkedIn you can run ads within the platform and if leadgen is your target - use document ads under LinkedIn forms to generate prospects and then work with them to nurture to conversion. 1.5-2k a months for LinkedIn ads is a sufficient budget. With cpl around 3 dollars you can generate a good list of prospects to work with.",
          "score": 1,
          "created_utc": "2026-01-21 22:21:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0y7zxo",
          "author": "blawblahh",
          "text": "I'd rather focus on curated outreach rather than paid ads.",
          "score": 1,
          "created_utc": "2026-01-21 23:30:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0yhfng",
          "author": "Aly_sherif",
          "text": "I’m a marketer and ads specialist so let me tell you what i know from experience… \nTo understand the reasons for the results you are getting you basically need to go to the customer’s journey, so if the customer is searching for something specific he will search on google, an ad could be useful to get in front of him but this customer will see multiple websites like yours then he will be looking somewhere else to validate the choices he will make. \n\nBut what if he knows a one of these choices before this search process? What makes sense is that he will need less validation and more likely to get to the next step faster whether to book a call or to subscribe. \n\nBased on my experience with an AI b2b startup, companies like these needs to deploy itself somewhere and build a strong presence utilizing content and communication with its target audience to get a better chance communicating with the same audience else where …. So choosing LinkedIn could be a better solution at your stage for sure. \n\nBut you won’t be able to get ROI from sales focused ads right now, what you need to focus on is choosing a specific segment of audience (an industry or a specific job title) and start boosting content that delivers your message to them, raise their awareness about your existence and raise the brand recognition. This is called top of the funnel (TOFU) \n\nAfterwards, you can create sales ads for this segment, but when you do you will be sure that you have built your presence and that your target audience are recognizing you, so you get a better chance in communication with them (middle of the funnel), and then you close them through sales efforts. \n\nI hope my comment was helpful, and if you need any further information from me or have any questions feel free to message me directly.",
          "score": 1,
          "created_utc": "2026-01-22 00:21:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0zcbp4",
              "author": "Bubbly-Tangerine-284",
              "text": "Second all at. ICP definition is crucial but none of that really matters if you aren’t prepped and in the right space.",
              "score": 2,
              "created_utc": "2026-01-22 03:14:32",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o10msk0",
                  "author": "Aly_sherif",
                  "text": "That’s for sure, if you don’t have a clear ICP you won’t have a target audience to focus on",
                  "score": 1,
                  "created_utc": "2026-01-22 09:11:46",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0yucyt",
          "author": "ConnorSol",
          "text": "Ads for retargeting your outreach efforts",
          "score": 1,
          "created_utc": "2026-01-22 01:32:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0z897e",
          "author": "signalpath_mapper",
          "text": "At that spend, I’d calibrate expectations hard. LinkedIn will get you targeted eyeballs, but $2–3k/month usually buys learning, not results. Where I’ve seen it help is clarity, which message gets ignored, which title clicks, which segment doesn’t care at all. If you treat it as a fast feedback loop instead of a growth channel, it can be worth it. If you expect pipeline, you’ll probably be disappointed.",
          "score": 1,
          "created_utc": "2026-01-22 02:51:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0zqy8r",
          "author": "Hardheadedsoftskills",
          "text": "It’s enough to get results. The quality and quantity of your creative is important though. DM if you want help there.",
          "score": 1,
          "created_utc": "2026-01-22 04:46:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0zvc9i",
          "author": "QuantumWolf99",
          "text": "Nope.",
          "score": 1,
          "created_utc": "2026-01-22 05:17:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o109ook",
          "author": "Amulyakumarr",
          "text": "I think you should start organically (Cold Emails, SEO Strength, Link Building), find your target audience, and then commit to paid ads.",
          "score": 1,
          "created_utc": "2026-01-22 07:11:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o10ogj9",
          "author": "Dutchmany",
          "text": "I create a list of several thousand potential customers and then advertise to them on LI, Google display, and Meta. LI is likely the most expensive. Focus on customer problems, not your product. \n\nThen after a  month, when you have some brand awareness, have sales start to do outreach to them. Combine this with other channels: organic posts, webinars, etc. Combined they can move the needle.",
          "score": 1,
          "created_utc": "2026-01-22 09:27:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1d9tex",
              "author": "kindie123",
              "text": "Hey I texted",
              "score": 1,
              "created_utc": "2026-01-24 04:00:40",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o10usll",
          "author": "Fred-swe",
          "text": "The budget mus be put in relation to the audience you try to reach. Do you taget 500 named accounts or 50.000?",
          "score": 1,
          "created_utc": "2026-01-22 10:26:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o11gghc",
          "author": "Only_Performer9165",
          "text": "Hi,\n\nGuess the challenge is everywhere. I have been prudent about spending money on ads and if you are not skilled enough , the organic reach will not be  helpful either. I am a new startup(cybersecurity risk and compliance) and  new to business. A sole soldier battling and still struggling to get that very first client. The challenge for me has not been the market but the awareness in this area.  \n\n I am trying to do the following, not sure if it would work, but there is no harm in trying. \n\n1. Insert SEO keywords on to your company page (For Inbound traffic). Try google or chatgpt to get some idea\n\n2. Try to attend online and offline events including pitch events across your city where you get connects\n\n3. Try referrals. \n\n4.  Having the right mentor to guide you. Trust me this is helping me a lot. \n\n\\- Cheers",
          "score": 1,
          "created_utc": "2026-01-22 13:08:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o132sf6",
          "author": "nirvanababes",
          "text": "Start with content ( how to content, that solve users search and the pain point , you don’t necessarily have to go after the whole market \nTake out a micro niche and then solve their problems effect \nTo create awareness \nYou could create content via your company blogs \nLinkedIn thought leadership as well \nOrganic may take awhile \nBut it will give you the best ROI",
          "score": 1,
          "created_utc": "2026-01-22 17:50:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1396qs",
          "author": "sculptsocial",
          "text": "Let's fast forward. It's you, a week older (and wiser). The ads are off, the budget is spent. The results are in:\n\nYou spent $1500. You reached 6,818 people in your ICP ($220 CPM), and drove 375 engagements at a $4 CPE (clicks, reactions). You go back to your question. \"Did it move the needle?\"\n\nThis is the situation you want to avoid. Not because that's necessarily good or bad. But because you have nothing to compare to in order to understand it.\n\nIf you want better insights from your experiment, make sure you're amplifying multiple TL ads, each with a distinct angle (framing). Rather than test small elements, or major ones like audience targeting, focus on how you're presenting your value proposition overall.\n\nThe idea being you won't just learn WHAT LinkedIn brought for $1500 worth of exposure from your ICP, but also WHICH messaging angle resonates.\n\nThat way it's not just \"how many clicks did we get in a week vs. what we hoped\" but \"which message angle/offer actually performed better based on reactions or click efficiency.\n\nHelpful?",
          "score": 1,
          "created_utc": "2026-01-22 18:18:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1da9cx",
              "author": "kindie123",
              "text": "Check",
              "score": 1,
              "created_utc": "2026-01-24 04:03:33",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1561mz",
          "author": "hkg2jfk",
          "text": "I‘d go retargeting only - this is just my 2ct after years of experience and working with +10 of the leading US LinkedIn agencies! They make it sound like it‘s the holy grail but almost no account I‘ve seen was able to buy cold traffic, profitably, on LinkedIn. Like other members here said, it‘s all about expectations. Hope this helps",
          "score": 1,
          "created_utc": "2026-01-22 23:49:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o16s83s",
          "author": "alexboyd08",
          "text": "Well did you use PMax on Google ads…? That’s prob why you got Google display junk",
          "score": 1,
          "created_utc": "2026-01-23 05:25:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o18124m",
          "author": "Hopeful-Candle-8442",
          "text": "I’ve been there—bootstrapped, great product, but the channel hunt feels like throwing darts blindfolded. LinkedIn’s targeting \\*can\\* work for B2B, but your $1.5k test might burn fast if you’re not hyper-specific. Try running 3-5 variations of the same ad (different hooks/visuals) to see what resonates, then double down on the winner. Have you tested any organic LinkedIn content first to validate messaging?",
          "score": 1,
          "created_utc": "2026-01-23 11:49:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o197gjt",
          "author": "Dismal_Cartoonist_45",
          "text": "You can get qualified inbound leads when you're posting content on LinkedIn intentionally with that price that you just spend on ads.",
          "score": 1,
          "created_utc": "2026-01-23 15:44:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1bifz5",
              "author": "likethestonx",
              "text": "Definitely. Just don't tell an agency about your current budget.",
              "score": 1,
              "created_utc": "2026-01-23 22:06:24",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1d4a8j",
          "author": "mada299",
          "text": "I think this is worth it if you use it to promote posts of you leaders or employees that are already getting organic traction, vs regular ads.",
          "score": 1,
          "created_utc": "2026-01-24 03:26:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1d5ivc",
          "author": "Analytics-Maken",
          "text": "A small budget on LinkedIn ads delivers impressions and clicks, but leaves you guessing which signals matter, especially alongside Google Ads. You can use ETL tools like Windsor.ai to centralize both sources into one dashboard to monitor test performance and resolve the question.",
          "score": 1,
          "created_utc": "2026-01-24 03:33:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1enoim",
          "author": "weoter",
          "text": "Ask yourself what is my goal? Early stage startups are usually about lead generation so how many leads do you want to get for this to be successful. Consider a cost per lead of at least a few hundred dollars if not more in developed countries. You pay a premium with LinkedIn for the B2B targeting so cost per lead is significantly higher with lower intent",
          "score": 1,
          "created_utc": "2026-01-24 10:53:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1m22bm",
          "author": "Jo-callaway",
          "text": "100% worth it, only if you do it write.\n\nIn a nutshell, LinkedIn performs best when you boost a post that is already performing well and also when you use it for retargeting your page visitors and other types of engagements.\n\nFor cold audience, specially if you’re not 100% confident with LD targeting : not so much",
          "score": 1,
          "created_utc": "2026-01-25 13:14:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1me31m",
          "author": "cedarconsultants",
          "text": "This is great",
          "score": 1,
          "created_utc": "2026-01-25 14:23:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1mx3g2",
          "author": "vikasdwg",
          "text": "I think the problem is not about the platform. Even you can get the right people on Meta ads also. You need to define your target audience in a right way. \n\nAll platforms have its own individual way to target same kind of audience or you can say the same user on different platforms. \n\n1. Try to find your best business keywords not a large amount even only 5 to 10 keywords would work for you. \n\n2. If you want to go linkedin try to publish leadership and problem solving content around your product and try to make personal connections with your target audience.\n\n3. Make a highly customized website with 0% fluffy content precise to your problem solving features. Do SEO on that. This will be the cherry on top for your product to get awareness towards your brand. \n\nI have done this same pattern for our B2B clients and this worked.",
          "score": 1,
          "created_utc": "2026-01-25 15:56:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0w0ilf",
          "author": "itsgediminas",
          "text": "Please take a moment and look into affiliate marketing! It changed everything for us to stop spending with ADS and started paying for real sales. Reach out if you need any help with it.",
          "score": 1,
          "created_utc": "2026-01-21 17:23:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o11g985",
              "author": "TheGolfersHandBible",
              "text": "Why?",
              "score": 1,
              "created_utc": "2026-01-22 13:07:20",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0vezhj",
          "author": "Tiny-Celery4942",
          "text": "I hear you. Finding that repeatable channel is tough when you're bootstrapped. I was in the same boat, burning cash on Google Ads with little to show for it.\n\nFor LinkedIn, $1.5k for a week on thought leadership ads could move the needle, especially with solid social proof. The key is consistent engagement. What actually worked for me was turning LinkedIn into a daily system.\n\nHere’s what I do:\n\n\\- Prospect List: Build a list of 50 to 150 ideal customer profile accounts.\n\n\\- Mini Feed: Focus only on posts from that list.\n\n\\- Real Comments: Leave 10 to 20 comments daily, adding insights or questions.\n\n\\- Warm Connections:  Send requests only after a few touchpoints.\n\n\\- Contextual DMs:  Keep them short, specific, and relevant.\n\n\\- Follow Ups: Track replies and follow ups daily.\n\nTo keep a targeted feed of prospects and draft comments, personlized DM, Follwoup reminders I use Depost AI. It also helps me track follow ups so I don't miss anyone.",
          "score": 0,
          "created_utc": "2026-01-21 15:47:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0w140e",
          "author": "resonate-online",
          "text": "First off - do NOT shut off your google ads.  Let's them run at the minimum it will allow.  Every time you shut them off, you have to start new again when you start back up.  Keep the most basic ad going so that you don't lose the data.\n\n  \nI don't believe LI works the same way.  LI can be really hard.  You need to have really good targeting and you need to know what you are trying to accomplish with the ads.\n\n$2k-$3k is enough to get started depending on industry.\n\n  \nHappy to chat through it with you if you want to PM me.",
          "score": 0,
          "created_utc": "2026-01-21 17:26:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0w50sa",
              "author": "Cold_Quarter_9326",
              "text": "oh yeah, google's algorithm is not good with stopped campaigns",
              "score": 1,
              "created_utc": "2026-01-21 17:43:44",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qjrdax",
      "title": "Reddit as a b2b channel",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qjrdax/reddit_as_a_b2b_channel/",
      "author": "celeskush",
      "created_utc": "2026-01-22 10:45:32",
      "score": 26,
      "num_comments": 53,
      "upvote_ratio": 0.96,
      "text": "Hi fellow marketers. I'm a content/growth manager working for a SaaS startup and looking for new channels to test in 2026. I've been considering Reddit as a possible channel for GEO and awareness. Has anyone tested it yet? Where should i start? I've never used Reddit even for myself so i'm very new to this :)) Thanks a lot",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qjrdax/reddit_as_a_b2b_channel/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o10wx2k",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-22 10:45:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o157h3z",
          "author": "amoorthy",
          "text": "Hello! My colleague wrote up a guide on Reddit for marketing that has been well received by our customers and non-customers so you may find useful.\n\nIt covers if and how Reddit influences LLM answers, how to get started with Reddit marketing (build karma, don't get banned), and generally how to be a good Redditor rather than a spammy one.\n\nI'm not sure if we can post links in this subreddit so it's the 3 most recent posts at blog dot rocksalt dot ai. I can answer any specific questions if you have.",
          "score": 2,
          "created_utc": "2026-01-22 23:57:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o11808g",
          "author": "MendMySoulXoXo",
          "text": "Reddit as a growth channel is great! Especially for GEO. I was able to bring LLM visibility for my SaaS within 10 days of organic reddit marketing. Would love to connect and share how i started. \n\nBtw above recommended agency The Orange Project .Co is exceptionally good in terms of organic reddit marketing. These guys are pro at it. Their approach helped improve our searchability and brand awareness on reddit.",
          "score": 3,
          "created_utc": "2026-01-22 12:13:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o120ee9",
              "author": "celeskush",
              "text": "Oh wow 10 days! I would be happy to connect and talk about it",
              "score": 1,
              "created_utc": "2026-01-22 14:54:11",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o1aszwx",
              "author": "Digi-Dave",
              "text": "Hi, mind sharing your strategy? I would love to learn as well!",
              "score": 1,
              "created_utc": "2026-01-23 20:06:51",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1eq5zt",
                  "author": "MendMySoulXoXo",
                  "text": "One thing I should add (for full transparency).. we did have an unfair advantage going in.\nOur brand was already getting organic, positive mentions on Hacker News and a few other forums, including Reddit. So there was already some ambient trust when people checked us out.\nThat said, Reddit still didn’t reward promotion. What helped was leaning into explanation-first replies rather than trying to amplify the brand mentions. The existing chatter just made it easier for people (and AI tools) to connect the dots once they saw consistent, useful answers.\nIf you’re starting from zero, the same approach still works, it just takes longer. The core driver wasn’t the mentions themselves, but the clarity and consistency of how we explained the problem and tradeoffs.\nHappy to expand on how we’d do this from scratch too.",
                  "score": 1,
                  "created_utc": "2026-01-24 11:16:17",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o113505",
          "author": "Alone_Ad_3375",
          "text": "I'm a reddit marketer helping enterprises, would love to help you get started with it.\n\nIf you could tell your startup name I can build a custom strategy for you to use including all the subreddits and sops we personally use :)\n\nBtw I run The Orange Project. Co, an enterprise Reddit marketing agency.",
          "score": 1,
          "created_utc": "2026-01-22 11:37:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1207se",
              "author": "celeskush",
              "text": "I would be happy to connect!",
              "score": 1,
              "created_utc": "2026-01-22 14:53:17",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o1286dt",
              "author": "sanfranciscolady",
              "text": "Would love to connect and swap notes. I run a small B2B growth agency and we do some Reddit strategies.",
              "score": 1,
              "created_utc": "2026-01-22 15:31:44",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o13f1n3",
                  "author": "Alone_Ad_3375",
                  "text": "dm sent",
                  "score": 1,
                  "created_utc": "2026-01-22 18:43:57",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o11nyuf",
          "author": "barefamting",
          "text": "Who are your customers?",
          "score": 1,
          "created_utc": "2026-01-22 13:50:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o11zt0g",
              "author": "celeskush",
              "text": "ESG/sustainability professionals!",
              "score": 1,
              "created_utc": "2026-01-22 14:51:18",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o128iif",
                  "author": "barefamting",
                  "text": "Too broad. Needs to be more specific. What specific pain points do they have and what have they tried so far?",
                  "score": 2,
                  "created_utc": "2026-01-22 15:33:20",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o11qj6g",
          "author": "lhlb",
          "text": "This is something I've been looking into for a client a fair bit. There's lots of stats out there to suggest it's worthwhile but I think this is mostly where there's already well-established communities, like in tech, cybersecurity, SEO, PR, and marketing spaces. I couldn't quite find an existing space or community that mapped well to my client's business, but that doesn't mean there would be one (or several) for yours!\n\nHowever, Redditors are quick to downvote thinly-veiled promotion, so sharing highly relevant, genuinely useful, educational content is the way to go to build up karma and credibililty.  \n\n  \nI'd be really interested to know thoughts on whether to use a real name or pseudonym for this kind of work though. Some thought leaders post under their names and I've been told it's always important to disclose any affiliation with a company for complete transparency, but the majority of Reddit users are fairly anonymous.",
          "score": 1,
          "created_utc": "2026-01-22 14:03:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1205ar",
              "author": "celeskush",
              "text": "I guess the good news is that the company i'm working for has a lot of vulgarization content on our topic (ESG, european regulations, climatic science..) i guess it could be a good start to share our knowledge and content without making it sales-y?",
              "score": 1,
              "created_utc": "2026-01-22 14:52:57",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o17h1js",
                  "author": "lhlb",
                  "text": "Yes absolutely! It helps to build up karma too by commenting and sharing genuinely valuable insight because some communities don't let you post until you've met a certain threshold.",
                  "score": 1,
                  "created_utc": "2026-01-23 08:53:55",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o15qiaa",
          "author": "abdraaz96",
          "text": "yes it works great, 20+ of our clients we applying this, and the results are just amazing.",
          "score": 1,
          "created_utc": "2026-01-23 01:40:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o15xhee",
          "author": "cole-interteam",
          "text": "In my experience, Reddit works well for B2B SaaS. However, I would think of Reddit in terme of high-intent conversations that provide long-tail research.\n\nWhen starting out and using organic approach, I would suggest selecting two or three subreddtis where your target costumers are asking the question your product solves. Lurk on those communities for a period, and then, create detailed answer that provide value, but not a sales pitch. The outcome will tell you whether your product aligns with your ICP and the type of content each community discuss. \n\nAs for paid ads, we have had our most sucess on Reddit Ads, especially through conversations. We begin by selecting a very small number of highest fit subreddits, running thread level ads to a middle funnel asset such as a guide or comparison page, and tagging every ad in the CRM using UTM's to allow us to determine which subs and threads are really converting.",
          "score": 1,
          "created_utc": "2026-01-23 02:19:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o16ggje",
          "author": "AdamYamada",
          "text": "Yes Reddit is key for chatbots and LLMs. ",
          "score": 1,
          "created_utc": "2026-01-23 04:08:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o16nqmf",
          "author": "fkingdiabolical",
          "text": "I've seen it work firsthand. I've done freelance reddit for a marketing automation SaaS brand and the posts and responses have been great. Got some referral traffic as well to key money pages on their website. Happy to help do it for your brand as well.",
          "score": 1,
          "created_utc": "2026-01-23 04:54:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o16oauf",
          "author": "InevitableCamera-",
          "text": "Reddit can work, but only if you treat it like a community, not a distribution channel",
          "score": 1,
          "created_utc": "2026-01-23 04:58:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o16uw1r",
          "author": "james-porter1",
          "text": "reddit works great for B2B but you need to be careful. best approach; genuinely help people and mention your product only when it solves their exact problem.",
          "score": 1,
          "created_utc": "2026-01-23 05:45:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o178ddf",
          "author": "signal_loops",
          "text": "yes, Reddit can work for B2B but only if you treat it as a community, not an ad channel. start by lurking in 5–10 relevant subreddits vLearn what gets upvoted and what gets downvoted. Post value first, insights, lessons learned, mistakes, data. Avoid links early.",
          "score": 1,
          "created_utc": "2026-01-23 07:35:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1f9jps",
          "author": "Federal_Chipmunk8779",
          "text": "I’m in a similar situation. More familiar with LinkedIn though now considering Reddit",
          "score": 1,
          "created_utc": "2026-01-24 13:40:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1l6xkz",
          "author": "swedishtea",
          "text": "If you play it right it can be great for b2b, but way too many brands just spam without value which is not a good look. The Growth Hacking Reddit book is a solid guide on how to do it the right way for organic growth b2b - for example 95/5 value to plug, not to talk in corporate, and be part of the community not an outsider",
          "score": 1,
          "created_utc": "2026-01-25 08:56:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1mbuzu",
          "author": "mohamednagm",
          "text": "use Reddboss",
          "score": 1,
          "created_utc": "2026-01-25 14:11:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o117456",
          "author": "another_sleeve",
          "text": "Reddit works wonders, and you can see a lot of people doing it out in the wild.\n\nThe most basic thing you can do is set up something like F5 bot to alert you if conversations around the pain point / your solutions pop up and jump in with a branded profile to answer.\n\nA bit more shadier but increasingly popular is to get into relevant niche subreddits and use multiple accounts to start discussions around the problem space/solution and plug in yours as the answer. If you overdo it people will catch on and downvote you into oblivion, but guess what, since Google loves displaying reddit in the SERP, it's a no brainer to own BOFU keywords with reddit convos.\n\nThe more advanced/long term play is to start a reddit community that you moderate, either around the problem space or your solution itself, but this is very niche dependent - it mostly works for broad user-base PLG companies.",
          "score": 1,
          "created_utc": "2026-01-22 12:07:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o16qfxl",
              "author": "rainmakerdigital",
              "text": "There are a ton of astroturfing accounts on here. We've started posting for the brand on Reddit just recently, and it's a bit disheartening seeing how much of the conversation on here is being driven by new usernames plugging \\[random SaaS you've never heard of\\] in 20 threads in a row.",
              "score": 1,
              "created_utc": "2026-01-23 05:13:04",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o17nsmg",
                  "author": "another_sleeve",
                  "text": "tbh reddit is a half-dead platform in terms of cultural relevance, but it gets so much traffic it'd be insane to ignore",
                  "score": 2,
                  "created_utc": "2026-01-23 09:57:12",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o12chg5",
          "author": "heyimkrista",
          "text": "Hey there! I run a Reddit marketing agency and I’m actually starting a space to help educate marketers who are new to Reddit (think weekly lessons, templates, etc). I’ve talked to so many who also don’t know where to start! Lmk if you want more info :)",
          "score": 1,
          "created_utc": "2026-01-22 15:51:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o12cp5c",
              "author": "celeskush",
              "text": "I would be happy to connect!",
              "score": 1,
              "created_utc": "2026-01-22 15:52:35",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o13ok3o",
          "author": "theguywhobuilds",
          "text": "Reddit works for B2B, but only if you treat it like a long-term presence, not a channel you “run campaigns” on. It’s good at shaping opinion, earning trust, and staying top-of-mind long before someone is ready to buy, which means it behaves more like demand creation than lead gen. If you show up consistently, answer real questions, and don’t try to sell, people remember you when the timing finally clicks.\n\nIf you come in expecting quick leads or try to force CTAs, it’ll fail fast. Reddit rewards patience and clarity, not urgency.",
          "score": 1,
          "created_utc": "2026-01-22 19:26:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o117fbb",
          "author": "Responsible-Brick881",
          "text": "Im looking into it myself too!\n\nOn a separate note though, im the founder of an Irish start up that helps build brand awareness through premium video on sites like forbes, business insider, WSJ, etc.\n\nI actually built it with DTC in mind as i also have the likes of premium fashion sites like Vogue and GQ, but I've ended up getting way more interest from the B2B tech/saas space as they're very interested in getting their videos in front of senior decision makers on the news sites they spend time consuming content. This means they're not on a busy social feed and at a high attentive frame of mind. My first 2 customers after launching at the start of this month have both been B2B so maybe I'm on to something. \nI'd be happy to run you through it - no hard sell - Im at the point where I'm keen to just get some feedback from b2b marketers to validate if its the vertical I should be focusing on. \nBeen in adtech for 11 years so worst case scenario, I can give you some general insight on various platforms.",
          "score": 0,
          "created_utc": "2026-01-22 12:09:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o12j9al",
              "author": "International_Rip706",
              "text": "Interesting start up, name?\n\nLike Linkby but video and for B2B, which is kind of what they’re missing",
              "score": 0,
              "created_utc": "2026-01-22 16:22:08",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o12f9jv",
          "author": "MORPHOICES",
          "text": "Last year, I went to Reddit as a B2B channel when I was looking for something earlier than SEO, less designed than LinkedIn.  \\~\n\nThe most shocking thing was that any mention of “channel strategy” was punished, while very narrowly defined problem stories were rewarded. In the beginning, I mistakenly believed in subreddits + content themes. That failed.\n\nThe solution we developed was to treat each subreddit like a small industry room – lurking for a couple weeks, noticing the same questions repeating, then replying with one concrete experience (what we tried, what broke, what we learned). No hyperlinks or calls to action.\n\nAs you set out to growth-hack your startup, here is a simple takeaway: don’t test Reddit as a distribution channel. Give it a test as your listening channel. \n\nAfter reading a week’s worth of posts, if you can’t see recurring pain points, it’s probably not worth B2B anyway.",
          "score": 0,
          "created_utc": "2026-01-22 16:04:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o12hi3u",
          "author": "algatesda",
          "text": "Last year I was trying my hands in Reddit and getting good traction for idea validation for your solution .If you help people on solving their with your solution .Need any help DM",
          "score": 0,
          "created_utc": "2026-01-22 16:14:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o12mdod",
          "author": "PianoRevolutionary72",
          "text": "Podcast ads, it’s working very good for SaaS right now, if you know how and with who to do it.",
          "score": 0,
          "created_utc": "2026-01-22 16:35:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o12xrsh",
          "author": "Consistent-Let-537",
          "text": "Interesting, but not sure how much time as per Google updates.",
          "score": 0,
          "created_utc": "2026-01-22 17:27:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o134g3n",
          "author": "Cold_Respond_7656",
          "text": "We are a cybersec intelligence platform and Reddit worked amazing for us.\n\nAll we did was write up Reddit posts from our blog posts, post those write ups into security subs like r/cybersecurity or specific tech subreddits, with a link to our page at the bottom of the post and before we knew it Google had us well indexed and we started getting a lot of traffic specifically from GPT and Perplexity\n\nFor example this one that drew in >100k views and 1450 shares\n\nhttps://www.reddit.com/r/cybersecurity/s/IhtCoSv65b\n\nOr this one that brought it >750k views with more than 5000 shares \n\nhttps://www.reddit.com/r/OpenAI/s/WHba8uPIr7\n\nTraffic on the site exploded",
          "score": 0,
          "created_utc": "2026-01-22 17:57:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o119ucg",
          "author": "dextert48",
          "text": "Mostly a waste of time",
          "score": -2,
          "created_utc": "2026-01-22 12:26:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o11k7sw",
          "author": "evilbarron2",
          "text": "B2B? Is this a new acronym for “Business-to-bot” marketing?\n\nI’d need to see some independent evaluations of what percentage of the Reddit audience are bots or other IVT before I put my money or effort into it. ",
          "score": -2,
          "created_utc": "2026-01-22 13:30:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o126rn1",
              "author": "wildcard_71",
              "text": "Hi, I’m a bot. /s",
              "score": 0,
              "created_utc": "2026-01-22 15:24:56",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qhxc7b",
      "title": "How do you fit everything into a one pager?",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qhxc7b/how_do_you_fit_everything_into_a_one_pager/",
      "author": "Basic-Ear6164",
      "created_utc": "2026-01-20 10:13:21",
      "score": 24,
      "num_comments": 10,
      "upvote_ratio": 1.0,
      "text": "Everyone in my company's bugging me about making more one pagers but I've no idea how to summarize everything so neatly. \n\nMaybe I'm just Bloaty McFlufferson but how do you decide what actually belongs on a one pager?",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qhxc7b/how_do_you_fit_everything_into_a_one_pager/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o0n5pcx",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-20 10:13:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ng8v4",
          "author": "launchnote",
          "text": "lol at “Bloaty McFlufferson” \n\nI usually think of one-pagers as “what do I want someone to *remember or act on*?” If it doesn’t affect a decision, it’s out.\n\nMy formula:\n\n* **Headline / key takeaway** – 1 line\n* **Top 3–5 points** – only the essentials.. so only things that influence decisions or next steps. Anything nice-to-know gets cut\n* **Visuals / bullets** – make it scannable, tables, charts, or bullets that convey info at a glance is great\n\nif someone only had 30 seconds to read it, would they walk away knowing the main thing? If yes, you've nailed it.",
          "score": 3,
          "created_utc": "2026-01-20 11:44:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0o0um2",
          "author": "CommsConsultants",
          "text": "Bloaty McFlufferson needs to be a recurring character somewhere.",
          "score": 5,
          "created_utc": "2026-01-20 13:57:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ojydq",
          "author": "quantumjedi",
          "text": "Smaller font. :D\n\nBut no, seriously.. focus on the art of using a lack of details to act like a hook. Figure out which ones you really need to expound on, and on the others, frame them in a way that baits the hook to make them want to ask \"wait, what does that mean?\"",
          "score": 2,
          "created_utc": "2026-01-20 15:34:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0nw611",
          "author": "KissyyyDoll",
          "text": "I totally feel you on this. It's so hard to cut things down when everything feels important.\n\nMy trick is focusing only on the \"so what\" for the reader. If a detail doesn't directly solve their main problem or help them make a decision, it goes to the appendix or a separate deck. Icons and bullet points are your best friends too. They save so much space compared to full sentences.",
          "score": 1,
          "created_utc": "2026-01-20 13:31:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0pechw",
          "author": "chandj054",
          "text": "just being to the point, smaller font. I've found that targeting is more important though so something i've made a habbit of is verifying the lists i send emails to cause that's extrememly improtant. i use two verification tools at the same time, email verifier io and millionverifier. Keep your copy neat and factual, present your use case for your product at first, a person who wants to buy it will",
          "score": 1,
          "created_utc": "2026-01-20 17:55:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ra265",
          "author": "phillcivi_1286",
          "text": "I second Bloaty McFlufferson being a recurring character. Can relate HARD. \n\nI, too, was not born with the \"concise\" gene. Even when I follow some of the formulas shared by the other commenters (focusing on the \"so what\", bullet points, visuals etc.), I still find myself a little long-winded.   \n  \nFor better or worst, I've found using ChatGPT as a final editor is the quickest way to help me see and cut the fluff based on my content goals. I'll share my long draft and ask it to help me find a more comprehensive word, write a more succinct description, find opportunities for bullet points, etc. I try not to rely too heavily on Chat creating information from scratch (and definitely not suggesting layouts - it's comically terrible at that) but it's a good final polishing tool.   \n\n\nGood luck on your unfluffing endeavors!",
          "score": 1,
          "created_utc": "2026-01-20 23:12:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0xp6s5",
          "author": "erickrealz",
          "text": "One-pagers are about solving ONE specific problem for ONE specific buyer, not cramming your entire service offering onto a page. Most people screw this up by trying to include everything and end up with tiny font nobody reads.\n\nThe formula that works: problem statement (2 sentences), your solution (3 sentences), proof it works (one stat or case study result), clear next step. That's it. Everything else is fluff. Our clients doing B2B sales see way better conversion when their one-pagers focus on a single use case instead of trying to be a complete company overview.\n\nIf you're struggling to fit everything, you're probably trying to make one one-pager do too much work. Create different versions for different buyer personas or use cases. A CFO cares about cost savings, a VP Ops cares about efficiency, so make separate one-pagers targeting each with relevant messaging and proof points.\n\nReal talk, if your company is bugging you for more one-pagers but can't tell you who they're for or what problem they solve, that's the actual issue. Get clarity on the audience and purpose first, then the content decisions become obvious.",
          "score": 1,
          "created_utc": "2026-01-21 21:55:49",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qk1sdz",
      "title": "Anyone here actually managed to create a realistic AI for product demo video",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qk1sdz/anyone_here_actually_managed_to_create_a/",
      "author": "PinkVelvet_Simmons",
      "created_utc": "2026-01-22 18:04:20",
      "score": 23,
      "num_comments": 5,
      "upvote_ratio": 0.97,
      "text": "We’re a small saas team and product demo videos are taking up so much of our time.\n\nEvery time we ship something (even something small) we’re filming new videos from scratch and having to outsource to freelancers etc to edit them.\n\nI’m noticing more companies using the same “presenter” across demos, but it’s clearly not a real person re-filming every time. looks like some kind of AI spokesperson setup.\n\ni’m not anti filming, just tired of redoing the same stuff over and over. We can’t afford to expand right now and we can’t keep spending all our time and budget on these videos.\n\nCurious if anyone’s actually switched to an AI avatar and if so…\n\ndid users care?\n\ndid it feel less trustworthy?\n\nor did it just… solve the problem and no one noticed?\n\nTrying to figure out if this is smart or if i’m just burned out lol.",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qk1sdz/anyone_here_actually_managed_to_create_a/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o13616a",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-22 18:04:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o14xktf",
          "author": "kubrador",
          "text": "you're burned out but also right. ai avatars work fine for saas demos because nobody's emotionally invested in the presenter. they want to see the product do the thing.\n\nsynthesia/heygen are the go-to's and honestly they're indistinguishable from tired freelancers at this point. biggest risk is looking \\*too\\* polished and creepy, but a slightly awkward ai avatar reads as \"startup\" not \"uncanny valley.\"\n\njust record yourself once with good lighting, use that for 6 months, update quarterly. way less burnout than redoing everything, way cheaper than freelancers, and way less sus than an ai that nobody asked for. you're a saas team, not a production company.",
          "score": 3,
          "created_utc": "2026-01-22 23:05:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1a3x13",
          "author": "aimdoc-ai",
          "text": "we're building something to essentially skip over that. basically an AI buyer copilot that:\n\n* engages prospects when they land on your site\n* determines if they're a fit based on your criteria\n* shows your product + sets it up based on what they're most interested in\n\nwhat I landed on was, why demo the product when AI can set it up for them in real time and show value?",
          "score": 1,
          "created_utc": "2026-01-23 18:11:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o154a0l",
          "author": "Low-Cardiologist-432",
          "text": "Just sent you a DM!",
          "score": 0,
          "created_utc": "2026-01-22 23:40:16",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qhu2pd",
      "title": "Made a tool for marketing, would love to share with others!",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qhu2pd/made_a_tool_for_marketing_would_love_to_share/",
      "author": "Fabulous_Brain_8077",
      "created_utc": "2026-01-20 06:56:02",
      "score": 21,
      "num_comments": 1,
      "upvote_ratio": 0.93,
      "text": "Hey everyone,I'd love to help some founders here get their paid ads going.We're Ryze AI. We've worked on 500+ ad accounts at this point and want to give back a bit.\n\nFor the first 5 B2B SaaS founders who reply, we'll create your ads for free:  \n\\-Ad copy (headlines, descriptions)  \n\\-Images / creatives  \n\\-Campaign setup\n\nAll I need from you:  \n\\-Your website  \n\\-One sentence on who it's for\n\nDM me or drop it in the comments. First 5 only.",
      "is_original_content": false,
      "link_flair_text": "Support",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qhu2pd/made_a_tool_for_marketing_would_love_to_share/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o0mk9qc",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-20 06:56:02",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qh1dap",
      "title": "What’s broken when I’m getting leads but they’re not converting to revenue?",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qh1dap/whats_broken_when_im_getting_leads_but_theyre_not/",
      "author": "Free_Muffin8130",
      "created_utc": "2026-01-19 11:08:04",
      "score": 20,
      "num_comments": 20,
      "upvote_ratio": 0.81,
      "text": "We’re generating leads consistently through content, outbound, and a bit of paid, but revenue isn’t following. On paper, things look fine, MQLs are coming in, CAC isn’t crazy, and sales is following up. But deals stall, timelines stretch, or leads go cold after the first few touches.\n\nI’m trying to understand where the real break is:\n\n1. Lead quality vs. targeting?\n\n2. Messaging mismatch between marketing and sales?\n\n3. Wrong funnel expectations for B2B buyers? \n\nIf you’ve been through this phase, what was actually broken for you and what fixed it?",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qh1dap/whats_broken_when_im_getting_leads_but_theyre_not/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o0ghqzc",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-19 11:08:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0tj5nb",
          "author": "Waltace-berry59004",
          "text": "In our case, marketing was doing its job, but sales messaging didn’t match the promise that got leads in. Tightening that gap made a bigger difference than adding more leads. thewayhow has some good frameworks around aligning demand gen with sales reality if you’re stuck in that loop.",
          "score": 4,
          "created_utc": "2026-01-21 07:58:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0glr4p",
          "author": "Wide_Brief3025",
          "text": "Lead quality mismatches are a big culprit, especially if MQL definitions are vague or not aligned with sales feedback. Tightening your qualification criteria and syncing on ICP between teams can help. Using a tool like ParseStream to monitor conversations and filter for intent signals has helped us spot better fit leads before they enter the funnel, making followups way more productive.",
          "score": 1,
          "created_utc": "2026-01-19 11:42:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0gslfm",
          "author": "SubjectIllustrious93",
          "text": "\"Everything looks fine on dashboards but revenue lags\" is a very frequent occurrence.\n\nAccording to my observations, it's typically one of the following (or a combination):\n\nThe wrong buyer at the wrong time. Leads stall after the initial touches because they may be \"qualified\" on paper but not during an active buying window.\n\nExpectation gap plus handoff. The buyer becomes confused or loses urgency when marketing makes one promise and sales has a different conversation.\n\nThe stage you're measuring is incorrect. While MQL → SQL → opp quality is poor, MQL volume and even follow-up speed may appear healthy.\n\nThere's no obvious \"why now.\" Most will if the lead can postpone for three months without facing any repercussions.\n\nTightening ICP, adding more stringent qualification regarding timing and urgency, and aligning the first sales call with the same narrative that marketing developed are typically the quickest fixes.",
          "score": 1,
          "created_utc": "2026-01-19 12:36:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0gsz0t",
          "author": "Critical-Fix-8162",
          "text": "I’m with B2BinDemand - when teams say “leads aren’t converting,” the root cause is most often ICP/timing + weak qualification, not the channel itself.",
          "score": 1,
          "created_utc": "2026-01-19 12:38:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0h02p2",
          "author": "InnerBuilding7949",
          "text": "This is the problem of all time. Same symptoms, different root causes. Anyway, you must see your current funnel:\nLeads - Contacted - Meeting - Proposal - Closed deals. \n\nIf leads can be contacted, they are quite good and real.\nIf they dont want meeting but quotation only, they are comparing prices\nIf they ghost you after meeting, they might not trust u.\nIf they dont reply after proposal, they are not in rush, or your proposal sounds generic and not relevant to their situation.\n\n=> Now u need to check the funnel again and see where is the broken point (leads, meeting, or proposal,...?). For example, proposal drops after meetings, problem is the meeting stage. \n\nHow to fix it:\n- for lead quality: adjust the landing page. Target correct ICP. Write correct message.\n- for meeting: focus on their situation and pain points.\n- for proposal: recap their pain point. Show them how your solution can ease their pain.\n\nIf u want I can do review for free for u. Happy to help.",
          "score": 1,
          "created_utc": "2026-01-19 13:25:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0h04nb",
          "author": "lucas-reid3",
          "text": "It usually isn’t the leads themselves, it’s how they’re being handled. If marketing promises don’t match what sales delivers, or the first few touches don’t give real value, deals stall. Sometimes just mapping the actual buyer journey and syncing messaging fixes most of it.",
          "score": 1,
          "created_utc": "2026-01-19 13:25:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0h3gi3",
          "author": "Wrong-Finish7655",
          "text": "we had this issue when targeting was slightly off. leads looked good on paper but weren’t real buyers. once we tightened ICP and cleaned sourcing (we switched to leadcourt mainly to test higher volume cheaply), conversion rates told us fast what messaging actually worked. do you trust your data or your copy more right now?",
          "score": 1,
          "created_utc": "2026-01-19 13:45:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0h3x2t",
          "author": "MrPS01",
          "text": "What outbound method you are applying to generate leads",
          "score": 1,
          "created_utc": "2026-01-19 13:48:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ha075",
          "author": "Corgi-Ancient",
          "text": "Sounds like your lead quality might be off even if MQLs look good on paper. I had the same issue until I used SocLeads to better target and validate leads from actual active profiles, which helped sales follow up with warmer contacts and close faster. Maybe double-check if your leads are really the right fit or just ticking boxes.",
          "score": 1,
          "created_utc": "2026-01-19 14:21:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0hladi",
          "author": "bootsandcoding1986",
          "text": "You may not be targeting the right audience...",
          "score": 1,
          "created_utc": "2026-01-19 15:18:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0i0mkj",
          "author": "Imaginary-Leg-2546",
          "text": "I'd say it's a bit of everything but mainly lead quality. Create an intent based quiz to filter out the crap and that will sort the problem out. That's what fixed my issue.",
          "score": 1,
          "created_utc": "2026-01-19 16:28:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0kwolf",
          "author": "OkCardiologist1426",
          "text": "It could be a mix of targeting mismatch and incorrect qualification. \n\nYour targeting could be off. The right users but not buyers. Who controls the budget? Are you getting the full buying committee? If you are going after users they love the content but they don’t approve budget. \n\nFor qualification, a lot teams still use basic BANT but you need to unlock the buyer’s preferences. \n\nAre you you using third party vendors?",
          "score": 1,
          "created_utc": "2026-01-20 00:46:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0lkfha",
          "author": "Slight_Tutor1790",
          "text": "I have seen this happen when there is no real internal champion on the buyer side. The lead is interested enough to talk but nobody owns the problem strongly enough to push it internally. Deals drift because the buyer has curiosity but not urgency or authority. Helping that first contact make the internal case clearly can move things faster.",
          "score": 1,
          "created_utc": "2026-01-20 02:57:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0o8mrc",
          "author": "Extreme-Incident-988",
          "text": "this usually means the targeting is off or you're attracting people who match your ICP on paper but don't actually have budget/urgency yet. One thing that can help is getting visible where buyers are already asking questions and showing intent, like in Reddit threads where they're actively researching solutions. I've heard really good things about Community Mentions for that kind of positioning since it gets you into those conversations without looking spammy or salesy.",
          "score": 1,
          "created_utc": "2026-01-20 14:38:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ojflb",
          "author": "Tiny-Celery4942",
          "text": "I was in the same place not long ago. For me, it turned out my sales messages did not match what marketing promised.\n\nNow, I focus on a daily loop: posts, comments, notes, DMs, and follow ups. To keep a targeted feed and help draft comments and DMs, plus track follow ups, I use Depost AI. This way, I do not miss anyone.",
          "score": 1,
          "created_utc": "2026-01-20 15:32:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ppcb7",
          "author": "Longjumping-Check-76",
          "text": "Sounds like your sales pipeline has a leaky middle stage. Most B2B companies lose momentum when leads aren't properly nurtured - consider implementing a more structured follow-up sequence and using tools like ThreadCatch to track engagement and automate personalized touchpoints.",
          "score": 1,
          "created_utc": "2026-01-20 18:45:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1c5yzh",
          "author": "Longjumping_Eye_1870",
          "text": "When leads show up but revenue doesn’t, it’s usually not volume or CAC. It’s expectation collapse.\nWhat I’ve seen break most often is that marketing is attracting interest, not urgency. The content and outbound get people curious enough to raise a hand, but not committed enough to change something now. On paper they qualify. In reality they’re early, shopping, or just exploring.\nThe handoff matters too, but not in the usual “sales and marketing alignment” way. The real mismatch is often that marketing tells a story about possibility while sales has to deal with cost, effort, and risk. If those two narratives aren’t the same, deals stall because buyers feel the shift immediately.\nB2B timelines stretching is normal. What’s not normal is losing momentum after first contact. That usually means the problem isn’t painful enough, or the consequence of waiting isn’t clear. When that’s fixed, conversion improves without adding more leads.",
          "score": 1,
          "created_utc": "2026-01-24 00:08:54",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qhpalu",
      "title": "How I went from $0 to $100K/month with email because Meta ads decided to destroy my business",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qhpalu/how_i_went_from_0_to_100kmonth_with_email_because/",
      "author": "Acceptable-Essay-558",
      "created_utc": "2026-01-20 02:57:35",
      "score": 18,
      "num_comments": 37,
      "upvote_ratio": 0.87,
      "text": "Alright, story time.\n\nPicture this: Jan 2024, me staring at my Meta ads dashboard watching my CPMs go from $45... to $67... to $92... to eventually $180.\n\nMy SaaS was spending about $3k/day profitably. Then boom - overnight my CAC went from $38 to $142. I literally threw up in my mouth a little.\n\n**The \"Oh Shit\" Moment**\n\nI had 6 weeks of runway left\n\nTurned off all ads. Pipeline dropped 89% overnight.\n\nBut then I remembered this random ass comment from a Reddit thread about some guy who scaled to $2M ARR entirely on cold email. Figured I had nothing to lose.\n\nStarted with 3 mailboxes and zero idea what I was doing.\n\n12 weeks later: $107K in closed revenue from cold email alone.\n\nHere's exactly what I did.\n\n**Week 1-2:**\n\nI started with 3 domains.\n\nThe math: 3 mailboxes × 33 emails per day = 100 emails/day to start.\n\nNot sexy. Not scalable yet. But it worked\n\nBy week 2, I was at 300 emails/day. Inbox rate? 73%. Not amazing, but not in the spam dungeon either.\n\nThe setup:\n\n* Bought aged domains (6+ months old) from expired domain marketplaces\n* Set up proper DNS records (SPF, DKIM, DMARC)\n* Warmed with Instantly's built-in warmup for 14 days before sending a single cold email\n\n**Week 3-4: The Lead Scraping System That Actually Works**\n\nHere's where I got weird.\n\nEveryone's out here buying Apollo lists and wondering why their emails sound like everyone else's. I said fuck that.\n\nI built custom software (okay fine, I paid a developer on Upwork $800, but I PROJECT MANAGED IT so basically I built it).\n\nThe scraper:\n\n* Pulls company websites from my ICP search\n* Scrapes their actual website copy, tech stack, recent blog posts\n* Hits LinkedIn to grab decision-maker info\n* Feeds it all into a prompt that writes personalized first lines\n\nPeople open emails that feel like you actually visited their website. Wild concept, I know.\n\n**Week 5-8: Scaling to 1,500 Emails/Day Without Losing My Mind**\n\nThis is where it got real.\n\nFrom 300 emails/day to 1,500/day.\n\nThe math: 1,500 emails/day × 21 working days = 31,500 emails per month.\n\nAt a 3% reply rate (industry average is 1%, but personalization is magic), that's 945 replies.\n\nAt a 15% meeting booking rate from replies, that's 141 meetings.\n\nAt a 25% close rate... you see where this is going.\n\nMy CAC went from $142 on Meta to $47 with cold email. And it kept dropping as I optimized.\n\nI shut down Meta ads entirely. Haven't looked back.\n\nNow I run a cold outreach agency helping other B2B companies do the same thing. Turns out when you figure out how to print money, people want to pay you to teach them.\n\n**The Shit No One Tells You**\n\n* Week 1 was fucking BRUTAL. 6% inbox rate because I didn't warm properly\n* I got my first domain blacklisted on day 4\n* Gmail's spam filters updated in week 5 and tanked my inbox rate overnight. Had to pivot my entire sending strategy\n\nAnyone wants my templates/sequences/scraper setup, drop a comment.\n\nI'll put everything together in a Google Doc (might take me a few days, I need to clean up my shamefully disorganized Notion workspace first).\n\nNo courses, no coaching, no bullshit. Just paying it forward because this sub saved my ass multiple times.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qhpalu/how_i_went_from_0_to_100kmonth_with_email_because/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o0lkje3",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-20 02:57:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0m3cnx",
          "author": "signalpath_mapper",
          "text": "I get why this worked for you, but the math glosses over the operational mess that usually shows up later. At scale, inbox placement and replies are the easy part. The real pain is lead quality, angry replies, and support load once deals start closing. I’ve seen teams swap paid ads for cold email and just move the fire from CAC to onboarding and support. It can work, but only if the downstream ops can actually absorb the volume without blowing up.",
          "score": 5,
          "created_utc": "2026-01-20 04:47:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0m7gir",
          "author": "KissyyyDoll",
          "text": "When you scaled to 1,500 emails/day, did you run into any deliverability issues with Gmail or other providers, and how did you manage them?",
          "score": 5,
          "created_utc": "2026-01-20 05:15:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0ml68l",
              "author": "AwardChance1292",
              "text": "I’m upvoting this because this is the first question I asked myself. I remember doing cold outreach in one of the previous businesses, but got hit with deliveraility pretty fast. That being said, the domain was relatively new… maybe this is the difference, but I suspect there’s something else to it.  \n\nJust like op, meta ads kept getting worse for me over the last year or so. I’ve pivoted towards a different strategy that has been working well.\n\nAnyway, please share the doc. I have a b2c but I’m just made an update that also integrates a b2b aspect…",
              "score": 1,
              "created_utc": "2026-01-20 07:03:34",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0mbxwv",
          "author": "Nomadic_Dev",
          "text": "AI slop",
          "score": 2,
          "created_utc": "2026-01-20 05:48:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0lrm7u",
          "author": "Complete-End-7276",
          "text": "All this came with experience and trust that \"cold email is not dead\"🎉🚀",
          "score": 1,
          "created_utc": "2026-01-20 03:37:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0luse5",
          "author": "algatesda",
          "text": "Bro I am\nBuilding a cold\nEmail engine ,share the doc",
          "score": 1,
          "created_utc": "2026-01-20 03:55:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0luvvv",
          "author": "Lostboysix",
          "text": "I am interested.  :)",
          "score": 1,
          "created_utc": "2026-01-20 03:55:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0lw8wd",
          "author": "Wise-Buffalo4129",
          "text": "Cold email isn’t dead, blanket templates are! 👏🏼",
          "score": 1,
          "created_utc": "2026-01-20 04:04:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0m1gpb",
          "author": "RusticBelt",
          "text": "I'm interested.",
          "score": 1,
          "created_utc": "2026-01-20 04:35:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0m3b6p",
          "author": "darthdelicious",
          "text": "I'd like to see that Google doc.",
          "score": 1,
          "created_utc": "2026-01-20 04:47:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0m71gc",
          "author": "Environmental_Two581",
          "text": "Interesting to check it out please send thanks",
          "score": 1,
          "created_utc": "2026-01-20 05:12:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0m7duy",
          "author": "KissyyyDoll",
          "text": "Damn, I love this story 😅 Meta ad nightmare to email wizardry. That scraper idea is wild but smart.",
          "score": 1,
          "created_utc": "2026-01-20 05:15:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0me6tn",
          "author": "Shot-Prior2137",
          "text": "Totally agreed and I’ve seen this play out in real results too. To add a real example from our work how email has helped:\n\nOne MSP we partnered with struggled to consistently generate **qualified leads**. Most prospects were outside their ideal client profile, and even with a strong sales team, poor lead quality and lack of ongoing engagement made it hard to close deals. Traditional channels like events, ads, and referrals were expensive and delivered inconsistent, hard-to-measure results.\n\nAfter shifting to a targeted email-led outreach strategy, we built a predictable pipeline. The MSP now receives **3–4 high-quality leads per month**, achieved **\\~$10K in new MRR directly from booked appointments**, and has a **repeatable, scalable system** for ongoing lead generation and deal closures, without relying on paid ads.",
          "score": 1,
          "created_utc": "2026-01-20 06:06:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0mgdd5",
          "author": "kubrador",
          "text": "\"meta ads went from $45 cpm to $180 so i pivoted to cold email and now i run an agency teaching cold email\" is peak b2b marketing origin story energy. you basically speedran the entire playbook in 12 weeks because the algorithm mugged you",
          "score": 1,
          "created_utc": "2026-01-20 06:23:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0mi49j",
          "author": "Crafty_Project9709",
          "text": "What kind of SaaS do you offer, and how exactly do you source your leads?",
          "score": 1,
          "created_utc": "2026-01-20 06:38:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0nahtd",
          "author": "Amulyakumarr",
          "text": "I am interested, kindly share the document.",
          "score": 1,
          "created_utc": "2026-01-20 10:56:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0nnaec",
          "author": "Illustrious_Pride725",
          "text": "Please share with me also. What is the selling price of your software? Curious if you can go to a direct sale instead of lead gen to process sale.",
          "score": 1,
          "created_utc": "2026-01-20 12:35:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0nsku9",
          "author": "OkDependent6809",
          "text": "These numbers seem really clean. Like suspiciously clean.\n\n3% reply rate, 15% booking, 25% close? That's way better than anything I've seen. We tried cold email at my company and got maybe 1% reply rate on a good day.\n\nCouple questions: What vertical are you in? B2B SaaS email response rates vary wildly by industry. Enterprise? SMB? Selling what exactly?\n\nAlso how are you defining \"closed revenue\"? Like actual signed contracts or just pipeline? Big difference.\n\nNot saying it didn't work for you but this feels like survivorship bias. One person cracked it in their specific situation and now it's a \"system.\" I've seen this story before with paid ads, SEO, whatever. Works great for the person who figured it out, doesn't replicate.\n\nThat said if you actually got $107K from cold email in 12 weeks that's impressive. Just skeptical of the \"anyone can do this\" framing.",
          "score": 1,
          "created_utc": "2026-01-20 13:10:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0q0g3u",
              "author": "OkSundae8168",
              "text": "I did the same thing the only difference I built it my self reply rates are 7-8% on October it was 13% but that was a fluke. Im recording a yt video of how someone can build this it will take time cause its a 5 ep mini series when it is done ill be sure to send it over",
              "score": 1,
              "created_utc": "2026-01-20 19:35:39",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0q0pwy",
                  "author": "OkSundae8168",
                  "text": "Personalization with cold email scale is getting good cause modules are getting much smarter these days its getting hard to tell what a person wrote and what AI wrote",
                  "score": 1,
                  "created_utc": "2026-01-20 19:36:54",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0o5vf2",
          "author": "saifmaksud",
          "text": "Please send me the doc.",
          "score": 1,
          "created_utc": "2026-01-20 14:24:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0o8d00",
          "author": "kevinbaur",
          "text": "congrats man!",
          "score": 1,
          "created_utc": "2026-01-20 14:37:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0obepw",
          "author": "Odd-Macaroon-9528",
          "text": "Interested!",
          "score": 1,
          "created_utc": "2026-01-20 14:52:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0oc44k",
          "author": "Serem_Achmes",
          "text": "highly interested in the scraper setup and the sequences :)",
          "score": 1,
          "created_utc": "2026-01-20 14:56:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ohl2p",
          "author": "According_Energy_861",
          "text": "Interested",
          "score": 1,
          "created_utc": "2026-01-20 15:23:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ot6xx",
          "author": "zuzeco",
          "text": "Interested",
          "score": 1,
          "created_utc": "2026-01-20 16:17:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0q96x4",
          "author": "rediknight78",
          "text": "That sounds fab, I'd love a copy please. 🙏",
          "score": 1,
          "created_utc": "2026-01-20 20:16:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0s8s3k",
          "author": "Flat-Agency5867",
          "text": "Please share with me too! This is brilliant",
          "score": 1,
          "created_utc": "2026-01-21 02:26:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0u602n",
          "author": "Mobile-Ambition-3714",
          "text": "Appreciate the transparency here, especially about getting blacklisted and the deliverability dips. A lot of people gloss over those pain points. Curious if you ended up rotating sending tools or just stuck to domain/mailbox churn to keep the volume up. Also props for not shilling a course, the Reddit gods smile upon you",
          "score": 1,
          "created_utc": "2026-01-21 11:29:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0vnqkv",
          "author": "Gold-Region-2166",
          "text": "Dude cold email is the cockroach of B2B leadgen. Ads die, platforms rug you, but you can always send an email and maybe land a deal. Love the “paying it forward” mentality, would definitely read that doc if you’re sharing it. You must have some wild angry reply stories, though.",
          "score": 1,
          "created_utc": "2026-01-21 16:26:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1d3yy6",
          "author": "New_Grape7181",
          "text": "I've seen similar results switching from paid ads to outbound, though I went the video route instead of pure email.  \n  \nThe personalisation angle you mentioned is spot on. We scraped LinkedIn profiles and company websites, then recorded short personalised videos (think 30 seconds max) referencing something specific about their business. Used those videos in cold outreach sequences.  \n  \nResponse rates jumped significantly compared to text-only emails. People are so used to automated text that a face in their inbox actually stands out.  \n  \nOne thing I'm curious about though - at 1,500 emails/day, how are you handling the reply volume? We found that once we hit a certain scale, managing conversations became the bottleneck. Like, great problem to have, but still a problem.  \n  \nAre you using any automation for the initial reply handling, or is it all manual?",
          "score": 1,
          "created_utc": "2026-01-24 03:24:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1dqkke",
          "author": "Reasonable-Strike-27",
          "text": "I’m interested, not sure what all the acronyms mean. \nBut you sound pretty genuine I’m interested",
          "score": 1,
          "created_utc": "2026-01-24 05:58:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ey2cz",
          "author": "Vast_Distance_1088",
          "text": "Share me the doc 🙂",
          "score": 1,
          "created_utc": "2026-01-24 12:22:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1j6xzc",
          "author": "Yogbeezy",
          "text": "Interested",
          "score": 1,
          "created_utc": "2026-01-25 00:58:48",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qj5jui",
      "title": "Are there marketing strategies that work specifically for B2B companies under $10M?",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qj5jui/are_there_marketing_strategies_that_work/",
      "author": "Champ-shady",
      "created_utc": "2026-01-21 18:15:24",
      "score": 17,
      "num_comments": 45,
      "upvote_ratio": 1.0,
      "text": "Most marketing advice I find feels built for either: early-stage startups trying everything, or well-funded companies with big teams and long runways.\nWe’re a B2B company doing under $10M ARR, and we don’t have the luxury of waiting 12 months for brand awareness to pay off. Paid ads are hit-or-miss, content feels slow, outbound is noisy, and everyone keeps recommending tactics without context.\nFor those who’ve actually scaled B2B at this stage, what consistently works when resources are limited and revenue matters now?",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qj5jui/are_there_marketing_strategies_that_work/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o0wc961",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-21 18:15:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0wfukp",
          "author": "cornelmanu",
          "text": "What consistently works at sub $10M ARR is not a new tactic. It is focus and integration.\n\nHere is what I have seen work repeatedly when revenue matters now.\n\n1. Pick one ICP slice and one use case Most teams at this stage are still too broad. “Mid-market B2B” is not a strategy.\n2. Prove messaging before scaling channels Paid, content, and outbound all fail when messaging is fuzzy.\n3. Use outbound as a learning engine, not just a sales engine\n4. Content should support sales, not wait for SEO\n5. Stop running channels in silos The biggest waste I see is teams treating paid, content, outbound, and LinkedIn as separate things. What works is one clear message, reused everywhere:\n\n* Outbound tests it\n* LinkedIn amplifies it\n* Paid scales it\n* Content supports it\n\nThat is how you move faster with fewer resources.\n\nThis is also why many teams at this stage move to a fractional model instead of hiring specialists or agencies. One owner across channels usually beats three disconnected tactics.",
          "score": 15,
          "created_utc": "2026-01-21 18:31:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0ws2lt",
              "author": "slow_lightx",
              "text": "Bingo",
              "score": 2,
              "created_utc": "2026-01-21 19:25:02",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o11ojla",
              "author": "AireStream",
              "text": "This is the key!",
              "score": 2,
              "created_utc": "2026-01-22 13:53:24",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o15eqp4",
              "author": "matl_smmus88",
              "text": "100%",
              "score": 2,
              "created_utc": "2026-01-23 00:35:19",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o0zh9x3",
              "author": "Champ-shady",
              "text": "It’s not about chasing the next growth hack, but about disciplined focus and message channel integration.",
              "score": 1,
              "created_utc": "2026-01-22 03:44:08",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o108guu",
          "author": "blank_waterboard",
          "text": "At that size, random tactics don’t work without strategy. I’ve seen thewayhow.com approach this by connecting marketing directly to pipeline, not vanity metrics. Makes more sense when cash flow matters.",
          "score": 5,
          "created_utc": "2026-01-22 07:01:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0whf5s",
          "author": "Rachel1702",
          "text": "A synergy of outbound, events, sales enablement is what I can think of.",
          "score": 2,
          "created_utc": "2026-01-21 18:37:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0wyjm6",
          "author": "sagefrogmarketing",
          "text": "At that stage, what works is narrowing the game, not expanding it. Teams that scale under $10M ARR usually win by doubling down on one or two channels where they already have proof, then tightening ICP, messaging, and follow-up so every dollar compounds. The fastest revenue comes from aligning sales, content, and outbound around the same buyer problems instead of running them as separate motions. It’s less about finding a magic channel and more about making one channel uncomfortably focused and repeatable.",
          "score": 2,
          "created_utc": "2026-01-21 19:54:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0zhqxo",
              "author": "Champ-shady",
              "text": "Exactly, execution over expansion .",
              "score": 0,
              "created_utc": "2026-01-22 03:47:03",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0xeir6",
          "author": "Radiant-Security-347",
          "text": "why are you assuming “brand awareness” is the answer?\n\nIt would be moronic to pursue a brand awareness strategy in your circumstance. It sounds like the company needs to find someone with B2B marketing experience. It sounds like you are thinking of B2C marketing approaches ( and even then, pure brand awareness is of little value for b2b - it’s not unimportant but should be combined with lead gen/direct response marketing)\n\nKeep in mind, even under ideal circumstances, marketing takes six months to see real impact on revenue - plus however long your sales cycle might be.\n\nYou don’t mention sales either - having a crack sales team with a consistent methodology is the shortest distance to revenue and MROI.\n\nNobody can give you good advice based on the minuscule amount of information in your post. your ARR is the least meaningful variable. \n\nwhat industry?\n\nwhat target market?\n\nhow many sales people?\n\nwhat have you tried?\n\nwhat worked to get to $10m? What didn’t work?\n\n  \nToo many people come here looking for some “one size fits all” advice. It simply doesn’t exist.",
          "score": 2,
          "created_utc": "2026-01-21 21:07:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0zivsi",
              "author": "Champ-shady",
              "text": "I came looking for a formula, but the real insight is that the formula is clear thinking built on specific context.",
              "score": 0,
              "created_utc": "2026-01-22 03:54:08",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0y62re",
          "author": "CyberStartupGuy",
          "text": "Focus on building in public to create a micro brand. Especially if you can get several people at your company doing it, you can seem significantly larger than you are currently. Don't try to be everything for everyone, but focus on an incredibly narrow ICP and only care about your brand in that community.\n\nIf you share more about your industry I can tailor it a little more. For example I'm in cyber so I can get very specific for the security industry or other technical buyers",
          "score": 2,
          "created_utc": "2026-01-21 23:19:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o102r0k",
          "author": "ScrollableDreams",
          "text": "for sub-$10M B2B, what works isn’t channels. it’s entry timing. most tactics fail because they target accounts before there’s pressure to act. \n\ninstead of “doing outbound” or “doing content,” focus on reaching buyers when something just changed (budget unlocked, hiring spike, expansion, deadline). \n\nthat shortens cycles and makes even simple outreach work. At this stage, relevance beats scale every time.",
          "score": 2,
          "created_utc": "2026-01-22 06:13:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o13upiq",
          "author": "Commercial-Tutor-238",
          "text": "What I’ve seen work at that stage isn’t chasing more tactics. It’s getting clear on the one problem your buyer is under pressure to fix right now. When sales, outbound, and content all tell the same simple story about that problem and why it matters, deals move faster and effort stops getting wasted.",
          "score": 2,
          "created_utc": "2026-01-22 19:54:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o15j9of",
          "author": "matl_smmus88",
          "text": "Here's my 2 cents on content strategy before investing in paid ads:\n\n1. I think strong branding is often undervalued. The look and feel of your website and brand design is so important.\n2. Organic social content: Again undervalued, but important to keep somewhat consistent.\n3. Paid ads (the key): Easy to understand messaging that solves your customer problem paired with **great** video, motion and graphic content is a winning formula. This takes some experimenting with various messages, method of delivery and channels. From experience, targeting particular roles within an org through video ads - motion and short testimonials has been most successful.\n\nHaving someone within your company in control of brand & content strategy, supported by a content creation agency may be your best best for scaling.",
          "score": 2,
          "created_utc": "2026-01-23 00:59:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0wdb4m",
          "author": "History86",
          "text": "10M ARR and no budget?\n\nMore context maybe? What’s your GTM motion? What is the role marketing plays in your firm?",
          "score": 1,
          "created_utc": "2026-01-21 18:19:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0weycm",
              "author": "Champ-shady",
              "text": "GTM is hybrid, marketing role is to generate qualified leads and support sales.",
              "score": 1,
              "created_utc": "2026-01-21 18:27:08",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0wgaya",
                  "author": "History86",
                  "text": "Okay, so is there enough lead at tofu and at bofu? Clear ICP defined?\n\nIs there a problem at delivery quantity or quality of leads?",
                  "score": 2,
                  "created_utc": "2026-01-21 18:33:05",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0wh8bz",
          "author": "aashrun",
          "text": "whats the pain point with ur current marketing strategy tho?",
          "score": 1,
          "created_utc": "2026-01-21 18:37:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0wsach",
          "author": "Worldly_Row1988",
          "text": "I have built several AI workflows for B2B GTM and will be happy to show you how I can help you scale your business. Already doing this for 4 other clients. Ping if interested.",
          "score": 1,
          "created_utc": "2026-01-21 19:25:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0zggka",
              "author": "hjd-1",
              "text": "Interested.",
              "score": 2,
              "created_utc": "2026-01-22 03:39:10",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o13tiqg",
                  "author": "Worldly_Row1988",
                  "text": "Hi check your messages",
                  "score": 1,
                  "created_utc": "2026-01-22 19:49:01",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0x3m3j",
          "author": "kailfarr",
          "text": "Google Ads works well, as long as you have good data and enough budget to let the system optimize. LinkedIn Ads works especially well if you use document ads.",
          "score": 1,
          "created_utc": "2026-01-21 20:17:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0x8c5y",
          "author": "ArtemLocal",
          "text": "At this stage the channel matters less than the wedge. What works is narrowing to one ICP, one pain, one motion that ties directly to revenue. Most teams fail by running five half channels instead of one tight loop. Fast feedback beats scale. Case driven outbound. Product led expansion inside accounts you already won. Content that answers buying objections, not thought leadership. Ads only when you already know the message converts somewhere else. Brand can wait. Pipeline cannot. Which motion has already closed real deals for you in the last 90 days, even if it does not scale yet?",
          "score": 1,
          "created_utc": "2026-01-21 20:39:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0xh5yw",
          "author": "OkDependent6809",
          "text": "we're at \\~$8M ARR so i'm literally in this stage.\n\npaid ads work but they're expensive and cac keeps creeping up. small referral program gets us maybe 8-10% of customers. partnering with sales on demos to test messaging helps.\n\ncontent marketing moves too slow. most \"brand awareness\" stuff is just burning money.\n\nhonestly at this stage it's grinding paid ads and optimizing your funnel. not sexy but it pays the bills. if you find the magic bullet let me know lol.",
          "score": 1,
          "created_utc": "2026-01-21 21:19:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0xy0mx",
          "author": "OkCardiologist1426",
          "text": "Focusing on one or two ICPs is helpful. For tactics, layer display ads into lead generation. And for lead generation do an end to end--the full funnel. Heavy on the top so you can build a database of contacts and then few lead son the bottom that are sales ready and go to sales.",
          "score": 1,
          "created_utc": "2026-01-21 22:38:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0yxadb",
          "author": "algatesda",
          "text": "Hey to grow from current you check your past client base and segregate them industry wise .high LTV of customers who is paying you currently then target them in AEO,SEO and Paid media sure shot you can able to scale it faster .need a strategy and execution  I can help you out",
          "score": 1,
          "created_utc": "2026-01-22 01:49:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0zeaxe",
          "author": "agonsenhauser",
          "text": "The top comment nails the focus piece, but curious how you decide when your messaging is actually \"proven\" enough to move from outbound testing into paid? \n\nAt your stage, scaling too early burns budget and scaling too late leaves money on the table. What metrics or signals do you use to know when it's time? Reply rates hitting a certain threshold? Meeting conversion? Some combo of leading indicators?",
          "score": 1,
          "created_utc": "2026-01-22 03:26:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0zhb7j",
          "author": "shwarma21",
          "text": "tighten your focus to a super specific buyer pain, build a repeatable outreach or referral motion around solving that pain fast, and double down only on the one or two tactics that directly lead to short-cycle deals instead of spreading thin across every channel",
          "score": 1,
          "created_utc": "2026-01-22 03:44:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o11ys5i",
          "author": "tzarhirovito",
          "text": "I’ve been in similar situations where budgets were tight and the team was small, either my own or partners, clients ... what moved it was focusing on a mix of very targeted paid campaigns, highly personalized outreach (LinkedIn + email or just one of those) and making sure the website and landing pages converted efficiently. Honestly, it felt like spinning a lot of plates at first, which is why I ended up hiring a team to handle both ads and outreach, this is for my own case, and i can say it works well under the circumstances",
          "score": 1,
          "created_utc": "2026-01-22 14:46:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o12l75z",
          "author": "Wrong-Finish7655",
          "text": "most b2b under $10m are spread too thin tbh.  \npick one channel you can control and one ICP you already close. double down on outbound + partnerships, not “content.”  \nbrand won’t save this yet.",
          "score": 1,
          "created_utc": "2026-01-22 16:30:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o12ygrb",
          "author": "garselona",
          "text": "DMed you, please check.",
          "score": 1,
          "created_utc": "2026-01-22 17:30:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o12zykr",
          "author": "Corgi-Ancient",
          "text": "If you need quick leads without wasting time on slow content or noisy outbound, tools like SocLeads can help you build accurate contact lists fast from places like LinkedIn and Google Maps. It saves hours on manual work so you can focus on reaching out to the right people now instead of waiting months for brand stuff to kick in. For under $10M ARR, speed and precision in lead gen usually beats broad tactics.",
          "score": 1,
          "created_utc": "2026-01-22 17:37:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1522gs",
          "author": "RomainBlumberger",
          "text": "1. Nail the ICP  \n2. Run fast Blitz messaging campaigns to find the winning messaging  \n3. Ramp this up",
          "score": 1,
          "created_utc": "2026-01-22 23:28:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o196hqb",
          "author": "Dismal_Cartoonist_45",
          "text": "LinkedIn is a good place for B2B company.",
          "score": 1,
          "created_utc": "2026-01-23 15:40:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1amg6h",
          "author": "Chemical_Holiday_239",
          "text": "The only way I survived 'founder burnout' was realizing I can't be creative on demand 24/7. Now I separate 'idea capture' from 'writing'. I dump ideas into audio notes when I'm walking, and then use a tool I built (Beamio) to turn those rough notes into polished posts later. Disconnecting the two tasks saved my sanity.",
          "score": 1,
          "created_utc": "2026-01-23 19:36:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0wl5n1",
          "author": "Predator6502",
          "text": "Paid ads is probably the easiest way to go from 10mil to 50mil ARR",
          "score": 1,
          "created_utc": "2026-01-21 18:54:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0z5oj6",
          "author": "w23lfe",
          "text": "Asking consultation without pretty clear idea on what you do. I don’t think it is possible. However, I would say don’t leave cold mailing if your resources are limited.",
          "score": 0,
          "created_utc": "2026-01-22 02:36:55",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qlnb4a",
      "title": "how do you guys do lead gen",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qlnb4a/how_do_you_guys_do_lead_gen/",
      "author": "Character_Cable_1531",
      "created_utc": "2026-01-24 13:43:06",
      "score": 16,
      "num_comments": 26,
      "upvote_ratio": 1.0,
      "text": "Hi everyone, I'm in the process of starting a business where the main service helps with lead research and cold outreach. \n\nI'm going to use cold email outreach myself, however I'm just curious if there are any other methods of lead gen that you guys are doing? I've previously scraped leads through apollo and linkedin but reaching a bit of a dead end.\n\nWould really appreciate any help. thanks",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qlnb4a/how_do_you_guys_do_lead_gen/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o1f9ymg",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-24 13:43:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1fioer",
          "author": "Aunker",
          "text": "Cold email works, but it gets way easier when you stack one more channel on top. Best options I’ve seen that don’t need big spend: LinkedIn comments and DMs with people already talking about the problem, niche communities like Reddit and Slack groups, simple Loom audits sent to warm prospects, partnerships with agencies who already have the clients, and retargeting ads to your site visitors once you have traffic. If Apollo scraping feels dead, the issue is usually list quality and targeting, not the channel. Tighter ICP, fewer industries, and better triggers like hiring, new funding, new job posts, or tech changes makes replies jump. What service are you offering and who is your ideal customer?",
          "score": 3,
          "created_utc": "2026-01-24 14:33:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1fkqk5",
          "author": "MorganJIngram0",
          "text": "You have multiple options here:\n\n1. Cold Calling  \n2. Cold Emailing (already doing this)  \n3. LinkedIn  \n4. Direct Mail  \n5. Referrals \n\n6. Your own network \n\nIf I was in your shoes I would hyper focus on people in your network already. Go into LinkedIn to start sending messages to your 1st degree connections and text people that you know about your offer. This is your low hanging fruit which I always look to focus on first. Also, you don't have to sell all these people...go to people in your network that are willing to do a referral for you because that would be the way to stand out. Then once you start getting results with those people, amp up your cold emailing with the proof from those people. I would suggest doing LinkedIn messaging since you already know email works well. LI messages is just punchy copy.\n\n  \nHope this helps.",
          "score": 2,
          "created_utc": "2026-01-24 14:44:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ir2n1",
          "author": "Digi-Dave",
          "text": "I find Google Ads to be a fairly successful platform for B2B lead gen.",
          "score": 2,
          "created_utc": "2026-01-24 23:36:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1fb06u",
          "author": "ck_atti",
          "text": "How do you manage cold email outreach by yourself?",
          "score": 1,
          "created_utc": "2026-01-24 13:49:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1fb8tw",
              "author": "Character_Cable_1531",
              "text": "scraping leads and filtering down, and then creating email templated sequences",
              "score": 1,
              "created_utc": "2026-01-24 13:50:39",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1fdabe",
                  "author": "ck_atti",
                  "text": "what is the core of the strategy? \ndo you know enough about proper technical setup of your mailboxes?\nare you sure apollo js the best place to find your target people?",
                  "score": 1,
                  "created_utc": "2026-01-24 14:02:38",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1fb4k2",
          "author": "Wrong-Finish7655",
          "text": "for scale, cost matters more than people admit.  \nwe moved to cheaper verified sourcing (leadcourt) so we could pull bigger pools and aggressively filter without stressing spend. that unlocked volume again.  \nare you optimizing for accuracy or reach right now?",
          "score": 1,
          "created_utc": "2026-01-24 13:49:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1fcun3",
          "author": "madhuforcontent",
          "text": "Through my blog",
          "score": 1,
          "created_utc": "2026-01-24 14:00:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1fmv7p",
          "author": "NecessarySoftware569",
          "text": "Automate it across different platforms , saves me a bunch of time",
          "score": 1,
          "created_utc": "2026-01-24 14:55:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1fpq02",
          "author": "jeeves_inc",
          "text": "We’re in a similar space (lead research + outreach), and honestly the biggest shift for us was stopping the idea that lead gen = just scraping + blasting.\nCold email still works, but only as a distribution layer, not the core strategy. When it’s the first touch and there’s zero context, it’s brutal now.\nWhat’s worked better for us:\nBe visible before you reach out.\nPosting useful stuff (not pitchy) on LinkedIn, commenting thoughtfully on other people’s posts, being active in communities like this one. When someone later gets an email from you, there’s at least some “oh, I’ve seen this name before.”\nProblem-first targeting instead of tool-first scraping.\nApollo/LinkedIn are fine, but lists perform way better when they’re built around a specific trigger (hiring, new funding, tech change, recent post, etc.). Fewer leads, much higher reply rates.\nWarm intros > cold volume.\nPast clients, ex-coworkers, partners, even “hey do you know anyone who…” messages. Not scalable on paper, but they compound fast when you’re early.\nSmall events / niche meetups.\nNot big conferences. Local or industry-specific stuff where you can actually talk to people. Those conversations turn into deals later even if nothing happens immediately.\nContent as trust, not demand gen.\nWe’ve seen more success when people understand how we think before sales ever comes up. By the time outreach happens, it doesn’t feel cold anymore.\nTL;DR: cold outreach isn’t dead, but using it as the first impression is. Lead gen works better when sales shows up after familiarity, not before.\nHope that helps, happy to answer follow-ups.",
          "score": 1,
          "created_utc": "2026-01-24 15:10:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1fvulv",
              "author": "Paulthesecond9",
              "text": "Agree with everything you said! The only problem is that it’s not realistic to rely on the fact that people that you email have heard about your business, so unfortunately it will almost always be the “first touch”.",
              "score": 1,
              "created_utc": "2026-01-24 15:40:40",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1gijw4",
          "author": "AfraidHelicopter1569",
          "text": "Cold email is good, but if you could find people that are looking for help in reddit, it would be even better. For this, I'm using a reddit lead gen that automatically find right conversations for your business.",
          "score": 1,
          "created_utc": "2026-01-24 17:23:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1hcrq3",
          "author": "fiq-43",
          "text": "Cold email and linked in",
          "score": 1,
          "created_utc": "2026-01-24 19:34:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1jcb5q",
          "author": "Electronic-Cat185",
          "text": "cold emaiil works but it gets much better when it is paired with signal based lead gen. instead of scrapiing more names focus on finding moments when someone actually has a problem like job changes new fundiing tool switches or public complaints. content and community replies can also generate warmer leads over time even if volume is lower. the dead end usually means the liist is the problem not the channel",
          "score": 1,
          "created_utc": "2026-01-25 01:28:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1jgl1x",
          "author": "aaro-ai-2024",
          "text": "Cold email to figure out who might be interested -> connect on LinkedIn -> follow up with text, phone call or canvas",
          "score": 1,
          "created_utc": "2026-01-25 01:52:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1k1d3k",
          "author": "algatesda",
          "text": "I am using cold calling and voice agent to book appointments.Linekdin DM with automation also working for me .But use it with understanding the LI DM limit policy",
          "score": 1,
          "created_utc": "2026-01-25 03:49:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1l2mvb",
          "author": "harryonlyfan",
          "text": "We started getting consistent inbound leads through organic SEO and on-site optimization. Happy to share what worked for us if anyone’s interested.",
          "score": 1,
          "created_utc": "2026-01-25 08:19:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ltfzk",
          "author": "Commercial-Job-9989",
          "text": "Now days there are many AI assistant which handles inbound and outbound calls and helps in generating leads and also easy to use. \n\nAI assistant helps to reduce missed calls, record call summary also provides text to speech and speech to text also you can customise your workflow accordingly. It also sends hot mail to sales teams as a result it increases sales .",
          "score": 1,
          "created_utc": "2026-01-25 12:12:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ml0ro",
          "author": "Dangerous_Bowler3286",
          "text": "I’ve seen this a lot, and the dead end usually isn’t the channel  it’s how lead gen is being approached.\n\nCold email still works, but only when it’s part of a broader lead-generation workflow, not just scraping lists and blasting them.\n\nWhat’s worked better for me:\n\nStart with intent signals: hiring related roles, funding/growth, product launches/expansion. Smaller lists hit harder.\n\nUse social for research, not scale: LinkedIn/Twitter to spot signals + find decision-makers + grab context, then move off-platform.\n\nCold email is still the best entry: it’s the most consistent way to start conversations at scale.\n\nFollow-ups do most of the lifting: most replies come after 2–4 touches, not email #1.\n\nMake it one flow: company discovery → contacts → send → follow-ups → handle replies. The goal isn’t more scraped leads, it’s more booked conversations.\n\nIf you share your niche + offer + target titles, I can suggest a few high-intent triggers to build lists around.",
          "score": 1,
          "created_utc": "2026-01-25 14:59:48",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qhvxsk",
      "title": "Do you think we are producing reports for stakeholders, or just for the process nowadays?",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qhvxsk/do_you_think_we_are_producing_reports_for/",
      "author": "CO_Oked_COO",
      "created_utc": "2026-01-20 08:48:59",
      "score": 15,
      "num_comments": 9,
      "upvote_ratio": 1.0,
      "text": "Hey everyone, \n\nI am just curious if anyone here is also thinking along the same lines as me. Every quarter, I spend days polishing up my reports so that they are ready to be presented. Once they are ready and I send them through to my stakeholders, I then hear nothing back, like no feedback or concerns or if they are happy, just nada. \n\nIt’s made me wonder whether these reports are actually serving my stakeholders, or if they’ve quietly become a box-ticking exercise for the process itself, and is not really needed anymore.\n\nI don't know if they genuinely read the reports end to end, or if they skim a few charts and jump straight to the conclusions or recommendations.\n\nI’m curious if others in this space have had the same thing. Have you changed formats, shortened reports, or shifted to something more decision-focused?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qhvxsk/do_you_think_we_are_producing_reports_for/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o0mwsan",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-20 08:48:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ty5zl",
          "author": "Infinite_Animator_92",
          "text": "I can see where your frustrations are coming from with this",
          "score": 2,
          "created_utc": "2026-01-21 10:21:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0mxlnk",
          "author": "Opposite-Wafer5536",
          "text": "I’ve run into this a lot, and I don’t think silence always means disinterest. Often, it means the report didn’t clearly ask anything of the reader.",
          "score": 1,
          "created_utc": "2026-01-20 08:56:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0my50j",
          "author": "sarkhem",
          "text": "yeah feels like box-ticking tbh...most stakeholders don’t read reports, they skim charts and jump to the last slide. i stopped polishing decks and now send a short summary with 3 takeaways + 1 decision needed... way more responses... turns out they wanted clarity, not prettier reports.",
          "score": 1,
          "created_utc": "2026-01-20 09:01:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0neip4",
          "author": "Agitated_Mark4235",
          "text": "I think a lot of reporting drifted from being a decision tool to being a historical record. It feels useful to the person creating it, but neutral to the person receiving it.",
          "score": 1,
          "created_utc": "2026-01-20 11:30:36",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qh2ysq",
      "title": "I realized LinkedIn isn't about networking anymore, it's just broadcasting. So I tried something else.",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qh2ysq/i_realized_linkedin_isnt_about_networking_anymore/",
      "author": "skyler_outx",
      "created_utc": "2026-01-19 12:33:40",
      "score": 9,
      "num_comments": 18,
      "upvote_ratio": 0.68,
      "text": "I'm the founder of OutX, and I had one of those realizations the other day.\n\nI wasn't actually \"networking.\" I wasn't building relationships. I wasn't even really connecting with anyone.\n\nI was just… posting. Broadcasting my thoughts into the void. Hoping the algorithm would show it to someone who cared. Watching the like count. Refreshing. Checking again. Like throwing messages in bottles and never knowing if anyone found them.\n\nAnd honestly? It felt exhausting.\n\nSo I flipped it. Instead of talking, I started listening.\n\nI stopped posting every day and started tracking what my audience was actually talking about. Not on my posts. On theirs. In comment threads. In replies. The stuff they were complaining about, asking about, struggling with.\n\nThings like:\n\n* Finding posts where my ICP was already discussing their problems\n* Engaging in those conversations instead of creating new ones\n* Actually reading what people needed instead of guessing\n* Accepting that silence is okay if you have nothing useful to add\n\nIt's been surprisingly different. Less anxiety about \"does this post perform.\" More real conversations with people who actually need help. More trust built through showing up, not broadcasting.\n\nIf this resonates, maybe try this: spend one day not posting anything. Just find three posts where your audience is talking about something you know. Comment something genuinely helpful. See what happens.\n\nWould love to hear from others here. Does LinkedIn still feel like a place you \"network\" or has it quietly become a place where everyone's just talking at each other?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qh2ysq/i_realized_linkedin_isnt_about_networking_anymore/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o0gs8xc",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-19 12:33:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0gu5ea",
          "author": "Ok_Employ_897",
          "text": "I love your post. And I've tried to listen more and comment on other peoples posts. However, their posts are often so generic that you can't even say something about it. So I am curious, where do you find your ICP already discussing their problems, that would be a gold mine.",
          "score": 2,
          "created_utc": "2026-01-19 12:47:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0huzjd",
          "author": "LiquidCarbonator",
          "text": "Ha! You're forgetting that if people are just broadcasting they don't really care about your feedback. It's mostly about what they do",
          "score": 1,
          "created_utc": "2026-01-19 16:03:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0itc66",
          "author": "Top_Friend_6248",
          "text": "I post on LinkedIn frequently, but I do so genuinely. I also talk to a lot of people and that's why I've made good connections, and I sell frequently; I have many clients from there. But I comment a lot and interact with people.",
          "score": 1,
          "created_utc": "2026-01-19 18:37:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0jirms",
          "author": "Material_Airline5000",
          "text": "linkedin feels like a one-way megaphone now, your listen-first switch is smart af. been feeding audience gripes from threads into postiv ai with my docs and it spits out on-brand carousels that actually land saves me from staring at blank screens. less fluff more impact.",
          "score": 1,
          "created_utc": "2026-01-19 20:33:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ngfjs",
          "author": "another_sleeve",
          "text": "This is my experience from journalism, not b2b marketing. But I write about fairly niche subjects, so the audience size is similar.\n\nMy method is usually to start rolling around an idea that's been bothering people, and go talk to a great many of them, or eavesdrop in conversations to get different viewpoints. There's the old example of 5 people standing in a dark room with an elephant: neither of them can describe what it is, only what they can feel from their angle. \n\nBy talking to a lot of people on a certain subject, you collect all the angles and different tidbits, and you have an opportunity to describe the elephant in the room the best way possible. And since you incorporate all the angles you picked up, it will resonate with the audience!\n\nYou can achieve something similar by spelunking comments, but depending on your industry and the subject, a lot of crucial details still won't surface to the public space. You have to reach out and ask questions.",
          "score": 1,
          "created_utc": "2026-01-20 11:45:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ok1ra",
          "author": "pollner55",
          "text": "I have been on LinkedIn since 2006. In the past years, LinkedIn became the new Facebook. Now I'm publishing on Substack and use LinkedIn only as a distribution channel.",
          "score": 1,
          "created_utc": "2026-01-20 15:35:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0pgj19",
          "author": "Mother_Tell4995",
          "text": "Sending connection invites, and then following up appropriately is still a great way to do business development.",
          "score": 1,
          "created_utc": "2026-01-20 18:05:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0poy0f",
          "author": "Commercial-Tutor-238",
          "text": "We do this as well, this is the only way, other than ads, how we generate leads on LinkedIn, and they are usually the best kind. Also, something you didn't mention, is how impossible it is to predict engagements with traditional posts. Our best performing posts are also our weirdest ones. One thing I struggle with is actually finding these trending topics for our ICP, I've tried PhantomBuster, but am unsure where I can find relevant conversations.",
          "score": 1,
          "created_utc": "2026-01-20 18:43:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0vko4i",
          "author": "Only_Performer9165",
          "text": "Thanks for this valuable insight. I am also in the same loop. But finding the icp is becoming a real challenge for me as mine is a Niche domain and the only people talking about my stuff is only people who work in my domain. Not  actual clients. ",
          "score": 1,
          "created_utc": "2026-01-21 16:12:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0vkw7u",
          "author": "bright_site_builder",
          "text": "I really appreciate this post. I'm a co-founder of a B2B company and I've been debating whether it's worth the resources to be as active as we are on LinkedIn. We post weekly from the business account as well as our personal accounts, and less than 1% of our website traffic comes from LinkedIn. I was considering advertising on LinkedIn (a small initial investment to see if there is potential) as a way to see if there's a justification for continuing with the time it takes to post, etc.\nI'm not convinced that people/ businesses go on LinkedIn looking for solutions or to grow their network. Many times it feels like a lot of people get on just so they can do the obligatory post and comment, and if that's the case it feels like B2B content can easily get lost at sea.",
          "score": 1,
          "created_utc": "2026-01-21 16:13:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0w7sbf",
              "author": "Sociabble_CM",
              "text": "I'd argue that unfortunately posting only once a week on the company or the personal accounts might not be enough. \n\nEven if the algorithm rewards regularity, maybe try to post at least twice a week and also actually spend time on the platform, and interact with other people's posts. Sometimes a well-timed, insightful comment can bring more visibility than 20 company posts.",
              "score": 1,
              "created_utc": "2026-01-21 17:55:47",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0w9pak",
                  "author": "bright_site_builder",
                  "text": "Thank you for the feedback. I'm going to give it some more effort. I'm still wondering what the objective should be for my time on LinkedIn. Should I abandon thoughts of ROI and accept that it's a time/ money cost that gives the company credibility or do I go all-in and start advertising as well? I probably just have to crack the code because clearly some small B2Bs are making money from LinkedIn. Or at least I hope they are and we're not all tossing pennies in the well.",
                  "score": 1,
                  "created_utc": "2026-01-21 18:04:10",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0gujfx",
          "author": "umightfafo",
          "text": "It’s both. I have seen what works on LinkedIn on the backend as an analytics consultant… So I started posting on there as well. What I have seen work for the founder of companies is build trust, tell your story, and create connections that drive real results. A pro tip is to use the boolean search feature for posts on LinkedIn",
          "score": 1,
          "created_utc": "2026-01-19 12:49:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0gx3uo",
          "author": "JunaidRaza648",
          "text": "That’s a wonderful approach.\n\n1. LinkedIn can also be a great resource for cold pitching. When you’ve identified a genuine problem a company is facing that you can solve, directly pitching works quite well. (Personal experience).\n\n2. Then there’s what you mentioned: it builds authority. People visit your profile, and this is where brand positioning plays a huge role. Content quality matters far more than quantity.\nI see tons of people pointing out others’ problems, and it almost never works.\n\n3. Then I learned something incredible from an agency owner: create irresistible value for ICP.\n\nFor example, a newsletter they can’t resist subscribing to, or a profile they can’t resist following.\n\nThe agency owner was targeting eCommerce brands focused solely on creating valuable content for eCommerce businesses.\n\nNothing else.\n\nAs a result, he gained tens of thousands of followers (I don’t remember the exact number).",
          "score": 0,
          "created_utc": "2026-01-19 13:06:53",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qip96w",
      "title": "Looking for Marketing suggestion",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qip96w/looking_for_marketing_suggestion/",
      "author": "harryonlyfan",
      "created_utc": "2026-01-21 05:24:19",
      "score": 9,
      "num_comments": 17,
      "upvote_ratio": 1.0,
      "text": "I run a cannabis eCommerce business, but I’m not sure which marketing strategies are most effective for increasing traffic and generating revenue. I’ve read several articles and gathered different ideas, but before moving forward, I’d love to hear real experiences. If anyone is willing to share suggestions or insights, I’d really appreciate it.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qip96w/looking_for_marketing_suggestion/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o0t0vx7",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-21 05:24:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0tsirs",
          "author": "Sea-Environment-5938",
          "text": "If I had to pick one channel to build long-term in cannabis: SEO for high-intent queries. Not \"what is THC\" blog fluff think \"best (product) for (use case)\", \"near me\" modifiers (if applicable), comparisons, and \"how to choose\" pages that push to collection pages. \n\nBuild a content cluster per category and internally link aggressively to money pages.  \nDo you have enough products/categories to build 20-50 dedicated landing pages?",
          "score": 3,
          "created_utc": "2026-01-21 09:28:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0t7kt4",
          "author": "Fit_Path_6450",
          "text": "Focus collection pages.\n\nUnlike other niches, cannabis Ecom don't have many options in ads. SEO is your #1 channel.\n\nBut you can't rely on blog traffic..\nYou need traffic that convert.\n\nFor the last 6 years, I've been building links for some big players in cannabis industry and all of them prioritize their collection/products pages.\n\nMy suggestion:\n\n- pick your top performing collection pages.\n- finalize your anchor and landing pages.\n- start building links from relevant cannabis sites.\n\nBut don't press the padel blindly. \n\n- make anchor variations \n- divide links to home page + blogs + collection pages \n\nPlus check the competition on SERP, filter out the low hanging fruits first and target them.\n\nCannabis keywords are highly competitive and you might not be able to outrank big players with small budget.\n\nPro tip: I'm not saying that don't publish the blogs but focus more on money pages. You should push the pages that's gonna generate revenue for you.\n\nThis is what other successful cannabis companies are doing. Happy to share more insights and case studies if you need more help.",
          "score": 2,
          "created_utc": "2026-01-21 06:16:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0tkf13",
              "author": "Fresh-Shirt8047",
              "text": "This",
              "score": 1,
              "created_utc": "2026-01-21 08:10:33",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0tb2ts",
          "author": "kubrador",
          "text": "just accept that half your best marketing channels will deplatform you for selling the devil's lettuce and build an email list before they do.",
          "score": 2,
          "created_utc": "2026-01-21 06:46:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0wi6c6",
          "author": "Wrong-Finish7655",
          "text": "this is way too vague tbh. cannabis ecommerce lives or dies on repeat + owned channels, not “traffic.”  \npick one: email/sms retention, seo around product + education, or compliant paid traffic — not all three.  \nhappy to go deeper if you want?? dm me.",
          "score": 2,
          "created_utc": "2026-01-21 18:41:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0t1jy3",
          "author": "Away_Instruction_992",
          "text": "For cannabis eCommerce, start with what you can scale safely: SEO + email/SMS + community. Build location-aware category pages, strain/benefit guides, and “how to choose” content with tight internal links. Add trust proof everywhere: COAs/lab tests, sourcing, licenses, clear shipping rules, real reviews. Most paid channels are restricted, so focus on partnerships (micro-influencers, affiliates), retargeting where allowed, and a strong retention engine (welcome flow + reorder reminders).",
          "score": 1,
          "created_utc": "2026-01-21 05:29:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0t2wib",
          "author": "MassiveMacaron170",
          "text": "Quick reality check: most cannabis eCom stores don’t fail because of traffic, they fail because they chase blocked channels and ignore conversion + owned media.\n\nWhat’s worked in real cases: SEO built around buyer intent (not blogs for the sake of blogs), email/SMS done properly, strong landing pages, and content that educates without triggering ad bans.\n\nIf you want, happy to sanity-check what you’re planning and tell you what’s actually worth doing vs wasting time.",
          "score": 1,
          "created_utc": "2026-01-21 05:39:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0t78a7",
          "author": "backlinksprovider",
          "text": "To increase your traffic and revenue you need to foucs on getting quality backlinks from high authority sites that will boost your websites and get you rank on top plus you should focus on good quality content too. On if my client is working on nicotine pouches in US we started with a brand new site and after starting our link building project our site DA was increased to 12 and now we are getting traffic of 300/day. If you need any help with link building let me know, i would love to discuss",
          "score": 1,
          "created_utc": "2026-01-21 06:13:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0u0l8t",
          "author": "signal_loops",
          "text": "for cannabis eCommerce, the biggest levers are SEO, content, and owned channels not paid ads. focus on search driven education local SEO if applicable, and email/SMS for repeat purchases . influencer and UGC on platforms that tolerate cannabis adjacent content can work, but consistency matters. paid ads are limited, so growth usually comes from organic traffic, retention, and partnerships rather than quick wins.",
          "score": 1,
          "created_utc": "2026-01-21 10:43:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0vb9qj",
          "author": "JMALIK0702",
          "text": "The most reliable stack I’ve seen is: SEO + content that answers buyer intent (effects, formats, dosage guides, “best for sleep/anxiety/pain” style pages where legal), strong email/SMS capture with flows (welcome, abandon cart, post-purchase, replenishment), and a tight repeat purchase engine (bundles, subscriptions if allowed, loyalty, referral). For acquisition, lean harder on influencers/affiliates, creator partnerships, and educational content distribution, because it stays compliant longer than “buy now” ads. Also make sure basics are airtight: age gating, geo compliance, shipping rules by state, and clear policies because that trust layer matters more in regulated categories.",
          "score": 1,
          "created_utc": "2026-01-21 15:29:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o12owpw",
          "author": "Pristine_Battle_2636",
          "text": "I would build a system for emails since it is the only thing you can control.",
          "score": 1,
          "created_utc": "2026-01-22 16:47:11",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qkbdsr",
      "title": "I mapped out a complete \"Inbound + Outbound\" growth stack for B2B SaaS (Tools, Costs, and Daily Volume limits)",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qkbdsr/i_mapped_out_a_complete_inbound_outbound_growth/",
      "author": "Aggressive_Light7892",
      "created_utc": "2026-01-23 00:11:05",
      "score": 8,
      "num_comments": 13,
      "upvote_ratio": 0.9,
      "text": "**This is gonna be completely helpful if you are an early stage founder doing everything by yourself.** \n\nI talk to a lot of founders who are trying to scale their ARR but get stuck in \"tool hell\"—buying random subscriptions without a cohesive system.\n\nOver the last few months, I’ve been refining a growth engine specifically for B2B SaaS. The goal was to maximize volume while keeping costs predictable. I wanted to share the current stack, the monthly burn, and the daily activity targets we hit.\n\nIf you are trying to build an internal growth team, feel free to steal this setup.\n\n# The Outbound Stack (Cold Outreach)\n\nThis is the heavy lifting. The goal here is direct contact with decision-makers.\n\n**Email Infrastructure** We run a hybrid setup to balance deliverability with volume.\n\n* **Data & enrichment:** Apollo io + Leadmagic\n* **Sending Infra:** Smartlead (for volume) + Lemlist (for high-touch/personalized sequences)\n* **Inbox Management:** Maildoso (essential for domain rotation)\n* **Verification:** Listkit\n* **Estimated Cost:** \\~$700 - $900/month depending on seat count.\n\n**LinkedIn Automation**\n\n* **Targeting:** Sales Navigator (Non-negotiable for B2B)\n* **Automation:** Expandi (Safe limits) + Waalaxy\n* **Daily Volume Target:** \\~40 Connection requests/day + 20 targeted DMs.\n\n**Twitter & Reddit (Guerrilla Outbound)** We use native web interfaces here to avoid API bans. It’s manual but effective.\n\n* **Twitter:** \\~100 DMs/day (requires warmed accounts).\n* **Reddit:** Up to \\~250 DMs/day (split across multiple accounts/niches).\n* **Cost:** $0 (Time-intensive).\n\n\n\n\n\n# The Inbound Stack (Content & Nurture)\n\nOutbound captures attention; Inbound builds trust so they actually reply. We aim for high-frequency \"sweat equity\" over paid ads.\n\n**Newsletter & Long-form**\n\n* **Tools:** Beehiiv (Newsletter) + Medium (SEO/Syndication)\n* **Cadence:** 3 emails/week. We treat the newsletter as a product, not just a notification channel.\n\n**Social Content Engine** This is where most founders burn out. The key is batching.\n\n* **LinkedIn:** 1 Post/day (Carousels work best here) + 5 strategic comments on big accounts (using Buffer).\n* **Instagram:** Meta Business Suite. Target: 6 Reels/day (repurposed short-form clips).\n* **Reddit:** 10 posts/day across 10 different relevant subreddits.\n* **Tools:** Canva (Visuals) + Buffer (Scheduling).\n* **Cost:** Mostly $0 for software, high cost in labor.\n\n\n\n\n\n# The Summary\n\n* **Total Monthly Tech Cost:** \\~$1,000 - $1,200 (varies by seat count)\n* **Total Daily Touchpoints:** 500+ across all channels.\n\n**My takeaway:** The tools are the easy part. The hard part is the consistency. Sending 100 emails is easy; sending emails every day for 90 days while managing replies, fixing broken domains, and producing 6 reels a day is where the scaling actually happens.\n\nI’m currently running this full engine for a few SaaS partners. It’s a beast to manage, but the pipeline looks healthy.\n\n**Question for the group:** For those scaling past $10k MRR, are you finding better ROI on high-volume email or high-effort LinkedIn content right now? I'm seeing a shift back to LinkedIn lately.\n\n",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qkbdsr/i_mapped_out_a_complete_inbound_outbound_growth/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o15a4is",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-23 00:11:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o15ewyi",
          "author": "kubrador",
          "text": "ah yes, the classic \"i've automated my way into a full-time job managing automations\" growth stack. you've basically described hiring yourself 3 times over while paying $1,200/month for the privilege.\n\nthe real question is whether spending 6 hours daily on reddit posts and instagram reels is actually scaling or just elaborate procrastination with a spreadsheet.",
          "score": 4,
          "created_utc": "2026-01-23 00:36:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1aiax4",
              "author": "Aggressive_Light7892",
              "text": "Well you can always hire a VA for those. Or I can help with this entire execution if you'd like.",
              "score": 0,
              "created_utc": "2026-01-23 19:16:39",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1bslq5",
          "author": "agonsenhauser",
          "text": "This is a solid setup, but I'm curious about the conversion side. With 500+ daily touchpoints across all these channels, what are you actually seeing in terms of reply rates and qualified pipeline from each? \n\nThe volume game makes sense early on, but the ROI math gets interesting when you start tracking which channels actually convert. Would be helpful to know if you're seeing, say, 2% reply rates on cold email vs 8% on warmed LinkedIn vs whatever Reddit/Twitter is doing. That breakdown would help validate whether spreading across this many channels beats going deeper on the 1-2 that actually move the needle.",
          "score": 2,
          "created_utc": "2026-01-23 22:57:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o15n8wt",
          "author": "aimdoc-ai",
          "text": "On the inbound side, those are definitely the right tools for generating content that can drive inbound, but there are also tools that help improve the B2B SaaS inbound buyer experience on the whole. We're actually building an AI buyer copilot specifically for B2B SaaS.\n\nIt can essentially categorize visitors by conversational intent (customer, prospect, trial user, etc.), qualify (is a prospect), schedule demos and will soon even be able to demo the software.\n\nI also think visitor ID (like RB2B, etc.) triggered outbound sequences can be powerful for B2B saas, if you make sure you are filtering by your ICP.",
          "score": 1,
          "created_utc": "2026-01-23 01:21:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1a99dz",
          "author": "Tiny-Celery4942",
          "text": "This is super helpful. I have seen so many founders get lost in the tool jungle. It is good you are sharing what works.\n\nFor us, LinkedIn content is doing better now. Email was great for a while, but it feels like everyone is getting so many emails that it is hard to stand out. LinkedIn feels more personal, and people are more likely to see your stuff if you are putting out good content.\n\nHere is how we do it:\n\nWe use Sales Navigator to find the right people. Then, we use Depost AI to create custom lists, engage few time to warm, then use depost ai to send connection requests and messages. For content, we plan everything out at the start of the week and use Depost AI to schedule posts. This way, we do not have to think about it every day. We also spend time commenting on other people's posts to get our name out there. It takes work, but it is worth it. What do you think?",
          "score": 1,
          "created_utc": "2026-01-23 18:35:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1aiq27",
              "author": "Aggressive_Light7892",
              "text": "Well, Email is still a volume game and needs ruthless targeting on ICP. And yes, LinkedIn does get you more visibility and brand authority.",
              "score": 1,
              "created_utc": "2026-01-23 19:18:38",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1bkgvi",
          "author": "SharpInsect3636",
          "text": "The part that gets tricky with stacks like this is that volume and coordination start compounding faster than learning. Once you are touching 500 plus people a day across channels, attribution gets fuzzy and it becomes hard to tell which signals are actually moving pipeline versus just keeping the machine busy. That is usually when founders feel productive but lose clarity on what to double down on. Curious whether you are seeing clean patterns in what actually converts or mostly blended lift.",
          "score": 1,
          "created_utc": "2026-01-23 22:16:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1l97bu",
          "author": "the-it-guy-og",
          "text": "Hi GPT",
          "score": 1,
          "created_utc": "2026-01-25 09:16:44",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qkulib",
      "title": "I run a 6-figure B2B outbound agency, and here are the best tips for your email campaign",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qkulib/i_run_a_6figure_b2b_outbound_agency_and_here_are/",
      "author": "decaster3",
      "created_utc": "2026-01-23 15:58:07",
      "score": 8,
      "num_comments": 2,
      "upvote_ratio": 0.79,
      "text": "Ran outbound for 50+ B2B clients, shipped hundreds of thousands of emails, tested stuff every month like unhinged lab rats. Most advice online is either outdated or written by people who sent 3 campaigns and declared themselves gurus. So here’s the short list of what really worked.\n\n**1/spray & pray is dead. Like fax machines dead**\n\nIf you’re still blasting ‘20–500 employees’ and calling it targeting, congrats, you’re just burning enrichment credits faster, but once you know why this company is interesting, the copy basically writes itself.\n\n**2/your first email does all the work, the rest are emotional support**\n\nEmail #1 gets the replies\n\nEmail #2 sometimes\n\nEmail #3 is already on thin ice\n\nEmail #4+ is just you refusing to let go\n\nInstead of adding follow-ups like it’s a breakup text, rework the offer and relaunch the sequence in 2 months. They won’t remember you, cuz you’re not that special (sorry).\n\n**3/stop running 7–9 step sequences, nobody wants that**\n\nOur best campaigns are 3-4 emails max:\n\na/clear pitch\n\nb/context / why you\n\nc/frictionless CTA (’want a quick audit?’ / ‘want the resource?’)\n\nAfter that - pause, rethink, fix the offer.\n\n**4/inbox volume matters more than your clever copy**\n\nWe cap at 40-50 emails per inbox per day, never more, if replies <1%, something’s broken (usually deliverability)\n\nDon’t waste time playing seed-list bingo, just rotate domains and rewrite the copy.\n\n**5/timing > leads being ‘used once’**\n\nPeople treat TAM lists like one-shot Pokemon cards.\n\nReality: timing changes, budgets change, fires appear.\n\nWe recycle TAM every 6 month with new angles. A ‘no’ six months ago is often just ‘not right now’ moment\n\n**6/test offers, not button colors**\n\nEveryone A/B tests subject lines like it’s 2016.\n\nWe test what we’re offering like:\n\n\\-save time vs make money\n\n\\-case study first vs pain first\n\n\\-which persona responds to which angle\n\nThat’s where real lifts come from.\n\n! One extra tip - **less poetry, more receipts**\n\nAnalogies rarely land, real signals do (hiring pages, tech stack changes, Series A, Intercom rollout, recent posts)\n\nCall out something they actually care about and you sound human without trying too hard.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qkulib/i_run_a_6figure_b2b_outbound_agency_and_here_are/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o19ag2a",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-23 15:58:07",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qhy5iy",
      "title": "First time in B2B Service marketing, how to you actually market a consulting firm?",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qhy5iy/first_time_in_b2b_service_marketing_how_to_you/",
      "author": "jade9996",
      "created_utc": "2026-01-20 11:00:05",
      "score": 7,
      "num_comments": 12,
      "upvote_ratio": 0.89,
      "text": "Hey everyone,\n\nI’ve just started running marketing for a B2B consulting/services company, and it’s my first time selling a service. Before this, all my experience was on the product side.\n\nI’m noticing that a lot of my usual product marketing reflexes don’t fully apply.\n\nFor those who’ve done both:\n\n\t•\tWhat are the main differences between selling a service vs a product?\n\n\t•\tWhat’s worked best for B2B services marketing in your experience?\n\nI’m having imposter syndrome so looking forward to your insights! ",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qhy5iy/first_time_in_b2b_service_marketing_how_to_you/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o0nax8j",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-20 11:00:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0nggtr",
          "author": "kubrador",
          "text": "welcome to the world of selling vibes and relationships instead of features and specs.\n\nmain difference is your product is literally just trust, so everything becomes \"prove we're not idiots\" instead of \"look at our cool thing.\" people are buying YOU, not a box. which means content marketing, thought leadership, and case studies actually matter instead of being nice-to-haves. also nobody buys consulting on a whim so your sales cycle is longer than your attention span.\n\nwhat actually works: get your senior consultants writing/speaking about stuff (they hate this), become the go-to expert for your specific niche, and make case studies that show actual business impact not just buzzwords. referrals will do more for you than any campaign because nobody wants a mystery consultant.\n\nimposter syndrome is standard for this switch. product side you can point at metrics. services you're basically trying to convince people your gray beards are worth the hourly rate.",
          "score": 6,
          "created_utc": "2026-01-20 11:46:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0nd0ai",
          "author": "RenaissanceThinker1",
          "text": "What worked for us in service marketing was focusing on trust first. You have to understand the problem better than the buyer and show that understanding out loud. When people feel like you’ve been in the same mess and can explain what usually happens next, the conversation changes fast.",
          "score": 3,
          "created_utc": "2026-01-20 11:18:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0npq8d",
          "author": "globetrotter-vienna",
          "text": "Build trust by showing competence. They call it \"thought leader\".\nThis is for Marketing (creating leads), Not selling.",
          "score": 3,
          "created_utc": "2026-01-20 12:52:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0nc3gc",
          "author": "Ok_Employ_897",
          "text": "I’ve noticed that in consulting, it’s more about warm network and relationship building. I love to follow the concepts of Daniel Priestly .",
          "score": 2,
          "created_utc": "2026-01-20 11:10:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0xozln",
          "author": "erickrealz",
          "text": "The biggest difference is services sell on trust and credibility, not features. With products you can demo functionality and show the interface. With consulting, clients are buying your expertise and track record, which is way harder to prove upfront.\n\nFor services, case studies and testimonials are absolutely critical. Our clients in consulting see the best results when they lead outreach with specific client wins like \"helped X company reduce costs by 40%\" versus talking about their methodology. Nobody cares about your process until they trust you can deliver results. Also founder-led sales matters way more for services because buyers want to meet the actual people doing the work, not just a sales rep.\n\nWhat works best is targeted cold outreach to companies showing signals they need your help, content that demonstrates deep expertise in your niche, and partnership referrals with complementary firms. LinkedIn presence helps but it's slow. Cold email to decision-makers with personalized insights about their business converts way better when done properly. The key is positioning as an expert who understands their specific challenges, not a vendor selling generic consulting hours.",
          "score": 2,
          "created_utc": "2026-01-21 21:54:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0nr2vm",
          "author": "runlongfast",
          "text": "For services firms, how much of pipeline/sales do you see coming from marketing vs sales team?  Since it’s more about relationships and expanding existing projects, is the percentage from sales higher than for product companies?  And maybe more as a percentage from existing clients than new logos?",
          "score": 1,
          "created_utc": "2026-01-20 13:00:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0p0a88",
          "author": "alexboyd08",
          "text": "It’s basically, “look at my true and also fancy sounding insights - I am very confident in this.”\n\nThen case studies echoing that\n\nTurn it all into a referenceable point of view that can be encapsulated into a word or phrase, like “performance SEO” or “trenches property management”\n\nYou’re branding an idea that sits behind how you operate and making it absolutely clear that you can be trusted because all of these other great people trust you too",
          "score": 1,
          "created_utc": "2026-01-20 16:50:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0rbgt8",
          "author": "Euphoric-View-9876",
          "text": "One shift that helps with services is realizing marketings job isnt demand creation as much as demand interception. The buyers already exist theyre asking questions, reacting to competitors, debating approaches usually in public. If your firm consistently shows up where those conversations already happen (LinkedIn comments, Reddit threads, niche communities) with informed, non salesy insight, trust compounds fast. Services dont win by being louder; they win by being present at the moment someone is already thinking “we need help with this.”",
          "score": 1,
          "created_utc": "2026-01-20 23:20:32",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qi7f47",
      "title": "How do you actually find leads and close sales in 2025? (Cold outreach is dying)",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qi7f47/how_do_you_actually_find_leads_and_close_sales_in/",
      "author": "Soft-Dragonfruit6447",
      "created_utc": "2026-01-20 17:28:41",
      "score": 6,
      "num_comments": 23,
      "upvote_ratio": 1.0,
      "text": "My reality:\n\n* Cold emails: 2% reply rate\n* LinkedIn requests: ignored\n* Ads: expensive, low conversion\n\nWhat I want to know:\n\nWhere are you finding people who actually want to buy right now? Are you tracking buying signals or just blasting everyone?\n\nWhat's your process from \"found a lead\" to \"signed deal\"?\n\nI see people saying \"show up where your audience talks\" what does that mean practically?\n\nShare your actual workflow, not theory.",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qi7f47/how_do_you_actually_find_leads_and_close_sales_in/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o0p8g8n",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-20 17:28:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ql1ya",
          "author": "erickrealz",
          "text": "2% reply rate on cold email isn't dying, that's actually pretty normal if you're targeting right. The problem is people expect 20% and get discouraged when reality hits. Our clients doing real volume see similar numbers and still generate solid pipeline because they're sending to qualified lists, not random blasts.\n\n\"Show up where your audience talks\" means actually participating in communities without pitching. Like if you sell to e-commerce brands, join their Facebook groups, answer questions on Reddit, comment on relevant LinkedIn posts. Build credibility first, then people DM you asking what you do. It's slower but the leads are way warmer than cold outreach.\n\nFor finding people ready to buy, track intent signals. Companies hiring for roles your product supports, recent funding announcements, tech stack changes, competitor review sites showing frustration. These indicate actual pain happening now versus \"might need this someday.\" Use Sales Navigator job alerts or set up Google alerts for your target keywords plus funding/hiring news.\n\nYour workflow should be multi-touch. Email, LinkedIn connection, engage with their posts, email again in 5 days, call if you have their number. One touchpoint doesn't cut it anymore. Most deals take 7 to 12 touches before someone even responds, let alone buys. If you're giving up after one email, that's your problem right there.",
          "score": 3,
          "created_utc": "2026-01-20 21:11:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0pvezp",
          "author": "OkSundae8168",
          "text": "Have  you tried personalizing cold emails and scaling them ?",
          "score": 1,
          "created_utc": "2026-01-20 19:12:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0pwgea",
              "author": "OkSundae8168",
              "text": "if you send 200 personalized cold emails per day that is 6k per month if you send all the 30 days 2% of replay rate ( for personalized cold emails its more 6-13%) that is 120 potential leads if you close only 25% that comes out to 30 new clients per month \n\nand yes someone in this very community is talking about how you can check the comments of the person in your industry that gets traction you can lurk through there and many of them dont afford his service maybe they can afford yours",
              "score": 2,
              "created_utc": "2026-01-20 19:17:01",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0re5ob",
          "author": "RomainBlumberger",
          "text": "Yeah, so I’m running a mix of both.\n\nI always have evergreen and “blast” campaigns running in the background. Those are mainly for testing and keeping volume steady. On top of that, I run signal-based campaigns when there’s a clear trigger worth acting on.\n\nThe evergreen test campaign never stops. It gives me constant feedback on messaging. \n\nIn parallel, I keep a signal-based outbound system in the back. But for that to really work, I need to refresh and map my entire target market. Once I have the full market mapped, I can track signals properly.\n\nWho is your ICP by the way ?",
          "score": 1,
          "created_utc": "2026-01-20 23:35:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0rx091",
          "author": "TaxNearby9307",
          "text": "I have been focusing on reddit lately. Communities are actively asking questions and discussing problems they are facing. Then, there are some lead gen tools that find you leads according to your business or product. One of them that I personally use is Leadmatically. It exclusively generate reddit leads which are currently my focus. ",
          "score": 1,
          "created_utc": "2026-01-21 01:19:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0s6kx5",
          "author": "Alone_Ad_3375",
          "text": "First it's 2026 second it ain't dying it's just changing because the attention span is decreasing\n\nI think Reddit is the real deal in 2026 and beyond \n\nImo hire some beautiful women SDRs your 90% game will be sorted.",
          "score": 1,
          "created_utc": "2026-01-21 02:14:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ug2tq",
          "author": "LostContribution2056",
          "text": "Cold emails is a numbers game 2% reply rate is normal but if you scale the volume that's a lot of leads. We mostly use cold emails and Linkedin outreach, we use sales navigator to build lead lists it has the most reliable data we then use airscale to scrape and enrich for emails/phone numbers. Then start cold calls/emails.\n\nWe also sometimes run linkedin outreach campaigns using dripfy",
          "score": 1,
          "created_utc": "2026-01-21 12:42:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o107d00",
              "author": "TransitionNew7315",
              "text": "Hey, what is your experience with linkedin outreach? How do you approach it?",
              "score": 1,
              "created_utc": "2026-01-22 06:51:49",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0urkp9",
          "author": "Tiny-Celery4942",
          "text": "yup feeling like cold outreach was just shouting into the void. What actually worked for me wasn’t a magic trick, but making LinkedIn a daily habit instead of a \"post and pray\" situation.\n\nNow, I run a loop that books B2B calls: I start with a list of my ideal customers. Then, I make a \"mini feed\" of just those people. I warm them up with real comments, connect with a personal note, and send a first DM with one easy question. I treat follow ups like gold.\n\nTo keep a targeted feed and draft comments fast, I use Depost AI. It also tracks follow ups so I don't miss anyone.",
          "score": 1,
          "created_utc": "2026-01-21 13:50:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1a19x7",
              "author": "MajesticFox6",
              "text": "I do it in a similar way but curious what you mean by a \"mini feed\"? I usually just click their profile and comment on their latest post etc. Just wondering if there's an easier way to do it.\n\nAlso, after they answer your first DM, how long do you wait to pitch?",
              "score": 1,
              "created_utc": "2026-01-23 18:00:08",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0uxpxz",
          "author": "Dangerous_Bowler3286",
          "text": "Cold outreach is not dead, but blind outreach is. I run lead gen for a manufacturing company and early on I had the same issues low replies, wasted spend, lots of manual work.\n\nWhat works now is an end-to-end workflow: plan intent & ICP → find companies → gated enrich + verify → deliverability setup → send sequences → auto-replies & live qualification → book meetings → sync outcomes. Reply rates went up once targeting and timing improved, and it is budget-friendly since it runs on credit-based tasks.\n\nCurious how others are spotting real buying signals before outreach",
          "score": 1,
          "created_utc": "2026-01-21 14:23:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0wmln5",
          "author": "Longjumping-Check-76",
          "text": "Modern sales is about targeted relationship building, not mass outreach. Tools like LinkedIn Sales Navigator can help identify precise prospects, while platforms such as ThreadCatch enable more strategic connection tracking. The key is personalization and demonstrating genuine value before asking for anything.",
          "score": 1,
          "created_utc": "2026-01-21 19:00:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0xg49k",
          "author": "jeeves_inc",
          "text": "This actually lines up a lot with what we’ve seen on our side.\nCold outreach isn’t fully dead, but it’s way less effective as a starting point. What is dying is trying to sell before there’s any context or trust.\nFor us, it’s worked much better when people already “know” us before sales ever shows up. That usually happens through organic content, community participation, or just being visible in the right places. By the time someone reaches out or replies, the conversation doesn’t feel cold anymore.\nIn-person events have also been surprisingly effective again, but not big flashy ones. Smaller meetups, dinners, or industry events where you can actually talk. They don’t always turn into leads right away, but they speed up trust a lot.\nI don’t see it as events vs digital. Digital still matters, but impressions alone don’t do much. What helps is repeated exposure to how you think, not what you sell.\nSales works best when it comes later, once interest already exists. Cold messages with no context still get ignored. Messages that land after someone’s seen your content or met you once feel completely different.",
          "score": 1,
          "created_utc": "2026-01-21 21:14:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0zrjdd",
          "author": "Humble-Food8889",
          "text": "i've been running evergreen campaigns for a while now and building them around buying signals rather than static lists. i track things weekly like job posts and funding rounds etc and enrich those companies with context for example company size, roles they're hiring, tech stack etc before reaching out (databar's been solid for this workflow specifically). blasting emails without relevance will always be a dead-end imo so i'd suggest reaching out with a clear reason like \"hey saw you just hired A\" or \"noticed you're rolling out B\" and keep CTAs low-pressure. conversion is way higher when you're hitting people at the right moment",
          "score": 1,
          "created_utc": "2026-01-22 04:50:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o11xb6g",
          "author": "Tasty_Day_7050",
          "text": "SEO drives all of our lead gen right now and compounds every quarter. \n\nLots to unpack, but it's a combo of technical/on page SEO, optimized landing pages based on transactional keywords, and digital PR. All in-house.\n\nWe went from 2 qualified leads/month to 20+ in ~ 6 months\n\nTakes longer to see the results compared to other channels, but more consistent and scalable",
          "score": 1,
          "created_utc": "2026-01-22 14:38:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1jcdfq",
          "author": "New_Grape7181",
          "text": "I struggled with this exact problem last year. Cold outreach felt like shouting into the void.  \n  \nWhat changed things for me was switching from interruption to relevance. Instead of blasting 500 emails, I started tracking buying signals (funding announcements, new hires in relevant roles, tech stack changes on BuiltWith). Then I'd reach out to maybe 30-40 companies per week, but with actual context.  \n  \nHere's what worked: I'd comment on a founder's LinkedIn post about a problem we solve, wait a few days, then send them a short personalised video (like 45 seconds) referencing their post and showing exactly how we'd solve that specific issue. Not a demo, just a quick walkthrough.  \n  \nResponse rate went from that same 2% you're seeing to around 18-20%. The video format meant they could actually see the solution without committing to a call first.  \n  \nFor \"show up where your audience talks\", I joined two Slack communities where our buyers hang out. Answered questions for a month without pitching anything. Three deals came directly from that.  \n  \nThe workflow is slower but way more effective than volume plays.  \n  \nWhat signals are you currently tracking beyond just job titles and company size?",
          "score": 1,
          "created_utc": "2026-01-25 01:29:13",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qh5gf6",
      "title": "Advice on improving B2B sales knowledge",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qh5gf6/advice_on_improving_b2b_sales_knowledge/",
      "author": "AwakenedMethod",
      "created_utc": "2026-01-19 14:23:14",
      "score": 6,
      "num_comments": 34,
      "upvote_ratio": 1.0,
      "text": "Hi everyone,\n\n  \nBeen a marketer for a couple of years, but it has always been more on the implementation side. I am now hoping to shift to becoming more strategy-focused and a big part of that is learning more about the sales side of B2B.\n\n  \nI am looking for advice and/or suggestions for resources I can check out to build up this knowledge - courses, books, podcasts, the works. I have gone through the pinned subreddit content and queued up those to work through, but any additional recommendations would be greatly appreciated!",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qh5gf6/advice_on_improving_b2b_sales_knowledge/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o0haa0e",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-19 14:23:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0i1df1",
          "author": "Ready-Housing-6079",
          "text": "For B2B influencer marketing I would check out Hector Forwood & the team at Flooencer  \nFor cold emails I like to personally follow Vaibhav Namburi & Mohan Muthoo  \nFor demand generation do follow Liam Bartholomew, he publishes a lot of solid content  \nFor cold outreach and human psychology I would push forward the famous Josh Braun (my personal favorite)  \nFor B2B event marketing you can check out ConvergeX Connections  \nThere are many other resources. My sincere advice though is don't just go head over heels over some random influencers posting recycled stuff",
          "score": 8,
          "created_utc": "2026-01-19 16:31:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0iqn4q",
              "author": "AwakenedMethod",
              "text": "Thank you, this is awesome! Fully agree on random influencer stuff, I knew posting here would give me better sources, your list is greatly appreciated",
              "score": 1,
              "created_utc": "2026-01-19 18:25:18",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0i2ojp",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 3,
          "created_utc": "2026-01-19 16:37:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0iqu29",
              "author": "AwakenedMethod",
              "text": "Awesome, thanks for the recommendations!",
              "score": 1,
              "created_utc": "2026-01-19 18:26:08",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0jel1e",
          "author": "KissyyyDoll",
          "text": "One thing that helped me a lot was just sitting in on sales calls. If your company allows it, ask to be a \"fly on the wall\" for a few discovery calls. You'll hear the actual objections customers have, which is way more valuable than any textbook.\n\nAs for resources, you might want to look into The JOLT Effect or The Challenger Sale. They’re pretty standard but for a good reason, they explain the psychology of why people actually buy (or don't buy) in B2B. Also, look up Chris Walker on LinkedIn or his podcast; he talks a lot about the bridge between marketing and sales.",
          "score": 3,
          "created_utc": "2026-01-19 20:13:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0jidtl",
              "author": "International_Rip706",
              "text": "Didn’t Chris Walker retire and is now off the grid somewhere?",
              "score": 1,
              "created_utc": "2026-01-19 20:31:27",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0jrto6",
                  "author": "umightfafo",
                  "text": "Yeah he sold his stake of Refine Labs but Megan Bowen, the new CEO is still a good person to follow. There’s a couple of other people off that tree you can follow as well",
                  "score": 2,
                  "created_utc": "2026-01-19 21:15:50",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o0lo2ve",
              "author": "yngbld5",
              "text": "I second this advice.  Sitting on sales calls is invaluable.  At a minimum, talk to sales people. Ask them about their conversations with prospects and how they define their problems",
              "score": 1,
              "created_utc": "2026-01-20 03:17:23",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o0m76bv",
              "author": "AwakenedMethod",
              "text": "Thanks for this! I have asked our sales team if I can observe a few calls and definitely going to check out your other recommendations",
              "score": 1,
              "created_utc": "2026-01-20 05:13:44",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0ko9g2",
          "author": "Euphoric-View-9876",
          "text": "If you want to move from execution to strategy, the fastest shortcut isnt more content its proximity to real deals. Sit in on discovery calls, read closed won and closed lost notes in the CRM, and listen to how reps qualify, push back, and lose deals. Pair that with fundamentals like Challenger or SPIN and suddenly marketing strategy stops being theoretical and starts mapping to how buyers actually decide.",
          "score": 3,
          "created_utc": "2026-01-20 00:01:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0m7lr2",
              "author": "AwakenedMethod",
              "text": "This is exactly what I am looking for and hoping to improve/implement",
              "score": 1,
              "created_utc": "2026-01-20 05:16:43",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0hbmbw",
          "author": "Apprehensive_Elk5252",
          "text": "Try to learn more about category management  and buying trends",
          "score": 2,
          "created_utc": "2026-01-19 14:30:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0hbv15",
              "author": "AwakenedMethod",
              "text": "Thanks for replying, adding this to my list. Do you have any preferred sources for learning about this? If not no worries, I will do some digging.",
              "score": 1,
              "created_utc": "2026-01-19 14:31:36",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0ih8gf",
          "author": "JennyAtBitly",
          "text": "Get closer to real sales motions by listening to calls or pipeline reviews, then pair that with fundamentals like The Challenger Sale so strategy connects to how deals actually move.",
          "score": 2,
          "created_utc": "2026-01-19 17:43:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0iqfll",
              "author": "AwakenedMethod",
              "text": "Definitely part of the plan, this is great advice",
              "score": 1,
              "created_utc": "2026-01-19 18:24:23",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0ja4kl",
          "author": "Healthy-Draw-1265",
          "text": "I recommend listening to The Game from Alex Hormozi",
          "score": 2,
          "created_utc": "2026-01-19 19:52:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0m79vc",
              "author": "AwakenedMethod",
              "text": "Adding to my list",
              "score": 1,
              "created_utc": "2026-01-20 05:14:25",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0ji1fb",
          "author": "International_Rip706",
          "text": "The B2B Playbook podcast is good for marketing side into the bridge with sales. Their interviews with seasoned sales leaders are a bit sales methodology dense, but pretty hard to beat for quality of guests.\n\nJess Cook is interesting to follow on LinkedIn for B2B content angle.",
          "score": 2,
          "created_utc": "2026-01-19 20:29:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0m7n17",
              "author": "AwakenedMethod",
              "text": "Thank you, going to check these out",
              "score": 1,
              "created_utc": "2026-01-20 05:16:59",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0jj0at",
          "author": "_forgotmyownname",
          "text": "Go for the Sandler Selling System or look into SPIN Selling. Most marketers stay stuck in lead gen, but understanding how a sales rep actually closes a deal makes your strategy 10x better. It's about the \"why\" behind the buyer's journey.",
          "score": 2,
          "created_utc": "2026-01-19 20:34:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0m7ook",
              "author": "AwakenedMethod",
              "text": "Definitely adding to my resource list",
              "score": 1,
              "created_utc": "2026-01-20 05:17:18",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0k1iv2",
          "author": "Glittering_Tax_7584",
          "text": "Hey, we use Canva for our proposal. And we share it with « public link view » after the meeting. \n\nIt tracks slides seen by time, OS used, device, sometimes the city (or the country) and the average time spend. \n\nWe already had a f*ck yes by a lead who spent 0 second on it after we answered « Did you re-watch our proposal ? »",
          "score": 2,
          "created_utc": "2026-01-19 22:03:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0m7d7a",
              "author": "AwakenedMethod",
              "text": "Very interesting, I'm going to compare this to how our sales team currently runs things",
              "score": 1,
              "created_utc": "2026-01-20 05:15:03",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0karnm",
          "author": "kubrador",
          "text": "read \"the challenger sale\" - it's basically the bible for understanding how b2b buying actually works and will make you sound smart in meetingsfor podcasts, \"30 minutes to president's club\" is solid and doesn't waste your time\n\n the fastest way to learn sales is just shadow some sales calls at your company. ask your ae's if you can sit in. you'll learn more in a week than from any course, plus sales people love explaining their job to anyone who will listen\n\nalso start reading your company's closed-won and closed-lost deal notes in the crm. that's where the actual strategy lives",
          "score": 2,
          "created_utc": "2026-01-19 22:49:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0m7j6p",
              "author": "AwakenedMethod",
              "text": "The Challenger Sale seems to be a common thing in this thread which tells me it's a great recommendation. The CRM note is very true, it's hard to do strategy without this insight",
              "score": 1,
              "created_utc": "2026-01-20 05:16:13",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0ku5c0",
          "author": "astillero",
          "text": "Believe it or not OP, getting interest and discovery calls, can in certain cases, be easier than you think. \n\nHowever, your biggest challenge will be that status quo and getting someone in an organisation to champion your cause. \n\nSure, they think your product is great. They think your marketing is great. But sometimes the pain is not acute enough for them to act. They don't want to be \"that person\" who buys \"that solution\" that is never used or is a flop or results in reputations getting burned. That's normal. In B2B context, most people who buy are trying to protect their own reputations. Half the battle is getting a second person within the target organisation onboard. \n\nThis is why B2B selling becomes easier when you know how to leverage that social dynamic withing organisations to your advantage. Because once you get more than one person involved in the buying process, the personal \"reputational\" risk for the buyer is now hedged. Listening in on sales calls is great way to find out how people more experienced than you turn prospect into a \"champion\" or find a champion for your product within the organisation. Check out a book called The Challenger Customer - it helps explain this dynamic in a bit more detail.",
          "score": 2,
          "created_utc": "2026-01-20 00:33:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0m7ra9",
              "author": "AwakenedMethod",
              "text": "Thanks for the detailed answer, this is great!",
              "score": 1,
              "created_utc": "2026-01-20 05:17:49",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0laowd",
          "author": "Inside-Implement-742",
          "text": "Start following the leading researchers and thought leaders (Gartner for Sales, Challenger Sales, and other sales trainer types).  \nPlenty of great books the last 20 years- main principles have remained similar yet people put some spin on things",
          "score": 2,
          "created_utc": "2026-01-20 02:03:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0m70fk",
              "author": "AwakenedMethod",
              "text": "Thank you, this is very helpful - I definitely want to double down on the works that are foundational",
              "score": 1,
              "created_utc": "2026-01-20 05:12:36",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0qln5t",
          "author": "Radiant-Security-347",
          "text": "Sandler Sales.",
          "score": 2,
          "created_utc": "2026-01-20 21:13:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o12301b",
          "author": "Mobile-Ambition-3714",
          "text": "Two things helped me a ton: one was reading The Challenger Sale, the other was chatting directly with salespeople at my company and asking them how they actually win deals. The book gives you frameworks but the salespeople give you the stuff that happens in the trenches. Combine both and your marketing strategy will get way sharper.Two things helped me a ton: one was reading The Challenger Sale, the other was chatting directly with salespeople at my company and asking them how they actually win deals. The book gives you frameworks but the salespeople give you the stuff that happens in the trenches. Combine both and your marketing strategy will get way sharper.",
          "score": 2,
          "created_utc": "2026-01-22 15:06:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0xk81y",
          "author": "Ambitious_Escape8867",
          "text": "Nice one",
          "score": 1,
          "created_utc": "2026-01-21 21:32:55",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qitsys",
      "title": "What's actually working for B2B fintech SaaS marketing in 2026 (long cycles, compliance buyers, and \"trust-first\" pipeline)",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qitsys/whats_actually_working_for_b2b_fintech_saas/",
      "author": "Sea-Environment-5938",
      "created_utc": "2026-01-21 09:52:17",
      "score": 6,
      "num_comments": 16,
      "upvote_ratio": 0.88,
      "text": "Hey everyone, I’m seeing a lot of fintech SaaS teams stuck in the same loop right now:\n\n* 6–12 month sales cycles\n* compliance/legal as a hard gate\n* buyers ghosting anything that feels generic\n* “We need more leads” when the real issue is quality, trust and timing\n\nI’ve been working in B2B fintech SaaS (payments APIs, fraud/risk, lending, compliance automation), and a few patterns are consistently working in 2026 without needing insane ad budgets.\n\n**1) Hyper-narrow ICP and positioning**\n\n“Secure fintech platform” is invisible now.\n\nThe teams winning are painfully specific, like:\n\n>“Real-time fraud APIs for mid-market fintechs processing 50k and tx/day who need lower false positives without killing approval rates.”\n\nThat level of clarity makes ABM, content, outbound, and even demo flows way easier to execute.\n\nQuick test: can your ICP fit on one line with a disqualifier?\n\n**2) Intent signals > volume**\n\nA lot of teams still run outbound like it’s 2021: big lists, sequences and hope.\n\nWhat’s working better is signal-based targeting, even if the list is smaller:\n\n* compliance hiring spikes\n* vendor migration chatter\n* sudden increase in security/legal content consumption\n* product pages visited after pricing pages (big one)\n\nIt’s less “spray and pray” and more “show up when the pain is awake.”\n\n**3) Thought leadership that’s about risk and ROI** \n\nFintech buyers don’t want “innovation.” They want:\n\n* “Will this break us?”\n* “Will regulators hate this?”\n* “Will this reduce chargebacks/fraud losses without nuking approvals?”\n\nContent that performs best tends to be:\n\n* risk frameworks (“how this fails”)\n* ROI math with assumptions\n* implementation timelines (what actually takes 2 weeks vs 3 months)\n* AI governance / explainability (especially for fraud and lending)\n\nThe trust-building content isn’t flashy it’s specific and defensible.\n\n**4) Partnerships are still the fastest path to warm pipeline**\n\nEmbedded finance is noisy, but partnership motion is very real when done right.\n\nThe best fit I keep seeing:\n\nFintech SaaS and vertical SaaS / platforms with distribution\n\n(ERP, procurement, commerce tools, industry-specific software)\n\nEven a lightweight co-marketing and integration narrative can create higher-intent conversations than cold outbound.\n\n**5) Interactive beats long PDFs**\n\nMost decision makers won’t read a 50-slide deck.\n\nThings that get better engagement:\n\n* short, personalized demo videos (3–5 mins)\n* self-serve “what would this save me?” simulators\n* implementation checklists (security and compliance friendly)\n\nYou don’t need to be fancy just reduce the effort to understand the value.\n\n**6) First-party data is the real advantage now**\n\nWith privacy and cookie loss, the compounding strategy is:\n\n* SEO that targets “switching” queries (migration, alternatives, comparisons)\n* gated tools (checklists, calculators, templates)\n* newsletters that attract the right buyer persona\n* lifecycle content that supports expansion (bowtie)\n\nThe teams that win are building a feedback loop, not a one-time funnel.\n\n**7) Bowtie mindset: marketing owns expansion too**\n\nIn fintech SaaS, expansion is where the unit economics get clean.\n\nMarketing can support this by building:\n\n* onboarding education (reduce time-to-value)\n* usage-based upsell triggers (feature adoption campaigns)\n* proof libraries for security/compliance objections\n* customer stories that show “what changed after implementation”\n\n# Curious what others are seeing\n\n**What’s killing fintech SaaS lead gen for you right now?**\n\nLong cycles? Trust barriers? Procurement/compliance drag? Crowded category?\n\nAnd are you leaning more into:\n\n* partnerships and distribution\n* intent and signal-based outbound\n* trust-first content (risk/ROI/implementation)\n\nWould love to hear what’s working in your niche.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qitsys/whats_actually_working_for_b2b_fintech_saas/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o0tv0mw",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-21 09:52:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0vvj2p",
          "author": "NoRegret9534",
          "text": "This lines up with what I’m seeing too, even outside fintech (most fields tbh).\n\nThe common thread across almost all B2B right now isn’t “more leads,” it’s **being early** ***and*** **credible at the same time**. Most teams are late *and* generic, which is a brutal combo.\n\nThe intent-signal point is huge. Volume-based outbound feels completely dead unless there’s a real reason for you to exist in someone’s inbox that week. Showing up when pain is *forming*, not after it’s been blasted by five vendors, changes the entire dynamic.\n\nI’d add one thing that seems under-discussed: **speed + freshness as a trust signal**. When buyers realize you’re reacting to *current* conditions instead of running recycled plays, it immediately lowers skepticism. Even strong content gets ignored if it feels like it was written “for everyone.”\n\nAlso agree on interactive > static. Anything that answers “what will this realistically look like for *me*?” beats polished thought leadership right now.\n\nCurious if others are seeing the same drop-off once something feels even slightly templated. It feels like relevance windows are getting shorter every quarter.",
          "score": 2,
          "created_utc": "2026-01-21 17:01:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0u5yh2",
          "author": "RevolutionaryKey7404",
          "text": "I was also thinking to start such startup from long days , can we chat?",
          "score": 1,
          "created_utc": "2026-01-21 11:29:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0ucxgc",
              "author": "Sea-Environment-5938",
              "text": "yes why not.",
              "score": 1,
              "created_utc": "2026-01-21 12:21:31",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0v0u5q",
                  "author": "RevolutionaryKey7404",
                  "text": "So what I see this whole Fintech area like PE,M&A etc etc, are very relation based industry , so how do you think you will get into and get your clients since for a connectionless guy how can such a person do and get clients , I mean in sure that cold message and calling is not possible here. Whats your thoughts on this?",
                  "score": 1,
                  "created_utc": "2026-01-21 14:39:37",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0urfbv",
          "author": "Tiny-Celery4942",
          "text": "I was in the same boat, seeing fintech SaaS teams struggle with long sales cycles and compliance hurdles. What actually worked for me wasn’t a tactic. It was turning LinkedIn into a boring daily system instead of a place I randomly post and pray.\n\nHere’s the loop I run now that consistently books B2B calls:\n\n\\-   Start with a hand built prospect list (not the feed) 50–150 ICP accounts + people in each.\n\n\\-  Create a “mini feed” just for those people. Each day I only look at posts from that list.\n\n\\-   Warm them with 5–10 real comments per day.\n\n\\-   Send connection requests only once they’re warm.\n\n\\-   First DM = context + one easy question.\n\n\\-   Treat follow ups like a pipeline, not an afterthought.\n\nWhat was a waste of time: Mass cold DMs, InMails without prior interaction, Posting more content hoping “leads will come”.\n\nThe system above still takes \\~30–45 minutes a day, but it made results predictable. To keep a targeted feed of prospects and run this system, I use Depost AI. It helps me build targeted feeds, draft comments and DMs and tracks follow ups so I don't miss anyone.",
          "score": 1,
          "created_utc": "2026-01-21 13:50:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0v2idg",
          "author": "Wrong-Finish7655",
          "text": "on outbound, intent beats volume by a mile. we stopped big list pulls and focused on smaller, signal-heavy segments, then sourced contacts cheaply so testing didn’t hurt (leadcourt helped keep costs low). fintech outreach only works when timing is right , otherwise you’re just noise. how are you actually detecting “pain is awake”?",
          "score": 1,
          "created_utc": "2026-01-21 14:48:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ze10d",
          "author": "agonsenhauser",
          "text": "Big yes on the first-party data point (SEO, gated tools, newsletters), but I'm curious how teams are handling the ROI timeline conversation internally. If your sales cycle is already 6-12 months, and you're investing in building this infrastructure now, you're realistically looking at 12-18+ months before you can clearly attribute pipeline to those efforts.\n\nHow are you justifying that investment when leadership is still pushing for near-term pipeline? Are you running it parallel to shorter-cycle tactics, or have you found ways to show leading indicators earlier (engagement quality, sales using content in cycles, etc.)?\n\nThe compounding value is real, but the \"trust us, this will pay off in 2027\" pitch is brutal when you need results in Q2.",
          "score": 1,
          "created_utc": "2026-01-22 03:24:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o184a1p",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-23 12:13:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o18qslk",
          "author": "stranmansky",
          "text": "You're missing the most critical element of de-risking a purchase: customer evidence. I don't mean the soaring, \"our business sucked, then we met Acme, now everything's awesome\" case studies. I mean the point in time snapshots from the customer lifecycle when you capture a compliance analyst sharing their \"a-ha!\" moment, or a CFO discussing specifically why he/she chose your solution over the hundreds of others available to them.",
          "score": 1,
          "created_utc": "2026-01-23 14:23:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1jmvba",
          "author": "New_Grape7181",
          "text": "I've found that point 5 about interactive content really does move the needle, especially in longer sales cycles like fintech.  \n  \nWe were stuck in that same ghosting pattern you mentioned. Sending decks and hoping for replies. What changed things for us was switching to short personalised videos (under 3 minutes) where we'd reference something specific about their use case or a signal we caught (like a recent compliance hire or a migration they mentioned publicly).  \n  \nThe reply rate jumped quite a bit because it felt human and showed we'd actually done the work to understand their situation. It also helped us stand out from the generic sequences everyone else was running.  \n  \nOne thing I'd add to your signal-based targeting point is combining LinkedIn activity with those intent signals. If someone from the target account is engaging with content around vendor migration or posting about fraud losses, that's when we'd send a video DM rather than just an email. It feels timelier and less intrusive.  \n  \nWhat's been your experience with timing on those signals? Do you wait for multiple triggers or jump on the first one?",
          "score": 1,
          "created_utc": "2026-01-25 02:26:35",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qjiqaj",
      "title": "Why do long sales cycles feel even longer despite better marketing tools?",
      "subreddit": "b2bmarketing",
      "url": "https://www.reddit.com/r/b2bmarketing/comments/1qjiqaj/why_do_long_sales_cycles_feel_even_longer_despite/",
      "author": "Charles_R23",
      "created_utc": "2026-01-22 02:52:44",
      "score": 5,
      "num_comments": 10,
      "upvote_ratio": 1.0,
      "text": "Automation is everywhere, but deals still stall. Buyers consume more content than ever, yet decisions take longer to finalize.",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/b2bmarketing/comments/1qjiqaj/why_do_long_sales_cycles_feel_even_longer_despite/",
      "domain": "self.b2bmarketing",
      "is_self": true,
      "comments": [
        {
          "id": "o0z8itq",
          "author": "AutoModerator",
          "text": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/b2bmarketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-22 02:52:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0zk1cm",
          "author": "kubrador",
          "text": "because now you gotta nurture leads through 69 touchpoints instead of just calling someone and asking if they want to buy something.",
          "score": 1,
          "created_utc": "2026-01-22 04:01:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0zsjda",
          "author": "stacktrace_wanderer",
          "text": "From the ops side, it often feels longer because more people are involved now, not because marketing is worse. More content means more stakeholders feel informed enough to have an opinion, which adds loops and pauses. I have also seen buyers delay decisions because the cost of waiting feels low, even when the pain is real. Tools speed up awareness, but they do not reduce internal alignment work. That part still happens in meetings and inboxes, and it rarely moves fast.",
          "score": 1,
          "created_utc": "2026-01-22 04:57:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0zt0am",
          "author": "Agitated-Argument-90",
          "text": "I think they are not longer we are just becoming less and less patient in general so everything looks like it takes more time than it should.",
          "score": 1,
          "created_utc": "2026-01-22 05:00:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o106zrt",
          "author": "signal_loops",
          "text": "because tools increased activity, not alignment, buyers are better informed but more risk-averse, more stakeholders are involved, and internal consensus takes longer. marketing creates touchpoints and content, but if it doesn’t reduce decision risk or help buyers justify the purchase internally, the cycle still drags. more automation speeds distribution, not decisions.",
          "score": 1,
          "created_utc": "2026-01-22 06:48:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o10r8oj",
          "author": "Impressive-Amount255",
          "text": "Because we have more tools for everything, not just marketing, therefore your customers have more tools, therefore it takes them longer to decide whether they really need yet another tool.",
          "score": 1,
          "created_utc": "2026-01-22 09:54:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o11rw9u",
          "author": "Minute-Nose9876",
          "text": "Everybody's just drowning in information. Very few people in companies are actually capable of filtering out all the noise around them and deciding what's important and what's not (there's also not enough incentives for them to do so).",
          "score": 1,
          "created_utc": "2026-01-22 14:10:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1312ds",
          "author": "Majestic_Hornet_4194",
          "text": "Long sales cycles drag because buyers get overwhelmed with too much info and options, not just because of marketing tools.",
          "score": 1,
          "created_utc": "2026-01-22 17:42:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1749i0",
          "author": "theguywhobuilds",
          "text": "Sales cycles feel longer because most of the decision now happens *before* sales ever sees the buyer, while teams are measuring speed only after the hand-raise.\n\nFrom the outside it looks like nothing is moving, but internally buyers are already doing months of research and alignment.\n\n**TL;DR:**  \nBuyers research quietly for longer, involve more people, and delay commitment, while sellers optimize funnel speed instead of reducing pre-sales friction.\n\nMost buyers spend months reading content, checking Reddit, comparing vendors, and building an internal case before talking to sales. That time is invisible, so when a deal finally enters the CRM it feels slow and unpredictable.\n\nAt the same time, buying committees are larger and more risk-averse. Even with interest, deals pause around budget cycles, internal alignment, or “not urgent yet,” which stretches perceived timelines.\n\nTools speed up execution, not conviction. The teams that feel faster focus less on forcing urgency and more on staying visible during research, simplifying internal buy-in, and reducing confusion early.\n\nThat’s why cycles feel longer not because nothing is happening, but because most of it happens offstage.",
          "score": 1,
          "created_utc": "2026-01-23 06:59:34",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}