{
  "metadata": {
    "last_updated": "2026-02-16 09:18:16",
    "time_filter": "week",
    "subreddit": "Blogging",
    "total_items": 20,
    "total_comments": 212,
    "file_size_bytes": 206079
  },
  "items": [
    {
      "id": "1r1zrom",
      "title": "If I start a blog today (in 2026), how do I do that?",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1r1zrom/if_i_start_a_blog_today_in_2026_how_do_i_do_that/",
      "author": "Key_Question5584",
      "created_utc": "2026-02-11 15:05:29",
      "score": 36,
      "num_comments": 34,
      "upvote_ratio": 0.9,
      "text": "1. I choose a niche where I have real time experience, mainly from my job or business, and where the competition is lower than in passion-based niches.\n2. Another benefit is that I understand the real problems in that niche.\n3. I use WordPress to build my blog.\n4. I host my blog on shared hosting (if monthly page views cross 1 lakh, I move to cloud hosting).\n5. I buy a premium theme and don’t waste time customizing free ones.\n6. I invest in SEO tools like Ahrefs or SEMRUSH to find out which keywords work for my competitors.\n7. You can get SEO tools at a lower price from some group-buy SEO tool websites.\n8. I add an image, PDF, or Word template to each blog post.\n9. I will start a YouTube channel where I turn each blog post into a simple video.",
      "is_original_content": false,
      "link_flair_text": "Tips/Info",
      "permalink": "https://reddit.com/r/Blogging/comments/1r1zrom/if_i_start_a_blog_today_in_2026_how_do_i_do_that/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o4t7u8b",
          "author": "pouldycheed",
          "text": "don’t overthink tools at the start. You don’t need Ahrefs day one. Write 20–30 solid posts first and see what actually gets traction.\n\n\n\n\nAlso focus hard on distribution. SEO takes time. Share in niche communities, LinkedIn, email list, etc.",
          "score": 7,
          "created_utc": "2026-02-11 15:17:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4tg79i",
              "author": "LuckyRubberDuckie",
              "text": "SEO builds long-term traffic. Reactive marketing builds right-now traffic. If you're starting in 2026, you probably need both.",
              "score": 2,
              "created_utc": "2026-02-11 15:56:57",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o4t8ik0",
              "author": "Key_Question5584",
              "text": "I treat blogging as a business, so SEO tools are a must for me.",
              "score": 1,
              "created_utc": "2026-02-11 15:20:22",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4t9wmg",
                  "author": "bluehost",
                  "text": "That makes sense if you're treating it like a business. It's always interesting to see how different people balance tools and execution. The blogs I've seen really grow for some in the long run, are the ones that connect their content back to something sustainable, whether that's services, products, or an audience they can reach directly.  Your plan covers the structure well. Consistency is usually what turns it into results.",
                  "score": 3,
                  "created_utc": "2026-02-11 15:27:08",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o4thmo5",
                  "author": "Vivid_Read3677",
                  "text": "Writing blogs that rank from first post itself could do wonders down the line. I also use Ahrefs for new websites from day 1.",
                  "score": 1,
                  "created_utc": "2026-02-11 16:03:37",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o4thpbd",
                  "author": "CraftBeerFomo",
                  "text": "Didn't you tell us yesterday your blog only make $300 per month from over 100,000 visitors p/m? What kind of \"business\" is this?",
                  "score": 1,
                  "created_utc": "2026-02-11 16:03:58",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4thf0f",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 4,
          "created_utc": "2026-02-11 16:02:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4u1a6g",
              "author": "Fuzzy_Possibility",
              "text": "I have a real dislike for “bloggers” who claim to make X amount from blogging but when you actually look into it they make it all by selling courses / groups with information you could get for free to naive newbies who sign up thinking they will make the same. But these people don’t have any real advice to sell as they don’t actually make the money via blogging.\n\nIf your selling a real course or group then that’s great, but the fact some people are out there charging £10k is also gross imho",
              "score": 2,
              "created_utc": "2026-02-11 17:35:33",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4ub84p",
                  "author": "Intelligent_Bad_8505",
                  "text": "My questions from those who write negative comments about any specific field. So the first question is that you write such comments because you tried such field and failed of getting quality result. Or you just saying with out experiencing into it? Don't mind my comment I just want to know the truth. Because there are other new people which will be scrolling to your comment and will get demotivated with out any reason and experimenting.",
                  "score": 2,
                  "created_utc": "2026-02-11 18:21:36",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o4thub1",
              "author": "hearth8529",
              "text": "Appreciate the insight normally I’m good at catching these. Thank you!",
              "score": 1,
              "created_utc": "2026-02-11 16:04:37",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o4tiqfc",
              "author": "Key_Question5584",
              "text": "🙏",
              "score": 1,
              "created_utc": "2026-02-11 16:08:48",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o4ub5jl",
              "author": "Own_Amoeba_5710",
              "text": "I don't see why anyone would need a course to get started? I found this subreddit, read old posts and watched youtube videos. There is plenty of free content on how to get started successfully. ",
              "score": 1,
              "created_utc": "2026-02-11 18:21:15",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4t9mbf",
          "author": "hearth8529",
          "text": "How do people turn their blogs to video? Just read them out?",
          "score": 5,
          "created_utc": "2026-02-11 15:25:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4tcsm4",
              "author": "Key_Question5584",
              "text": "Turn your blog post into a bullet list using Google Slides, and explain each point by doing a screen recording. \n\nShow some screenshots or images in between your explanation.\n\nYou can do that while editing the video.",
              "score": 4,
              "created_utc": "2026-02-11 15:40:58",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4u0cno",
          "author": "Lonely_Mark_8719",
          "text": "Early blogging growth is mostly patience disguised as strategy. The only thing that worked consistently for us was publishing regularly and improving older posts. Traffic compounded once there was enough depth in one niche.",
          "score": 5,
          "created_utc": "2026-02-11 17:31:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4vtpay",
          "author": "deimprovement",
          "text": "Heavily focus on social media, push traffic to social media a lot. What i've done that i find works well it building tools on your blog. So like mini softwares. It's a great way to keep people coming back to your blog.",
          "score": 2,
          "created_utc": "2026-02-11 22:43:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4y6lt3",
          "author": "EquivalentTerrible54",
          "text": "What’s a Lakh?",
          "score": 2,
          "created_utc": "2026-02-12 08:25:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4yaqhv",
              "author": "Key_Question5584",
              "text": "100,000 (one hundred thousand)",
              "score": 1,
              "created_utc": "2026-02-12 09:06:02",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4vembm",
          "author": "Cheap-Picks",
          "text": "Go with shared hosting for a start. Wordpress is not the only blogging platform. I use microB and it is very litewieght and amazingly faster compared to wordpress. Niche is a good way to chose your path but all are saturated (or not). SEO tools will not help you much with that if you compare your investment vs results. Go with the YouTube channel instead and buildaudience first then go back to blogging or run both simultaneously",
          "score": 1,
          "created_utc": "2026-02-11 21:29:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4xolkd",
          "author": "Long_Page_1620",
          "text": "choosing the right niche with your objective to drag it on is most important and can be creative by using how you wanna explain it further either by marking points or maybe giving short headings in each para phrases would add elegant and unique touch is what i feel.\n\n",
          "score": 1,
          "created_utc": "2026-02-12 05:40:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4yscug",
          "author": "Existing-Cod5443",
          "text": "Write blogs with passion with your own content; one day, you will see results from your work. Don't expect short-time succes in blogging; this is my personal experience. I shared.",
          "score": 1,
          "created_utc": "2026-02-12 11:49:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ytdzw",
          "author": "AverageParking7050",
          "text": "What do you do when you have two very different interests/niches and want to pursue both? I don’t think it’s a good idea to integrate both is it?",
          "score": 1,
          "created_utc": "2026-02-12 11:57:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4yy6z3",
              "author": "Key_Question5584",
              "text": "You can run two blogs.\nI also have multiple blogs.\nThe best thing is we can host multiple blogs in same hosting.",
              "score": 1,
              "created_utc": "2026-02-12 12:32:21",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4z76on",
          "author": "Upstairs-Kitchen5981",
          "text": "From my experience, I can advise you on hosting ans theme. Go with Lyrical Host if you need additional help (technical/developer) as their team helps with that too at no extra cost and go with Kadence. And for SEO plugin, The SEO Framework. This is my tried and tested toolset. ",
          "score": 1,
          "created_utc": "2026-02-12 13:29:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4zmrco",
          "author": "kcmarshall777",
          "text": "I believe Semrush still has a free trial. Regardless, you dont need to pay for any tool for more than a month to start.\n\nDo your keyword research within a month or free trial period at the beginning to determine your topic list, and cancel the subscription until you can justify the costs. \n\nYou need the money for many other tasks/tools like hosting, premium Wordpress themes, AI writing tools, etc.",
          "score": 1,
          "created_utc": "2026-02-12 14:54:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o552c8t",
          "author": "Comfortable_Pin_1397",
          "text": "Mate, make sure you have set up your Google search console correctly, you'll thank me later! ",
          "score": 1,
          "created_utc": "2026-02-13 10:14:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o557b89",
          "author": "YurieBlog",
          "text": "Well, with enough money you can just buy traffic and comments, and make **your** blog great (again) 😁",
          "score": 1,
          "created_utc": "2026-02-13 10:59:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ar8v3",
          "author": "TheDoomfire",
          "text": "Static websites are faster, more SEO friendly and cheaper.\n\nWordpress sure but you could also use Astro/eleventy or some other way. They have themes free or one time payments.\n\nI only really pay for the domain that is under $11/year (.com), but I even seen websites with free domains rank. And I host for free on Cloudflare pages and some assets at GitHub.\n\nCloudflare pages have \"unlimited bandwidth\" according to themselves so if you have over 100,000 views per month you should still be able to host for free. Or at least still be cheap.",
          "score": 1,
          "created_utc": "2026-02-14 06:06:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5i9xjj",
          "author": "Time-Motor5673",
          "text": "Focus on Low Competitive Keywords, Write article on it and boom ;)",
          "score": 1,
          "created_utc": "2026-02-15 13:56:18",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r26t4q",
      "title": "Can You Still Make Money From Blogging?",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1r26t4q/can_you_still_make_money_from_blogging/",
      "author": "Arisen987",
      "created_utc": "2026-02-11 19:21:27",
      "score": 35,
      "num_comments": 56,
      "upvote_ratio": 0.91,
      "text": "Hi everyone,\n\nI'm thinking of starting a blog. I have two possibilities, and they are fairly niche. \n\nUltimately, I want to make money from the blog. But do you think that you can still make money from blogging? We all know that traffic to blogs is dropping, and obviously we have AI Overviews, and other AI systems too. \n\nI am just thinking whether it is actually worth dedicating time and effort to this. ",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/Blogging/comments/1r26t4q/can_you_still_make_money_from_blogging/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o4va2lz",
          "author": "Fuzzy_Possibility",
          "text": "My blogs been running for 15 years I’m not making millions but I’m still paying the bills. My health has deteriorated over the years and I put less effort into now that I did even a year ago because I can’t. But I’m still making more year on year.",
          "score": 32,
          "created_utc": "2026-02-11 21:07:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4vvky2",
              "author": "shopaholic_lulu7748",
              "text": "Had my food blog for over 10 years. My peak time for earning money was during covid and I was able to put a lot of money in savings. Now I'm managing to pay my bills and trying to find a diverse income. \n\nI'm reselling clothes online and trying to find a part time job 18 hours a week. ",
              "score": 7,
              "created_utc": "2026-02-11 22:53:18",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4vwdzi",
                  "author": "Fuzzy_Possibility",
                  "text": "I’m hearing a lot of similar stories with people having to get some part time work / diversification. Sadly my health means that’s not possible for me and I do worry that one day my blog won’t earn enough and I don’t know what I’ll do then. \n\nBut I also know there’s people out there making a good amount every month still from blogging - so I don’t think it’s dead but I do think it’s changed especially from Covid times. \n\nI also think the influx of “resellers” and blogs made just to sell links for cheap hasn’t helped. \n\nI definitely see the bad side I think perhaps my original post comes across as it’s sunshine and roses when it isn’t but I try and have hope there will always be a place for blogs.",
                  "score": 4,
                  "created_utc": "2026-02-11 22:57:29",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o4vqeid",
              "author": "the_htg",
              "text": "What’s the niche?",
              "score": 2,
              "created_utc": "2026-02-11 22:26:28",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4vqpis",
                  "author": "Fuzzy_Possibility",
                  "text": "A bit of everything 😂 I’m not very good at sticking to one topic - so I say it’s lifestyle with a slice of mental health and physical health topics from a personal perspective",
                  "score": 3,
                  "created_utc": "2026-02-11 22:28:03",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o4vuj1o",
              "author": "poorpatheticplanet",
              "text": "happy to hear this for you! how do you feel about stability with ad income? i’m about to start with a new ad network which i’m excited about, but im already thinking about needing to get to work with something like digital products.",
              "score": 2,
              "created_utc": "2026-02-11 22:47:52",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4vwq9a",
                  "author": "Fuzzy_Possibility",
                  "text": "My RPM is rubbish - I’m UK based with mostly UK traffic so I get far less than someone who is US based but I also realise I get more than someone who is other countries as well. \nI definitely couldn’t rely on ad income, just as I am not bringing in US views and a lot of my content is shorter and Mediavine love a long post with lots of ads 😂",
                  "score": 3,
                  "created_utc": "2026-02-11 22:59:15",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o4ygb9n",
              "author": "Dootcom",
              "text": "So how do you make money with your blog? ADsense?  \nJust courious. I really love blogging. I'm not in it for the money... but if I could get money nevertheless.. why not?",
              "score": 2,
              "created_utc": "2026-02-12 10:01:04",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4zit66",
                  "author": "Fuzzy_Possibility",
                  "text": "Hi, I did answer this in another comment 🙂 \nI am with Mediavine but I don’t make a huge amount my traffic is mostly UK based which compared to the US drives a smaller RPM, I fell out with affiliates after not being paid by a huge company as they went bankrupt then sold out and reopened and it just left me feeling really crappy about it. I do offer PR sponsored posts which is where most of my income comes from not everyone agrees with it but I’m strict about what I do / don’t accept and only add things that align with my blog.",
                  "score": 3,
                  "created_utc": "2026-02-12 14:33:33",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o54uiir",
              "author": "Less_Secret7729",
              "text": "what is your blog site about?",
              "score": 1,
              "created_utc": "2026-02-13 08:59:52",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4x8fbn",
          "author": "onlinehomeincomeblog",
          "text": "It's possible to make money from blogging, but not in the same way people did 5 to 10 years ago.\n\nWriting random posts to get traffic and put AdSense to work for passive income will not work anymore. AI overviews eat all informational queries and so, we need to change our blogging journey.\n\nWhat is working in 2026 is?\n\nBlogging will be successful only when you have a clear purpose, along with;\n\n* Supporting a service\n* Promoting a product\n* Building authority in a niche\n* Capturing high-intent search queries.\n\nBlogging is slow nowadays, but with the right niche and strategy, it still works.",
          "score": 9,
          "created_utc": "2026-02-12 03:41:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4xb8im",
          "author": "thinkneo",
          "text": "Short answer: yes, but not the way most people think. \n\nThe blogs getting killed by AI are the generic \"10 tips for X\" ones. If your niche is specific enough and you bring real experience/opinion, AI can't replace that. \n\nWhere money comes from now:\n\n  \\- Email list - your blog gets them in the door, the list is where you build trust and sell\n\n  \\- Niche authority - specific expertise attracts consulting, sponsorships, affiliate deals\n\n  \\- Community - readers who engage become customers\n\nThe blogs struggling are the ones treating it like 2015 SEO - pump out keyword articles and wait for Google. That's dead.\n\nWhat are your two niche ideas? Some niches are way more viable than others.",
          "score": 7,
          "created_utc": "2026-02-12 04:00:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ygofn",
              "author": "Arisen987",
              "text": "To be honest, I am not sure either of them are great if I want to generate income. One is a niche idea around a sport, where I want to create high quality, distinctive content, but it would be informational content. The other is an idea around natural methods for stress reduction and to improve wellbeing. I think the latter would be easier to monetise probably. ",
              "score": 3,
              "created_utc": "2026-02-12 10:04:34",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o56dmwq",
                  "author": "thinkneo",
                  "text": "The wellbeing one has way more monetization paths - affiliate (supplements, apps, courses), sponsored content, and email list products. Plus the audience is actively looking for   solutions, which means they'll buy.  The sports one can work too but informational content is harder to monetize unless you build a loyal community around it first. You could  start with the wellbeing one. You can always add the sports blog later once you've got the process down.\n\nOne thing though - the wellbeing/stress niche is crowded. What'll set you apart is being specific. \"Natural stress relief\" is broad. \"Stress management for remote workers\" or  \"natural anxiety relief for new parents\" - that's a blog people will bookmark.\n\nWhat sport is it out of curiosity?",
                  "score": 1,
                  "created_utc": "2026-02-13 15:19:39",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4ux4tr",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 5,
          "created_utc": "2026-02-11 20:04:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4v5d3f",
              "author": "darkestone7",
              "text": "Does Pinterest strategy still works?",
              "score": 1,
              "created_utc": "2026-02-11 20:44:44",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4v61jx",
                  "author": "SingerLuch",
                  "text": "Not sure abt it since my niche is game development/tech, so i rarely have to use Pinterest.. but I’ve heard it drives traffic to people’s blogs",
                  "score": 2,
                  "created_utc": "2026-02-11 20:48:00",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4wniea",
          "author": "Teigh99",
          "text": "I'm going to just try to create a space that offers some value. At least, I hope to. That's all I'm going to worry about atm. ",
          "score": 4,
          "created_utc": "2026-02-12 01:33:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4w8f0d",
          "author": "AgentOS7",
          "text": "Don’t start blogging to make money. Do start blogging because you want to. If you still want to monetize a blog, you need to think about how that can happen (Ads, Affliate, donations, selling products or services) and how that ties in. I’d suggest not relying on advertising as your sole monetization, and in fact, discourage it for new blogs.",
          "score": 4,
          "created_utc": "2026-02-12 00:04:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o59q2ok",
              "author": "ActuaryMean6433",
              "text": "This is the way.",
              "score": 1,
              "created_utc": "2026-02-14 01:42:00",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4voxhv",
          "author": "[deleted]",
          "text": "[deleted]",
          "score": 2,
          "created_utc": "2026-02-11 22:18:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o50vmx9",
              "author": "Cautious-Time-6738",
              "text": "Ten months is still too short to make a judgment. If you quit now, you'll throw away all the work you've done. I recommend waiting at least another year. I know you can evaluate.",
              "score": 1,
              "created_utc": "2026-02-12 18:25:52",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o51p85h",
                  "author": "Artseid",
                  "text": "Thanks for the encouragement. I’m so very tired but want to keep going because I really love it but I still have a 9-5 to balance and I’m starting to think crazy thoughts like if it’s worth the anxiety and stress. If you’re open, I would love to learn your methods and techniques for doing this and doing this well.",
                  "score": 1,
                  "created_utc": "2026-02-12 20:46:35",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4wzc9k",
          "author": "SellSuite",
          "text": "I’d say so yes I’ve been running blogs for a few years now in the gadgets, digital marketing & graphic design spaces I’m finally starting to gain some traction I use Pinterest for article promotion and it’s a hit or miss",
          "score": 2,
          "created_utc": "2026-02-12 02:44:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o58jou0",
          "author": "Contentpreneur-vic",
          "text": "I've been running my blog for 4 years, and it made me $40K last year from affiliate and brand partnerships. So, it's possible, but I have to work hard to keep the content helpful, rank for commercial queries, and update it regularly. It's a lot of work! I think there's still a good chance of being visible, but you have to actually produce great content in your niche and build topical authority.",
          "score": 2,
          "created_utc": "2026-02-13 21:38:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4w296x",
          "author": "deimprovement",
          "text": "Yes you can, push traffic from social media. Guy, huge pointer, try to make some small softwares on your blog that will keep people coming back. This is my secret weapon.",
          "score": 1,
          "created_utc": "2026-02-11 23:28:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4y0vki",
          "author": "easyedy",
          "text": "I think to get traffic is the hardest part now with AI everything pushing down in the SERPS. Traffic is the ultimate  force of making money. My blog is suffering since a few months. Reddit traffic helps to compensate.",
          "score": 1,
          "created_utc": "2026-02-12 07:29:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4y1qk4",
              "author": "Wide_Brief3025",
              "text": "Getting blog traffic is way tougher now with AI heavy search results so leaning into communities like Reddit is smart. Consider monitoring conversations around your niche across platforms to spot content gaps or people looking for info you already have. A tool like ParseStream can track those discussions and send you alerts when relevant topics pop up so you can jump in and drive quality referral traffic.",
              "score": 1,
              "created_utc": "2026-02-12 07:38:06",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4y5cqi",
                  "author": "easyedy",
                  "text": "I've heard of ParseStream and am wondering if it is really worth it. I have my own subreddit. Getting members is hard, but it's coming.",
                  "score": 1,
                  "created_utc": "2026-02-12 08:12:47",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4ydrra",
          "author": "dhdyxuebebkalsockfn",
          "text": "Basically yes, but you should invest a lot on it and not generate endless AI content, just my opinion.",
          "score": 1,
          "created_utc": "2026-02-12 09:36:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4zeebr",
          "author": "ironmanchris",
          "text": "I've never made a single cent from blogging.  That's not why I do it, but geez, I wouldn't even know how to monetize my blog.  ",
          "score": 1,
          "created_utc": "2026-02-12 14:10:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4zpbip",
          "author": "ConsequenceHairy1570",
          "text": "Not easy but yes, niche helps.",
          "score": 1,
          "created_utc": "2026-02-12 15:07:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4zxrv5",
          "author": "ChunkySunshine",
          "text": "You so can .  Build out your game plan first to see the vision of it.  A game plan to help you see the visual.  Maybe 4 pillars with supporting pages or posts that go back to it.  I've found its been way more rewarding staying more NICHE focused then trying to have a solve everything all website which obviously you have that.",
          "score": 1,
          "created_utc": "2026-02-12 15:47:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o50v4y6",
          "author": "Cautious-Time-6738",
          "text": "It depends on the niche you choose and what you really want to do. I wrote an in-depth article on this very topic here:\nhttps://blogfacile.it/come-guadagnare-con-un-blog-nel-2026-strategie-reali-per-monetizzare-subito\n\nMaking money with a blog, in practice, isn't complicated: you add affiliate links, products, or services, and you start monetizing. The problem isn't technical, but mental and strategic. Over time, many bloggers fail—or rather, it's not a real failure: they simply quit.\n\nMany give up when Google is still \"testing\" the blog and they don't get results. The first few months can be tough, especially in business niches where competition is extremely high. It's different, for example, than in a niche like cooking: they're two different paths. Where there's more money, there's also more competition.\n\nTake the hosting industry: affiliate commissions can exceed €40 per single sale. This is precisely why it's so competitive.\n\nThe only real way to make money is to be patient, write quality content, and never give up. The first year may not yield results, but the second will. Blogging is a game of consistency over time, not instant results.",
          "score": 1,
          "created_utc": "2026-02-12 18:23:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o51h0in",
          "author": "digitizedeagle",
          "text": "Yes, of course. You can even use it to promote your services, which can future proof your earnings.",
          "score": 1,
          "created_utc": "2026-02-12 20:07:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o54rk2m",
          "author": "Smarthealthtechhub",
          "text": "I started my blog in March 2025 with the same question.\n\nI didn’t know if blogging was “dead.” AI Overviews scared me too.\n\nWhat I’ve learned so far:\n\nYes, it’s harder than before.\n\nBut it’s not dead, it’s different.\n\nGeneric content struggles. Personal, experience-based, specific content still works.\n\nI’m not making life-changing money yet, but I’ve made consistent affiliate income. More importantly, I’ve built something that grows over time instead of disappearing in 24 hours like social posts.\n\nIf your niche is clear and you’re willing to treat it like a long-term asset (6–12+ months), I still think it’s worth it.\n\nIf you’re hoping for quick money in 30 days, probably not.\n\nThe real question isn’t “Is blogging dead?”\n\nIt’s “Are you willing to build slowly?”",
          "score": 1,
          "created_utc": "2026-02-13 08:31:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o559hlt",
          "author": "YurieBlog",
          "text": "Good question. You could start a blog, but be ready to invest all your time with zero guarantee of success. It's a grind!",
          "score": 1,
          "created_utc": "2026-02-13 11:18:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o56q43n",
          "author": "sub_lunar",
          "text": "I've been blogging for 20 years. I've risked my life and safety and invested thousands of hours into it and I've never made a cent. \n\nAMA",
          "score": 1,
          "created_utc": "2026-02-13 16:19:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5baqjm",
          "author": "Sorry_Cheesecake_382",
          "text": "Use blogging for SEO to sell a product",
          "score": 1,
          "created_utc": "2026-02-14 09:09:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5j2nwa",
          "author": "digitalluxelife",
          "text": "Have you guys tried getting on substack with your blog , hope it’s ok if I post this . \n\nhttps://youtu.be/9wvKnQimriw?si=EYlqwBiM6CiFIyCW",
          "score": 1,
          "created_utc": "2026-02-15 16:27:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5mhhqk",
          "author": "Embarrassed_Key_6238",
          "text": "Yes, blogging can still make money, but it’s not as easy or SEO-only as before. Generic info blogs are struggling, but niche sites with real experience, trust, and an audience beyond Google (email/social) still work. It’s more of a long-term play now than quick income.",
          "score": 1,
          "created_utc": "2026-02-16 03:39:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5mhtg8",
          "author": "Embarrassed_Key_6238",
          "text": "Allow past kar diya",
          "score": 1,
          "created_utc": "2026-02-16 03:41:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4vj53p",
          "author": "Holiday-Oil2598",
          "text": "It’s a ton of work thaw days. Everyone is using ai to scale, ai slop ranks at least for a whip and constantly snakes your rankings…my advice is start a blog that does bite size info and funnel to it via Facebook and Flipboard. You write short articles that are fun and interesting and allow you to sen traffic constantly. Also keeps engagement up on social.",
          "score": 1,
          "created_utc": "2026-02-11 21:50:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4vrr83",
          "author": "[deleted]",
          "text": "No.",
          "score": 0,
          "created_utc": "2026-02-11 22:33:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o502lph",
          "author": "Themagiciancard",
          "text": "Yes and no. I've been blogging 5 years, I've had some ups and downs (currently in a downward moment, traffic and money has been slow since around Xmas). You can make good money if you're obsessive about it and, not to tar everyone with the same brush, lose your ethics and honesty (think, people accepting money to promote stuff they don't believe in or writing articles on subjects they have no business commenting on). For those who remain authentic, it's difficult but can still be done. I'm not even close to paying my bills but I have enough to pay down debts meaningfully and contribute to enjoying a few bits and pieces in life. Basically, go into it because you're passionate and want to share positivity, not because you want to become a millionaire in a few months.",
          "score": 0,
          "created_utc": "2026-02-12 16:10:25",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r3407j",
      "title": "SEO in 2026: How are you guys actually ranking and getting traffic with AI Overviews?",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1r3407j/seo_in_2026_how_are_you_guys_actually_ranking_and/",
      "author": "SashaNatureNomad",
      "created_utc": "2026-02-12 20:09:57",
      "score": 29,
      "num_comments": 30,
      "upvote_ratio": 1.0,
      "text": "It's 2026 and I feel like everything has changed. What are you guys actually doing these days to rank your websites on top of Google? With the birth of AI Overviews, how are you actually getting website traffic anymore? It feels like the old playbooks don't work the same way. Is there something I'm missing, or has the strategy shifted entirely? I'd love to hear what is actually working for you guys right now.",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/Blogging/comments/1r3407j/seo_in_2026_how_are_you_guys_actually_ranking_and/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o52fbv3",
          "author": "HaryTotal",
          "text": "My strategy is still the same as usual. I write content that is well-organized and adds value; I try to avoid filler words and fluff. I use relevant keywords in a natural way without keyword stuffing. I know that some people approach AI optimization differently than traditional SEO, but from what I've gathered, the same principles that result in a high search engine ranking will also help a website come up in a chatbot's answer or AI overview.",
          "score": 6,
          "created_utc": "2026-02-12 22:54:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o536cg0",
          "author": "Icy-Papaya-2967",
          "text": "Build something people want. Do you research. This may all sound very repetitive but I mean every word of it. Know your audience inside out and build something that they will love and come back for. Also funnel visitors into a newsletter and send weekly posts. Works wonders.",
          "score": 2,
          "created_utc": "2026-02-13 01:30:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o57b5g2",
          "author": "software_guy01",
          "text": "I have been experimenting a lot with AI-driven content strategies and LowFruits has been really helpful. I use it to find low-competition keywords and content gaps that actually drive traffic even in 2026’s AI-focused SEO world. Combined with AI Overviews, it helps me focus on content that has a real chance to rank instead of following old methods blindly. It makes planning faster and more precise. I think it’s definitely worth checking out for actionable keyword insights.",
          "score": 2,
          "created_utc": "2026-02-13 18:00:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o51i2os",
          "author": "Captlard",
          "text": "Writing decent focused content that people come to read and stay around?",
          "score": 4,
          "created_utc": "2026-02-12 20:12:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o52675p",
          "author": "BlazejMielnik",
          "text": "I started from keywords search on ahrefs than I picked low volume high traffic and 5 - 16 KD.\n\n I got traffic around 130 clicks monthly and 30k impressions from blogposts",
          "score": 1,
          "created_utc": "2026-02-12 22:07:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o53wi06",
              "author": "Suhani_kaur",
              "text": "How many blog posts a month ??",
              "score": 1,
              "created_utc": "2026-02-13 04:16:03",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o54hrqo",
                  "author": "BlazejMielnik",
                  "text": "8 - 10, but only 50% of them is going to TOP 3 on Search Engine",
                  "score": 1,
                  "created_utc": "2026-02-13 07:02:05",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o53wjmu",
              "author": "Suhani_kaur",
              "text": "And number of words for each blog ?",
              "score": 1,
              "created_utc": "2026-02-13 04:16:22",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o54htv8",
                  "author": "BlazejMielnik",
                  "text": "Around 1500 - 2200 words",
                  "score": 1,
                  "created_utc": "2026-02-13 07:02:36",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o596jqg",
              "author": "Over-Balance3797",
              "text": "What’s the best way to find keywords on ahrefs? Every time I go there I get overwhelmed but I know it can be super useful!",
              "score": 1,
              "created_utc": "2026-02-13 23:42:20",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5biclh",
                  "author": "BlazejMielnik",
                  "text": "I started on Miro and making brainstorming.\n\n\nFirst of all I’m going to Gemini and prompt make for me 10 topics on blogpost. We are bla bla bla, than im going to ahrefs and try to find relevant keyword (Keyword Explorer) \n\nAfter that I try to define secondary keyword.\n\n\nActually I make 3 type of blogpost \n\n\nWhat - informational for impression \n\nHow to - problem solving for traffic \n\nAbout our services - for conversion",
                  "score": 1,
                  "created_utc": "2026-02-14 10:24:39",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o567d6f",
          "author": "c0ncorde25",
          "text": "SEO in 2026 looks different; AI engines dont just pull rankings, they synthesize trusted sources. For midsize and enterprise teams, the challenge is scaling structured content and monitoring how often their brand appears in AIdriven answers. Taktical Digital frames this shift as AI SEO, helping organizations stay discoverable as answer engines reshape search. ",
          "score": 1,
          "created_utc": "2026-02-13 14:48:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o56mr2q",
              "author": "Wide_Brief3025",
              "text": "Staying visible in AI driven search really comes down to monitoring where your brand is showing up and reacting fast to relevant conversations. I’ve found that tracking keywords across platforms can reveal unexpected mentions and lead opportunities. Tools like ParseStream make it a whole lot easier by sending real time alerts, so you never miss a chance to engage when your brand pops up.",
              "score": 1,
              "created_utc": "2026-02-13 16:03:26",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o57h45d",
          "author": "carriwitchetlucy2",
          "text": "I think traditional SEO alone doesn’t cut it anymore because AI Overviews surface content differently, so I focus on making my content clear, structured, and easy for AI to summarize. Adding real examples and insights helps a lot.\n\nI use Meridian, an AI Visibility Engine, to track where my brand and products show up in tools like ChatGPT, Perplexity, Gemini, and Google AI Overviews. It’s useful because it not only shows visibility but also gives actionable steps to improve rankings and drive more traffic",
          "score": 1,
          "created_utc": "2026-02-13 18:28:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o57q8cq",
              "author": "Ok_Revenue9041",
              "text": "Making your content easy for AI to parse is smart and including real examples really does help Boosting your presence on AI platforms seems just as important as traditional SEO these days If you want to go deeper with Answer Engine Optimization maybe check out MentionDesk they help brands get recognized and featured more prominently in things like ChatGPT and other AI search tools",
              "score": 1,
              "created_utc": "2026-02-13 19:12:25",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o57icaj",
          "author": "gallantfarhan",
          "text": "the goal isn't to rank for simple answers anymore, because the ai can handle that. the real traffic is in answering the complex questions that the ai overviews can't. people still click when they have a problem that needs more than a quick summary to solve.  \n  \n",
          "score": 1,
          "created_utc": "2026-02-13 18:34:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o587616",
          "author": "easyedy",
          "text": "It's very difficult to rank these days with tech blogs. I also think how-to blogs are being eaten by AI overviews. I think being personal and telling a personal story may help with ranking. It depends on the niche. I lost around 70% traffic on Google in the last 12 months. I haven't hit by an HCU, I believe. ",
          "score": 1,
          "created_utc": "2026-02-13 20:36:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o54f3t2",
          "author": "adrianmatuguina",
          "text": "SEO still works in 2026, but the strategy changed because AI Overviews answer basic questions directly.\n\nWhat’s working now:\n\n**• Target deeper content**  \nSimple info posts get fewer clicks. Focus on tutorials, case studies, comparisons, and personal experience.\n\n**• Build topic authority**  \nCreate multiple related articles in one niche instead of random keyword posts.\n\n**• Optimize for AI summaries**  \nClear answers, structured headings, and accurate info help your content get referenced.\n\n**• Add real human insight**  \nOriginal opinions, examples, and expertise matter more than generic content.\n\n**• Use AI for speed, edit for quality**  \nTools like WordHero help with drafts, but human editing and unique value drive rankings.\n\n**• Don’t rely only on Google**  \nMany creators now grow traffic through communities, social media, and email.\n\nSEO is not dead. It simply rewards authority, originality, and human value more than before.",
          "score": 2,
          "created_utc": "2026-02-13 06:39:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o51pib6",
          "author": "Ok_Revenue9041",
          "text": "Honestly, I am focusing way more on getting content featured directly in AI summaries and optimizing for answer engines rather than just classic SEO. Visibility now means being cited or included in AI responses. If you want to dig deeper into this approach, MentionDesk has tools to help brands become more prominent across these AI driven platforms.",
          "score": 1,
          "created_utc": "2026-02-12 20:47:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o51widr",
              "author": "Ok_Topic_2993",
              "text": "But how do you make money with that?",
              "score": 4,
              "created_utc": "2026-02-12 21:21:05",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o52fb9d",
          "author": "bigpurpleoctopus",
          "text": "Using automation tools",
          "score": 0,
          "created_utc": "2026-02-12 22:54:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o52nl52",
          "author": "Dismal_Decision132",
          "text": "My strategy is Avoid keywords that has AI Overviews, Target physical product or real service that generate high RPM, Analyze entities and informational gain for my keyword, Build Pagerank, build topical authority and Use Next.js to make my own tools to increase bounce rate, dwell time and session duration",
          "score": 0,
          "created_utc": "2026-02-12 23:40:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o547r0h",
          "author": "onlinehomeincomeblog",
          "text": "Here are the changes occured after AI intrusion in Organic Search Ecosystem (Google Search).\n\n**1. Informational fluff is getting eaten by AI Overviews:** If you publish how-to, guides, etc., it won't rank because AI itself have the itinerary and giving almost accurate solution to the searches. So to win this, you write content that can be easily digested and summarized by AI. This way you can divert some organic traffic to your site.\n\n**2. Depth + Specificity is much needed:** If you share practical comparison from your own experience, case studies, How I did X, and local intent pages, you can tap some more traffic.\n\n**3. Stop working with commercial keywords:** E.g. Stop writing on the topic, \"How to Lose Weight.\" People don't need information. Write about \"best adjustable dumbbells under $300 for losing my weight\" - be specific, be intentive.\n\nAfter from this, generic aspects like backlinkings, authority building, social media signals, and implement same traditional SEO methods.",
          "score": 0,
          "created_utc": "2026-02-13 05:38:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o57ocli",
          "author": "unicorn69love",
          "text": "honestly manual seo is toast in 2026 with ai overviews eating clicks, i got lazy and hooked up nextblog ai to auto crank out optimized posts that actually rank and pull traffic on autopilot no fluff",
          "score": 0,
          "created_utc": "2026-02-13 19:03:13",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r0dxkn",
      "title": "Why good posts don’t get reads even when you publish regularly",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1r0dxkn/why_good_posts_dont_get_reads_even_when_you/",
      "author": "SnooBooks9107",
      "created_utc": "2026-02-09 19:30:46",
      "score": 24,
      "num_comments": 9,
      "upvote_ratio": 0.82,
      "text": "I’ve been blogging for a while and I kept thinking the problem was my writing. If I just wrote better, more often, or longer posts, people would finally start reading.\n\nWhat actually happened was this:\n\nI’d write something I felt good about, hit publish, share it once, and then basically move on. Days later I’d check analytics and feel like it never even existed.\n\nA few months in I realized what so many here have probably experienced: **publishing regularly doesn’t guarantee anyone will see what you wrote.**\n\nMost of us treat publishing as the finish line. In fact, it’s the point at which the *real work* begins: getting that content in front of people.\n\nAfter that realization, I started thinking about:\n\n* breaking my posts into smaller takeaways\n* creating multiple entry points for the same idea\n* intentionally planning *where* and *how* each post gets a second life\n\nOne practical support I sometimes use to sketch different ways a post can show up elsewhere is a tool called WaveGen. It helps draft carousels, quote cards with alternate captions so I’m not re-creating everything from scratch. But that’s just convenience; the real shift was changing how I think about what happens *after* publish.\n\nDo you actively reuse, or do you find it mostly feels like “write → publish → hope for traffic”?",
      "is_original_content": false,
      "link_flair_text": "Tips/Info",
      "permalink": "https://reddit.com/r/Blogging/comments/1r0dxkn/why_good_posts_dont_get_reads_even_when_you/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o4ho6ws",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 2,
          "created_utc": "2026-02-09 20:02:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4i0r4t",
              "author": "SnooBooks9107",
              "text": "I feel you!! I think I'm good with words, but I'm uncomfortable with social media, drawing, etc. You should seriously consider utilizing AI tools like WaveGen, which makes it super simple to go from your words to social media posts with non AI looking visuals. Definitely made social media less daunting to me!",
              "score": 1,
              "created_utc": "2026-02-09 21:05:19",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4i3b09",
          "author": "corelabjoe",
          "text": "I'm from the generation and career field which makes me terrified of \"doxxing\" myself even though it's not that hard to figure out who I am. I'm still maintaining a bit of anonymity but it seems that doesn't help credibility.",
          "score": 2,
          "created_utc": "2026-02-09 21:17:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4i3y9p",
              "author": "SnooBooks9107",
              "text": "Are you worrying about promoting it on social media might leak your identity? What about faceless content on separate accounts?",
              "score": 1,
              "created_utc": "2026-02-09 21:21:03",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4ia4o5",
                  "author": "corelabjoe",
                  "text": "Yes exactly... I could do separate accounts but that takes work and effort haha... Really I think I just need to change the header images, some look and feel with my site and I would probably be ok with advertising it more.\n\nI find the silly AI generated header images amusing and the infographics fantastic. It seems the header images really rub people the wrong way though so I'll have to adjust.",
                  "score": 1,
                  "created_utc": "2026-02-09 21:51:58",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4kpwt9",
          "author": "GurAffectionate9119",
          "text": "This resonates a lot. I think most of us overestimate the “publish” moment and underestimate distribution.\n\nWhat finally clicked for me was realising a post isn’t one thing, it’s raw material. A single blog post can become a short insight thread, a carousel, a quote card, or even a discussion prompt, but only if you intentionally plan that second life.\n\nI still write long-form first, but now I ask: where else would this idea naturally live and in what format? Otherwise, it just disappears into the void.\n\nI don’t think tools fix this mindset, but they can remove friction. I use **Indzu Social** mainly to map out reuse paths, so I don’t have to start from zero every time. The real work is still thinking about **audience + context,** not writing more.\n\nCurious how others here decide *where* to resurface old posts or if most of us are still stuck in publish → hope mode.",
          "score": 2,
          "created_utc": "2026-02-10 06:56:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4mzmlt",
              "author": "bluehost",
              "text": "That \"raw material\" framing is the real shift. Most posts don't flop because they're bad, they just don't have a second or third place to be found. Even small moves like reframing the angle later, linking it from newer posts, or turning one idea into a few different entry points can keep it alive way longer than a one-time share. Distribution is less about noise and more about giving the right reader multiple chances to run into it.",
              "score": 1,
              "created_utc": "2026-02-10 16:27:35",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r0ql7y",
      "title": "My SEO checklist for any website",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1r0ql7y/my_seo_checklist_for_any_website/",
      "author": "udemezueng",
      "created_utc": "2026-02-10 04:03:33",
      "score": 22,
      "num_comments": 8,
      "upvote_ratio": 0.89,
      "text": "Most websites fail at marketing before they even launch.\nNo SEO foundation.\nZero blogs.\nCrappy URLs.\nMinimal keyword coverage.\n\nHere’s how to launch a marketing-ready site that drives leads from DAY 1.\n\nStep 1: Domain & Hosting\n\n· Short, brandable OR keyword-matched domain\n· SSL installed (HTTPS)\n· 99%+ uptime hosting\n· CDN configured\n\nStep 2: URL Architecture\n\n· Plan BEFORE you build\n· Flat structure (2–3 clicks from homepage)\n· Short, descriptive URLs with hyphens\n· No dates, parameters, or uppercase\n  Good: /services/seo-audit/\n  Bad: /services/index.php?id=4\n\nStep 3: Service Page Structure\nHomepage = 1 primary keyword\nService pages = all the rest.\nExample: Law firm in Houston\nHomepage: \"personal injury lawyer Houston\"\nService pages:\n/services/car-accident-lawyer-houston/\n/services/motorcycle-accident-lawyer-houston/\netc.\nEach page = 1 keyword. 1,000–2,000 words.\nUnique content per service. Clear CTA.\n\nStep 4: Location Page Architecture (if multi-location)\nHub page: /locations/\nCity pages: /locations/dallas-personal-injury/\nNest services: /locations/dallas/car-accident/\nUnique content per city—local stats, laws, testimonials.\nNo copy-paste + find/replace. Google penalizes that.\n\nStep 5: Google Search Console\nSet up Day 1. Verify. Submit XML sitemap.\nCheck crawl errors. Enable email alerts.\n\nStep 6: Google Analytics 4\nGA4 property + tracking code on all pages.\nSet up goals/conversions.\n\"If you can’t measure it, you can’t improve it.\"\n\nStep 7: Technical Foundation\n\n· robots.txt (correctly configured)\n· Auto-updating XML sitemap\n· Custom 404 page\n· Canonical tags on every page\n· No accidental noindex tags (#1 launch killer)\n· Schema markup (LocalBusiness, Service, FAQ)\n\nStep 8: Site Speed\n\n· Images compressed + WebP\n· Lazy loading enabled\n· CSS/JS minified\n· Load under 3 seconds\n· Core Web Vitals passing\n\nStep 9: Mobile\n\n· Responsive design\n· Touch targets ≥48px\n· No horizontal scrolling\n· Test on REAL devices\n\n60% of searches are on mobile.\n\nStep 10: Core Pages at Launch\nHomepage\nAbout page\nContact page\nService pages (1k+ words each)\nLocation pages (if applicable)\nPrivacy Policy + Terms\nDon’t “add later.”\n\nStep 11: Blog Setup\n\n· /blog/ subfolder (NOT subdomain)\n· Categories mirror services\n· Author pages with real bios\n· 5–10 posts ready at launch\n· 3-month content calendar ready\n\nStep 12: Internal Linking\nThe circulatory system of your site.\nLink:\nHomepage → service/location pages\nLocation hub → city pages\nCity pages → nested service pages\nBlog posts → relevant service pages\nNo orphan pages.\nFooter links to key pages.\n\nStep 13: External Link Foundation\n\n· Google Business Profile (if local)\n· Social profiles created\n· List of 50+ link prospects\n· Documented link-building strategy\n  No “we’ll figure it out later.”\n\nStep 14: Pre-Launch Checks\n\n· No placeholder text\n· All links work\n· Forms function\n· Mobile tested\n· Speed test passed\n· robots.txt allows crawling\n· NO leftover noindex tags\n\nStep 15: Launch Day\n\n· Submit sitemap to GSC\n· Request indexing for top 10–15 pages\n· Share on social\n· Check GSC next day for errors\n  Don’t overthink it.\n\nStep 16: First Month Post-Launch\nMost drop the ball here.\n\n· Publish content weekly\n· Build 5–10 backlinks\n· Monitor rankings & indexing\n· Internal link from new content\n· Launch Google Ads (ad sets per service)\n  First 30 days set the trajectory.\n\nCommon Launch Mistakes:\n\n1. Dev noindex still on\n2. No SSL in 2026\n3. No analytics\n4. Empty “coming soon” blog\n5. Thin service pages (100 words)\n6. Copy-paste location pages\n7. Waiting months for link building\n\nAvoid these and you’re ahead of 90% of new sites.\n\nMost competitors skip half this list.\nThat’s your advantage.\n\nNow go launch something.",
      "is_original_content": false,
      "link_flair_text": "Tips/Info",
      "permalink": "https://reddit.com/r/Blogging/comments/1r0ql7y/my_seo_checklist_for_any_website/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o4k7z61",
          "author": "shajid-dev",
          "text": "Nice AI post, but please add some human emotion and touch to it. Use your experiencre, how did you do for your sites.",
          "score": 4,
          "created_utc": "2026-02-10 04:34:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4k8p46",
              "author": "udemezueng",
              "text": "To you everything is AI, it isn't AI stop being a bum.",
              "score": 2,
              "created_utc": "2026-02-10 04:39:16",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4kb0vz",
          "author": "onlinehomeincomeblog",
          "text": "This is a solid launch checklist. A few thoughts I would like to add;\n\n1. Each page must have 1 keyword.\n\n2. The page should contain 1000 - 2000 words per service.\n\nThe real advantage is not doing everything, it is about doing the right things first based on the site's purpose.",
          "score": 3,
          "created_utc": "2026-02-10 04:55:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4l11li",
          "author": "Existing-Cod5443",
          "text": "I'm facing an indexing issue for my blogs ",
          "score": 3,
          "created_utc": "2026-02-10 08:41:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4lu29g",
          "author": "afahrholz",
          "text": "amazing checklist but you can add a quick note on keyword research upfront and could make it even stronger. ",
          "score": 3,
          "created_utc": "2026-02-10 12:50:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4prqco",
          "author": "AdhesivenessEven7287",
          "text": "I have a blog and even my host messages me saying u have no seo. Can this list help me. Is it a good place to start?",
          "score": 1,
          "created_utc": "2026-02-11 00:31:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4xblu9",
              "author": "ChestEast4587",
              "text": "Do u want me to help u with seo? Can send u free audit report and if you like what i propose we can work together for fee that makes sense for both of us.. let me know",
              "score": 1,
              "created_utc": "2026-02-12 04:03:03",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o50snob",
          "author": "Con01010",
          "text": "Thank you so much for these valuable insights!\n\nWould you perhaps like to take a look at my website?",
          "score": 1,
          "created_utc": "2026-02-12 18:12:04",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r4i5ef",
      "title": "How do you stay consistent with blogging?",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1r4i5ef/how_do_you_stay_consistent_with_blogging/",
      "author": "brian1x1x",
      "created_utc": "2026-02-14 11:17:27",
      "score": 20,
      "num_comments": 30,
      "upvote_ratio": 0.96,
      "text": "I’ve been blogging for a while now, and my biggest struggle isn’t ideas, it’s consistency. I’ll have a great week where I post twice, then disappear for a month because life gets busy or I overthink everything.\n\nFor those of you who’ve managed to stay consistent, what actually helped? Do you batch write, use a content calendar, or just post whenever you feel inspired?\n\nAlso, how do you deal with low traffic in the beginning without losing motivation? I know growth takes time, but it’s hard not to check stats every day.\n\nWould love to hear what’s worked for you.",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/Blogging/comments/1r4i5ef/how_do_you_stay_consistent_with_blogging/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o5bylal",
          "author": "iron_davith",
          "text": "Set a timetable, block off time where you work on it and nothing else.",
          "score": 7,
          "created_utc": "2026-02-14 12:48:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5bzct1",
          "author": "RobertLigthart",
          "text": "the overthinking part is what kills it... I had the same issue and what helped was just writing drafts without publishing. take the pressure off and you end up with a backlog you can post from whenever",
          "score": 5,
          "created_utc": "2026-02-14 12:54:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5cq3cz",
          "author": "JimmiWazEre",
          "text": "I used to do once a week, and I managed it for a full year. It was exhausting. Not only racking my brain thinking about something to write about every week, but finding time in that to also research, have a full time job, and do my other hobbies.\n\n\nI think my writing suffered for it too. Since January 2026 I've basically change it to writing a post when something comes to me. So far that's on average twice a month, but it's early days yet. \n\n\nRegardless, I'm enjoying it much more again now that the pressure has eased off. ",
          "score": 4,
          "created_utc": "2026-02-14 15:34:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5dm5li",
          "author": "YurieBlog",
          "text": "How am I dealing with low traffic?  \nI've been blogging for about a month. Quality content, proper SEO, submitted sitemaps-everything by the book.  \nSearch Console: \"No errors!\"  \nBing Webmaster: \"Looks perfect!\"  \nActual indexing: 0 pages  \nEveryone keeps saying \"wait 3-6 months\" but like... really? I'm supposed to write quality content for half a year with zero traffic and just hope the algorithms eventually notice me? That's insane.  \nSo, how am I dealing with it? I guess badly...very badly😂️",
          "score": 4,
          "created_utc": "2026-02-14 18:16:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5hq8bg",
              "author": "iron_davith",
              "text": "That's about the crux of it. One month is very, very early days (for Google traffic). You can of course find other ways to spread your work, so you're not purely reliant on Google.",
              "score": 3,
              "created_utc": "2026-02-15 11:28:51",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5i42e9",
                  "author": "YurieBlog",
                  "text": "Google is actually responding to my blog at least a little bit. Bing, on the other hand, refuses to index it at all. The only thing that helps slightly is linking from high-authority third-party sites like GitHub. Without them, it would be a total flop. IndexNow and Clarity haven't been much help either. Anyway, I’m going to keep trying.",
                  "score": 1,
                  "created_utc": "2026-02-15 13:19:25",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5cfzkg",
          "author": "el_duderino2112",
          "text": "I have run onto dry spells before. I'd really try to think of something to write and would get overwhelmed by over thinking. I just took a break for a while, then suddenly one day I had all kinds of inspiration and it keeps flowing. I took a whole day and wrote a ton of entries while the inspiration was in top gear. I have a good backlog for both of my blogs for when I have those days I am not inspired. Writing is like life in general, you'll have your ups and downs.\n\nWhen I get ready to post something in a backlog, I usually read it first and do a bunch of edits before posting. It is good to see what my mindset was at the time of writing it vs. time of posting it. That also usually helps in putting out a better post.\n\nI don't have many readers and that is fine. I'm not trying to blog for a living, so I am not worried about SEO. I am just amazed anyone found my blogs to begin with. Just getting a new reader once in a while is exciting and inspiring on its own. When I drop my next post, I feel like it is for the new reader. I make a habit of not checking my stats but maybe once in a blue moon. \n\nAnyway, I like to ramble a bit. Sorry!",
          "score": 3,
          "created_utc": "2026-02-14 14:39:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5dbksm",
          "author": "bluejaydreamer",
          "text": "If your blog material is evergreen (can be posted any time), set a goal for posts per week… then challenge yourself to get out ahead of that goal. \n\nIt’s an awesome feeling to be 3-4 weeks ahead and have flex time to workshop new ideas :)",
          "score": 3,
          "created_utc": "2026-02-14 17:23:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5dfugf",
          "author": "Hungry-Network-3498",
          "text": "I've only been blogging for a few weeks, but my biggest reccommendation is to post about stuff that GENUINLELY interests you. If you love what you write, it feels a lot less like a chore. I'd also reccommend creating a calendar where you have specific times to write, and continue until it feels like a habit. It's also important to remember that breaks are important for motivation, and if things get busy don't pressure yourself!",
          "score": 3,
          "created_utc": "2026-02-14 17:45:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5elh1k",
          "author": "AccurateSentence988",
          "text": "For me its oppposite. I have a lot of time but i just write and rewrite, and rewrite to make it sound better....",
          "score": 2,
          "created_utc": "2026-02-14 21:22:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5h6468",
          "author": "bigpurpleoctopus",
          "text": "leave it on autopilot using tools like blogbuster , drfatseo, growmore, and outrank.",
          "score": 2,
          "created_utc": "2026-02-15 08:15:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5dc0z4",
          "author": "isubhrajyoti",
          "text": "Create a content calendar.",
          "score": 1,
          "created_utc": "2026-02-14 17:25:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5e3233",
          "author": "AverageParking7050",
          "text": "Be a knowledgeable yapper 😅",
          "score": 1,
          "created_utc": "2026-02-14 19:42:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5fdjwa",
          "author": "SellSuite",
          "text": "Content calendar helps me a lot, I generated one and stick to it. Scheduling my life helps too if I stick to a solid schedule i find it helps with consistency",
          "score": 1,
          "created_utc": "2026-02-15 00:05:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5hvz3m",
          "author": "MyChileTravelGuide",
          "text": "What really helped me is planning ahead. So I could write 10 blogs, but instead of posting them straight away or planning the first one this week, I would plan the first blog in 1.5 months.\n\nThat way I have a lot of wiggle room and I don't feel like I have to write, but I actually write when I feel like it. It actually makes the quality better.\n\nOf course it depends wether you write evergreen content or news articles and such. A solution to that would be to use the strategy of planning 1.5 months ahead and combining it with posting news articles straight away.",
          "score": 1,
          "created_utc": "2026-02-15 12:18:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5j0ofa",
          "author": "Girlpowerxx",
          "text": "Hii, I get you because I lost 1 year and 5 months because of IT. Open your WordPress and write drafts. You can write lots of them and you don't have to finish them all in one day. That's what helped me. When you reopen your posts, you can just pick up where you left off instead of having to start from scratch.",
          "score": 1,
          "created_utc": "2026-02-15 16:17:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ja5gq",
          "author": "No_Tangerine_2903",
          "text": "I started blogging in October and I’ve been able to stay consistent mostly because I only post twice a month (I post at the beginning of the month and half-way through). \n\nIt seems like low output but my traffic and search ranking continues to increase every month. I find it’s an easy schedule for me to adhere to especially since I’ve got other projects I’m working on.",
          "score": 1,
          "created_utc": "2026-02-15 17:03:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5jpa2f",
          "author": "unicorn69love",
          "text": "Consistency sucks man, i got lazy with it until i tried nextblog ai it automates keyword stuff and spits out seo posts on autopilot so i dont have to force daily writing. traffic still builds slow as hell like everything else but at least im posting without burning out. worth a shot if overthinking kills ya",
          "score": 1,
          "created_utc": "2026-02-15 18:17:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5kvq3t",
          "author": "USANerdBrain",
          "text": "Bulk write in the same day each week and schedule posts",
          "score": 1,
          "created_utc": "2026-02-15 21:50:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5kym8a",
          "author": "Dootcom",
          "text": "I know that problem all too well. It is the exact same way for me. I either post consistently over and over again, or not at all for a long time. I have already apologized in so many posts for not writing anything for such a long time, but I think you just have to accept that this is how it goes.\nWrite about what interests you. Write the way you would like to read it and then do not worry about whether someone is reading it or not. [I try to write for myself](https://thoughtsofmayhem.com) because things interest me. I just hope that at some point, someone will share my interests and like the way I write. I have moved away from writing for Google and I am trying not to lose the fun in it, while always reminding myself that I enjoy doing this. And I do it for me. One day I will look at my numbers and think, \"Wow, someone is actually reading this!\" At least I hope that day comes.",
          "score": 1,
          "created_utc": "2026-02-15 22:05:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ly2ip",
          "author": "JackHarknessDrWho",
          "text": "batching works well for me",
          "score": 1,
          "created_utc": "2026-02-16 01:33:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5m8xv2",
          "author": "100_days_away_blog",
          "text": "I find that moving between topics and tasks works best for me. If I wrote a blog post on Japan, my next post will probably be something different and then I’ll go back to Japan for the one after that. Also, often will focus on keyword research or blog design, or something to keep it fresh. \n\nI think having a plan helps too - if I make a target or writing two posts a week it’s good to have goals to meet. \n\nGood luck",
          "score": 1,
          "created_utc": "2026-02-16 02:42:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5mmqwa",
          "author": "anaveragescientist",
          "text": "i have a really hard time with this. i work full time at a very involved job and have a toddler. i see little progress. i average maybe 10 views a day. my blog isn’t indexed on google because mine is a subdomain of wordpress. i don’t want to spend money on a blog that idk if it’ll pay for itself. (my blog is about being frugal 😂)",
          "score": 1,
          "created_utc": "2026-02-16 04:16:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5mxmsl",
          "author": "John54601",
          "text": "Consistency in anything is so important. Sometimes it feels like a challenge and like it’s not really working, but continuing the journey is the best way to see great rewards.\n\n",
          "score": 1,
          "created_utc": "2026-02-16 05:38:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5n2159",
          "author": "ynprosper",
          "text": "What platforms yall use to blog on?",
          "score": 1,
          "created_utc": "2026-02-16 06:14:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5n9xh6",
          "author": "madhuforcontent",
          "text": "For me blog is a business asset and I keep working on it regularly. My committments and long term vision is pushing me to work consistently on my blog, along with my freelance works. ",
          "score": 1,
          "created_utc": "2026-02-16 07:25:01",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r14xwf",
      "title": "Two things I stopped doing in blogging now",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1r14xwf/two_things_i_stopped_doing_in_blogging_now/",
      "author": "Key_Question5584",
      "created_utc": "2026-02-10 16:10:51",
      "score": 19,
      "num_comments": 14,
      "upvote_ratio": 0.92,
      "text": "**1. Writing long posts**\n\nEarlier, I used to ensure each blog post was above 500 words.\n\nBut now I’ve noticed that even short articles that stick to the core point are getting traffic.  \nNow, I mostly write 250 to 300 words.\n\n**2. Writing FAQs**\n\nI stopped writing FAQs because I haven’t seen any benefit from including them in blog posts.\n\nInstead of spending time writing long, detailed posts, I am using that time to turn the information into YouTube videos.",
      "is_original_content": false,
      "link_flair_text": "Tips/Info",
      "permalink": "https://reddit.com/r/Blogging/comments/1r14xwf/two_things_i_stopped_doing_in_blogging_now/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o4naszz",
          "author": "ItsLisaMila",
          "text": "Words don't matter in blog anymore, only thing matter how you satisfied your user with their query intent",
          "score": 8,
          "created_utc": "2026-02-10 17:19:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4o91rp",
          "author": "SnooBooks9107",
          "text": "maybe not for blogs, I find FAQs useful for my saas website!",
          "score": 4,
          "created_utc": "2026-02-10 19:56:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4n3enm",
          "author": "Teigh99",
          "text": "I plan on doing the YouTube thing also. How long are your videos?",
          "score": 2,
          "created_utc": "2026-02-10 16:44:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4n4vm3",
              "author": "Key_Question5584",
              "text": "2 to 3 minutes.",
              "score": 4,
              "created_utc": "2026-02-10 16:51:37",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4xd85y",
          "author": "thinkneo",
          "text": "Agree on both points. Long posts for the sake of word count just dilute the message. And static FAQ sections are basically invisible - nobody scrolls down to read them.\n\nWhat I've found works better than FAQs: let readers ask their own questions. Everyone's \"frequently asked\" question is different. A pre-written FAQ tries to guess what people want  to know. Letting them ask in the moment gets way better engagement. ",
          "score": 2,
          "created_utc": "2026-02-12 04:14:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4r6crs",
          "author": "thetetheredsoul",
          "text": "Would you attribute it to our reduced attention span? Is it like reels or shorts of blogging now?",
          "score": 1,
          "created_utc": "2026-02-11 06:03:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4r8luo",
              "author": "Key_Question5584",
              "text": "Yes, that is also one of the reasons. Now people have more options for consuming the content instead of just reading long articles.  \nInstead of worrying about it, I also started turning my blog posts into shorts using Google Slides.",
              "score": 2,
              "created_utc": "2026-02-11 06:22:19",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4rvu8w",
                  "author": "thetetheredsoul",
                  "text": "\"turning my blog posts into shorts using Google Slides.\" That's interesting. Please tell me how do you do it?",
                  "score": 2,
                  "created_utc": "2026-02-11 09:57:51",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o55blv1",
          "author": "Far_Needleworker9728",
          "text": "I agree, as a reader, i get bored by reading long blogs and left the website",
          "score": 1,
          "created_utc": "2026-02-13 11:35:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o56sow7",
          "author": "Nicolas_JVM",
          "text": "Switching to shorter posts and exploring new formats sounds like a smart move! Feels like keeping content concise is what readers appreciate these days. If you're looking for ways to dig deeper into what topics might work for your audience, tools like [kwrds.ai](http://kwrds.ai) or even the usual suspects like SEMrush and Ahrefs can help tailor your content strategy more effectively. People often overlook how much tools can simplify finding those sweet spots in content strategy, especially when tackling both text and video platforms.",
          "score": 1,
          "created_utc": "2026-02-13 16:31:29",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r57a93",
      "title": "Blogging vs Newsletter which one to start in 2026?",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1r57a93/blogging_vs_newsletter_which_one_to_start_in_2026/",
      "author": "Abhi_10467",
      "created_utc": "2026-02-15 06:15:26",
      "score": 17,
      "num_comments": 15,
      "upvote_ratio": 0.88,
      "text": "I am curious to know what to start this year. I had few blogs in past but now I am not working on those blogs. \n\nThis year I want to start one but many people are advising that newsletter is a better option?\n\nLet me know what to do?",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/Blogging/comments/1r57a93/blogging_vs_newsletter_which_one_to_start_in_2026/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o5gx6jw",
          "author": "Reasonable_Lab136",
          "text": "Blogging, 100%.\nHere’s why: a blog post you write today can bring you traffic for years through SEO. A newsletter email gets opened once (maybe) and then it’s buried. I’ve run blogs before and the compounding effect of organic search traffic is something newsletters simply can’t replicate.\nThat said, the smart move is: start with a blog, add a newsletter later as your email collection tool. Your blog brings in the traffic from Google, and your newsletter keeps those readers engaged. They work best together, but the blog should be the foundation.\nA few things that changed since you last blogged:\n\t∙\tAI tools can seriously speed up your content workflow now (research, outlines, first drafts) — you still need to edit and add your voice, but it cuts production time by 60-70%\n\t∙\tGoogle is rewarding helpful, experience-based content more than ever (E-E-A-T)\n\t∙\tMonetization options like Mediavine/Raptive are still very much alive if you hit the traffic thresholds\nNewsletters are great, but they have a ceiling without a traffic source. A blog IS the traffic source.\nWhat niche are you thinking about?",
          "score": 15,
          "created_utc": "2026-02-15 06:49:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5hxaea",
              "author": "ReyPepiado",
              "text": "What newsletter service would you recommend to run alongside a blog, that is also cost effective when scaling the newsletter?",
              "score": 2,
              "created_utc": "2026-02-15 12:29:14",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5guryx",
          "author": "MyPublicKey",
          "text": "Both. Turn your newsletter into blog posts too.",
          "score": 2,
          "created_utc": "2026-02-15 06:27:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5it5ja",
          "author": "MedalofHonour15",
          "text": "Turn blog into newsletter and AI videos for social media",
          "score": 2,
          "created_utc": "2026-02-15 15:40:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5izvj1",
          "author": "Spirited_Manager_831",
          "text": "Why not both?\n\nBlogging will deliver leads to your newsletter with the right strategy. ",
          "score": 2,
          "created_utc": "2026-02-15 16:13:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5gzq01",
          "author": "MarktMaverick",
          "text": "If you’ve run blogs before, you already know how tough it is to build traffic from zero. Newsletters sound more attractive because you own the audience and aren’t relying on algorithms or SEO, but they still require a clear niche and consistent distribution.\n\nI think the smartest move in 2026 is probably both: publish searchable content (blog or LinkedIn/X threads) to attract new people, and use a newsletter to capture and nurture them. A blog gives you discoverability while a newsletter gives you ownership.",
          "score": 1,
          "created_utc": "2026-02-15 07:13:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5hombx",
          "author": "planganauthor",
          "text": "Both 100%. No one tool does it all.",
          "score": 1,
          "created_utc": "2026-02-15 11:13:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5hu6ve",
          "author": "Tricky_Trifle_994",
          "text": "blogs are great, because they live on the internet forever, and with AI that scraps the web, your blog might get suggested during AI conversations.\n\non the other hand, newsletters are great because you can get your writing sent directly to your list's inbox. you're not at the mercy of any algo change (e.g how lot of website lost traffic after google algo change / ai overview).\n\non the bright side, now there's many platforms that allow you to do both. e.g i'm subscribed to alot of newsletters that also have a blog (they're using either substack or beehiiv - if you're curious about tech stack). so now you get the best of both worlds. a blog that lives on forever + get indexed by AI + have every article sent to reader's inbox so they don't miss any.",
          "score": 1,
          "created_utc": "2026-02-15 12:03:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5jpi13",
          "author": "unicorn69love",
          "text": "dude you dropped blogs before cuz the grind sucks newsletters aint a shortcut either they fizzle fast w/o nonstop promo. go blog again but automate the seo bs with nextblog ai, its legit boosted my traffic on autopilot without me touching shit, then slap a newsletter on top for the loyal ones.",
          "score": 1,
          "created_utc": "2026-02-15 18:18:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5kc7wp",
          "author": "bluehost",
          "text": "Since you've already had blogs before, I'd zoom out and ask why you stopped. If it was burnout or traffic frustration, switching to a newsletter won't automatically fix that. The grind just shows up in a different form.\n\nOne thing people don't talk about much is leverage. A blog is an asset you can optimize, update, and let compound over time. A newsletter is more of a rhythm, it rewards consistency and personality. If you like building evergreen stuff, blog. If you like direct conversation and momentum, newsletter.\n\nYou can always layer one into the other later. The harder part is picking the format you'll actually enjoy showing up for in six months.",
          "score": 1,
          "created_utc": "2026-02-15 20:10:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5kcq9b",
          "author": "TheTreyDumas",
          "text": "Both. Use something like Beehiiv that can send emails and create blog posts rather easily. You get the intimate connection with your audience and the SEO benefits.",
          "score": 1,
          "created_utc": "2026-02-15 20:13:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ktuxw",
          "author": "USANerdBrain",
          "text": "If you don’t know do both",
          "score": 1,
          "created_utc": "2026-02-15 21:41:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ll99x",
          "author": "ulcweb",
          "text": "Look they're the same thing, technically. A blogging cms can be used for newsletters, look at ghost or wordpress + mailpoet.\n\nNewsletter tools like substack, ghost, beehiiv, or paragraph. THEY'RE ALL BLOG CMS's too.\n\nThe real difference is how you write, and IMO more importantly the LENGTH. I personally treat my newsletters as blog posts, so I don't write them particularly different. That is just my methodology, and I think others will say otherwise in their methods. That's okay.\n\nTruly you just need to pick the right platform, and put in the reps more so. Rather than the blog vs newsletter debate. Hope that helps!",
          "score": 1,
          "created_utc": "2026-02-16 00:14:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5m9i45",
          "author": "100_days_away_blog",
          "text": "I think it has to be blog first, followed by a newsletter, but, I have one newsletter that I follow that is excellent and they only just set up the blog. It is for a very specific niche (mountain town in Alberta) so everything in the newsletter is of interest to me.",
          "score": 1,
          "created_utc": "2026-02-16 02:46:34",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r1pe7a",
      "title": "How do big blogs like Morning Brew, The Atlantic, or The Hustle build their websites? (I can’t code)",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1r1pe7a/how_do_big_blogs_like_morning_brew_the_atlantic/",
      "author": "LeeR637",
      "created_utc": "2026-02-11 06:00:13",
      "score": 15,
      "num_comments": 21,
      "upvote_ratio": 0.89,
      "text": "Hey everyone,\n\nI’m trying to create a media or blog website. Took some inspiration from big Blogs like Atlantic, Morningbrew, hustle, etc. \n\nRight now, I’m using free WordPress templates, but it feels very restrictive. I’m stuck following the template’s rules, and I can’t customize the layout or design the way I want. It seems messy and limiting.\n\nMy problem:\n\nI don’t know how to code.\n\nFree themes feel rigid.\n\nPage builders seem complicated and clunky.\n\nI want something clean, fast, and easy to grow.\n\nSo, how do these big blogs actually build their websites?\n\n\n\nDo they:\n\nHire developers and create from scratch?\n\nUse custom WordPress themes?\n\nUse Webflow or another no-code tool?\n\nUse headless CMS setups?\n\n\n\nIf I can’t code, what’s the best way to build something professional and customizable without being stuck with templates?\n\nI would really appreciate real-world advice from people who’ve built media sites.",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/Blogging/comments/1r1pe7a/how_do_big_blogs_like_morning_brew_the_atlantic/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o4rjudd",
          "author": "FromOverYonder",
          "text": "Pay, build or learn. Those are your options. \n\nPAY - A dev for a custom web. Be prepared to pay alot. Not just 100 bucks. \n\nLEARN - use ai to assist you to build the above or spend a couple of hundred hours to fully learn it yourself. Hey, at least you would get a new skill. \n\nBUILD - Use wordpress and a builder such as Elementor or divi. Plenty of moderately cheap themes out there or have a go at designing it yourself. \n\nWhat does a smart man do? Spends little a possible to get a website up and running while learning how to rank and make money etc. No matter how you build your website you will still be left with tackling this challenge.",
          "score": 9,
          "created_utc": "2026-02-11 08:04:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4r8bi5",
          "author": "Constant-Loquat-310",
          "text": "How big blogs build sites:  \nYes — they hire dev teams and use custom builds (often WordPress with custom themes, or headless CMS + React/Next.js). You don’t need that level to start.\n\nBest option if you can’t code (but want control):\n\n* Use WordPress + a lightweight theme (Astra/GeneratePress) + a visual builder (Bricks or Elementor). This gives you custom layouts, speed, and scalability without being locked into rigid templates.\n\nAvoid the common traps:\n\n* Free themes = limited control and bloated design\n* Overloaded page builders = slow sites and messy structure\n\nSimple pro setup (no code):  \nWordPress + fast theme + one builder + minimal plugins.  \nThis is how most serious media startups begin before custom dev.\n\nBottom line:  \nYou don’t need Webflow or headless to look professional. Start with a clean WordPress setup, design your layout visually, and upgrade to custom dev later if you grow.",
          "score": 7,
          "created_utc": "2026-02-11 06:19:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o50dwpj",
              "author": "Feisty-Confidence163",
              "text": "Saving to come back to this! Thanks!",
              "score": 1,
              "created_utc": "2026-02-12 17:02:47",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4sc8af",
          "author": "CraftBeerFomo",
          "text": "Just waiting now for the OP to edit his post saying....\n\n\"thanks for all the replies, I've taken your advice and will start using TOOL NAME\" \n\nEven though no one suggested that tool and simply because this was a post designed to promote something from the beginning.",
          "score": 2,
          "created_utc": "2026-02-11 12:15:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4sfzc2",
              "author": "LeeR637",
              "text": "Naaah, I won’t!!😂😂\nI just started a blog with one of my friend, so that was the reason I posted thiss!! \n\nNot everyone has an alternative motive!! 👍😂",
              "score": 1,
              "created_utc": "2026-02-11 12:42:03",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4t7j5o",
                  "author": "CraftBeerFomo",
                  "text": "99% of posters who make posts written like yours iin this Sub do though.\n\nYour post follows the literal framework for every spam post we see in here.",
                  "score": 1,
                  "created_utc": "2026-02-11 15:15:33",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o52my85",
                  "author": "sk_611",
                  "text": "I think you mean ulterior lol",
                  "score": 1,
                  "created_utc": "2026-02-12 23:36:39",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o4sgqym",
              "author": "TailFinder",
              "text": "Can mods detect when you edit in links at a later point?",
              "score": 1,
              "created_utc": "2026-02-11 12:47:04",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4skvmk",
                  "author": "LeeR637",
                  "text": "No Idea 🤷",
                  "score": 1,
                  "created_utc": "2026-02-11 13:13:00",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4w029q",
          "author": "SoftLast243",
          "text": "Try squarespace, or blogger.",
          "score": 2,
          "created_utc": "2026-02-11 23:16:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4rhmzf",
          "author": "ValianceLabs",
          "text": "Yes they use custom built sites, but because they have the money to do so. They didn't start out like that. You don't need a top of the line website right away, you just need something to get started and see if people take interest. There's Webflow which although has some nicely designed templates it can come off a bit advanced when trying to add in or change things around, not as difficult as coding though.\n\nI personally use NextJS + Sanity along with Claude Code. I know you said you don't know how to code but if you have the time you should try out something like Claude Code. Watch/Read a couple tutorials on it and see if you can get a basic blog project going. It'll probably be frustrating to get the hang of initially but if you learn how to use it I think you'll have a much better experience building something you truly want. It's gotten pretty good and even with a couple prompts you can have it build out a decent site.\n\nIf you want any help feel free to reach out, not here to sell you anything at all but I understand your frustration. I could even get you a baseline starter site up and running if you'd like and you can use that as a practice project if you decide to try out Claude Code.",
          "score": 1,
          "created_utc": "2026-02-11 07:43:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4rhqcy",
          "author": "RedCreator02",
          "text": "Big sites usually have dev teams and custom builds. You don’t need that starting out.\n\nIf free themes feel restrictive, it’s usually not WordPress, it’s just how templates work. A lot of them are rigid or structured by design. \n\nIMO, it’s worth spending a bit of time learning how templates and block builders actually work. Once you understand sections, reusable blocks, global styles, etc., you stop feeling stuck and can begin appreciating the freedom WordPress gives you.\n\nA lightweight theme like Astra + block-based builder like Spectra or Breakdance is more than enough for a clean, scalable site. \n\nAgain IMO, the tools you use matter less than knowing how to use them properly.",
          "score": 1,
          "created_utc": "2026-02-11 07:44:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4rky9o",
          "author": "skorpion7777",
          "text": "I struggeled with the same questions and issues when I got started. And I can only recommend you to not go down the Wordpress route. I hated it and it felt old, slow and for everything you need a plugin. If its about nice design and just getting started I can wholeheartedly recommend Framer to you",
          "score": 1,
          "created_utc": "2026-02-11 08:14:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4s9rii",
          "author": "Strong_Teaching8548",
          "text": "Most of those big blogs use custom wordpress setups with developers who've heavily modified the theme, or they built custom solutions with headless cms like contentful + next.js. that's the honest answer, they had budgets to hire people\n\nif you can't code and don't want to hire someone yet, webflow is probably your best bet. it's not as rigid as free wordpress themes and you get way more control over layout without touching code. yeah it costs money, but you're getting actual flexibility\n\nthe middle ground a lot of people miss: start with a solid paid wordpress theme (like generatepress or kadence) and use a page builder like elementor pro. it's not perfect but it'll get you 80% closer to what you want than free themes",
          "score": 1,
          "created_utc": "2026-02-11 11:57:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o58na8u",
          "author": "Alarmed_Shift1216",
          "text": "You don’t even need a dev team anymore with AI. If you learn just the basics of code and learn prompting, you can build something yourself. I built payoffhub.com with Codex (for the tool) and Claude code. The best part is when you do not know something, you can just ask the AI to teach you. Wordpress will always restrict the look/feel of your site, even if you use themes.",
          "score": 1,
          "created_utc": "2026-02-13 21:56:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5azhxs",
          "author": "Tricky_Trifle_994",
          "text": "using wordpress is a viable option (it does power alot of website on the internet, but you probably won't get what you're trying to go after with just the free templates (they are free for a reason). \n\n>So, how do these big blogs actually build their websites?\n\nThey use CMS solutions (or custom build in-house) + custom dev work. e.g morningbrew uses Sanity + had multiple devs in the company. \n\n>If I can’t code, what’s the best way to build something professional and customizable without being stuck with templates?\n\nbased on what you've said, wordpress isn't suitable for you. neither is something like webflow or ghost, because they can take awhile to learn and set up. if you want something right out of the box, that will allow you to just focus on writing and publishing without having to be bothered by the infrastructure and set up, i'd say beehiiv is your best bet. it's clean, fast, easy to scale with, it's a newsletter + blog (similar to morning brew and the hustle), and it's created by the devs from morning brew.",
          "score": 1,
          "created_utc": "2026-02-14 07:21:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5honhc",
          "author": "RobertLigthart",
          "text": "webflow if you cant code. most of those big blogs started on wordpress or ghost and then moved to custom builds once they had the money. you dont need a custom build to get started... just pick something clean and focus on the content first",
          "score": 1,
          "created_utc": "2026-02-15 11:14:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4rdnni",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 0,
          "created_utc": "2026-02-11 07:06:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4smrvd",
              "author": "LeeR637",
              "text": "Best answer !!!!! ",
              "score": 0,
              "created_utc": "2026-02-11 13:24:13",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r3g1d6",
      "title": "How are Google AI Overviews and ChatGPT actually changing the way people search?",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1r3g1d6/how_are_google_ai_overviews_and_chatgpt_actually/",
      "author": "SERPArchitect",
      "created_utc": "2026-02-13 04:50:33",
      "score": 15,
      "num_comments": 6,
      "upvote_ratio": 1.0,
      "text": "I've been thinking a lot about this lately. With Google now showing AI-generated summaries at the top of search results and more people turning to ChatGPT for quick answers, it feels like we're in the middle of a major shift in search behavior.\n\nI'm curious if anyone else has noticed changes in how users interact with search engines now compared to a year or two ago. Are people still clicking through to websites, or are they just getting their answers from the AI overview and moving on? And for those using ChatGPT regularly, are you finding yourself bypassing Google entirely for certain types of queries?\n\nI'm especially interested in hearing from anyone who's seen this reflected in their website analytics or if you've had to adjust your content strategy because of these changes. Does traditional SEO even matter as much anymore when AI is summarizing everything at the top?\n\nWould love to hear different perspectives on this.",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/Blogging/comments/1r3g1d6/how_are_google_ai_overviews_and_chatgpt_actually/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o548xhr",
          "author": "onlinehomeincomeblog",
          "text": "Search behavior is changing and it's more like a filter. Before AI, people have to read through 10s of blogs to make a decision and AI have changed this entire scenario. People's decision making process became more simple and quick. Queries like **Definitions, How-to Steps, and Basic Comparisons** are handled directly by AI overviews. Hence organic CTR fallen sharply, but that's an end.\n\nBecause queries like **buying something, comparing tools, choosing a service, and seeing examples** still get clicks. AI can summarize options, but people still wants real screenshots, detailed breakdowns, proof, reviews, and nuance. Here's where I am winning organic views nowadays.\n\nChatGPT vs Google:\n\nPeople use ChatGPT for brainstorming, learning concepts quickly in shorter time, drafting ideas, and quick explanation. But still, local searches, price comparisons, trust validation, and deep research, Google dominates.\n\nWe need to be more specific on what to publish and what not.",
          "score": 2,
          "created_utc": "2026-02-13 05:47:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o55x3xq",
          "author": "jim-chess",
          "text": "Big change.\n\nEven being number one for organic results where there are AI Overviews and sponsored results means that you're probably well beneath the page fold now. So like the equivalent of being on page 2 from before.",
          "score": 1,
          "created_utc": "2026-02-13 13:54:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o58rrm6",
          "author": "akowally",
          "text": "Traffic's definitely shifted. Click-through rates have dropped on informational content that gets fully answered in the AI overview. People aren't clicking through if Google already gave them what they needed.\n\nThat said, commercial intent and deep-dive content still gets clicks. AI overviews are decent for quick facts but not yet good enough for more complex how-to information.\n\nPersonally, while I use ChatGPT quite often, I still rely on Google when I actually want sources or need to verify something. ",
          "score": 1,
          "created_utc": "2026-02-13 22:18:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5amizp",
          "author": "TheDoomfire",
          "text": "I still query search engines daily but not as much.\n\nSome things are really going to be gone. I mean searching for simple stuff is just not worth it in search engines anymore when AI can spit ut out faster, and for simple things its almost always right.\n\nAt the moment AI lies too much tho so I don't trust it for exact calculators, data retrieval, full \"planning\" since forums/Google still have better ways, or coding in a way that is maintainable/great.",
          "score": 1,
          "created_utc": "2026-02-14 05:27:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5487pz",
          "author": "Ok_Revenue9041",
          "text": "I have definitely seen a drop in organic clicks from Google and more users getting what they need from AI overviews or ChatGPT responses. If you want your brand or content to actually surface in those AI answers, traditional SEO alone is not enough anymore. A tool like MentionDesk focuses on optimizing visibility specifically for AI engines, which is something I’ve started to explore more lately.",
          "score": 1,
          "created_utc": "2026-02-13 05:42:07",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r0p8is",
      "title": "Blogging Is Like Farming, Plant the Right Seeds (Keywords)",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1r0p8is/blogging_is_like_farming_plant_the_right_seeds/",
      "author": "Key_Question5584",
      "created_utc": "2026-02-10 03:01:33",
      "score": 13,
      "num_comments": 31,
      "upvote_ratio": 0.81,
      "text": "Before harvesting, a farmer prepares the land, plants seeds, and takes care of the crops. The results take time.\n\nIn the same way, a blogger finds a keyword, writes a post, publishes it, and updates it over time.\n\nMany blog posts I wrote months or even years ago still get traffic, even if some have formatting or grammar mistakes.\n\nWhat really matters is using the right strategy and leaving the rest to Google.\n\nThe right strategy means choosing the right keyword and creating content that is better than the pages already ranking on Google.\n\n**If a farmer uses bad seeds, he won’t get a good crop. Similarly, if a blogger doesn’t choose the right keyword, they won’t get traffic.**\n\nSo, always use SEO tools before choosing a keyword for your blog post.\n\nMy criteria for choosing the right keyword are that it should be long-tail, solve a problem, or have a good CPC, and either have at least 10 searches per month or proven traffic to an existing page.\n\n",
      "is_original_content": false,
      "link_flair_text": "Tips/Info",
      "permalink": "https://reddit.com/r/Blogging/comments/1r0p8is/blogging_is_like_farming_plant_the_right_seeds/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o4jw7oi",
          "author": "Reasonable_Lab136",
          "text": "The farming analogy is spot on. I’d add one thing though — it’s not just about planting the right seeds, it’s about planting ENOUGH of them.\nI see so many bloggers spend weeks perfecting one post and then wonder why they’re not getting traffic. Meanwhile I’m pushing out 3-5 posts a week targeting low KD keywords and letting Google decide which ones take off.\nNot every post will rank. That’s fine. But if you’re consistently putting out content with solid keyword research behind it, some of those seeds WILL grow. It’s a numbers game on top of a strategy game.\nMy sweet spot: KD under 15, long-tail, at least some search volume. Publish, move on, revisit the winners later and make them even better.",
          "score": 3,
          "created_utc": "2026-02-10 03:17:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4jwod1",
              "author": "Key_Question5584",
              "text": "You are right, volume with proper strategy wins in blogging.",
              "score": 2,
              "created_utc": "2026-02-10 03:20:04",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o4k7yxf",
              "author": "Fast_Extension971",
              "text": "Does this method still work?\n\nI'm looking to get back into blogging after years and would really appreciate your take on the future of blogging. I keep hearing that blogging is dead?",
              "score": 1,
              "created_utc": "2026-02-10 04:34:15",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4km1ja",
                  "author": "Key_Question5584",
                  "text": "If you want to make a decent passive income, blogging is still the best option.",
                  "score": 1,
                  "created_utc": "2026-02-10 06:22:15",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            },
            {
              "id": "o4p29qs",
              "author": "tastingsunsets",
              "text": "How do you find those keywords?",
              "score": 1,
              "created_utc": "2026-02-10 22:12:44",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4ludid",
          "author": "Strong_Teaching8548",
          "text": "the keyword research part is just the starting point, what actually matters is understanding why people are searching for that keyword and what they actually need\n\ni've built tools that parse search data and the difference between a keyword that ranks and one that converts is usually way more nuanced than search volume or cpc. you could have a perfect long-tail keyword with decent volume, but if you're not addressing the actual intent behind those searches, you're planting seeds in the wrong soil\n\nthe real strategy isn't just picking good keywords, it's making sure your content actually solves what searchers came for. that's where most bloggers slip up :)",
          "score": 4,
          "created_utc": "2026-02-10 12:52:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4rh405",
              "author": "localkinegrind",
              "text": "i agree, the kwyword is the starting point as you have to align it to what people are searching. ",
              "score": 1,
              "created_utc": "2026-02-11 07:38:36",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4kezhm",
          "author": "onlinehomeincomeblog",
          "text": "I want to add one thought: Good seeds matter. In my experience, I have seen posts rank with imperfect formatting, average writing, and even minor grammar issues. \n\nBut the keyword intent was right, the site already had some topical relevance, and the content genuinely answered the query better than others.",
          "score": 2,
          "created_utc": "2026-02-10 05:25:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4kq4g7",
          "author": "dondeestalagato",
          "text": "Another graduate of the Temu School of Blogging.\n\nStop it. Stop the insanity.\n\nYou are not original and neither are your \"ideas\" that are just a rehash of past advice that no longer work in 2020 let alone 2026.\n\nLearn to be original. It'll serve you well.",
          "score": 1,
          "created_utc": "2026-02-10 06:57:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ksf3f",
              "author": "Key_Question5584",
              "text": "I share what really works for me.\n\nSince 2020, there may have been many changes in blogging, but the process is the same: find the right keyword and write a better blog post that solves a problem.\n\nI am not sharing any shortcuts.",
              "score": 1,
              "created_utc": "2026-02-10 07:18:34",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4mf80h",
                  "author": "CraftBeerFomo",
                  "text": ">Since 2020, there may have been many changes in blogging, ***but the process is the same: find the right keyword and write a better blog post that solves a problem.***\n\nNo Rajesh, that's not the process that works right now. That hasn't worked for a while now. In fact things never really worked quite like that.\n\nYou can write the best blog post in the world, far better than everything else on the internet, and you still will not go to the top of the search results unless you have site authority and the backlinks to back it up.\n\nEven if you target longtail keywords that not many other people are covering then Google often will still not show your post for that keyword unless you have some level of domain authority and backlinks as since the rise of AI content tools that allow us to pump out 1,000s of posts around longtail keywords at the click of a button Google has been far more selective in the sites and posts they index and new sites are often sandboxed for an endless period of time or ignored completely favouring established sites even when their post doesn't entirely match the users search query.\n\nBlogging as a business model or a way to make money / passive income is an absolutely terrible choice in 2026 as there literally hasn't been a worse time in internet history to start a written blog - Google with their AI Overview Answers has wiped out between 60-100% of all blog traffic because they now answer most questions, in depth, directly in the SERPs and no one needs to click anywhere now.\n\nCombine that with the fact that between Sponsored Results, AI Answers, Google Shopping Carousels, Youtube Videos, People Also Ask Boxes, and Reddit threads that for anyone to even find an organic link to a blog in Google Search they'd have to scroll right to the bottom of page 1 or even page 2 these days and usually then it'll be a major media site rather than your independent blog.\n\nOn top of that you have ChatGPT and other tools that don't even link to websites, more people than ever directly searching on Reddit for answers to their queries, the huge increase in social media usage, Youtube being the worlds second biggest search engine after Google, and now short form video on Shorts, Reels, and TikTok reigning supreme which many Gen Z resort to directly to find information means blogs are no longer the main source of answers to questions.\n\nHardly anyone is visiting blogs in 2026 and no one is going to buy your Gumroad course on how you allegedly make $300 per month Rajesh, so please stop lying to people.",
                  "score": 1,
                  "created_utc": "2026-02-10 14:49:13",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4m6ov2",
          "author": "LuckyRubberDuckie",
          "text": "Algo updates hurt most when content is static. The blogs that recover fastest are the ones reacting to new events that occur in their niche, not just optimizing old keywords.",
          "score": 1,
          "created_utc": "2026-02-10 14:03:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4n3abj",
          "author": "WallAas",
          "text": "What tools do you recommend?",
          "score": 1,
          "created_utc": "2026-02-10 16:44:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4o5cav",
          "author": "MedalofHonour15",
          "text": "Just like farms it’s dying. Turn your blog into video content.",
          "score": 1,
          "created_utc": "2026-02-10 19:39:04",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r3l3rc",
      "title": "Do you use AI text detectors?",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1r3l3rc/do_you_use_ai_text_detectors/",
      "author": "Sweet_Tomato_01",
      "created_utc": "2026-02-13 09:49:00",
      "score": 12,
      "num_comments": 28,
      "upvote_ratio": 1.0,
      "text": "While grinding to reach Journey / Mediavine requirements i stumbled upon an article about their bans of blogs that use AI stuff. As i knew that some detectors have false positives i tried on my articles and got many of them, i personally write everything and use AI just for light research now and than.\n\nSo... do you use an AI detector to be sure that none of you text get flagged? Can you advice me one as there are many of them and one say Yes while another say No.\n\nThanks!",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/Blogging/comments/1r3l3rc/do_you_use_ai_text_detectors/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o5509xv",
          "author": "venom029",
          "text": "NO, because false positives are super common with AI detectors, especially if you write in a clean/structured way. I wouldn't stress too much about running your own content through detectors since they're not reliable enough. If you do want peace of mind, though, Clever AI Humanizer can help if you want to use a humanizer tool (it still depends on how you use it tho). But honestly, Mediavine and Journey look at patterns over time and quality signals, not just one detector score. Focus on adding personal experience, specific examples, and your unique voice since that's what actually matters for both readers and ad networks.",
          "score": 3,
          "created_utc": "2026-02-13 09:55:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o550m0j",
              "author": "nahid-hasan-mim",
              "text": "Yes. You're right.",
              "score": 1,
              "created_utc": "2026-02-13 09:58:14",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o554p5x",
              "author": "Sweet_Tomato_01",
              "text": "yeah i assume is the only way.",
              "score": 1,
              "created_utc": "2026-02-13 10:36:03",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o55prc7",
          "author": "notoverthinking",
          "text": "I have to use AI detectors at work. Chatgpt content can pass the detectors with the right prompts and basic editing. And human content gets flagged AI. Different detectors give different scores. And getting a low score means ruining the quality of content. So it just useless. But sadly have to please clients by using it.",
          "score": 2,
          "created_utc": "2026-02-13 13:13:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o55tqcx",
              "author": "Sweet_Tomato_01",
              "text": "I suppose that blogs banned by mediavine was just posting tons of AI slop. Probably they would be ok if your content is well curated even if AI.",
              "score": 1,
              "created_utc": "2026-02-13 13:36:02",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o599bl6",
              "author": "acapkenobi",
              "text": "What AI detection tools do you usually use and recommend?",
              "score": 1,
              "created_utc": "2026-02-13 23:59:04",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5awuoh",
                  "author": "notoverthinking",
                  "text": "I don't recommend any. They are not accurate at all. Better judge the quality of content rather than how it was written.",
                  "score": 1,
                  "created_utc": "2026-02-14 06:56:34",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5ag32d",
          "author": "Sophistry7",
          "text": "honestly, i stopped relying on detectors because they contradict each other all the time. i’ve had fully human posts flagged and lightly edited drafts score “0% ai,” so it feels more like guessing than science. what’s worked better for me is focusing on voice and specificity instead of chasing a score. if a paragraph sounds too polished or generic, i rewrite it in my own words. i’ve tested tools like rephrasy before just to smooth awkward phrasing, but i still do a manual pass after. are you more worried about ad networks checking, or just peace of mind?",
          "score": 2,
          "created_utc": "2026-02-14 04:37:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o550z4h",
          "author": "hikingpro",
          "text": "below are my findings. I always check the content in AI tools too specially if i use any tool to correct grammar or any sentence related issue after writing draft.  \n  \n [https://www.reddit.com/r/WritingWithAI/comments/1qqdvei/why\\_my\\_naturally\\_written\\_blog\\_posts\\_outperform/](https://www.reddit.com/r/WritingWithAI/comments/1qqdvei/why_my_naturally_written_blog_posts_outperform/)",
          "score": 1,
          "created_utc": "2026-02-13 10:01:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o554o4m",
              "author": "Sweet_Tomato_01",
              "text": "Thanks i'll take a look",
              "score": 1,
              "created_utc": "2026-02-13 10:35:48",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o55c5zy",
          "author": "Vinaya_Ghimire",
          "text": "I write my own content so I don't use AI detectors for my content. AI tools are notorious for flagging even 100 percent human content. However, sometimes I also humanize AI content for clients and when I do that I use AI detectors to see if I can pass.",
          "score": 1,
          "created_utc": "2026-02-13 11:40:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o566o1s",
          "author": "c0ncorde25",
          "text": "No, its mainly a scam",
          "score": 1,
          "created_utc": "2026-02-13 14:45:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o57cnls",
          "author": "akowally",
          "text": "I have learned not to stress too much about AI detectors. They're notorious for false positives, even on content written before people started using AI for writing. Plus, different tools give wildly different results on the same text, which says everything about how unreliable they are.\n\nHowever, I sometimes have to run stuff through them because clients insist on it.",
          "score": 1,
          "created_utc": "2026-02-13 18:07:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o58zxar",
              "author": "ehben83",
              "text": "Which one do you use ?",
              "score": 1,
              "created_utc": "2026-02-13 23:03:16",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o58zn83",
          "author": "ehben83",
          "text": "The question is which ones are ad networks using?",
          "score": 1,
          "created_utc": "2026-02-13 23:01:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5n835h",
              "author": "Sweet_Tomato_01",
              "text": "What do u mean? As i wrote they was banned from Mediavine that use Google Adsense.",
              "score": 1,
              "created_utc": "2026-02-16 07:08:15",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5aftbz",
          "author": "Existing_Pumpkin_502",
          "text": "I used to run everything through detectors too, but it just made me anxious. One tool says 5%, another says 60%, and you’re left guessing what to “fix.” For blogging, I’ve found it’s better to focus on making the piece genuinely useful and written in your own tone. If I use AI, it’s usually for outlining or research, then I rewrite it heavily so it actually sounds like me. Sometimes I’ll use something like Rephrasy just to loosen up stiff sentences, but I don’t chase a perfect score anymore.\n\nAre you worried about an actual manual review, or just trying to be safe because of what you read?",
          "score": 1,
          "created_utc": "2026-02-14 04:35:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5n8dgu",
              "author": "Sweet_Tomato_01",
              "text": "Its just that i found out about the Mediavine bans and so i tried a couple of my articles in Ai detectors. I got around 40% so i asked here what you thinked.\n\nIn the end i assume that they banned just a series of blogs clearly made completely by AI. I think if you cure your content even if you use it you should pass.",
              "score": 1,
              "created_utc": "2026-02-16 07:10:48",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5arx5f",
          "author": "dwoodro",
          "text": "AI often writes in a specific tone and cadence that is relatively easy to see if you use it enough. This means that AI detectors often pick up on those same issues.\n\nNow, the problem encountered is common depending on the topic of the writing. As a technical writer, I can get \"flagged\" as AI content even if I type every single word from scratch. \n\nThe nature of technical writing often depends on short, choppy sentences. We're not trying to conveny long-winded rhetorical arguments on a tech piece. We aren't shooting for descriptive scenery that has to be spread out over a full page. \n\nHumans can quite easily write like AI, but it is harder for AI to write like \"what we are capable of\". This is because most humans have a level of \"writing sprawl\". We tend to drift off from time to time and include a run on sentece, or an out-of-place structure, or strange vernacular that most AI won't do \"by accident\". \n\nHope this helps.",
          "score": 1,
          "created_utc": "2026-02-14 06:12:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5n8iih",
              "author": "Sweet_Tomato_01",
              "text": "Yeah probably you are right, i get your point. Thank you.",
              "score": 1,
              "created_utc": "2026-02-16 07:12:04",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5cphbe",
          "author": "Aromatic-Log2779",
          "text": "Yeah Mediavine's been cracking down hard on this lately. They've terminated accounts over AI content flags, even when the content was actually human-written . The thing about detectors is they're super unreliable. Studies show accuracy ranges from 14% to 71% depending on the tool . They're especially bad with short text and non-native writing, false positives can hit 20% or higher .\n\nThat's exactly why I started using Rephrasy ai. You run your drafts through it before posting anywhere, and it rewrites everything to sound human. It has a built-in checker that shows you the score, so you know for sure it won't get flagged. I've tested the output against multiple detectors and it passes every time. For your Mediavine concern, that's been my go-to. Way better than hoping your edits are enough or trusting any single detector.",
          "score": 1,
          "created_utc": "2026-02-14 15:31:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ctbtk",
          "author": "AlucardD20",
          "text": "Ai detectors are super unreliable. I found a paper I wrote about 10 years ago for a college class.. I ran it through and got 60 to 80 percent Ai detected on different sites for it. when I know for a factor I wrote it myself.. and it took me quite a bit of time to write it.",
          "score": 1,
          "created_utc": "2026-02-14 15:51:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5e11qu",
          "author": "ParticularShare1054",
          "text": "I've definitely run into the same paranoia, especially after hearing about bloggers getting banned for supposed AI content. It honestly feels like you're gambling, bc one detector says 90% AI, the next one ZERO, even though the article's the same. Lately I just cross-check my stuff with Turnitin, Copyleaks, and AIDetectPlus - those three usually cover all the weird judge-y algorithms. \n\nIt sucks to spend time manually rewording your work, just to please random bot scores, when you already did it yourself. I try not to stress if I know it's my own writing, but I get the Journey/Mediavine pressure. \n\nWhich one gave you the weirdest results? Super curious if there's some trend there with lifestyle content vs. finance posts or whatever. This whole landscape is a headache, lol.",
          "score": 1,
          "created_utc": "2026-02-14 19:31:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5i9uj9",
          "author": "Time-Motor5673",
          "text": "I use Walter AI works good for my purpose",
          "score": 1,
          "created_utc": "2026-02-15 13:55:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5kj4az",
          "author": "lasan0432G",
          "text": "No. I just draft in Writtte, and use my own AI styles to refactor some parts, sometimes. And check grammar using its built-in grammar checker. and then I publish",
          "score": 1,
          "created_utc": "2026-02-15 20:46:39",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r4dk6a",
      "title": "how many articles per day is ideal for the website from an SEO perspective?",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1r4dk6a/how_many_articles_per_day_is_ideal_for_the/",
      "author": "Material_Librarian32",
      "created_utc": "2026-02-14 06:38:43",
      "score": 9,
      "num_comments": 34,
      "upvote_ratio": 0.64,
      "text": "Now with AI, I can post a hundred articles per day if I want, but I think Google would penalize.\n\nFor a brand new website, how many articles per day would you recommened?\n\nAlso, is there a specific Google update that talks about this?",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/Blogging/comments/1r4dk6a/how_many_articles_per_day_is_ideal_for_the/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o5avsmk",
          "author": "Huge_Leader_6605",
          "text": "I'm not a SEO expert,  but if you think that flooding multiple articles per day will somehow help you, I think you will be disappointed.",
          "score": 27,
          "created_utc": "2026-02-14 06:46:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5j05j1",
              "author": "Spirited_Manager_831",
              "text": "yep, 0 quality equals disappointing. ",
              "score": 1,
              "created_utc": "2026-02-15 16:15:16",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5awmvz",
          "author": "notoverthinking",
          "text": "Quality> quantity",
          "score": 16,
          "created_utc": "2026-02-14 06:54:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5ex4mp",
              "author": "CautiousTomato6134",
              "text": "Just writing content for content's sake isn't going to win. Google is smart. Do thorough keyword research, come up with new ideas that you can talk about to become an authority in the space and to build topical authority around topic clusters. THIS is what works, not volume. Volume is going to definitely get you flagged for spam as Google can see right through that for a brand new website. Do you think it looks \"normal\" for a brand new website to be pumping out tons of content every single day? Nope. \n\nI think a good rule of thumb is to post 1-3 times per week on a brand new site as that looks \"real.\"",
              "score": 1,
              "created_utc": "2026-02-14 22:26:25",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5drg07",
          "author": "Potential-Revenue501",
          "text": "please write the articles yourself and not rely on AI to make them. quality > quantity.",
          "score": 5,
          "created_utc": "2026-02-14 18:42:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5hzz6w",
              "author": "SevdaSevinu",
              "text": "This! Thank you. Whole internet is full of AI rubbish!!!",
              "score": 1,
              "created_utc": "2026-02-15 12:50:24",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5bar7u",
          "author": "exciting_username_",
          "text": "Please DO NOT put out even more AI slop into the world. If AI can generate it for you, why can't AI generate that directly for the user? Google even integrated their own AI chat in search now.\n\nAlso it will basically turn readers against you, because NO ONE LIKE TO READ AI SLOP. That's bad for business. \n\nI insisted on producing high quality articles that are admittedly human-intensive, and our traffic climbed steadily after Google started to purge traffic to the AI slop. Focus on content that converts.",
          "score": 10,
          "created_utc": "2026-02-14 09:09:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5db6d5",
              "author": "bluejaydreamer",
              "text": "I agree that AI slop articles aren’t great, but each user destroying the environment by AI-generating the same answers over and over again isn’t great, either…\n\nNobody likes to read AI slop! Not generated themselves or by others. No more AI slop, period.\n\nIt’s better to write a decent, human answer (even if it’s simple) that someone can find in a Google search.",
              "score": 2,
              "created_utc": "2026-02-14 17:21:36",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5dfrzg",
                  "author": "exciting_username_",
                  "text": "I agree with you, unfortunately now Google does the AI summary automatically. Also even many of the human written SEO content before were not great honestly.",
                  "score": 1,
                  "created_utc": "2026-02-14 17:44:57",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5b58s9",
          "author": "madhuforcontent",
          "text": "There are no such specific numbers available. For a new website, start with 3 posts per week and increase upto 6 posts after 3 months. Unedited and unverified mass AI content publishing can pose Google risks. Stick to your niche. Focus on publishing helpful quality content aligned with search intent and after doing effective keyword research. Go for GSC data based content refinement after 6 months. ",
          "score": 2,
          "created_utc": "2026-02-14 08:15:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5c9brd",
          "author": "Background-Pay5729",
          "text": "ngl if you dump 100 articles a day on a fresh domain you're just asking for a manual action. google doesn't have a hard limit on numbers but they definitely look at patterns. if a site with zero authority suddenly starts posting like a news wire it's a huge red flag for mass-produced unhelpful content.\n\nthe march 2024 core update basically killed a ton of sites doing exactly this. focus more on quality and maybe do 1-2 a day max if you can actually make them good. quality over quantity is a cliché for a reason, if the content is just generic ai fluff it wont rank anyway lol.",
          "score": 2,
          "created_utc": "2026-02-14 14:00:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5br55f",
          "author": "EquivalentTerrible54",
          "text": "I did a test, new domain and published. hundreds of extremely shitty AI articles per day. They were formated: ”what happens if XXXX”. So basically an article for every scenario, AI went crazy and said everything lands you in prisons, but it ranks so well! Just now kids who google what happens if they don’t do their homework will think that they will be arrested….\n\nMy point it, i spammed terrible content and it ranks. So I don’t think there is an ideal.",
          "score": 3,
          "created_utc": "2026-02-14 11:47:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5axoby",
          "author": "cmhbob",
          "text": "How many quality articles within your niche can you produce on a regular basis? And by quality, I mean well-researched *and* well-written. \n\nWhat *is* your niche, anyway? What makes you an expert in that field? Why should people spend five minutes on your site reading what you have to say? \n\nAnd keep in mind that generative AI hallucinates. That means it makes shit up. So even if you can come up with the right prompts to create 50 articles a day using generative AI, you can't publish 50 articles a day. You need to fact-check everything that your chosen generative AI client produces before you throw it up on the web and put your name on it.\n\nOne or two well-researched *and* well-written articles per week is going to get you a much more dedicated readership than a dozen pieces of generative AI crap.",
          "score": 2,
          "created_utc": "2026-02-14 07:04:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5b4uva",
          "author": "Daily_Learn_English",
          "text": "There’s no fixed number. Google doesn’t penalize you for posting a lot, it penalizes low-quality content.\nFor a new website, focus on quality and consistency.\n1 high-quality post per day or 3–5 per week is enough.\nHelpful Content and Core Updates focus on value, not publishing frequency.👍",
          "score": 2,
          "created_utc": "2026-02-14 08:11:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5bzojp",
          "author": "Lady-BlackSmith",
          "text": "People are seeking human written content, you can have tons of ai generated content but if doesn’t connect with the humans looking for it your site won’t get anywhere, \nif they wanted to learn from ai they’d just open up ChatGPT, they are looking for a blog because they want to learn from a human, \nwrite the content yourself get better at building a community that likes how you think, how you speak, and how you tell a joke etc, ai won’t do that for you and you’d be surprised to learn a lot of readers are sticking around for those human bits of blogs",
          "score": 2,
          "created_utc": "2026-02-14 12:56:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5b8t91",
          "author": "iamrahulbhatia",
          "text": "Even 1–2 well-researched posts a day is plenty.",
          "score": 1,
          "created_utc": "2026-02-14 08:50:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5b9h5c",
          "author": "SingerLuch",
          "text": "Based on my blogging experience, a high-quality post can land you 50 visitors a day, that translates to 50×30=1500 visits a month. – – however a post which you yourself would not read if it was not written by you will get you one or two visitor per day, which translates to only 30 visits per month. One strategy is to flood your website with posts each one performing less, but it doesn’t work because with high-quality post you get so many other indirect boosts such as people linking to your content people sharing your content and so on that you will never get from low quality content.",
          "score": 1,
          "created_utc": "2026-02-14 08:56:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5con2j",
          "author": "CrowneeVlog",
          "text": "Nothing like this! Quality matters than quantity!",
          "score": 1,
          "created_utc": "2026-02-14 15:27:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ct1mj",
          "author": "Vinaya_Ghimire",
          "text": "You can publish as many as you can, provided that are original, unique, and well written. From SEO perspective, you need gigh quality, human written articles. However, if you are publishing 100 percent AI generated articles, Google will certainly penalise.",
          "score": 1,
          "created_utc": "2026-02-14 15:50:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5er5vr",
          "author": "TextResponsible7825",
          "text": "Take your time in finding real problems that people ask about in your niche, you will find yourself posting a maximum of two articles",
          "score": 1,
          "created_utc": "2026-02-14 21:53:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5f2kfn",
          "author": "Original-Measurement",
          "text": "I feel like if you're writing more than one article a day, either you're a supernaturally fast writer or you're just going to be putting out AI material.\n\n\nTo be clear, Google has no strict rules against AI. The main issue is that AI just takes from information that already exists, and if it already exists, Google already has it. Also human readers are likely to bounce, which will affect your user signals. So the odds of ranking are pretty low.",
          "score": 1,
          "created_utc": "2026-02-14 22:57:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5g7y5d",
          "author": "ghwrites",
          "text": "Eventually it comes down to readers. If you offer quality, even Google won't suppress your reach. \n\nBetter focus on adding quality. You might even feel satisfied with 5-7 weekly articles, and even less. \n\nIt's all about quality.",
          "score": 1,
          "created_utc": "2026-02-15 03:26:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5japij",
          "author": "r_mansoori",
          "text": "I think that depends on you. Persnally if I am starting a new website, I'll try to cover my niche as soon as possible. But believe it or not, starting a blog means you have to post a lot of content.\n\nAnd yes, your articles must be of good quality. But you have to move faster. Instead of wasting time for perfect post.",
          "score": 1,
          "created_utc": "2026-02-15 17:06:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5jw7vo",
          "author": "Suspicious_Ad7948",
          "text": "1 article per week is the sweet spot ",
          "score": 1,
          "created_utc": "2026-02-15 18:50:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5l011w",
          "author": "USANerdBrain",
          "text": "One per day but take the weekends off",
          "score": 1,
          "created_utc": "2026-02-15 22:13:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5mordf",
          "author": "John54601",
          "text": "Even with the help of AI, producing 100 articles a day is a daunting task. Ultimately, Google prioritizes meaningful content. While AI is capable of generating quality text, it lacks the human touch that search engines are increasingly trained to recognize.",
          "score": 1,
          "created_utc": "2026-02-16 04:30:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5bd3kb",
          "author": "AEOfix",
          "text": "Two a month is fine. One new post every crawl. Google did just put out a update. Read about it in r/SEO_AEO_GEO",
          "score": 1,
          "created_utc": "2026-02-14 09:33:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5bpdjd",
          "author": "Forsaken-Pain2594",
          "text": "A hundred articles a day with AI? That's really not going to help you, I think.",
          "score": 1,
          "created_utc": "2026-02-14 11:31:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ax8z4",
          "author": "Siddharth1India",
          "text": "I am doing one blog per day, but those are detailed guides rather than shallow generic slop. They are also been written by AI but with process which takes lot of checks and data at every step.",
          "score": -5,
          "created_utc": "2026-02-14 07:00:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5azqp5",
          "author": "dwoodro",
          "text": "I think you're looking for the Holy Grail, and it won't exist.\n\nHere's why: It depends on many factors.\n\nSites like Reddit get thousands of new pages each day. A new blog, most likely won.t, but could it, yes.\n\nThe problem won't officially be the number of posts, but Google will know that 1000 posts, with zero traffic, won't be organic growth. This is the issue right here. They know it's not human generated content from viewers.\n\nNow, can a business post 100 pages a day? Sure. But they will also look to see if you \"are an active business\", vs \"Joe blogger\". In this situation, a business footprint will often include legal addressing, a valid phone number, a legal structure like an LLC, etc. Google will look at this info as authoritative, and this will help. But not likely enough.\n\nIf you are building the next Facebook or Reddit, then make sure you get users to post; that would be better. If it goes viral, and people keep dropping 100 posts a day, Google will show the love.\n\nIf you're not there yet, then there is a mix of \"quality and quantity\". This is based on factors such as the topics you write, the overall niche, and other issues.\n\nI have 5 articles on a website that are a total of about 100 pages of written content across 5 long-form topics. Those are quality contents. At no point are these articles likely to be read by people, because It took forever to write them, let alone reading. and the topics are dry, academic, and mostly for documentation.\n\nThen the site also gets regular article-type posts that cover a more normal bite sides, 800-1500 words per article. These are specifically meant to be read by \"the average attention deficit, dopamine-starved reader\".\n\nNow, depending on the goal, this matters. Google sees my site. sure. But Google seeing it and traffic are different issues. Building authority is harder, takes more time, and requires more stringent controls. If you want virality, you could just post potentially clickbait or hyperbolic content and get clicks. So, intent and long-term goals determine your content plan as well.",
          "score": 0,
          "created_utc": "2026-02-14 07:23:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5b1hr7",
              "author": "ziangsecurity",
              "text": "Very well said",
              "score": 0,
              "created_utc": "2026-02-14 07:40:00",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r240wz",
      "title": "Want to help 10 bloggers get more reader questions",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1r240wz/want_to_help_10_bloggers_get_more_reader_questions/",
      "author": "thinkneo",
      "created_utc": "2026-02-11 17:42:17",
      "score": 7,
      "num_comments": 5,
      "upvote_ratio": 1.0,
      "text": "Engagement on blogs is brutal. You write solid content, people read it, then... nothing. Comments are dead, and most readers won't type out a question even if they have one.\n\nI had the same problem with my finance blog. Realized people have questions while they're reading, not after - and by the time they finish, they've moved on.\n\nBuilt a way for readers to ask questions right inside the post and get instant answers. Turns passive readers into actual conversations.\n\nHas anyone found a way to get readers to actually engage with posts instead of just reading and bouncing? Curious what's working for others.",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/Blogging/comments/1r240wz/want_to_help_10_bloggers_get_more_reader_questions/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o4u7vnl",
          "author": "Zealousideal_Tune_4",
          "text": "Hi, i have a blog on aviation https://www.aviationtitans.com/, but i don't have much readers, can you tell me how to improve it in order to get more readers please ?\nThank you .",
          "score": 2,
          "created_utc": "2026-02-11 18:06:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4uep54",
              "author": "thinkneo",
              "text": "Hey, just checked out [aviationtitans.com](http://aviationtitans.com) \\- you've got solid content, especially the NDT and MRO stuff. That's a niche with real demand. A few things that could help with traffic:                                                                                                                                                                                         \n\nSEO quick wins:                                                                                                                                                                      \n\n  \\- Your post titles are good but long. Make sure you're writing custom meta descriptions for each post - that's what shows up in Google results and gets the click.\n\n  \\- Link between your own posts more. If you mention NDT certifications in one article, link to your career/salary post. Google loves internal links and readers stay longer.          \n\nContent strategy:                                                                                                                                                                    \n\n  \\- You're posting every 2-3 days which is great. But consider creating 2-3 \"pillar\" guides - like \"Complete Guide to Aviation NDT Careers\" - then link all your smaller posts back to  those. That's how you rank for bigger keywords.\n\nGetting readers:\n\n  \\- Aviation is niche enough that Reddit communities (r/aviation, r/aviationmaintenance), LinkedIn groups, and industry forums could drive real traffic. Share your posts there but add  value in the comments, don't just drop links.\n\n  \\- Your email signup is there but easy to miss. Put it at the end of every post with a reason to subscribe (\"Get weekly aviation industry insights\").\n\n Engagement:\n\n  \\- One thing I noticed - readers probably have follow-up questions about certifications, salary ranges, specific tools etc. but there's no easy way to ask. That's something I've been   working on for my own blog - making it easier for readers to interact with content instead of just reading and leaving.\n\n What's your biggest traffic source right now - Google, social, or direct?",
              "score": 3,
              "created_utc": "2026-02-11 18:37:39",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o4vwyre",
              "author": "Ok_Topic_2993",
              "text": "Just quick feedback - too much advertising. I can barely read anything without clicking away ads. Reduce this. Also you seem to have two different cookie banner, combine into one. Will help a lot to keep people actually reading your blog.",
              "score": 3,
              "created_utc": "2026-02-11 23:00:28",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4vyf5p",
                  "author": "Zealousideal_Tune_4",
                  "text": "Thank you for your feedback, I leave it on auto optimize/ auto ads !!!",
                  "score": 1,
                  "created_utc": "2026-02-11 23:08:10",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4uhirq",
          "author": "Zealousideal_Tune_4",
          "text": "Thank you for your advice I appreciate it",
          "score": 1,
          "created_utc": "2026-02-11 18:50:39",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r1xg5t",
      "title": "Best AI SEO / Blogging tools in 2026?",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1r1xg5t/best_ai_seo_blogging_tools_in_2026/",
      "author": "Much_Smile_",
      "created_utc": "2026-02-11 13:31:13",
      "score": 6,
      "num_comments": 26,
      "upvote_ratio": 1.0,
      "text": "I need to get back to SEO optimization, however I have not done it in a long time and many things seem to have changed.  \nI have been looking into tools like SEO Surfer albeit it is extremely expensive I have considered it if it is good / worth it.   \nI have also seen things like frase or writerzen but overall there seems to be a TON of other tools. \n\nWhat would you recommend?   \nThank you in advance\n\n",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/Blogging/comments/1r1xg5t/best_ai_seo_blogging_tools_in_2026/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o4srdgk",
          "author": "Ok_Revenue9041",
          "text": "If you have not done SEO in a while, focusing on content quality and actual user search intent is way more important now than old keyword stuffing tactics. Surfer and Frase are both solid but pricey. If you are optimizing for future AI platforms too, I would look at MentionDesk since it helps brands get featured on AI answers which is a new SEO angle.",
          "score": 2,
          "created_utc": "2026-02-11 13:50:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4t50kt",
          "author": "calben99",
          "text": "Surfer and Frase are solid but honestly overpriced for most bloggers. If you want to optimize content without the $100+/month cost, try this approach:\n\n1. Use Google's free tools: Search Console shows what queries you're already ranking for, and Keyword Planner (via Google Ads, no spend required) gives search volume data.\n\n2. For on-page optimization, the free version of Yoast SEO or Rank Math does 80% of what Surfer does - checks keyword density, readability, internal linking.\n\n3. The biggest shift in SEO lately is EEAT signals. Focus on author expertise (add author bios with credentials), citations to authoritative sources, and topical depth rather than just keyword stuffing. One comprehensive 2,000-word article beats five thin 500-word posts.\n\n4. For AI content detection concerns (if you're using AI writing tools), make sure to heavily edit and add personal examples/anecdotes. Google's getting better at detecting generic AI content.\n\nSurfer's correlation analysis is nice-to-have but not essential. Start with the free tools and scale up once you're monetizing consistently.",
          "score": 2,
          "created_utc": "2026-02-11 15:02:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ynr1t",
              "author": "MrBilal34",
              "text": "google ads require a company though doesnt it ?",
              "score": 2,
              "created_utc": "2026-02-12 11:10:20",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4tztfa",
          "author": "adifounder",
          "text": "If you genuinely want to grow your blog site, you don't need tools at start, there's already more than enough tools used by bloggers and getting nothing. You just need to focus how you grow your audience because Google is dying you need other source",
          "score": 2,
          "created_utc": "2026-02-11 17:28:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4xiofw",
          "author": "SERPArchitect",
          "text": "In 2026, Surfer SEO for content optimization, and Ahrefs/Semrush for research and backlinks. If you’re restarting, begin with Search Console + solid on-page SEO, then layer AI tools once traffic and revenue grow.",
          "score": 2,
          "created_utc": "2026-02-12 04:54:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4y50m5",
          "author": "Siddharth1India",
          "text": "You may wanna try [https://llamarush.com/](https://llamarush.com/)  \nIt is AI SEO automation focused on GSC data for strategy as well as content writing",
          "score": 2,
          "created_utc": "2026-02-12 08:09:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4yc39b",
          "author": "blazesolstice8901",
          "text": "I’ve personally been leaning on SearchTides agency to help bridge the gap between traditional SEO and this newer AI-driven visibility world. The biggest benefit for me has been having a more structured, strategic approach to optimization, not just tool subscriptions:",
          "score": 2,
          "created_utc": "2026-02-12 09:19:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4yidp5",
              "author": "Ok_Revenue9041",
              "text": "Focusing on strategic approaches for AI search optimization is definitely the move. Beyond classic SEO tactics, it's smart to look at how your content gets picked up by language models and AI platforms. If you want to push visibility even more, MentionDesk has tools designed specifically for getting brands featured across AI answer engines, which is becoming super important now.",
              "score": 2,
              "created_utc": "2026-02-12 10:20:48",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4ygh5p",
          "author": "ImeshaDilshani",
          "text": "Can you giys share free SEO tools.",
          "score": 2,
          "created_utc": "2026-02-12 10:02:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ytn59",
          "author": "Snaddyxd",
          "text": "SEO has shifted big time, and ai search is where the action is now. Surfer/Frase are good for traditional SEO, but you might be missing half the picture if you're not optimizing for ChatGPT, Claude, etc.   \n  \nYou can start with Search Console + free Yoast, then add something like limyai that is helping us to track traffic from llms. It crawls our content, and we get to see which prompts are working and which ones are not.  Most tools ignore AI visibility completely. What's your main content focus?",
          "score": 2,
          "created_utc": "2026-02-12 11:59:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4yvhp3",
              "author": "Ok_Revenue9041",
              "text": "Tracking how your content shows up in AI chatbots is super important now since traditional SEO tools usually miss that visibility. Tools that monitor LLM prompts and surface insights are game changers. For actually optimizing your brand to get picked up by ChatGPT or Claude, MentionDesk has an answer engine optimization feature that gives you a direct edge in AI driven search discovery.",
              "score": 2,
              "created_utc": "2026-02-12 12:13:01",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o50i2y5",
          "author": "Nicolas_JVM",
          "text": "For SEO and blogging tools, fwiw I've found a combo approach works best. Ahrefs is solid for comprehensive data, and SEMrush is great for broader analysis, but for keyword research specifically, I really like kwrds.ai. It uses AI clustering to uncover content gaps that competitors miss, which is super helpful for finding unique angles. If budget's a concern, it's also more affordable than some of the big names out there.",
          "score": 2,
          "created_utc": "2026-02-12 17:22:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o520kvm",
          "author": "bigpurpleoctopus",
          "text": "You must try https://www.growmore.website , found it on product hunt",
          "score": 2,
          "created_utc": "2026-02-12 21:40:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4wikdj",
          "author": "BrainySpud",
          "text": "checkout [RankPost.com](http://RankPost.com) you can get some free usage to generate blogs and check scores. just a starting point",
          "score": 1,
          "created_utc": "2026-02-12 01:03:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4xplt9",
          "author": "claudyus777",
          "text": "Use AI, then do your own edits. Add personal touch=success",
          "score": 1,
          "created_utc": "2026-02-12 05:48:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o531p21",
          "author": "Few-Mud-5865",
          "text": "I believe those SEO / GEO tools might help, but what's more important is to create higher quality content, possibly with AI as an assistant? Why stick to search for SEO / GEO tools? Why not try to find a good content creation tool (AI powered), gradually improve SEO / GEO with contents?",
          "score": 1,
          "created_utc": "2026-02-13 01:01:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5576xz",
          "author": "contextform",
          "text": "Honestly, the landscape has shifted a lot since Surfer first came out. Traditional SEO tools focus on ranking in Google, but more people are getting answers directly from ChatGPT and Claude now.\n\nStrategically, you need to make sure your content is readable by AI agents, not just human searchers. We have been using Mersel AI recently and it has been pretty solid. It creates an AI friendly version of your site that LLMs can actually digest, with no code changes to your existing website. They also handle blog content writing, which saves a lot compared to most enterprise tools.\n\nIf you are looking for a done for you service at a reasonable price, it could be a good option.",
          "score": 1,
          "created_utc": "2026-02-13 10:58:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o56b8gp",
          "author": "Unlikely-Scholar5575",
          "text": "There is too much noise. But [https://airticler.com](https://airticler.com) is worth trying.  \nAutomates brand-align content and link building.",
          "score": 1,
          "created_utc": "2026-02-13 15:07:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o57oj32",
          "author": "unicorn69love",
          "text": "surfer and frase are solid but way too manual and expensive for what they do imo. nextblog ai handles the whole seo game on autopilot keyword hunts, competitor gaps, full posts optimized for google + ai search, even auto-publishes to wordpress. been using it and its brutally efficient if you hate grinding content",
          "score": 1,
          "created_utc": "2026-02-13 19:04:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o58yjkp",
          "author": "bigpurpleoctopus",
          "text": "https://www.growmore.website haa some crazy features!",
          "score": 1,
          "created_utc": "2026-02-13 22:55:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5cmros",
          "author": "AEOfix",
          "text": "Me",
          "score": 1,
          "created_utc": "2026-02-14 15:17:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5mh4g1",
          "author": "BrainySpud",
          "text": "You need a content plan. What are you using for your blog currently? \n\nI built a tool that helps you build a content plan and generate the needed articles. I’m looking for beta testers. Would love to have you if you’re interested",
          "score": 1,
          "created_utc": "2026-02-16 03:37:10",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r1px6x",
      "title": "Do you manually check affiliate links on old posts?",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1r1px6x/do_you_manually_check_affiliate_links_on_old_posts/",
      "author": "Muted-Picture-1151",
      "created_utc": "2026-02-11 06:29:27",
      "score": 4,
      "num_comments": 9,
      "upvote_ratio": 1.0,
      "text": "For those doing affiliate blogging:\n\nHow do you handle old posts where links might break, go out of stock, or change landing pages?\n\nDo you manually audit them every few months?  \nUse a plugin?  \nOr just ignore it?\n\nI’m wondering if this is even a real pain point or if most bloggers already have a solid system.\n\nCurious how you handle it.",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/Blogging/comments/1r1px6x/do_you_manually_check_affiliate_links_on_old_posts/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o4ra0wr",
          "author": "PicklePuzzleheaded96",
          "text": "you can use redircetion plugin, so you can manage your affiliate link with redirection. It would be easy to handle, and you no need to change the landing page.",
          "score": 2,
          "created_utc": "2026-02-11 06:34:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4raoqa",
              "author": "Muted-Picture-1151",
              "text": "That makes sense for managing URLs.  \nBut does that catch things like:\n\n* product going out of stock?\n* affiliate ID not tracking?\n* merchant changing landing page?\n\nOr do you manually check those?",
              "score": 2,
              "created_utc": "2026-02-11 06:40:28",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4rch8o",
                  "author": "PicklePuzzleheaded96",
                  "text": "In that case, you’ll need to check manually. Sometimes affiliate marketing platforms do notify you when a product is discontinued or when an affiliate program changes, but this isn’t always guaranteed.",
                  "score": 2,
                  "created_utc": "2026-02-11 06:56:16",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4yh9s6",
          "author": "Vinaya_Ghimire",
          "text": "These days I don't not add any affiliate links in my posts. However, in the past I used to add 1-2 affiliate links on every posts. I have now manually removed all affiliate links.",
          "score": 2,
          "created_utc": "2026-02-12 10:10:15",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r29tos",
      "title": "Should Youtube video and blog post on the same topic have the same keywords and title?",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1r29tos/should_youtube_video_and_blog_post_on_the_same/",
      "author": "Physical_Zucchini103",
      "created_utc": "2026-02-11 21:13:35",
      "score": 3,
      "num_comments": 5,
      "upvote_ratio": 0.81,
      "text": "We've just invested in some great YouTube SEO with topic and keyword planning all ready to go, and the topics seem perfect for blog posts too. \n\nWe want the blog posts to expand on the YT vids, which are gonna be short and sweet. I assume both YT vid and corresponding blog should share at least the primary KW, but should the titles of each be the same, too - or slightly different? Maybe targeting slightly different search and language tendencies for YT vs blog/reader audiences?",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/Blogging/comments/1r29tos/should_youtube_video_and_blog_post_on_the_same/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o4vdilm",
          "author": "bluehost",
          "text": "Using the same primary keyword makes sense, especially if the blog is expanding on the video. The difference is usually in intent. On YouTube, titles often perform better when they are benefit driven or curiosity based. On a blog, a slightly more direct, search friendly version can work better.\n\nThink of them as covering the same topic from two angles. Same core keyword, different phrasing based on how people behave on each platform.",
          "score": 2,
          "created_utc": "2026-02-11 21:24:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4veute",
              "author": "Physical_Zucchini103",
              "text": "That makes sense, thank you!",
              "score": 2,
              "created_utc": "2026-02-11 21:30:23",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4vlow0",
                  "author": "bluehost",
                  "text": "Glad it helps. You're thinking about it the right way. When the video and post support each other instead of copy each other, that's where the real leverage kicks in.",
                  "score": 1,
                  "created_utc": "2026-02-11 22:02:50",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4zl5v0",
          "author": "NoBadger7405",
          "text": "Yes, both the YouTube video and blog post should use the same main keyword since they cover the same topic. But the titles don’t need to be exactly the same. It’s better to slightly change the title to fit the platform, like making it more catchy for YouTube and more clear for the blog.",
          "score": 1,
          "created_utc": "2026-02-12 14:45:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o50bztf",
              "author": "LuckyRubberDuckie",
              "text": "That’s a great point about tailoring the title to the platform, makes total sense.",
              "score": 1,
              "created_utc": "2026-02-12 16:53:50",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r1fl78",
      "title": "Should I separate the types of content I publish?",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1r1fl78/should_i_separate_the_types_of_content_i_publish/",
      "author": "darcysjustagirl",
      "created_utc": "2026-02-10 22:36:47",
      "score": 3,
      "num_comments": 3,
      "upvote_ratio": 0.81,
      "text": "I’ve recently started my adventure into blogging and it’s been really enjoyable. I’ve ran into a problem, though, with where to publish my work and if I should keep certain things separate.\n\nI initially started my blog as just a hobby. My posts are for self expression. They’re silly and fun reads and there’s not really a consistent theme. The website design is not professional. It’s pastel, cutesy, and very old-web. And my main concern is that some of my posts contain some excessive swearing, and I also tackle some mature themes related to mental health and being queer.\n\nThe next post I’m working on is actually looking to be quite well made. I’m really proud of what I’ve done because it’s taken a good bit of research. I plan on writing more articles like it and I feel like if I continue to pursue these articles I could build myself a nice portfolio.\n\nBut that’s the problem. I worry that these two types of content clash with each other and that the “unprofessional” and “unclean” stuff could harm a portfolio. Should I separate my high-effort articles entirely from my other writing? Where should I publish stuff that’s high-effort? Thankfully I started my current platform under a pen name but I don’t love the idea of managing two or three personas. ",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/Blogging/comments/1r1fl78/should_i_separate_the_types_of_content_i_publish/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o4p8wmp",
          "author": "bluehost",
          "text": "It sounds like you've accidentally built two kinds of writing, and that's not a bad thing. Your current blog already has a job. It's personal, playful, and expressive. That doesn't make it unprofessional, it just means it isn't meant to be a portfolio.\n\nFor the higher effort pieces, you don't need a whole second identity. You can keep the same pen name and just treat those as selected work. A separate section or page is often enough. \n\nYou can always move or collect those pieces later. The important thing is to keep writing in the place that feels comfortable right now.",
          "score": 2,
          "created_utc": "2026-02-10 22:46:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4si4ff",
          "author": "Strong_Teaching8548",
          "text": "this is the classic \"personal brand vs creative outlet\" tension and i think you're overthinking it a bit. the swearing and mental health posts aren't gonna tank your portfolio if they're well-written, but here's the thing: your high-effort researched pieces are fundamentally different from your self-expression stuff in terms of intent and audience\n\nyou don't need separate personas, just separate sections. keep everything under one roof but create clear categories or a distinct portfolio page that showcases just your research-heavy work. readers (and potential employers/clients) are smart enough to understand that a person can write both reflective essays and silly posts. what they care about is whether the portfolio pieces demonstrate actual skills\n\nthe pastel cutesy design actually works in your favor here if you lean into it intentionally. it signals personality and authenticity rather than looking sloppy. just make sure your researched articles are presented clearly within that aesthetic\n\nso yeah, publish everything on your current platform but organize it so serious stuff is easy to find and highlight. managing multiple sites is way more work than managing one site with good navigation :)",
          "score": 2,
          "created_utc": "2026-02-11 12:55:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4p9efv",
          "author": "Captlard",
          "text": "Can you not have two categories/tags that seperate them?",
          "score": 1,
          "created_utc": "2026-02-10 22:49:11",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r5uilv",
      "title": "How does one prepare for AI and write for GEO (not just SEO)?",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1r5uilv/how_does_one_prepare_for_ai_and_write_for_geo_not/",
      "author": "ulcweb",
      "created_utc": "2026-02-16 00:12:36",
      "score": 3,
      "num_comments": 10,
      "upvote_ratio": 0.8,
      "text": "Now I'm a blogger with a site that has nearly 900 posts, and have been doing it for over a decade. Although SEO has changed so much, and I am still not sure if I correctly grasp how to handle AI engine optimization.\n\nGranted I know many of you might complain about AI, let's put that to the side for now, as I understand your pov and I sympathize.\n\nWhen I say prepare for AI there are two scenarios:\n\n1. Editing the robots.txt file to prevent an AI from scrape your site\n2. Preparing your site TO be scraped, so that you can encourage more traffic to your site.\n\nGiven my tech topics I discuss a lot, and PKM etc. I actually get some really relevant leads from chatbots because I ranked high enough in those topics. Now I would get a lot more if I optimized better I think.\n\nJust wanted to start a positive discussion on this, and if you have any tips. Whether it is for the preventing crowd, or the growth focused crowd. Either would be really appreciated!",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/Blogging/comments/1r5uilv/how_does_one_prepare_for_ai_and_write_for_geo_not/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o5lxl5f",
          "author": "gptbuilder_marc",
          "text": "That’s the fork.\n\nThis isn’t really AI versus SEO. It’s whether you see AI crawlers as something to block, or something to design for.\n\nAre you trying to defend existing search traffic, or restructure content so LLMs surface you more often? Those lead to very different moves.",
          "score": 3,
          "created_utc": "2026-02-16 01:29:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5m1pp8",
              "author": "ulcweb",
              "text": "Yeah thats the point of this discussion. I'm more for growth, simply because I don't want to fight the river if you know what I mean.",
              "score": 1,
              "created_utc": "2026-02-16 01:56:28",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5lyqhi",
          "author": "tench87",
          "text": "I gibe a damn on AI and Just write because the Tech Giants change the rules faster when i could adjust. Even the rules they taught yesterday are worthless today.\n\nI do basic SEO and write for my audiance, never again for bots.",
          "score": 2,
          "created_utc": "2026-02-16 01:37:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5m9aix",
          "author": "100_days_away_blog",
          "text": "With AI, I am finding I do get some traffic through to my blog, but it always surprises me. When I personally use AI I almost never follow a link through to a source, as the things I am asking it don’t warrant it. If I want a source I would google search.",
          "score": 2,
          "created_utc": "2026-02-16 02:45:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5mxdm7",
              "author": "ulcweb",
              "text": "Ironically I'm the opposite, if I try google I tend to have to scour for a link, often opening search/images/videos/news tabs each to find the relevant item. But the ai does a good job finding them usually. Or at least gets me started on a side rabbit hole :D",
              "score": 2,
              "created_utc": "2026-02-16 05:36:16",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5n02mo",
                  "author": "100_days_away_blog",
                  "text": "That’s probably why I get traffic for like minded people !",
                  "score": 2,
                  "created_utc": "2026-02-16 05:58:34",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5mwq32",
          "author": "Far_Move2785",
          "text": "Solid question about AI and content. Honestly though, most bloggers are missing a bigger conversion killer.\n\nThis might not be your exact problem but I had huge conversion issues too. Turned out most of my drop off was from in-app browsers.\n\nWhen people click ads on Instagram/Facebook/TikTok they land in those app browsers and those things are terrible for checkout. No credit card autofills, no Apple Pay, and way slower.\n\nMy conversion was 1.2% in those browsers vs 4% in Safari.\n\nFix was routing people to their real browser before checkout. Saw 15% revenue lift from same ad spend.\n\nCheck your analytics for conversion by browser. If Instagram or Facebook is way lower than Safari that's your leak.\n\nhttps://tryhoox.com handles the redirect automatically if you want to test it",
          "score": 2,
          "created_utc": "2026-02-16 05:31:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5lr39v",
          "author": "Ok_Revenue9041",
          "text": "Focusing on clear, concise answers with relevant keywords really helps AI models pick up your content. Also, organizing your posts in a Q&A style tends to make them more visible in chatbot results. If you want to streamline optimization for these AI engines, MentionDesk actually offers tools specifically designed for this purpose. Makes it easier to get noticed where AI is curating knowledge.",
          "score": 1,
          "created_utc": "2026-02-16 00:49:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5lrj2d",
          "author": "mantic59",
          "text": "You're thinking about this the right way by separating the two goals--they're completely different strategies.\n\nBlocking scraping is a control decision. Preparing to be scraped is a visibility decision.  Some people mix them. I go the visibility route with the 2 blogs I have (one long-established, the other brand new).\n\nIf you're in the growth focused camp, I would think less about “AI optimization” and more about “canonical clarity.”\n\nAI systems tend to surface pages that:\n\n* Clearly define a concept\n* Use direct, unambiguous language\n* Structure ideas in logical sections\n* Answer the core question early\n* Avoid fluff or rhetorical detours\n\nIn other words, they favor pages that read like reference explanations rather than personality-driven essays.\n\nHere are a few practical things that have worked well for my long-running site:\n\n1. Put the definition up front - If the article answers “What is X?” then define X in the first few paragraphs in plain language.\n\n2. Use clean structural hierarchy - H2s and H3s that are concept based, not clever. Think “Causes,” “How It Works,” “Common Mistakes,” “What To Try.”\n\n3. Remove ambiguity - AI systems struggle with implied context. Replace “this” and “that” with explicit nouns. Shorter subject verb object sentences help.\n\n4. Create calibration pages - Instead of chasing trends, build foundational explanations that other articles internally link to. These become anchor references.\n\n5. Reinforce topical depth - If you have 900 posts, look for clusters where you can tighten internal linking around core concepts. AI retrieval systems seem to reward consistency and reinforcement.\n\nOn the blocking side, robots.txt alone does not guarantee much anymore. Some models respect it, some don't. Blocking can reduce exposure but also reduces the chance of being cited.\n\nSo the real question is strategic: are you trying to prevent your content from training models or are you trying to become the explanation models quote?\n\nThose are different long term bets.\n\nPersonally, for mature sites with deep archives, I would focus on becoming the cleanest explanation in your niche. The more your content reads like a durable reference instead of a reaction to the algorithm of the month, the more likely it is to surface in AI driven contexts.\n\n[Yes, ChatGPT helped me write that reply, but it wasn't just copy/paste.  I figured why not get the opinion \"straight from the horse's mouth\" as it were....]\n\nI started going \"all in\" late last year.  My GSC stats for the long-established site went from about 80K impressions/day in Dec. '25 to 270K impressions/day last I looked a few days ago.  The new site is still \"finding its legs\" so there's not enough data yet.\n\nCurious what niche you are in. That can change the calculus quite a bit.",
          "score": -1,
          "created_utc": "2026-02-16 00:51:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5lv9xr",
              "author": "ulcweb",
              "text": ">look for clusters where you can tighten internal linking\n\nI think this is something I need to focus on more. Its not that I haven't done it, but maybe going forward I can make more compilation posts, that help link things together.\n\nI'm a prolific content creator, and so I want my content to be seen. I understand that you really can't block them anymore, and tbh as much as I worry about stolen content. I can just out work the person trying to steal, and make more. Trying to have a positive outlook, trying. lol\n\nMy niche is a funny story, so the main umbrella is knowledge management for polymaths. With that polymathy meta-niche it gives me reign to talk about multiple topics.\n\nPlus since it is a personal brand site too, I get to talk about whatever I want, and since the domain authority has been around so long. I don't think it hurts me as much.\n\nTechnically I have done niche sites, but eventually I brought them into the fold. It just worked better having it all in one place, plus my cms allows for multiple newsletters, and I chose a theme that showcases the various tags super well.\n\nI have about 30 tags on my site, with varied levels of posts in each.",
              "score": 1,
              "created_utc": "2026-02-16 01:15:10",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r0rftc",
      "title": "How recent Google Discover Core Update Effecting Your Website?",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1r0rftc/how_recent_google_discover_core_update_effecting/",
      "author": "SoumyajitGoswami",
      "created_utc": "2026-02-10 04:45:41",
      "score": 3,
      "num_comments": 8,
      "upvote_ratio": 1.0,
      "text": "To the blogger who are / were featuring on the Discover feed.\n\nJust wondering how is the discover core update hitting your website. \n\nPeace ✌️",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/Blogging/comments/1r0rftc/how_recent_google_discover_core_update_effecting/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o4la6dq",
          "author": "vanshika_mishra",
          "text": "Google is changing very fast, don't leave it completely but try to find other way to get traffic",
          "score": 2,
          "created_utc": "2026-02-10 10:10:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4lfdec",
              "author": "SoumyajitGoswami",
              "text": "Thank you.\n\nActually I'm not affected much with the last update.\n\nAlthough I should have been. That's why wondering if anyone affected so far or the update maybe still rolling out.",
              "score": 2,
              "created_utc": "2026-02-10 10:57:34",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4luj8o",
          "author": "Reasonable_Lab136",
          "text": "From what I’ve seen on my niche sites, Discover traffic has been pretty volatile since the latest update. One of my home decor blogs went from getting consistent Discover clicks to almost nothing overnight, then slowly started recovering after about 2 weeks.\nWhat seems to help:\n\t∙\tHigh quality featured images (Discover is very visual)\n\t∙\tEngaging titles that aren’t clickbaity\n\t∙\tFresh, original content rather than generic listicles\n\t∙\tE-E-A-T signals on the site\nThe biggest takeaway for me: don’t rely on Discover as your main traffic source. It’s a nice bonus when it hits, but it’s too unpredictable to build a strategy around. Focus on organic SEO and treat Discover traffic as a cherry on top.\nHow’s your experience been? Did you see a sudden drop or gradual decline?",
          "score": 2,
          "created_utc": "2026-02-10 12:53:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4m4dv6",
              "author": "SoumyajitGoswami",
              "text": "Thank you for sharing your experience.\nIn both my blogs, I haven't seen noticeable drops so far.\n\nHowever, I have started to update the old articles to align the current algorithm update. I guess I have to wait a few more days to understand the impact.",
              "score": 1,
              "created_utc": "2026-02-10 13:51:07",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4mdrrt",
                  "author": "Reasonable_Lab136",
                  "text": "That’s good to hear you haven’t seen drops! Updating old articles is a smart move regardless - I’ve found that refreshing content every 3-4 months keeps it performing well in both Discover and regular search.\nOne thing that helped me when updating: adding fresh images and updating any outdated info or stats. Google seems to reward genuinely refreshed content vs just changing a few words and the publish date.\nHope the update works out well for your blogs! 🤞",
                  "score": 2,
                  "created_utc": "2026-02-10 14:41:39",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5birrg",
          "author": "easyedy",
          "text": "I'm wondering how I get on Goggle Discover. Any tips, please?",
          "score": 2,
          "created_utc": "2026-02-14 10:28:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5cjrc2",
              "author": "SoumyajitGoswami",
              "text": "If you are starting fresh, then the most important part will be Niche research.\n\nTry to find a less competitive or comparatively fresh niche that is trending or will be trending. This will be very critical part.\n\nOnce you find your niche, then start producing quality content. Add interesting title, headings and featured image. And post at least 3-5 times a day. \n\nNow, no one can guarantee that you will feature on Discover feed. However, from my experience these processes help.\n\nHowever content quality is a must now. So better pick a niche that you can actually stick to.",
              "score": 1,
              "created_utc": "2026-02-14 15:01:03",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    }
  ]
}