{
  "metadata": {
    "last_updated": "2026-01-31 16:49:57",
    "time_filter": "week",
    "subreddit": "Blogging",
    "total_items": 19,
    "total_comments": 141,
    "file_size_bytes": 157473
  },
  "items": [
    {
      "id": "1qokeco",
      "title": "How Do You Build a Meaningful Blog Without a Narrow Niche?",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1qokeco/how_do_you_build_a_meaningful_blog_without_a/",
      "author": "Unhappy-Bath1214",
      "created_utc": "2026-01-27 17:30:01",
      "score": 26,
      "num_comments": 13,
      "upvote_ratio": 0.94,
      "text": "I’m looking for some genuine advice from people who have experience with blogging.\n\nI recently started a blog called thinkablemom.com. So far, I’ve published only one post, and I’m feeling a bit stuck. My biggest struggle right now is narrowing down the niche and understanding what I should really focus on writing about.\n\nMy vision is to build a peaceful place where anyone can come, read, think, and feel grounded. I don’t want the blog to be about my personal life, daily routines, or diary-style content. I also don’t want to do product reviews or push affiliate-heavy content. I’m not interested in trends that feel forced or shallow.\n\nWhat I do want is meaningful, useful, thoughtful content. Things people can read quietly, reflect on, and maybe come back to when they need clarity or perspective. The problem is figuring out how to structure that into a clear niche that can still grow.\n\nIf you’ve been in a similar situation, how did you downsize your niche without boxing yourself in? What types of content helped you grow while staying true to your values?\n\nI’m also curious about tools. What tools did you use to scale or speed up content creation without losing quality? AI tools, writing workflows, planning systems, anything that genuinely helped you stay consistent.\n\nMy blog runs on Ghost, in case that matters.\n\nAny honest advice, insights, or lessons learned would mean a lot to me right now. I’m still early in the journey and trying to build something intentional, not rushed.\n\nThank you so much for reading.",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/Blogging/comments/1qokeco/how_do_you_build_a_meaningful_blog_without_a/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o21xjc3",
          "author": "bluehost",
          "text": "A lot of blogs stall not because the writing is bad, but because the writer is trying to name the niche before knowing why someone would come back.\n\nWhat you're describing works better if the niche is a shared reason for reading, not a topic. Something like helping people slow their thinking when things feel noisy or unclear. That gives you room to explore without feeling scattered. The niche usually shows itself through what people reread or save over time.\n\nTool wise, simple helps early. Low friction, a loose outline, and consistency matter more than scaling. If a post feels like something someone might quietly return to, you're probably aligned.",
          "score": 11,
          "created_utc": "2026-01-27 17:37:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o21xxc3",
              "author": "Unhappy-Bath1214",
              "text": "Thanks for insight, its really helping me to understand how to aproach this line.",
              "score": 3,
              "created_utc": "2026-01-27 17:38:49",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o21yld3",
                  "author": "bluehost",
                  "text": "Glad it helped. You're thinking about this the right way already, and that usually matters more than locking anything in early.",
                  "score": 1,
                  "created_utc": "2026-01-27 17:41:44",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o25owb9",
          "author": "adrianmatuguina",
          "text": "I’ve worked with a few blogs that started from almost the exact place you’re describing, and the tension you’re feeling is very real. Wanting to create something calm, reflective, and meaningful often clashes with the internet’s pressure to niche hard, monetize fast, and chase trends.\n\nOne helpful reframe is this: **a meaningful blog does not need a narrow niche, but it does need a clear point of view.** Instead of defining your blog by topic, define it by *lens*. For example, “thoughtful writing about clarity, decision-making, and grounded living” can comfortably include essays on work, relationships, parenting, creativity, or mental space, without turning into a diary or lifestyle blog. Readers return not because of the category, but because of how you help them think.\n\nIn practice, many values-driven blogs grow by organizing content into a few **core themes** rather than a single niche. These might be things like:\n\n* clarity in everyday decisions\n* emotional regulation and inner calm\n* thinking tools for modern life\n* quiet productivity or intentional living\n\nEach post fits one of those themes, which gives structure without boxing you in. Over time, the themes evolve naturally based on what resonates.\n\nGrowth also comes from consistency of *tone* and *depth*. Reflective blogs tend to perform well when posts are timeless, re-readable, and internally linked. You do not need volume; you need coherence. Publishing one thoughtful piece every two to three weeks is often more effective than posting frequently without intention.\n\nOn the tooling side, many writers in this space use AI very lightly, mainly for structure and momentum. Tools like WordHero can help you outline essays, explore angles, or break abstract ideas into clear sections without diluting your voice. If you ever decide to expand into longer, more cohesive projects, such as a themed essay collection or a reflective book, Aivolut Books is useful for organizing those ideas into a structured manuscript rather than a collection of disconnected posts.\n\nMost importantly, you are early, and that is an advantage. You do not need to lock yourself into a niche yet. Focus on writing 5–10 pieces that truly reflect the space you want to create. Once those exist, patterns will emerge, and your “niche” will reveal itself rather than be forced.\n\nWhat you’re trying to build is slower, quieter, and more intentional, and that is exactly why it can matter.",
          "score": 5,
          "created_utc": "2026-01-28 04:35:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o22iozo",
          "author": "LuckyRubberDuckie",
          "text": "One way to approach this is something often called reactive marketing, but not in the loud, trend-chasing sense. In blogging, it can simply mean writing in response to real moments people are already in, instead of trying to predict what will perform. That lets your “niche” be the reason someone needs the post right now, not a narrow topic label. Over time, patterns emerge in what people return to or save, and that naturally shapes focus without boxing you in.\n\nIt’s slower, but it tends to stay aligned with thoughtful, evergreen content.",
          "score": 2,
          "created_utc": "2026-01-27 19:07:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o23w1lw",
          "author": "Neither-Apricot-1501",
          "text": "What if you explore timeless themes like mindfulness, simplicity, or personal growth? Theyre broad but meaningful. For tools, I love Notion for planning and Grammarly for clarity. Keep it authentic!",
          "score": 1,
          "created_utc": "2026-01-27 22:50:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o260d5r",
          "author": "writerapid",
          "text": "Start by researching what people who are broadly in your audience actually search for. You can get a month of Semrush or Ahrefs for $120 or something.",
          "score": 1,
          "created_utc": "2026-01-28 05:54:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o264h68",
          "author": "ContextFirm981",
          "text": "I’d pick one clear umbrella like “calm thinking for overwhelmed moms” and create a few recurring pillars under it (reflection essays, gentle how‑tos, journal prompts), then use simple tools like an editorial calendar like Sugar Calendar + an AI assistant like AIOSEO for outlining to stay consistent while you slowly let the niche refine itself through what you enjoy writing and what readers respond to.",
          "score": 1,
          "created_utc": "2026-01-28 06:26:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2di56v",
          "author": "Silvoote_",
          "text": "You start a bit more broadly and find your niche whilst doing it",
          "score": 1,
          "created_utc": "2026-01-29 07:56:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2hr76s",
          "author": "Salt-Phrase4108",
          "text": "On one of my websites I wanted to write about ai tools but then also graphic design tools.The more I thought,the more ideas came such as education tools etc but they were very unrelated.Some were matketing,some business,some ai...Eventually I just compiled it under a toolkit theme.",
          "score": 1,
          "created_utc": "2026-01-29 22:11:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2s7egx",
          "author": "IndependenceOwn4407",
          "text": "Hi! My advice is don't overthink it. Many of us (including me as a recovering Type A and someone who is neurodivergent) tend to get stuck before we start by overthinking. I have been writing since I was 15 and I am now in my 5th semester of PhD for Psychology and Counseling (Christian counseling/life coaching). I write on topics I've lived through. I have also been in the nutrition, supplement, and fitness space for over 15 years and help business owners get started. In all of that, it's literally the same principles. Regardless if I am educating on business startup, fitness, nutrition, mental health, habit reprogramming, or spiritual strengthening in hard times, it's all about how to take the first step and be consistent. I don't focus on who reads my blogs. I write for me, but I share it with others. That's the only difference. My advice is write for you. We aren't able to share links here, but my DBA is Lady J Empowers. If you would like to connect, please feel free to do so. Take the first step, be consistent, and don't overthink. Those are the 3 things I tell anyone who is stuck in writing, business, health, or spiritual growth. It's really those 3 principles coupled with also not worrying about what others say and following where you are being led. Lead with a good heart and be patient. No one has overnight success. The key is not giving up because it's not going fast enough. If this was something you felt compelled to do, do it for yourself. I hope that helps. Glad to be here amongst other bloggers/writers. We all have a story and no one story is greater than another. Your story matters!",
          "score": 1,
          "created_utc": "2026-01-31 13:06:44",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qohkz5",
      "title": "18K monthly traffic, is adsense worth it or is there something else to try?",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1qohkz5/18k_monthly_traffic_is_adsense_worth_it_or_is/",
      "author": "Frosty-Distance7184",
      "created_utc": "2026-01-27 15:52:23",
      "score": 21,
      "num_comments": 43,
      "upvote_ratio": 1.0,
      "text": "We have a very specific food related niche website. We post around 4 blogs per month. Our traffic is around 15-30k monthly traffic. \n\nI've never personally done any kind of ads like adsense on a website before.\n\nIt is a Wix website FYI. Not sure if that matters for this specifically. \n\n1. Is this enough traffic to implement something like adsense?\n\n2. What kind of money would that bring in with that amount of traffic?\n\n3. Is there something much better than adsense we should do instead?\n\n  \nThanks",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/Blogging/comments/1qohkz5/18k_monthly_traffic_is_adsense_worth_it_or_is/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o21fe83",
          "author": "Salt-Phrase4108",
          "text": "Adsense doesn't have a minimum traffic requirement ,I don't have personal experience but Mediavine and other ad networks are said to earn 4-5 times better than adsense so you can try those.What is your niche?You can do affiliate marketing more actively but it requires strategy. Ads are good passive income though.",
          "score": 8,
          "created_utc": "2026-01-27 16:18:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o21gg62",
              "author": "Frosty-Distance7184",
              "text": "Thanks for the info. We have our own brand of spicy products. So we're in the spicy food niche. I'm not sure how well affiliate marketing would work for us. I'll check out mediavine.",
              "score": 6,
              "created_utc": "2026-01-27 16:23:07",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o21ry7z",
                  "author": "Salt-Phrase4108",
                  "text": "You're welcome,if you're selling selling your own products you don't need affiliate marketing,but you can try kitchen gear,subscription boxes,spicy food kits etc. I would definitely recommend Pinterest for food blogs because it is a visual niche.You can make multiple pins with different angles.With ads rpm increases if people scroll a lot and you link to other recipes/products in your blog.",
                  "score": 3,
                  "created_utc": "2026-01-27 17:12:47",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o23a931",
                  "author": "thewholesomespoon",
                  "text": "Hopefully this is allowed but if you want to share any recipes or anything come here! r/needarecipe",
                  "score": 2,
                  "created_utc": "2026-01-27 21:10:21",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o21m6hs",
          "author": "grapegeek",
          "text": "Journey by Mediavine.",
          "score": 7,
          "created_utc": "2026-01-27 16:47:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o256t27",
              "author": "dontbothermeokay",
              "text": "You can’t join the big ad networks with a Wix site. Gotta have Wordpress.",
              "score": 3,
              "created_utc": "2026-01-28 02:51:33",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o25725k",
                  "author": "grapegeek",
                  "text": "Ah easy enough to fix.",
                  "score": 3,
                  "created_utc": "2026-01-28 02:52:53",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o2l5prw",
                  "author": "Tha-Aliar",
                  "text": "Are you sure? I asked about ghost and said yes. Just saying",
                  "score": 2,
                  "created_utc": "2026-01-30 11:51:16",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o229tvs",
              "author": "Frosty-Distance7184",
              "text": "Thanks I'll check it out",
              "score": 3,
              "created_utc": "2026-01-27 18:29:27",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2378yc",
                  "author": "iron_davith",
                  "text": "Yep, Journey is your best best. Overall Mediavine are pretty good, as long as your website isn't clearly just AI content.",
                  "score": 6,
                  "created_utc": "2026-01-27 20:56:54",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o21ucb7",
          "author": "justahumanbeing-22",
          "text": "Nice traffic....I eventually aspire to those levels.",
          "score": 4,
          "created_utc": "2026-01-27 17:23:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o234e2y",
          "author": "ArtemLocal",
          "text": "That’s enough traffic to test ads, but expectations matter. AdSense at 15-30k sessions usually pays disappointing money, especially in food niches unless it’s very US-heavy and high-intent. Think tens to low hundreds per month, not a meaningful revenue stream. Wix doesn’t block ads, but it limits more advanced setups. The bigger unlock is often affiliate links or owned products layered into existing content, not display ads slapped on top.\n\nIf you do try ads, treat it as a baseline experiment, not the end goal. The traffic you already have is more valuable than AdSense will ever tell you. What percentage of your traffic is US-based and what kind of food niche is it. Recipes, specialty ingredients, diet-specific.",
          "score": 3,
          "created_utc": "2026-01-27 20:44:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o23l1d3",
          "author": "Same_Carrot196",
          "text": "I think it would be good idea to put ads on your website but I think you should control the volume so it does not overwhelm your visitors.",
          "score": 3,
          "created_utc": "2026-01-27 21:58:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2gw1ot",
              "author": "Fit_Performance8775",
              "text": "Good advice. There is a sure-fire way to lose loyal visitors. I have given up on decent sites before because the ads are overwhelming. If the ads keep blocking what I'm seeing, or I keep accidentally clicking them while I'm scrolling, I will leave.",
              "score": 3,
              "created_utc": "2026-01-29 19:42:56",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2f7txx",
          "author": "Reasonable_Lab136",
          "text": "Hey! Food niche blogger here with similar traffic patterns. Here’s my take:\n1. Is 15-30k enough for AdSense?\nYes, technically you can start with any traffic, but realistically you won’t see meaningful revenue until you’re consistently above 25k sessions. The real money starts at 50k+.\n2. Revenue expectations:\nWith food niche and 18k monthly sessions:\n\t∙\tAdSense alone: $30-90/month (food RPM is usually $2-5)\n\t∙\tNot life-changing, but it’s passive income\n3. Better alternatives for food blogs:\n\t∙\tAmazon Associates - This is huge for food blogs. Link to kitchen tools, ingredients, cookbooks. Can easily 2-3x your AdSense revenue\n\t∙\tRecipe-specific affiliate programs - Check out Share-a-Sale for food brands\n\t∙\tEmail list - Start building NOW. At 30k traffic you should have 500+ subscribers. That’s your real asset\n\t∙\tMediavine/AdThrive - Way better than AdSense, but you need 50k sessions/month for Mediavine\nMy recommendation:\nStart with AdSense + Amazon Associates combo right away. Build your email list aggressively. Once you hit 50k sessions, switch to Mediavine. That’s when you’ll see $500-1000/month with your traffic level.\nThe Wix thing isn’t ideal for ads (slower page speed = lower CPM), but it works. Just make sure you’re loading ads async.\nGood luck!",
          "score": 3,
          "created_utc": "2026-01-29 15:10:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2gx2ez",
              "author": "Fit_Performance8775",
              "text": "Thank you for all that insight. That helps us all, even small blogs like mine, with future planning. ",
              "score": 1,
              "created_utc": "2026-01-29 19:47:46",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o229ig6",
          "author": "elysian0907",
          "text": "I have one question - do you use SEO in your website ? And for backlinks - do u use it as well- or just you go with on page optimization - thanks in advance",
          "score": 2,
          "created_utc": "2026-01-27 18:28:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o22a431",
              "author": "Frosty-Distance7184",
              "text": "Professional SEO. Full optimization. Monthly backlinks that are actually good and within our niche. Not spam stuff.",
              "score": 3,
              "created_utc": "2026-01-27 18:30:39",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o22em1n",
                  "author": "elysian0907",
                  "text": "thanks for your reply! May i know how i can start Backlinks the easiest way - as i never done it before..",
                  "score": 1,
                  "created_utc": "2026-01-27 18:49:36",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o22effm",
          "author": "Due-You-1943",
          "text": "how much traffic ur having daily and max of ur traffic is from which countries?",
          "score": 2,
          "created_utc": "2026-01-27 18:48:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o22hosq",
              "author": "Frosty-Distance7184",
              "text": "All usa",
              "score": 3,
              "created_utc": "2026-01-27 19:02:39",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2sq5tr",
                  "author": "Due-You-1943",
                  "text": "you can try other adnetworks instead of adsense , you will be getting daily payments. and more of good cpm rates",
                  "score": 1,
                  "created_utc": "2026-01-31 14:57:26",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o22v2lm",
          "author": "Limp-Locksmith-1135",
          "text": "Mediavine, journey by mediavine, shemedia, ezoic, raptive..etc all those are better than adsense in the revenue",
          "score": 2,
          "created_utc": "2026-01-27 20:01:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o23a1yx",
          "author": "thewholesomespoon",
          "text": "Journey or mediavine!",
          "score": 2,
          "created_utc": "2026-01-27 21:09:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o25q2in",
          "author": "RuanStix",
          "text": "18k monthly traffic will earn you a solid few pennies each month.",
          "score": 2,
          "created_utc": "2026-01-28 04:43:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o25v06m",
          "author": "shajid-dev",
          "text": "I prefer to go with Journey by mediavine, as you saying you've got 18k traffics. However to join journey, you need 1000 sessions, and you've already achieved it. \n\nAdsense doesn't have any minimum requirement to get enroll but RPMs were maybe low and it's totally depends on the tiered countries.",
          "score": 2,
          "created_utc": "2026-01-28 05:15:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o26d49x",
              "author": "UpBeatHustler",
              "text": "1000? Thought it was 10,000? \n\nEither way, OP is beyond that.",
              "score": 2,
              "created_utc": "2026-01-28 07:37:44",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o26o0vi",
                  "author": "shajid-dev",
                  "text": "Yes they have lowered the barrier",
                  "score": 2,
                  "created_utc": "2026-01-28 09:16:21",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o27p5pl",
          "author": "Getcha_Popcorn_Readi",
          "text": "I have a lot less traffic than you do and was with AdSense for years. I switched to Journey by Mediavine less than 3 months ago and have already hit $85 where it took me 2 years to get that with AdSense. Of course I haven't been paid yet because I haven't hit the $100 threshold but there are definitely better options than AdSense.",
          "score": 2,
          "created_utc": "2026-01-28 13:50:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2das9f",
          "author": "ccalinl",
          "text": "Mediavine (and Journey by Mediavine) started working differently this year, so you might get lower rates at this traffic level. For maximum performance, try joining Raptive (they do require 25k page views per month and at least 50% of the traffic from Tier 1 countries, but it would give you a slightly better RPM at this stage).",
          "score": 2,
          "created_utc": "2026-01-29 06:52:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o25wyok",
          "author": "OkLetterhead1438",
          "text": "AdSense is kinda meh at that level tbh",
          "score": 1,
          "created_utc": "2026-01-28 05:29:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o27mra7",
          "author": "Vinaya_Ghimire",
          "text": "I haven't used but they say ezoic and mediavine are better than adsense. It is nit easy to say how much you can earn from 18-30k traffic through Adsense because earning depend on click through rates and CPC.",
          "score": 1,
          "created_utc": "2026-01-28 13:37:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2b2e6z",
          "author": "BlacKkChocolat",
          "text": "What platform are you using for your blog?",
          "score": 1,
          "created_utc": "2026-01-28 22:53:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2doui5",
          "author": "ContextFirm981",
          "text": "With 18K visits/month you can use AdSense, but it’ll likely only earn a small amount (often tens, not hundreds, of dollars), so I’d also look at higher‑paying ad networks (if you qualify), direct sponsorships, or simple digital products in your niche for better monetization.",
          "score": 1,
          "created_utc": "2026-01-29 08:58:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2l61k0",
          "author": "Camino_Financiero",
          "text": "Approximately how long did it take them to reach 18,000 monthly views? And how long does it generally take to reach those levels of visits?",
          "score": 1,
          "created_utc": "2026-01-30 11:53:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2na1i1",
          "author": "SeniorConsequence297",
          "text": "Try Journey by Mediavine",
          "score": 1,
          "created_utc": "2026-01-30 18:13:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o21gyj4",
          "author": "Existing-Cod5443",
          "text": "please some one help me im facing issue for indexing my posts ",
          "score": 1,
          "created_utc": "2026-01-27 16:25:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o229a06",
              "author": "elysian0907",
              "text": "Hello, i will share with you a video youtube that helped me a lot - the language can be different to you, but at least follow the steps",
              "score": 1,
              "created_utc": "2026-01-27 18:27:09",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o28me25",
                  "author": "Existing-Cod5443",
                  "text": "please share ,me ",
                  "score": 1,
                  "created_utc": "2026-01-28 16:25:58",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qqakf8",
      "title": "Bloggers: Does your social media following actually drive traffic to your blog?",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1qqakf8/bloggers_does_your_social_media_following/",
      "author": "Crescitaly",
      "created_utc": "2026-01-29 14:49:41",
      "score": 19,
      "num_comments": 22,
      "upvote_ratio": 1.0,
      "text": "Been blogging for a while and trying to figure out the best use of my time for growing traffic.\n\n\n\n\\*\\*My current situation:\\*\\*\n\n\n\nMost of my blog traffic comes from SEO. I have Pinterest and Twitter accounts but they have modest followings (a few hundred each). I post consistently but growth is slow.\n\n\n\n\\*\\*What I'm questioning:\\*\\*\n\n\n\n\\- Does having more social followers actually translate to more blog traffic?\n\n\\- Do readers check social profiles before trusting a blog?\n\n\\- Is time spent on social media better spent writing content?\n\n\n\n\\*\\*What I've noticed:\\*\\*\n\n\n\nSome successful bloggers in my niche have huge social followings. Others barely use social media at all. Hard to tell what's actually driving their success.\n\n\n\n\\*\\*The uncomfortable question:\\*\\*\n\n\n\nI've talked to other bloggers who admitted to using growth services to build initial social credibility. Their reasoning: \"My content is good. I just need to look established enough that brands take me seriously for collaborations.\"\n\n\n\nSome say it helped with brand deals and perceived authority. Others say it made no difference to actual traffic.\n\n\n\n\\*\\*Questions for fellow bloggers:\\*\\*\n\n\n\n1. What percentage of your traffic actually comes from social media?\n\n2. Have you noticed any correlation between social following and blog success?\n\n3. What's your take on using growth tools vs. organic building?\n\n4. Is time spent on social media worth it for bloggers?\n\n\n\nGenuinely curious about different experiences.",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/Blogging/comments/1qqakf8/bloggers_does_your_social_media_following/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o2j2w4c",
          "author": "discoveroverthere",
          "text": "I have 58k followers on instagram. \nit drives about 1 visitor a month to my blog 😂\n\nSo no.\n\nThe answer is no",
          "score": 12,
          "created_utc": "2026-01-30 02:27:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2q2zlq",
              "author": "adventuresfromelle",
              "text": "It depends on how you share your links/ your audience. Because I have 16K followers on Instagram and get about 250-300 clicks per month. But it helps that I share the links on my story and channel, and all my IG feed posts reference my articles. I do stuff like comment \"word\" and I'll DM my article. It works! Not that labour intensive",
              "score": 4,
              "created_utc": "2026-01-31 02:47:00",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2hrseg",
          "author": "Sharp-Skill9304",
          "text": "I watched a YT video recently that was talking about YT growth specifically but the angle that he presented things in covers blogs as well: \n\nPeople who are looking for long form content aren’t scrolling on social media, or at least, they’re not necessarily in the headspace to consume form content when they’re scrolling. \n\nI run a blog myself and thinking about that realized that, even though I enjoy long form content, I’m the same, if I’m on IG the likelihood that I’m clicking away to someone’s blog post is slim.  \n\nNow getting someone from Pinterest to your blog or even long form YT to your blog, the way that like to consume content is more of a match than someone scrolling. \n\nNow I think there are other benefits for having a social media presence because really it’s not so much about building a blog anymore as it is building a brand, and there’s value there.",
          "score": 6,
          "created_utc": "2026-01-29 22:14:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2gubhc",
          "author": "Puhpowee_Icelandics",
          "text": "Most people on social media don't like to leave that platform. They might read what's on your page, but very few will go to the blog to read the story. Now, if someone asks a question, and you can put the link to your article in a comment (if it solves their problem), you have a much better chance of them clicking through.   \nI don't think that for most people spending a lot of time on social media is worth it, unless your whole strategy is build around it.",
          "score": 3,
          "created_utc": "2026-01-29 19:34:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2jtyyv",
          "author": "onlinehomeincomeblog",
          "text": "For me,   \nSEO drives bulk traffic, and social media drives burst (it is not helpful in compounding traffic).\n\n1. Followers ≠ traffic. In social media, people follow us for ideas and vibes, not long reads.\n\n2. Only brands, collaborators, and clients check our social media profiles before trusting our blog. Regular readers care more about clarity and content quality.\n\n3. One solid SEO-driven post often outperforms weeks of social posting in the long run. Social feels productive, but it doesn't always compound.\n\nAt last, \n\n* Use social media as a distribution layer, not the foundation.\n* Focus on SEO + content depth first.\n* Pick one social platform to build your personal brand and not just to drive traffic.\n\nCheck if SEO is working for you, you are already doing the right thing. Stop worrying about social media.",
          "score": 5,
          "created_utc": "2026-01-30 05:10:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2lxlyl",
          "author": "making_it15",
          "text": "Hiya! Speaking from experience with travel blogs, grown mainly via SEO. Pinterest drove a decent percentage of traffic (20-30%) but almost nothing from other social channels. This is because Pinterest and YouTube function more like search engines where people are actively looking for content, so they're more likely to click through and engage with your blog. Social media following alone meant very little for my blog, but I did get some good visibility by doing \"Instagram takeovers\" and being featured on other brands that I connected with over social. So good for networking with other brands, but in my experience it didn't automatically mean more blog success.",
          "score": 3,
          "created_utc": "2026-01-30 14:34:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2hq83i",
          "author": "Salt-Phrase4108",
          "text": "Pinterest is like a search engine so if you pin something interesting today with a new account and 0 followers,you can have impressions grow slowly and even peak in a month and it keeps bringing traffic for years .You can switch to a business account and see the growth daily .People don't have patience for it because it's long term but its perfect for blogs because people on pinterest are in inspiration mode and its easy for them to click and scroll,that's what makes it valuable for me.Certain niches do better on pinterest,I use it for aesthetic niches and art. \n\nI also find reddit traffic comes fast but it is unpredictable and it comes in bursts.I use it for technical comparisons in AI tool/finance niches and I actually need that crowd for affiliate sales,so its very targeted and I can't easily find that quality crowd anywhere else.\n\nSo,whether its worth it not not depends entirely on why you are bringing the traffic to your blog.",
          "score": 2,
          "created_utc": "2026-01-29 22:07:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2hwb81",
              "author": "Wide_Brief3025",
              "text": "Reddit definitely brings quick but unpredictable spikes compared to the steady flow from Pinterest. To make the most of those bursts, I’ve found that catching relevant threads early is key for higher quality traffic. Tools like ParseStream can actually send you alerts for specific keyword mentions so you can jump in right when your audience is active. Makes targeted engagement a lot easier if affiliate sales are your goal.",
              "score": 1,
              "created_utc": "2026-01-29 22:37:18",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2ijib8",
          "author": "GrowthZen",
          "text": "Most independent benchmarks show SEO and search still outperform social by a wide margin for driving blog traffic. but social can matter for brand, trust and leverage if you use it strategically instead of chasing vanity followers.\n\nwhat current data says:  \n\\- BrightEdge data (via Ahrefs) suggests SEO drives over 1,000% more traffic than organic social on average, which matches your experience of most traffic coming from search  \n\\- SparkToro’s 2024 referrer analysis found Google often sends 70%+ of a typical site’s traffic, vastly exceeding all social media and content sites combined  \n\\- global usage is heavily skewed to social (about 63.9%+ of the world uses social media, \\~2h21 per day) but that doesnt translate 1:1 into blog clicks because most users consume content inside platforms\n\nfollowers vs traffic and trust:  \n\\- a 2024 study on publishers found social metrics can predict some website traffic. but with big variance by brand and platform... high follower counts are correlational and not a guaranteed traffic driver  \n\\- social behaves more like an assist... followers who recognize your brand are more likely to click you in SERPs, subscribe or buy. but the primary click still often comes via google and not the social link  \n\\- for trust and brand deals, ig followers, fb comments and x (formerly twitter) mentions often correlate with higher traffic, registrations and revenue. so brands use follower counts as a quick credibility heuristic even if it doesn’t massively move blog sessions\n\nwhich platforms actually move blog traffic:  \n\\- pinterest behaves like a visual search engine like that users are in discovery/planning mode and optimized pins can send long‑tail compounding blog traffic for years. pinterest users show high search intent and convert at strong rates, making it disproportionately effective for visual or how‑to niches  \n\\- ig, x/twitter and tiktok are heavily used for research and discovery (up to \\~40-46% of younger users use social as a search layer) but most people stay on‑platform, so these channels produce more brand lift than consistent referral traffic\n\ngrowth tools vs organic:  \n\\- follower counts can correlate with more traffic and revenue. but engagement metrics (comments, mentions, clickthroughs) are stronger predictors than raw follower numbers  \n\\- paid growth or credibility padding inflates follower counts without matching engagement, which dilutes metrics and reduces the algorithmic effectiveness of those followers\n\nif your main goal is more readers on the blog, current numbers favor:  \n\\- double down on SEO and content that can rank  \n\\- use pinterest (if your niche fits) like a secondary search engine  \n\\- treat other social platforms as brand and relationship channels that support trust, email growth and future rankings rather than primary traffic drivers\n\nwhats your niche? and are you writing mostly evergreen search content or timely/opinion pieces... that changes whether social is a multiplier or just a distraction?",
          "score": 2,
          "created_utc": "2026-01-30 00:40:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2heb31",
          "author": "CanadianDollar87",
          "text": "i have a facebook group for my blog and invited people on my friends list to join. someone of them may have not known i had a blog if they didn’t join the group. whenever i post a new blog, i’ll post it on facebook with a link. i’ve gotten more views that way.",
          "score": 1,
          "created_utc": "2026-01-29 21:10:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2jh4ws",
          "author": "mannyned2",
          "text": "Short answer: social media usually doesn’t drive consistent blog traffic the way SEO does, but it does help with distribution, visibility, and credibility—especially with brands. Most readers don’t check social profiles, but partners often do. The key isn’t choosing between writing and social, it’s avoiding the time drain. A smart approach is to stay SEO-focused and automate distribution so social doesn’t become a second job. That’s where ReGenr.app comes in: it auto-shares your blog posts across platforms like Pinterest, X, and LinkedIn when you publish, keeping you visible with minimal effort. ReGenr is currently in beta testing, and we’d love feedback from bloggers like you to help shape it into a truly creator-first app built around real workflows, not busywork.",
          "score": 1,
          "created_utc": "2026-01-30 03:48:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2mh217",
          "author": "Intrepid-Fox-266",
          "text": "Not really... \n\nX=nope. What does drive followers is if I reply to a relevant post where linking back to my article actually makes sense\n\nFlipboard=hahaha. Nothing\n\nReddit, I have 0 followers, and it drives more traffic than X or Flipboard\n\nPinterest, just started, and so far nothing\n\nInstagram, haven't spent much time with.\n\n...",
          "score": 1,
          "created_utc": "2026-01-30 16:05:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2mq6jd",
          "author": "Existing-Cod5443",
          "text": "social media for trust signals and sometimes boost traffic based on niche ",
          "score": 1,
          "created_utc": "2026-01-30 16:45:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2mqlyl",
          "author": "nishantpatil108",
          "text": "Due to search different keywords...my RPM is 4-5 avg....daily traffic is 5k-6k but my earning is 20 dollar...but it required lots of post on Instagram constituent after 2-3 month u get good amount of money....and don't send direct traffic....u do content like user must be search for answer...",
          "score": 1,
          "created_utc": "2026-01-30 16:47:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2mw7xf",
          "author": "Vinaya_Ghimire",
          "text": "Social media brings me traffic but not much. Despite using multiple social media sites, my social traffic isn't much. In my experience,.social media users aren't a fan of clicking links. They might engage heavily on the platform but might not consider visiting the website through shared link.",
          "score": 1,
          "created_utc": "2026-01-30 17:12:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2n9w0x",
          "author": "SeniorConsequence297",
          "text": "Pinterest do drive a lot of traffic",
          "score": 1,
          "created_utc": "2026-01-30 18:13:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2o345k",
          "author": "Impossible-Koala-368",
          "text": "Social is my top channel, primarily because of Pinterest.",
          "score": 1,
          "created_utc": "2026-01-30 20:25:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2q3lc1",
          "author": "adventuresfromelle",
          "text": "Brands tend to look at your social media following and engagement to decide if to work with you or not, so it's worth devoting some effort but not a whole lot. People are more likely to click links on Facebook. On Instagram, you have to share the links on your story and try to grow your channel where followers can click the links directly, and get a message every time you share a link. \n\n\nUsing these strategies, I'd say roughly 20% of my audience comes from social media.",
          "score": 1,
          "created_utc": "2026-01-31 02:50:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2sacbq",
          "author": "sarkhem",
          "text": "yes it does and a lot through pinterest.. please dont ask how as subreddits these days are unhelpful.. because if i talk about how I am getting things done.. mods may get angry and tag me as self promotional.. but yes social media does help me drive traffic and its my number 1 source for me currently especially after google decided to kill my site through their unhelpful content updates",
          "score": 1,
          "created_utc": "2026-01-31 13:25:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2g9sgj",
          "author": "AIToolReviewer",
          "text": "    I run a niche review site (vettedaitools.com), and honestly, social media drives less than 15% of my traffic—SEO and email are the real workhorses.  \n      \n    That said, the bloggers I've talked to consistently mention that social media works best when you're not just sharing links. Instead, share insights or mini-lessons on the platform itself, then link to your blog as a \"read more\" option. People engage with native content, not just link drops.  \n      \n    Pinterest is the exception—it's basically a visual search engine, so it can drive solid blog traffic if your niche is visual (recipes, DIY, fashion, etc.). But Instagram and Twitter? They're better for building authority and relationships than direct traffic.  \n      \n    What's your blog niche? That might determine which platform (if any) is worth your time.",
          "score": -6,
          "created_utc": "2026-01-29 18:01:01",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qmcdbb",
      "title": "Writing got easier for me when I stopped trying to be perfect",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1qmcdbb/writing_got_easier_for_me_when_i_stopped_trying/",
      "author": "X_Xoosp",
      "created_utc": "2026-01-25 07:14:04",
      "score": 13,
      "num_comments": 12,
      "upvote_ratio": 0.93,
      "text": " I used to get stuck almost every time I tried to write a blog post.\n\nNot because I didn’t have ideas, but because I felt like everything had to be “right” from the very beginning.\n\nI’d open a blank page, overthink the intro, and then close it without publishing anything.\n\nWhat personally helped me was changing how I started.\n\nInstead of trying to write full paragraphs right away, I began by writing a very rough structure first.\n\nJust section headers, bullet points, or even messy notes. No pressure to make it sound good.\n\nOnce the structure was there, filling in the content felt much lighter.\n\nI wasn’t staring at a blank page anymore — I was just expanding what was already there.\n\nThis might not work for everyone, but it made writing feel less heavy for me and helped me publish more consistently.\n\nCurious how others here usually start their posts — do you outline first, or jump straight into writing?",
      "is_original_content": false,
      "link_flair_text": "Tips/Info",
      "permalink": "https://reddit.com/r/Blogging/comments/1qmcdbb/writing_got_easier_for_me_when_i_stopped_trying/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o1rl2jm",
          "author": "adrianmatuguina",
          "text": "I had a very similar experience when I stopped treating the first draft as something that needed to be polished. The pressure to “get it right” from the first sentence often creates more resistance than clarity.\n\nWhat you described is one of the most effective mindset shifts for writing consistently. Separating structure from expression removes the emotional weight of the blank page. Once the outline exists, even in rough bullets or fragmented notes, the task becomes expansion rather than creation, which is cognitively much easier. This approach also tends to improve clarity, because ideas are organized before they are refined.\n\nMany writers quietly use tools to support this exact process. Platforms like WordHero are useful for quickly generating structured outlines or section headers, while Aivolut Books helps turn those rough frameworks into cohesive long-form drafts, especially for larger projects where momentum matters.\n\nI have found that outlining first not only speeds up writing, but also reduces the urge to self-edit too early. It allows creativity and discipline to work together instead of competing.",
          "score": 2,
          "created_utc": "2026-01-26 05:08:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1l33pl",
          "author": "Reasonable_Lab136",
          "text": "Outline first, always. I used to jump straight into writing and would get stuck after 2 paragraphs every time. Now I just throw down 5-6 bullet points for what I want to cover, and suddenly the writing part becomes way easier. It’s like having a map instead of wandering around lost.",
          "score": 1,
          "created_utc": "2026-01-25 08:23:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1lgzg3",
              "author": "X_Xoosp",
              "text": "100% agree.\nDo you usually outline in bullet points only, or do you write short notes under each section too?",
              "score": 3,
              "created_utc": "2026-01-25 10:26:05",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1ly236",
          "author": "Misha_AthenaPot",
          "text": "This is a big problem that I have because I overthink and aim for perfection, which is why I'm so slow to publish. I write the easy paragraphs first and then finish with the introduction. It hasn't worked well for me so I'm going to change it up. I'll start treating it like an essay exam in high school - give myself time to write and let it be. I can always go back to edit it later if it needs changes.",
          "score": 1,
          "created_utc": "2026-01-25 12:47:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1me5fe",
          "author": "shajid-dev",
          "text": "I start with outlining the important concepts and re ordering them ina logical order, after that completing a section when im in a energetic mood, each one tho. But sometimes I write entire content.",
          "score": 1,
          "created_utc": "2026-01-25 14:24:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1pkm6e",
          "author": "ambergenae",
          "text": "I agree with this method. I usually jot down my ideas and things in my spiral book l. Then when I get infront of the computer all the other pieces fall into place. My biggest struggle is sticking to one topic. Staying focused on what that page is supposed to be about.",
          "score": 1,
          "created_utc": "2026-01-25 22:48:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ptm17",
          "author": "Flightlessbutcurious",
          "text": "Hey, same here. I honestly also sometimes publish a somewhat minimalistic post and then later flesh it out depending on what analytics show.",
          "score": 1,
          "created_utc": "2026-01-25 23:29:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1sen7w",
          "author": "Hot_Income2562",
          "text": "I thought and still think text is better than video. Movie can't describe feelings, scent, pain, joy. Can only describe them visually which is not possible but movie directors still try hard to accomplish them. People just can't use words right in the internet. Should be at first easy to read, because humanity still learning to read. Write something new, people tired of typical efforts. Give them new feeling, idea, new emotion, new atmosphere, capitalism works :) That's my part of strategy.",
          "score": 1,
          "created_utc": "2026-01-26 09:07:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1tkh1a",
          "author": "Ok-Cardiologist-565",
          "text": "Outline, then I write like im talking to someone, sharing a fun fact. Treat each section like a separate topic (no intro or conclusion jusy body paragraphs). Before I knew it i had a full essay. Then just edited it to make it sound smoother for writing and did the intro and conclusion",
          "score": 1,
          "created_utc": "2026-01-26 14:13:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1vb0v3",
          "author": "Fit_Performance8775",
          "text": "# A Shitty First Draft!\n\nI agree with most of the other comments here. An outline, bullet points, numbered lists, or keywords can all help break things down into small chunks. I do this too. \n\n**However:** \n\n* Don't be afraid to write what Anne Lamott famously said as the \"shitty first draft.\"\n* Write it exactly how you would say it to a friend or colleague sitting in front of you. Use slang, use choppy sentences, whatever. \n* Sometimes, we can get just as stuck figuring out the structure. Worrying over whether or not the points we made are relevant, or if we missed key points.\n* You can always cut and paste and edit later.   \n\nHere is an excellent summary by Patrick Edblad on Medium.   \n[This is How to Overcome Perfection: The Power of the \"Shitty First Draft\"](https://medium.com/better-humans/this-is-how-to-overcome-perfection-the-power-of-the-shitty-first-draft-489769eb7da6)\n\nWho else tries to jump right into a shitty first draft with their blogs??",
          "score": 1,
          "created_utc": "2026-01-26 18:50:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1kvg20",
          "author": "X_Xoosp",
          "text": "If you want, I can share how I personally approach this — happy to DM.",
          "score": 0,
          "created_utc": "2026-01-25 07:17:33",
          "is_submitter": true,
          "replies": []
        }
      ]
    },
    {
      "id": "1qn2ctm",
      "title": "I have a travel blog and I'd love to know what your blog is!",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1qn2ctm/i_have_a_travel_blog_and_id_love_to_know_what/",
      "author": "ropromundo",
      "created_utc": "2026-01-26 01:41:45",
      "score": 10,
      "num_comments": 22,
      "upvote_ratio": 0.86,
      "text": "Hi, I created a blog to write about my travel experiences, as well as other topics like culture, marketing, and sustainability. I'm looking to monetize it but also to make friends. My blog is [https://ropromundo.com.br](https://ropromundo.com.br). What's yours and what do you write about? ✨",
      "is_original_content": false,
      "link_flair_text": "Tips/Info",
      "permalink": "https://reddit.com/r/Blogging/comments/1qn2ctm/i_have_a_travel_blog_and_id_love_to_know_what/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o1qqkzm",
          "author": "pash28",
          "text": "My fiancé and I just started a travel blog to focus on our National Park adventures, road trips, and adventuring with dogs. Just getting started but definitely want to connect with other travel bloggers! [www.thepashmannpassport.com](https://www.thepashmannpassport.com)",
          "score": 3,
          "created_utc": "2026-01-26 02:12:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1r6hqe",
              "author": "ropromundo",
              "text": "That's great! Which country/state are you visiting?",
              "score": 1,
              "created_utc": "2026-01-26 03:37:01",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1r7gfe",
          "author": "mykm20",
          "text": "I run a creative blog, [feeling-creative.com](http://feeling-creative.com) , mostly for guest posters in the creative space to promote themselves and guest post articles. Everyone is welcome, as long as it's tied into creativity in some way.",
          "score": 3,
          "created_utc": "2026-01-26 03:42:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1rab5d",
              "author": "savepointdad",
              "text": "That’s is seriously awesome. I’m reading them all right now.",
              "score": 1,
              "created_utc": "2026-01-26 03:59:35",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o1rowkn",
              "author": "Mental-Goal-8724",
              "text": "Just visited, love the idea. So much to read, I'm gonna delve into it.",
              "score": 1,
              "created_utc": "2026-01-26 05:35:06",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1r37jg",
          "author": "jbu2022",
          "text": "Nice and thanks for sharing!",
          "score": 2,
          "created_utc": "2026-01-26 03:18:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1r6shv",
              "author": "ropromundo",
              "text": "You are welcome :)",
              "score": 1,
              "created_utc": "2026-01-26 03:38:46",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1r3szk",
          "author": "95Counties",
          "text": "We are traveling to all of Virginia’s 95 counties with our dogs & doing all of the dog friendly stuff. https://virginiacounties.blog/our-virginia-road-trips/",
          "score": 2,
          "created_utc": "2026-01-26 03:21:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1r6rli",
              "author": "ropromundo",
              "text": "Look how interesting! I haven't been to the USA yet, but I really want to travel in a motorhome; I love road trips! Here in Brazil, the roads aren't very good, and the highways are quite dangerous, and I wish we had a stronger camping culture. I'll check out the blog!",
              "score": 2,
              "created_utc": "2026-01-26 03:38:37",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1ra442",
          "author": "savepointdad",
          "text": "So many cool ideas here. I run SavePointDad.com it’s about being a dad and what I have learned and the mistakes I made. I also write about gaming and my fitness journey. I keep it fun though. My last blog was about how my wife and her friends voted that dragons are real lol.",
          "score": 2,
          "created_utc": "2026-01-26 03:58:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ragoi",
          "author": "jarvandamere",
          "text": "Nice to meet you friend. My girlfriend and I travel whenever we have free time and I like to write about it. Leaning towards adventure travel in places like the Central America, Caribbean, little bit of Arctic action and stuff like that. Started about 7 months ago. [www.trueadventureseeker.com](http://www.trueadventureseeker.com)",
          "score": 2,
          "created_utc": "2026-01-26 04:00:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1rksa7",
          "author": "itslaeq",
          "text": "Tech and AI [The Wise Report](https://thewisereport.com)",
          "score": 1,
          "created_utc": "2026-01-26 05:06:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1rkzev",
          "author": "Mental-Goal-8724",
          "text": "Travel and Mental health: https://thespot.blog",
          "score": 1,
          "created_utc": "2026-01-26 05:08:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1rr9ab",
          "author": "Old_Length_987",
          "text": "You can also check out [travel blogs](http://thedailynode.com).",
          "score": 1,
          "created_utc": "2026-01-26 05:52:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1rzsay",
          "author": "New-Vast1696",
          "text": "I have a travel section too in my blog. I blog about everything that I like and so I have sections. It's https://gracefulinsights.space/\n\n\nI am not really monetizing it. I just like to do it. It's my hobby. ",
          "score": 1,
          "created_utc": "2026-01-26 06:58:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1r2mlu",
          "author": "Reasonable_Lab136",
          "text": "Cool! I build tools for bloggers - just launched an AI article generator. What’s your monetization strategy for the travel niche? Ads or affiliates?",
          "score": 0,
          "created_utc": "2026-01-26 03:14:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1r6x5e",
              "author": "ropromundo",
              "text": "I'm not a big fan of AI! I enjoy reading about travelers' real experiences, but I admit it can make our writing process easier! I currently monetize my digital products; I have travel guides, I write for several blogs, and I'm a social media manager for tourism companies!",
              "score": 2,
              "created_utc": "2026-01-26 03:39:31",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1r827f",
                  "author": "Reasonable_Lab136",
                  "text": "Totally understand - real experiences are what make travel content valuable! AI is just a tool to speed up the boring parts (SEO, formatting, meta descriptions), the storytelling still needs to be human 😄\nThat’s a solid revenue mix btw - digital products + freelance writing. How did you land the social media management gigs? Cold outreach or they found you through the blog?",
                  "score": 2,
                  "created_utc": "2026-01-26 03:46:07",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qrh37u",
      "title": "3 month progress after blog relaunch",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1qrh37u/3_month_progress_after_blog_relaunch/",
      "author": "Great-Slice-7714",
      "created_utc": "2026-01-30 20:30:52",
      "score": 9,
      "num_comments": 2,
      "upvote_ratio": 0.92,
      "text": "Hello again! For those who missed my last 2 updates I started a very niche, local wedding blog in March 2024 but fizzled out a bit because well.. life. I decided to revamp the website and relaunched the blog on Oct 20th. I’m excited to report the progress I’ve seen in January!\n\nMy goal was to publish (at a minimum) 4 blog posts and I did just that. Giving me a total of 27 blog posts.\n\nJanuary Traffic per Google Analytics: Event Count: 1.45K Active Users: 209 New Users: 205 Avg Session: 2m 50s\n\nNew user traffic:\nOrganic social: 81\nOrganic search: 76\nDirect: 41\nUnassigned: 5\nReferral: 2\n\n\nI am very excited for this month’s results. As wedding planning season has begun for a lot of couples, I believe my site is picking up momentum and getting visibility.\n\nWhat I did: I do focus on SEO. Not in the, cookie-cutter have chat gpt spit out a blog sort of way, but really considering what brides/couples are googling. I do my research and post with intention.\n\nWhat I didn’t do: I didn’t use Pinterest this month like I wanted to or social media. They are two great resources, but I struggle to find the time to do it all. So I am focusing on blogging and hopefully the rest will come later.\n\nThanks for following along on my journey! Hopefully you’re enjoy it as much as I am 🙂",
      "is_original_content": false,
      "link_flair_text": "Progress Report",
      "permalink": "https://reddit.com/r/Blogging/comments/1qrh37u/3_month_progress_after_blog_relaunch/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o2phn1o",
          "author": "ggpaul562",
          "text": "That’s the challenge I have. Because I’ve done SEO for 13 years I think of blogging a certain way. I feel like I need to unlearn some things from the traditional SEO way; still apply some that matters, and just…. Write.",
          "score": 1,
          "created_utc": "2026-01-31 00:42:00",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qqriw2",
      "title": "I want to start a blog for my business but not sure where to begin",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1qqriw2/i_want_to_start_a_blog_for_my_business_but_not/",
      "author": "b4pd2r43",
      "created_utc": "2026-01-30 01:25:53",
      "score": 8,
      "num_comments": 6,
      "upvote_ratio": 1.0,
      "text": "I run an educational coaching business focused mainly on math and I want to start a blog to go deeper on topics I can’t fully explain on Instagram.\n\nI share tips there already but the format really limits how much context and explanation I can give.\n\nA blog feels like the right next step so I can write more conversational posts about math concepts, study strategies, and learning habits.\n\nI’m just not sure which platform makes the most sense especially starting on a budget but with room to grow later. Any suggestions?\n\n",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/Blogging/comments/1qqriw2/i_want_to_start_a_blog_for_my_business_but_not/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o2is2rk",
          "author": "alizastevens",
          "text": "If you’re thinking long-term and want flexibility, WordPress is still the safest bet. It feels like a lot at first but once it’s up it’s boring in a good way. Just write and publish.\n\nBut if speed matters more right now, Durable is honestly easier. Especially if the blog is just there to support your coaching and not become a whole tech project.\n\n\n\n\nAlso since you already post on Instagram, I’d actually reuse that content as a base. Take one post, expand it into a full article, add examples, and maybe a simple diagram or two. That way you’re not starting from zero. Blogs work really well for evergreen topics like math concepts and study habits because people search for the same questions year after year.",
          "score": 5,
          "created_utc": "2026-01-30 01:27:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2is6w1",
          "author": "Skillerstyles",
          "text": "Budget-wise, I’d avoid platforms that trap you behind paywalls early (some newsletter tools do this). They’re great for audiences that already exist, but for discovery and SEO, a traditional blog works better.",
          "score": 1,
          "created_utc": "2026-01-30 01:27:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2is9qv",
          "author": "StashBang",
          "text": "I wouldn’t worry too much about posting a ton right away. A few solid posts that explain your approach and thinking are way more useful than a bunch of rushed ones. You can always layer on study tips, math breakdowns, etc. once you see what people respond to.",
          "score": 1,
          "created_utc": "2026-01-30 01:28:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2isceo",
          "author": "albrasel24",
          "text": "Get a domain first and keep the tech side boring at the start. Find cheap hosting, free theme, no fancy plugins.",
          "score": 1,
          "created_utc": "2026-01-30 01:28:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2j9yyf",
          "author": "MeringueSensitive140",
          "text": "Focus on content creation.",
          "score": 1,
          "created_utc": "2026-01-30 03:07:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2k5g2l",
          "author": "onlinehomeincomeblog",
          "text": "A blog is perfect if you develop one with deeper explanations, examples, and context.\n\nStart with a WordPress (self-hosted) blog, which gives you full control and can be scaled for the long term. Start with a basic free theme + clear writing targeting one audience group at a time.\n\nRegister a domain name and get a shared hosting, which will cost you around 2000 - 2500 INR only. Then you have to invest in buying a premium theme or else if your budget doesn't allow you, start with the Default FREE WP theme itself.\n\nWatch some YouTube videos and start developing your blog. Then you know the process, keyword research, and content writing.",
          "score": 1,
          "created_utc": "2026-01-30 06:36:49",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qnd2sc",
      "title": "Does constantly “improving” content actually hurt long-term leverage?",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1qnd2sc/does_constantly_improving_content_actually_hurt/",
      "author": "MasterBlogging",
      "created_utc": "2026-01-26 11:02:46",
      "score": 8,
      "num_comments": 16,
      "upvote_ratio": 1.0,
      "text": "Every time I learn a better way to structure posts, the question comes up: do you update everything again?\n\nAt some point, optimization feels like negative ROI.\n\nFor those running blogs as a business, how do you decide:\n\n   • what’s worth updating\n\n   • what’s good enough to freeze\n\n   • what should never be touched again?\n\nCurious how others think about this.",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/Blogging/comments/1qnd2sc/does_constantly_improving_content_actually_hurt/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o1ttzam",
          "author": "bluehost",
          "text": "Treat posts like maintenance instead of updates. \n\nIf a post is still getting meaningful traffic or is close to page 1, update it. If it has buyer intent and generates sales, update it. If it is so outdated that it could be misleading, update it. \n\nIf a post is stable, ranks well, and has up-to-date info on it, just do tiny fixes that are needed. \n\nIf you have a post that never went anywhere and is not really strategic, don't touch it. Either leave it as is, or merge the useful parts into a better post and redirect to that post. \n\n\n\nUpdate for outcomes, not vibes.",
          "score": 6,
          "created_utc": "2026-01-26 15:01:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1to51y",
          "author": "thewholesomespoon",
          "text": "I’m always updating my posts! It works great for me! I actually really have things to update so in my eyes, it can never be a negative",
          "score": 5,
          "created_utc": "2026-01-26 14:32:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1zp7ze",
              "author": "MasterBlogging",
              "text": "That makes sense if the updates actually add new value.\n\nI’m more curious about limits. When you learn a better way to write or structure content, do you go back and change posts that are already working well, or do you leave them as they are?",
              "score": 4,
              "created_utc": "2026-01-27 10:13:06",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o21f7fe",
                  "author": "Lisapatb",
                  "text": "I do it slowly, I'm always updating some old post almost daily. Sometimes I try to do a few. If I see something working well, I'll replicate on other posts. Like making a video for it, embedding a YouTube video, or adding a FAQ section.",
                  "score": 5,
                  "created_utc": "2026-01-27 16:17:43",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o21g6xa",
                  "author": "thewholesomespoon",
                  "text": "I absolutely go back! I’m doing it right now actually lol. After I just updated all 200 of my posts a few months ago. I learned more about photography and editing photos so I’m doing that right now. I learned more about seo, subheadings and structure, and internal linking! So I go in and update as I can! But it’s a lot of work for sure. It seems to be fruitful though!",
                  "score": 2,
                  "created_utc": "2026-01-27 16:22:00",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1uzf5z",
          "author": "Fit_Performance8775",
          "text": "You pose a great question, one I question myself. As my writing improves overall, I often cringe when I read old posts. The question is, \"Should I edit that, or leave it as evidence of my writing evolution?\"   \n  \nYou make a good point about ROI. For me, I want my blog to reflect the writer I am now. My choice is to archive the old posts in my personal archives for my own record and rework them for the published product. Most effort goes to the posts that need it the most or still get traffic. \n\nIf an old post doesn't get any traffic, it could be left alone.",
          "score": 3,
          "created_utc": "2026-01-26 18:02:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o21fik2",
              "author": "Lisapatb",
              "text": "If no traffic, how about deletion? So it doesn't drag the whole site down with thin or outdated content?",
              "score": 1,
              "created_utc": "2026-01-27 16:19:04",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o20qhma",
          "author": "Om_Forever",
          "text": "You have to maintain posts. The same post you made 10 years ago does likely not have the same technical best practices that are required today. Letting content degrade can hurt you in the end due to poor user experience or looking dated.",
          "score": 3,
          "created_utc": "2026-01-27 14:23:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o20wtgy",
              "author": "MasterBlogging",
              "text": "Agreed on maintenance. Letting things decay definitely has a cost.\n\nWhat I’m trying to separate is baseline upkeep from learning-driven changes. Once a post meets today’s standards and works well, do you still revisit it just because you’ve learned a better way to write or structure content?",
              "score": 2,
              "created_utc": "2026-01-27 14:54:27",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2seoeh",
                  "author": "Om_Forever",
                  "text": "After 13 years of doing this, and running a blog business, my motto is continuous improvement. We have quarterly and annual SOPs that cover both technical maintenance and content updates as new information becomes available.",
                  "score": 2,
                  "created_utc": "2026-01-31 13:52:09",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2hrrwt",
          "author": "Salt-Phrase4108",
          "text": "When I see a post perform well,I touch it up slightly,not completely change it.I just tweak by adding more useful information without changing core ideas if it is an informative post.I add links etc İ havent seen any hurt.",
          "score": 1,
          "created_utc": "2026-01-29 22:14:40",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qpjye7",
      "title": "Struggling to grow organic traffic on a utility-style content site – need advice",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1qpjye7/struggling_to_grow_organic_traffic_on_a/",
      "author": "Few_Standard_8886",
      "created_utc": "2026-01-28 18:40:39",
      "score": 8,
      "num_comments": 14,
      "upvote_ratio": 1.0,
      "text": "Hello everyone,\n\nI built a small content-driven website around everyday problem-solving topics (calculators, generators, etc.). It’s been live for \\~7–8 months.\n\nI’ve done on-page SEO, improved site speed, added detailed articles to each page, and submitted sitemaps to Google Search Console. Right now I’m seeing roughly:\n\n\\*200–300 impressions/day\n\n\\*1–4 clicks/day\n\nSo technically Google sees the site, but growth is extremely slow.\n\nThe only thing I haven’t focused on much is off-page (backlinks / authority building).\n\nFor those who’ve grown similar utility or informational sites:\n\n\\-What actually moved the needle for you?\n\n\\-Is link building the main missing piece here?\n\n\\-Any unconventional approach that worked?\n\nNot promoting anything — genuinely looking to learn from real experiences.\n\nThanks in advance.",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/Blogging/comments/1qpjye7/struggling_to_grow_organic_traffic_on_a/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o2chx8w",
          "author": "GrowthZen",
          "text": "For utility sites, you’re in the classic google can see it but doesn’t fully trust or understand it yet phase.\n\na few data points: multiple SEO case studies on tools and calculators show that 200-300 impressions/day with 1-4 clicks usually means you’re appearing for semi‑relevant long‑tail queries at low positions (often bottom of page 1 or page 2). CTR problems tend to be about classification and SERP layout (AI overviews, widgets, other tools) rather than pure on‑page SEO. industry data still finds organic search is the largest long‑term traffic source for most sites but utility pages are disproportionately affected by AI overviews and zero‑click answers... you only get real traffic when your page is the obvious next action (richer explanations, scenarios, comparisons) rather than just one more calculator.\n\nwhat’s moved the needle on similar builds:  \n\\- deepen a few winners before chasing more pages. in public case studies, utility pages that added use cases like for example inputs/outputs, mini‑FAQs and what this number means for you sections saw meaningful CTR and ranking lifts even with AI overviews present. because they became the page users clicked after the summary  \n\\- tighten keyword–tool fit. check Search Console for each tool: if impressions come from queries that dont match the tool’s real job, rewrite titles/meta to mirror the exact phrasing of the highest‑intent queries, then adjust content so the tool plus explainer page is clearly designed for that use case. this intent realignment step is commonly cited in growth breakdowns where impressions were flat for months before compounding  \n\\- authority matters but only after the above. links to thin tools mostly increase impressions without fixing CTR. and links to clearly positioned, high‑intent tools tend to produce both more impressions and a steeper click curve. recent studies and practitioner write‑ups suggest selective link building to 5-10 hub tools (not every page) performs better than spraying low‑quality links sitewide\n\nif this were my project at \\~7-8mos i’d:  \n1) pull the last 90 days of GSC data, sort by impressions and then pick the top 10 tool URLs. for each, list the top 10 queries, current position and CTR. then rewrite title/H1/meta and above‑the‑fold copy so they exactly answer the searcher’s wording and promise a clear outcome, not just calculator or generator  \n2) expand those 10 pages with 300-800 words covering: what the tool is for, 2-3 real‑world scenarios, step‑by‑step usage and a short FAQ targeting People Also Ask style questions around that keyword set. this pattern is used in many SEO avalanche case studies that broke out of low‑CTR plateaus  \n3) only after that, run a small, focused link‑building sprint: 5-15 relevant links from niche blogs, directories and resource pages pointing to those core tools and the homepage (no spam, no random swaps). for utility sites, a modest authority bump on the right pages can move you from positions 8-15 to 3-5 which typically yields multi‑x higher CTR\n\nso clearly youre not in a failed zone yet for a 7-8mo utility site especially with AI search compressing clicks. this is the moment where sharpening intent and then layering authority usually decides whether the curve bends up or stays flat.",
          "score": 3,
          "created_utc": "2026-01-29 03:29:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o29ie5h",
          "author": "MrBilal34",
          "text": "look at the top search results for the keywords/search terms you are targeting - write superior content encompassing what top results talk about",
          "score": 2,
          "created_utc": "2026-01-28 18:44:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o29q3h2",
              "author": "Few_Standard_8886",
              "text": "Make sense. Thanks",
              "score": 2,
              "created_utc": "2026-01-28 19:17:20",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o29l8jv",
          "author": "iron_davith",
          "text": "Have you done your keyword research? What do the sites above you rank for? Is their content better?\n\nOr do AI overviews already include everything your pages can do? If so, it's gonna be tough.\n\nA couple of years ago I built a very good calculator for a huge website I owned, made the post better than anything else out there, got decent backlinks to it, and crickets... Couple of clicks a day. Never more. AI overviews just gobbled it up...",
          "score": 1,
          "created_utc": "2026-01-28 18:55:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o29q0q6",
              "author": "Few_Standard_8886",
              "text": "Yes i research the keywords and then write based on that. I have multiple daily utility tools on my website.",
              "score": 2,
              "created_utc": "2026-01-28 19:17:00",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o29muzy",
          "author": "gptbuilder_marc",
          "text": "That line is the tension. You’ve got indexing, impressions, a few clicks, but the curve never really steepens. With utility-style sites it’s usually about whether the bottleneck is authority, intent alignment, or how Google ends up classifying the pages over time. Which pages are actually getting the impressions versus where you expected traction?",
          "score": 1,
          "created_utc": "2026-01-28 19:03:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o29qxci",
              "author": "Few_Standard_8886",
              "text": "Thanks. I do keyword research and target long-tail queries, but CTR is low. I think authority + how Google classifies utility sites is my bottleneck (plus AI overviews reducing clicks). Now focusing on adding use-cases and FAQs around tools.\n\nAt this stage, would you prioritize backlinks or improving existing pages first?",
              "score": 1,
              "created_utc": "2026-01-28 19:21:01",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o29x63r",
                  "author": "gptbuilder_marc",
                  "text": "That’s a pretty reasonable read. One thing people miss at this stage is that “backlinks vs content” is often the wrong fork when impressions are there but CTR stays soft.\n\nWhen Google hasn’t really decided what a utility page is yet, links mostly just amplify whatever classification already exists. If it’s being treated like a thin tool or reference, more authority can mean more impressions without changing how it’s shown or clicked. That’s why the curve stays flat even as visibility creeps up.\n\nWhat usually matters first is whether the page earns a clearer intent label over time. Use cases, FAQs, examples, those aren’t just filler. They’re often the signals that move a page from “functional resource” to “solution someone actually chooses,” which affects snippets, sitelinks, and where clicks go. Once that settles, links start to compound instead of leaking.\n\nThe AI overview point is real too, but I’ve still seen pages get clicks when they’re the obvious next step after the summary, not just the cited source.\n\nOut of curiosity, are most of the impressions hitting the core tool pages, or the surrounding explanatory content you’ve been adding?",
                  "score": 1,
                  "created_utc": "2026-01-28 19:49:10",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2ai2fb",
          "author": "unicorn69love",
          "text": "link building is def the big gap for utility sites like yours cold outreach for guest spots on niche blogs worked for me but its slow af and rejection heavy. also check if AI overviews are sniping your queries cuz thats killed tons of calculators ive seen. patience or pivot to social/video traffic maybe",
          "score": 1,
          "created_utc": "2026-01-28 21:21:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2e30mn",
          "author": "Middle-Anywhere-6865",
          "text": "If you want to grow quickly, run paid ads. Of course, keep doing SEO, but it's a long-term game.",
          "score": 1,
          "created_utc": "2026-01-29 11:06:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2jrmpa",
          "author": "nikolasthefirehand",
          "text": "I was in almost the same spot. I had a tiny utility style site that sat at basically zero traffic for months. SEO was fine on paper, but nothing was happening. Facebook felt completely saturated, so I started digging through Reddit to see how other people were actually getting eyes on their sites.\n\nThat’s when I stumbled into using Reddit more intentionally and later found Odd Angles Media’s Reddit SEO blueprint. After following some of the posting and comment strategies they talked about, I finally started seeing organic traffic and a few legit leads coming in. Not overnight, but enough to prove it worked.\n\nBig thing I learned is backlinks matter, but distribution matters first. If no one ever sees your pages, Google has nothing to react to.",
          "score": 1,
          "created_utc": "2026-01-30 04:54:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2rgaua",
          "author": "spanky1312",
          "text": "links are def the missing piece for utility sites google sees ya but aint trustin yet. i poked around searchtides for ai/geo visibility on a similar calc site but it was meh w/o solid backlinks first. grind haro or niche outreach thats what moved my needle",
          "score": 1,
          "created_utc": "2026-01-31 09:10:27",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qmw08h",
      "title": "Holy cannoli Batman blogging ain’t cheap!",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1qmw08h/holy_cannoli_batman_blogging_aint_cheap/",
      "author": "SoldierofSonder",
      "created_utc": "2026-01-25 21:27:11",
      "score": 6,
      "num_comments": 46,
      "upvote_ratio": 0.65,
      "text": "Hey all, Sonder here I’ve been thinking of starting a blog. The great people of this sub have helped me lots in branding and planning so first I thank you all. Second, what the hell are these prices?! Look I get that nothing in this world is free but jeez do they got me by the balls. Getting a domain and setting up the blog on some sites is like 400 bucks. While on others they provide you with almost nothing to make purchasing a cheaper version worth it!\n\nI’m a writer, I’m dead broke. These things go together like watermelon and spicy chicken (try it before you knock it) obviously I want to build a community or at least be seen as I scream into this void but wow was I not expecting this.\n\nAny tips and tricks for finding a cherish alternative would be appreciated. If you ain’t got that the letting me know whether I’m overreacting or not would be great too! Cheers!",
      "is_original_content": false,
      "link_flair_text": "Tips/Info",
      "permalink": "https://reddit.com/r/Blogging/comments/1qmw08h/holy_cannoli_batman_blogging_aint_cheap/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o1p6ixe",
          "author": "ActuaryMean6433",
          "text": "Get a domain from NameCheap, under $20/year and use Blogger, it’s free, easier than WordPress, and it never goes down.",
          "score": 17,
          "created_utc": "2026-01-25 21:45:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1p822e",
              "author": "SoldierofSonder",
              "text": "You my friend have been the first to offer actual help and I appreciate you immensely for it. I mean I appreciate the other guys too because they make me chuckle but you take the cake! Thank you!",
              "score": 8,
              "created_utc": "2026-01-25 21:52:32",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1po37h",
                  "author": "tinyquiche",
                  "text": "If you’re buying a domain through Namecheap and are still wanting to use Wordpress instead of Blogger, you can also get Namecheap’s hosting for ~$5 a month (year commitment iirc). Not super cheap but not breaking the bank either. \n\nBest of luck with your blog!",
                  "score": 3,
                  "created_utc": "2026-01-25 23:03:38",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1p8pv0",
                  "author": "ActuaryMean6433",
                  "text": "No worries, mate, glad that was helpful.",
                  "score": 2,
                  "created_utc": "2026-01-25 21:55:31",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1ptn0v",
                  "author": "Fred_Fitch",
                  "text": "Just like they said, use blogger it's free. Just buy a domain. You can connect your domain to it for free also within blogger settings. Be sure to enable HTTPS in the blogger settings after you connect your domain.",
                  "score": 2,
                  "created_utc": "2026-01-25 23:29:23",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o1pxzkb",
              "author": "onceuponacheerio",
              "text": "I second this. I also use Blogger. When people tell you that you cannot monetize with free hosting, that's a lie. I've been monetized since 2019. I use porkbun for my domain registrar. I believe the price has gone up since I've started but it's like $11.",
              "score": 5,
              "created_utc": "2026-01-25 23:50:42",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1pimmp",
          "author": "babs82222",
          "text": "LOL! Punctuation comes in handy sometimes! I initially read this as:\n\n\"Holy cannoli! Batman blogging ain't cheap!\" and I was wondering what batman blogging was. Then I realized you meant \"Holy cannoli batman! Blogging ain't cheap!\" lol",
          "score": 13,
          "created_utc": "2026-01-25 22:39:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1plm1v",
              "author": "SoldierofSonder",
              "text": "As a writer this both stings and helps me hone my craft. Thanks babs!",
              "score": 4,
              "created_utc": "2026-01-25 22:52:47",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1ppy3u",
                  "author": "babs82222",
                  "text": "It made me laugh though! So thank YOU!",
                  "score": 4,
                  "created_utc": "2026-01-25 23:11:58",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1p6o0p",
          "author": "Flightlessbutcurious",
          "text": "Where exactly are you getting quoted $400 for a domain, hosting and install? Also, I can do it for $350 if you want. ;)\n\n\n/s, maybe?",
          "score": 6,
          "created_utc": "2026-01-25 21:46:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1p7v40",
              "author": "SoldierofSonder",
              "text": "Some of the premium options on some sites! Hand on the Bible, I don’t think my jaw has actually ever dropped before that moment. As for your offer, undercutting an overpriced service while still knowing your offer is overpriced is textbook business strategy. You do any schooling or you just full of good business ideas because I think we would make a good team ;) (the wink is to show I am kidding and appreciate your comment!)",
              "score": 3,
              "created_utc": "2026-01-25 21:51:39",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1psj4h",
                  "author": "Flightlessbutcurious",
                  "text": "Ahhh, yeah, the premium options. :)  Frankly I don't even look at those, haha. You don't need those at all. \n\n\nBasic hosting is enough - I use Cloudways for $20/month, I get 1600 sessions a month currently on my little blog and no performance issues. Domain name is $10 a year at porkbun. I also pay a couple of subscriptions for Adobe Lightroom and Keysearch, but if you just want to write you won't need those either.\n\n\nYou COULD cut your hosting costs down to $5 a month with some hosting providers who shall not be named... But I migrated because my sanity is worth more than saving $15 a month.",
                  "score": 2,
                  "created_utc": "2026-01-25 23:24:03",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1pfsem",
          "author": "imtrying2listen",
          "text": "Go free [wordpress.com](http://wordpress.com) or cheap theme, cheap domain, cheap hosting, etc.  Don't worry about anything better until you have 25k pageviews in a month.  Most people never make it that far, so it's best to have minimal costs in the event you quit but want to keep it up for posterity.",
          "score": 5,
          "created_utc": "2026-01-25 22:26:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1pxyez",
          "author": "Strokesite",
          "text": "Explore Medium and Substack. You might get more eyeballs on your writing than posting on your own site. I once heard that posting on a blog was akin to printing your stuff on paper and stapling it to a telephone pole — on a busy highway.\n\nThere are billions upon billions of pages on the internet. Finding your content will be difficult. A publication like the two I’ve mentioned receive tons of traffic, increasing your odds of fame and fortune.\n\nAnd they are both FREE.",
          "score": 3,
          "created_utc": "2026-01-25 23:50:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1pziqn",
              "author": "SoldierofSonder",
              "text": "I’m a visual learner so that tip helps, I’ll definitely look into it and I appreciate the advice!",
              "score": 2,
              "created_utc": "2026-01-25 23:57:52",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1pd351",
          "author": "thealeatorist",
          "text": "The sky's the limit in terms of spending, but getting started doesn't need to cost much, or anything really. Besides the domain, no need to pay more than a few dollars a month if you want more options, but even the free options are enough to get started. In most cases, you can also start with a free option and move your content to a more powerful platform later on if you need it. \n\nPersonally, I'm using WordPress for everything, but mostly because I've been using it since it came out. It's overkill for most basic sites. Recently, I've also been using Hostinger's builder and it's pretty decent. It's also free if you have their hosting. \n\nLots of options, no need to spend much.",
          "score": 2,
          "created_utc": "2026-01-25 22:14:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1pmquq",
          "author": "usamaejazch",
          "text": "just get a domain and use it with justblogged.com",
          "score": 2,
          "created_utc": "2026-01-25 22:57:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ppgfy",
          "author": "thewholesomespoon",
          "text": "Yo it’s expensive but I’m finally making money now! If you want to, just do it!🩷",
          "score": 2,
          "created_utc": "2026-01-25 23:09:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1pz3p8",
              "author": "SoldierofSonder",
              "text": "I’m glad to hear you’re making money! I’m always open to any tips and tricks from people like you! Cheers!",
              "score": 1,
              "created_utc": "2026-01-25 23:55:53",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1q6gi1",
          "author": "xylo_dan",
          "text": "I feel you.  It's why I launched my own blog platform.\n\n[xylo.gg](http://xylo.gg)\n\nI started building on it this weekend and have all the bugs out and am ready for users.  Have a solid launch special going on for just $5/month with code LAUNCH.\n\nMany more features to come, like AI agents creating and cross-posting for you based on your blog posts, but for now want to make sure the foundation is solid.\n\nNo upcharge for using your own domain.  Everything is well automated like SSL.  Literally no tech for you to set up and maintain and a nice editing experience.\n\nYou can have your blog up and running in minutes.\n\nNo charge or credit card needed for first 30 days.\n\nHope you like it!",
          "score": 2,
          "created_utc": "2026-01-26 00:31:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1qekku",
              "author": "SoldierofSonder",
              "text": "Nice plug, I’ll have to check it out.",
              "score": 2,
              "created_utc": "2026-01-26 01:11:44",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1qj1lf",
                  "author": "xylo_dan",
                  "text": "Thanks and happy to add any features that are important to you.  My own blogging has been strictly affiliate link based so may need to improve features based on the larger audience.  But I already have a lot of built in.",
                  "score": 2,
                  "created_utc": "2026-01-26 01:34:44",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1q73np",
          "author": "Several-Praline5436",
          "text": "Dude. Just use Substack.",
          "score": 2,
          "created_utc": "2026-01-26 00:34:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1qemzd",
              "author": "SoldierofSonder",
              "text": "Dude. Thank you dude.",
              "score": 1,
              "created_utc": "2026-01-26 01:12:04",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1ride4",
          "author": "JTMakeOneMove",
          "text": "I started a blog back in November.  Bought a domain name ($20), got it hosted ($5/month), started writing on Ghost ($9/month).  No monetization as this is just my self-exploration - digitally, publicly - as a way to hold myself accountable, I guess.  I do feel like I am screaming into the void every week - have about 40 readers that actually read each week (started with 10 friends, and the rest - no clue how they found the blog).  As this is my first foray into blogging, it feels odd that most people email me rather than commenting on the blog itself - which is encouraging in a way!    \n  \nGave myself six months of budget to try this and see:  \n1) If I enjoy it  \n2) If I am learning new things  \n3) If it's sustainable with the time investment  \n4) If it's worth the $$",
          "score": 2,
          "created_utc": "2026-01-26 04:50:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1rnqcz",
          "author": "SuperLowBudge",
          "text": "I’ve had my blog for a long time on Blogger for free. You have to use a separate product (also free) for email subscription and Follows (Google cancelled both) but I haven’t found a better platform. Getting it indexed by Google takes awhile though. You practically have to jump up and down waving your arms screaming and flip the table. Blog link in profile.",
          "score": 2,
          "created_utc": "2026-01-26 05:26:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1p3wvy",
          "author": "JTSwagMoney",
          "text": "What exactly is expensive?",
          "score": 1,
          "created_utc": "2026-01-25 21:34:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1p51uj",
              "author": "SoldierofSonder",
              "text": "Starting the blog, getting the domain and actually building the blog. Wordpress has a couple of options but it’s like 80-90 bucks when all is said and done. Not a crazy amount but like I said. I’m broke😂",
              "score": 0,
              "created_utc": "2026-01-25 21:39:11",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1qbhj7",
                  "author": "Impossible-Sleep291",
                  "text": "Check out Webador. I’ve used them in the past. They host, give you an email, domain, e-commerce if you like, and their most expensive monthly package is $36 or $32. I think the first three months are $1 too. Very user friendly, SEO is easy to use, huge library of stock photography included, forms for newsletter sign up. Draw backs: they don’t have telephone support but are very quick to respond to email. *I don’t work for them, nor am I an affiliate.",
                  "score": 2,
                  "created_utc": "2026-01-26 00:56:12",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1p4oki",
          "author": "Captlard",
          "text": "What are you talking about? What is costing money?",
          "score": 1,
          "created_utc": "2026-01-25 21:37:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1pc7n1",
              "author": "SoldierofSonder",
              "text": "The domains and such, but all these nice people have helped me realize I was looking in ridiculously overpriced places",
              "score": 1,
              "created_utc": "2026-01-25 22:10:48",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1ph2gx",
                  "author": "Captlard",
                  "text": "Blogger, substack, wordpress, wix, medium are just a few low cost options. Hosting can be very cheap these days.",
                  "score": 2,
                  "created_utc": "2026-01-25 22:32:23",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1pbcnb",
          "author": "Russ915",
          "text": "Domains are like 10-20 and 5 a month for hosting",
          "score": 1,
          "created_utc": "2026-01-25 22:06:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1pbwwy",
              "author": "SoldierofSonder",
              "text": "Yk Russ I believe the internet is made for asking questions. I appreciate you for answering mine, here I was expecting more snark. Thank you mate!",
              "score": 0,
              "created_utc": "2026-01-25 22:09:28",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1pe22h",
                  "author": "Russ915",
                  "text": "I mean it depends what your goal is . If you just want to get your content out there you could start a medium , contribute to hacker noon, or start a beehiiv/sub stack as well",
                  "score": 2,
                  "created_utc": "2026-01-25 22:18:58",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1pkbjk",
                  "author": "ReasonableExcuse2",
                  "text": "No shame in asking questions, especially when this is your first day on interent. Good luck, you are up for a wild ride.",
                  "score": 2,
                  "created_utc": "2026-01-25 22:46:57",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1qcnbh",
          "author": "Impossible-Sleep291",
          "text": "Has anyone used Ghost? I just heard about it and am curious what those what those who have used it or looked into it think?",
          "score": 1,
          "created_utc": "2026-01-26 01:01:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1qfw8n",
          "author": "Aliceka_com",
          "text": "What’s your plan with your blog? What do you want to use it for, how would you like to monetize? \n\nI’m asking because you’ve got some good tips here already, including free options, but they may not work with your overall goals for this site.\n\nEither way, it can be done way cheaper and if you do decide to go with self hosted Wordpress, there are some services you can use for hosting and domain that I’m too lazy to look up now not knowing if you will need them (but I will if you’re interested).",
          "score": 1,
          "created_utc": "2026-01-26 01:18:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1qvy4i",
              "author": "SoldierofSonder",
              "text": "Is encouraging critical thinking and pushing young people to read more to develop their hearts and minds a good pitch? If not I guess it’s a literature blog :) Promoting some of my own writing would also be cool but mostly just the first part.",
              "score": 2,
              "created_utc": "2026-01-26 02:40:07",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1qyqtw",
                  "author": "Aliceka_com",
                  "text": "If it’s purely this, and you don’t plan on selling your products, having services pages, regular sponsorships etc. then I think a free platform with a somewhat built in audience would be the best for you - look into things like Substack and Medium. You can still add your links in there but it’s way easier and did I mention free (?) that way ;) all the best with your endeavour, we all need more of critical thinking and hearts and minds development!",
                  "score": 2,
                  "created_utc": "2026-01-26 02:54:13",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1rrg4v",
          "author": "Valuable-Laugh6239",
          "text": "hey you cam get hosting from namecrane for $8 per year and .com domains are $6 on unstoppable domains on friday.",
          "score": 1,
          "created_utc": "2026-01-26 05:53:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1p58yd",
          "author": "ReasonableExcuse2",
          "text": "I guess you cannot afford 2 Starbuck's coffes as well.",
          "score": 1,
          "created_utc": "2026-01-25 21:40:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1p62y1",
              "author": "SoldierofSonder",
              "text": "Not a big fan of Starbucks coffee, multimillion dollar corporations suck the creativity from my soul. And you must have one fancy order to be racking up those prices. I would love to hear it! Cheers!",
              "score": 3,
              "created_utc": "2026-01-25 21:43:41",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qqnnf2",
      "title": "Blogging in 2026: The compliance curveball bloggers should know about",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1qqnnf2/blogging_in_2026_the_compliance_curveball/",
      "author": "Italcan",
      "created_utc": "2026-01-29 22:44:48",
      "score": 6,
      "num_comments": 1,
      "upvote_ratio": 1.0,
      "text": "Been blogging since 2019. Three sites, mixed niches, decent traffic. Thought 2025's big challenge would be content flooding or Google algo updates. Nope. It's accessibility compliance.\n\nTwo of my blogs have EU audiences. Just found out about EAA 2025 - June deadline, mandatory WCAG 2.2 compliance, fines that'll make your hosting bill look like pocket change. Suddenly my \"good enough\" designs are liability traps.\n\nI prided myself on clean aesthetics. Minimalist themes, subtle colors, sleek navigation. Turns out \"subtle\" often means \"invisible to screen readers\" or \"unusable for keyboard navigation.\"\n\nMy food blog had recipe cards with gorgeous low-contrast text - light gray on white for \"elegant\" typography. WCAG wants 4.5:1 minimum. Had to darken everything. Looks \"less premium\" but actual humans can read ingredient lists now.\n\nFocus indicators were another blind spot. Removed default browser outlines for that polished look. Keyboard users? Completely lost. WCAG 2.2 specifically tightened focus appearance rules - minimum size, contrast, not obscured by other elements.\n\nThen there's target size. My \"clean\" social sharing buttons? 20x20px. WCAG 2.2 requires 24x24px minimum. Had to redesign entire component.\n\nAnyone else scrambling? Found tools that don't require hiring accessibility devs? Curious what design compromises you've made for compliance vs. aesthetics?",
      "is_original_content": false,
      "link_flair_text": "Tips/Info",
      "permalink": "https://reddit.com/r/Blogging/comments/1qqnnf2/blogging_in_2026_the_compliance_curveball/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o2i6i7l",
          "author": "gptbuilder_marc",
          "text": "Yeah, this one sneaks up on people fast. It’s not even WCAG itself, it’s how suddenly it stops being an SEO or UX thing and turns into legal risk. What’s eaten the most time so far, figuring out what actually counts, auditing what you already have, or trying to fix components without blowing up the site?",
          "score": 3,
          "created_utc": "2026-01-29 23:30:28",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qmg0mx",
      "title": "Guidance on my career path",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1qmg0mx/guidance_on_my_career_path/",
      "author": "Lazy_Teach4570",
      "created_utc": "2026-01-25 10:47:28",
      "score": 5,
      "num_comments": 3,
      "upvote_ratio": 1.0,
      "text": "Hello, I would like to know if my strategy is correct since I am a complete beginner to blogging or not. I have been working as a freelance content writer since I was 15, which has helped me pay the family bills. I thought of starting a blog as a hobby on defence and military matters, since that is where my interest lies. I really like learning about military affairs. So, I decided on using Blogger at first and then go professional later on after I get the hang of it. Is this a valid strategy or not, or should I change it a bit?",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/Blogging/comments/1qmg0mx/guidance_on_my_career_path/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o1lknez",
          "author": "kubrador",
          "text": "sounds solid honestly. blogger's free so worst case you waste nothing but time, and if you actually stick with it you'll figure out what works before spending money. plus you already know how to write so you're not starting completely lost like most people.\n\nonly thing i'd say is don't spend three years \"getting the hang of it\" before moving platforms. move to wordpress or whatever when you've got like 20-30 decent posts and some actual traffic, not when you feel \"ready.\"",
          "score": 1,
          "created_utc": "2026-01-25 10:58:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1lmefk",
          "author": "WebsiteCatalyst",
          "text": "I would blog about who pays the most.",
          "score": 1,
          "created_utc": "2026-01-25 11:13:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1mwm3j",
          "author": "bluehost",
          "text": "Starting on Blogger as a learning phase is totally fine if your goal is to build the habit and get comfortable publishing. The platform matters a lot less early on than actually writing and learning what works for you.\n\nWriting about defense and military topics because you genuinely enjoy them is a solid foundation. You can always move platforms later once you're clearer on your direction and what kind of content you want to invest more seriously in.",
          "score": 1,
          "created_utc": "2026-01-25 15:53:55",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qra9nk",
      "title": "Why did a specific blog post of yours do better than you expected?",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1qra9nk/why_did_a_specific_blog_post_of_yours_do_better/",
      "author": "Gullible-Specific-49",
      "created_utc": "2026-01-30 16:30:54",
      "score": 5,
      "num_comments": 19,
      "upvote_ratio": 0.86,
      "text": "Often times, when I crank out a good blog post, the readers think otherwise.  I'm not too great at blogging so I don't mind.  The other day though, I had a blog post do much better than expected (six people commented vs. the typical one person, woohoo!).  It got me thinking that it may have been the use of a certain word in the title that did well for online searches related to my niche.  Anyways, I'd love to hear from this community about similar stories.  Which blog post of yours took off unexpectedly and why did you think that happened?",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/Blogging/comments/1qra9nk/why_did_a_specific_blog_post_of_yours_do_better/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o2mo1lx",
          "author": "Captlard",
          "text": "No idea why. But it got published in a newsletter and got me 58k visits in a month. Normally about 2k a week.",
          "score": 5,
          "created_utc": "2026-01-30 16:36:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2nioqm",
              "author": "Gullible-Specific-49",
              "text": "Sweet! Have they reached out since?",
              "score": 2,
              "created_utc": "2026-01-30 18:51:21",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2no9t2",
                  "author": "Captlard",
                  "text": "They never asked.",
                  "score": 2,
                  "created_utc": "2026-01-30 19:16:12",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2mv81f",
          "author": "Vinaya_Ghimire",
          "text": "Most of my high performing blog posts are on the topics that haven't heavily explored online, are long, and well written and well structured.",
          "score": 3,
          "created_utc": "2026-01-30 17:08:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2nitwu",
              "author": "Gullible-Specific-49",
              "text": "Awesome! How long do you typically shoot for for your blog posts?",
              "score": 2,
              "created_utc": "2026-01-30 18:51:59",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2rz3l6",
                  "author": "Vinaya_Ghimire",
                  "text": "I aim for 1500-2500 words",
                  "score": 2,
                  "created_utc": "2026-01-31 12:04:00",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2n4gz8",
          "author": "ThePanasonicYouth",
          "text": "1. it answered questions around a certain band which brought in tons of evergreen/organic traffic\n2. the article shows up on the first page of google when searching for said band\n3. now i'm constantly getting paid offers that cover my rent/expenses (know your worth)",
          "score": 3,
          "created_utc": "2026-01-30 17:49:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2n6dpq",
              "author": "Writingisaneed16",
              "text": "what kind of offers? Brand deals?",
              "score": 2,
              "created_utc": "2026-01-30 17:57:55",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2n7nkk",
                  "author": "ThePanasonicYouth",
                  "text": "getting paid for guest posts",
                  "score": 2,
                  "created_utc": "2026-01-30 18:03:27",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o2nin3h",
              "author": "Gullible-Specific-49",
              "text": "That's awesome! What genre of music for the band?",
              "score": 1,
              "created_utc": "2026-01-30 18:51:09",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2nqnfj",
                  "author": "ThePanasonicYouth",
                  "text": "Hard to say since they blend multiple genres",
                  "score": 2,
                  "created_utc": "2026-01-30 19:26:56",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2r7n1d",
          "author": "hondanlee",
          "text": "In 1985, I wrote a letter to the *South China Morning Post* (Hong Kong) commenting on attempts to suppress democracy in the territory. I decided to reproduce this letter on my blog in 2016, and it became my most widely read post (4-79k views and 47 comments).",
          "score": 3,
          "created_utc": "2026-01-31 07:49:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2sr4z2",
              "author": "Gullible-Specific-49",
              "text": "That's a ton! Awesome to keep track of that letter for so long too.",
              "score": 1,
              "created_utc": "2026-01-31 15:02:37",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2rdekf",
          "author": "Ok-Valuable-714",
          "text": "I wrote a post about the cultural shock of travelling to Saudi Arabia as a woman. I only shared it on Reddit and it got me 5,000 visitors in a few days, and hundreds of comments on Reddit. Since then, I changed my blog name, gave it a slightly new direction, and it's still the most read post on my blog, even months after.\n\nWhy? I think because the subject is divisive and that brings traction and interest. Some readers agreed with my experience, other criticised it, some readers argued with each other... it was a bit wild!",
          "score": 2,
          "created_utc": "2026-01-31 08:43:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2sr85b",
              "author": "Gullible-Specific-49",
              "text": "Awesome perspective to bring and teach others about, very cool!",
              "score": 1,
              "created_utc": "2026-01-31 15:03:05",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2rel32",
          "author": "digitaldisgust",
          "text": "It was breaking news at the time, lol. Still my highest read article to date, I got de-indexed not long after though 🤣☠️",
          "score": 2,
          "created_utc": "2026-01-31 08:54:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2sra8e",
              "author": "Gullible-Specific-49",
              "text": "Cool to get in early and it happens!",
              "score": 1,
              "created_utc": "2026-01-31 15:03:25",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qqej2n",
      "title": "Can you recommend some best web hosting for travel bloggers",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1qqej2n/can_you_recommend_some_best_web_hosting_for/",
      "author": "Dramatic-Passage-963",
      "created_utc": "2026-01-29 17:11:56",
      "score": 4,
      "num_comments": 13,
      "upvote_ratio": 0.75,
      "text": "Hey everyone, I'm new to this independent blogging. So, I need some best web host which r affordable, begginer friendly and works completely fine, even tho I post 15-20 blogs a month. \n\nAlso, one more question, are blue host  or hostlinger, that bad?? I was going to get one of them as they were affordable. However, I did some research and they had insane amount of ad reviews. ",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/Blogging/comments/1qqej2n/can_you_recommend_some_best_web_hosting_for/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o2g01bs",
          "author": "Charming-Tear-8352",
          "text": "Are you coding the website yourself?\n\nI find Cloudflare Pages to be the best for hosting. They have unlimited bandwidth and great performance.",
          "score": 2,
          "created_utc": "2026-01-29 17:17:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2g0mwl",
              "author": "Dramatic-Passage-963",
              "text": "Yes, but I have no coding skills",
              "score": 1,
              "created_utc": "2026-01-29 17:19:52",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o2g0tbj",
              "author": "Dramatic-Passage-963",
              "text": "How much does cloudflare cost? I have heard abt it alot",
              "score": 1,
              "created_utc": "2026-01-29 17:20:40",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2g5ar8",
                  "author": "Charming-Tear-8352",
                  "text": "Cloudflare doesn't cost anything for static sites. For a travel blog you most likely will be making a static site. \n\nIf you know some coding, [Jekyll](https://jekyllrb.com) is a good place to start. If you don't know coding or want something simple and quick, try [tlblog](https://tlblog.site).\n\nThese are static site generators that will help you generate your site for free and let you host on Cloudflare Pages or Netlify.",
                  "score": 1,
                  "created_utc": "2026-01-29 17:41:01",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o2gt62m",
              "author": "usamaejazch",
              "text": "I built [justblogged.com](http://justblogged.com) just for these benefits but without requiring any coding skills. \n\nJustBlogged is hosted on Cloudflare's global infrastructure.",
              "score": 1,
              "created_utc": "2026-01-29 19:29:07",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2j8u5p",
          "author": "JackTheMachine",
          "text": "No... No... Avoid Blue. You better go with Hostinger. If I can recommend, you can try Asphostportal, not big company, but I've been with them for years and service is good. They fully support Wordpress",
          "score": 2,
          "created_utc": "2026-01-30 03:00:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2jdb0l",
              "author": "Dramatic-Passage-963",
              "text": "Can u give me some reasons y I should go with asphostportal?",
              "score": 1,
              "created_utc": "2026-01-30 03:26:07",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2jfa4t",
                  "author": "JackTheMachine",
                  "text": "Hmm... This is only my personal experience, for me, they are good and stable, plus what I love is they keep renewal price low, most of big providers will cost 3 times higher for renewal. But, you can always choose Hostnger too, for small project, they should be OK. The choice is on your hand. Good luck!",
                  "score": 1,
                  "created_utc": "2026-01-30 03:37:32",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2gag9j",
          "author": "xylo_dan",
          "text": "You can try the no-code option I just launched.  [xylo.gg](http://xylo.gg)\n\nEasy to use, and will be adding new features every week focused on AI assisted, automated, human in the loop cross-posting and scheduling.\n\nNo credit card required for first 30 days and use code LAUNCH to get $5/month.  Be one of the early users and lock in $7 for life.\n\nI'll be deeply in tune with my early users and build features that you need.",
          "score": 1,
          "created_utc": "2026-01-29 18:03:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2gdyx5",
          "author": "ImOdysseus",
          "text": "Any managed wordpress hosting will suit you. Managed means they take care of updates and such. Wordpress .com recently has included plugins on all plans, even basic ones. There are hosting comparators like this one https://www.toolpile.net/best-web-hosting-finder-compare-in-1-minute/",
          "score": 1,
          "created_utc": "2026-01-29 18:19:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2gt229",
          "author": "usamaejazch",
          "text": "if you want something for free and flexible, try [justblogged.com](http://justblogged.com)",
          "score": 1,
          "created_utc": "2026-01-29 19:28:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2jj6qy",
          "author": "mannyned2",
          "text": "If you’re new to blogging and publishing 15–20 posts a month, you don’t need perfect hosting — just something affordable and reliable. Bluehost and Hostinger aren’t as bad as the reviews make them seem; they’re heavily advertised, which skews opinions, but they’re fine for starting and you can always migrate later. Other solid beginner-friendly options include SiteGround or Cloudways if you want better performance. You can also consider Substack, which removes hosting complexity entirely and lets you focus purely on writing and growing an audience. That said, hosting isn’t usually the biggest bottleneck early on — distribution is. Writing consistently matters, but getting your posts seen matters more. That’s where ReGenr.app helps: it’s a creator-first platform (currently in beta) that automatically shares your blog posts across social platforms when you publish, so your content doesn’t just rely on SEO. The goal is simple: write once, distribute everywhere, and grow without burning out.",
          "score": 1,
          "created_utc": "2026-01-30 04:00:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2jydnz",
          "author": "Holiday-Oil2598",
          "text": "15-20 is aggressive. If you want to build at scale, use something that let’s you scale easily. I’ve been on Wordpress forever, own a few travel style blogs and have done the blue host then then thing. Everything I have is now hosted in Vercel and is a react app using markdown for pages. It’s a game changer. If you want to take your site seriously I would ditch Wordpress, get a $20 Claude pro license, and vibe code the perfect react website. Might sound daunting, but I promise Claude is up to the task these days a you will be essentially free hosting for a long time.",
          "score": 1,
          "created_utc": "2026-01-30 05:42:09",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qro9w7",
      "title": "How would you promote, and get the first 100 visitors to your blog if you start again?",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1qro9w7/how_would_you_promote_and_get_the_first_100/",
      "author": "StevenJang_",
      "created_utc": "2026-01-31 01:14:34",
      "score": 4,
      "num_comments": 4,
      "upvote_ratio": 0.75,
      "text": "It's 2026, the year of TikTok and AI.\n\nWhat would be the best playbook for new blogs, in your opinion?",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/Blogging/comments/1qro9w7/how_would_you_promote_and_get_the_first_100/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o2pov3j",
          "author": "useomnia",
          "text": "Hot take: don’t “promote a blog.” Promote a problem you solve. The blog is just the receipt. 100 visitors is like 20 good comments and 5 people who go “wait, can you expand on that?”",
          "score": 1,
          "created_utc": "2026-01-31 01:23:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2pplyb",
              "author": "StevenJang_",
              "text": "What AI did you use to generate this comment?",
              "score": 1,
              "created_utc": "2026-01-31 01:27:46",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2pq737",
                  "author": "useomnia",
                  "text": "an AI called procrastination and caffeine. Runs locally. Bugs constantly",
                  "score": 1,
                  "created_utc": "2026-01-31 01:31:14",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2pueet",
          "author": "Intrepid-Fox-266",
          "text": "I tell you what I wouldn't do again. I wouldn't launch a memecoin to try and promote my blog. I ended up getting tons of traffic, but it was the wrong kind of traffic... I kinda got pigeonholed as a crypto site when I just wanted to write about funny tech stories.",
          "score": 1,
          "created_utc": "2026-01-31 01:56:06",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qrkl98",
      "title": "Blogger here – is anyone still running a calm lifestyle / home blog in 2026?",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1qrkl98/blogger_here_is_anyone_still_running_a_calm/",
      "author": "Lilia_leach",
      "created_utc": "2026-01-30 22:42:56",
      "score": 4,
      "num_comments": 5,
      "upvote_ratio": 0.83,
      "text": "Hi 🙂\n\nI run a calm lifestyle & home blog where I write about simple routines and systems that make everyday life feel easier. I’ve been blogging consistently for about 8 months now.\n\nMost of my traffic comes from Pinterest at the moment, and Google still feels very slow, so I’m curious about other people’s experiences.\n\nAre you still blogging in 2026?\n\nDid Google take a long time to pick up for you too, or did you start seeing traffic earlier?\n\nThanks so much 🤍",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/Blogging/comments/1qrkl98/blogger_here_is_anyone_still_running_a_calm/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o2qu8j8",
          "author": "marshmallowtrex",
          "text": "Highly recommend signing up for Google Search Console. It's free, and you can submit URLs directly to Google so they index them faster. I see turnaround in about 24-ish hours.",
          "score": 3,
          "created_utc": "2026-01-31 05:52:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2q8lgl",
          "author": "GrowthZen",
          "text": "Yes, still blogging in 2026... i moved back to my own domain after relying on pinterest for 8mos and learning that google typically takes 3-6mos to index new sites. lifestyle blogs like yours often get 80%+ of their early traffic from pinterest while google builds more slowly after the rise of AI overviews (now about 60% of searches are no‑click). i switched to an owned platform... traffic stabilized and i no longer worry about algorithm changes. what’s your top pinterest pin driving visits?",
          "score": 2,
          "created_utc": "2026-01-31 03:21:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2qzip3",
          "author": "Mental-Goal-8724",
          "text": "May I ask how you guys get traffic through Pinterest?",
          "score": 2,
          "created_utc": "2026-01-31 06:35:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2razha",
          "author": "Building-WW",
          "text": "I’d honestly suggest learning some basic on-page SEO if you haven’t already. \n\nA lot of lifestyle blogs I’ve seen only start getting meaningful Google traffic after 12–18 months, once there’s enough depth and consistency for Google to understand what the site is really about. \n\nHow much traffic are you actually getting from Pinterest right now? Like rough daily or monthly numbers??",
          "score": 2,
          "created_utc": "2026-01-31 08:20:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2rmso9",
          "author": "Reasonable_Branch_13",
          "text": "Im not but is something that I would love to do, but unfortunately I don’t know how.",
          "score": 1,
          "created_utc": "2026-01-31 10:12:59",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qlwg1i",
      "title": "When to Quit Blogging (After 10 Years of Doing It)",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1qlwg1i/when_to_quit_blogging_after_10_years_of_doing_it/",
      "author": "Key_Question5584",
      "created_utc": "2026-01-24 19:32:47",
      "score": 3,
      "num_comments": 8,
      "upvote_ratio": 0.6,
      "text": "As I love blogging, sometimes I have self-doubt about the future of blogging. Will AI end blogging? Is Google not ranking content blogs? Is blogging the right way to get rich, etc.?\n\nIt makes me lazy and unproductive sometimes.\n\nI have been blogging for the last 10 years, and many times I have wanted to quit blogging.\n\nBut the only thing that stops me from doing so is the regular cash flow and passive income from it, even though I don’t work on my blogs for months.\n\nMost importantly, whenever I search my competitor blogs’ traffic on SEMRUSH and see a spike in their traffic, I get anxiety about what I am doing, and I immediately start working.\n\nI have a list of my competitor blogs. Whenever I open my SEMRUSH account, the first thing I do is check their traffic graph. Until they get traffic, my blog still has hope.\n\n**I will quit blogging when all my competitors' blogs’ traffic becomes zero. Until then, I will continue blogging.**\n\nSo, have a list of at least 3 to 5 competitor blogs in your niche. They should not be company websites or forums; they should be pure content niche blogs.",
      "is_original_content": false,
      "link_flair_text": "Tips/Info",
      "permalink": "https://reddit.com/r/Blogging/comments/1qlwg1i/when_to_quit_blogging_after_10_years_of_doing_it/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o1hmarj",
          "author": "Holiday-Oil2598",
          "text": "Will ai end Reddit. Sometimes posts like these make me think so",
          "score": 8,
          "created_utc": "2026-01-24 20:17:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1lct36",
          "author": "ankhang93",
          "text": "Writers quit all the time. You have a whole life ahead to do something else if writing doesn't bring you joy or money anymore.",
          "score": 2,
          "created_utc": "2026-01-25 09:48:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1leo1f",
          "author": "Inevitable_Heron_947",
          "text": "Can you suggest some niche or some good example blog? Please.",
          "score": 2,
          "created_utc": "2026-01-25 10:05:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1sy16c",
              "author": "Own_Limit_406",
              "text": "I've been at this for a few years now, mostly in personal finance and productivity niches. A good example is something like Get Rich Slowly – it's a straight up content blog that's been around forever and still pulls traffic. For something more niche, check out The Penny Hoarder for money saving tips. If you're into tech, maybe blogs like Lifehacker, though that's bigger. Just pick ones similar to your style and track them like OP said. Helps keep the motivation going without overthinking it.",
              "score": 1,
              "created_utc": "2026-01-26 11:56:38",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2d1x1w",
          "author": "GrowthZen",
          "text": "Interesting thing is the data still backs your instinct to keep going. independent blogs are far from dead: global blog readership is projected to pass 3.1B people by 2027 and WordPress alone reports millions of new posts published daily even after the AI boom. at the same time, Semrush, Ahrefs and similar tools show that long-form, topic-focused blogs consistently attract the bulk of organic clicks in most niches. while AI answer boxes tend to dominate head terms but not the long tail where most conversions happen.\n\non your quit when competitors hit zero rule... industry data suggests the opposite usually happens in durable niches. when one serious content site dies, its search demand and links usually consolidate into the remaining players instead of disappearing. so as long as you see traffic on those Semrush graphs, it signals there is still real demand and ad/affiliate budgets flowing into the niche. some ad networks even report that display and native ad spend on independent content sites has kept growing year over year despite AI. Because brands still want contextually relevant human environments for their campaigns.\n\nwhere AI really changes the game is on the production side and not the demand side. tools lowered the cost of publishing but Google’s guidelines still explicitly reward first‑hand experience, originality and people‑first content... exactly what long‑term bloggers like you have and most AI‑spam sites don’t. if you already have 10yrs of history and recurring cash flow then you statistically sit in the top few percent of blogs globally... most never make a cent or die within two years.\n\ngiven that, your competitor-list habit is actually a rational moat check. as long as:   \n1) search volume exists   \n2) your competitors still earn traffic  \n3) you have a content or brand edge you can deepen, the data says your upside isn’t capped yet... it’s compounding",
          "score": 2,
          "created_utc": "2026-01-29 05:41:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1j9mxf",
          "author": "easytoolsdev",
          "text": "Your competitor monitoring strategy is actually brilliant - it's both a reality check and a motivation tool. The passive income aspect is huge too; most people don't realize how valuable it is to have something that generates money while you're not actively working on it. The anxiety you feel when competitors spike is normal, but you're channeling it productively rather than letting it paralyze you. Ten years is serious staying power. The blogs that survive aren't the ones that never doubt, they're the ones that keep going despite the doubt.",
          "score": 2,
          "created_utc": "2026-01-25 01:13:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o20aepy",
          "author": "Con01010",
          "text": "May I contact you?",
          "score": 1,
          "created_utc": "2026-01-27 12:56:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1mm9d1",
          "author": "Holiday-Oil2598",
          "text": "Did semrush hire foreign spammers int a campaign to do this? Easier than improving their product? Only reason I can think of for a post like this to exist",
          "score": 0,
          "created_utc": "2026-01-25 15:05:59",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qommse",
      "title": "What should beginners look for in WordPress hosting?",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1qommse/what_should_beginners_look_for_in_wordpress/",
      "author": "AttitudeImportant134",
      "created_utc": "2026-01-27 18:46:28",
      "score": 3,
      "num_comments": 4,
      "upvote_ratio": 1.0,
      "text": "Choosing WordPress hosting can be confusing for beginners because most people only talk about price. In reality, the quality of hosting affects almost everything about your website, including speed, user experience, and even how well it can rank on search engines.\n\nFrom what I’ve learned, the three most important things to look at are speed, reliability, and customer support. Speed matters because visitors don’t like waiting. If a page takes too long to load, most people just leave. Search engines also prefer faster websites, so slow hosting can hurt your rankings over time.\n\nReliability is another big factor. If your hosting has frequent downtime, your site may be unavailable when people try to visit it. This can be frustrating for users and can make your website look unprofessional. For anyone planning to grow a blog or niche site, uptime is something that should not be ignored.\n\nSupport is especially important for beginners. When you are new to WordPress, small issues can feel big because you may not know how to fix them. Having access to helpful support can save a lot of time and stress. Even simple things like installing WordPress or setting up email can become easier with good support.\n\nFor beginners, hosting should ideally be:\n• Easy to set up  \n• Affordable  \n• Stable and fast  \n• Suitable for SEO and monetization  \n\nA lot of people start with the cheapest hosting they can find. While that can work for very small sites, it often comes with slow speed and limited resources. Over time, this can affect traffic and user experience. Switching hosting later is possible, but it can be inconvenient, so choosing something decent from the start can be a better long-term decision.\n\nAnother thing to consider is how hosting affects monetization. If someone wants to use ads or affiliate links in the future, website performance becomes more important. A fast and stable site keeps visitors longer, which can improve engagement and make monetization more effective.\n\nWhat helped me was reading guides that explain hosting in simple terms instead of just pushing one company. Comparing cheap hosting versus more reliable options made it easier to understand what you are actually paying for. Things like server quality, security, and scalability matter more than most beginners realize.\n\nI think the best approach is to treat hosting as the foundation of your website. Content is important, but if the foundation is weak, everything else becomes harder. Spending a bit of time learning what makes hosting “good” can prevent problems later.\n\nI’m curious what others here are using for their WordPress sites. Did you start with cheap hosting or something more reliable? And did you notice any difference in speed or stability over time?\n\n",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/Blogging/comments/1qommse/what_should_beginners_look_for_in_wordpress/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o230jrq",
          "author": "AgainstEvilll",
          "text": "I am using [hostinger](https://hostinger.in?REFERRALCODE=ENLMOMINSW70), and it is reliable",
          "score": 1,
          "created_utc": "2026-01-27 20:26:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o233u78",
              "author": "AttitudeImportant134",
              "text": "Thanks for sharing! I’ve heard good things about Hostinger too.\nDid you notice any speed improvement after switching?",
              "score": 2,
              "created_utc": "2026-01-27 20:41:35",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2345bf",
                  "author": "AgainstEvilll",
                  "text": "Barely faced any speed issue\nBut, do a proper survey/research before getting it",
                  "score": 1,
                  "created_utc": "2026-01-27 20:42:58",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qpnl3f",
      "title": "mediavine or raptive - thoughts?",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1qpnl3f/mediavine_or_raptive_thoughts/",
      "author": "poorpatheticplanet",
      "created_utc": "2026-01-28 20:51:00",
      "score": 3,
      "num_comments": 5,
      "upvote_ratio": 1.0,
      "text": "hi all - i have a website monetized with adsense. currently 27k monthly traffic, mostly US, niche craft topic, earning about $280-350 ish per month with ads (traffic increased recently so its hard to give a good average of earnings).\n\ni’m thinking of applying to mediavine journey or raptive but im just not sure if i should or if i should wait and increase my traffic more.\n\nas far as raptive goes- im worried my traffic will go down and i wont be within their requirements anymore (25k traffic per month). i believe im having a seasonal increase right now so i dont know how traffic will look in the next few months. and as far as mediavine goes- ive heard some horror stories of people getting much lower rpm with journey than they had with adsense. if possible i’d love insight from people who have experience with either of these networks. ",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/Blogging/comments/1qpnl3f/mediavine_or_raptive_thoughts/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o2amiiy",
          "author": "Icy-Papaya-2967",
          "text": "You should still apply to raptive. Once you get in you won’t get kicked out even if your site goes below 25k visits. It may even increase - Raptive gives its publishers with gate kept strategies on their blog.",
          "score": 1,
          "created_utc": "2026-01-28 21:40:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2asz7e",
              "author": "poorpatheticplanet",
              "text": "oh thanks, i saw on their site that the do ongoing evaluations so i wasn’t sure. are you with them?",
              "score": 1,
              "created_utc": "2026-01-28 22:08:54",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2b0rwe",
                  "author": "Icy-Papaya-2967",
                  "text": "Yes. I am in their insider program. Also used Mediavine’s main program before switching to them but the biggest non negotiable was that Mediavine pays on net 65 terms which is like waiting for two months to get paid. I don’t know about most people but I got bills to pay. Raptive on the other hand operates on net 45 terms",
                  "score": 1,
                  "created_utc": "2026-01-28 22:45:24",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}