{
  "metadata": {
    "last_updated": "2026-02-03 02:59:57",
    "time_filter": "week",
    "subreddit": "Blogging",
    "total_items": 20,
    "total_comments": 152,
    "file_size_bytes": 165960
  },
  "items": [
    {
      "id": "1qt9dx0",
      "title": "My blog made $298 in January 2026 from AdSense.",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1qt9dx0/my_blog_made_298_in_january_2026_from_adsense/",
      "author": "Key_Question5584",
      "created_utc": "2026-02-01 20:14:18",
      "score": 42,
      "num_comments": 22,
      "upvote_ratio": 0.96,
      "text": "The first few days of January were slow because of the festival season in India. But after 15th Jan, both traffic and income started coming back to normal.\n\nIn total, I got around **1,13,000 page views** with an **RPM of $2.63**.\n\nIncome dropped compared to December 2025, but this is normal, every year, income drops during the first few months.\n\nSome of my new blog posts (written in the last few months) also started getting traffic. That really motivates me to keep blogging.\n\nMy blog is a pure content blog, and the niche is employee-related, such as resume templates, career advice, job portal guides, etc.\n\n",
      "is_original_content": false,
      "link_flair_text": "Progress Report",
      "permalink": "https://reddit.com/r/Blogging/comments/1qt9dx0/my_blog_made_298_in_january_2026_from_adsense/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o3161i3",
          "author": "Captlard",
          "text": "Well done!",
          "score": 4,
          "created_utc": "2026-02-01 20:19:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o318eia",
          "author": "writerapid",
          "text": "That’s pretty sweet.",
          "score": 3,
          "created_utc": "2026-02-01 20:31:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o31nuxg",
          "author": "Girlpowerxx",
          "text": "Thats Nice ! Did you advertised your posts ?",
          "score": 2,
          "created_utc": "2026-02-01 21:46:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o32jm23",
              "author": "Key_Question5584",
              "text": "No, I don't advertise.\nAll page views are from search results (SEO).",
              "score": 6,
              "created_utc": "2026-02-02 00:34:35",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o342hzy",
          "author": "Getcha_Popcorn_Readi",
          "text": "Wow. That's a crazy amount. I moved to Journey with Mediavine because it was taking me 3 years to hit the $100 threshold with AdSense. I will hit $100 around the 3 month mark with my site being with Mediavine.",
          "score": 2,
          "created_utc": "2026-02-02 06:19:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o345qqx",
          "author": "eupq",
          "text": "I made $499 last month with RPM $12.",
          "score": 2,
          "created_utc": "2026-02-02 06:47:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o34ffiy",
              "author": "David_27000",
              "text": "What country is that?",
              "score": 1,
              "created_utc": "2026-02-02 08:15:36",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o36mi0f",
          "author": "RageQuitNub",
          "text": "1,13,000 page views? \n\n2 commas is throwing me off. Is it 113k pv?",
          "score": 2,
          "created_utc": "2026-02-02 16:56:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o32mirr",
          "author": "oakandnook",
          "text": "👍😍",
          "score": 1,
          "created_utc": "2026-02-02 00:50:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o33h7v4",
          "author": "Top-Parsnip-1540",
          "text": "solid numbers for a content blog. employee-related niche is interesting because it has pretty consistent year-round search demand, people always looking for resume help or job portal guides\n\ncurious - do you find certain topics within your niche perform way better than others? like resume templates vs career advice articles? wondering if theres a clear winner in terms of traffic or rpm\n\nalso 113k pageviews purely from seo is impressive. how long did it take to build up to this level?",
          "score": 1,
          "created_utc": "2026-02-02 03:47:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o33pjff",
              "author": "Key_Question5584",
              "text": "I include PDF and Word template files in each blog post, which helps drive traffic.  \nI have been blogging since 2016. Currently, 113K pageviews represent about 20% of my peak blogging traffic.",
              "score": 1,
              "created_utc": "2026-02-02 04:41:17",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o33p8p8",
          "author": "ajeeb_gandu",
          "text": "Your RPM is good man. I barely get 1$ for Indian audience.\n\nBut US/UK audience gives me 5-10$ rpm",
          "score": 1,
          "created_utc": "2026-02-02 04:39:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o33tr9g",
              "author": "Key_Question5584",
              "text": "Yes, for Indian traffic, anything about 1$ RPM is good.  \nWe need more page views.",
              "score": 1,
              "created_utc": "2026-02-02 05:10:41",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o33tu0c",
                  "author": "ajeeb_gandu",
                  "text": "Yes true. Getting views is the toughest part tho",
                  "score": 1,
                  "created_utc": "2026-02-02 05:11:15",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o34rg3w",
          "author": "PicklePuzzleheaded96",
          "text": "amazing\n\n",
          "score": 1,
          "created_utc": "2026-02-02 10:11:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o37i4v1",
          "author": "lalala_moon_",
          "text": "Share your blog page pls",
          "score": 1,
          "created_utc": "2026-02-02 19:20:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o31c1vb",
          "author": "Learning1000",
          "text": "What's the link",
          "score": 0,
          "created_utc": "2026-02-01 20:49:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o32oboy",
              "author": "Key_Question5584",
              "text": "Please check my profile.",
              "score": 2,
              "created_utc": "2026-02-02 01:00:40",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3408fp",
                  "author": "sibun_rath",
                  "text": "Nice Business",
                  "score": 1,
                  "created_utc": "2026-02-02 06:00:47",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qokeco",
      "title": "How Do You Build a Meaningful Blog Without a Narrow Niche?",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1qokeco/how_do_you_build_a_meaningful_blog_without_a/",
      "author": "Unhappy-Bath1214",
      "created_utc": "2026-01-27 17:30:01",
      "score": 28,
      "num_comments": 16,
      "upvote_ratio": 0.95,
      "text": "I’m looking for some genuine advice from people who have experience with blogging.\n\nI recently started a blog called thinkablemom.com. So far, I’ve published only one post, and I’m feeling a bit stuck. My biggest struggle right now is narrowing down the niche and understanding what I should really focus on writing about.\n\nMy vision is to build a peaceful place where anyone can come, read, think, and feel grounded. I don’t want the blog to be about my personal life, daily routines, or diary-style content. I also don’t want to do product reviews or push affiliate-heavy content. I’m not interested in trends that feel forced or shallow.\n\nWhat I do want is meaningful, useful, thoughtful content. Things people can read quietly, reflect on, and maybe come back to when they need clarity or perspective. The problem is figuring out how to structure that into a clear niche that can still grow.\n\nIf you’ve been in a similar situation, how did you downsize your niche without boxing yourself in? What types of content helped you grow while staying true to your values?\n\nI’m also curious about tools. What tools did you use to scale or speed up content creation without losing quality? AI tools, writing workflows, planning systems, anything that genuinely helped you stay consistent.\n\nMy blog runs on Ghost, in case that matters.\n\nAny honest advice, insights, or lessons learned would mean a lot to me right now. I’m still early in the journey and trying to build something intentional, not rushed.\n\nThank you so much for reading.",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/Blogging/comments/1qokeco/how_do_you_build_a_meaningful_blog_without_a/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o25owb9",
          "author": "adrianmatuguina",
          "text": "I’ve worked with a few blogs that started from almost the exact place you’re describing, and the tension you’re feeling is very real. Wanting to create something calm, reflective, and meaningful often clashes with the internet’s pressure to niche hard, monetize fast, and chase trends.\n\nOne helpful reframe is this: **a meaningful blog does not need a narrow niche, but it does need a clear point of view.** Instead of defining your blog by topic, define it by *lens*. For example, “thoughtful writing about clarity, decision-making, and grounded living” can comfortably include essays on work, relationships, parenting, creativity, or mental space, without turning into a diary or lifestyle blog. Readers return not because of the category, but because of how you help them think.\n\nIn practice, many values-driven blogs grow by organizing content into a few **core themes** rather than a single niche. These might be things like:\n\n* clarity in everyday decisions\n* emotional regulation and inner calm\n* thinking tools for modern life\n* quiet productivity or intentional living\n\nEach post fits one of those themes, which gives structure without boxing you in. Over time, the themes evolve naturally based on what resonates.\n\nGrowth also comes from consistency of *tone* and *depth*. Reflective blogs tend to perform well when posts are timeless, re-readable, and internally linked. You do not need volume; you need coherence. Publishing one thoughtful piece every two to three weeks is often more effective than posting frequently without intention.\n\nOn the tooling side, many writers in this space use AI very lightly, mainly for structure and momentum. Tools like WordHero can help you outline essays, explore angles, or break abstract ideas into clear sections without diluting your voice. If you ever decide to expand into longer, more cohesive projects, such as a themed essay collection or a reflective book, Aivolut Books is useful for organizing those ideas into a structured manuscript rather than a collection of disconnected posts.\n\nMost importantly, you are early, and that is an advantage. You do not need to lock yourself into a niche yet. Focus on writing 5–10 pieces that truly reflect the space you want to create. Once those exist, patterns will emerge, and your “niche” will reveal itself rather than be forced.\n\nWhat you’re trying to build is slower, quieter, and more intentional, and that is exactly why it can matter.",
          "score": 6,
          "created_utc": "2026-01-28 04:35:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o21xjc3",
          "author": "bluehost",
          "text": "A lot of blogs stall not because the writing is bad, but because the writer is trying to name the niche before knowing why someone would come back.\n\nWhat you're describing works better if the niche is a shared reason for reading, not a topic. Something like helping people slow their thinking when things feel noisy or unclear. That gives you room to explore without feeling scattered. The niche usually shows itself through what people reread or save over time.\n\nTool wise, simple helps early. Low friction, a loose outline, and consistency matter more than scaling. If a post feels like something someone might quietly return to, you're probably aligned.",
          "score": 11,
          "created_utc": "2026-01-27 17:37:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o21xxc3",
              "author": "Unhappy-Bath1214",
              "text": "Thanks for insight, its really helping me to understand how to aproach this line.",
              "score": 3,
              "created_utc": "2026-01-27 17:38:49",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o21yld3",
                  "author": "bluehost",
                  "text": "Glad it helped. You're thinking about this the right way already, and that usually matters more than locking anything in early.",
                  "score": 1,
                  "created_utc": "2026-01-27 17:41:44",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o22iozo",
          "author": "LuckyRubberDuckie",
          "text": "One way to approach this is something often called reactive marketing, but not in the loud, trend-chasing sense. In blogging, it can simply mean writing in response to real moments people are already in, instead of trying to predict what will perform. That lets your “niche” be the reason someone needs the post right now, not a narrow topic label. Over time, patterns emerge in what people return to or save, and that naturally shapes focus without boxing you in.\n\nIt’s slower, but it tends to stay aligned with thoughtful, evergreen content.",
          "score": 3,
          "created_utc": "2026-01-27 19:07:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o311kub",
          "author": "Key_Question5584",
          "text": "Niche is not a big matter.  \nThe highest traffic and income generated on my blog comes from an article that is not at all related to my main niche.  \nSo instead of focusing on a niche, write articles that solve problems around a category you like to write about.",
          "score": 2,
          "created_utc": "2026-02-01 19:57:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o23w1lw",
          "author": "Neither-Apricot-1501",
          "text": "What if you explore timeless themes like mindfulness, simplicity, or personal growth? Theyre broad but meaningful. For tools, I love Notion for planning and Grammarly for clarity. Keep it authentic!",
          "score": 1,
          "created_utc": "2026-01-27 22:50:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o260d5r",
          "author": "writerapid",
          "text": "Start by researching what people who are broadly in your audience actually search for. You can get a month of Semrush or Ahrefs for $120 or something.",
          "score": 1,
          "created_utc": "2026-01-28 05:54:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o264h68",
          "author": "ContextFirm981",
          "text": "I’d pick one clear umbrella like “calm thinking for overwhelmed moms” and create a few recurring pillars under it (reflection essays, gentle how‑tos, journal prompts), then use simple tools like an editorial calendar like Sugar Calendar + an AI assistant like AIOSEO for outlining to stay consistent while you slowly let the niche refine itself through what you enjoy writing and what readers respond to.",
          "score": 1,
          "created_utc": "2026-01-28 06:26:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2di56v",
          "author": "Silvoote_",
          "text": "You start a bit more broadly and find your niche whilst doing it",
          "score": 1,
          "created_utc": "2026-01-29 07:56:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2hr76s",
          "author": "Salt-Phrase4108",
          "text": "On one of my websites I wanted to write about ai tools but then also graphic design tools.The more I thought,the more ideas came such as education tools etc but they were very unrelated.Some were matketing,some business,some ai...Eventually I just compiled it under a toolkit theme.",
          "score": 1,
          "created_utc": "2026-01-29 22:11:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2s7egx",
          "author": "IndependenceOwn4407",
          "text": "Hi! My advice is don't overthink it. Many of us (including me as a recovering Type A and someone who is neurodivergent) tend to get stuck before we start by overthinking. I have been writing since I was 15 and I am now in my 5th semester of PhD for Psychology and Counseling (Christian counseling/life coaching). I write on topics I've lived through. I have also been in the nutrition, supplement, and fitness space for over 15 years and help business owners get started. In all of that, it's literally the same principles. Regardless if I am educating on business startup, fitness, nutrition, mental health, habit reprogramming, or spiritual strengthening in hard times, it's all about how to take the first step and be consistent. I don't focus on who reads my blogs. I write for me, but I share it with others. That's the only difference. My advice is write for you. We aren't able to share links here, but my DBA is Lady J Empowers. If you would like to connect, please feel free to do so. Take the first step, be consistent, and don't overthink. Those are the 3 things I tell anyone who is stuck in writing, business, health, or spiritual growth. It's really those 3 principles coupled with also not worrying about what others say and following where you are being led. Lead with a good heart and be patient. No one has overnight success. The key is not giving up because it's not going fast enough. If this was something you felt compelled to do, do it for yourself. I hope that helps. Glad to be here amongst other bloggers/writers. We all have a story and no one story is greater than another. Your story matters!",
          "score": 1,
          "created_utc": "2026-01-31 13:06:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2zwsbu",
          "author": "tbgrover",
          "text": "I've been blogging for decades-but have also been very light touch for a long time, I do have an express niche - which is comics, and particularly I'm a established name in the UK comic book scene (though I wasn't when I started in 2000). But microblogging/social networks took over and recently - this year I've - decided to reinvent how I've been blogging, so this is what I'm doing:\n\nI blog every day. Choice of topic - whatever happens to be on my mind (often it'll be something I'll think of the day prior and then put a note in an app to go back to) just because of the nature of my work it does often come around to processes of writing/drawing but I'm not actively making that the focus.\n\nI do a Progress report for the work I'm drawing and I'll do some other bits and pieces.\n\nI'll then go back through the prior days posting on Social Media and do a \"Yesterday in social media\" and just take stuff I've found and post it with maybe some more thoughts - I'm avoiding politics and generally anything that feels too in-the-moment. And prioritising either funny/fun or interesting stuff.\n\nThis then creates a decent sized blog post that doesn't feel too \"heavy\" for someone to read (and it means creating the content is pretty easy too)\n\nMy niche is becoming just my thoughts and my unique/authentic voice.\n\nI don't spend long on it, maybe 40 minutes, and I'm doing it daily and I'm crossposting to bluesky and mastodon (but not X as I no longer have a twitter/x account) \n\nWhat I've noticed is that people WILL comment on the social network of choice rather than leaving comments in blogs, and I think consistency of posting is a big deal. I have no truck with ai - everything I post is written by me, I also avoid Ai imagery (god knows I've a library of 10,000 photos I've taken over the decades, if I can't find a photo I can use I can quickly take one) so it's feels like a direct connection to me as a person rather than a machine to pump out blog posts.\n\nI've been doing this since the start of January and firstly I've actally enjoyed the process of blogging again. It feels like it's more than just social media, the numbers have gone up a little (not enough for me to say \"wow\" but certainly enough to feel like the blog has gone from being a bit of a wasteland to a bit more alive. \n\nReally my purpose is to just write something every day and become a better writer.\n\n  \nmy blog is here: [www.pauljholden.com](http://www.pauljholden.com)",
          "score": 1,
          "created_utc": "2026-02-01 16:51:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o34vnkj",
          "author": "No-Mango8172",
          "text": "Oh man, niche struggle is so real, especially wanting to keep it meaningful. Sounds like you're aiming for something really thoughtful. For the scaling part, honestly, some AI tools can really help with brainstorming or even first drafts to get you unstuck.",
          "score": 1,
          "created_utc": "2026-02-02 10:50:59",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qqakf8",
      "title": "Bloggers: Does your social media following actually drive traffic to your blog?",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1qqakf8/bloggers_does_your_social_media_following/",
      "author": "Crescitaly",
      "created_utc": "2026-01-29 14:49:41",
      "score": 22,
      "num_comments": 30,
      "upvote_ratio": 0.97,
      "text": "Been blogging for a while and trying to figure out the best use of my time for growing traffic.\n\n\n\n\\*\\*My current situation:\\*\\*\n\n\n\nMost of my blog traffic comes from SEO. I have Pinterest and Twitter accounts but they have modest followings (a few hundred each). I post consistently but growth is slow.\n\n\n\n\\*\\*What I'm questioning:\\*\\*\n\n\n\n\\- Does having more social followers actually translate to more blog traffic?\n\n\\- Do readers check social profiles before trusting a blog?\n\n\\- Is time spent on social media better spent writing content?\n\n\n\n\\*\\*What I've noticed:\\*\\*\n\n\n\nSome successful bloggers in my niche have huge social followings. Others barely use social media at all. Hard to tell what's actually driving their success.\n\n\n\n\\*\\*The uncomfortable question:\\*\\*\n\n\n\nI've talked to other bloggers who admitted to using growth services to build initial social credibility. Their reasoning: \"My content is good. I just need to look established enough that brands take me seriously for collaborations.\"\n\n\n\nSome say it helped with brand deals and perceived authority. Others say it made no difference to actual traffic.\n\n\n\n\\*\\*Questions for fellow bloggers:\\*\\*\n\n\n\n1. What percentage of your traffic actually comes from social media?\n\n2. Have you noticed any correlation between social following and blog success?\n\n3. What's your take on using growth tools vs. organic building?\n\n4. Is time spent on social media worth it for bloggers?\n\n\n\nGenuinely curious about different experiences.",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/Blogging/comments/1qqakf8/bloggers_does_your_social_media_following/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o2j2w4c",
          "author": "discoveroverthere",
          "text": "I have 58k followers on instagram. \nit drives about 1 visitor a month to my blog 😂\n\nSo no.\n\nThe answer is no",
          "score": 18,
          "created_utc": "2026-01-30 02:27:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2q2zlq",
              "author": "adventuresfromelle",
              "text": "It depends on how you share your links/ your audience. Because I have 16K followers on Instagram and get about 250-300 clicks per month. But it helps that I share the links on my story and channel, and all my IG feed posts reference my articles. I do stuff like comment \"word\" and I'll DM my article. It works! Not that labour intensive",
              "score": 6,
              "created_utc": "2026-01-31 02:47:00",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2twl4z",
                  "author": "discoveroverthere",
                  "text": "yeah i'm not really leveraging instagram as effectively as i could. i dont feel like paying for manychat and im not actually on social enough to try and drive to my blog! \n\nbut even 300 clicks/mo isnt worth the time spent on IG imo but thats just me",
                  "score": 2,
                  "created_utc": "2026-01-31 18:22:58",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2hrseg",
          "author": "Sharp-Skill9304",
          "text": "I watched a YT video recently that was talking about YT growth specifically but the angle that he presented things in covers blogs as well: \n\nPeople who are looking for long form content aren’t scrolling on social media, or at least, they’re not necessarily in the headspace to consume form content when they’re scrolling. \n\nI run a blog myself and thinking about that realized that, even though I enjoy long form content, I’m the same, if I’m on IG the likelihood that I’m clicking away to someone’s blog post is slim.  \n\nNow getting someone from Pinterest to your blog or even long form YT to your blog, the way that like to consume content is more of a match than someone scrolling. \n\nNow I think there are other benefits for having a social media presence because really it’s not so much about building a blog anymore as it is building a brand, and there’s value there.",
          "score": 10,
          "created_utc": "2026-01-29 22:14:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2gubhc",
          "author": "Puhpowee_Icelandics",
          "text": "Most people on social media don't like to leave that platform. They might read what's on your page, but very few will go to the blog to read the story. Now, if someone asks a question, and you can put the link to your article in a comment (if it solves their problem), you have a much better chance of them clicking through.   \nI don't think that for most people spending a lot of time on social media is worth it, unless your whole strategy is build around it.",
          "score": 5,
          "created_utc": "2026-01-29 19:34:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2jtyyv",
          "author": "onlinehomeincomeblog",
          "text": "For me,   \nSEO drives bulk traffic, and social media drives burst (it is not helpful in compounding traffic).\n\n1. Followers ≠ traffic. In social media, people follow us for ideas and vibes, not long reads.\n\n2. Only brands, collaborators, and clients check our social media profiles before trusting our blog. Regular readers care more about clarity and content quality.\n\n3. One solid SEO-driven post often outperforms weeks of social posting in the long run. Social feels productive, but it doesn't always compound.\n\nAt last, \n\n* Use social media as a distribution layer, not the foundation.\n* Focus on SEO + content depth first.\n* Pick one social platform to build your personal brand and not just to drive traffic.\n\nCheck if SEO is working for you, you are already doing the right thing. Stop worrying about social media.",
          "score": 6,
          "created_utc": "2026-01-30 05:10:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2lxlyl",
          "author": "making_it15",
          "text": "Hiya! Speaking from experience with travel blogs, grown mainly via SEO. Pinterest drove a decent percentage of traffic (20-30%) but almost nothing from other social channels. This is because Pinterest and YouTube function more like search engines where people are actively looking for content, so they're more likely to click through and engage with your blog. Social media following alone meant very little for my blog, but I did get some good visibility by doing \"Instagram takeovers\" and being featured on other brands that I connected with over social. So good for networking with other brands, but in my experience it didn't automatically mean more blog success.",
          "score": 4,
          "created_utc": "2026-01-30 14:34:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2hq83i",
          "author": "Salt-Phrase4108",
          "text": "Pinterest is like a search engine so if you pin something interesting today with a new account and 0 followers,you can have impressions grow slowly and even peak in a month and it keeps bringing traffic for years .You can switch to a business account and see the growth daily .People don't have patience for it because it's long term but its perfect for blogs because people on pinterest are in inspiration mode and its easy for them to click and scroll,that's what makes it valuable for me.Certain niches do better on pinterest,I use it for aesthetic niches and art. \n\nI also find reddit traffic comes fast but it is unpredictable and it comes in bursts.I use it for technical comparisons in AI tool/finance niches and I actually need that crowd for affiliate sales,so its very targeted and I can't easily find that quality crowd anywhere else.\n\nSo,whether its worth it not not depends entirely on why you are bringing the traffic to your blog.",
          "score": 3,
          "created_utc": "2026-01-29 22:07:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2hwb81",
              "author": "Wide_Brief3025",
              "text": "Reddit definitely brings quick but unpredictable spikes compared to the steady flow from Pinterest. To make the most of those bursts, I’ve found that catching relevant threads early is key for higher quality traffic. Tools like ParseStream can actually send you alerts for specific keyword mentions so you can jump in right when your audience is active. Makes targeted engagement a lot easier if affiliate sales are your goal.",
              "score": 1,
              "created_utc": "2026-01-29 22:37:18",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2ijib8",
          "author": "GrowthZen",
          "text": "Most independent benchmarks show SEO and search still outperform social by a wide margin for driving blog traffic. but social can matter for brand, trust and leverage if you use it strategically instead of chasing vanity followers.\n\nwhat current data says:  \n\\- BrightEdge data (via Ahrefs) suggests SEO drives over 1,000% more traffic than organic social on average, which matches your experience of most traffic coming from search  \n\\- SparkToro’s 2024 referrer analysis found Google often sends 70%+ of a typical site’s traffic, vastly exceeding all social media and content sites combined  \n\\- global usage is heavily skewed to social (about 63.9%+ of the world uses social media, \\~2h21 per day) but that doesnt translate 1:1 into blog clicks because most users consume content inside platforms\n\nfollowers vs traffic and trust:  \n\\- a 2024 study on publishers found social metrics can predict some website traffic. but with big variance by brand and platform... high follower counts are correlational and not a guaranteed traffic driver  \n\\- social behaves more like an assist... followers who recognize your brand are more likely to click you in SERPs, subscribe or buy. but the primary click still often comes via google and not the social link  \n\\- for trust and brand deals, ig followers, fb comments and x (formerly twitter) mentions often correlate with higher traffic, registrations and revenue. so brands use follower counts as a quick credibility heuristic even if it doesn’t massively move blog sessions\n\nwhich platforms actually move blog traffic:  \n\\- pinterest behaves like a visual search engine like that users are in discovery/planning mode and optimized pins can send long‑tail compounding blog traffic for years. pinterest users show high search intent and convert at strong rates, making it disproportionately effective for visual or how‑to niches  \n\\- ig, x/twitter and tiktok are heavily used for research and discovery (up to \\~40-46% of younger users use social as a search layer) but most people stay on‑platform, so these channels produce more brand lift than consistent referral traffic\n\ngrowth tools vs organic:  \n\\- follower counts can correlate with more traffic and revenue. but engagement metrics (comments, mentions, clickthroughs) are stronger predictors than raw follower numbers  \n\\- paid growth or credibility padding inflates follower counts without matching engagement, which dilutes metrics and reduces the algorithmic effectiveness of those followers\n\nif your main goal is more readers on the blog, current numbers favor:  \n\\- double down on SEO and content that can rank  \n\\- use pinterest (if your niche fits) like a secondary search engine  \n\\- treat other social platforms as brand and relationship channels that support trust, email growth and future rankings rather than primary traffic drivers\n\nwhats your niche? and are you writing mostly evergreen search content or timely/opinion pieces... that changes whether social is a multiplier or just a distraction?",
          "score": 3,
          "created_utc": "2026-01-30 00:40:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2heb31",
          "author": "CanadianDollar87",
          "text": "i have a facebook group for my blog and invited people on my friends list to join. someone of them may have not known i had a blog if they didn’t join the group. whenever i post a new blog, i’ll post it on facebook with a link. i’ve gotten more views that way.",
          "score": 2,
          "created_utc": "2026-01-29 21:10:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2jh4ws",
          "author": "mannyned2",
          "text": "Short answer: social media usually doesn’t drive consistent blog traffic the way SEO does, but it does help with distribution, visibility, and credibility—especially with brands. Most readers don’t check social profiles, but partners often do. The key isn’t choosing between writing and social, it’s avoiding the time drain. A smart approach is to stay SEO-focused and automate distribution so social doesn’t become a second job. That’s where ReGenr.app comes in: it auto-shares your blog posts across platforms like Pinterest, X, and LinkedIn when you publish, keeping you visible with minimal effort. ReGenr is currently in beta testing, and we’d love feedback from bloggers like you to help shape it into a truly creator-first app built around real workflows, not busywork.",
          "score": 1,
          "created_utc": "2026-01-30 03:48:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2mh217",
          "author": "Intrepid-Fox-266",
          "text": "Not really... \n\nX=nope. What does drive followers is if I reply to a relevant post where linking back to my article actually makes sense\n\nFlipboard=hahaha. Nothing\n\nReddit, I have 0 followers, and it drives more traffic than X or Flipboard\n\nPinterest, just started, and so far nothing\n\nInstagram, haven't spent much time with.\n\n...",
          "score": 1,
          "created_utc": "2026-01-30 16:05:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2mq6jd",
          "author": "Existing-Cod5443",
          "text": "social media for trust signals and sometimes boost traffic based on niche ",
          "score": 1,
          "created_utc": "2026-01-30 16:45:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2mqlyl",
          "author": "nishantpatil108",
          "text": "Due to search different keywords...my RPM is 4-5 avg....daily traffic is 5k-6k but my earning is 20 dollar...but it required lots of post on Instagram constituent after 2-3 month u get good amount of money....and don't send direct traffic....u do content like user must be search for answer...",
          "score": 1,
          "created_utc": "2026-01-30 16:47:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2mw7xf",
          "author": "Vinaya_Ghimire",
          "text": "Social media brings me traffic but not much. Despite using multiple social media sites, my social traffic isn't much. In my experience,.social media users aren't a fan of clicking links. They might engage heavily on the platform but might not consider visiting the website through shared link.",
          "score": 1,
          "created_utc": "2026-01-30 17:12:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2n9w0x",
          "author": "SeniorConsequence297",
          "text": "Pinterest do drive a lot of traffic",
          "score": 1,
          "created_utc": "2026-01-30 18:13:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2o345k",
          "author": "Impossible-Koala-368",
          "text": "Social is my top channel, primarily because of Pinterest.",
          "score": 1,
          "created_utc": "2026-01-30 20:25:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2q3lc1",
          "author": "adventuresfromelle",
          "text": "Brands tend to look at your social media following and engagement to decide if to work with you or not, so it's worth devoting some effort but not a whole lot. People are more likely to click links on Facebook. On Instagram, you have to share the links on your story and try to grow your channel where followers can click the links directly, and get a message every time you share a link. \n\n\nUsing these strategies, I'd say roughly 20% of my audience comes from social media.",
          "score": 1,
          "created_utc": "2026-01-31 02:50:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2sacbq",
          "author": "sarkhem",
          "text": "yes it does and a lot through pinterest.. please dont ask how as subreddits these days are unhelpful.. because if i talk about how I am getting things done.. mods may get angry and tag me as self promotional.. but yes social media does help me drive traffic and its my number 1 source for me currently especially after google decided to kill my site through their unhelpful content updates",
          "score": 1,
          "created_utc": "2026-01-31 13:25:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2v4vn2",
          "author": "Flightlessbutcurious",
          "text": "Most of my traffic comes from organic search. Admittedly I haven't tried much with socials. Went hard on Pinterest for a few months and just felt like a scam to be honest, almost everyone who recommended it seemed to be selling either affiliate links to tools like Tailwind, or \"VA services\". Nowadays I just put out 1 pin per post and the outgoing clicks are no different from when I was using Canva + Tailwind to push out 3 pins a day.\n\n\nOddly I get more clicks from Facebook than Pinterest even though I don't have a Facebook account for my blog.",
          "score": 1,
          "created_utc": "2026-01-31 21:57:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2xpves",
          "author": "dwoodro",
          "text": "Perhaps the real question is:   \n  \n**Is there a reason for them to interrupt what they are doing to go to your content?**\n\nIt's not a matter of social media or not, it's a matter of \"how much they need that information\". If you are researching a health remedy, then you might read 30 sites to find the answer. If it's a vacation update, well, maybe not. \n\n  \nThe consensus is to look at the way you read things. IF my answer here helps you, then you read it; if not, you don't. So the more your topic solves the needs of that person, is what determines if they will click through to your pages. Nail that, and you get visits.",
          "score": 1,
          "created_utc": "2026-02-01 07:53:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o36s7w4",
          "author": "LiCollector",
          "text": "Truthfully reading  in general has become a thing of rhe past.   Today's generation  wants to hear and see the. Content.   Im looking into making reels of the content in my blog.  Maybe be and audio book. [Alan](http://whatthefiasco.blogspot.com)",
          "score": 1,
          "created_utc": "2026-02-02 17:22:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o384htq",
          "author": "Slight-Ad7129",
          "text": "Most Meta platforms don’t send much organic traffic anymore. They’re better for awareness and community than clicks.\n\nLinkedIn also sends limited traffic, but the leads are usually higher quality, especially for B2B and services, if you post with intent.\n\nPinterest works very well for visual, evergreen niches like DIY and food. It behaves more like a search engine than a social network, which is why it can drive long-term traffic.\n\nYouTube traffic is also low but they converts best when it points to products or lead magnets. Sending viewers to long informational articles usually isn’t effective. \n\nBut you should keep some level of social media presence, it builds credibility.",
          "score": 1,
          "created_utc": "2026-02-02 21:05:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2g9sgj",
          "author": "AIToolReviewer",
          "text": "    I run a niche review site (vettedaitools.com), and honestly, social media drives less than 15% of my traffic—SEO and email are the real workhorses.  \n      \n    That said, the bloggers I've talked to consistently mention that social media works best when you're not just sharing links. Instead, share insights or mini-lessons on the platform itself, then link to your blog as a \"read more\" option. People engage with native content, not just link drops.  \n      \n    Pinterest is the exception—it's basically a visual search engine, so it can drive solid blog traffic if your niche is visual (recipes, DIY, fashion, etc.). But Instagram and Twitter? They're better for building authority and relationships than direct traffic.  \n      \n    What's your blog niche? That might determine which platform (if any) is worth your time.",
          "score": -6,
          "created_utc": "2026-01-29 18:01:01",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qohkz5",
      "title": "18K monthly traffic, is adsense worth it or is there something else to try?",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1qohkz5/18k_monthly_traffic_is_adsense_worth_it_or_is/",
      "author": "Frosty-Distance7184",
      "created_utc": "2026-01-27 15:52:23",
      "score": 22,
      "num_comments": 45,
      "upvote_ratio": 1.0,
      "text": "We have a very specific food related niche website. We post around 4 blogs per month. Our traffic is around 15-30k monthly traffic. \n\nI've never personally done any kind of ads like adsense on a website before.\n\nIt is a Wix website FYI. Not sure if that matters for this specifically. \n\n1. Is this enough traffic to implement something like adsense?\n\n2. What kind of money would that bring in with that amount of traffic?\n\n3. Is there something much better than adsense we should do instead?\n\n  \nThanks",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/Blogging/comments/1qohkz5/18k_monthly_traffic_is_adsense_worth_it_or_is/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o21fe83",
          "author": "Salt-Phrase4108",
          "text": "Adsense doesn't have a minimum traffic requirement ,I don't have personal experience but Mediavine and other ad networks are said to earn 4-5 times better than adsense so you can try those.What is your niche?You can do affiliate marketing more actively but it requires strategy. Ads are good passive income though.",
          "score": 8,
          "created_utc": "2026-01-27 16:18:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o21gg62",
              "author": "Frosty-Distance7184",
              "text": "Thanks for the info. We have our own brand of spicy products. So we're in the spicy food niche. I'm not sure how well affiliate marketing would work for us. I'll check out mediavine.",
              "score": 5,
              "created_utc": "2026-01-27 16:23:07",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o21ry7z",
                  "author": "Salt-Phrase4108",
                  "text": "You're welcome,if you're selling selling your own products you don't need affiliate marketing,but you can try kitchen gear,subscription boxes,spicy food kits etc. I would definitely recommend Pinterest for food blogs because it is a visual niche.You can make multiple pins with different angles.With ads rpm increases if people scroll a lot and you link to other recipes/products in your blog.",
                  "score": 3,
                  "created_utc": "2026-01-27 17:12:47",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o23a931",
                  "author": "thewholesomespoon",
                  "text": "Hopefully this is allowed but if you want to share any recipes or anything come here! r/needarecipe",
                  "score": 2,
                  "created_utc": "2026-01-27 21:10:21",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o21m6hs",
          "author": "grapegeek",
          "text": "Journey by Mediavine.",
          "score": 7,
          "created_utc": "2026-01-27 16:47:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o256t27",
              "author": "dontbothermeokay",
              "text": "You can’t join the big ad networks with a Wix site. Gotta have Wordpress.",
              "score": 4,
              "created_utc": "2026-01-28 02:51:33",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o25725k",
                  "author": "grapegeek",
                  "text": "Ah easy enough to fix.",
                  "score": 3,
                  "created_utc": "2026-01-28 02:52:53",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o2l5prw",
                  "author": "Tha-Aliar",
                  "text": "Are you sure? I asked about ghost and said yes. Just saying",
                  "score": 2,
                  "created_utc": "2026-01-30 11:51:16",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o229tvs",
              "author": "Frosty-Distance7184",
              "text": "Thanks I'll check it out",
              "score": 3,
              "created_utc": "2026-01-27 18:29:27",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2378yc",
                  "author": "iron_davith",
                  "text": "Yep, Journey is your best best. Overall Mediavine are pretty good, as long as your website isn't clearly just AI content.",
                  "score": 6,
                  "created_utc": "2026-01-27 20:56:54",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o21ucb7",
          "author": "justahumanbeing-22",
          "text": "Nice traffic....I eventually aspire to those levels.",
          "score": 6,
          "created_utc": "2026-01-27 17:23:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o234e2y",
          "author": "ArtemLocal",
          "text": "That’s enough traffic to test ads, but expectations matter. AdSense at 15-30k sessions usually pays disappointing money, especially in food niches unless it’s very US-heavy and high-intent. Think tens to low hundreds per month, not a meaningful revenue stream. Wix doesn’t block ads, but it limits more advanced setups. The bigger unlock is often affiliate links or owned products layered into existing content, not display ads slapped on top.\n\nIf you do try ads, treat it as a baseline experiment, not the end goal. The traffic you already have is more valuable than AdSense will ever tell you. What percentage of your traffic is US-based and what kind of food niche is it. Recipes, specialty ingredients, diet-specific.",
          "score": 5,
          "created_utc": "2026-01-27 20:44:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o23l1d3",
          "author": "Same_Carrot196",
          "text": "I think it would be good idea to put ads on your website but I think you should control the volume so it does not overwhelm your visitors.",
          "score": 3,
          "created_utc": "2026-01-27 21:58:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2gw1ot",
              "author": "Fit_Performance8775",
              "text": "Good advice. There is a sure-fire way to lose loyal visitors. I have given up on decent sites before because the ads are overwhelming. If the ads keep blocking what I'm seeing, or I keep accidentally clicking them while I'm scrolling, I will leave.",
              "score": 3,
              "created_utc": "2026-01-29 19:42:56",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2f7txx",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 3,
          "created_utc": "2026-01-29 15:10:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2gx2ez",
              "author": "Fit_Performance8775",
              "text": "Thank you for all that insight. That helps us all, even small blogs like mine, with future planning. ",
              "score": 1,
              "created_utc": "2026-01-29 19:47:46",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o229ig6",
          "author": "elysian0907",
          "text": "I have one question - do you use SEO in your website ? And for backlinks - do u use it as well- or just you go with on page optimization - thanks in advance",
          "score": 2,
          "created_utc": "2026-01-27 18:28:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o22a431",
              "author": "Frosty-Distance7184",
              "text": "Professional SEO. Full optimization. Monthly backlinks that are actually good and within our niche. Not spam stuff.",
              "score": 3,
              "created_utc": "2026-01-27 18:30:39",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o22em1n",
                  "author": "elysian0907",
                  "text": "thanks for your reply! May i know how i can start Backlinks the easiest way - as i never done it before..",
                  "score": 1,
                  "created_utc": "2026-01-27 18:49:36",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o22effm",
          "author": "Due-You-1943",
          "text": "how much traffic ur having daily and max of ur traffic is from which countries?",
          "score": 2,
          "created_utc": "2026-01-27 18:48:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o22hosq",
              "author": "Frosty-Distance7184",
              "text": "All usa",
              "score": 3,
              "created_utc": "2026-01-27 19:02:39",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2sq5tr",
                  "author": "Due-You-1943",
                  "text": "you can try other adnetworks instead of adsense , you will be getting daily payments. and more of good cpm rates",
                  "score": 1,
                  "created_utc": "2026-01-31 14:57:26",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o22v2lm",
          "author": "Limp-Locksmith-1135",
          "text": "Mediavine, journey by mediavine, shemedia, ezoic, raptive..etc all those are better than adsense in the revenue",
          "score": 2,
          "created_utc": "2026-01-27 20:01:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o23a1yx",
          "author": "thewholesomespoon",
          "text": "Journey or mediavine!",
          "score": 2,
          "created_utc": "2026-01-27 21:09:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o25q2in",
          "author": "RuanStix",
          "text": "18k monthly traffic will earn you a solid few pennies each month.",
          "score": 2,
          "created_utc": "2026-01-28 04:43:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o25v06m",
          "author": "shajid-dev",
          "text": "I prefer to go with Journey by mediavine, as you saying you've got 18k traffics. However to join journey, you need 1000 sessions, and you've already achieved it. \n\nAdsense doesn't have any minimum requirement to get enroll but RPMs were maybe low and it's totally depends on the tiered countries.",
          "score": 2,
          "created_utc": "2026-01-28 05:15:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o26d49x",
              "author": "UpBeatHustler",
              "text": "1000? Thought it was 10,000? \n\nEither way, OP is beyond that.",
              "score": 2,
              "created_utc": "2026-01-28 07:37:44",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o26o0vi",
                  "author": "shajid-dev",
                  "text": "Yes they have lowered the barrier",
                  "score": 2,
                  "created_utc": "2026-01-28 09:16:21",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o27p5pl",
          "author": "Getcha_Popcorn_Readi",
          "text": "I have a lot less traffic than you do and was with AdSense for years. I switched to Journey by Mediavine less than 3 months ago and have already hit $85 where it took me 2 years to get that with AdSense. Of course I haven't been paid yet because I haven't hit the $100 threshold but there are definitely better options than AdSense.",
          "score": 2,
          "created_utc": "2026-01-28 13:50:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2das9f",
          "author": "ccalinl",
          "text": "Mediavine (and Journey by Mediavine) started working differently this year, so you might get lower rates at this traffic level. For maximum performance, try joining Raptive (they do require 25k page views per month and at least 50% of the traffic from Tier 1 countries, but it would give you a slightly better RPM at this stage).",
          "score": 2,
          "created_utc": "2026-01-29 06:52:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o25wyok",
          "author": "OkLetterhead1438",
          "text": "AdSense is kinda meh at that level tbh",
          "score": 1,
          "created_utc": "2026-01-28 05:29:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o27mra7",
          "author": "Vinaya_Ghimire",
          "text": "I haven't used but they say ezoic and mediavine are better than adsense. It is nit easy to say how much you can earn from 18-30k traffic through Adsense because earning depend on click through rates and CPC.",
          "score": 1,
          "created_utc": "2026-01-28 13:37:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2b2e6z",
          "author": "BlacKkChocolat",
          "text": "What platform are you using for your blog?",
          "score": 1,
          "created_utc": "2026-01-28 22:53:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2doui5",
          "author": "ContextFirm981",
          "text": "With 18K visits/month you can use AdSense, but it’ll likely only earn a small amount (often tens, not hundreds, of dollars), so I’d also look at higher‑paying ad networks (if you qualify), direct sponsorships, or simple digital products in your niche for better monetization.",
          "score": 1,
          "created_utc": "2026-01-29 08:58:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2l61k0",
          "author": "Camino_Financiero",
          "text": "Approximately how long did it take them to reach 18,000 monthly views? And how long does it generally take to reach those levels of visits?",
          "score": 1,
          "created_utc": "2026-01-30 11:53:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2na1i1",
          "author": "SeniorConsequence297",
          "text": "Try Journey by Mediavine",
          "score": 1,
          "created_utc": "2026-01-30 18:13:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o21gyj4",
          "author": "Existing-Cod5443",
          "text": "please some one help me im facing issue for indexing my posts ",
          "score": 1,
          "created_utc": "2026-01-27 16:25:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o229a06",
              "author": "elysian0907",
              "text": "Hello, i will share with you a video youtube that helped me a lot - the language can be different to you, but at least follow the steps",
              "score": 1,
              "created_utc": "2026-01-27 18:27:09",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o28me25",
                  "author": "Existing-Cod5443",
                  "text": "please share ,me ",
                  "score": 1,
                  "created_utc": "2026-01-28 16:25:58",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qswh3o",
      "title": "Let’s Be Honest About Blogging Growth",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1qswh3o/lets_be_honest_about_blogging_growth/",
      "author": "Lilia_leach",
      "created_utc": "2026-02-01 11:50:44",
      "score": 21,
      "num_comments": 25,
      "upvote_ratio": 0.97,
      "text": "Let’s be honest: how long did it actually take for your blog to start getting consistent, meaningful traffic?\n\nAnd if you were starting from zero today, what’s one thing you would not do again?",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/Blogging/comments/1qswh3o/lets_be_honest_about_blogging_growth/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o2ygm3t",
          "author": "cabbagerz",
          "text": "Build your own circle, community, or channels first—such as a WhatsApp channel or Facebook/X pages with a strong following and brand awareness. Then blogging becomes easier, because you can drive traffic from multiple sources instead of relying solely on SERPs.",
          "score": 9,
          "created_utc": "2026-02-01 11:56:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2zhs5u",
              "author": "PanflightsGuy",
              "text": "Building a community with a strong following is something I thought blogging could build",
              "score": 2,
              "created_utc": "2026-02-01 15:41:50",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2zy8b7",
                  "author": "elanesse100",
                  "text": "I am not aware of any meaningful community growth as a result of my blogging, but my blogging definitely experienced growth as a result of the community I had first built on Facebook.\n\nMany of my earliest articles that took off on Google were me just answering commonly asked questions from my FB group.",
                  "score": 2,
                  "created_utc": "2026-02-01 16:58:01",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2ygsiq",
          "author": "Captlard",
          "text": "Your meaning may not be that of others!\n\nThree months here\n\nNot wait would be my advice: Perfection is the enemy of good!",
          "score": 4,
          "created_utc": "2026-02-01 11:58:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2z8180",
          "author": "dwoodro",
          "text": "There are too many factors to account for with such a vague question. Consider \"how long did it take you to learn to swim, or walk\", and then correlate the answer.\n\nEach website or blog can be vastly different from another. The topic of choice for a blog alone can determine how fast traffic will spike.\n\nWhat topic are you writing about? Lifestyle? Psychology? or Micromanaging Bonsai trees for maximum growth potential?\n\nWho or what is the target audience that you are writing for? Is it a personal blog or a business blog? Cat lovers? Dog lovers? or \"revisiting the extinct species lists\"?\n\nThe point I would like to address is that you should have a purpose behind the process of building your blog. The more purposeful you create your blog, the greater the chances of traffic to that blog. If you are simply writing personal notes to the world, that's awesome, but not entirely \"calling people in\".\n\nIf your blog is actively solving problems that are highly needed throughout society, then it would be hard to stop the flow of traffic. People often read things that solve a problem for themselves.\n\nConsider this site, is all about receiving helpful insight. Users ask a question, in the hopes of getting useful answers. So there is a high likelihood that you come back to read the topic, and you have a direct interest in the outcome of the topic.\n\nDoes your blog fulfill this same need to your readers? If not, this becomes the most deterministic factor for how fast your blog will get traffic. We are in an era where a single post can travel the internet a million times overnight. Most of the time, this happens due to the nature of the topic, not where the topic originated.\n\nOnce you have more clearly defined the overall purpose of your content, then you can actively do more to enhance the shareability factors. There are things you will want to do. such as:\n\n* Writing long and short-form content,\n* uploading images to your blog,\n* creating engaging content posts,\n* encouraging feedback on your site\n* making sure your blog posts are curated\n* blog consistently\n* managing your SEO\n* internal and external linkbuild practices\n* social engagement\n* either a simple design or a good design\n* easy to read formatting\n* and a bunch more...\n\nThere is a lot that goes into \"creating\" a blog, least of all just posting. It should be treated as a business if you are trying to use it as a business. Your urgency to get traffic will not \"solve\" a traffic issue, trust me on that one. We've all been there before.\n\nConsider your blog as a community project, a living, growing environment where people will come to read for \"their benefit\", not yours. That's the key.",
          "score": 3,
          "created_utc": "2026-02-01 14:53:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2zqewd",
          "author": "Friendly_Nobody_8264",
          "text": "For me, meaningful growth meant getting into a decent ad network and making actual money. That took eight years.",
          "score": 2,
          "created_utc": "2026-02-01 16:22:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o318g42",
          "author": "Intrepid-Fox-266",
          "text": "Realistically, 9 months. Before that I got some traffic with the occasional article that hit, but after 9 months my traffic consistently crew 30+ percent per month, every month.",
          "score": 2,
          "created_utc": "2026-02-01 20:31:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o319mm5",
          "author": "queenie8465",
          "text": " A year",
          "score": 2,
          "created_utc": "2026-02-01 20:37:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o341rvu",
          "author": "KnowledgeExciting627",
          "text": "Let’s be real here.  \n  \nConsistent, meaningful traffic didn’t happen overnight. For me, it took a good **6–12 months** of showing up regularly before things even started to feel *predictable*. The first few months were mostly silence, and that’s normal.\n\nIf I were starting from zero again, the one thing I **wouldn’t** do is chase every shiny tactic or write just to “publish something.” What worked better over time was focusing on **fewer, genuinely useful posts**, understanding who I was writing for, and being patient enough to let compounding do its thing.\n\nBlogging growth is slow, but it’s also very real if you stick with it. Consistency + clarity beats speed every time.",
          "score": 2,
          "created_utc": "2026-02-02 06:13:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2yhni3",
          "author": "kbk3173",
          "text": "My Wordpress blog took only one month. My IONOS blog created on their website builder tool took at least a year of serious blogging to start ranking and getting consistent traffic.",
          "score": 1,
          "created_utc": "2026-02-01 12:05:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2zct8b",
              "author": "Top_String05",
              "text": "What do you mean by traffic?\n\nIs it an impression or clicks?",
              "score": 1,
              "created_utc": "2026-02-01 15:17:36",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2yi9tl",
          "author": "Holiday-Oil2598",
          "text": "Why meaningful traffic",
          "score": 1,
          "created_utc": "2026-02-01 12:10:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2z8mq6",
          "author": "ratrod-",
          "text": "About three months or so! Finally starting to lift off this month! https://imgur.com/a/KD07aeb",
          "score": 1,
          "created_utc": "2026-02-01 14:56:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2zzh4h",
          "author": "ipapipap",
          "text": "As a casual reader, I've never randomly read from blog anymore.",
          "score": 1,
          "created_utc": "2026-02-01 17:03:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o31szgo",
          "author": "mannyned2",
          "text": "Most blogs take 6–12 months to reach consistent, meaningful traffic, and a common mistake is relying only on publishing and waiting for SEO to kick in. Distribution tends to be the bigger bottleneck. Posts aren’t shared consistently, or the manual effort becomes unsustainable. Automating that step helps maintain momentum early on by ensuring every new article gets shared across selected platforms as soon as it’s published. Tools like ReGenr.app (currently in beta) focus on this by using RSS to auto-share new blog posts with captions and links, allowing writers to concentrate on content creation while still learning which platforms actually drive engagement.",
          "score": 1,
          "created_utc": "2026-02-01 22:11:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o32xyts",
          "author": "zorroh-academy",
          "text": "Great Question! I also need help building mine.",
          "score": 1,
          "created_utc": "2026-02-02 01:56:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o33n5ts",
          "author": "GrowthZen",
          "text": "Realistic timeline based on 2024-25 blogging data: 6-12mos for meaningful organic traffic.\n\nindustry benchmarks show 32% of blogs hit 1,000 monthly sessions in 4-6mos but most take longer. blogs growing at a median 5.92% compound monthly rate see 88% annual traffic growth, translating from \\~2,500 monthly pageviews in month 1 to \\~4,750 by month 12.\n\nwhat I wouldn’t do: rely only on publishing without distribution. data shows keyword optimization is the top growth factor. but 90% of bloggers now use social distribution, 65% use email and only 11% use paid amplification. waiting passively for SEO costs 4-6mos of indexing time alone. Google’s confirmed timeline for traction is roughly 4mos to 1yr.\n\nstarting today, i'd frontload: do low-competition keyword research (tools like LowFruits), publish 24-30 core posts in 90 days to hit Google’s volume threshold for a \\~30% traffic lift and automate RSS-to-social distribution so every post compounds reach while it ages into SEO authority.\n\ntraffic doesn’t arrive... it accumulates. most bloggers quit in month 3 but the model usually requires surviving months 6-9 to see compounding kick in.",
          "score": 1,
          "created_utc": "2026-02-02 04:25:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o382j70",
          "author": "Strong_Teaching8548",
          "text": "it took me like 8-9 months before i saw any real traction. i was publishing consistently but basically screaming into the void for the first half year, ngl. the traffic didn't feel \"meaningful\" until month 10-11 when i finally had enough content ranking for long-tail stuff and google started taking me seriously\n\nwhat i wouldn't do again? chase trending topics obsessively. i wasted so much time writing about whatever was hot on twitter that week, thinking it'd drive traffic fast. turns out, those posts got buried immediately and didn't compound over time.\n\nthe posts that actually worked were the boring, specific ones that solved real problems people were actually searching for. if i started today, i'd focus way harder on search intent from day one instead of hoping virality would save me",
          "score": 1,
          "created_utc": "2026-02-02 20:56:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o38cl6w",
          "author": "thewholesomespoon",
          "text": "A year",
          "score": 1,
          "created_utc": "2026-02-02 21:44:03",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qrh37u",
      "title": "3 month progress after blog relaunch",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1qrh37u/3_month_progress_after_blog_relaunch/",
      "author": "Great-Slice-7714",
      "created_utc": "2026-01-30 20:30:52",
      "score": 16,
      "num_comments": 4,
      "upvote_ratio": 1.0,
      "text": "Hello again! For those who missed my last 2 updates I started a very niche, local wedding blog in March 2024 but fizzled out a bit because well.. life. I decided to revamp the website and relaunched the blog on Oct 20th. I’m excited to report the progress I’ve seen in January!\n\nMy goal was to publish (at a minimum) 4 blog posts and I did just that. Giving me a total of 27 blog posts.\n\nJanuary Traffic per Google Analytics: Event Count: 1.45K Active Users: 209 New Users: 205 Avg Session: 2m 50s\n\nNew user traffic:\nOrganic social: 81\nOrganic search: 76\nDirect: 41\nUnassigned: 5\nReferral: 2\n\n\nI am very excited for this month’s results. As wedding planning season has begun for a lot of couples, I believe my site is picking up momentum and getting visibility.\n\nWhat I did: I do focus on SEO. Not in the, cookie-cutter have chat gpt spit out a blog sort of way, but really considering what brides/couples are googling. I do my research and post with intention.\n\nWhat I didn’t do: I didn’t use Pinterest this month like I wanted to or social media. They are two great resources, but I struggle to find the time to do it all. So I am focusing on blogging and hopefully the rest will come later.\n\nThanks for following along on my journey! Hopefully you’re enjoy it as much as I am 🙂",
      "is_original_content": false,
      "link_flair_text": "Progress Report",
      "permalink": "https://reddit.com/r/Blogging/comments/1qrh37u/3_month_progress_after_blog_relaunch/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o2phn1o",
          "author": "ggpaul562",
          "text": "That’s the challenge I have. Because I’ve done SEO for 13 years I think of blogging a certain way. I feel like I need to unlearn some things from the traditional SEO way; still apply some that matters, and just…. Write.",
          "score": 1,
          "created_utc": "2026-01-31 00:42:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ueget",
          "author": "bluehost",
          "text": "I've seen a lot of experienced SEOs hit this wall. One thing that helps is separating discovery content from conversion content in your head. Discovery posts can be a little looser and human, written the way people actually talk and search. Then you tighten things up later once you see what's getting traction.\n\nIt's less about unlearning SEO and more about letting real queries and on-site behavior tell you what deserves \"old school\" optimization.  Curious if you've noticed certain posts performing better when you write more naturally vs SEO-first.",
          "score": 1,
          "created_utc": "2026-01-31 19:47:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2xkh7e",
          "author": "Reasonable_Lab136",
          "text": "Nice progress! Those organic search numbers are solid for just 3 months post-relaunch. You’re doing the right thing focusing on SEO first - it compounds over time.\n\nFor Pinterest/social: Don’t beat yourself up. Many successful bloggers actually *delay* social until they have 20-30 strong posts, because then you have more content to distribute. You’re at 27, so you’re actually at the perfect point to start layering it in gradually.\n\nOne tip: Instead of trying to do everything, maybe pick ONE Pinterest session per week (30 mins) where you batch-pin your recent posts. Use a scheduler like Tailwind so it drips out over the month. That way you’re still focusing 90% on content but getting *some* Pinterest traction.\n\nThe wedding planning season momentum will definitely help - you’re positioned well. Keep it up! 🎉​​​​​​​​​​​​​​​​",
          "score": 1,
          "created_utc": "2026-02-01 07:04:47",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qrkl98",
      "title": "Blogger here – is anyone still running a calm lifestyle / home blog in 2026?",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1qrkl98/blogger_here_is_anyone_still_running_a_calm/",
      "author": "Lilia_leach",
      "created_utc": "2026-01-30 22:42:56",
      "score": 13,
      "num_comments": 18,
      "upvote_ratio": 0.89,
      "text": "Hi 🙂\n\nI run a calm lifestyle & home blog where I write about simple routines and systems that make everyday life feel easier. I’ve been blogging consistently for about 8 months now.\n\nMost of my traffic comes from Pinterest at the moment, and Google still feels very slow, so I’m curious about other people’s experiences.\n\nAre you still blogging in 2026?\n\nDid Google take a long time to pick up for you too, or did you start seeing traffic earlier?\n\nThanks so much 🤍",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/Blogging/comments/1qrkl98/blogger_here_is_anyone_still_running_a_calm/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o2qu8j8",
          "author": "marshmallowtrex",
          "text": "Highly recommend signing up for Google Search Console. It's free, and you can submit URLs directly to Google so they index them faster. I see turnaround in about 24-ish hours.",
          "score": 6,
          "created_utc": "2026-01-31 05:52:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2q8lgl",
          "author": "GrowthZen",
          "text": "Yes, still blogging in 2026... i moved back to my own domain after relying on pinterest for 8mos and learning that google typically takes 3-6mos to index new sites. lifestyle blogs like yours often get 80%+ of their early traffic from pinterest while google builds more slowly after the rise of AI overviews (now about 60% of searches are no‑click). i switched to an owned platform... traffic stabilized and i no longer worry about algorithm changes. what’s your top pinterest pin driving visits?",
          "score": 3,
          "created_utc": "2026-01-31 03:21:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2qzip3",
          "author": "Mental-Goal-8724",
          "text": "May I ask how you guys get traffic through Pinterest?",
          "score": 2,
          "created_utc": "2026-01-31 06:35:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2uy2km",
              "author": "tuninginfifths",
              "text": "I’ve avoided Pinterest because I keep hearing it has become really difficult to get traffic there. I’d rather spend the time building my site for now. I’d be curious what the OP did though.",
              "score": 1,
              "created_utc": "2026-01-31 21:24:40",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2vfh1u",
                  "author": "notactuallyashley",
                  "text": "You can find stories about traffic being really difficult to get from any platform. If you avoid them, you only guarantee yourself zero.",
                  "score": 2,
                  "created_utc": "2026-01-31 22:51:56",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o2vo37m",
              "author": "Ted-Nelson",
              "text": "Create images that share a bit of your blog article; the person taps on the image to start reading, and can tap the button to continue reading on the blog.\n\nSearch for topics related to your blog on Pinterest to see results from others for inspiration.\n\nIt will take time, but once it starts working, it won't stop. In 2021, I spent 9 months posting images without any return.\n\nUntil it started, and to this day my biggest traffic comes from there.",
              "score": 1,
              "created_utc": "2026-01-31 23:39:15",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2razha",
          "author": "Building-WW",
          "text": "I’d honestly suggest learning some basic on-page SEO if you haven’t already. \n\nA lot of lifestyle blogs I’ve seen only start getting meaningful Google traffic after 12–18 months, once there’s enough depth and consistency for Google to understand what the site is really about. \n\nHow much traffic are you actually getting from Pinterest right now? Like rough daily or monthly numbers??",
          "score": 2,
          "created_utc": "2026-01-31 08:20:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2tws40",
              "author": "Lilia_leach",
              "text": "I have 380k impressions in pinterest",
              "score": 2,
              "created_utc": "2026-01-31 18:23:52",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o30mfpq",
                  "author": "13chemicals",
                  "text": "What are the outbound clicks? Impressions aren't traffic to your site.",
                  "score": 1,
                  "created_utc": "2026-02-01 18:47:15",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o340dao",
                  "author": "Building-WW",
                  "text": "that actually sounds pretty solid, especially for 8 months in...can I see your site??",
                  "score": 1,
                  "created_utc": "2026-02-02 06:01:53",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2ve8n3",
          "author": "notactuallyashley",
          "text": "I've been blogging in an adjacent niche for about 4 years. Google is totally unpredictable since late 2023, so nobody can tell you what's \"normal\" these days.\nI wouldn't expect a whole lot from Google until around the 9 to 12 month mark, but again, very unpredictable. \nI did have a snoop around at your blog, and if you want more traffic, you should start putting unique images on your posts. Stock images don't perform well, and unique images are a good opportunity to rank in image search. A messy original image is better than a beautiful stock one.\nYou might like the Facebook group \"Blogging Like We Mean it.\" I'm not affiliated with the group, but I've been in it since I started, and there are bloggers at every stage. It's still an amazing resource for me.\nGood luck! Surviving until the 8th month is already great! You will succeed as long as you don't throw in the towel.",
          "score": 2,
          "created_utc": "2026-01-31 22:45:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2rmso9",
          "author": "Reasonable_Branch_13",
          "text": "Im not but is something that I would love to do, but unfortunately I don’t know how.",
          "score": 1,
          "created_utc": "2026-01-31 10:12:59",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qskn9z",
      "title": "Having fun writing, but not having fun waiting for engagement",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1qskn9z/having_fun_writing_but_not_having_fun_waiting_for/",
      "author": "scribe-kiddie",
      "created_utc": "2026-02-01 01:29:10",
      "score": 10,
      "num_comments": 6,
      "upvote_ratio": 0.92,
      "text": "Just finished writing and posted a blog recently on substack. But it's not fun having no engagement about the thing that you've written.\n\nEngagement is what keeps my motivation going, even if the reader disagrees with what I post. No engagement is worse than negative reaction. It signals my blogpost is boring.\n\nAnyone else feels the same? Any pointers on how to overcome this wall?",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/Blogging/comments/1qskn9z/having_fun_writing_but_not_having_fun_waiting_for/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o2xhmqb",
          "author": "onlinehomeincomeblog",
          "text": "I felt this on the medium platform, and it's very common. **Silence doesn't mean your writing is boring.**\n\nIt means,\n\n1. You don't have distribution yet.\n2. People are reading but not reacting.\n3. Sometimes, people helped quietly and moved on.\n\nSeparate the writing phase and distribution phase.\n\n* Share the post in one or two relevant places.\n* End the post with a specific question.\n* Re-read the older post and update them with current data.\n\nDon't always wait for the motivation, and treat this phase as training. \n\nOne thing that helped me was to start my blog even with zero audience. A place where I can write on my own without depending on the platform's algorithm or immediate engagement. Started in 2013, and now the entire journey has changed a lot.\n\nWriting on third party platform like Substack is great, but having your own space means a lot.",
          "score": 2,
          "created_utc": "2026-02-01 06:40:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2y4uqk",
              "author": "scribe-kiddie",
              "text": "Thanks.\n\nYeah I'm definitely sharing it to relevant places like Hacker News and restacking the article using Substack Notes.\n\nWhat I have refrain from doing is sharing it to my social media circle (like Instagram and threads) and professional circle (LinkedIn).\n\nI just want to grow \"organically\" without having to make people who know me personally feel \"forced\" to like my writing or subscribe to my newsletter.\n\nGood news is my post got one like now 😁",
              "score": 2,
              "created_utc": "2026-02-01 10:12:26",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o32zpvu",
                  "author": "onlinehomeincomeblog",
                  "text": "Happy to hear that you have received a like. One more thing, never expect organic growth on third-party platforms (my personal opinion)",
                  "score": 2,
                  "created_utc": "2026-02-02 02:05:54",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2xiis2",
          "author": "Holiday-Oil2598",
          "text": "Learn seo or share on LinkedIn, fb etc as well",
          "score": 1,
          "created_utc": "2026-02-01 06:47:55",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qqriw2",
      "title": "I want to start a blog for my business but not sure where to begin",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1qqriw2/i_want_to_start_a_blog_for_my_business_but_not/",
      "author": "b4pd2r43",
      "created_utc": "2026-01-30 01:25:53",
      "score": 8,
      "num_comments": 6,
      "upvote_ratio": 1.0,
      "text": "I run an educational coaching business focused mainly on math and I want to start a blog to go deeper on topics I can’t fully explain on Instagram.\n\nI share tips there already but the format really limits how much context and explanation I can give.\n\nA blog feels like the right next step so I can write more conversational posts about math concepts, study strategies, and learning habits.\n\nI’m just not sure which platform makes the most sense especially starting on a budget but with room to grow later. Any suggestions?\n\n",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/Blogging/comments/1qqriw2/i_want_to_start_a_blog_for_my_business_but_not/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o2is2rk",
          "author": "alizastevens",
          "text": "If you’re thinking long-term and want flexibility, WordPress is still the safest bet. It feels like a lot at first but once it’s up it’s boring in a good way. Just write and publish.\n\nBut if speed matters more right now, Durable is honestly easier. Especially if the blog is just there to support your coaching and not become a whole tech project.\n\n\n\n\nAlso since you already post on Instagram, I’d actually reuse that content as a base. Take one post, expand it into a full article, add examples, and maybe a simple diagram or two. That way you’re not starting from zero. Blogs work really well for evergreen topics like math concepts and study habits because people search for the same questions year after year.",
          "score": 5,
          "created_utc": "2026-01-30 01:27:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2is6w1",
          "author": "Skillerstyles",
          "text": "Budget-wise, I’d avoid platforms that trap you behind paywalls early (some newsletter tools do this). They’re great for audiences that already exist, but for discovery and SEO, a traditional blog works better.",
          "score": 1,
          "created_utc": "2026-01-30 01:27:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2is9qv",
          "author": "StashBang",
          "text": "I wouldn’t worry too much about posting a ton right away. A few solid posts that explain your approach and thinking are way more useful than a bunch of rushed ones. You can always layer on study tips, math breakdowns, etc. once you see what people respond to.",
          "score": 1,
          "created_utc": "2026-01-30 01:28:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2isceo",
          "author": "albrasel24",
          "text": "Get a domain first and keep the tech side boring at the start. Find cheap hosting, free theme, no fancy plugins.",
          "score": 1,
          "created_utc": "2026-01-30 01:28:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2j9yyf",
          "author": "MeringueSensitive140",
          "text": "Focus on content creation.",
          "score": 1,
          "created_utc": "2026-01-30 03:07:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2k5g2l",
          "author": "onlinehomeincomeblog",
          "text": "A blog is perfect if you develop one with deeper explanations, examples, and context.\n\nStart with a WordPress (self-hosted) blog, which gives you full control and can be scaled for the long term. Start with a basic free theme + clear writing targeting one audience group at a time.\n\nRegister a domain name and get a shared hosting, which will cost you around 2000 - 2500 INR only. Then you have to invest in buying a premium theme or else if your budget doesn't allow you, start with the Default FREE WP theme itself.\n\nWatch some YouTube videos and start developing your blog. Then you know the process, keyword research, and content writing.",
          "score": 1,
          "created_utc": "2026-01-30 06:36:49",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qpjye7",
      "title": "Struggling to grow organic traffic on a utility-style content site – need advice",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1qpjye7/struggling_to_grow_organic_traffic_on_a/",
      "author": "Few_Standard_8886",
      "created_utc": "2026-01-28 18:40:39",
      "score": 8,
      "num_comments": 14,
      "upvote_ratio": 0.91,
      "text": "Hello everyone,\n\nI built a small content-driven website around everyday problem-solving topics (calculators, generators, etc.). It’s been live for \\~7–8 months.\n\nI’ve done on-page SEO, improved site speed, added detailed articles to each page, and submitted sitemaps to Google Search Console. Right now I’m seeing roughly:\n\n\\*200–300 impressions/day\n\n\\*1–4 clicks/day\n\nSo technically Google sees the site, but growth is extremely slow.\n\nThe only thing I haven’t focused on much is off-page (backlinks / authority building).\n\nFor those who’ve grown similar utility or informational sites:\n\n\\-What actually moved the needle for you?\n\n\\-Is link building the main missing piece here?\n\n\\-Any unconventional approach that worked?\n\nNot promoting anything — genuinely looking to learn from real experiences.\n\nThanks in advance.",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/Blogging/comments/1qpjye7/struggling_to_grow_organic_traffic_on_a/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o2chx8w",
          "author": "GrowthZen",
          "text": "For utility sites, you’re in the classic google can see it but doesn’t fully trust or understand it yet phase.\n\na few data points: multiple SEO case studies on tools and calculators show that 200-300 impressions/day with 1-4 clicks usually means you’re appearing for semi‑relevant long‑tail queries at low positions (often bottom of page 1 or page 2). CTR problems tend to be about classification and SERP layout (AI overviews, widgets, other tools) rather than pure on‑page SEO. industry data still finds organic search is the largest long‑term traffic source for most sites but utility pages are disproportionately affected by AI overviews and zero‑click answers... you only get real traffic when your page is the obvious next action (richer explanations, scenarios, comparisons) rather than just one more calculator.\n\nwhat’s moved the needle on similar builds:  \n\\- deepen a few winners before chasing more pages. in public case studies, utility pages that added use cases like for example inputs/outputs, mini‑FAQs and what this number means for you sections saw meaningful CTR and ranking lifts even with AI overviews present. because they became the page users clicked after the summary  \n\\- tighten keyword–tool fit. check Search Console for each tool: if impressions come from queries that dont match the tool’s real job, rewrite titles/meta to mirror the exact phrasing of the highest‑intent queries, then adjust content so the tool plus explainer page is clearly designed for that use case. this intent realignment step is commonly cited in growth breakdowns where impressions were flat for months before compounding  \n\\- authority matters but only after the above. links to thin tools mostly increase impressions without fixing CTR. and links to clearly positioned, high‑intent tools tend to produce both more impressions and a steeper click curve. recent studies and practitioner write‑ups suggest selective link building to 5-10 hub tools (not every page) performs better than spraying low‑quality links sitewide\n\nif this were my project at \\~7-8mos i’d:  \n1) pull the last 90 days of GSC data, sort by impressions and then pick the top 10 tool URLs. for each, list the top 10 queries, current position and CTR. then rewrite title/H1/meta and above‑the‑fold copy so they exactly answer the searcher’s wording and promise a clear outcome, not just calculator or generator  \n2) expand those 10 pages with 300-800 words covering: what the tool is for, 2-3 real‑world scenarios, step‑by‑step usage and a short FAQ targeting People Also Ask style questions around that keyword set. this pattern is used in many SEO avalanche case studies that broke out of low‑CTR plateaus  \n3) only after that, run a small, focused link‑building sprint: 5-15 relevant links from niche blogs, directories and resource pages pointing to those core tools and the homepage (no spam, no random swaps). for utility sites, a modest authority bump on the right pages can move you from positions 8-15 to 3-5 which typically yields multi‑x higher CTR\n\nso clearly youre not in a failed zone yet for a 7-8mo utility site especially with AI search compressing clicks. this is the moment where sharpening intent and then layering authority usually decides whether the curve bends up or stays flat.",
          "score": 3,
          "created_utc": "2026-01-29 03:29:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o29ie5h",
          "author": "MrBilal34",
          "text": "look at the top search results for the keywords/search terms you are targeting - write superior content encompassing what top results talk about",
          "score": 2,
          "created_utc": "2026-01-28 18:44:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o29q3h2",
              "author": "Few_Standard_8886",
              "text": "Make sense. Thanks",
              "score": 2,
              "created_utc": "2026-01-28 19:17:20",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o29l8jv",
          "author": "iron_davith",
          "text": "Have you done your keyword research? What do the sites above you rank for? Is their content better?\n\nOr do AI overviews already include everything your pages can do? If so, it's gonna be tough.\n\nA couple of years ago I built a very good calculator for a huge website I owned, made the post better than anything else out there, got decent backlinks to it, and crickets... Couple of clicks a day. Never more. AI overviews just gobbled it up...",
          "score": 1,
          "created_utc": "2026-01-28 18:55:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o29q0q6",
              "author": "Few_Standard_8886",
              "text": "Yes i research the keywords and then write based on that. I have multiple daily utility tools on my website.",
              "score": 2,
              "created_utc": "2026-01-28 19:17:00",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o29muzy",
          "author": "gptbuilder_marc",
          "text": "That line is the tension. You’ve got indexing, impressions, a few clicks, but the curve never really steepens. With utility-style sites it’s usually about whether the bottleneck is authority, intent alignment, or how Google ends up classifying the pages over time. Which pages are actually getting the impressions versus where you expected traction?",
          "score": 1,
          "created_utc": "2026-01-28 19:03:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o29qxci",
              "author": "Few_Standard_8886",
              "text": "Thanks. I do keyword research and target long-tail queries, but CTR is low. I think authority + how Google classifies utility sites is my bottleneck (plus AI overviews reducing clicks). Now focusing on adding use-cases and FAQs around tools.\n\nAt this stage, would you prioritize backlinks or improving existing pages first?",
              "score": 1,
              "created_utc": "2026-01-28 19:21:01",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o29x63r",
                  "author": "gptbuilder_marc",
                  "text": "That’s a pretty reasonable read. One thing people miss at this stage is that “backlinks vs content” is often the wrong fork when impressions are there but CTR stays soft.\n\nWhen Google hasn’t really decided what a utility page is yet, links mostly just amplify whatever classification already exists. If it’s being treated like a thin tool or reference, more authority can mean more impressions without changing how it’s shown or clicked. That’s why the curve stays flat even as visibility creeps up.\n\nWhat usually matters first is whether the page earns a clearer intent label over time. Use cases, FAQs, examples, those aren’t just filler. They’re often the signals that move a page from “functional resource” to “solution someone actually chooses,” which affects snippets, sitelinks, and where clicks go. Once that settles, links start to compound instead of leaking.\n\nThe AI overview point is real too, but I’ve still seen pages get clicks when they’re the obvious next step after the summary, not just the cited source.\n\nOut of curiosity, are most of the impressions hitting the core tool pages, or the surrounding explanatory content you’ve been adding?",
                  "score": 1,
                  "created_utc": "2026-01-28 19:49:10",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2ai2fb",
          "author": "unicorn69love",
          "text": "link building is def the big gap for utility sites like yours cold outreach for guest spots on niche blogs worked for me but its slow af and rejection heavy. also check if AI overviews are sniping your queries cuz thats killed tons of calculators ive seen. patience or pivot to social/video traffic maybe",
          "score": 1,
          "created_utc": "2026-01-28 21:21:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2e30mn",
          "author": "Middle-Anywhere-6865",
          "text": "If you want to grow quickly, run paid ads. Of course, keep doing SEO, but it's a long-term game.",
          "score": 1,
          "created_utc": "2026-01-29 11:06:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2jrmpa",
          "author": "nikolasthefirehand",
          "text": "I was in almost the same spot. I had a tiny utility style site that sat at basically zero traffic for months. SEO was fine on paper, but nothing was happening. Facebook felt completely saturated, so I started digging through Reddit to see how other people were actually getting eyes on their sites.\n\nThat’s when I stumbled into using Reddit more intentionally and later found Odd Angles Media’s Reddit SEO blueprint. After following some of the posting and comment strategies they talked about, I finally started seeing organic traffic and a few legit leads coming in. Not overnight, but enough to prove it worked.\n\nBig thing I learned is backlinks matter, but distribution matters first. If no one ever sees your pages, Google has nothing to react to.",
          "score": 1,
          "created_utc": "2026-01-30 04:54:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2rgaua",
          "author": "spanky1312",
          "text": "links are def the missing piece for utility sites google sees ya but aint trustin yet. i poked around searchtides for ai/geo visibility on a similar calc site but it was meh w/o solid backlinks first. grind haro or niche outreach thats what moved my needle",
          "score": 1,
          "created_utc": "2026-01-31 09:10:27",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qtc7z3",
      "title": "Tracking my site growth – am I moving fast enough?",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1qtc7z3/tracking_my_site_growth_am_i_moving_fast_enough/",
      "author": "Ok_Childhood1395",
      "created_utc": "2026-02-01 22:00:38",
      "score": 8,
      "num_comments": 30,
      "upvote_ratio": 1.0,
      "text": "Hey folks, I’ve been tracking my website stats for the last \\~1.5 months (New Site 1.5 Months old). Here’s the summary:\n\nClicks: 318\n\nImpressions: 34k\n\nAverage position on Google: 7\n\nTraffic is mostly organic search (\\~82%), with daily users growing from \\~5/day to 27–34/day by the end of the month.\n\nI’m trying to get a sense of whether this is slow, medium, or fast growth for a new content site. Thoughts? Am I on the right track?",
      "is_original_content": false,
      "link_flair_text": "Progress Report",
      "permalink": "https://reddit.com/r/Blogging/comments/1qtc7z3/tracking_my_site_growth_am_i_moving_fast_enough/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o32y6nf",
          "author": "zorroh-academy",
          "text": "How do you see your average place on Google?",
          "score": 1,
          "created_utc": "2026-02-02 01:57:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o33rucg",
              "author": "Ok_Childhood1395",
              "text": "On search cknsole",
              "score": 1,
              "created_utc": "2026-02-02 04:57:09",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o33d1i7",
          "author": "Top-Parsnip-1540",
          "text": "honestly for 1.5 months this is solid. avg position 7 on a new site is actually impressive - most people are stuck on page 2-3 for months.\n\nthe 5 to 30 users/day growth curve is what matters more than the absolute numbers. if that keeps compounding youre in good shape.\n\none thing id watch - your CTR (clicks/impressions). 318/34k is about 1%. thats a bit low for position 7. might be worth testing some title/meta tweaks to see if you can bump that up.",
          "score": 1,
          "created_utc": "2026-02-02 03:22:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o38p7qu",
              "author": "Ok_Childhood1395",
              "text": "Thanks man.. Any more tips from your side?",
              "score": 1,
              "created_utc": "2026-02-02 22:46:10",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o33nbnz",
          "author": "scribe-kiddie",
          "text": "That's actually impressive by my measure lol\n\nMay I know what kind of blog do you run? And are you particular on SEO?",
          "score": 1,
          "created_utc": "2026-02-02 04:26:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o34e6ow",
              "author": "Ok_Childhood1395",
              "text": "Niche is on food (not reciepe)..I am not experience/expert of SEO.. Just following basic SEO & chose may be less competitive microniche i guess",
              "score": 2,
              "created_utc": "2026-02-02 08:03:49",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o33ovtz",
          "author": "swiftpropel",
          "text": "Those are in reality very solid numbers with regard to a 1.5 months old site. 5 to 30 users per day, with the majority of its users being organic, an average position of 7, and a couple-hundred clicks is the precise form of what can be considered as healthy early traction. When you continue to produce and enhance content over the next 6–12 months, then you will have a much better growth outlook.",
          "score": 1,
          "created_utc": "2026-02-02 04:36:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o38p6ld",
              "author": "Ok_Childhood1395",
              "text": "Thanks man.. Any more tips from your side?",
              "score": 1,
              "created_utc": "2026-02-02 22:46:00",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o33pwzs",
          "author": "kubrador",
          "text": "you're doing fine but also nobody can tell you if it's \"fast enough\" because that depends entirely on what you're trying to do. are you trying to make rent? retire? just procrastinate at work? those are different timelines.\n\n\n\nwhat i can tell you is 34 daily users after 1.5 months is solid for a brand new site with zero backlinks, so don't get impatient and start buying traffic like a maniac.",
          "score": 1,
          "created_utc": "2026-02-02 04:43:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o34cyxw",
              "author": "Ok_Childhood1395",
              "text": "Start buying traffic like a maniac means bro?? Didnt get.. whats that? Btw thanks for reponse",
              "score": 1,
              "created_utc": "2026-02-02 07:52:29",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o33vmhp",
          "author": "GrowthZen",
          "text": "You're crushing it after 1.5mos... above median benchmarks for new sites.\n\nfast growth: 34k impressions, 318 clicks (0.94% CTR), average position 7, 82% organic and 5->30 daily users. median new blogs see 5-10% monthly traffic growth early (for example 50-100 clicks in month 1), with 4k-10k impressions for \\~200 clicks... your numbers double that trajectory. an 82% organic share beats the 11% average for small blogs. position 7 is strong (typical new sites sit on pages 2-3).\n\non track: \\~6x daily user growth aligns with a 5.92% CMGR median, projecting \\~88% annual growth (for example 2.5k -> 4.7k monthly views in year 1). CTR is low at 0.94% compare to a 2-5% benchmark... optimize titles and meta descriptions for a potential 20-30% lift.\n\nnext: publish 24-30 core posts in 90 days for a \\~30% traffic boost. and test social/email distribution (used by \\~90% of bloggers) to compound SEO. you're ahead... compound it.",
          "score": 1,
          "created_utc": "2026-02-02 05:24:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o34e9s1",
              "author": "Ok_Childhood1395",
              "text": "Thanks a lot man for your guidance 🙏🏻",
              "score": 1,
              "created_utc": "2026-02-02 08:04:38",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o34ezsk",
                  "author": "GrowthZen",
                  "text": "You're welcome man good luck 🙌",
                  "score": 1,
                  "created_utc": "2026-02-02 08:11:28",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o340sx4",
          "author": "shajid-dev",
          "text": "lol my impressions and clicks are way lower compared to your stats. You doing good and solid. Just double down it.",
          "score": 1,
          "created_utc": "2026-02-02 06:05:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o38ooob",
              "author": "Ok_Childhood1395",
              "text": "Any tips from your side? Thanks",
              "score": 1,
              "created_utc": "2026-02-02 22:43:30",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o346yna",
          "author": "Reasonable_Lab136",
          "text": "Dude, average position 7 after just 1.5 months is genuinely impressive. Most new sites sit on page 3-4 for the first 3-6 months waiting for the Google sandbox to lift. The fact that you’re already on page 1 average tells me your keyword targeting is on point. Going from 5 to 30+ daily users in a month is a solid growth curve - if you keep this trajectory, you could easily hit 100+/day by month 4-5. What niche are you in?",
          "score": 1,
          "created_utc": "2026-02-02 06:57:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o34d1r8",
              "author": "Ok_Childhood1395",
              "text": "Food niche",
              "score": 1,
              "created_utc": "2026-02-02 07:53:12",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o34j45j",
                  "author": "Reasonable_Lab136",
                  "text": "Thanks! Yeah, food niche - specifically recipe/meal prep content. Started with low-competition longtail keywords like ‘easy weeknight dinners for beginners’ and building from there. Any specific advice for food blogs based on what you’ve seen work?",
                  "score": 1,
                  "created_utc": "2026-02-02 08:50:56",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o34cv0g",
          "author": "Ok_Childhood1395",
          "text": "Niche: Food site\nMy site was also seen in google ai info (some content with link).. Thanks a lot community for your info 🙏🏻",
          "score": 1,
          "created_utc": "2026-02-02 07:51:29",
          "is_submitter": true,
          "replies": []
        },
        {
          "id": "o34yw10",
          "author": "madhuforcontent",
          "text": "Overall good",
          "score": 1,
          "created_utc": "2026-02-02 11:19:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o38om7l",
              "author": "Ok_Childhood1395",
              "text": "Thanks",
              "score": 1,
              "created_utc": "2026-02-02 22:43:09",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3539w8",
          "author": "SevdaSevinu",
          "text": "May I know what platform you use? WordPress?",
          "score": 1,
          "created_utc": "2026-02-02 11:55:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o38olc8",
          "author": "Ok_Childhood1395",
          "text": "Yes wordpress",
          "score": 1,
          "created_utc": "2026-02-02 22:43:02",
          "is_submitter": true,
          "replies": []
        },
        {
          "id": "o39vm08",
          "author": "unicorn69love",
          "text": "decent start but that 1% CTR at pos 7 is brutal - titles probably need work or more volume. i ramped my new site faster by letting Nextblog AI handle keyword research and spitting out weekly posts on autopilot, got me to 50+ daily users quicker. keep compounding tho youre not bombing it.",
          "score": 1,
          "created_utc": "2026-02-03 02:41:11",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qra9nk",
      "title": "Why did a specific blog post of yours do better than you expected?",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1qra9nk/why_did_a_specific_blog_post_of_yours_do_better/",
      "author": "Gullible-Specific-49",
      "created_utc": "2026-01-30 16:30:54",
      "score": 7,
      "num_comments": 22,
      "upvote_ratio": 0.9,
      "text": "Often times, when I crank out a good blog post, the readers think otherwise.  I'm not too great at blogging so I don't mind.  The other day though, I had a blog post do much better than expected (six people commented vs. the typical one person, woohoo!).  It got me thinking that it may have been the use of a certain word in the title that did well for online searches related to my niche.  Anyways, I'd love to hear from this community about similar stories.  Which blog post of yours took off unexpectedly and why did you think that happened?",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/Blogging/comments/1qra9nk/why_did_a_specific_blog_post_of_yours_do_better/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o2mo1lx",
          "author": "Captlard",
          "text": "No idea why. But it got published in a newsletter and got me 58k visits in a month. Normally about 2k a week.",
          "score": 6,
          "created_utc": "2026-01-30 16:36:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2nioqm",
              "author": "Gullible-Specific-49",
              "text": "Sweet! Have they reached out since?",
              "score": 3,
              "created_utc": "2026-01-30 18:51:21",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2no9t2",
                  "author": "Captlard",
                  "text": "They never asked.",
                  "score": 3,
                  "created_utc": "2026-01-30 19:16:12",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2mv81f",
          "author": "Vinaya_Ghimire",
          "text": "Most of my high performing blog posts are on the topics that haven't heavily explored online, are long, and well written and well structured.",
          "score": 5,
          "created_utc": "2026-01-30 17:08:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2nitwu",
              "author": "Gullible-Specific-49",
              "text": "Awesome! How long do you typically shoot for for your blog posts?",
              "score": 3,
              "created_utc": "2026-01-30 18:51:59",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2rz3l6",
                  "author": "Vinaya_Ghimire",
                  "text": "I aim for 1500-2500 words",
                  "score": 3,
                  "created_utc": "2026-01-31 12:04:00",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2n4gz8",
          "author": "ThePanasonicYouth",
          "text": "1. it answered questions around a certain band which brought in tons of evergreen/organic traffic\n2. the article shows up on the first page of google when searching for said band\n3. now i'm constantly getting paid offers that cover my rent/expenses (know your worth)",
          "score": 5,
          "created_utc": "2026-01-30 17:49:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2n6dpq",
              "author": "Writingisaneed16",
              "text": "what kind of offers? Brand deals?",
              "score": 3,
              "created_utc": "2026-01-30 17:57:55",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2n7nkk",
                  "author": "ThePanasonicYouth",
                  "text": "getting paid for guest posts",
                  "score": 3,
                  "created_utc": "2026-01-30 18:03:27",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o2nin3h",
              "author": "Gullible-Specific-49",
              "text": "That's awesome! What genre of music for the band?",
              "score": 2,
              "created_utc": "2026-01-30 18:51:09",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2nqnfj",
                  "author": "ThePanasonicYouth",
                  "text": "Hard to say since they blend multiple genres",
                  "score": 3,
                  "created_utc": "2026-01-30 19:26:56",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2r7n1d",
          "author": "hondanlee",
          "text": "In 1985, I wrote a letter to the *South China Morning Post* (Hong Kong) commenting on attempts to suppress democracy in the territory. I decided to reproduce this letter on my blog in 2016, and it became my most widely read post (4-79k views and 47 comments).",
          "score": 3,
          "created_utc": "2026-01-31 07:49:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2sr4z2",
              "author": "Gullible-Specific-49",
              "text": "That's a ton! Awesome to keep track of that letter for so long too.",
              "score": 3,
              "created_utc": "2026-01-31 15:02:37",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2rdekf",
          "author": "Ok-Valuable-714",
          "text": "I wrote a post about the cultural shock of travelling to Saudi Arabia as a woman. I only shared it on Reddit and it got me 5,000 visitors in a few days, and hundreds of comments on Reddit. Since then, I changed my blog name, gave it a slightly new direction, and it's still the most read post on my blog, even months after.\n\nWhy? I think because the subject is divisive and that brings traction and interest. Some readers agreed with my experience, other criticised it, some readers argued with each other... it was a bit wild!",
          "score": 3,
          "created_utc": "2026-01-31 08:43:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2sr85b",
              "author": "Gullible-Specific-49",
              "text": "Awesome perspective to bring and teach others about, very cool!",
              "score": 2,
              "created_utc": "2026-01-31 15:03:05",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2rel32",
          "author": "digitaldisgust",
          "text": "It was breaking news at the time, lol. Still my highest read article to date, I got de-indexed not long after though 🤣☠️",
          "score": 3,
          "created_utc": "2026-01-31 08:54:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2sra8e",
              "author": "Gullible-Specific-49",
              "text": "Cool to get in early and it happens!",
              "score": 2,
              "created_utc": "2026-01-31 15:03:25",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2vqj54",
          "author": "Intrepid-Fox-266",
          "text": "Omg one did way better because it was about a Chinese company, and I think the Chinese government tried to DDOS me hahaha. Anyway it got thousands of views.",
          "score": 2,
          "created_utc": "2026-01-31 23:53:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2yzigg",
              "author": "Gullible-Specific-49",
              "text": "Interesting! Do you typically write about companies in other countries or was that a one off post?",
              "score": 1,
              "created_utc": "2026-02-01 14:06:39",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o31d4qc",
                  "author": "Intrepid-Fox-266",
                  "text": "I write about tech and try to keep it pretty global, although most of the companies I write about are based in the US, UK, or Europe",
                  "score": 1,
                  "created_utc": "2026-02-01 20:54:21",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qqnnf2",
      "title": "Blogging in 2026: The compliance curveball bloggers should know about",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1qqnnf2/blogging_in_2026_the_compliance_curveball/",
      "author": "Italcan",
      "created_utc": "2026-01-29 22:44:48",
      "score": 7,
      "num_comments": 4,
      "upvote_ratio": 1.0,
      "text": "Been blogging since 2019. Three sites, mixed niches, decent traffic. Thought 2025's big challenge would be content flooding or Google algo updates. Nope. It's accessibility compliance.\n\nTwo of my blogs have EU audiences. Just found out about EAA 2025 - June deadline, mandatory WCAG 2.2 compliance, fines that'll make your hosting bill look like pocket change. Suddenly my \"good enough\" designs are liability traps.\n\nI prided myself on clean aesthetics. Minimalist themes, subtle colors, sleek navigation. Turns out \"subtle\" often means \"invisible to screen readers\" or \"unusable for keyboard navigation.\"\n\nMy food blog had recipe cards with gorgeous low-contrast text - light gray on white for \"elegant\" typography. WCAG wants 4.5:1 minimum. Had to darken everything. Looks \"less premium\" but actual humans can read ingredient lists now.\n\nFocus indicators were another blind spot. Removed default browser outlines for that polished look. Keyboard users? Completely lost. WCAG 2.2 specifically tightened focus appearance rules - minimum size, contrast, not obscured by other elements.\n\nThen there's target size. My \"clean\" social sharing buttons? 20x20px. WCAG 2.2 requires 24x24px minimum. Had to redesign entire component.\n\nAnyone else scrambling? Found tools that don't require hiring accessibility devs? Found One Tap it's a plugin for Wordpress and it handles baseline fixes, but curious what design compromises you've made for compliance vs. aesthetics?",
      "is_original_content": false,
      "link_flair_text": "Tips/Info",
      "permalink": "https://reddit.com/r/Blogging/comments/1qqnnf2/blogging_in_2026_the_compliance_curveball/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o2i6i7l",
          "author": "gptbuilder_marc",
          "text": "Yeah, this one sneaks up on people fast. It’s not even WCAG itself, it’s how suddenly it stops being an SEO or UX thing and turns into legal risk. What’s eaten the most time so far, figuring out what actually counts, auditing what you already have, or trying to fix components without blowing up the site?",
          "score": 3,
          "created_utc": "2026-01-29 23:30:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2yqut8",
              "author": "Italcan",
              "text": "Exactly - the shift from “best practice” to “compliance liability” happened fast. For me, the biggest time sink has been retrofitting components without breaking layout. Especially things like target size and focus indicators - they seem minor until you realize they’re baked into dozens of templates and styled inconsistently",
              "score": 1,
              "created_utc": "2026-02-01 13:13:43",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2yqzo1",
          "author": "Krisika",
          "text": "Are you testing accessibility only on the desktop, or are you testing mobile adaptation too?",
          "score": 2,
          "created_utc": "2026-02-01 13:14:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2yr2sb",
              "author": "Italcan",
              "text": "I definitely check my mobile -especially the touch target sizes and contrast in bright light conditions. WCAG 2.2 has just increased the requirements for interactive elements, and this is critical on mobile devices. I'm using a simulation in DevTools + a real test on my phone.",
              "score": 1,
              "created_utc": "2026-02-01 13:15:09",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qttwc3",
      "title": "3 months in, How am I doing?",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1qttwc3/3_months_in_how_am_i_doing/",
      "author": "thebrokeblogger",
      "created_utc": "2026-02-02 12:37:04",
      "score": 7,
      "num_comments": 14,
      "upvote_ratio": 0.89,
      "text": "I am a master procrastinator. I have been planning to starting a blog since 2019. Studied all the aspects religiously. watched thousands of videos. Read hundreds of blogs. I was sure I was gonna make bank with Adsense. \n\nBut, I am a master procrastinator. I failed to take action. But I did not gave up on watching videos and reading blogs on how I was going to start my own blog.\n\nEventually, In Nov 2025 I made ChatGPT my mentor and published my first blog. I was so overwhelmed by the information that I could not decide where to start. I am thankful to openAI and chatGPT for guiding me through all the processes including hosting, designing website, setting up various pages. Of course I did all the things myself, ChatGPT helped me to streamline the process. This was a game changer for me. \n\n  \nThen on 25th Nov ~~2026~~ 2025 I published 7 blogs. And then, I went back to my old ways. I did nothing till Jan end. In Jan end I published 15 more blogs. \n\nI write blogs with AI but with restricted sources. The blogs are informative in nature.\n\n  \nBelow are some stats till date. I don't know what to make of it. Perhaps you guys can help.\n\n|Month|Total Clicks|Total Impressions|\n|:-|:-|:-|\n|Nov|7|145|\n|Dec|78|5470|\n|Jan|85|14100|\n|Feb Till Date|4|285|\n|Total|174|20000|\n\n  \nHeres' a screenshot of search console https://postimg.cc/Z0w80Kmf. \n\nWhat do you guys think? Is this any good? The CTR is making me nervous.\n\n  \n",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/Blogging/comments/1qttwc3/3_months_in_how_am_i_doing/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o362ci1",
          "author": "elysian0907",
          "text": "How on Nov 2026 you published 7blogs? \n\nAre you living in the future ?",
          "score": 3,
          "created_utc": "2026-02-02 15:22:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o36aqwg",
              "author": "RaviTejaKNTS",
              "text": "2025. That’s a typo.",
              "score": 1,
              "created_utc": "2026-02-02 16:02:14",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o36htmn",
              "author": "thebrokeblogger",
              "text": "My bad it's a typo",
              "score": 1,
              "created_utc": "2026-02-02 16:34:59",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o35ixyx",
          "author": "RaviTejaKNTS",
          "text": "Not bad, but avg position 2.9 suggests that most traffic might be from you searching site:. Look for queries and focus on positions on Google. This is good enough traffic for 3 months.",
          "score": 2,
          "created_utc": "2026-02-02 13:40:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o36ilre",
              "author": "thebrokeblogger",
              "text": "Thanks for the feedback",
              "score": 1,
              "created_utc": "2026-02-02 16:38:31",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o35hi6a",
          "author": "SodiumBoy7",
          "text": "Nice",
          "score": 1,
          "created_utc": "2026-02-02 13:32:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o35kt9m",
          "author": "Top_String05",
          "text": "Did you apply for adsense?",
          "score": 1,
          "created_utc": "2026-02-02 13:50:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o35l4nw",
              "author": "thebrokeblogger",
              "text": "I did. I took a leap of faith on Saturday. Yet to hear from them.",
              "score": 1,
              "created_utc": "2026-02-02 13:52:28",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o35lb9z",
                  "author": "Top_String05",
                  "text": "Best wishes 🙂",
                  "score": 2,
                  "created_utc": "2026-02-02 13:53:28",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o36c5sh",
          "author": "Con01010",
          "text": "Hi there, this is Master Procrastinator II.\n\nI have severe ADHD and have started so many blogs, but nothing ever happened.\nI would like to change that and would be happy to exchange ideas with you.\n\nBuilding a blog is not an issue for me, just sending traffic to it.\n\nFeel free to get in touch. I look forward to hearing from you.",
          "score": 1,
          "created_utc": "2026-02-02 16:08:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o36iyz2",
              "author": "thebrokeblogger",
              "text": "I have made a fb page for my blog. I post Links on it. I post in relevant groups too. The Post have some reach but on clicks.",
              "score": 1,
              "created_utc": "2026-02-02 16:40:10",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o37qvbp",
          "author": "pushingpetunias",
          "text": "youre like me. i started a blog in 2010 and since then every year i have been telling myself to \"rebrand\" and never do. \n\nlife gets in the way or just me thinking that it's a waste of time. \"do people even read blogs anymore?\" \"why would someone read my blog?\" \n\nall the ideas i come up with are taken...\n\nbut this year i am determined to be consistent and see where it goes:)",
          "score": 1,
          "created_utc": "2026-02-02 20:01:17",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qtutg8",
      "title": "Niche doesn’t matter much in blogging",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1qtutg8/niche_doesnt_matter_much_in_blogging/",
      "author": "Key_Question5584",
      "created_utc": "2026-02-02 13:19:04",
      "score": 6,
      "num_comments": 5,
      "upvote_ratio": 1.0,
      "text": "Many bloggers worry a lot about choosing the “perfect niche”.\n\nI used to think the same.\n\nMy blog is mainly about employee topics like resumes, career tips, and job guides.\n\nBut the highest traffic on my blog comes from a marriage-related article, not from my main niche.\n\nI also wrote a few posts about stock market, and those also brought good traffic.\n\nWhat I learned:\n\n* Real-life experiences work\n* Personal stories work\n* Screenshots and proof work\n* Solving real problems works\n\nIt doesn’t matter if the topic is outside your niche.\n\nEvery blog post you write is unique content on the internet.\n\nDon't overthink the niche or domain name.\n\nJust write something that solves a problem for at least one person",
      "is_original_content": false,
      "link_flair_text": "Tips/Info",
      "permalink": "https://reddit.com/r/Blogging/comments/1qtutg8/niche_doesnt_matter_much_in_blogging/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o36ag0x",
          "author": "LuckyRubberDuckie",
          "text": "I think both points here can be true at the same time. Early on, niche focus helps Google understand who you’re for. But those “random” posts that take off usually work because they’re reactive and tied to a real situation, question, or experience people are actively searching for right now.\n\nGoogle doesn’t rank domains by theme as much as it ranks pages by intent satisfaction. If a post solves a very specific problem with proof, screenshots, or firsthand experience, it can win even outside your main topic. That’s why personal, timely posts often outperform perfectly “on-niche” but generic content.",
          "score": 2,
          "created_utc": "2026-02-02 16:00:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o38wowr",
          "author": "New-Vast1696",
          "text": "True. I have many different topics on my blog and all of them drive traffic. Most people just look at one article anyway or those that are related and I linked in the one they are looking at.",
          "score": 2,
          "created_utc": "2026-02-02 23:25:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o35gxt4",
          "author": "Top_String05",
          "text": "I agree with you but in the initial days google looks for authority to be built.  So if your content is not powerful. It will be misleading and you may not get the traffic which you are expecting from your choice of niche \n\nJust an observation 🙂",
          "score": 1,
          "created_utc": "2026-02-02 13:28:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o35iloj",
              "author": "Key_Question5584",
              "text": "Once we get AdSense approval, we can write on any keyword.  \nGoogle still ranks the content if it is useful.  \nI have seen this on multiple blogs where their pages rank for random keywords not related to their main niche.  \nI have personally experienced this on my blog.  \nThe only benefit of sticking to a niche is that we become better at a specific niche.  \nIn the end, each blog post is unique, and the domain is just a part of the URL.",
              "score": 2,
              "created_utc": "2026-02-02 13:38:19",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o35jzla",
                  "author": "Top_String05",
                  "text": "Oh okay nice info !!",
                  "score": 1,
                  "created_utc": "2026-02-02 13:46:06",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qqb2yy",
      "title": "The state of AI SEO in numbers",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1qqb2yy/the_state_of_ai_seo_in_numbers/",
      "author": "Contentpreneur-vic",
      "created_utc": "2026-01-29 15:09:02",
      "score": 4,
      "num_comments": 4,
      "upvote_ratio": 1.0,
      "text": "As a part of my research to better understand how SEO is evolving, I spent some time digging into AI SEO studies from Semrush, PwC, Search Engine Land, and Google's reports.   \n  \nHonestly, there’s a lot of noise around AI and SEO right now, so I focused on the numbers that actually seem to matter in 2026.\n\nThese ten statistics caught my attention because they reveal what’s really happening behind all the AI buzz:\n\n1. **60% of marketers** use AI for keyword research, though accuracy remains a concern. (Semrush)\n2. **48%** leverage AI to brainstorm content ideas, **38%** for content briefs and outlines. (Semrush)\n3. **Top-ranked AI citations** come from pages with higher engagement metrics (longer sessions, more pages per visit, better conversions). (Semrush)\n4. **Organization, Article, and Breadcrumb schema** are the top 3 markup types appearing in AI citations. (Semrush)\n5. **Organic traffic dropped just 2.5%** year over year—far less than the predicted 25-60% decline. (Search Engine Land)\n6. **Traditional SEO KPIs** (rankings, CTR) are losing relevance as AI reshapes search results. (Kevin Indig)\n7. **88% of AI Overview triggers** are informational searches, impacting educational content the most. (Semrush)\n8. **AI Overviews reached 2 billion monthly users** across 200+ countries by mid-2025. (Google reports)\n9. **68% of AI Overview triggers** are low-volume keywords (under 100 monthly searches). (Semrush)\n10. **56% of CEOs** report no revenue gains from AI in the past year, highlighting the gap between adoption and effective implementation. (PwC)\n\n\n\n  \n",
      "is_original_content": false,
      "link_flair_text": "Tips/Info",
      "permalink": "https://reddit.com/r/Blogging/comments/1qqb2yy/the_state_of_ai_seo_in_numbers/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o2iydgu",
          "author": "GrowthZen",
          "text": "Love this breakdown as it cuts through the doomsday takes and matches what larger datasets showed in 2025-26.\n\nthe 2.5% organic drop vs the predicted 25-60% traffic apocalypse lines up with broader SEO studies showing Google still sends the majority of web traffic compared with all social and content platforms combined.\n\nthe fact that \\~60% of marketers use AI for keyword research and \\~50% for ideation/briefs while 56% of CEOs see no revenue lift, perfectly captures the implementation gap. lots of tools and not enough strategy or measurement.\n\nthe AI overview stats are huge which are mostly informational queries, mostly low‑volume keywords and \\~2B monthly users by mid‑2025. that tells me bloggers with deep educational content and strong engagement are still well positioned if they optimize structure (schema, internal links) and onpage UX.\n\nif you expand this id be curious to see the AI overview impact split by niche. and how click‑through behaves when your page is cited versus when it isn’t.",
          "score": 2,
          "created_utc": "2026-01-30 02:02:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2wnufo",
              "author": "Contentpreneur-vic",
              "text": "Thank you for the ideas! I agree on this one: \"AI overview impact split by niche.\" I want to expand the list and will be checking more studies.",
              "score": 1,
              "created_utc": "2026-02-01 03:08:26",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2r0hht",
          "author": "Dangerous-Disk5155",
          "text": "Interesting stuff thank you for sharing!!!",
          "score": 2,
          "created_utc": "2026-01-31 06:44:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2wnhpw",
              "author": "Contentpreneur-vic",
              "text": "welcome!",
              "score": 1,
              "created_utc": "2026-02-01 03:06:15",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qqej2n",
      "title": "Can you recommend some best web hosting for travel bloggers",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1qqej2n/can_you_recommend_some_best_web_hosting_for/",
      "author": "Dramatic-Passage-963",
      "created_utc": "2026-01-29 17:11:56",
      "score": 4,
      "num_comments": 13,
      "upvote_ratio": 0.75,
      "text": "Hey everyone, I'm new to this independent blogging. So, I need some best web host which r affordable, begginer friendly and works completely fine, even tho I post 15-20 blogs a month. \n\nAlso, one more question, are blue host  or hostlinger, that bad?? I was going to get one of them as they were affordable. However, I did some research and they had insane amount of ad reviews. ",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/Blogging/comments/1qqej2n/can_you_recommend_some_best_web_hosting_for/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o2g01bs",
          "author": "Charming-Tear-8352",
          "text": "Are you coding the website yourself?\n\nI find Cloudflare Pages to be the best for hosting. They have unlimited bandwidth and great performance.",
          "score": 2,
          "created_utc": "2026-01-29 17:17:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2g0mwl",
              "author": "Dramatic-Passage-963",
              "text": "Yes, but I have no coding skills",
              "score": 1,
              "created_utc": "2026-01-29 17:19:52",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o2g0tbj",
              "author": "Dramatic-Passage-963",
              "text": "How much does cloudflare cost? I have heard abt it alot",
              "score": 1,
              "created_utc": "2026-01-29 17:20:40",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2g5ar8",
                  "author": "Charming-Tear-8352",
                  "text": "Cloudflare doesn't cost anything for static sites. For a travel blog you most likely will be making a static site. \n\nIf you know some coding, [Jekyll](https://jekyllrb.com) is a good place to start. If you don't know coding or want something simple and quick, try [tlblog](https://tlblog.site).\n\nThese are static site generators that will help you generate your site for free and let you host on Cloudflare Pages or Netlify.",
                  "score": 1,
                  "created_utc": "2026-01-29 17:41:01",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o2gt62m",
              "author": "usamaejazch",
              "text": "I built [justblogged.com](http://justblogged.com) just for these benefits but without requiring any coding skills. \n\nJustBlogged is hosted on Cloudflare's global infrastructure.",
              "score": 1,
              "created_utc": "2026-01-29 19:29:07",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2j8u5p",
          "author": "JackTheMachine",
          "text": "No... No... Avoid Blue. You better go with Hostinger. If I can recommend, you can try Asphostportal, not big company, but I've been with them for years and service is good. They fully support Wordpress",
          "score": 2,
          "created_utc": "2026-01-30 03:00:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2jdb0l",
              "author": "Dramatic-Passage-963",
              "text": "Can u give me some reasons y I should go with asphostportal?",
              "score": 1,
              "created_utc": "2026-01-30 03:26:07",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2jfa4t",
                  "author": "JackTheMachine",
                  "text": "Hmm... This is only my personal experience, for me, they are good and stable, plus what I love is they keep renewal price low, most of big providers will cost 3 times higher for renewal. But, you can always choose Hostnger too, for small project, they should be OK. The choice is on your hand. Good luck!",
                  "score": 1,
                  "created_utc": "2026-01-30 03:37:32",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2gag9j",
          "author": "xylo_dan",
          "text": "You can try the no-code option I just launched.  [xylo.gg](http://xylo.gg)\n\nEasy to use, and will be adding new features every week focused on AI assisted, automated, human in the loop cross-posting and scheduling.\n\nNo credit card required for first 30 days and use code LAUNCH to get $5/month.  Be one of the early users and lock in $7 for life.\n\nI'll be deeply in tune with my early users and build features that you need.",
          "score": 1,
          "created_utc": "2026-01-29 18:03:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2gdyx5",
          "author": "ImOdysseus",
          "text": "Any managed wordpress hosting will suit you. Managed means they take care of updates and such. Wordpress .com recently has included plugins on all plans, even basic ones. There are hosting comparators like this one https://www.toolpile.net/best-web-hosting-finder-compare-in-1-minute/",
          "score": 1,
          "created_utc": "2026-01-29 18:19:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2gt229",
          "author": "usamaejazch",
          "text": "if you want something for free and flexible, try [justblogged.com](http://justblogged.com)",
          "score": 1,
          "created_utc": "2026-01-29 19:28:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2jj6qy",
          "author": "mannyned2",
          "text": "If you’re new to blogging and publishing 15–20 posts a month, you don’t need perfect hosting — just something affordable and reliable. Bluehost and Hostinger aren’t as bad as the reviews make them seem; they’re heavily advertised, which skews opinions, but they’re fine for starting and you can always migrate later. Other solid beginner-friendly options include SiteGround or Cloudways if you want better performance. You can also consider Substack, which removes hosting complexity entirely and lets you focus purely on writing and growing an audience. That said, hosting isn’t usually the biggest bottleneck early on — distribution is. Writing consistently matters, but getting your posts seen matters more. That’s where ReGenr.app helps: it’s a creator-first platform (currently in beta) that automatically shares your blog posts across social platforms when you publish, so your content doesn’t just rely on SEO. The goal is simple: write once, distribute everywhere, and grow without burning out.",
          "score": 1,
          "created_utc": "2026-01-30 04:00:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2jydnz",
          "author": "Holiday-Oil2598",
          "text": "15-20 is aggressive. If you want to build at scale, use something that let’s you scale easily. I’ve been on Wordpress forever, own a few travel style blogs and have done the blue host then then thing. Everything I have is now hosted in Vercel and is a react app using markdown for pages. It’s a game changer. If you want to take your site seriously I would ditch Wordpress, get a $20 Claude pro license, and vibe code the perfect react website. Might sound daunting, but I promise Claude is up to the task these days a you will be essentially free hosting for a long time.",
          "score": 1,
          "created_utc": "2026-01-30 05:42:09",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qro9w7",
      "title": "How would you promote, and get the first 100 visitors to your blog if you start again?",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1qro9w7/how_would_you_promote_and_get_the_first_100/",
      "author": "StevenJang_",
      "created_utc": "2026-01-31 01:14:34",
      "score": 4,
      "num_comments": 4,
      "upvote_ratio": 0.75,
      "text": "It's 2026, the year of TikTok and AI.\n\nWhat would be the best playbook for new blogs, in your opinion?",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/Blogging/comments/1qro9w7/how_would_you_promote_and_get_the_first_100/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o2pov3j",
          "author": "useomnia",
          "text": "Hot take: don’t “promote a blog.” Promote a problem you solve. The blog is just the receipt. 100 visitors is like 20 good comments and 5 people who go “wait, can you expand on that?”",
          "score": 1,
          "created_utc": "2026-01-31 01:23:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2pplyb",
              "author": "StevenJang_",
              "text": "What AI did you use to generate this comment?",
              "score": 1,
              "created_utc": "2026-01-31 01:27:46",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2pq737",
                  "author": "useomnia",
                  "text": "an AI called procrastination and caffeine. Runs locally. Bugs constantly",
                  "score": 1,
                  "created_utc": "2026-01-31 01:31:14",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2pueet",
          "author": "Intrepid-Fox-266",
          "text": "I tell you what I wouldn't do again. I wouldn't launch a memecoin to try and promote my blog. I ended up getting tons of traffic, but it was the wrong kind of traffic... I kinda got pigeonholed as a crypto site when I just wanted to write about funny tech stories.",
          "score": 1,
          "created_utc": "2026-01-31 01:56:06",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qommse",
      "title": "What should beginners look for in WordPress hosting?",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1qommse/what_should_beginners_look_for_in_wordpress/",
      "author": "AttitudeImportant134",
      "created_utc": "2026-01-27 18:46:28",
      "score": 3,
      "num_comments": 4,
      "upvote_ratio": 1.0,
      "text": "Choosing WordPress hosting can be confusing for beginners because most people only talk about price. In reality, the quality of hosting affects almost everything about your website, including speed, user experience, and even how well it can rank on search engines.\n\nFrom what I’ve learned, the three most important things to look at are speed, reliability, and customer support. Speed matters because visitors don’t like waiting. If a page takes too long to load, most people just leave. Search engines also prefer faster websites, so slow hosting can hurt your rankings over time.\n\nReliability is another big factor. If your hosting has frequent downtime, your site may be unavailable when people try to visit it. This can be frustrating for users and can make your website look unprofessional. For anyone planning to grow a blog or niche site, uptime is something that should not be ignored.\n\nSupport is especially important for beginners. When you are new to WordPress, small issues can feel big because you may not know how to fix them. Having access to helpful support can save a lot of time and stress. Even simple things like installing WordPress or setting up email can become easier with good support.\n\nFor beginners, hosting should ideally be:\n• Easy to set up  \n• Affordable  \n• Stable and fast  \n• Suitable for SEO and monetization  \n\nA lot of people start with the cheapest hosting they can find. While that can work for very small sites, it often comes with slow speed and limited resources. Over time, this can affect traffic and user experience. Switching hosting later is possible, but it can be inconvenient, so choosing something decent from the start can be a better long-term decision.\n\nAnother thing to consider is how hosting affects monetization. If someone wants to use ads or affiliate links in the future, website performance becomes more important. A fast and stable site keeps visitors longer, which can improve engagement and make monetization more effective.\n\nWhat helped me was reading guides that explain hosting in simple terms instead of just pushing one company. Comparing cheap hosting versus more reliable options made it easier to understand what you are actually paying for. Things like server quality, security, and scalability matter more than most beginners realize.\n\nI think the best approach is to treat hosting as the foundation of your website. Content is important, but if the foundation is weak, everything else becomes harder. Spending a bit of time learning what makes hosting “good” can prevent problems later.\n\nI’m curious what others here are using for their WordPress sites. Did you start with cheap hosting or something more reliable? And did you notice any difference in speed or stability over time?\n\n",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/Blogging/comments/1qommse/what_should_beginners_look_for_in_wordpress/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o230jrq",
          "author": "AgainstEvilll",
          "text": "I am using [hostinger](https://hostinger.in?REFERRALCODE=ENLMOMINSW70), and it is reliable",
          "score": 1,
          "created_utc": "2026-01-27 20:26:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o233u78",
              "author": "AttitudeImportant134",
              "text": "Thanks for sharing! I’ve heard good things about Hostinger too.\nDid you notice any speed improvement after switching?",
              "score": 2,
              "created_utc": "2026-01-27 20:41:35",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2345bf",
                  "author": "AgainstEvilll",
                  "text": "Barely faced any speed issue\nBut, do a proper survey/research before getting it",
                  "score": 1,
                  "created_utc": "2026-01-27 20:42:58",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qpnl3f",
      "title": "mediavine or raptive - thoughts?",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1qpnl3f/mediavine_or_raptive_thoughts/",
      "author": "poorpatheticplanet",
      "created_utc": "2026-01-28 20:51:00",
      "score": 3,
      "num_comments": 5,
      "upvote_ratio": 1.0,
      "text": "hi all - i have a website monetized with adsense. currently 27k monthly traffic, mostly US, niche craft topic, earning about $280-350 ish per month with ads (traffic increased recently so its hard to give a good average of earnings).\n\ni’m thinking of applying to mediavine journey or raptive but im just not sure if i should or if i should wait and increase my traffic more.\n\nas far as raptive goes- im worried my traffic will go down and i wont be within their requirements anymore (25k traffic per month). i believe im having a seasonal increase right now so i dont know how traffic will look in the next few months. and as far as mediavine goes- ive heard some horror stories of people getting much lower rpm with journey than they had with adsense. if possible i’d love insight from people who have experience with either of these networks. ",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/Blogging/comments/1qpnl3f/mediavine_or_raptive_thoughts/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o2amiiy",
          "author": "Icy-Papaya-2967",
          "text": "You should still apply to raptive. Once you get in you won’t get kicked out even if your site goes below 25k visits. It may even increase - Raptive gives its publishers with gate kept strategies on their blog.",
          "score": 1,
          "created_utc": "2026-01-28 21:40:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2asz7e",
              "author": "poorpatheticplanet",
              "text": "oh thanks, i saw on their site that the do ongoing evaluations so i wasn’t sure. are you with them?",
              "score": 1,
              "created_utc": "2026-01-28 22:08:54",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2b0rwe",
                  "author": "Icy-Papaya-2967",
                  "text": "Yes. I am in their insider program. Also used Mediavine’s main program before switching to them but the biggest non negotiable was that Mediavine pays on net 65 terms which is like waiting for two months to get paid. I don’t know about most people but I got bills to pay. Raptive on the other hand operates on net 45 terms",
                  "score": 1,
                  "created_utc": "2026-01-28 22:45:24",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}