{
  "metadata": {
    "last_updated": "2026-03-01 16:49:58",
    "time_filter": "week",
    "subreddit": "Blogging",
    "total_items": 19,
    "total_comments": 140,
    "file_size_bytes": 160146
  },
  "items": [
    {
      "id": "1ref6nx",
      "title": "SEO & Copywriter with 7 Years of Experience — Launched My Blogs and Just Hit 4900€ /Month",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1ref6nx/seo_copywriter_with_7_years_of_experience/",
      "author": "SEO403",
      "created_utc": "2026-02-25 14:47:42",
      "score": 43,
      "num_comments": 15,
      "upvote_ratio": 0.98,
      "text": "I have been in SEO for 7 years. Started in-house, moved to agency, after that, SEO for affiliates in a large media group, and then, self-employed. Now I have 3 SEO clients and blogs I launched 10 months ago.\n\nI have a site in the VPN niche (1 GEO), one in crypto (1 GEO), and one in iGaming (2 GEOs). I hired someone to manage my SEO clients and dove deep into the blogs.\n\nI bought aged domains relevant to each niche to avoid the initial period of establishing authority from zero. \n\nGiven the fact that it was work I already did for several years, the only thing I had to do was work with an affiliate relations manager on a freelance basis, and one writer. Did the content strategy, plans, briefing and all else myself.\n\nSince launching, I have not taken a penny from what has been generated and reinvested everything.\n\nHere are some of my takeaways no matter the niche:\n\n\\- Backlinks are king in most regulated, highly profitable markets. Nowadays, there aren't many high-paying affiliate industries that are not saturated. Starting as a solo person is tough, as backlinks from the relevant domains are not cheap. So, keep that in mind.\n\n\\- AI content will very unlikely help you compete with long-form content. It is simply not ready. For someone who may be in the betting space, perhaps, creating automatic analysis content for football/basketball...  will work, in fact, it is the best use of AI, given that these matches happen daily, and it removes the need to distract writers from focusing on areas that are timeless. But for your normal content, do not rely on it.\n\n\\- Your money pages must be regularly updated. Every month I would say. You would be surprised at how fast rankings drop for highly commercial pages, no matter how good they are. There is always someone trying to take your spot. Sometimes including widgets or assets in your page that regularly autoupdate gives Google the impression  that the page is fresh and maintained.\n\n\\- Do not reinvent the wheel. See what your competitors are doing. Do the same, + a few differentiating aspects to summarise what users would find in 5 blogs from the 1st page of the SERPs in your article alone.\n\n\\- Think GEO. We are transitioning fast into a solution first environment. So, author mentions, citations, and more are super important.\n\n\\- Contrary to popular belief, You do not have to change the practices you used to do, just place a bit more focus on the AIO and GEO aspects.\n\n\\- Negotiate with affiliates once you have relevant traffic for better deals. Starting from scratch, they will just throw you a bone.\n\nMany people say it is impossible to make money blogging nowadays, but it is far from the true. I do not do ads. The company I worked for was making 15M per year with about 20 affiliate projects in 15 GEOs. They started in 2018.\n\nMy goal is not even that. It is to scale to 6 figures per month launching multiple GEOs and multiple projects in the next few years, and sell it as a media group. You can too.",
      "is_original_content": false,
      "link_flair_text": "Tips/Info",
      "permalink": "https://reddit.com/r/Blogging/comments/1ref6nx/seo_copywriter_with_7_years_of_experience/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o7cmm3x",
          "author": "Camino_Financiero",
          "text": "Hi. I’m curious how you handle authorship on your site: do you write the posts yourself, work with writers/contributors, or use an institutional byline?\n\nAnd if you have multiple authors, how do you keep a consistent editorial tone so each piece doesn’t feel like it’s coming from a different site?\n\nI’m still learning, and it would really help me to understand your thinking.",
          "score": 1,
          "created_utc": "2026-02-25 16:28:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7cp55p",
              "author": "SEO403",
              "text": "I have a writer. I was lucky enough to know the writer beforehand. He specialises in most of the industries I am doing. The editorial tone has been established from the beginning based on the trends we observed among competitors whilst doing the initial competitive analysis, but, still giving him the creative freedom to write as he normally would while remaining aligned.\n\nEvery blog has been great so far, He has some reputation. So, his name is on the blogs as the author.\n\nBut, the tone can be different between blogs. As far as I am concerned, this has never been a factor. Most of the companies I have been with were consistent delegating projects to writers and making them owners of each project, but, several different writers often contributed into one project. Adhering to certain content guidelines, but having creative freedom.",
              "score": 1,
              "created_utc": "2026-02-25 16:39:51",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7ct0d1",
                  "author": "Camino_Financiero",
                  "text": "Thanks — that’s really helpful. When you say “I have a writer,” do you mean it’s the same person writing for all three sites, or one writer per project?\n\nHave you ever tried using an institutional byline (like “Editorial Team” / “Staff”), and if not, why do you prefer showing the author’s name even when it’s just one writer?\n\nDo you also publish as an author yourself, or are you mostly editing/directing?\n\nI’m asking because I’m building multiple sites and, budget-wise, I’ll probably be writing for more than one at the beginning. I keep wondering whether having the same author across 3–5 projects reads as consistency/transparency… or whether it can work against you by “mixing signals.” I’m interested in your reasoning, not a rule.",
                  "score": 2,
                  "created_utc": "2026-02-25 16:57:23",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7d0pg4",
          "author": "beingoptimistlab",
          "text": "Congrats — especially doing it in regulated niches. That’s not beginner mode.\n\nCurious about one thing:\n\nWhen you say backlinks are king (which I agree with in VPN/crypto/iGaming), how are you balancing risk vs velocity? Are you going heavier on digital PR / niche edits / partnerships, or building slower but cleaner?\n\nAlso — with GEO expansion, are you localizing content deeply or mostly translating + adapting?\n\nRegulated niches scale fast, but penalty risk is also higher. Would love to hear how you’re thinking about that long-term.",
          "score": 1,
          "created_utc": "2026-02-25 17:32:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7i25g4",
              "author": "SEO403",
              "text": "Early on, I prioritise relevance and clean authority; digital PR, strong niche placements, and brand building before pushing volume.\n\nOnce the domain has stability and diversified anchors, I increase velocity in a controlled way without creating obvious patterns or over-optimised footprints.\n\nAs per the GEO expansions, zero translations. Not worth the risk. Each piece of content is unique. As per the landscape being shaky, it is a risk I am willing to take. There is way more upside than downside, based on my experience.",
              "score": 1,
              "created_utc": "2026-02-26 12:10:37",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7in0l6",
                  "author": "beingoptimistlab",
                  "text": "What are the free digital PR sites and backlinks strategy are you follwing. Can you share it with us if you don't mind.",
                  "score": 1,
                  "created_utc": "2026-02-26 14:16:32",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7hffrk",
          "author": "FutureEye2100",
          "text": "Where are you customers coming from - Search Engines, Social Media or direct to your page?",
          "score": 1,
          "created_utc": "2026-02-26 08:47:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7i26in",
              "author": "SEO403",
              "text": "Search engines.",
              "score": 1,
              "created_utc": "2026-02-26 12:10:50",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7ifx93",
          "author": "Early_Barracuda2739",
          "text": "Congratulations! For the success, and it really motivates me to hear that blogs still earn money. \n\nI have a few questions: \n\n1. When you say \"affiliate projects\", does it mean blog posts having affiliate links strategically placed Or creating a newsletter and then promoting the affiliate products to the subscribers?\n\n2. I am planning to start a health and wellness blog, and a tech blog, can you please suggest some strategies to create content and rank in SERPs, and whether these niches can be considered for creating a profitable blog?",
          "score": 1,
          "created_utc": "2026-02-26 13:38:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7p7f5y",
          "author": "EquivalentTerrible54",
          "text": "Whats your method to get backlinks?",
          "score": 1,
          "created_utc": "2026-02-27 13:46:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7qzdm5",
          "author": "Efficient_Elk_7991",
          "text": "list the urls that are doing this",
          "score": 1,
          "created_utc": "2026-02-27 18:58:13",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rd4o5k",
      "title": "Blogging Sometimes Feels Lonely",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1rd4o5k/blogging_sometimes_feels_lonely/",
      "author": "bylandoo",
      "created_utc": "2026-02-24 04:02:35",
      "score": 37,
      "num_comments": 33,
      "upvote_ratio": 1.0,
      "text": "I've been blogging for a while now and I enjoy writing, but lately I've been feeling a bit lonely. You spend hours researching, writing, editing... and then you publish and everything goes silent.\n\nI don't expect to go viral or anything, but sometimes I wonder if I'm doing something wrong. I try to focus on improving my content and being consistent, but growth feels slow.\n\nWhat helped you start seeing real engagement?",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/Blogging/comments/1rd4o5k/blogging_sometimes_feels_lonely/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o731csd",
          "author": "vaibh990",
          "text": "Yep, It does feel that way. The silence of initial years might lead to something fruitful later, but it's difficult to keep the motivation going.",
          "score": 9,
          "created_utc": "2026-02-24 04:51:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o75zv7q",
              "author": "Dootcom",
              "text": "How did you kept it up?",
              "score": 2,
              "created_utc": "2026-02-24 17:00:37",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o73n1jv",
          "author": "dwoodro",
          "text": "What are you blogging about? \n\nTopics that encourage discussion will be more likely to encourage interaction. Many times, a blog post is \"informative\", and people might just read it and move on. Other posts could be deeply moving and get others to open up. \n\nAdditional writing techniques, such as open-ended questions, cliffhangers, call-to-actions (does not have to be a paid process), etc, can be implemented to draw additional interactions. \n\nYou know what I mean? <--- sample, if I stop here it would encourage a reply.\n\nBut that's just one example, more coming....  <-- people don't like unfinished steps. \n\nMake sure you upvote the post! <-- being encouraged to take direct actions. \n\nHope this helps get the ideas flowing. Keep us posted. ",
          "score": 5,
          "created_utc": "2026-02-24 07:52:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7kpvz3",
              "author": "abracadabra_7777",
              "text": "This!",
              "score": 3,
              "created_utc": "2026-02-26 20:08:45",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o74eqwt",
          "author": "Om_Forever",
          "text": "I’ve been doing it for 12 years and it’s still like that. You just have to be patient. It’s 6-18 months sometimes before a piece takes off.",
          "score": 4,
          "created_utc": "2026-02-24 12:02:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7br7uv",
              "author": "themissinglink_143",
              "text": "Similar to you, I've been blogging for 10 years. It was such a different environment back then \\[sigh\\] - I miss it.",
              "score": 2,
              "created_utc": "2026-02-25 13:55:28",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o73asno",
          "author": "Obvious_Jelly_8062",
          "text": "i've been blogging for a while now and i definitely know the feeling of loneliness that can come with it - sometimes it feels like i'm just writing into a void. one thing that's helped me is joining online communities of other bloggers, it's nice to be able to connect with people who understand what i'm going through. do you think it's possible to build a sense of community around a blog, or is that just not something that can be replicated online?",
          "score": 4,
          "created_utc": "2026-02-24 06:04:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o74vij9",
              "author": "Startlovinglife",
              "text": "Hey!! Can you share communities you have joined and recommend? Also what’s your blog about?",
              "score": 2,
              "created_utc": "2026-02-24 13:47:47",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o75zi8k",
                  "author": "Dootcom",
                  "text": "[r/TheBlogHub](https://www.reddit.com/r/TheBlogHub/s/cnVxy7yATR) lets you share your posts. It’s a small community that I started because I had the same problem of „not knowing how to reach new people“.",
                  "score": 3,
                  "created_utc": "2026-02-24 16:59:00",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o73id1j",
          "author": "TrendyIncome",
          "text": "Yeah sometimes it feel lonely but if you love the peace of working alone there is no job comparison to this. But keep in mind blogging is changing very quickly, if you completely focus on google traffic, google may vanish you. You need to focus on different traffic source like socia media",
          "score": 2,
          "created_utc": "2026-02-24 07:09:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o742w7t",
          "author": "YoBro_2626",
          "text": "That phase is super common - blogging is quiet before it’s visible. What helped me was not just publishing; but distributing, share each post where your audience hangs out (Reddit, LinkedIn, niche communities), and write with engagement in mind (clear opinions, relatable points, questions). Also update old posts instead of only creating new ones. Engagement usually starts when you stop posting and waiting and start actively putting your content in front of people. All the best!!!",
          "score": 2,
          "created_utc": "2026-02-24 10:22:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o757ta3",
          "author": "kaleandbeans",
          "text": "Leaning on to SEO and building a community will help with engagement and growth. That being said, for me, the lonliness that I felt didn't go away, even when my website was growing well. There's just something about needing face-to-face human interaction that online comments cannot fill. So I started being active in my community, being more intentional about building relationships with people outside, and finding work where I can collaborate with others.",
          "score": 2,
          "created_utc": "2026-02-24 14:52:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o72vyml",
          "author": "Impossible-Koala-368",
          "text": "I get this. I wish I could talk to my partner about my progress and excitement about my blog in a way that doesn’t sound like I’m speaking another language.",
          "score": 1,
          "created_utc": "2026-02-24 04:14:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o73t3xn",
          "author": "Used-Temperature-699",
          "text": "In initial months of new domain, it's a normal thing but how you represent your blogging is the most important thing.\n\nOrganic traffic on new blogs are often less to 0, but when you post consistently, you can see better results.\n\nTake benefit of social medial platforms to reach your targeted audience.\n\nIt will create huge difference before and after results, just implement the steps and see some traffic on your blog. ",
          "score": 1,
          "created_utc": "2026-02-24 08:49:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o73wfsi",
          "author": "QuiteEarner",
          "text": "I relate to this a lot. Sometimes it feels like you’re putting in so much effort and no one even notices. My blog is still small, so most days it’s quiet, but I’m hoping consistency and time will make a difference. Have you noticed if engagement improved gradually or did it suddenly change at some point?",
          "score": 1,
          "created_utc": "2026-02-24 09:21:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o74kmcx",
          "author": "beingoptimistlab",
          "text": "That silence after publishing is real. It feels like shouting into the void sometimes.  \nWhat helped me shift perspective was treating early blogging less like broadcasting and more like skill-building. The first phase isn’t about engagement — it’s about sharpening your voice and clarity.  \nEngagement usually started picking up when I focused less on “how many people saw this?” and more on “did this genuinely help someone specific?”  \nGrowth is slow, but consistency compounds quietly.",
          "score": 1,
          "created_utc": "2026-02-24 12:43:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o74o6ny",
          "author": "thepublisherindex",
          "text": "Agreed. Community is so important",
          "score": 1,
          "created_utc": "2026-02-24 13:05:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o75pfz4",
          "author": "Fuzzy_Possibility",
          "text": "Blogging is definitely lonely - you want to find friends who are on the same journey one of my best friends I met through blogging 15ish years ago we’ve never met be we talk almost everyday!\n\nFind your group of those who understand and you will find it a blessing!",
          "score": 1,
          "created_utc": "2026-02-24 16:14:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o75zydk",
          "author": "Vinaya_Ghimire",
          "text": "Blogging certainly feels lonely..These days not many people are interested in leaving comment, and in absence of engagement from real people it fees just like one way communication",
          "score": 1,
          "created_utc": "2026-02-24 17:01:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o760lj9",
          "author": "Dootcom",
          "text": "I try to find subreddits whenever I think there might be one that fits my post.\nIt definitely drives the numbers up, but unfortunately, the comments are negative about 9 out of 10 times. If you can handle that, subreddits are definitely a good place to start. And then, of course, you have to engage in the discussion.\nBesides that, I also started a newsletter so I can message people when there is something new. But it is the same problem there: how do I get people to subscribe to the newsletter? It is always the same thing. You just have to keep at it somehow.",
          "score": 1,
          "created_utc": "2026-02-24 17:03:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o76vdu4",
          "author": "Soccerrocks8",
          "text": "at first it's hard for everyone because this \"profession\" doesn't offer any security, especially financially ",
          "score": 1,
          "created_utc": "2026-02-24 19:21:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o77pxh6",
          "author": "akowally",
          "text": "Try building reciprocal relationships with other bloggers in your niche. Comment thoughtfully on their work, share it, and collaborate with them, it will create a community around your writing that makes it less isolated.",
          "score": 1,
          "created_utc": "2026-02-24 21:42:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o79ayr3",
          "author": "Sad-Matter2770",
          "text": "Which platform are you publishing on?\n\nAlso, what do you blog about?\n\nIf you want to easily attract readers and find your tribe, I highly recommend publishing on Substack (the Notes feature helps with gaining traction) or Medium (finding the right publications gives your content good visibility).",
          "score": 1,
          "created_utc": "2026-02-25 02:48:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7e2nkl",
          "author": "Nelson77777777",
          "text": "The problem is the multitude of AI blogs that create competition, and the real ones often go unnoticed.",
          "score": 1,
          "created_utc": "2026-02-25 20:25:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7jjfp5",
          "author": "juliasomething",
          "text": "Consistency and authenticity. It takes years for a search engine to see you as an authentic and authoritative voice in your field, but once you get there, you know that the work you put in was worth it.",
          "score": 1,
          "created_utc": "2026-02-26 16:51:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7kpkid",
          "author": "abracadabra_7777",
          "text": "I understand. What's your niche?\n\nHave you tried posting pins on Pinterest and posting on social media: IG, Threads, Facebook and X?",
          "score": 1,
          "created_utc": "2026-02-26 20:07:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7p5m2i",
          "author": "Upstairs-Kitchen5981",
          "text": "I feel the same. Like the world has move to an Instagram island and I am alone in blogging jungle near ocean. I just feel sad that no one, not even big companies punished googled for destroying the web on purpose.\n\n  \nEdit: If anyone is in everyday self-care, skincare, lifestyle niche, please share your blogs 🎀",
          "score": 1,
          "created_utc": "2026-02-27 13:36:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ymubg",
          "author": "RestaurantGreedy6662",
          "text": "I started blogging a week ago. When I uploaded the first 3 blog pages, I was very excited. Now I have more content and silence is there.\n\n\nAs you said growth feels slow but I guess we need to be patient.",
          "score": 1,
          "created_utc": "2026-02-28 23:16:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7zmcii",
          "author": "Few-Mud-5865",
          "text": "yeah, it's true ... esp. when you find the content you spend hours to create only have but few people to read ... but that's the life, don't expect too many people will be aware or interested in what you are doing; just do what you are interested in ;)",
          "score": 1,
          "created_utc": "2026-03-01 02:50:26",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rbu9po",
      "title": "My soaring traffic is finally here and I'm a bit at a loss!",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1rbu9po/my_soaring_traffic_is_finally_here_and_im_a_bit/",
      "author": "Thatwitchyladyyy",
      "created_utc": "2026-02-22 19:00:32",
      "score": 26,
      "num_comments": 49,
      "upvote_ratio": 1.0,
      "text": "Hi everyone! I am looking for tips on how to capitalize on my blog getting tons and tons of traffic. I wish I could say it's all due to my hard work, but I have only handful of quality posts and the topic I write on has become seemingly popular overnight. I've written about my blog before--it's basically on a celebrity and there's only 2 active blogs (including mine) dedicated solely to this celebrity. My traffic has gone from 15-20 per day to 400-600 over night. I don't want to miss my chance to capitalize on this!\n\nHere's my plan but I'd love to hear some real tips:\n\n\\- Immediately stop all my other side hustles and bring them down to a minimum and treat this blog like a full-time job. I do have what I'd call passive income-adjacent income. More or less, I can scale my main business down and still make money for less work because of the work I've already put in.\n\n\\- Build a guide off of an old post and capture more emails. I currently have about 30 emails captured.\n\n\\- Focus on building my blog and YouTube channel up to reach monetization ASAP\n\n\\- Immediately begin posting at least once a day\n\n\\- Push to get to 50k sessions in 30 days so I can potentially qualify for a network like mediavine. Currently, I am in no networks for this blog.\n\nWhat else would you do? I don't want to divide my attention too much. My Instagram and Pinterest are also growing, but I have problems when I try to do too much all at once.",
      "is_original_content": false,
      "link_flair_text": "Tips/Info",
      "permalink": "https://reddit.com/r/Blogging/comments/1rbu9po/my_soaring_traffic_is_finally_here_and_im_a_bit/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o6u430o",
          "author": "OldConstant182",
          "text": "Mediavine is now $5k yearly requirement but Raptive is 25,000 page views \n\nSo if momentum continues, you’ll qualify for Raptive sooner than later",
          "score": 6,
          "created_utc": "2026-02-22 20:39:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6u62u6",
              "author": "Thatwitchyladyyy",
              "text": "I saw that $5k thing--how do they quantify that? Like if you start on Raptive and make $5k, then you can qualify for Mediavine once you hit that and 50k sessions?\n\nThank you for the info, I'll shoot for Raptive First!",
              "score": 3,
              "created_utc": "2026-02-22 20:49:46",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6ud0s3",
                  "author": "OldConstant182",
                  "text": "One way would be that Journey tool they have if you’re on there (10k minimum sessions I think). May will recommend going on Journey to make more money, but as a web designer / UX guy I’d advise against it.\n\nWith Raptive they ask to link your GA so they can verify things, I’m assuming Mediavina is the same if you’re doing Adsense.\n\nI managed to meet the requirements for Raptive after 1 month of going live (on track for 30,000 views this month) but my domain is only 2 months old so they told me to wait until it’s 6 months. \n\nGood luck OP! Keep up with the content",
                  "score": 1,
                  "created_utc": "2026-02-22 21:24:40",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o6xx866",
                  "author": "Weekly-Afternoon-395",
                  "text": "Are you writing about Diddy?",
                  "score": 1,
                  "created_utc": "2026-02-23 12:39:02",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6v5ou4",
          "author": "ActuaryMean6433",
          "text": "If you haven’t applied for AdSense, you could try that. It’s not the best but it’s something. You can reapply if rejected, just add more content and try again.",
          "score": 1,
          "created_utc": "2026-02-22 23:59:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6vp1xl",
              "author": "Thatwitchyladyyy",
              "text": "AdSense is always so cringe, though. My blog is more or less fashion, lifestyle and history and Adsense is like...hey do you want to lose 20 lbs in a month?!",
              "score": 2,
              "created_utc": "2026-02-23 01:52:40",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6vsto2",
                  "author": "ActuaryMean6433",
                  "text": "You’ll find every ad network is cringe and runs ads like that.",
                  "score": 4,
                  "created_utc": "2026-02-23 02:15:23",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6vg805",
          "author": "meiggs",
          "text": "Definitely try and monetize it! Can I see the URL?",
          "score": 1,
          "created_utc": "2026-02-23 00:59:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6vpavr",
              "author": "Thatwitchyladyyy",
              "text": "I don't wanna dox myself. I'll just say it's an evergreen celebrity who is recently back in the spotlight. ",
              "score": 1,
              "created_utc": "2026-02-23 01:54:10",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6w1hzg",
                  "author": "meiggs",
                  "text": "My job is affiliate marketing, feel free to DM me if you wanna explore monetization. I've been in affiliate marketing for 10+ years for blogs.",
                  "score": 2,
                  "created_utc": "2026-02-23 03:08:33",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6wsy27",
          "author": "LordCryptoSparrow",
          "text": "Any chance I could get access to the blog?",
          "score": 1,
          "created_utc": "2026-02-23 06:31:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6xvq1w",
              "author": "Thatwitchyladyyy",
              "text": "No, I don't like personal info on Reddit. I need help but I don't really want to share it. I'm also a very bad blogger, I'm getting traction like this off of a handful of posts, I wish I had written more. ",
              "score": 1,
              "created_utc": "2026-02-23 12:28:02",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6xvshl",
                  "author": "LordCryptoSparrow",
                  "text": "Fair enough, had to ask😄",
                  "score": 1,
                  "created_utc": "2026-02-23 12:28:33",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6wunl2",
          "author": "Holiday-Oil2598",
          "text": "Forget the ads. Rpms are the worst they have ever been and they just make your site look crap anyway. You could look at affiliate programs, but instead take a beat and think about your readers. Why are they there, what are they interested in, what can you offer them. Does a subscription to special content or live updates make sense? Etc. Each page has potentially its own value proposition. Don’t follow everyone else’s money guidelines, make your own, and you will do better",
          "score": 1,
          "created_utc": "2026-02-23 06:46:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6xvkdc",
              "author": "Thatwitchyladyyy",
              "text": "Thank you, it's been like 10+ years since I've been in the position to make money off content. I'm going to focus on building my email list and increasing traffic organically with more posts for now. ",
              "score": 1,
              "created_utc": "2026-02-23 12:26:53",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6xz37j",
                  "author": "Holiday-Oil2598",
                  "text": "Beware of the more posts trap. More does not equal more traffic. EdwardS did a podcast recently showing a major site tanking despite tons of new posts. Authority won’t carry you if you’re missing the mark. Be careful, post in the same grouping as what’s already doing well, if you have great traffic then bed down the basics now.",
                  "score": 1,
                  "created_utc": "2026-02-23 12:51:51",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7460x4",
          "author": "onlinehomeincomeblog",
          "text": "First, I must congratulate for that kind of spike which is really exciting. When traffic jumps overnight, many makes this mistake of assuming it's permanent and restructuring your entire life around it.\n\nHere are my few thoughts;\n\n1. Validate the sustainability before quitting anything.\n\n2. Capture the attention before monetizing aggressively.\n\n3. Don't post daily just because traffic is high.\n\nRight now, our main job is to;\n\n\\-- Retain the traffic\n\n\\-- Capture mails\n\n\\-- Strengthen Internal structure\n\n\\-- Build authority around the topic\n\n",
          "score": 1,
          "created_utc": "2026-02-24 10:50:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o751ie4",
          "author": "Howard_Coan",
          "text": "I have some tips you can try here - [https://buymeacoffee.com/goldtravel/e/355027](https://buymeacoffee.com/goldtravel/e/355027) \\- I'm always on hand to answer any questions from my students. Use promo code TRYFOR1 to get the course for just £1.",
          "score": 1,
          "created_utc": "2026-02-24 14:19:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o754yz6",
          "author": "SituationOk905",
          "text": "Nice work! Given that you're in a trending niche I would start building Google Web stories, they have a wordpress app that similar to making IG stories. That way you can capitalize on the popularity. Rankmath can help with the webstory Schema so your more likley to get picked up.\n\nThe easiest monetization from here is an ad network like Journey by Mediavine. RPM's are lower than they have been but better than nothing and requires very little work on your end. If you can push to a premium platform like Mediavine Full or Raptive thats where the real money is made. \n\nThe difference is crazy, I've got 2 sites with similar traffic in adjacent niches, one on Journey getting $9 RPM's and another on Mediavine getting $47 RPM's. \n\nYou will need to stabalize the traffic and branch out a bit more before getting accepted to one of the big guys but Journey will get you started. Email can be a slog but worth setting up a few automations with Grow by Journey and Kit (formerly convert Kit) both are free. Grow will send new post's to subs automatically with a decently designed template thats hands off then you can get inot the weeds a bit more with Kit once the list is worth actively tapping.   \n\nHappy to answer any follow ups that dont DOX my sites or niche. ",
          "score": 1,
          "created_utc": "2026-02-24 14:37:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o78r50y",
          "author": "livemarvelous",
          "text": "I would place my focus on (1) building and nurturing my list and (2) fine tuning my offers to sell as much as possible and (3) create content to convert people at every stage of the buying process, research, product comparison, etc. \n\nCongratulations! 🎉",
          "score": 1,
          "created_utc": "2026-02-25 00:56:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o79y6o7",
          "author": "Ramen-Witch",
          "text": "Solo comento para venir después a leer las respuestas. Todas las encontré muy interesantes",
          "score": 1,
          "created_utc": "2026-02-25 05:15:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7dd0lz",
          "author": "Consistent_Ad2026",
          "text": "Create distribution",
          "score": 1,
          "created_utc": "2026-02-25 18:28:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7droyo",
              "author": "Thatwitchyladyyy",
              "text": "and that means.....?",
              "score": 1,
              "created_utc": "2026-02-25 19:35:01",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7j0qg4",
          "author": "Hot-Departure-25",
          "text": "Am I the only one that wants to know who the celebrity is?😭😅",
          "score": 1,
          "created_utc": "2026-02-26 15:25:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7k8npl",
              "author": "Thatwitchyladyyy",
              "text": "I have too much on this account to say lol, you'll just have to take my word for it. ",
              "score": 1,
              "created_utc": "2026-02-26 18:47:18",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6v38y8",
          "author": "Fuzzy_Possibility",
          "text": "Use your Google analytics to tell you where, how and why you are getting traffic and then build from that. What keywords are pulling them in. \n\nIf people are searching for that celebrities looks can you monetise via affiliates to brands could even be replicating the looks etc… (or anything else you maybe about to affiliate).",
          "score": 1,
          "created_utc": "2026-02-22 23:45:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6vp7fi",
              "author": "Thatwitchyladyyy",
              "text": "Yeah, I can see some of my posts going wild this month, I only have 6. I'm an idiot for not building more faster, but I'm also a full-time mom and work for myself part-time doing another business. Now the traffic is here and I have to drop everything lol",
              "score": 2,
              "created_utc": "2026-02-23 01:53:35",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6vrca1",
                  "author": "Fuzzy_Possibility",
                  "text": "You got this! Try not to think about what you should have done as that’s not going to help, but what you can do now. \n\nIt might be worth looking into adding a newsletter sign up as well you don’t need to do a newsletter this second but getting that data is a good start and if you go with Journey you can set it so they send out a round up once a week as long as you’ve posted something (I’ve not been able to face writing newsletters for the past year so I just have that turned on at some point I’ll go back to doing it myself but it’s a place holder 🤣)",
                  "score": 1,
                  "created_utc": "2026-02-23 02:06:22",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1rfti1r",
      "title": "Using blogging as a substitute for social media",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1rfti1r/using_blogging_as_a_substitute_for_social_media/",
      "author": "cyb7angel",
      "created_utc": "2026-02-27 01:51:31",
      "score": 24,
      "num_comments": 23,
      "upvote_ratio": 0.96,
      "text": "I want to get into blogging to move away from social media. I don't like insta and others tracking my behaviour and content and using it for profit. Currently trying to move away from it, degoogle myself and stop giving my data away for free.\n\nI like the idea of making a blog to keep in touch with my friends. Some type of website they can visit and get a peep into my life (on top of holding contact via phonecall and letters). I don't want to make any profit off of this. \n\n* It should be private. Readers can have access via password or other identification\n* I'd love to implement a live chat function to be available when 'online'\n* Blog entries with downloadable video, photography, pdf etc\n* Different protected folders (like one where I update the info to my adress and contacts, where I live and how my friends can call me)\n* It should not be tied to google or big tech, ethics and privacy are important, preferrably from the EU as well\n* Customizable, I want to have fun with the design!\n\n  \nI know that there probably is no option that provides all things I am looking for and I am willing to pay some money for it, but not too much as well since I am a broke student and want to make this as punk and cheap as possible where I don't have to think about profit.\n\n  \nHas anyone had experience with this?",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/Blogging/comments/1rfti1r/using_blogging_as_a_substitute_for_social_media/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o7mpxy5",
          "author": "software_guy01",
          "text": "I think WordPress could be a great fit for what you want because it gives full control over privacy, design and content. You can make posts private or password-protected, organize media in folders and even add live chat with plugins. WPForms is a lightweight and easy option for managing forms or interactions. You can host your site with a privacy-focused EU provider and still enjoy customizing the look without worrying about big tech tracking.",
          "score": 6,
          "created_utc": "2026-02-27 02:27:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7mt409",
          "author": "New-Vast1696",
          "text": "I have a blog and use a squarespace homepage for it. I know you can do private sections with passwords, downloadable pdf and it offers a wide range of design possibilities. I do not know about the other features but they have a lot of possibilities.",
          "score": 3,
          "created_utc": "2026-02-27 02:46:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7rd0hn",
          "author": "OrganicClicks",
          "text": "The project is technically doable. WordPress self-hosted on a European provider ticks most of your boxes. You get full design control, password-protected pages and posts, file downloads, and plugin support for live chat.\n\nBut your success in using it as a replacement for social could be limited. First, social media has trained people to be passive consumers in that content appears in a feed automatically. Asking your friends to actively remember to visit a URL is a big behavioral shift that most won't sustain without reminders.\n\nAlso, without a feed algorithm pushing your updates, you'll need to tell people when you've posted, which usually means a group chat or email list, which will start to feel like extra work on top of the blog itself.",
          "score": 3,
          "created_utc": "2026-02-27 20:05:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7rtmds",
              "author": "cyb7angel",
              "text": "Thanks. I don't care if they immediately see what I post. With some we only call twice a year and plan trips, so they're very slow and steady friendships without much urgency. I trust my friendships to not forget me. Some don't even use social media, so I'm glad to show them what I'm up to without them having to sign up somewhere *just for me.* And if that doesn't work, there's always text messages and phone calls? Idk why a lot of people are thinking friendship can only exist with social media. ",
              "score": 2,
              "created_utc": "2026-02-27 21:28:58",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7vloaj",
          "author": "RobertLigthart",
          "text": "did the same thing man. deleted instagram and most of the rest. honestly you dont miss it after the first week. for what youre describing tho... just spin up a simple site with something like ghost or even a static site if you can code a bit. wordpress is overkill for a personal blog for friends. keep it simple",
          "score": 3,
          "created_utc": "2026-02-28 13:41:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7s8moo",
          "author": "Howard_Coan",
          "text": "I used FastHosts to make a basic WordPress blog and I've been happy with their service so far https://www.fasthosts.co.uk/referral?referral=tk43cb27nj5k7 ",
          "score": 2,
          "created_utc": "2026-02-27 22:46:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ow9oh",
          "author": "DigiNoon",
          "text": "The point of using social media is that most all of your friends already have an account there and don't need to create another account at your special website. How many of your friends would bother to check your website regularly as opposed to checking their social media accounts?",
          "score": 2,
          "created_utc": "2026-02-27 12:38:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7p0ra9",
              "author": "cyb7angel",
              "text": "A lot, I hope so! I have many friends scattered around the country.  Some of them I talk to once in six months, some of them I see daily. Some friends of mine are not on social media, so we just call each now and then and plan trips. So there's definitely an existing friendship offline.\n\nBut I feel social media impacting my health and privacy on a big scale. Doomscrolling rots my mind and cookies sell every step I make so big tech can profit off of it. Every picture I post belongs to meta nowadays and they can do whatever they want to with it. I'd prefer autonomy over my information and not funding some billionaires lifestyle. Algorythm makes you passive and you suddenly forget how to reach out because your feed pushes peoples information towards you instead the other way around.\n\nI like the idea of them just having to click on a website and then they know whats up. Blogs are usually without an account, so it's free access but you can set up passwords only they know. Costs are some bucks a month, but if that means I don't have to sell my soul to the algorythmic machine then thats fine with me.\n\nLife before social media has existed. It was different, but it was possible. I think my friends care about me enough to vibe with it. Heck, let me be that one weird friend with a blog and a phone number. Those who like me stick around, those who don't see worth in friendship pass on. I would stick around for my friends no matter what shenanigans they're up to.",
              "score": 3,
              "created_utc": "2026-02-27 13:07:54",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7sdact",
                  "author": "MaximalistVegan",
                  "text": "A way to work around the issue of them not going out of their way to check your blog you could set it up so that you blog posts automatically create an email notice that goes out to your subscribers. That way your friends will see that you've published something when they're scrolling through their emails and they can click on the link in the email if they're interested. On Wordpress you can also opt to include your entire post in these emails which is probably a good idea if all you want is to stay in touch with people and don't care about monetizing your blog through clicks. You do need to get your friends to subscribe to your blog for this to work though",
                  "score": 2,
                  "created_utc": "2026-02-27 23:12:32",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7nbne2",
          "author": "Lawyer-2886",
          "text": "Go with [Bear Blog](https://bearblog.dev/)! It's exactly what you're looking for :) (I have no association, but I do use it and love it).",
          "score": 1,
          "created_utc": "2026-02-27 04:42:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7nn3q0",
          "author": "Strokesite",
          "text": "Substack",
          "score": 1,
          "created_utc": "2026-02-27 06:07:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7npsbc",
          "author": "AccomplishedBag1038",
          "text": "i use blogger. buy a good customisable template for like $10 and you can have a reasonable site that costs you nothing more other than a domain if you want one",
          "score": 1,
          "created_utc": "2026-02-27 06:29:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7o9xk2",
              "author": "cyb7angel",
              "text": "thanks. Isn't blogger by google?",
              "score": 2,
              "created_utc": "2026-02-27 09:31:59",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7yw4xx",
                  "author": "TerrisBranding",
                  "text": "yes",
                  "score": 1,
                  "created_utc": "2026-03-01 00:12:10",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7og4ax",
          "author": "Creative-External000",
          "text": "Yes what you’re trying to build is very realistic, and the best way to do it privately is to own your site rather than rely on social platforms. A self-hosted setup using WordPress or Ghost on an EU provider like Hetzner or Netcup gives you strong privacy, full customization, password-protected posts, downloadable media, and even live chat with plugins, all at a low monthly cost.\n\nIf you want an even more indie and tracker-free approach, static site tools like Hugo or WriteFreely are great but require more setup. The key is to avoid free hosted platforms that monetize your data with a small paid EU host, you’ll get the private, customizable, and “punk” blog experience you’re aiming for.",
          "score": 1,
          "created_utc": "2026-02-27 10:30:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7op66x",
              "author": "cyb7angel",
              "text": "Thank you! I've looked into indieweb and stumbled across Nekoweb and Neocities. They seem fun as well, even though they seem to cater much to anime culture, which I am not really into. But I like the concept and you can set up passwords and it's heavy on the customization part, which I like too. Do you have any recommendations/opinions about them as well? ",
              "score": 1,
              "created_utc": "2026-02-27 11:47:03",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7pzf9o",
          "author": "Local-Dependent-2421",
          "text": "you’ll probably like self-hosted wordpress or ghost. you can host it on an eu provider and keep full control + add password protected pages.\nfor chat you can add something like matrix/element or a simple comments plugin instead of social media.\nit takes a bit more setup, but once it’s running you basically own your space and aren’t tied to a platform.",
          "score": 1,
          "created_utc": "2026-02-27 16:08:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7pzgw9",
          "author": "mariiiiiiiiiiiiiiii-",
          "text": "BearBlog",
          "score": 1,
          "created_utc": "2026-02-27 16:08:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7qt5rb",
          "author": "YoxScorpion",
          "text": "i quit social media too and started blogging but my intention is not to post directly to my friends and restrict views, but talk about any stuff i enjoy and anyone can see it. currently I self host with Hugo and use cloudflare tunnel to expose it to the internet. but I know that you could also use CloudFlare Access to make visitor authenticate before seeing the content of your site.",
          "score": 1,
          "created_utc": "2026-02-27 18:29:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7w333r",
          "author": "NatAllie_D",
          "text": "This ,👌",
          "score": 1,
          "created_utc": "2026-02-28 15:19:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7y4hw6",
          "author": "LivourMana",
          "text": "Personally, I use Hugo for my blog. With the right scripts you can have a pipeline without any code",
          "score": 1,
          "created_utc": "2026-02-28 21:35:31",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rgr30m",
      "title": "4 Month Progress Report (for those of you following along)",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1rgr30m/4_month_progress_report_for_those_of_you/",
      "author": "Great-Slice-7714",
      "created_utc": "2026-02-28 02:51:04",
      "score": 17,
      "num_comments": 26,
      "upvote_ratio": 0.88,
      "text": "Hello everyone! It’s been 4 months since I’ve relaunched my niche, local wedding blog. Here’s where I am at.\n\nI managed to post 2 new blog posts in February, giving me a total of 29 blog posts.\n\nFebruary Traffic per Google Analytics: Event Count: 874 Active Users: 158 New Users: 153 Avg Session: 2m 39s\n\nNew user traffic: Organic search: 91 Organic social: 55 Direct: 32 Unassigned: 6 Referral: 13\n\nI did see a drop in visits this month, but it wasn’t super concerning to me. I saw an increase in organic search and that feels promising. I’ve even seen 17 new users in one day - it’s exciting and fun to watch my little blog gain momentum.\n\nNext steps? I like to keep a goal of 4 SEO rich posts a month. Yes, I very much rely on SEO in the sense that I try to really consider what a bride or couple would be searching for as they plan a wedding and the possibilities feel endless!\n\nI feel like this progress report didn’t bring much value this month .. I hope to have more to provide next month!\n\nAll I can say is continue being consistent, keep showing up and don’t take it so seriously!",
      "is_original_content": false,
      "link_flair_text": "Progress Report",
      "permalink": "https://reddit.com/r/Blogging/comments/1rgr30m/4_month_progress_report_for_those_of_you/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o7uxbb5",
          "author": "Learning1000",
          "text": "You should also be posting on pinterest with that niche. That would drive more tragic fast.\n\nIm planning my wedding now and save so many pictures on pinterest. \n\nI told my sister to start a blog in that niche. She missing out on additional money as an event planner.",
          "score": 8,
          "created_utc": "2026-02-28 10:28:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7wo6xi",
              "author": "Great-Slice-7714",
              "text": "Yesss! There’s so much opportunity there. I have dabbled in Pinterest but it’s all so overwhelming blogging, Pinterest, social media. I haven’t quite found a balance yet but I know I am missing out on more traffic.",
              "score": 3,
              "created_utc": "2026-02-28 17:05:06",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7y6dcr",
                  "author": "Learning1000",
                  "text": "You just need to focus on one.Social media platform, and that is pinterest your audience is on pinterest",
                  "score": 3,
                  "created_utc": "2026-02-28 21:45:31",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7uk3bm",
          "author": "QuiteEarner",
          "text": "Congrats on 4 months! 🎉 It’s impressive to see even small traffic jumps early on — shows your SEO strategy is working. Something I’ve noticed is that consistent organic posts + internal linking between related posts can really amplify those small wins. Keep tracking which posts bring the most traffic — it’s motivating to see patterns emerge!",
          "score": 4,
          "created_utc": "2026-02-28 08:21:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7worxe",
              "author": "Great-Slice-7714",
              "text": "Internal linking is something I’ve been quite consistent with . I actually keep a pretty detailed spreadsheet of where I’ve linked and where there’s potential for linking based off future posts! I like to believe that’s helping keep readers on the blog.",
              "score": 2,
              "created_utc": "2026-02-28 17:08:03",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7xrp9i",
                  "author": "Ok-Cardiologist-565",
                  "text": "Ive seen others say the same. How do you do your spreadsheet to keep track of interlinking?",
                  "score": 1,
                  "created_utc": "2026-02-28 20:26:32",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7uu664",
          "author": "Ok-Conclusion-3536",
          "text": "What was your daily record in visitors?",
          "score": 3,
          "created_utc": "2026-02-28 09:57:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7wpvg0",
              "author": "Great-Slice-7714",
              "text": "41 was the highest number of visitors in one day. This was due to a vendor sharing my blog post on their Instagram story and driving traffic.\n\nThis past month I had 2 random spikes, one 18 users and one 17 users. Both days I had an increase in organic social visitors. The odd part is I’ve been very quiet on social this month - haven’t posted since January so I’m not sure the cause there.",
              "score": 3,
              "created_utc": "2026-02-28 17:13:35",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o80tf23",
                  "author": "Ok-Conclusion-3536",
                  "text": "Not bad at all keep it up",
                  "score": 1,
                  "created_utc": "2026-03-01 08:26:56",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o81zjaj",
                  "author": "theSchnitzelbirder",
                  "text": "What was your most Google clicks in a day so far?",
                  "score": 1,
                  "created_utc": "2026-03-01 14:15:17",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7w0jtf",
          "author": "Lumaenaut_",
          "text": "As someone who’s also pretty new to blogging, this actually feels really encouraging to read.\n\n29 posts in 4 months is no joke, 2 posts in February and a goal of 4 a month sounds solid to me.\n\nThe part that stood out most is the increase in organic search. From what I understand, that’s the traffic that really matters long term. Even if total visits dipped a bit, seeing Google send more people your way feels like a win.\n\nAlso 2m 39s average session time seems good? That tells me people are actually reading your content, not just clicking and leaving.\n\nAnd 17 users in one day for a niche local blog sounds exciting honestly. I be checking analytics all day too 😂\n\nFrom a beginner perspective, this doesn’t feel like “no value”, it feels real.\n\nKeep sharing these updates. It’s motivating for those of us just starting out.",
          "score": 3,
          "created_utc": "2026-02-28 15:06:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7wr45z",
              "author": "Great-Slice-7714",
              "text": "I am so glad you found this valuable! I enjoy sharing these updates and I aim to keep it as real as possible.\n\nI 100% check my analytics, multiple times a day haha and get so excited when I see someone in real time actually visiting my little blog.\n\nI always find everyone else’s Progress Reports really encouraging so I will keep the updates coming!",
              "score": 2,
              "created_utc": "2026-02-28 17:19:48",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7wg0k4",
          "author": "RobertLigthart",
          "text": "91 organic search users at 4 months is actually solid for a local niche blog. most people give up way before they see any google traffic at all. the wedding niche is smart too... people are always searching for local vendors and ideas\n\n  \nthe pinterest tip from the other commenter is spot on btw, wedding content does insanely well there",
          "score": 3,
          "created_utc": "2026-02-28 16:24:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7wntgr",
              "author": "Great-Slice-7714",
              "text": "Thank you! It does feel very promising for a such a niche space!",
              "score": 2,
              "created_utc": "2026-02-28 17:03:11",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7wk7i0",
          "author": "corelabjoe",
          "text": "I've been at this since Aug 25 and am really just getting a feel for how SEO works and everything I did wrong... So this is encouraging!",
          "score": 2,
          "created_utc": "2026-02-28 16:45:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7wn8k4",
              "author": "Great-Slice-7714",
              "text": "Yes! I do think SEO should not be overlooked but it also shouldn’t be your main focus. You just have to find a way to balance SEO without compromising your personal style. Really take time to look through your intended audience’s lens.. what are they googling/searching for? How can you add value/help/entertain?",
              "score": 2,
              "created_utc": "2026-02-28 17:00:17",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o80acqu",
          "author": "StoryIllustrious3130",
          "text": "Congratulations. That's great for a new blog. Apart from writing what else you were doing to generate traffic? Were you promoting on Pinterest, Facebook, or other social media platforms? \n\nI have a new blog too in the travel niche (Asian Honeymoon) with just 11 posts so I wanted to know how to get more audience.",
          "score": 2,
          "created_utc": "2026-03-01 05:37:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o81rae9",
              "author": "Great-Slice-7714",
              "text": "Asian Honeymoon is a great niche!! I have an Instagram, Facebook and Pinterest. But not consistent with any. It’s a lot to manage. I find Instagram has helped me connect with local vendors. Being in the wedding niche Pinterest is the best direction to go and my next step is producing pins that will drive clicks and traffic!",
              "score": 1,
              "created_utc": "2026-03-01 13:24:55",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o823axq",
          "author": "Creative-External000",
          "text": "You’re actually off to a strong start 4 months in and organic search is already leading your traffic, which is a great sign Google is starting to trust your site. Instead of just aiming for four SEO posts a month, focus on building topic clusters around high-intent local keywords like “best wedding venues” and support them with related posts that interlink. \n\nThis builds authority faster than random standalone articles. Since weddings are highly visual, start leveraging Pinterest as a secondary search engine to drive consistent traffic. Collaborate with local vendors like photographers and planners for featured spotlights they’re likely to share and link back, boosting your visibility. \n\nImprove internal linking to increase session duration and strengthen rankings. You’re still in the compounding phase, and months 6–12 often show noticeable growth. Stay consistent, but now shift from just publishing regularly to publishing strategically.",
          "score": 2,
          "created_utc": "2026-03-01 14:36:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o818o1z",
          "author": "LessMaintenance1452",
          "text": "Congrats! Could you please send the link to your site? Thank you.",
          "score": 1,
          "created_utc": "2026-03-01 10:52:58",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rdh7j7",
      "title": "Is SEO still worth it in 2026, or are newsletters/social media more effective now?",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1rdh7j7/is_seo_still_worth_it_in_2026_or_are/",
      "author": "Lumaenaut_",
      "created_utc": "2026-02-24 14:08:55",
      "score": 17,
      "num_comments": 23,
      "upvote_ratio": 1.0,
      "text": "I’m trying to decide where to focus my time this year.\n\nI keep hearing mixed things about SEO - some people say Google traffic is harder than ever and AI search results are reducing clicks. Others still swear by long-term organic traffic.\n\nAt the same time, newsletters and social platforms seem more “direct” and less dependent on algorithms (at least long-term with email lists).\n\nIf you were starting a blog in 2026, would you still prioritize SEO? Or would you focus more on building an email list or social presence first?",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/Blogging/comments/1rdh7j7/is_seo_still_worth_it_in_2026_or_are/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o75lceb",
          "author": "RobertLigthart",
          "text": "email list first, SEO second. not because SEO is dead but because you own your email list and you dont own your google rankings. one algo update and your traffic disappears overnight... your email subscribers are still there\n\n  \nthat said SEO still works for long tail stuff. the AI overviews are eating the \"what is X\" queries but specific how-to content with real experience still ranks. just dont make it your only strategy like people did in 2020\n\n  \nif I was starting a blog today id write the content with SEO in mind but spend most of my promotion energy getting email signups from day one",
          "score": 4,
          "created_utc": "2026-02-24 15:55:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7ecric",
              "author": "Lumaenaut_",
              "text": "That makes a lot of sense. the “you own your email list” point is hard to ignore.\n\nInteresting what you said about AI overviews eating the broad “what is X” queries. That’s exactly the kind of content I see a lot of people recommending for beginners, so it’s helpful to hear that more specific, experience-based content might be safer long term.\n\nI also like the idea of writing with SEO in mind but focusing promotion on building the email list from day one. That feels like a more balanced approach instead of betting everything on rankings.",
              "score": 2,
              "created_utc": "2026-02-25 21:13:12",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o75tn1k",
          "author": "Remarkable-Dark2840",
          "text": "Everything have their own pros and cons.",
          "score": 4,
          "created_utc": "2026-02-24 16:32:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o77dbss",
          "author": "EmmaTheFemma94",
          "text": "SEO seems to be a thing that takes a lot of time and won't work for any piece of content. You need to target things with less competition.\n\nBut it's the most organic way of getting traffic. I think most sites should work at least gradually on their SEO since it can be a great long-term strategy. And basic on-page SEO often means just a good and accessibility friendly website which just makes the user experience better.\n\nThat said working on traffic from other directions could be faster and probably can be better to do at the start. And if your search engine ranking tanks (like it sometimes does)  then you have other traffic sources.\n\n",
          "score": 3,
          "created_utc": "2026-02-24 20:45:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7qw1eu",
              "author": "Lumaenaut_",
              "text": "That’s interesting. Do you think AI summaries and zero-click results change the ROI of SEO long term?\n\nI’m wondering if the strategy shifts more toward building authority + brand so people search for you directly rather than just ranking for keywords.",
              "score": 1,
              "created_utc": "2026-02-27 18:42:36",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o787ppv",
          "author": "HaryTotal",
          "text": "I don't think it has to be an either/or situation; I'd recommend doing both. I'd still pursue SEO in the sense that even if people are finding your blog less through traditional search engine results, they're still finding it through AI chatbot answers. If your page is frequently cited by chatbots, that will lead to more traffic. Answer engine optimization (AEO) is now a thing, but I've found that a lot of the principles are the same as SEO. So, if you use traditional SEO principles, you should do ok in chatbot results. ",
          "score": 3,
          "created_utc": "2026-02-24 23:10:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7qwjoe",
              "author": "Lumaenaut_",
              "text": "That’s a good point. It feels like AEO is less about gaming keywords and more about being the clearest, most structured answer on a topic.\n\nSo maybe SEO in 2026 is less about ranking #1 and more about being the most “citable” source?",
              "score": 1,
              "created_utc": "2026-02-27 18:45:00",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o799vg6",
          "author": "justanotherengtoo",
          "text": "the honest answer is they solve different problems, so it's not really either/or:\n\n**SEO = discovery.** people who don't know you yet find you through search. yes, AI overviews are eating some clicks, but they're mostly eating the informational \"what is X\" queries. if you write content that requires real experience, opinion, or nuance — the kind of stuff AI can't just summarize — it still ranks and still drives traffic. the shift is from \"answer the question\" content to \"share your perspective on the question\" content.\n\n**newsletter = retention.** once someone finds you, email is how you keep them. it's the only channel you fully own. algorithms can't throttle it, platforms can't deprioritize it. but you need a way to get subscribers in the first place, which is where SEO or social comes in.\n\n**social = amplification.** good for spikes of traffic and building an audience, but the shelf life of any individual post is hours. SEO content from 2 years ago still sends me traffic every day. a tweet from 2 days ago is gone.\n\nif I were starting a blog in 2026, my stack would be: write SEO-optimized content with genuine perspective → put an email signup on every post → repurpose the best-performing content into social posts. the blog feeds the list, the list feeds monetization, social feeds both.\n\nthe bloggers I see struggling are the ones who went all-in on one channel. diversification isn't just a finance concept.",
          "score": 3,
          "created_utc": "2026-02-25 02:42:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7qx673",
              "author": "Lumaenaut_",
              "text": "This breakdown is super helpful, especially the framing of discovery vs retention vs amplification.\n\nThe point about AI mainly eating low-value informational queries makes a lot of sense. It feels like the bar for SEO content is higher now, but not irrelevant, more “earned attention” than “keyword answering.”\n\nI like the stack you described too. It sounds less like picking a channel and more like designing a system where each one plays a specific role.\n\nDo you think it’s still realistic for a brand new blog to rely on SEO early, or would you focus on social first to generate initial momentum while SEO compounds?",
              "score": 1,
              "created_utc": "2026-02-27 18:47:56",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o79fvq5",
          "author": "Devman1797",
          "text": "I’ve personally been gaining a lot of traffic across my multiple sites, almost entirely thanks to blogs. Difference now is not to optimize for Google but instead for AI as majority of people have switched to that as their main source of truth",
          "score": 2,
          "created_utc": "2026-02-25 03:16:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7gku38",
              "author": "Ok-Cardiologist-565",
              "text": "How do you do that?",
              "score": 1,
              "created_utc": "2026-02-26 04:33:36",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7gloqm",
                  "author": "Devman1797",
                  "text": "Some key things are structured JSON, FAQS, related posts and a scannable and easily summarized first couple sentences. I use my own app to automate this but don’t want to shill it here. It’s easier to do so on custom blogs that run something like Nextjs or similar under the hood. Not sure what platform you use but there are many different approaches",
                  "score": 2,
                  "created_utc": "2026-02-26 04:39:32",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7awwti",
          "author": "QuiteEarner",
          "text": "I’m still early in blogging, but I decided to focus on SEO and Pinterest together instead of relying only on one source. From what I’ve been seeing, SEO seems slower but more stable long term, while platforms can bring traffic faster but less predictable. I’m curious if people who started recently are still seeing good results from SEO alone, or if combining it with platforms is becoming necessary now.",
          "score": 2,
          "created_utc": "2026-02-25 10:20:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7fgkec",
          "author": "SuperHornetFA18",
          "text": "https://www.reddit.com/r/SEO/s/IjDAXAjZJt\n\nRead the comments under this (my) post, i had similar question like you and some of the answers over there are great.",
          "score": 2,
          "created_utc": "2026-02-26 00:36:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o77i2w2",
          "author": "drifrut",
          "text": "You can do all of that: writing blogs and also creating social media posts. Most of what is the basic thing here is you need to build a digital footprint across different channels/mediums so that you can get better results in AEO or GEEO",
          "score": 1,
          "created_utc": "2026-02-24 21:07:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7brudy",
          "author": "TankAdmin",
          "text": "I started tracking a third channel this year. AI referral traffic. [claude.ai](http://claude.ai) showed up as a referral source in my Substack analytics before I had any meaningful SEO traction. It's not replacing either strategy but it's worth knowing whether AI tools are already sending you traffic before you decide where to focus.",
          "score": 1,
          "created_utc": "2026-02-25 13:58:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7h5del",
          "author": "madhuforcontent",
          "text": "SEO is still worth it. Also in today scenario, every effort to diversify website traffic sources makes sense. Newsletters are generally effective. Social search is once again gaining its prominence. ",
          "score": 1,
          "created_utc": "2026-02-26 07:13:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7t8mdb",
          "author": "El_Sunshine",
          "text": "Honestly, both -- but the game changed. \n\nSEO still works if you have something Google can't just summarize with AI. Original data, unique angles, stuff that doesn't exist anywhere else. \n\nI think: SEO gets people to find you, social gets people to care. You need both but if I had to pick one to start with in 2026 i'd go both !",
          "score": 1,
          "created_utc": "2026-02-28 02:20:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o81wbn4",
          "author": "Sumthingtotalkabout",
          "text": "I’ve been blogging since 2010 on Blogger, so I’m in an interesting middle stage. I have around 200 legacy “followers” from the giveaway era, but they’re not true email subscribers and I can’t directly communicate with them.\n\nMost of my traffic now comes from a mix of search, social, and direct visits — anywhere from 500–1000+ views a day. What I’ve learned is that traffic alone doesn’t equal audience.\n\nSEO still works for long-tail, experience-based content in my niche, but I can see the value in building an email list now because it’s the only channel you truly own.\n\nIf I were starting today, I’d probably write with SEO in mind but build an email list from day one — not because SEO is dead, but because diversification matters more than ever.\n\nI’ve experimented with moving followers to email, and it’s definitely harder to convert casual traffic into subscribers than I expected. That’s what’s pushing me to rethink how I build owned audience going forward.",
          "score": 1,
          "created_utc": "2026-03-01 13:56:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o82lpah",
              "author": "zetabyte00",
              "text": "Is your blog WordPress?",
              "score": 1,
              "created_utc": "2026-03-01 16:10:32",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1rcltzi",
      "title": "From Mediavine Journey to Mediavine",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1rcltzi/from_mediavine_journey_to_mediavine/",
      "author": "ceomds",
      "created_utc": "2026-02-23 16:19:26",
      "score": 14,
      "num_comments": 4,
      "upvote_ratio": 0.89,
      "text": "Hello everyone,\n\nMy wife has a blog for some years and she was on mediavine journey since end of 2024.\n\nHer blog was hit by famous Google search update in 2024 and it seems that (knock on the wood), she is not impacted by 2025 google search updates and she is today around 81% increase compared to previous year period with around 36-40k views (65% france, %15 USA and rest from canada/uk/Singapour etc).\n\nEnd of 2025 mediavine contacted her( even though she didn't have 5k revenue nor 50k sessions), they asked her if she wants to graduate her blog to Mediavine. Now we are at the end, finalizing couple of last steps to go live.\n\nI tried to check and didn't see many people that had this. therefore, i am wondering if anyone moved from journey to mediavine and did it get better than journey and how long did it take for it to really stabilize etc?\n\nThanks a lot,",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/Blogging/comments/1rcltzi/from_mediavine_journey_to_mediavine/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o7041kl",
          "author": "Holiday-Oil2598",
          "text": "Would love to know if it’s worth it in the end. Ad revenue is the worst it’s ever been",
          "score": 3,
          "created_utc": "2026-02-23 19:15:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7oe0nq",
          "author": "MuseumofWander",
          "text": "I graduated from Journey to Mediavine last year in October. It was indeed a very good upgrade. \n\nIn the half month of October that I joined Mediavine I made more than my best month I ever had on Journey. November and December were awesome. January and February were down (industry wide trend) but still made more than my best months with Journey. \n\nI’m pretty sure you won’t regret the move",
          "score": 2,
          "created_utc": "2026-02-27 10:10:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o73j95w",
          "author": "Lola_Jay_Yum",
          "text": "I graduated from journey to mediavine in December. The RPMs didn’t get negatively impacted. Didn’t even feel like there was an adjustment period. \n\nEarnings haven’t been great in January / February but that’s normal for this time of year. Apart from better earnings, you get direct support and a lot more control over ads etc. overall a better experience.",
          "score": 1,
          "created_utc": "2026-02-24 07:17:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7szrfy",
          "author": "ateeqzain",
          "text": "Inbox",
          "score": 1,
          "created_utc": "2026-02-28 01:25:12",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rgbse6",
      "title": "New to blogging, input or advice appreciated",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1rgbse6/new_to_blogging_input_or_advice_appreciated/",
      "author": "kiluhh",
      "created_utc": "2026-02-27 16:44:33",
      "score": 11,
      "num_comments": 29,
      "upvote_ratio": 0.93,
      "text": "Trying blogging out literally to do it as a potential source of income. Here’s what I’ve done so far, looking for any tips or words of encouragement from anyone with some experience.\n\n1. Picked a niche, I love cooking so it’s a niche within cooking.\n2. Hosting and domain created.\n3. Simple site created\n4. Content is focused on niche, seo, clusters within niche\n5. Working on internal linking\n6. Google search console site maps submitted and requested indexing\n7. Signed up for affiliates and started to place internal linking (early but trying to set the structure up for the future)\n8. Email capture created to build a list\n\nAnything else I should be thinking about or focusing on?\n\n[https://cookonceeatlater.com](https://cookonceeatlater.com)",
      "is_original_content": false,
      "link_flair_text": "Tips/Info",
      "permalink": "https://reddit.com/r/Blogging/comments/1rgbse6/new_to_blogging_input_or_advice_appreciated/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o7qjinf",
          "author": "Local-Dependent-2421",
          "text": "honestly you’re doing more right than most beginners already.\nbiggest thing people miss in early blogging isn’t more posts, it’s search intent. before writing, literally google your keyword and see what google is rewarding — recipe? list? guide? comparison? then match that format exactly or you’ll stay invisible no matter how good the writing is.\nalso start updating old posts early. refreshing + improving posts usually ranks faster than publishing new ones.\nand don’t stress affiliates yet — traffic first, money second. once you hit consistent visitors, monetization suddenly becomes way easier.",
          "score": 5,
          "created_utc": "2026-02-27 17:43:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7qkrgi",
              "author": "kiluhh",
              "text": "That’s good advice, I haven’t really gone into my original posts and done any updates. \n\nA few days ago I added an image to each post to give the readers something to look at instead of just words. \n\nLet’s say you’re doing things right, how long do you think before seeing visitors? \n\nAt the moment I haven’t created any social media, strictly working on blog content and I have 0 so far haha other than my own clicks.",
              "score": 1,
              "created_utc": "2026-02-27 17:49:37",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7qdn69",
          "author": "Strong_Teaching8548",
          "text": "I think, you're thinking about this the right way. most people skip the foundational stuff you've already done and wonder why nothing happens. the seo structure and internal linking early is smart\n\none thing i'd push on though: don't get too caught up in the technical setup if you're not consistently publishing. google loves fresh, relevant content way more than perfect internal linking. what's your publishing cadence looking like? that matters way more than optimizing clusters before you have enough content to rank for anything.",
          "score": 3,
          "created_utc": "2026-02-27 17:15:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7qenyh",
              "author": "kiluhh",
              "text": "Thanks for the response. \n\nSo I have 20 articles written now and 10 published \nI’ve been publishing 2 articles a week consistently since I started the site about a month ago.",
              "score": 1,
              "created_utc": "2026-02-27 17:20:21",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7qir63",
                  "author": "Used-Temperature-699",
                  "text": "You should write 2 articles per day if you are handling new domain. Also do make your accounts on big free platforms like reddit and others.\n\nIt's an important thing as it will build authority as different platforms provide google an evidence your website is legit and providing valuable info.\n\nNow a days paid promotion has steal organic traffic more than any other thing, so, if you can afford do focus on paid traffic to increase traffic on your blog.",
                  "score": 0,
                  "created_utc": "2026-02-27 17:40:00",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7rfbff",
          "author": "WackyTravel",
          "text": "There's lots of good advice in here! Something I'd add in general is to keep up consistency that's realistic for you. I saw someone suggest two articles a day, which is nice, but if you're doing this alongside a full-time job, you may not always have that time. The cadence you currently have seems good. If you can up it, that's nice, but trying to push too hard for a self-imposed quota is a quick way to burnout.",
          "score": 4,
          "created_utc": "2026-02-27 20:17:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7rmfjn",
              "author": "kiluhh",
              "text": "I do work full time and I’ve been managing an article a day almost but try to post two a week \n\nI think writing one a day is ambitious right now and I could see myself doing 4-5 a week. \n\nIs posting two a week enough?",
              "score": 1,
              "created_utc": "2026-02-27 20:53:06",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7qql69",
          "author": "YoBro_2626",
          "text": "You’re honestly on the right track. Most people skip half of this. Now focus on consistency and distribution: publish regularly, but also push content via Pinterest/Reddit/short-form to get early traffic (SEO takes time). Track what’s working using Google Analytics and refine based on real data, not guesses. For tools, Ahrefs or SEMrush for keywords, Runable for visuals or canvases, and Google Search Console are enough. Biggest tip: don’t just write recipes but add unique angles (tips, mistakes, comparisons). That’s what actually ranks and converts. All the best!!!",
          "score": 2,
          "created_utc": "2026-02-27 18:16:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7qrjo5",
              "author": "kiluhh",
              "text": "Awesome advice! \n\nI haven’t gone into anything related to Pinterest/reddit/short-form but a few have mentioned it now so I’m going to try and do that to get a little early push. \nTracking is a good call once traffic comes. I don’t have tools so I’m looking into it today\n\nThank you!",
              "score": 1,
              "created_utc": "2026-02-27 18:21:29",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7r1je9",
          "author": "HappyLiberatedSoul",
          "text": "You have already covered most of the things required. Try to promote your content on platforms like quora(make sure you add value and don't get banned), reddit, medium and forums that allows link sharing. Don't ignore pinterest as its gold for your niche. Try to monetize as early as possible.  \n  \nCurious to know in the world of Instagram and Youtube why you choose to go with Blog in 2026?",
          "score": 2,
          "created_utc": "2026-02-27 19:08:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7r9224",
              "author": "kiluhh",
              "text": "Promoting is what I need to work on as I’m building this base, gotta figure out a path that works. \n\nTo answer your question. I think that YouTube and instagram are platforms that you don’t own, you literally borrow and use them. My website and the list I can create will be mine, from there I can use platforms like YouTube and instagram as tools to build. I think it’s also more practical as a foundation because you can get more out there quicker blog posts vs a YouTube video. They are still a part of the plan, just not yet.",
              "score": 2,
              "created_utc": "2026-02-27 19:45:46",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7rccce",
                  "author": "HappyLiberatedSoul",
                  "text": "Its fine as long as you are not camera shy or something because as per successful blogging gurus like Pat Flynn etc nowadays it is pretty much necessary to be active on platforms like YT/IG/FB to be successful blogger. ",
                  "score": 2,
                  "created_utc": "2026-02-27 20:02:04",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7r9iwd",
          "author": "Creative-External000",
          "text": "You’re actually ahead of 90% of beginners you didn’t just “start posting,” you built a foundation. The only thing I’d add is this: focus less on volume and more on depth + differentiation. In cooking, you’re competing with massive authority sites, so your edge has to be specificity (e.g., ultra-targeted sub-niche, unique angle, personal experiments, cultural twist, dietary constraint, etc.). \n\nAlso, start thinking about intent are you writing recipes people casually browse, or problems they urgently Google? The second one monetizes faster. Double down on building topical authority before worrying about affiliates too much. And most importantly, commit to 6–12 months of consistency before judging results.\n\nBlogging compounds slowly… then suddenly. Stay in the game long enough to see the curve.",
          "score": 2,
          "created_utc": "2026-02-27 19:48:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7rb5xf",
              "author": "kiluhh",
              "text": "Thank you for the advice! \n\nMy niche in cooking is designing a system that solves a problem without getting specific. So my posts are tight around that and I look into seo for my topics in that niche to answer common searched problems. I hope to expand down the road into more recipe technique type of content but it’s tight and not about that right now. \n\nThe 6-12 months is great advice. I keep on wanting to see results now but I gotta just keep writing and like you said focus on depth and hope this curve everyone keeps mentioning is real. \n\nThanks again!",
              "score": 1,
              "created_utc": "2026-02-27 19:56:11",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7s3j84",
          "author": "notactuallyashley",
          "text": "Before I give any advice, what kind of content are you making? Is it original content based on what you're actually cooking etc, or are you using AI to produce the posts and pictures?",
          "score": 2,
          "created_utc": "2026-02-27 22:19:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7sbzzc",
              "author": "kiluhh",
              "text": "Content is mine, I haven’t taken any photos, they’re generated by ai just to have a photo for the article. They’re not even of food, the photos are I guess like black and white placeholder photos. \n\nI love to cook but cooking is too general or large I think. So my niche if about individual freezer meals and a system I build around it. I used to buy meals for 15$ a pop and realized it was cheaper to make them. It’s about what works and how to do it based off of my experience. I get to apply systems techniques and maybe recipes down the road.\n\n*I added the link so you can see what you think*",
              "score": 1,
              "created_utc": "2026-02-27 23:05:15",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7ue8jt",
                  "author": "bbqbouke",
                  "text": "I think you are on to something here with the freezing of meals. Seems like a good niche, not too specific that there isn't much to write about. But still narrow enough to become established in a reasonable amount of time. The foundation is good, but you will have to make it more visually attractive. Start by looking at Instagrammers and Pinterest in the same niche and getting a feel for what successful visuals look like, then try to implement that into your blog. ",
                  "score": 1,
                  "created_utc": "2026-02-28 07:28:17",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7tlffa",
          "author": "imeshad",
          "text": "The hardest part is the beginning—writing when traffic is low. But every post you publish is an asset that can keep bringing in readers for years. Many successful bloggers say their first 6–12 months felt slow, but once Google starts ranking your content and your email list grows, things compound quickly. You’ve already set up the systems most people only figure out later, so you’re ahead of the curve.",
          "score": 2,
          "created_utc": "2026-02-28 03:41:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7ttfcp",
              "author": "kiluhh",
              "text": "Thank you, I’m going to try to really remember that. \n\nI just created a Pinterest account and my first pin for an article, so hopefully that helps if I’m consistent with it.",
              "score": 2,
              "created_utc": "2026-02-28 04:37:46",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1rckq4c",
      "title": "looking for guidance on my blogging journey.",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1rckq4c/looking_for_guidance_on_my_blogging_journey/",
      "author": "Top_String05",
      "created_utc": "2026-02-23 15:38:30",
      "score": 8,
      "num_comments": 12,
      "upvote_ratio": 0.83,
      "text": "My website is about five months old, and I’ve been consistently working on it for the past month, publishing a new blog every two days without using any promotional strategies.\nBased on the current metrics below, I’d like to understand whether this progress is satisfactory or if I should put in additional effort:\nTotal Clicks: 13\nImpressions: 4,180\nI would appreciate any suggestions for improvement.",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/Blogging/comments/1rckq4c/looking_for_guidance_on_my_blogging_journey/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o6z2tmr",
          "author": "dirtysamsquamptsh",
          "text": "Just let it grow organically. I used to blast my blog posts out on reddit to get a following. I write 3 different blogs and all three have much different traffic. One blog has zero traffic. I just keep plugging along. \n\nI don't get a whole lot of traffic, but I have dedicated readers. Once in a while, I'll ask the readers to share it. It works for me, but then, I am also not seeking a million readers either nor am I trying to make any money right now. The money part can come later depending on how popular my blog gets, then I decide if I will monetize it. \n\nPatience is key.",
          "score": 1,
          "created_utc": "2026-02-23 16:23:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o73usn5",
              "author": "Top_String05",
              "text": "Thanks for the guidance, I appreciate it",
              "score": 1,
              "created_utc": "2026-02-24 09:06:02",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o74kyi7",
                  "author": "dirtysamsquamptsh",
                  "text": "Any time!",
                  "score": 1,
                  "created_utc": "2026-02-24 12:45:40",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6znycj",
          "author": "mabemabe420",
          "text": "Dm me your website, I’m happy to help",
          "score": 1,
          "created_utc": "2026-02-23 18:01:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o72hac1",
          "author": "Reasonable_Lab136",
          "text": "13 clicks and 4,180 impressions in the first month of consistent posting on a 5-month-old site is actually not bad at all. Google is clearly starting to notice you.\nA few things that helped me scale my blogs faster:\n1. Focus on long-tail keywords. With a new site, you won’t rank for competitive terms. Target specific, low-competition queries — they add up fast.\n2. Nail your on-page SEO. Make sure every post has a proper meta title, description, FAQ schema, and optimized images. This alone can double your CTR from impressions.\n3. Increase publishing frequency if you can. Every two days is good, but if you can batch-create content and publish daily, the compounding effect kicks in much sooner. I use an AI content tool I built to queue up 10-20 articles at once, which saves me hours.\n4. Don’t ignore Pinterest. For certain niches it can drive more traffic than Google in the early months.\nThe first 6-12 months are the hardest. Your impressions are growing — that means Google is testing your content. Keep going, the clicks will follow.",
          "score": 1,
          "created_utc": "2026-02-24 02:42:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o73ur15",
              "author": "Top_String05",
              "text": "That's for your detailed guidance. I appreciate it. 🙂",
              "score": 2,
              "created_utc": "2026-02-24 09:05:35",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o73uhad",
          "author": "QuiteEarner",
          "text": "My blog is also in the early stage, so I’ve been watching these numbers closely. From what I’ve learned, 4,000+ impressions means Google is at least testing your content, which seems like a good sign. My CTR has been low too. How many total posts do you have published right now? I’m trying to understand how post count affects clicks in the first 6 months.",
          "score": 1,
          "created_utc": "2026-02-24 09:02:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o73uple",
              "author": "Top_String05",
              "text": "It's 25 posts now",
              "score": 1,
              "created_utc": "2026-02-24 09:05:11",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o76d6d2",
          "author": "Vinaya_Ghimire",
          "text": "I think you are doing good. When I started self hosted blog, 11 years ago it took me almost a year to reach 3k monthly impressions. Just focus on publishing unique and original content and keep the consistent posting schedule.",
          "score": 1,
          "created_utc": "2026-02-24 18:00:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o79jvzy",
              "author": "Top_String05",
              "text": "Okay, Can I go for ad sense now, or what would be the best time to apply for the adsense if you can throw some light on it.\n\nAnd another suggestion, for a growth I appreciate it",
              "score": 1,
              "created_utc": "2026-02-25 03:40:02",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1rdgwy9",
      "title": "I keep getting denied by AdSense. Any tips?",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1rdgwy9/i_keep_getting_denied_by_adsense_any_tips/",
      "author": "StuckInOtherDimensio",
      "created_utc": "2026-02-24 13:57:29",
      "score": 8,
      "num_comments": 14,
      "upvote_ratio": 1.0,
      "text": "Hi,\n\nI keep getting denied by AdSense for **“Low-value content.”**\n\nAt first I checked what people usually miss and realized I didn’t have the basics set up (Contact page, Privacy Policy, Cookie page). I added all of that and re-applied, but I got denied again today.\n\nMy blog is **very new** and I basically get **no traffic yet** could that be part of the reason? I wanted to set up AdSense early and then just let it run while I keep posting.\n\nWhat I’ve done so far:\n\n* I usually place **1–2 ads max** on long game reviews (my reviews are usually **2000–2500 words**)\n* I try to put **no ads** on short “news” posts\n* I added **noindex,follow** to “thin” pages like **tags** and **author pages**\n* I also noindexed some very short news posts (100–250 words)\n\nMy site is minimalist (not super fancy). It’s also **in French** (not sure if that matters).\n\nDo you see any common reasons why I’d still be getting refused? Anything I might be missing?\n\nAlso: **how long did it take you to start getting traffic**, and what actually helped you the most (besides SEO)? Any strategies that worked well for you beside (shorts/reels, communities, etc.)?\n\nThanks a lot!",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/Blogging/comments/1rdgwy9/i_keep_getting_denied_by_adsense_any_tips/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o766hww",
          "author": "IronMotive",
          "text": "if your blog is very new, that is almost certainly the reason you’d be getting rejected for AdSense. You need a history of publishing regular, high quality content and that only comes with time. My guess is that 6-12 months of history would be the bare minimum.  And they’re probably also looking for some high quality backlinks or some kind of reputable external validation that your content is original and high quality.\n\nI wouldn’t sweat it too much, though - if your blog is only getting minimal traffic in this early stage, you’d be earning practically nothing from AdSense. Focus on building an audience first before worrying about monetization.",
          "score": 3,
          "created_utc": "2026-02-24 17:30:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7709dm",
              "author": "StuckInOtherDimensio",
              "text": "Thank you :) That makes sense! I was hoping to get approved just to get it out of my mind, but I guess I’ll forget AdSense for now and add it once I start getting traffic.",
              "score": 2,
              "created_utc": "2026-02-24 19:44:19",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7bugux",
          "author": "philip_vibrant",
          "text": "Low-value content in AdSense **doesn’t automatically mean your articles are bad**, and from what you described (2k–2.5k word reviews, controlling ad density, noindexing thin pages) you’re already doing more than most people on their first application.\n\nWhat many of us learn the hard way is that “low value” is often triggered by **site-level signals**, not the writing itself.\n\nThings like:\n\n* technical/HTML issues that affect how Google renders the page\n* weak internal linking / crawl flow\n* missing or poorly connected trust pages (even if they exist)\n* duplicate meta data or titles\n* mobile UX problems\n* very new domain with inconsistent structure\n* template pages getting indexed somewhere\n* slow performance / layout shifts\n\nTo a human reviewer your site can look clean and the content can be genuinely good, but to their system it still sends “not ready for ads” signals.\n\nBefore you reapply again, I’d strongly recommend running a full audit so you’re not guessing.  \nYou can paste your domain into [**https://adsenseaudit.net/**](https://adsenseaudit.net/) — it scans the site and shows the exact approval-risk issues and what to fix step-by-step. Then you apply again once the checklist is clean instead of burning another review.\n\nOn the traffic question: no, AdSense doesn’t have an official minimum. Plenty of people get approved with low traffic. What *does* matter is that the site looks complete, trustworthy, and technically solid.\n\nFor growth (especially for a new French blog), what moved the needle for me wasn’t ads or even pure SEO at the start — it was:\n\n* picking topics with existing search demand\n* internal linking between related posts\n* posting consistently for a few months\n* sharing in niche communities where the audience already cares\n\nYou’re actually on the right track — this is the phase where most people get stuck because the rejection message is so vague.",
          "score": 2,
          "created_utc": "2026-02-25 14:13:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7c0qp8",
              "author": "StuckInOtherDimensio",
              "text": "Thank you, u/philip_vibrant  ! \n\nI do need to work on a few things like internal linking, and I probably have some HTML issues because I embedded some code to make a rating system. I’ll try the website you mentioned and see how it goes.\n\nFor now, I’m focusing on content, but part of me is triggered that I got refused lol. I’ll also look into it using the information you provided.",
              "score": 1,
              "created_utc": "2026-02-25 14:45:33",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7ces0g",
          "author": "Strong_Teaching8548",
          "text": "Low traffic is definitely part of it, but ngl the bigger issue is probably that google literally can't evaluate your content quality yet. they need enough indexed pages and actual organic impressions to make a decision. you're in that catch-22 where you need traffic to prove you're not low-value, but you need approval to monetize while building traffic\n\nkeep posting consistently for like 3-6 months, get some organic visitors coming in naturally, then reapply. the french angle shouldn't matter at all. your setup sounds solid otherwise :)",
          "score": 2,
          "created_utc": "2026-02-25 15:52:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7glcby",
              "author": "StuckInOtherDimensio",
              "text": "Thank you :) \n\nDoes it really come naturally (organic) I also promote my website on my short/reel but wondering if seo is still a thing in 2026.",
              "score": 1,
              "created_utc": "2026-02-26 04:37:09",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7p17gk",
                  "author": "Strong_Teaching8548",
                  "text": "Seo is 100% still a thing, but it's slower than social. Google needs to see that people are actually searching for your content and clicking through naturally. shorts/reels drive traffic, sure, but it's usually direct or referral traffic, not organic search traffic. google weighs those differently when evaluating your site. so yeah, keep promoting on social, but also make sure you're optimizing for search intent in your game reviews. that's what'll get you the organic impressions google needs to approve you :)",
                  "score": 2,
                  "created_utc": "2026-02-27 13:10:42",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7e1w8h",
          "author": "beingoptimistlab",
          "text": "You can get approved with almost no traffic if the structure is solid.\n\nCommon triggers:\n\n* Site too new\n* Review-style content without differentiation\n* Weak E-E-A-T signals\n* Homepage looking thin\n* Too many similar-intent posts\n\nLength alone (2,000+ words) doesn’t guarantee approval.\n\nI’d wait until you have 20–30 strong posts and clearer positioning, then reapply.",
          "score": 2,
          "created_utc": "2026-02-25 20:22:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7gleot",
              "author": "StuckInOtherDimensio",
              "text": "Thank you !",
              "score": 1,
              "created_utc": "2026-02-26 04:37:36",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7pttyc",
                  "author": "beingoptimistlab",
                  "text": "You are welcome. Feel free to ask any question. Let me tell you, I got AdSense approval after 2 failed attempts.",
                  "score": 1,
                  "created_utc": "2026-02-27 15:42:00",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7hxszt",
          "author": "onlinehomeincomeblog",
          "text": "Low value content doesn't mean about the number of words in an article. There are several other reasons, such as a new site, Low Traffic, and content differentiation being too limited, among others.\n\nAdSense observes the whole site's content depth, consistency, topical focus, and trust signals. Even though you write 2000+ words per blog doesn't mean that Google values your efforts.\n\nYou wrote a 2000+ word review blog, but what about the uniqueness? Today, the game reviews are competitive, and most articles out there are rephrased versions of what's already out there. Read your blog and rewrite with unique insights (that is not available anywhere), screenshots, comparisons, or opinions.\n\nIn the first few months, your site will see a sharp inclination in the impressions, but noticeable organic traffic will take some time. \n\nRight now, focus on being useful enough that Google trusts you. Build authority on all channels and let traffic come in first.\n\nIf the foundation is strong, monetization becomes much easier.",
          "score": 2,
          "created_utc": "2026-02-26 11:37:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7a7q7j",
          "author": "Vinaya_Ghimire",
          "text": "Do you already have ads on your website? If you have ads on your website, Adsense might reject you. Turn off your other ads and the apply for Adsense. Once you are approved you can use other ad networks.",
          "score": 1,
          "created_utc": "2026-02-25 06:30:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7bfaf2",
              "author": "StuckInOtherDimensio",
              "text": "Oh no Adsense was the only one.",
              "score": 1,
              "created_utc": "2026-02-25 12:45:37",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1rejt70",
      "title": "How do you handle authorship on independent blogs/media (especially if you run multiple sites)?",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1rejt70/how_do_you_handle_authorship_on_independent/",
      "author": "Camino_Financiero",
      "created_utc": "2026-02-25 17:32:49",
      "score": 7,
      "num_comments": 13,
      "upvote_ratio": 0.89,
      "text": "Hi everyone.\n\nI’m building my projects and I got stuck on something that looks simple but really isn’t: authorship.  \nI’m not looking for a “perfect rule,” I’m more interested in what people actually do in real life.\n\nIf you run an independent blog or small media site… how do you publish?\n\nDo you write under your own name as the founder, with your own voice?  \nDo you hire writers and each person signs their own pieces?  \nOr do you use institutional authorship like “Editorial Team / Staff” so the brand carries more weight than a person?\n\nMy situation gets trickier because I’m considering running 3 to 5 different sites on different topics.  \nAnd that’s where the bigger question shows up.\n\nIf I write on all of them, the same author name would appear across multiple projects.  \nIn your experience, did that help (consistency, transparency)… or hurt (mixed signals, “feels like a network”)?\n\nAnd if you went with “Editorial Team” or something institutional to separate brands, did it work better for you?  \nOr did it make trust/authority harder to build because there’s no clear person behind it?\n\nI’m not expecting a universal “Google prefers X” answer (I know it’s never that clean).  \nBut I’d really appreciate concrete experiences: what you chose, what worked, what you changed later, and what you’d avoid if you were starting again.\n\nThanks in advance — I’m trying to make a decision now that won’t blow up in six months.",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/Blogging/comments/1rejt70/how_do_you_handle_authorship_on_independent/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o7f7rqu",
          "author": "OrganicClicks",
          "text": "Where I'd think carefully is topical distance between your sites. If you're writing about personal finance and also about hiking gear and home repairs under the same name, the crossed signals can feel odd to readers even if Google doesn't penalize it directly. Closer niches will make the multi-site authorship feel natural.\n\nA middle path worth considering is using your real name as founder/editor across all properties but bring in contributors with their own bylines for individual pieces. That way the brand has a human anchor but doesn't depend entirely on you for volume.",
          "score": 5,
          "created_utc": "2026-02-25 23:48:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7hiy2u",
          "author": "Soft_Dimension1782",
          "text": "If you’re the one writing, use your name. People trust a real person more than “Editorial Team,” especially in the beginning. A name and short bio build credibility. Using the same name across multiple sites is fine as long as the content is genuine. It can actually show consistency. You can always switch to a team setup later. In the beginning, transparency is better than hiding behind a brand.",
          "score": 3,
          "created_utc": "2026-02-26 09:22:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7dh4ql",
          "author": "Holiday-Oil2598",
          "text": "Google doesn’t give a damn. Do whatever you want/makes sense to you",
          "score": 2,
          "created_utc": "2026-02-25 18:46:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7egb4i",
          "author": "Emotional-Tear-6680",
          "text": "Either write as a person and have your name on it, or write as an institution and leave your name out. Important is not to mix the two: building an institution and then showing just one author name looks really bad.",
          "score": 2,
          "created_utc": "2026-02-25 21:29:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7eibsq",
          "author": "West-Worldliness-509",
          "text": "I am on the same boat!\n\n\nI use pen names. No problem.",
          "score": 2,
          "created_utc": "2026-02-25 21:38:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7eiy4k",
              "author": "Camino_Financiero",
              "text": "I don't plan to go against what you're doing, but is that the same person posting under different identities? If Google finds out, that could be a serious penalty, right? What if your site reaches a high level of importance? I'm just trying to reflect, not question.",
              "score": 1,
              "created_utc": "2026-02-25 21:41:49",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7ejps0",
                  "author": "West-Worldliness-509",
                  "text": "Google doesn’t care about your actual identity. \n\nIf you have Adsense they check your real ID, they are obliged by AML legislation.\n\nBut the name that one chooses to sign their work can be whatever. It has been so in literature since ever! Same in Kdp.",
                  "score": 2,
                  "created_utc": "2026-02-25 21:45:20",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7exmof",
          "author": "xylo_dan",
          "text": "I either post as myself or if it's more AI generated corporate speak I post as the business.",
          "score": 2,
          "created_utc": "2026-02-25 22:53:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7hpism",
          "author": "Creative-External000",
          "text": "**What actually works in the real world:** most successful indie operators use a **hybrid model**, not one extreme. Early on, publishing under your real founder name usually builds trust faster (especially in SaaS, marketing, or niche expertise). It gives you E-E-A-T signals, makes outreach easier, and AI/search systems can connect authority across sites. Having the same author across multiple sites generally **helps more than it hurts** unless the sites are spammy or unrelated.\n\n**Where people get into trouble:** hiding behind “Editorial Team” too early. Pure institutional authorship often feels generic and slows trust unless the brand is already strong. It works better later, not at the start.\n\n**A practical structure that scales well:**\n\n* Founder name for flagship/thought leadership pieces\n* Named contributors for specialized content\n* “Editorial Team” only for news updates, roundups, or utility posts\n* Clear author bios on every site (very important)",
          "score": 2,
          "created_utc": "2026-02-26 10:24:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7i4999",
          "author": "websitespeedy",
          "text": "I’ve experimented with both personal and institutional authorship.\n\nUsing a real name usually builds trust faster, especially early on. People connect more easily to a person than a logo, and it helps keep the tone consistent while the site is finding its identity.\n\nIf you’re running multiple sites in different niches, institutional authorship can keep the brands separate. The downside is you have to work harder to build credibility without a clear face behind it.\n\nIn the end, it’s less about what Google prefers and more about what fits the long-term vision of each site.  \n",
          "score": 2,
          "created_utc": "2026-02-26 12:25:40",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rc2tk4",
      "title": "is there a way to automate pin creation without spending hours in Canva every week",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1rc2tk4/is_there_a_way_to_automate_pin_creation_without/",
      "author": "Justin_3486",
      "created_utc": "2026-02-23 00:36:35",
      "score": 7,
      "num_comments": 16,
      "upvote_ratio": 0.9,
      "text": "food blog getting decent traffic but I'm spending 8-10 hours weekly just making pins in Canva and it's completely unsustainable I have like 200+ blog posts and need to create fresh pins for them regularly but designing each one individually is killing me tried some AI pin generators but they all look terrible, super generic and obviously AI-generated. need something that actually looks professional is there any tool that can automate pinterest pin design without making them look like garbage? or am I stuck doing this manually forever",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/Blogging/comments/1rc2tk4/is_there_a_way_to_automate_pin_creation_without/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o6vkzn3",
          "author": "ActuaryMean6433",
          "text": "Short of paying someone else to do it for you, I don’t think there really is, but I’m also not the most tech hip.  Can you try to find a way to streamline the process like templates?  Is Canva itself slowing you down?  Unfortunately, ultimately, it’s just the nature of the beast, really.",
          "score": 2,
          "created_utc": "2026-02-23 01:27:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6w9ox9",
          "author": "jarvandamere",
          "text": "Just create 3 different pins for each article and reuse them. With so many articles there will be a very long gap between pinning the same pin.",
          "score": 2,
          "created_utc": "2026-02-23 04:02:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6x9hyb",
          "author": "QuiteEarner",
          "text": "I ran into the same problem after realizing how many pins you actually need per blog post. What helped me was creating a few reusable Canva templates and just swapping the headline and image instead of designing from scratch every time. It still takes effort, but it’s much faster than starting from zero.\n\nFrom what I’ve seen, fresh pin variations matter more than perfect design, so template-based pins seem to work fine if the headline is strong.",
          "score": 2,
          "created_utc": "2026-02-23 09:08:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6xbvr2",
          "author": "ssunflow3rr",
          "text": "tailwind just released premium smartpin templates that actually look professional not like ai slop. can use your real photos and it creates designs automatically with your keywords included. been using it and went from 10 hours weekly in canva to maybe 1 hour reviewing pins",
          "score": 1,
          "created_utc": "2026-02-23 09:32:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6xc7zx",
          "author": "billarr",
          "text": "u/Justin_3486 do you follow a specific template for the designs that may help you streamline this a bit? How about posting on social media do you do it manually or you got that figured out? I'm the founder of Nuelink, a social media scheduling platform that can help with the scheduling part, either by sending the images directly from Canva to Nuelink or using our bulk upload features to upload 100 of posts at once. We have a built in automation that auto post from different blogs to social media; but uses the featured image mainly, not sure if this would help in your case? ",
          "score": 1,
          "created_utc": "2026-02-23 09:35:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6xw1ec",
          "author": "OverFlow10",
          "text": "I'm following the method (and use the product fyi) mentioned in this video: [https://youtu.be/RxMgboDOog0?si=QC7x7womKxb3nnRe](https://youtu.be/RxMgboDOog0?si=QC7x7womKxb3nnRe)\n\ngetting 50k monthly page views through pinterest that way ",
          "score": 1,
          "created_utc": "2026-02-23 12:30:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6yxeku",
          "author": "RobertLigthart",
          "text": "8-10 hours is way too much even with 200+ posts. the canva template approach others mentioned is the move but the real time saver is batching... set up 5-6 templates, then do all your pins for the week in one sitting instead of switching between writing and designing throughout the week\n\n  \nfor a food blog specifically your actual food photos are the asset. a simple template with a strong headline overlay on your own photo will outperform any fancy design. pinterest rewards fresh pins but they dont need to be complicated",
          "score": 1,
          "created_utc": "2026-02-23 15:58:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o72h7bm",
          "author": "scrtweeb",
          "text": "canva has templates which helps a bit but yeah still takes forever to customize each one",
          "score": 1,
          "created_utc": "2026-02-24 02:42:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o72jwzx",
              "author": "Justin_3486",
              "text": "even with templates im spending like 5-10 minutes per pin, adds up fast when you need dozens weekly",
              "score": 1,
              "created_utc": "2026-02-24 02:58:04",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o72ztft",
          "author": "ScrollWalker",
          "text": "Does your Blog post use original images or AI?",
          "score": 1,
          "created_utc": "2026-02-24 04:41:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o73dot8",
          "author": "Responsible-Alps152",
          "text": "I have made 50 premium Pinterest templates. Edit text, add images that's it. You can make 10 Pinterest pins within 5-10mins. I made this for my online store but don't use now. If anyone want these templates, just text here I will send it to you and it's free. If mods allows me, I can share direct download link here.",
          "score": 1,
          "created_utc": "2026-02-24 06:28:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o78hb5i",
          "author": "Sharp-Skill9304",
          "text": "Also canva bulk upload can be helpful once you’ve got some solid template that can be reused with minor adjustments",
          "score": 1,
          "created_utc": "2026-02-25 00:03:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7b1vfx",
          "author": "ehben83",
          "text": "What did you build ?",
          "score": 1,
          "created_utc": "2026-02-25 11:04:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ydpdd",
          "author": "Lisapatb",
          "text": "I use Pin Generator, a great tool to make pins right from your blog or website. You can create dozens in minutes. You can also edit and schedule them.\n\nI wrote about it here if you are interested: [https://inspiretothrive.com/pin-generator/](https://inspiretothrive.com/pin-generator/)",
          "score": -1,
          "created_utc": "2026-02-23 14:18:55",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rh5ml5",
      "title": "The Website Lie That No One Tells Briefly, Don't Buy Expensive Courses Without Knowing This",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1rh5ml5/the_website_lie_that_no_one_tells_briefly_dont/",
      "author": "Used-Temperature-699",
      "created_utc": "2026-02-28 15:35:59",
      "score": 7,
      "num_comments": 5,
      "upvote_ratio": 0.7,
      "text": "I've learned blogging and began to work on my own website in 2024. That year was the year when chatgpt was taking over the content faster than any thing else. \n\nI researched a niche that was kids related and keywords were long tail. \n\nI did everything that's crucial to make my blog successful.\n\nPaid link building wasn't in my hand as I could not afford that.   \nI purchased a course related to blogging, but blogging was considered dead at that time.\n\nThat was also right as experts were experiencing the traffic loss on their websites.\n\nMy main point is that whenever, someone tell you that this niche is stable, that niche is stable, don't trust someone as you know someone.\n\nGo deep in understanding all parts like how to put all things correctly to make your blog successful.\n\nAll things feel easy but you learned herd way one thing and next problem would welcome you after solving first one.\n\nIf you are jobless or you need instant money blogging isn't for you.\n\nI made my website good, expressions were good, also clicks were coming, but real success was normal.\n\nOnly choose blogging if you can spend money on domain, hosting, links, content writers ( saved money as I was writing content myself ).\n\nAlso if you'll stuck in anything, You've to pay seniors to solve your problem.",
      "is_original_content": false,
      "link_flair_text": "Tips/Info",
      "permalink": "https://reddit.com/r/Blogging/comments/1rh5ml5/the_website_lie_that_no_one_tells_briefly_dont/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o7wvn85",
          "author": "beingoptimistlab",
          "text": "I think the biggest misunderstanding with blogging is that people treat it like a shortcut instead of a long-term project.\n\nA lot of courses sell the idea that you just pick a niche, write articles, and traffic appears. In reality, it’s closer to building a small digital product or media site.\n\nYou need to think about:\n\n* search intent\n* topical authority\n* distribution\n* updates and maintenance\n* sometimes tools or unique resources\n\nContent alone is rarely enough anymore.\n\nAlso, blogging isn’t really “dead,” but the bar is higher. Ten years ago you could publish generic articles and rank. Now Google is flooded with content, so the sites that win usually offer something extra — expertise, data, tools, or strong niche focus.\n\nThe mistake many beginners make isn’t blogging itself. It’s expecting quick returns.",
          "score": 8,
          "created_utc": "2026-02-28 17:43:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o80kdca",
              "author": "Used-Temperature-699",
              "text": "You are right, but there are certain things that always become a challenge for beginners.\n\nI remember, I wasn't understanding a sitemap issue, I researched dozens of yt videos but nothing solved my problem.\n\nAlso the main topic of this post is to address newbies who lost their money in a work that doesn't provide instant money and they lose hope.\n\nThe factors that keep secret are causing serious issues for newbies, course sellers only need money, they don't think about others.",
              "score": 1,
              "created_utc": "2026-03-01 07:02:27",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o828kzi",
          "author": "QuiteEarner",
          "text": "I agree that blogging isn’t “easy money,” but I think a lot of people fail because they focus on shortcuts instead of fundamentals. Long-term traffic usually comes from low-competition keywords, strong internal linking, and topical depth — not expensive courses or paid links. It’s slower, but it’s more controllable. Blogging isn’t dead, but unrealistic expectations definitely are.",
          "score": 1,
          "created_utc": "2026-03-01 15:05:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o82n00d",
              "author": "Used-Temperature-699",
              "text": "Definitely, the person who understands blogging, understands that it's a long term goal.\n\nI wanted to acknowledge newbies that got trapped in a headline, \"Just find one niche and earn in dollars\"\n\nThey stuck with dozens of issues on their website and finally quit.",
              "score": 1,
              "created_utc": "2026-03-01 16:16:49",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1rfwz4b",
      "title": "I used to make blogs in 2015. does this still work this 2026?",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1rfwz4b/i_used_to_make_blogs_in_2015_does_this_still_work/",
      "author": "10010101010101000",
      "created_utc": "2026-02-27 04:34:09",
      "score": 5,
      "num_comments": 11,
      "upvote_ratio": 0.73,
      "text": "I used bloggercom and still have my site running it has adsense but not really earning well. i just want revive my site and check if this will still work. any idea?",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/Blogging/comments/1rfwz4b/i_used_to_make_blogs_in_2015_does_this_still_work/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o7o43y1",
          "author": "BrewtifulMess111",
          "text": "Yes, blogging still works in 2026 but 2015-style blogging doesn’t.\n\nBack then you could post 800 to 1000 words, add keywords, and rank. Now the internet is flooded with AI content, competition is brutal, and traffic is spread across Google, YouTube, Reddit, social media, and AI tools.\n\nIf you're only relying on Blogger + AdSense, it’s very hard unless you have high traffic or a high-CPC niche.\n\nWhat works now:\n\n* Pick one focused niche\n* Build topical authority (not random posts)\n* Add better monetization (affiliate, digital products, email list)\n* Distribute content on social, not just SEO\n\nIf you treat blogging like a business asset, it can still work. If you expect passive AdSense money like 2015, it’s tough.",
          "score": 8,
          "created_utc": "2026-02-27 08:36:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7okqy9",
              "author": "Sad-Matter2770",
              "text": "I agree. \n\nI'd also add that OP should move away from Blogger(.com) if they want to drive traffic from search engines and earn from AdSense. But if OP will be driving traffic from external social platforms, then they can stick to Blogger.\n\nOtherwise, I recommend investing in self-hosting WordPress and doing keyword research (+ optimising articles around the keyword) if they want to get some visibility in search and LLMs.",
              "score": 2,
              "created_utc": "2026-02-27 11:11:10",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7ql3r8",
                  "author": "10010101010101000",
                  "text": "i sure would love to, just scared of risks. :)",
                  "score": 1,
                  "created_utc": "2026-02-27 17:51:14",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7oi1qf",
          "author": "Creative-External000",
          "text": "Yes blogging still works in 2026, but **not the 2015 way**. What died is thin, keyword-stuffed AdSense blogging; what works now is **helpful, experience-driven content with distribution**. If your site isn’t earning, it’s usually a traffic quality and positioning problem, not that blogging is dead. Focus on a tight niche, publish fewer but deeper posts, and optimize for both Google and AI discovery (clear answers, structured content, strong topical authority). \n\nAdd email capture and consider monetization beyond AdSense (affiliates, digital products, services). Refresh old posts don’t just add new ones and improve internal linking. Use tools like Runable, Google Search Console, and analytics to see what actually drives clicks. Blogging still compounds but now it rewards **authority + consistency + distribution**, not volume.",
          "score": 4,
          "created_utc": "2026-02-27 10:47:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7orm91",
              "author": "vaibh990",
              "text": "Great advice, thanks. Can you also give an opinion on usage of AI for content creation? How far can it be relied on?",
              "score": 1,
              "created_utc": "2026-02-27 12:05:10",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7pg4xr",
          "author": "Vinaya_Ghimire",
          "text": "Your blog could still work if you start adding more content. Blogging still works but you need to avoid saturated niches, micro niches seem to be doing good",
          "score": 1,
          "created_utc": "2026-02-27 14:34:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7qlcgu",
              "author": "10010101010101000",
              "text": "what is miro niche?",
              "score": 1,
              "created_utc": "2026-02-27 17:52:23",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7pmq8v",
          "author": "Tweetgirl",
          "text": "Yes, blogging still works in 2026 but, it's very different. The way you write, length of your posts, how you promote, how you view Google, traffic diversification, all different. At the end of the day, create great content that's helpful and authentic. Go deep in your niche and promote.",
          "score": 1,
          "created_utc": "2026-02-27 15:07:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7u8am4",
          "author": "cute-bil12",
          "text": "BLogging still works, but if you're relying on manual blogging, then you'll not be able to beat those guys who are using AI tools. Believe it or not, this is the fact.",
          "score": 1,
          "created_utc": "2026-02-28 06:35:39",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1req826",
      "title": "Google is not indexing my site",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1req826/google_is_not_indexing_my_site/",
      "author": "instanthistory68",
      "created_utc": "2026-02-25 21:18:44",
      "score": 3,
      "num_comments": 4,
      "upvote_ratio": 1.0,
      "text": "My site is registered in Google Search Console, I sent the sitemap one month ago and only 3 pages were indexed after few days. But now, no more pages have been indexed. How can I do? Please help",
      "is_original_content": false,
      "link_flair_text": "Tips/Info",
      "permalink": "https://reddit.com/r/Blogging/comments/1req826/google_is_not_indexing_my_site/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o7ey034",
          "author": "bluehost",
          "text": "If robots.txt isn't the culprit, time to dig one layer deeper.  Open the Page Indexing report and click into the Not indexed section. Google usually gives a specific reason for each page. That reason is your clue.\n\nThen take one of the missing URLs and run it through the URL Inspection tool. Request indexing manually. If Google says it can crawl the page but still does not index it, that usually means the issue is content quality or weak internal linking rather than a technical block.\n\nIf the site is new, Google can also take its time. Not exciting, but normal.",
          "score": 2,
          "created_utc": "2026-02-25 22:55:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7efeoj",
          "author": "jim-chess",
          "text": "Hmmm are you blocking Google with your robots.txt?",
          "score": 1,
          "created_utc": "2026-02-25 21:25:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7eg753",
              "author": "instanthistory68",
              "text": "No, I am not blocking Google",
              "score": 1,
              "created_utc": "2026-02-25 21:29:04",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7gyevg",
          "author": "swiftpropel",
          "text": "Oh, I have observed this over and over with new blogs. Check GSC: Page indexing report This report shows any noindex tags, robots.txt blocks or crawl errors that must be fixed first. Remake your sitemap, and check your important pages by URL Inspection to have them indexed manually. Also, add in-house links to such pages. Give it 1-2 weeks; it'll pick up. Patience!",
          "score": 1,
          "created_utc": "2026-02-26 06:14:33",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rfyebw",
      "title": "Very new to the idea of blogging. Need advice",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1rfyebw/very_new_to_the_idea_of_blogging_need_advice/",
      "author": "KittyKidd0",
      "created_utc": "2026-02-27 05:47:33",
      "score": 3,
      "num_comments": 2,
      "upvote_ratio": 1.0,
      "text": "My Dr has recommended that I do blogging as a form of healing. I have a brain injury and it interferes with my comprehension sometimes. I started digging into “ blogging for beginners” I’m already over stimulated with all the information out there. I’m hoping that I can get some advice or suggestions on how to begin. \n\nWhat site is best for free usage? \n\nWhat are helpful tips to know to navigate a site? \n\nHow do you know if traffic is bots or real human contact?\n\nDoes anyone use blogging for medical reasons like my dr suggested that I do? \n\nI’m not looking to make an income, if it happens great, if not it’s no big deal. I have a niche for writing from the heart.. the real deep hurtful parts that people are afraid of. So I’m simply asking for any kind, of help. At 57, and being disabled, tech/social media stuff is not my strong suit. \n\nThank you for any advice given",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/Blogging/comments/1rfyebw/very_new_to_the_idea_of_blogging_need_advice/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o7nm4qr",
          "author": "Strokesite",
          "text": "Check out Medium. Free basic access and $5/mo for the good articles. They have a monetization program if you’re looking to get paid.",
          "score": 2,
          "created_utc": "2026-02-27 05:59:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7ucenc",
              "author": "KittyKidd0",
              "text": "Thank you. Not really looking to get paid.. I just need a safe space for me to write.",
              "score": 1,
              "created_utc": "2026-02-28 07:11:53",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1rgrbfi",
      "title": "What are your favorite writing apps?",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1rgrbfi/what_are_your_favorite_writing_apps/",
      "author": "Embarrassed-Fox4564",
      "created_utc": "2026-02-28 03:01:47",
      "score": 3,
      "num_comments": 0,
      "upvote_ratio": 1.0,
      "text": "I’m always on the lookout for a good writing app. I like iaWriter, Bear, and Ulysses.  ",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/Blogging/comments/1rgrbfi/what_are_your_favorite_writing_apps/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": []
    },
    {
      "id": "1rhv2og",
      "title": "March Questions Thread - Ask your questions here",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1rhv2og/march_questions_thread_ask_your_questions_here/",
      "author": "AutoModerator",
      "created_utc": "2026-03-01 11:30:45",
      "score": 3,
      "num_comments": 3,
      "upvote_ratio": 1.0,
      "text": "Hello bloggers\n\nIf you're a blogger with simple / generic / one-off / specific / personal questions, leave them as a comment here and let the community answer them for you.\n\nDo not create a new individual post if your question falls in any of the above category. Low quality posts & repetitive questions WILL be deleted without any notice.\n\nSome topics or related posts that fall under the purview of this thread\n\n1. Platform (Blogging, hosting, social media, etc.) related questions.\n2. Beginner monetization, niche and technical questions.\n3. Beginner level affiliate marketing, blog advertising, etc.\n4. Blog design / code / tech / SEO help.\n5. Blogging or marketing strategy idea feedback.\n\nWhat kind of questions or posts can one create outside this thread?\n\nYou may create posts with questions which spark discussions and debate or questions for which answers might benefit a majority of the blogging community as well. Polls, case studies, progress posts, unique guides, AMAs, intermediate & expert level posts are allowed as well.\n\n**Before posting a question, please take the time to use Google or Reddit search**. 9 times out of 10, your question has most likely been answered. So, we advise you to spend a little time on research before posting.\n\nThis thread will be a monthly periodical.\n\nIf you've any questions about this thread, message the [moderators](https://www.reddit.com/message/compose?to=%2Fr%2FBlogging).\n\n**P.S: Don't use this thread to request blog feedback or to promote your blog. Such comments will be removed without notice.**",
      "is_original_content": false,
      "link_flair_text": "Meta",
      "permalink": "https://reddit.com/r/Blogging/comments/1rhv2og/march_questions_thread_ask_your_questions_here/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o81cyc2",
          "author": "Captlard",
          "text": "Best guide / way of understanding how people are using Pinterest to send people to their blog?",
          "score": 1,
          "created_utc": "2026-03-01 11:33:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o81djlv",
          "author": "Puzzleheaded-Try737",
          "text": "I recently built a micro-SaaS that generates fake chat screens and social posts for memes and pranks. I want to start a blog to drive organic top-of-funnel traffic, but the product is very visual and entertainment-focused.\n\nWhat kind of blog content actually converts for something like this? Has anyone had success running a blog for a \"fun\" tool? I'm debating between writing listicles (e.g., \"Best Pranks for April Fools\") or focusing on meme template roundups.",
          "score": 1,
          "created_utc": "2026-03-01 11:38:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o81h9xa",
          "author": "vaibh990",
          "text": "How much of AI generated content can be included in the blogs?",
          "score": 1,
          "created_utc": "2026-03-01 12:10:45",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rdpmdr",
      "title": "AI Knowledge Gaps - What is remaining?",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1rdpmdr/ai_knowledge_gaps_what_is_remaining/",
      "author": "FutureEye2100",
      "created_utc": "2026-02-24 19:14:56",
      "score": 1,
      "num_comments": 6,
      "upvote_ratio": 0.57,
      "text": "It’s becoming increasingly clear that content an AI can generate on its own has almost zero market value today. To combat this, I’m focused on anchoring my work in exclusive insights and knowledge that are difficult to find elsewhere.\n\nHowever, I feel the \"exclusivity gap\" shrinking every day. Since AI has already ingested everything from obscure textbooks to video transcripts, there isn't much left that feels truly private or unique. Fresh content offers a slight head start, but that advantage is fleeting.\n\n**What strategies are you using to keep your blog exclusive? More importantly, what sources of knowledge do you believe remain untouched by AI’s crawlers?**",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/Blogging/comments/1rdpmdr/ai_knowledge_gaps_what_is_remaining/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o7mhab1",
          "author": "akowally",
          "text": "Lived experience is still a big advantage. AI can synthesize everything ever written about starting a business, but it can't tell you what it felt like to miss payroll or which specific supplier quietly doubled their lead times last quarter. On exclusivity, there is proprietary data. Your own analytics, customer conversations, internal experiments, and outcomes that never got published anywhere are invisible to AI crawlers. Content around \"here's what actually happened when I tested this\" will always be uniquely yours.",
          "score": 1,
          "created_utc": "2026-02-27 01:37:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7rdeql",
          "author": "Creative-External000",
          "text": "I don’t think the defensible edge is “information” anymore it’s *proximity*. AI has scraped public knowledge, but it hasn’t lived inside your customer calls, your failed experiments, your messy drafts, or your private Slack debates. The gap isn’t obscure facts; it’s lived context. \n\nThe blogs that will stay exclusive are the ones built on original data, proprietary workflows, behind-the-scenes breakdowns, and real-time pattern recognition from active operators. AI can summarize what’s known. It can’t replicate access, timing, or firsthand experience. The moat isn’t secrecy it’s specificity and skin in the game.",
          "score": 1,
          "created_utc": "2026-02-27 20:07:28",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}