{
  "metadata": {
    "last_updated": "2026-02-24 09:09:58",
    "time_filter": "week",
    "subreddit": "Blogging",
    "total_items": 20,
    "total_comments": 187,
    "file_size_bytes": 201780
  },
  "items": [
    {
      "id": "1r7syys",
      "title": "How long did it take you to earn your first income from blogging?",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1r7syys/how_long_did_it_take_you_to_earn_your_first/",
      "author": "kmshift",
      "created_utc": "2026-02-18 04:12:24",
      "score": 46,
      "num_comments": 87,
      "upvote_ratio": 0.96,
      "text": "Hi everyone,\nI’m curious about your experiences.\nHow long did it take from starting your blog to earning your first income?\nI’ve been consistently writing for about two months now. I’m putting a lot of effort into creating quality content, but I’m still waiting for Google AdSense approval. I know blogging takes time, but sometimes I wonder if I’m heading in the right direction.\nFor those who are already monetizing —\nHow long did it take you?\nWhat did you focus on in the early stage?\nDid you just keep publishing and wait, or did you change strategies along the way?\nI’m really committed and working hard, but I’d appreciate any honest advice or perspective.\nThank you .",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/Blogging/comments/1r7syys/how_long_did_it_take_you_to_earn_your_first/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o5zwgh4",
          "author": "jarvandamere",
          "text": "I earned my first income 8 months into starting my blog. I wrote about 100 articles and waited until I have on average, 1000 visits a months to start using affiliate links. I have been rejected by AdSense about 20 times. I still do not earn anything substantial in the least. But it's a start. ",
          "score": 19,
          "created_utc": "2026-02-18 04:23:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5zx3no",
              "author": "kmshift",
              "text": "Thanks so much for sharing your experience — I really appreciate it.\n\nReaching an average of 1,000 monthly visitors and writing 100 articles sounds like a huge amount of effort. That’s honestly impressive and motivating to hear.\n\nWhen you say you’re not earning anything “substantial” yet, what range are you referring to?\n\nMy first goal is $100 per month. In your opinion, how long do you think it typically takes to reach that level? And roughly how much traffic (or how many articles) do you think is needed to get there?\n\nWould love to hear your perspective.",
              "score": 2,
              "created_utc": "2026-02-18 04:27:51",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o60fjxn",
                  "author": "jarvandamere",
                  "text": "I earned $50 in my first 2 weeks. Which was this month actually. Also something I noticed is that 2 of my articles make up for 90% of my traffic. You definitely do not NEED 100 posts. A lot of folks here say 30 is the number where you consider yourself a proper blogger. I only have about 2 backlinks to other average size blogs. \n\nI would say it's extremely difficult mentally. I deleted and started my blog over 3 times because of not liking my niche or the angle I was going at. Constantly posting, promoting, networking, learning, applying SEO, researching stuff just takes a toll and if you allow yourself to give up and you stop posting for a month or something, that's where you lose your progress. \n\nI've visited reddit posts that are 6 months old where people talk about their blogs with excitement and telling everybody about it. But when I click their blog, it doesn't exist anymore. They gave up. \n\nWhen I look at my competition, the websites that rank 1 to 5 on Google for my keywords, the one thing they have in common is age. Those blogs are all 6 to 12 years old on average. So no matter what monetary results you see today, try to stick with it.",
                  "score": 11,
                  "created_utc": "2026-02-18 06:49:17",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5zyn80",
          "author": "PicklePuzzleheaded96",
          "text": "I made my first money from blogging after two years.  \nTurns out “passive income” is passive only after you survive the active phase.",
          "score": 19,
          "created_utc": "2026-02-18 04:38:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5zzsa1",
              "author": "kmshift",
              "text": "That’s a powerful way to put it.\nI’m definitely in the active phase right now, and it feels slow sometimes. But hearing that it took two years helps reset my expectations.\nWould you say the biggest change came from traffic growth, better monetization, or just consistency over time?",
              "score": 3,
              "created_utc": "2026-02-18 04:46:16",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5zwxbm",
          "author": "jim-chess",
          "text": "I think writing for enjoyment, to clarify your own thoughts, or for some other sense of satisfaction is the way to go.\n\nIf it makes money someday, so be it.\n\nRealistically with AI Overviews today, it's a lot tougher to get traffic because your site just gets summarized and shown to the user as a derivative work.\n\nFor those that continue to survive, I'd imagine it's because the diversified away from search engines to social, newsletter and other community building approaches.\n\nI have a small blog that gets traffic but it's mostly from LLM web crawlers nowadays.",
          "score": 8,
          "created_utc": "2026-02-18 04:26:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5zzlaf",
              "author": "kmshift",
              "text": "Thanks for the honest perspective — I really appreciate it.\n\nGetting traffic has been my biggest concern lately, so your explanation about AI Overviews and how things have changed really helps me understand the bigger picture. It makes a lot more sense now why growth feels slower than expected.\n\nI also agree that building beyond search (social, newsletters, community) is probably the smarter long-term move.\n\nThanks again for taking the time to share your experience.",
              "score": 2,
              "created_utc": "2026-02-18 04:44:56",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6022s2",
          "author": "Roy_G_Biz",
          "text": "I started eight months ago and just now made my first affiliate commission. \n\nSo far, I’ve just focused on high value content. I haven’t bothered with Adsense yet",
          "score": 5,
          "created_utc": "2026-02-18 05:02:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o60kf15",
          "author": "madhuforcontent",
          "text": "2 years",
          "score": 7,
          "created_utc": "2026-02-18 07:32:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o66s70u",
              "author": "kmshift",
              "text": "That’s truly impressive.",
              "score": 1,
              "created_utc": "2026-02-19 04:34:36",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o60ezms",
          "author": "Vinaya_Ghimire",
          "text": "My first blogging income came from content aggregator platforms. It took me a couple of months to reach a minimum threshold of $25. I made money in one month from my self hosted blog and it was basically donation from friends and family. It took almost two years to receive payment from ad networks",
          "score": 6,
          "created_utc": "2026-02-18 06:44:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o60gvf4",
              "author": "kmshift",
              "text": "Two years? Wow — that’s a much longer patience game than I expected.\nIt really shows how much endurance blogging actually requires.\nThanks a lot for sharing your experience — it helps set more realistic expectations",
              "score": 1,
              "created_utc": "2026-02-18 07:00:40",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6m7dax",
                  "author": "Additional_Call4287",
                  "text": "Hey are you using ai to reply comments? 🙄 uthis message and tothers too have  em dashes or you use these ???",
                  "score": 1,
                  "created_utc": "2026-02-21 15:50:05",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o612i20",
          "author": "QuiteEarner",
          "text": "I’m still early in my blogging journey so no income yet, but from what I’m seeing most people don’t earn quickly unless they focus on traffic strategy alongside content. I’m currently testing Pinterest + SEO instead of just waiting on ads. Curious what worked fastest for others here?",
          "score": 6,
          "created_utc": "2026-02-18 10:20:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o618fuu",
              "author": "kmshift",
              "text": "Did Pinterest work well for you?\n\nI’ve been consistently posting on Pinterest too, but honestly I haven’t seen any results at all yet. Maybe I’m missing something in the strategy, but so far it hasn’t driven any noticeable traffic for me.",
              "score": 2,
              "created_utc": "2026-02-18 11:11:23",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6396ro",
                  "author": "QuiteEarner",
                  "text": "Honestly still testing it myself, so not huge results yet. From what I’m noticing, consistency, strong pin design, and targeting the right keywords seem to matter more than just posting. Some people say it takes a few months before traffic starts showing up. Curious how long you’ve been posting consistently?",
                  "score": 2,
                  "created_utc": "2026-02-18 17:39:58",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o6667gs",
                  "author": "MoneyMohicanz",
                  "text": "I’ve been implementing it quite a lot recently and have noticed amazing results. Are u posting everyday?",
                  "score": 2,
                  "created_utc": "2026-02-19 02:19:03",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o604zgb",
          "author": "Ok_Ant_4058",
          "text": "It's actually much easier in Korea  \nonce you start posting on Naver Blogs and you apply for \"paid posts\"  \nYou start getting free products, meals, haircuts.. etc  \nand if you grow a bit more you get paid on top of that\n\nSo my first Sponsored post was like in 3 weeks in\n\nand My first monetary offer was like in 4\\~6 months\n\nOnly gotten like 100$ bucks so far in adsence and adpost(Naver)\n\nbut tho other perks, round up to around 10k",
          "score": 5,
          "created_utc": "2026-02-18 05:23:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o60fit5",
              "author": "[deleted]",
              "text": "[removed]",
              "score": 1,
              "created_utc": "2026-02-18 06:49:01",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o60g1v1",
                  "author": "Ok_Ant_4058",
                  "text": "Wait you are Korean??",
                  "score": 2,
                  "created_utc": "2026-02-18 06:53:34",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o60lzqc",
          "author": "justchoo",
          "text": "I have now reframed my position on blogging. I blog because I enjoy creating content. Like some of the other comments, I’ve turned off blogs, but I’ve learned to love that I do. \n\nI would say that your blog should have a purpose. \n\nI write about wellbeing and ideas for life. \n\nGood luck with it all.",
          "score": 4,
          "created_utc": "2026-02-18 07:46:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o62hflj",
          "author": "CautiousTomato6134",
          "text": "Blogging to make money has become much harder with the introduction of Google's AI Overview. This is especially true if you are writing \"informational\" blog content as the AI Overview is just giving people the answer and reducing click rates drastically. We have many affiliate sites that used to bring in thousands of dollars per month in Adsense go to basically zero due to AI Overview. Because of this, we have switched to YouTube which still works similarly to how blogging used to work. YouTube content can be evergreen and compound over time. You can also make affiliate money ASAP via amazon and other affiliate programs putting product links in your YouTube descriptions.   \n  \nIf you are just starting out to try and blog for money, I'd save yourself a bunch of time and pivot to YouTube instead IMO.",
          "score": 4,
          "created_utc": "2026-02-18 15:34:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o66ruwj",
              "author": "kmshift",
              "text": "That sounds like a smart pivot. Moving to YouTube definitely makes sense in the current situation.\n\nAt the same time, I’m a bit worried because AI summaries are also becoming more common on YouTube. It feels like AI is slowly reducing visibility everywhere.\n\nFor someone like me who’s still trying to figure things out, monetization is starting to feel more and more difficult. Honestly, I’m a bit overwhelmed and unsure what the best path forward is.\n\nStill trying to stay consistent and not give up.",
              "score": 1,
              "created_utc": "2026-02-19 04:32:16",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o61h7xs",
          "author": "No_Employer_5855",
          "text": "I'd say 30 days or less into starting my site. Of course, it was peanuts, but still I was over the moon. ",
          "score": 3,
          "created_utc": "2026-02-18 12:18:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o61jbfb",
              "author": "kmshift",
              "text": "What was the topic of the site? It was really quick to generate revenue!",
              "score": 2,
              "created_utc": "2026-02-18 12:32:20",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o67nkwx",
                  "author": "No_Employer_5855",
                  "text": "It was about bicycles, a site for bike reviews. Yes, affiliate revenue is pretty easy and quick, but keep in mind this was 10 years ago. ",
                  "score": 1,
                  "created_utc": "2026-02-19 08:58:56",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6412fl",
          "author": "thewholesomespoon",
          "text": "11 months!",
          "score": 3,
          "created_utc": "2026-02-18 19:43:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o66s6c6",
              "author": "kmshift",
              "text": "That’s truly impressive.",
              "score": 3,
              "created_utc": "2026-02-19 04:34:28",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6904ws",
                  "author": "thewholesomespoon",
                  "text": "Thank you! I work so hard on this! I got $130 after those 11 months and I felt like I won the lotto!",
                  "score": 2,
                  "created_utc": "2026-02-19 14:52:55",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o6rbpza",
              "author": "imeshad",
              "text": "I started blog web aite before two month. So far two month i have developed web site. Now i writing 50 blog content. So i want to know how do you find what users want to read about specific area.",
              "score": 2,
              "created_utc": "2026-02-22 12:00:34",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o70kik8",
                  "author": "thewholesomespoon",
                  "text": "Well I’m a food blogger so I just post my recipes and then market them on socials and with seo!",
                  "score": 3,
                  "created_utc": "2026-02-23 20:33:00",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6444y2",
          "author": "TheCaffeinatedSnail",
          "text": "I waited until I was eligible for Mediavine for higher paying ads which took about 16 months and 150 articles. ",
          "score": 3,
          "created_utc": "2026-02-18 19:58:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o66s4kz",
              "author": "kmshift",
              "text": "Waiting 16 months is truly impressive. I honestly didn’t realize how difficult it is to build even one solid income pipeline.\n\nHearing your experience actually gives me some comfort and perspective. Thank you for sharing.",
              "score": 1,
              "created_utc": "2026-02-19 04:34:09",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6guuy2",
                  "author": "TheCaffeinatedSnail",
                  "text": "Once you start making money it becomes much easier, and if you keep pumping out great quality work the payout snowballs fast. ",
                  "score": 2,
                  "created_utc": "2026-02-20 18:35:06",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o66d67e",
          "author": "Tweetgirl",
          "text": "In month 2 I made about $80",
          "score": 3,
          "created_utc": "2026-02-19 02:59:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6uplun",
              "author": "kmshift",
              "text": "$80 in month 2 is actually encouraging to hear.\n\nWas that mostly from ads or affiliate?  \nDid you already have traffic from somewhere else, or was it pure SEO?",
              "score": 1,
              "created_utc": "2026-02-22 22:29:12",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6vcsf9",
                  "author": "Tweetgirl",
                  "text": "Affiliate..it was mostly social traffic.",
                  "score": 1,
                  "created_utc": "2026-02-23 00:39:21",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6xsyey",
          "author": "SearchMaverick",
          "text": "First income is usually 3 to 12 months, if the niche and intent are right. Early on I focus on one narrow topic map, publish clusters, and build an email list. AdSense is a milestone, not a strategy.",
          "score": 3,
          "created_utc": "2026-02-23 12:07:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o71uzkd",
              "author": "kmshift",
              "text": "“AdSense is a milestone, not a strategy.”  \nThat line hit.\n\nI think I’ve been mentally treating approval as the finish line, when it’s probably just step one.\n\nWhen you build topic clusters, how many articles do you usually publish before expecting traction?",
              "score": 1,
              "created_utc": "2026-02-24 00:34:22",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7378sx",
                  "author": "SearchMaverick",
                  "text": "It's different for every niche. There's no magic number. Obscure niches could be 10-15. Tougher niches could bee 100+.",
                  "score": 1,
                  "created_utc": "2026-02-24 05:36:11",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o615zd3",
          "author": "LDNSarah",
          "text": "Honestly years. It takes a lot of traffic to make money through adsense and affiliates and with ai summaries it is harder to get that traffic. \n\nThat's not to say it is impossible, but unless you have a really solid seo strategy and start pulling in serious traffic early then it takes a while to build up and it might just be pennies to begin with.",
          "score": 2,
          "created_utc": "2026-02-18 10:50:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6b7940",
          "author": "stealthagents",
          "text": "It took me about six months to see my first income, and honestly, I was just throwing stuff at the wall to see what stuck. I focused a lot on SEO and engagement, and once I found my niche, things started to click. Don’t stress too much about the waiting; consistency is key, and those small wins add up over time.",
          "score": 2,
          "created_utc": "2026-02-19 21:14:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6uporf",
              "author": "kmshift",
              "text": "Six months actually sounds realistic.\n\nWhen you say “once I found my niche,” did you narrow it down aggressively?  \nI’m still trying to figure out whether to go broader for traffic or narrower for authority.\n\nAppreciate the reminder about consistency.",
              "score": 1,
              "created_utc": "2026-02-22 22:29:38",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6dlrz1",
          "author": "SellSuite",
          "text": "3 months in with 3 blogs on the move and havent earned anything from adsense (not approved yet) and made 2 affiliate sales which i feel like is a good start. best of luck to you on your journey",
          "score": 2,
          "created_utc": "2026-02-20 06:07:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6rbseu",
              "author": "imeshad",
              "text": "I started blog web aite before two month. So far two month i have developed web site. Now i writing 50 blog content. So i want to know how do you find what users want to read about specific area.",
              "score": 2,
              "created_utc": "2026-02-22 12:01:08",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6f4p27",
          "author": "Hot-Resist-2438",
          "text": "I burst out laughing on reading this. I started blogging in 1993 - well before blogging was coined. For me, it was a natural extension of Usenet and BBSes. I’m still blogging today. No income has ever come my way. I’d suggest blogging for personal interest and enjoyment first then income. You’re less likely to be disappointed that way. All the best making money off your blog.",
          "score": 2,
          "created_utc": "2026-02-20 13:38:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6upi9u",
              "author": "kmshift",
              "text": "1993… that’s amazing honestly. Respect.\n\nI think you’re right — if income is the only goal, it can get frustrating fast. I actually enjoy writing, but I’d be lying if I said I’m not hoping it turns into something sustainable.\n\nMaybe the balance is the key. Appreciate your perspective.",
              "score": 1,
              "created_utc": "2026-02-22 22:28:40",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6i9ok0",
          "author": "Friendly-System-1425",
          "text": "So what are the best sites to post a blog .",
          "score": 2,
          "created_utc": "2026-02-20 22:44:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6upju4",
              "author": "kmshift",
              "text": "It really depends on your goal.\n\nIf it’s just writing → Medium, Substack, or even Blogger can work.  \nIf you want long-term control + monetization → self-hosted WordPress is usually better.\n\nThe platform matters less than traffic + niche clarity though.",
              "score": 2,
              "created_utc": "2026-02-22 22:28:54",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6o560p",
          "author": "Irene_the_Bagpipe",
          "text": "It took me about 6 months to get my first client. I wasn’t at the 6 figure range of income. But, I did end up replacing my income so that was cool! \n\nI focused mostly on quality articles and really trying to give helpful descriptions. I also just kept publishing one after another. This was a few years ago, though. And, I genuinely believe the SEO landscape has changed in a manner that not just everyone can start up a blog and get it going. It may be much harder now than it was for people like me. \n\nStill, don’t lose hope!!",
          "score": 2,
          "created_utc": "2026-02-21 21:45:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6upw6y",
              "author": "kmshift",
              "text": "Replacing your income is huge — that’s honestly the dream. Respect.\n\nIt’s interesting you mentioned how much SEO has changed. That’s something I keep wondering about. Sometimes it feels like the bar is way higher now — more competition, more AI content, more authority sites dominating everything.\n\nWhen you were building up, did you focus on one very specific niche, or was it broader at first?\n\nAnd thank you — I’m trying to stay patient. I know two months is basically nothing in blogging years, but the waiting game definitely tests you",
              "score": 2,
              "created_utc": "2026-02-22 22:30:44",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o72hnnx",
                  "author": "Irene_the_Bagpipe",
                  "text": "Hey thanks! Yeah, it definitely meant a lot to me since the flexibility of self employment gives a lot of leeway. \n\nI think that it’s true that there’s a lot more ai content and the landscape is definitely more competitive than it was before. However, one key business heuristic still stands: it’s often a matter of stamina and not cleverness. A lot of people can conjure different ideas and strategies for standing out in the SEO world. Just look at the entrepreneurship and related subs. Everyone has ideas. But, I think even rarer is the ability to stick with a plan for an extended period of time. \n\nWhen I was starting off, I started with one particular niche and really zeroed in on making the best possible content I could on that specific problem. Then, I would just write adjacent articles in relation to that and expand in topic from there with future articles. \n\nAnd hey you got this! It’s something that takes a while but I would give it another 4 months of consistency and patience. Feel free to lmk if you got questions or anything! No guarantee I’ll answer immediately but I’ll try to answer as quick as I can! ((:",
                  "score": 1,
                  "created_utc": "2026-02-24 02:45:05",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6wca8r",
          "author": "thepublisherindex",
          "text": "Back in the day around 7 years ago, probably 6 or so months. Nowadays, I think it is a lot harder to stay consistent with AI tech improving so quickly, and the whole industry changing. Maybe double the time",
          "score": 2,
          "created_utc": "2026-02-23 04:20:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o71uyex",
              "author": "kmshift",
              "text": "That’s what I keep thinking about too.\n\nIt feels like starting now means competing not just with bloggers, but with AI-scaled content farms and established authority sites.\n\nDo you think smaller personal blogs can still win with depth + authenticity, or is brand building almost mandatory now?",
              "score": 1,
              "created_utc": "2026-02-24 00:34:11",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6y3iwe",
          "author": "Character8989",
          "text": "Mine took about 6 months. The switch was writing around one niche instead of random posts. Once the articles linked together, impressions started climbing.",
          "score": 2,
          "created_utc": "2026-02-23 13:20:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o71v0hu",
              "author": "kmshift",
              "text": "That makes a lot of sense.\n\nI’m starting to see that random posting might actually slow things down.\n\nRoughly how many articles did you publish in that one niche before impressions noticeably increased?",
              "score": 1,
              "created_utc": "2026-02-24 00:34:30",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o736r3x",
                  "author": "Character8989",
                  "text": "It was around 25-30 quality articles",
                  "score": 1,
                  "created_utc": "2026-02-24 05:32:19",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6ycbic",
          "author": "Lumaenaut_",
          "text": "I'm just starting my blogging journey and I really appreciate people like you asking these sort of questions for future bloggers like me who want to follow along your footsteps. ",
          "score": 2,
          "created_utc": "2026-02-23 14:11:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o71v220",
              "author": "kmshift",
              "text": "That’s really kind of you to say.\n\nHonestly, I’m still figuring it out myself. Two months in and mostly in the “confused but determined” phase\n\nBut if documenting the process helps others starting out, that’s already motivating.\n\nLet’s both stick with it.",
              "score": 1,
              "created_utc": "2026-02-24 00:34:44",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6e4wew",
          "author": "Chance_Ad_5760",
          "text": "following",
          "score": 1,
          "created_utc": "2026-02-20 09:02:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6bgquv",
          "author": "Dapper-Cash-6698",
          "text": "Seit ungefähr 4 Wochen warte ich darauf, dass meine Website von Blogger.com veröffentlicht wird, damit ich im Affiliate-Marketing endlich zu einem Einkommen gelange. Aber AdSense schickt mir dauernd Nachrichten mit sovielen Fachbegriffen, dessen Vorgehensweise ich nicht verstehe und deshalb nicht weiterkomme. Normalerweise dauert es nur einige Tage bis eine Woche, aber es kann  auch mehrere Wochen dauern \n bis die Veröffentlichung genehmigt wird. So sagt es AdSense. Ich habe viel Geld investiert und möchte endlich davon leben können. Gibt es allgemein verständliche Lösungen dafür?",
          "score": 1,
          "created_utc": "2026-02-19 22:01:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6upndr",
              "author": "kmshift",
              "text": "I totally understand the AdSense frustration. The technical messages can feel overwhelming.\n\nFrom what I’ve seen, AdSense approval usually depends on:\n\n* Clear site structure\n* Original content\n* Privacy policy / legal pages\n* Enough indexed pages\n\nIt might help to simplify everything first instead of trying to optimize for affiliate income immediately.\n\nYou’re not alone in this — a lot of us are stuck in the same waiting phase.",
              "score": 1,
              "created_utc": "2026-02-22 22:29:26",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1rao1tz",
      "title": "is Pinterest for bloggers actually dead in 2025 or just harder than before",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1rao1tz/is_pinterest_for_bloggers_actually_dead_in_2025/",
      "author": "Sea-Counter8004",
      "created_utc": "2026-02-21 10:38:10",
      "score": 28,
      "num_comments": 31,
      "upvote_ratio": 0.95,
      "text": "getting extremely conflicting information about Pinterest and need real experiences not guru BS\nsome people: \"Pinterest is dead, algorithm killed small creators\" other people: \"Pinterest is my main traffic source, drives 10K monthly\"\nwhich is it??\nmy blog has 400 monthly visitors from SEO after 8 months, considering if Pinterest is worth time investment or if I'm 5 years too late\nspecific questions for bloggers currently using Pinterest:\ndoes it still work for NEW accounts in 2025?\nhow much time per week realistically?\nhow long until you saw real traffic?\nis it actually better than Instagram/TikTok?\nneed honest answers because I can't afford to waste 3 months on another platform that doesn't work",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/Blogging/comments/1rao1tz/is_pinterest_for_bloggers_actually_dead_in_2025/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o6lekdo",
          "author": "madhuforcontent",
          "text": "Pinterest works best for visual content based niches. You can use it as one of website traffic sources. Never rely on it alone as these days I keep seeing some experessing their Pinterest accounts getting blocked for many reasons. Yes, it is better than Instagram/TikTok. ",
          "score": 8,
          "created_utc": "2026-02-21 13:00:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6mpcrd",
              "author": "[deleted]",
              "text": "[removed]",
              "score": -2,
              "created_utc": "2026-02-21 17:20:00",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6o37zg",
                  "author": "Ok-Library-2267",
                  "text": "Yes, $200 can get you a starter blog with a clean, responsive design and basic setup, plus a Pinterest account linked.\n\nIt won’t cover custom designs or advanced features, but it’s enough for a good starting point if you handle content yourself.",
                  "score": 2,
                  "created_utc": "2026-02-21 21:35:09",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o6qsr5u",
                  "author": "Nail_Traditional",
                  "text": "Send me your blog I may be interested",
                  "score": 2,
                  "created_utc": "2026-02-22 09:01:29",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6l73yj",
          "author": "Learning1000",
          "text": "Yes it still works. Im at 7k outbound clicks now. I use to hate pinterest. But now I love it because it's getting me more traffic than any other platform.\n\nJust be consistent and pinterest loves fresh pins",
          "score": 4,
          "created_utc": "2026-02-21 12:01:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6lmhcj",
              "author": "jarvandamere",
              "text": "How long did it take to get to that? I'm pinning 8 pins a day for 2 months and only get about 2 outbound clicks a day. Travel niche.",
              "score": 3,
              "created_utc": "2026-02-21 13:53:30",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6lzlpc",
                  "author": "Learning1000",
                  "text": "Parenting Niche started getting serious in November of 2025. I pin 5 pins a day 4 regular post and 1 product pin. I can't wait to see how it will be in December. ",
                  "score": 3,
                  "created_utc": "2026-02-21 15:09:55",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6loma3",
          "author": "thewise_wizard89",
          "text": "way better than instagram for blog traffic, instagram is just vanity metrics. pinterest people actually click through to read",
          "score": 3,
          "created_utc": "2026-02-21 14:06:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6lsm10",
              "author": "Sea-Counter8004",
              "text": "everyone keeps saying keyword research, what does that actually mean for pinterest?",
              "score": 1,
              "created_utc": "2026-02-21 14:30:33",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6leueq",
          "author": "Fine_Perspective_570",
          "text": "still works but you have to treat it like seo now, keyword research is critical. i use tailwinds tool to find high volume searches, shows like 50-200 related keywords with volume data. cant just post aesthetic pins and hope like the old days",
          "score": 2,
          "created_utc": "2026-02-21 13:02:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6m5adq",
          "author": "West-Worldliness-509",
          "text": "Pinterest is a must today",
          "score": 2,
          "created_utc": "2026-02-21 15:39:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6mqwnd",
          "author": "hypnot1k",
          "text": "It's definitely harder to get traffic as more people enter the space. Algorithm updates can also wipe your entire reach at any time. It's a risky platform to build a business on but so are all the other big social media networks (Facebook, YouTube, TikTok, etc.).",
          "score": 2,
          "created_utc": "2026-02-21 17:27:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6lwmle",
          "author": "Lonely_Mark_8719",
          "text": "I am sure it is harder than before... but it can also be more opportunistic due to advancement in technology",
          "score": 1,
          "created_utc": "2026-02-21 14:53:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6n0d3n",
          "author": "shopaholic_lulu7748",
          "text": "Platforms can change algorithm. I've been blogging since 2010 and I've watched Facebook, Instagram, Pinterst, and Google go to trash with all the crap they've changed. Also depends on your niche.",
          "score": 1,
          "created_utc": "2026-02-21 18:15:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6nshu1",
          "author": "Numerous_Display_531",
          "text": "I don't think there is necessarily anything wrong with Pinterest but I think your question has more to do with what the blog niche is. For example, I find it hard to imagine that a blog for programming for example could do well on pinterest but something related to cooking could do well",
          "score": 1,
          "created_utc": "2026-02-21 20:38:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6or8bd",
          "author": "TouchMyPVPness",
          "text": "The platform has been down bad because of all the AI spam. There are like 5 blog to pin software that automate everything from pin creation, to article creation, to posting etc. Think of how much shit is being posted.\n\nYes, it still works for new accounts.\n\nYou're in sandbox mode in the beginning so about a month of consistent posting 3-5 pins a day.\n\nWhat do you mean better than instagram and tiktok? The platforms function way differently lol\n\nKeyword research very important. Don't even think of posting random shit. Also go for seasonal niches that you can target all throughout the year. That's when you get big traffic to your pins and site.\n\nKeep in mind that you barely see many people saying they earn good with pinterest. The best thing that works on pinterest are listacles with ads. But one site is not going to cut it, you're going to need multiple. Also pinterest has a good way of dropping your ass out of the algorithm and shadowbaning you when you're doing good. It's also been a lot harder to approve your sites for ads with this type of content especially mediavine.",
          "score": 1,
          "created_utc": "2026-02-21 23:51:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6pek82",
          "author": "ActuaryMean6433",
          "text": "It depends on the niche. Pinterest most definitely still works but if the content isn’t good or it’s not a niche that would do well there, it’s not going to help. That’s why you hear conflicting advice. \n\nPinterest is a long game, much longer than 3 months, and it’s a search engine. If you treat it as such, and your niche fits well, you’ll see it working but it takes time, quality non-AI content, and consistency. \n\nIf you’re interested, I helped create an unlimited tool that posts pins to all my boards and sections; my reach has blown up.",
          "score": 1,
          "created_utc": "2026-02-22 02:18:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ph67l",
          "author": "kubrador",
          "text": "pinterest isn't dead, it's just not the \"post it and forget it\" goldmine it was in 2020. the people saying it works are usually doing it right, the people saying it's dead usually aren't.\n\nnew accounts still work but you need 2-3 months of consistent pinning before you see anything. realistically 5-7 pins a week if you're using a scheduler. it's slower than the algorithm givers make it sound but faster than tiktok/instagram for actual blog traffic since people on pinterest are literally looking for blog content instead of just scrolling.\n\ninstagram and tiktok are content black holes. pinterest actually sends people to your site. if your blog is the goal, pinterest beats both. but if you're hoping for viral growth or building a follower count, wrong platform.\n\nyour real question is whether 3 months of effort is worth potentially 5k-10k monthly",
          "score": 1,
          "created_utc": "2026-02-22 02:35:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6qeszo",
          "author": "Babyfaced-Stoic",
          "text": "Pinterest is a great way to get fresh traffic, but your email list is what's really yours, build an email list.",
          "score": 1,
          "created_utc": "2026-02-22 06:49:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6rb7fz",
          "author": "imeshad",
          "text": "I started blog web aite before two month. So far two month i have developed web site. Now i writing 50 blog content. So i want to know how do you find what users want to read about specific area.",
          "score": 1,
          "created_utc": "2026-02-22 11:56:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6s2gbp",
          "author": "QuiteEarner",
          "text": "\"I’m still early in blogging and trying to decide where to focus my limited time.\nFrom what I’ve seen, Pinterest doesn’t look dead — just more competitive and slower than before. The people getting real traffic seem to treat it like a search engine and commit long term.\nFor those actively using Pinterest right now: – Is it working for new accounts? – How long before traffic became meaningful? – Roughly how many hours per week are you investing?\nTrying to decide whether to add it now or double down on SEO first. Would appreciate real numbers.\"",
          "score": 1,
          "created_utc": "2026-02-22 14:52:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6meywf",
          "author": "ehben83",
          "text": "dude... we're in 2026.\n\nI believe your post is written by AI",
          "score": 0,
          "created_utc": "2026-02-21 16:28:04",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rbl7ij",
      "title": "Is it good to get 30-40 daily visitors after my site is been up for 4 months?",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1rbl7ij/is_it_good_to_get_3040_daily_visitors_after_my/",
      "author": "Ok-Conclusion-3536",
      "created_utc": "2026-02-22 12:57:20",
      "score": 28,
      "num_comments": 93,
      "upvote_ratio": 0.97,
      "text": "I publish an article a day . I THINK I'm doing good but I don't know if I'm below average at the moment. ",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/Blogging/comments/1rbl7ij/is_it_good_to_get_3040_daily_visitors_after_my/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o6rktoo",
          "author": "Turnitn",
          "text": "That's good if it's Google traffic. ",
          "score": 9,
          "created_utc": "2026-02-22 13:10:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6snj5u",
              "author": "Ok-Conclusion-3536",
              "text": "Yes 95% it's Google traffic",
              "score": 5,
              "created_utc": "2026-02-22 16:31:02",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o6wk2cu",
              "author": "shajid-dev",
              "text": "why that's good if it's Google traffics? What if Google cut downs this site, ;\\\\ ",
              "score": 1,
              "created_utc": "2026-02-23 05:17:51",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6xkaa8",
                  "author": "Turnitn",
                  "text": "It's real people not bots. And it's 'free' traffic because you don't need to promote, unlike social media traffic.",
                  "score": 2,
                  "created_utc": "2026-02-23 10:52:41",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6rmijh",
          "author": "ImOdysseus",
          "text": "Absolutely normal. You're doing good. ",
          "score": 4,
          "created_utc": "2026-02-22 13:21:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6snhj6",
              "author": "Ok-Conclusion-3536",
              "text": "Thanks bro",
              "score": 5,
              "created_utc": "2026-02-22 16:30:50",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6rtszi",
          "author": "Camino_Financiero",
          "text": "It’d be great if you could share your website so I can check it out and read it too. What area is it focused on? Is it more like a digital media outlet, or do you cover a specific topic?",
          "score": 5,
          "created_utc": "2026-02-22 14:05:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6snoxy",
              "author": "Ok-Conclusion-3536",
              "text": "It's in Italian idk if it'd be useful to share it to ya. It's gaming related.",
              "score": 3,
              "created_utc": "2026-02-22 16:31:46",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6vnoeh",
                  "author": "GavrielMora",
                  "text": "Google Chrome can auto translate.",
                  "score": 2,
                  "created_utc": "2026-02-23 01:44:23",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o6wqdfd",
              "author": "Ok-Conclusion-3536",
              "text": "https://nosugargaming.it/",
              "score": 2,
              "created_utc": "2026-02-23 06:09:17",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6ruv6c",
          "author": "beingoptimistlab",
          "text": "For 4 months, 30–40/day is pretty normal. Early growth is usually slow and uneven.  \nWhat matters more is whether impressions and rankings are gradually improving month over month. Traffic compounds later if your content has clear search intent.",
          "score": 3,
          "created_utc": "2026-02-22 14:11:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6sns80",
              "author": "Ok-Conclusion-3536",
              "text": "Yeah they're improving although slowly and sometimes they go below something they go further",
              "score": 2,
              "created_utc": "2026-02-22 16:32:11",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o6v60c4",
              "author": "theSchnitzelbirder",
              "text": "Is zero after two months also normal?",
              "score": 1,
              "created_utc": "2026-02-23 00:00:56",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6rjmnx",
          "author": "Captlard",
          "text": "It may depend on the niche!\n\nI am getting 183, but started 6 months ago (no social media publishing at all to promote).",
          "score": 2,
          "created_utc": "2026-02-22 13:02:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6rjpwr",
              "author": "Ok-Conclusion-3536",
              "text": "I'm in gaming. How much are you making a month? Just out of curiosity",
              "score": 1,
              "created_utc": "2026-02-22 13:02:56",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6rmahh",
                  "author": "Captlard",
                  "text": "I am not advertising, but I have had one half day's piece of work off the content for 2100 Euro and a two-hour call for 300 Euro.",
                  "score": 2,
                  "created_utc": "2026-02-22 13:20:20",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o6uej39",
              "author": "SingerLuch",
              "text": "hey, can u give link of ur site?",
              "score": 1,
              "created_utc": "2026-02-22 21:32:15",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6uk91u",
                  "author": "Captlard",
                  "text": "Dm",
                  "score": 1,
                  "created_utc": "2026-02-22 22:01:13",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6scpuz",
          "author": "Spirited_Manager_831",
          "text": "Yes, you're on the right path",
          "score": 2,
          "created_utc": "2026-02-22 15:43:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6rlsnh",
          "author": "jim-chess",
          "text": "Humans or robots?",
          "score": 1,
          "created_utc": "2026-02-22 13:17:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6snk5v",
              "author": "Ok-Conclusion-3536",
              "text": "I'm assuming humans lol",
              "score": 1,
              "created_utc": "2026-02-22 16:31:10",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6sovqp",
                  "author": "jim-chess",
                  "text": "That's good.\n\nI have a small blog and most \"visits\" nowadays are crawlers like ChatGPT or web scraping bots.\n\n",
                  "score": 3,
                  "created_utc": "2026-02-22 16:37:07",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6rxbk1",
          "author": "Vinaya_Ghimire",
          "text": "Where do your views come from? If they are organic views, getting 30-40 daily views is certainly good.",
          "score": 1,
          "created_utc": "2026-02-22 14:25:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6sntms",
              "author": "Ok-Conclusion-3536",
              "text": "Yeah it's organic search",
              "score": 1,
              "created_utc": "2026-02-22 16:32:21",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6rzbaa",
          "author": "QuiteEarner",
          "text": "30–40 daily visitors in 4 months isn’t bad for a new site. I’ve noticed a lot depends on keyword competition and search intent more than publishing frequency. Sometimes fewer, better-targeted posts perform stronger than daily content. Are most of your visitors coming from Google or another source?",
          "score": 1,
          "created_utc": "2026-02-22 14:36:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6xom0p",
              "author": "Ok-Conclusion-3536",
              "text": "Google luckily",
              "score": 1,
              "created_utc": "2026-02-23 11:31:42",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o73tmyx",
                  "author": "QuiteEarner",
                  "text": "Google traffic that early is a great sign, especially for a new site. From what I’ve been seeing, even getting consistent Google visitors in the first few months means your content is starting to get picked up. Are your clicks mostly coming from a few posts, or spread across many articles?",
                  "score": 1,
                  "created_utc": "2026-02-24 08:54:52",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6s3b26",
          "author": "kaleandbeans",
          "text": "If it's better than the month prior, you might have good momentum going! It really just depends on the niche, efforts, consistency, etc.",
          "score": 1,
          "created_utc": "2026-02-22 14:57:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6s5hm9",
          "author": "highfives23",
          "text": "Yes",
          "score": 1,
          "created_utc": "2026-02-22 15:08:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6s70je",
          "author": "thetetheredsoul",
          "text": "How do you publish an article a day? Niche, word count? I need 3-4 days. May be I am slow.",
          "score": 1,
          "created_utc": "2026-02-22 15:16:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6snz77",
              "author": "Ok-Conclusion-3536",
              "text": "Well it takes me like 1 hour / 1 hour a half at max. So it's doable although a bit stressful, I'm in gaming",
              "score": 2,
              "created_utc": "2026-02-22 16:33:03",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6ss0e1",
                  "author": "CineThursday",
                  "text": "Can you give a example of a article like the Titel. What is your Gaming Site about and your article?",
                  "score": 1,
                  "created_utc": "2026-02-22 16:51:07",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6sc7aw",
          "author": "RobertLigthart",
          "text": "30-40 daily at 4 months is solid. most blogs get basically zero traffic for the first 6 months so youre ahead of the curve\n\n  \none article a day is aggressive tho... make sure youre not sacrificing quality for quantity. google cares way more about 10 good articles than 120 mediocre ones",
          "score": 1,
          "created_utc": "2026-02-22 15:41:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6snevi",
              "author": "Ok-Conclusion-3536",
              "text": "I'm just extremely dedicated",
              "score": 1,
              "created_utc": "2026-02-22 16:30:30",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6segpg",
          "author": "ntyruei",
          "text": "its good",
          "score": 1,
          "created_utc": "2026-02-22 15:51:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6tqfyb",
          "author": "dwoodro",
          "text": "It depends on too many factors. All of these things matter:\n\nHow often you post to your site, and the niche you are in. The specific topics you are posting. If you have an existing audience. Are you doing other marketing? Posting to social media? Which social media do you post to? etc.\n\nThe thing to truly look at is where your traffic is coming from. If you are getting consistent traffic from one source (and it's not bot traffic), then I would double or triple down on efforts on that source. Drop the non-producers.",
          "score": 1,
          "created_utc": "2026-02-22 19:30:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6u8yrz",
              "author": "Ok-Conclusion-3536",
              "text": "I post once a day and my niche is gaming. I don't really post on social media.\n\nMy traffic is like 90% organic",
              "score": 1,
              "created_utc": "2026-02-22 21:04:27",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6upw05",
                  "author": "dwoodro",
                  "text": "Then yes, if this is mostly organic, I would consider that a good start. That's a decent indication that your topics are relevant and drawing interest. But you could still increase that traffic by finding other places where your topics might draw a larger audience. Posting similar posts for instance, to gaming forums, wher eknown gamersa hanging out vs just hoping for a Google search. The more you can place your content directly in front of your target audience, the better. ",
                  "score": 1,
                  "created_utc": "2026-02-22 22:30:42",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6tz8za",
          "author": "Cpvrx",
          "text": "Yes, you are on the right path. Keep up the great work.",
          "score": 1,
          "created_utc": "2026-02-22 20:14:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6v5in4",
          "author": "software_guy01",
          "text": "I think for a four month old website getting 30 to 40 visitors a day is a solid start especially if you are posting regularly. That adds up to around 900 to 1200 visitors a month which is good for a new site. I believe the key is whether your traffic is growing each month and if it is relevant. I suggest checking which keywords bring traffic and if they are low competition then using tools like LowFruits to find easier keywords to rank for. I also focus on making sure articles have clear titles, proper headings and strong internal links. Posting daily is helpful but quality and smart keyword targeting matter more than volume. If your traffic is slowly increasing, you are on the right track and by refining your keyword strategy and updating older posts, you should see steady growth over time.",
          "score": 1,
          "created_utc": "2026-02-22 23:58:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6wbyrr",
          "author": "thepublisherindex",
          "text": "I think it depends on what you're targeting. That's definately movement in the right direction. Keep it up and a hockey stick is likely to occur!",
          "score": 1,
          "created_utc": "2026-02-23 04:18:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6wj6u2",
          "author": "Full_Lighter",
          "text": "Your link structure is really bad, it is signling google your site might be spam.\n\n  \nYou should change it.",
          "score": 1,
          "created_utc": "2026-02-23 05:11:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6wj9vz",
              "author": "Ok-Conclusion-3536",
              "text": "What do you mean link structure?",
              "score": 1,
              "created_utc": "2026-02-23 05:11:47",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6wjupv",
                  "author": "Full_Lighter",
                  "text": "For example this link:\n\n[https://nosugargaming.it/terraria-mod-migliori-mod-2026/](https://nosugargaming.it/terraria-mod-migliori-mod-2026/)\n\nIt shouldn't go from the root directly to the post, it should be something like this:\n\n[https://nosugargaming.it/blog/terraria-mod-migliori-mod-2026/](https://nosugargaming.it/blog/terraria-mod-migliori-mod-2026/)\n\nThis is particuly important for posts, but you can apply the same for pages and everything else in the site, google LOVES structure and they penalize sites without it.",
                  "score": 1,
                  "created_utc": "2026-02-23 05:16:14",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6wwmr3",
          "author": "madhuforcontent",
          "text": "I would say yes in the current scenario. ",
          "score": 1,
          "created_utc": "2026-02-23 07:04:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ygkgw",
          "author": "Technical-Status779",
          "text": "I would say yes.\n\n\nFrom personal experience, I've had two websites in the past two years - both are blog, both are super niche, and both have managed an average of 2 or 3 posts per month (no joke, and one of the two has remained without posts since May, the other was just started in June and had a few months hiatus).\n\n\nBecause the eldest is political in nature, it amassed over 25k views in just 16 months from all over the world - most of those views were during an election cycle and a very heated topic several months later.  The younger is as random as can be but has been viewed (mostly in the USA) by almost 13k in its nine months of formal existence.\n\n\nThat math puts it roughly 50 views daily on average regardless of which - so regardless of how many times you post?\n\n\nMake your posts count. ❤️ ",
          "score": 1,
          "created_utc": "2026-02-23 14:34:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6yte8m",
          "author": "ashishdigita",
          "text": "90% good traffic",
          "score": 1,
          "created_utc": "2026-02-23 15:39:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6zpb4o",
              "author": "Ok-Conclusion-3536",
              "text": "What? Yeah I got 90% sort of",
              "score": 1,
              "created_utc": "2026-02-23 18:08:12",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o73b9z4",
          "author": "Soft_Dimension1782",
          "text": "Most new bloggers expect big traffic fast, but SEO just doesn’t work like that. It takes atleast 6–12 months for Google to really trust and rank your site. Posting daily is solid consistency, you’re doing good.",
          "score": 1,
          "created_utc": "2026-02-24 06:08:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o73bi4b",
              "author": "Ok-Conclusion-3536",
              "text": "BTW just yesterday I got to 60 daily clicks",
              "score": 1,
              "created_utc": "2026-02-24 06:10:33",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6tslwd",
          "author": "Foreign-Wishbone4390",
          "text": "One article per day is too slow. You need to pump that up. Imagine publishing five per day. You could triple this in no time.\n\nLast month, I published 100 articles in a single month on one of my sites, and many keywords are already ranking in the top 10 positions right now.",
          "score": -3,
          "created_utc": "2026-02-22 19:41:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6u8jv3",
              "author": "Ok-Conclusion-3536",
              "text": "That would take me like 5 hours a day man I'd burn out",
              "score": 3,
              "created_utc": "2026-02-22 21:02:21",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6wkfhf",
                  "author": "shajid-dev",
                  "text": "lol! To produce a quality content, I spent minimum 6 hours. i've published approximately 22 articles so far, and yet received around 5.5k+ sessions with marketing of course. Let Google cook me later, until then let me myself, cook. and keep cooking. ",
                  "score": 1,
                  "created_utc": "2026-02-23 05:20:42",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o6uho4j",
                  "author": "Foreign-Wishbone4390",
                  "text": "That's understandable. You can start with 2 per day or find a better way to be more efficient while writing new articles.",
                  "score": 0,
                  "created_utc": "2026-02-22 21:47:56",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1r835ig",
      "title": "Have your blogs helped you getting other jobs?",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1r835ig/have_your_blogs_helped_you_getting_other_jobs/",
      "author": "vaibh990",
      "created_utc": "2026-02-18 13:35:32",
      "score": 24,
      "num_comments": 42,
      "upvote_ratio": 0.97,
      "text": "Hello All,\n\nIt's a common knowledge that blogs don't provide quick income. While any of you were building blogs, did you showcase it to get other jobs?",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/Blogging/comments/1r835ig/have_your_blogs_helped_you_getting_other_jobs/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o61wn4m",
          "author": "Confident-Tank-899",
          "text": "Yes, but here's what made it work: you have to actively showcase it. I built a niche blog about project management and honestly, I never expected jobs to just land in my lap. But after a company found my deep-dive content pieces through search, they reached out directly. The key was positioning specific articles as case studies and making sure my best work was visible on LinkedIn with links back to the blog. Passive portfolio ftw.",
          "score": 18,
          "created_utc": "2026-02-18 13:50:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o61wvf8",
              "author": "contentbeast",
              "text": "Excellent point on taking the time to deep dive into a topic. People really do appreciate that.",
              "score": 6,
              "created_utc": "2026-02-18 13:51:53",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o66yeuu",
              "author": "vaibh990",
              "text": "That's interesting - so your blog content was related to the domain of your full time job?",
              "score": 1,
              "created_utc": "2026-02-19 05:18:40",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o67vxc4",
              "author": "TheDoomfire",
              "text": "Have you used planes for project management?\n\nI just gotten started and been experiencing with it.",
              "score": 1,
              "created_utc": "2026-02-19 10:20:38",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o69r9iq",
              "author": "kenashe",
              "text": "That's very cool. Did you accept the role?",
              "score": 1,
              "created_utc": "2026-02-19 17:05:50",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o61ytbg",
          "author": "egusisoupandgarri",
          "text": "Yep. Used my lifestyle blog to land my first freelance blogging clients in wellness and lifestyle, then applied for full-time copywriter roles and landed one of them remotely. Hiring managers told me my blog’s design and content quality stood out during interviews. I’ve since pivoted into UX where content design is my day-to-day, but my blog is still in the background and I go back to it especially when I’m between jobs or working on affiliate projects.",
          "score": 8,
          "created_utc": "2026-02-18 14:02:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o620dsh",
              "author": "Lady-BlackSmith",
              "text": "😂 I like your name",
              "score": 3,
              "created_utc": "2026-02-18 14:10:28",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o62b2gr",
                  "author": "egusisoupandgarri",
                  "text": "Thanks. 😂",
                  "score": 1,
                  "created_utc": "2026-02-18 15:04:16",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o66yogt",
              "author": "vaibh990",
              "text": "That's quite inspiring! So before the wellness and lifestyle happened through your blog, you were working in some other domain?",
              "score": 1,
              "created_utc": "2026-02-19 05:20:39",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o625g8l",
          "author": "highfives23",
          "text": "Yes, my blog got me hired at Google. FAANG companies want to see people strike out and try their own things. It wasn’t a personal blog. It was a blog that helped a specific group of people.",
          "score": 3,
          "created_utc": "2026-02-18 14:36:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6607ep",
              "author": "Turkishblokeinstraya",
              "text": "That sounds amazing. How often so you post and at what point your blog has started being noticeable?",
              "score": 2,
              "created_utc": "2026-02-19 01:44:05",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o660myu",
                  "author": "highfives23",
                  "text": "I was only posting a few times a week, and then I stopped for a year. The Google recruiter was more impressed I took the initiative to start it. I also recruited friends and former roommates to help me write the blog (I paid them), so the recruiter liked the leadership example.",
                  "score": 4,
                  "created_utc": "2026-02-19 01:46:36",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o66yx78",
              "author": "vaibh990",
              "text": "That's cool! Was your blog a tech blog, aligned with your regular job?",
              "score": 1,
              "created_utc": "2026-02-19 05:22:28",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6boj35",
                  "author": "highfives23",
                  "text": "Not at all. The topic didn’t matter to the recruiter, just that I took the initiative.",
                  "score": 2,
                  "created_utc": "2026-02-19 22:42:16",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o61wnfe",
          "author": "contentbeast",
          "text": "Yes.\n\nHowever, it wasn’t the blog by itself. It was showing how much traffic the blog got, how many shares it got on social media, and some of the graphics that were designed inside of the individual blog posts.\n\nA blog post is so easy to create, that if a potential client or employer asks for one, it would be a red flag not to have something offhand to share.\n\nNeedless to say, I’ve hired content marketers many of times who have shared off-line Google Docs with me instead of actual live blog posts. This always surprised me that people didn’t have blog content offhand to share yet they were applying for a digital marketing job that required blogging.\n\nAgain, it’s so easy to do. So just get a blog up and running even if it’s on a free platform like Medium.\n\nBest of luck.",
          "score": 3,
          "created_utc": "2026-02-18 13:50:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o66zf6s",
              "author": "vaibh990",
              "text": "That's interesting - your audience engagement and traffic got noticed. In which domain you created your blog? Was it related to your full time career?",
              "score": 1,
              "created_utc": "2026-02-19 05:26:17",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o68s1sa",
                  "author": "contentbeast",
                  "text": "Yes, it was related to my full-time career, which made it much easier because I had the empathy needed to write truly great content. But some of that content was free resources I gave away inside of the blog posts, again a benefit of knowing the industry its pain points.\n\nThis was for a software company I built a few years back. It was acquired by a PE firm and the new owners took over the blog. \n\nI monitored it for a while and they never really created any more great articles or content after that. It’s a shame.",
                  "score": 2,
                  "created_utc": "2026-02-19 14:09:26",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o625kov",
          "author": "Captlard",
          "text": "I was freelance and people found me via my blog and contract me to do work.",
          "score": 2,
          "created_utc": "2026-02-18 14:37:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o66zjrr",
              "author": "vaibh990",
              "text": "Great! You were getting good traffic?",
              "score": 1,
              "created_utc": "2026-02-19 05:27:16",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o671kls",
                  "author": "Captlard",
                  "text": "No idea what good is to be honest.",
                  "score": 1,
                  "created_utc": "2026-02-19 05:42:56",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o625rnv",
          "author": "bacon-wrapped_rabbi",
          "text": "Previous news translation blog helped get me two full-time jobs I absolutely hated.\n\nOlder travel blog has gotten me some freelance writing gigs and helped with article pitches.",
          "score": 2,
          "created_utc": "2026-02-18 14:38:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o63oykv",
          "author": "sk_611",
          "text": "It’s gotten me writing gigs in sports. Super low paying but it gets your name out there.",
          "score": 2,
          "created_utc": "2026-02-18 18:48:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o63qdfr",
          "author": "Numerous_Display_531",
          "text": "Nah not helped get jobs. It has helped me make some money online but not a full on job\n\nTbh this isn't the goal for me though but that being said, they would be included as part of my portfolio",
          "score": 2,
          "created_utc": "2026-02-18 18:55:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o65eeun",
          "author": "RaizoLP",
          "text": "Yes, a lot of other bloggers and content creators liked my writing style and would have me write content for them.",
          "score": 2,
          "created_utc": "2026-02-18 23:40:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o66bp32",
          "author": "HappyLiberatedSoul",
          "text": "Interesting point. Well I was deliberately hiding the fact that I have a blog lest my employers find it out and use it against me hence I never shared it on my linkedin profile however after going through your post and its comments I am seriously thinking about doing it",
          "score": 2,
          "created_utc": "2026-02-19 02:50:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o66y8dr",
              "author": "vaibh990",
              "text": "Why should a blog be used against anyone? It's not a crime to have a blog!",
              "score": 1,
              "created_utc": "2026-02-19 05:17:19",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o66wxob",
          "author": "kaleandbeans",
          "text": "Yes. I was doing light SEO freelancing/self-employed for awhile. Now I have a full-time job in SEO.",
          "score": 2,
          "created_utc": "2026-02-19 05:07:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o66zt5r",
              "author": "vaibh990",
              "text": "That's quite cool. How does a full time SEO job look like? What exactly do you do?",
              "score": 0,
              "created_utc": "2026-02-19 05:29:15",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o69bi5x",
          "author": "jeronimostilton34",
          "text": "Yes it did! For a while I was a digital marketing freelancer (SEO, website, UX and stuff) and I was publishing articles on my own website. It gave me a lot of credibility when it was time to sign new clients.\n\nFurthermore, Last year i had an interview as a digital marketing and SEO specialist with a company. I was able to use my own blog as a « study case » to answer some of their interview’s questions and give real life examples.",
          "score": 2,
          "created_utc": "2026-02-19 15:50:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o620nq1",
          "author": "Holiday-Oil2598",
          "text": "Yep. You end up on panels, shows, etc. things snowball once you reach a point",
          "score": 2,
          "created_utc": "2026-02-18 14:11:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o62xkz6",
          "author": "Lonely_Mark_8719",
          "text": "yes",
          "score": 1,
          "created_utc": "2026-02-18 16:47:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o63a7r4",
          "author": "itsmariaalyssa",
          "text": "Yes. It helped me with my freelancing gigs.",
          "score": 1,
          "created_utc": "2026-02-18 17:44:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o66znfk",
              "author": "vaibh990",
              "text": "Cool, in which domain?",
              "score": 1,
              "created_utc": "2026-02-19 05:28:03",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6c36r6",
                  "author": "itsmariaalyssa",
                  "text": "Content Writing... mostly social media",
                  "score": 1,
                  "created_utc": "2026-02-20 00:06:21",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o69hkws",
          "author": "veditafri",
          "text": "when i tried my hand at this field, it brought some money, but i couldn't continue",
          "score": 1,
          "created_utc": "2026-02-19 16:19:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6b4nja",
          "author": "peakelyfe",
          "text": "Yes- it has helped me get full time jobs as well as freelance clients, but honestly I think it was more impactful 5-10 years ago than today.",
          "score": 1,
          "created_utc": "2026-02-19 21:02:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6c5onj",
          "author": "SellSuite",
          "text": "It's helped me get freelance work. I'm thinking about applying for copywriting jobs soon so hopefully they help with that. By the sounds off it there's been a lot of success from people in this thread.",
          "score": 1,
          "created_utc": "2026-02-20 00:20:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6tczix",
          "author": "Matteo_172736",
          "text": "blogging helped me open a business, i promoted my cakes through the page and reached a stable income",
          "score": 1,
          "created_utc": "2026-02-22 18:27:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6tw5cj",
          "author": "InterestingPeach7852",
          "text": "It’s led to a few clients. Latest one was a 60k 6 month contract.",
          "score": 1,
          "created_utc": "2026-02-22 19:59:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6209ji",
          "author": "FearlessTravels",
          "text": "No. I have a day job with a government pension and don’t need more work on top of that AND my blog.",
          "score": 0,
          "created_utc": "2026-02-18 14:09:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o62yvo9",
          "author": "CanadianDollar87",
          "text": "i wish my blog helped me get a job.",
          "score": 0,
          "created_utc": "2026-02-18 16:53:13",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r79k0m",
      "title": "How to do blogging without worrying about results",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1r79k0m/how_to_do_blogging_without_worrying_about_results/",
      "author": "Key_Question5584",
      "created_utc": "2026-02-17 15:48:07",
      "score": 23,
      "num_comments": 22,
      "upvote_ratio": 0.9,
      "text": "Publishing new blog posts consistently and not getting traffic is the biggest problem for every new blogger.\n\nIf a blog gets page views and earns money, it motivates us to publish more. However, every blogger will go through a phase when nothing works.\n\nWorking on a blog without worrying about page views is the biggest luxury.\n\nTo achieve that, you need to have a primary source of income, whether it is a job or a business.\n\nBlogging takes time to see results, so during that phase, you can focus on your blog without worrying about outcomes.\n\nMost importantly, when you work on your blog, use proven strategies. \n\nIt can be content strategy, keyword strategy, backlinks, or social media. Whatever strategy you follow, learn it from someone who has already done it and whose style matches yours.\n\nI learned blogging from Income School, where I mainly focused on content.\n\nSo, do blogging with proven strategies. Choose your favourite blogging mentor and apply their strategies. If you work with a proven strategy, your blog will surely become successful.",
      "is_original_content": false,
      "link_flair_text": "Tips/Info",
      "permalink": "https://reddit.com/r/Blogging/comments/1r79k0m/how_to_do_blogging_without_worrying_about_results/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o5vvxms",
          "author": "Vinaya_Ghimire",
          "text": "If you want to blog just for the love of blogging, you wouldn't be fixated with traffic amd revenue. However, most people blog in a hope to generate passive income and if it doesn't come easily they become frustrated.",
          "score": 10,
          "created_utc": "2026-02-17 16:04:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5vwkyd",
              "author": "yyxg",
              "text": "Fact's",
              "score": 3,
              "created_utc": "2026-02-17 16:07:18",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o5vx5wc",
              "author": "Key_Question5584",
              "text": "Exactly.  \nBlogging is still a good source of passive income, but it takes time.",
              "score": 2,
              "created_utc": "2026-02-17 16:10:09",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5x7iy7",
                  "author": "zetabyte00",
                  "text": "When did you begin to blog?",
                  "score": 2,
                  "created_utc": "2026-02-17 19:51:30",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o61y3kv",
              "author": "el_duderino2112",
              "text": "Preach! I blog because I like to. If I get traffic, cool. I have actually seen a decent uptick in my traffic and I never have blasted it out on social media or anything. If it ever gets to the point I decide to monetize it, cool. If not, also cool because I know my blog is out there helping or entertaining others.",
              "score": 1,
              "created_utc": "2026-02-18 13:58:21",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5w3u06",
          "author": "acapkenobi",
          "text": "Solid advice, especially the part about having a primary income first. The bloggers who burn out fastest are usually the ones who NEED it to work financially from day one. That pressure kills creativity fast.\n\nOne thing I'd add, detach your self-worth from your analytics. Early on, write like nobody's reading. Because honestly, nobody is yet. And that's fine. The archive you're building now is what compounds later.\n\nThe strategy part is real too. Randomly publishing and hoping for the best is just journaling with extra steps. You need a system.",
          "score": 5,
          "created_utc": "2026-02-17 16:44:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5wbrjo",
          "author": "Confident-Tank-899",
          "text": "You're right that proof of concept matters more than traffic numbers early on. The real trick is choosing a niche small enough that you can actually win it. Don't try to be everything to everyone.Pick 100 people you want to reach and make content for them specifically. If you nail that, the rest comes naturally.",
          "score": 3,
          "created_utc": "2026-02-17 17:23:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5x8kwr",
          "author": "Numerous_Display_531",
          "text": "This is like any creative venture\n\nIn order to pursue it for the long term and increase chances of success, you really need to love doing it. It has to be something you truly enjoy because if not then you will likely get outpaced by someone who does love it\n\nI am not a huge fan of writing my own blog posts so I automated it but i think if you intend of writing it yourself then it really needs to be something you love ",
          "score": 2,
          "created_utc": "2026-02-17 19:56:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5y5plc",
          "author": "OrganicClicks",
          "text": "The income stability part is key. Hard to write good content when you're panicking about traffic every day, and this applies for most bloggers who are just starting.",
          "score": 2,
          "created_utc": "2026-02-17 22:34:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ygiih",
          "author": "Responsible-Sun8996",
          "text": "Blogging if you want to make money requires targeted marketing atrategies....you have to possess the skillset required to make money \n\nIn most cases, you need to buy backlinks, even major corporations aren't giving them away....because its a revenue stream to possess them\n\nAnd anyone serious is gonna drop a few thousand to start but much more likely to have success by. having $10,000 for backlinks\n\nI mean buying from major companies, you cqnt get hit doing this....its a revenue stream for some of the biggest companies\n\nI remember doing email outreach and most said sure, then told me the price......even if you are cutting edge and know what ppl want before they know they want it\n\nYou set up in this space....almost no competition, you know this is going to blow up and it does....you hopefully have the skillsset to sell properly \n\nBut because of the tools available....ppl with thw links, they will notice because they're looking foe stuff like this \n\nThey'll do some research, likely take your hard work and change it a bit and it wont be long before they start making the money that you worked for\n\nWHAT 'REQUIRED FOR YOU TO GET PAID FROM YOUR WEBSITE (A MOST BASIC UNDERSTANDING)\nYour job is to put the things ppl want in front of them.....\n\nNobody else is buying, 1 wrong move and and a campaign wont nake money...not understanding who your target audience, not understanding what they need or want, ideally you sell them a fix to a problem\n\nYOU MUST UNDERSTAND YOUR USER'S INTENT BY WHAT THEYRE SEARCHING FOR\nNow you have to have the marketing knowledge & be able to write copy that is decent at least\nA lot matters, like your copy might be placed wrong....\n\nGoogle ads not only does the targeting...after the keywords...you do the research use a keyword tool like semrush...or whatever,  one thats accurate .....you choose the right keywords based on price of click & have to do all the research...competitor, product, market, customer,  etc\n\nWhen you have the keywords, Google will do the rest & thats the cheapest & easiest way to get the right traffic for what your campaign is for \n\nYou have to know a lot but its cheaper than spending $50,000 on backlinks or it should be if you kniw what youre doing \n\nYour building an email list....use your website go provide true value for free...this will earn. You trust....dont ever betray that trust.....that trust can be elevated into sales and when you give them what tney want and need.......and care about what yoh sell them becuase it directly benefits you bevause them yhey trust you more....now recommendations matter and youre making money now without creating. Ads....\n\nCreate other campaigns\nBlogging is selling products if you want money \n.",
          "score": 2,
          "created_utc": "2026-02-17 23:32:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ygis4",
          "author": "100_days_away_blog",
          "text": "I feel like what worked for me was realizing why I am blogging in the first place. If it’s for money then that is going to be tough in this day and age (but not impossible). I’d rather have a blog that is useful for people and also a way that I can document my families travels then make a few dollars on the site.",
          "score": 2,
          "created_utc": "2026-02-17 23:32:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5zvdco",
          "author": "Existing-Cod5443",
          "text": "Start with passon then you don't have any worries. Whenever we start blogging for passion, then we don't care about money",
          "score": 2,
          "created_utc": "2026-02-18 04:16:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o60i4h7",
          "author": "Arvind3887",
          "text": "Blogging without obsessing over short-term results is the mindset most beginners miss. Consistency, patience, and a proven strategy always win in the long run. Having a stable primary income definitely removes pressure and helps you focus on quality content, proper keyword research, and long-term SEO growth. Follow one clear strategy, execute it consistently, and results will come.",
          "score": 2,
          "created_utc": "2026-02-18 07:11:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o60kmwx",
          "author": "madhuforcontent",
          "text": "Publish quality blog posts consistently within your niche based on target audience needs or keyword research and stick to long term. Keep watching analytics data to refine your content strategies. Begin with what you want from your blog and plan accordingly. ",
          "score": 2,
          "created_utc": "2026-02-18 07:34:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5wgqsj",
          "author": "Confident-Tank-899",
          "text": "This is solid advice. The financial independence part is key - trying to monetize from day one adds so much pressure. I'd add learning from mentors is easier when you pick someone whose content style naturally resonates with you rather than blindly following \"the best\" blogger. Vibe matters.",
          "score": 1,
          "created_utc": "2026-02-17 17:47:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5wpnuv",
          "author": "easyedy",
          "text": "It's a good feeling to blog and get traffic and comments. It's an acknowledgement of the good work, and passive income will come automatically.\n\nHowever, I'm having a hard time with Google right now. I've lost a lot of traffic from Google. I hope it is temporary.",
          "score": 1,
          "created_utc": "2026-02-17 18:28:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5wptec",
          "author": "Spirited_Manager_831",
          "text": "Go for quality over quantity every time. ",
          "score": 1,
          "created_utc": "2026-02-17 18:29:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5zef1t",
          "author": "EmmaTheFemma94",
          "text": "If you gonna compare result at least do compare year vs year, or even longer.\n\nI think a big problem nowadays is people just checking like day/week/month and think they are doing bad.\n\n",
          "score": 1,
          "created_utc": "2026-02-18 02:34:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o62jzqw",
          "author": "OfficialLAB",
          "text": "I started 10 different blogs and I’m testing some [ai article generators](https://www.blogbuster.so) out like BlogBuster and others. I’m still testing but I will make a huge post when I’m done. The results are crazy.",
          "score": 1,
          "created_utc": "2026-02-18 15:45:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ipnlj",
          "author": "Extra_Reeaach",
          "text": "Yeah, blog for the love of it first. Tbh, Ahrefs data shows the top 10% of blog posts snag 80% of organic traffic after month 6 anyway, so obsessing over day-1 results just kills your vibe. Write solid stuff, optimize lightly, and let SEO compound.",
          "score": 1,
          "created_utc": "2026-02-21 00:15:14",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rbu9po",
      "title": "My soaring traffic is finally here and I'm a bit at a loss!",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1rbu9po/my_soaring_traffic_is_finally_here_and_im_a_bit/",
      "author": "Thatwitchyladyyy",
      "created_utc": "2026-02-22 19:00:32",
      "score": 18,
      "num_comments": 39,
      "upvote_ratio": 1.0,
      "text": "Hi everyone! I am looking for tips on how to capitalize on my blog getting tons and tons of traffic. I wish I could say it's all due to my hard work, but I have only handful of quality posts and the topic I write on has become seemingly popular overnight. I've written about my blog before--it's basically on a celebrity and there's only 2 active blogs (including mine) dedicated solely to this celebrity. My traffic has gone from 15-20 per day to 400-600 over night. I don't want to miss my chance to capitalize on this!\n\nHere's my plan but I'd love to hear some real tips:\n\n\\- Immediately stop all my other side hustles and bring them down to a minimum and treat this blog like a full-time job. I do have what I'd call passive income-adjacent income. More or less, I can scale my main business down and still make money for less work because of the work I've already put in.\n\n\\- Build a guide off of an old post and capture more emails. I currently have about 30 emails captured.\n\n\\- Focus on building my blog and YouTube channel up to reach monetization ASAP\n\n\\- Immediately begin posting at least once a day\n\n\\- Push to get to 50k sessions in 30 days so I can potentially qualify for a network like mediavine. Currently, I am in no networks for this blog.\n\nWhat else would you do? I don't want to divide my attention too much. My Instagram and Pinterest are also growing, but I have problems when I try to do too much all at once.",
      "is_original_content": false,
      "link_flair_text": "Tips/Info",
      "permalink": "https://reddit.com/r/Blogging/comments/1rbu9po/my_soaring_traffic_is_finally_here_and_im_a_bit/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o6u430o",
          "author": "OldConstant182",
          "text": "Mediavine is now $5k yearly requirement but Raptive is 25,000 page views \n\nSo if momentum continues, you’ll qualify for Raptive sooner than later",
          "score": 6,
          "created_utc": "2026-02-22 20:39:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6u62u6",
              "author": "Thatwitchyladyyy",
              "text": "I saw that $5k thing--how do they quantify that? Like if you start on Raptive and make $5k, then you can qualify for Mediavine once you hit that and 50k sessions?\n\nThank you for the info, I'll shoot for Raptive First!",
              "score": 2,
              "created_utc": "2026-02-22 20:49:46",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6ud0s3",
                  "author": "OldConstant182",
                  "text": "One way would be that Journey tool they have if you’re on there (10k minimum sessions I think). May will recommend going on Journey to make more money, but as a web designer / UX guy I’d advise against it.\n\nWith Raptive they ask to link your GA so they can verify things, I’m assuming Mediavina is the same if you’re doing Adsense.\n\nI managed to meet the requirements for Raptive after 1 month of going live (on track for 30,000 views this month) but my domain is only 2 months old so they told me to wait until it’s 6 months. \n\nGood luck OP! Keep up with the content",
                  "score": 1,
                  "created_utc": "2026-02-22 21:24:40",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o6xx866",
                  "author": "Weekly-Afternoon-395",
                  "text": "Are you writing about Diddy?",
                  "score": 1,
                  "created_utc": "2026-02-23 12:39:02",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6v5ou4",
          "author": "ActuaryMean6433",
          "text": "If you haven’t applied for AdSense, you could try that. It’s not the best but it’s something. You can reapply if rejected, just add more content and try again.",
          "score": 1,
          "created_utc": "2026-02-22 23:59:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6vp1xl",
              "author": "Thatwitchyladyyy",
              "text": "AdSense is always so cringe, though. My blog is more or less fashion, lifestyle and history and Adsense is like...hey do you want to lose 20 lbs in a month?!",
              "score": 2,
              "created_utc": "2026-02-23 01:52:40",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6vsto2",
                  "author": "ActuaryMean6433",
                  "text": "You’ll find every ad network is cringe and runs ads like that.",
                  "score": 4,
                  "created_utc": "2026-02-23 02:15:23",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6vg805",
          "author": "meiggs",
          "text": "Definitely try and monetize it! Can I see the URL?",
          "score": 1,
          "created_utc": "2026-02-23 00:59:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6vpavr",
              "author": "Thatwitchyladyyy",
              "text": "I don't wanna dox myself. I'll just say it's an evergreen celebrity who is recently back in the spotlight. ",
              "score": 1,
              "created_utc": "2026-02-23 01:54:10",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6w1hzg",
                  "author": "meiggs",
                  "text": "My job is affiliate marketing, feel free to DM me if you wanna explore monetization. I've been in affiliate marketing for 10+ years for blogs.",
                  "score": 2,
                  "created_utc": "2026-02-23 03:08:33",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6wsy27",
          "author": "LordCryptoSparrow",
          "text": "Any chance I could get access to the blog?",
          "score": 1,
          "created_utc": "2026-02-23 06:31:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6xvq1w",
              "author": "Thatwitchyladyyy",
              "text": "No, I don't like personal info on Reddit. I need help but I don't really want to share it. I'm also a very bad blogger, I'm getting traction like this off of a handful of posts, I wish I had written more. ",
              "score": 1,
              "created_utc": "2026-02-23 12:28:02",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6xvshl",
                  "author": "LordCryptoSparrow",
                  "text": "Fair enough, had to ask😄",
                  "score": 1,
                  "created_utc": "2026-02-23 12:28:33",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6wunl2",
          "author": "Holiday-Oil2598",
          "text": "Forget the ads. Rpms are the worst they have ever been and they just make your site look crap anyway. You could look at affiliate programs, but instead take a beat and think about your readers. Why are they there, what are they interested in, what can you offer them. Does a subscription to special content or live updates make sense? Etc. Each page has potentially its own value proposition. Don’t follow everyone else’s money guidelines, make your own, and you will do better",
          "score": 1,
          "created_utc": "2026-02-23 06:46:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6xvkdc",
              "author": "Thatwitchyladyyy",
              "text": "Thank you, it's been like 10+ years since I've been in the position to make money off content. I'm going to focus on building my email list and increasing traffic organically with more posts for now. ",
              "score": 1,
              "created_utc": "2026-02-23 12:26:53",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6xz37j",
                  "author": "Holiday-Oil2598",
                  "text": "Beware of the more posts trap. More does not equal more traffic. EdwardS did a podcast recently showing a major site tanking despite tons of new posts. Authority won’t carry you if you’re missing the mark. Be careful, post in the same grouping as what’s already doing well, if you have great traffic then bed down the basics now.",
                  "score": 1,
                  "created_utc": "2026-02-23 12:51:51",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6v38y8",
          "author": "Fuzzy_Possibility",
          "text": "Use your Google analytics to tell you where, how and why you are getting traffic and then build from that. What keywords are pulling them in. \n\nIf people are searching for that celebrities looks can you monetise via affiliates to brands could even be replicating the looks etc… (or anything else you maybe about to affiliate).",
          "score": 0,
          "created_utc": "2026-02-22 23:45:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6vp7fi",
              "author": "Thatwitchyladyyy",
              "text": "Yeah, I can see some of my posts going wild this month, I only have 6. I'm an idiot for not building more faster, but I'm also a full-time mom and work for myself part-time doing another business. Now the traffic is here and I have to drop everything lol",
              "score": 2,
              "created_utc": "2026-02-23 01:53:35",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6vrca1",
                  "author": "Fuzzy_Possibility",
                  "text": "You got this! Try not to think about what you should have done as that’s not going to help, but what you can do now. \n\nIt might be worth looking into adding a newsletter sign up as well you don’t need to do a newsletter this second but getting that data is a good start and if you go with Journey you can set it so they send out a round up once a week as long as you’ve posted something (I’ve not been able to face writing newsletters for the past year so I just have that turned on at some point I’ll go back to doing it myself but it’s a place holder 🤣)",
                  "score": 1,
                  "created_utc": "2026-02-23 02:06:22",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1r8psq0",
      "title": "Best ad network for small publishers? 8k Traffic",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1r8psq0/best_ad_network_for_small_publishers_8k_traffic/",
      "author": "Sushant098123",
      "created_utc": "2026-02-19 04:38:09",
      "score": 13,
      "num_comments": 24,
      "upvote_ratio": 0.84,
      "text": "Hi I'm a Software Engineer. In my free time I write technical blogs. About 60% of my traffic is from tier 1 countries. I used to blog on substack but now shifted to my own solution.\n\nI get around 8k traffic per month.\n\nI applied for Journey By Mediavine byt my application is still under process.\n\nIs there any other ad network that can accept me?",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/Blogging/comments/1r8psq0/best_ad_network_for_small_publishers_8k_traffic/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o6756uf",
          "author": "Confident-Tank-899",
          "text": "At 8k traffic, adsense is rough honestly. The CPMs are terrible at that volume. Mediavine needs 50k sessions minimum so you're right to look for alternatives.\n\n\n\nWhat's worked better for me at your traffic level: focus on growing content output and quality first. The real unlock is having runable production systems so you can publish 3-4x more content without burning out.\n\n\n\nFor monetization right now - Ezoic might accept you, but affiliate links on relevant product posts will probably earn more than any ad network at 8k. Direct sponsorships too if you have a specific niche.",
          "score": 4,
          "created_utc": "2026-02-19 06:11:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6w4mt6",
              "author": "Affectionate_Arm2030",
              "text": "Mediavine has new requirements, doesn't do the traffic threshold anymore (well, apart from Journey). Here's their article that talks more about that   \n[https://help.mediavine.com/programs-and-the-publisher-path-to-growth](https://help.mediavine.com/programs-and-the-publisher-path-to-growth) ",
              "score": 1,
              "created_utc": "2026-02-23 03:28:51",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o679dof",
          "author": "Reasonable_Lab136",
          "text": "At 8k monthly with 60% tier 1 traffic, you're in a decent spot. A few options while you wait for Mediavine:\n\n- **Ezoic** — no minimum traffic requirement anymore, and they work well with tech blogs. Worth trying even at 8k.\n- **Monumetric** — accepts sites at 10k+ pageviews, so you're close. They pay better than AdSense.\n- **Google AdSense** — easy to get accepted but the RPM is low. Still better than nothing while you wait.\n\nHonestly at 8k I'd stick with AdSense for now and focus on scaling content to hit 50k sessions. That's where Mediavine becomes worth it and the real money starts. Journey by Mediavine has lower requirements but the RPM is also lower.\n\nWith technical blogs and tier 1 traffic, your RPM should be solid once you get on a premium network. Just need more volume.",
          "score": 5,
          "created_utc": "2026-02-19 06:47:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6b7r90",
              "author": "darkestone7",
              "text": "They just changed that:  [https://finance.yahoo.com/news/ezoic-raises-bar-250k-js-134500268.html](https://finance.yahoo.com/news/ezoic-raises-bar-250k-js-134500268.html)\n\nNow they have 250k/month requirement ",
              "score": 3,
              "created_utc": "2026-02-19 21:17:24",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6dnjop",
                  "author": "Reasonable_Lab136",
                  "text": "Oh damn, thanks for the update! That’s a huge change — basically puts Ezoic out of reach for small publishers now. So scratch that option from my list.\nThat leaves Monumetric (10k+) and Google AdSense as the realistic starting points at 8k. Or Journey by Mediavine if they can get in — lower RPM but still better than AdSense in most cases.\nAppreciate the heads up! 👍",
                  "score": 3,
                  "created_utc": "2026-02-20 06:22:27",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o66zkor",
          "author": "omdanu",
          "text": "adsense, but cpc is pretty bad. Prefer wait for mediavine or add affiliate links on your article post.",
          "score": 3,
          "created_utc": "2026-02-19 05:27:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6g807c",
          "author": "RandyRouter",
          "text": "First, how do you measure your website traffic? With 8k monthly traffic and 60% of it from tier 1 countries, you’ve got a solid foundation for monetization. Since you’re waiting on Mediavine, here are a few other ad networks that could be a good fit for smaller publishers like you:\n\n* Adsense - While AdSense can be a good starting point, the eCPM (earnings per 1,000 impressions) might be lower compared to other premium networks.\n* AdThrive - Similar to Mediavine, they accept publishers with 8k+ traffic but often prioritize sites with good content and high-quality traffic. If you’re denied by Mediavine, AdThrive could be a good alternative.\n* Ezoic - Great for small to medium-sized publishers. Ezoic uses AI to optimize ad placements and can be more flexible with traffic requirements.\n* Monumetric - They have a relatively low traffic threshold (usually around 10k) and offer a more personalized service, which could be helpful for a tech blog.\n* Sovrn // Commerce - If you’re open to affiliate ads alongside display ads, Sovrn offers a good combination for smaller sites.\n* Media .net - A solid choice for contextual ads, especially for sites with content targeted to an audience in tier 1 countries.\n* PropellerAds - They accept smaller traffic volumes and are known for display ads, pop-unders, and native ads.\n* Adversal - They accept publishers with smaller traffic volumes and could provide a good balance of display ads.\n\nKeep in mind, you might also want to experiment with affiliate marketing (like Amazon Associates or Impact Radius) to supplement your income if ad networks are slow to take off.",
          "score": 3,
          "created_utc": "2026-02-20 16:50:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o678g0g",
          "author": "shajid-dev",
          "text": "Hey, I also wanted to see whether you get accepted by journey, I also have a similar blog.",
          "score": 2,
          "created_utc": "2026-02-19 06:39:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6dnsti",
              "author": "Sushant098123",
              "text": "Lets see.",
              "score": 2,
              "created_utc": "2026-02-20 06:24:39",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o67wc80",
          "author": "spk100",
          "text": "Adsense is by far the best. I have tried numerous programs over the year but revenue is nothing like Adsense. ",
          "score": 2,
          "created_utc": "2026-02-19 10:24:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o68603m",
          "author": "Vinaya_Ghimire",
          "text": "Ads like Mediavine or Ezoic are said to have high paying rates but they also have higher traffic requirements for approval. If you have tier one traffic,you can try media.net. It pays well. You can also try Infolinks. Last but not least try Adsense",
          "score": 2,
          "created_utc": "2026-02-19 11:48:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6985i0",
          "author": "Lola_Jay_Yum",
          "text": "Just wait for Journey. The pay is good and you automatically graduate to mediavine when you hit a certain payout threshold. \n\nDo not do Adsense. Not worth it. Can’t speak for any others.",
          "score": 2,
          "created_utc": "2026-02-19 15:33:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6byqn9",
          "author": "Interesting-Cow-9177",
          "text": "Mediavine used to be 50k sessions but I understand they recently removed this entry requirement and instead changed it to a much harder requirement of £5000 ad revenue has to have been earned over the last 12 months.",
          "score": 2,
          "created_utc": "2026-02-19 23:40:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6co63t",
          "author": "Disastrous-Fix226",
          "text": "Adsense",
          "score": 2,
          "created_utc": "2026-02-20 02:12:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6fjh8o",
          "author": "ehochber",
          "text": "From this post, it sounds like your site would be a perfect fit for Journey. I'm going to ping the team to see why your application got stuck in processing. It should normally take a week or less to get accepted! ",
          "score": 2,
          "created_utc": "2026-02-20 14:56:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6dtxx8",
          "author": "Upstairs-Kitchen5981",
          "text": "I was with Monumetric. They are good. Though I quit on ads recently. ",
          "score": 1,
          "created_utc": "2026-02-20 07:20:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6gu1vw",
          "author": "Dear_Payment_7008",
          "text": "I just started using [TinyAdz](https://www.tinyadz.com/?ref=michael) Everything is easy to setup.",
          "score": 1,
          "created_utc": "2026-02-20 18:31:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6krld7",
          "author": "Extra_Reeaach",
          "text": "Tbh, for blogging SEO that actually moves the needle, nail topical clusters—aim for 15-25 interlinked posts per pillar topic to hit that authority sweet spot Google loves now. I picked up that gem at SEO Mastery Summit in HCMC last year during Koray Gübür's workshop, where he broke down how it boosted one site's traffic 4x in 6 months. Smaller events like that (400 folks) beat big ones for real takeaways and chats with speakers.",
          "score": 1,
          "created_utc": "2026-02-21 09:34:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6mk7ba",
          "author": "foundersuman",
          "text": "Go for ezoic. The best money making machine",
          "score": 1,
          "created_utc": "2026-02-21 16:54:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o67l728",
          "author": "Haunting_Ad_9013",
          "text": "Mediavine journey accepts sites starting from 1k traffic. The only issue is that the minimum payout is $100 so its gonna take a few months of earning to reach that threshold  \n  \nBut if i were you, id wait until i was at 10k then apply to Monumetric. Its way better than ezoic and has a minimum payout of only $10 so you are gonna get paid every month even with just 10k traffic. ",
          "score": 1,
          "created_utc": "2026-02-19 08:35:26",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r97tj9",
      "title": "Ezoic raises minimum eligibility requirements to 250k users / mo",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1r97tj9/ezoic_raises_minimum_eligibility_requirements_to/",
      "author": "Icy-Papaya-2967",
      "created_utc": "2026-02-19 18:53:40",
      "score": 11,
      "num_comments": 14,
      "upvote_ratio": 1.0,
      "text": "Unlike what other major ad companies like Mediavine and Raptive are doing by lowering their eligibility requirements for page views/ sessions, Ezoic is moving in the opposite direction, having just increased the barrier of entry to [250k users per month](https://finance.yahoo.com/news/ezoic-raises-bar-250k-js-134500268.html). \n\nI was personally never a big fan, since they slowed down my site and filled it with ads destroying the user experience, increasing my bounce rates, and lowering my rank over time in the SERPs. And now seeing this news from them feels like a joke to me.",
      "is_original_content": false,
      "link_flair_text": "Tips/Info",
      "permalink": "https://reddit.com/r/Blogging/comments/1r97tj9/ezoic_raises_minimum_eligibility_requirements_to/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o6cydcl",
          "author": "mrmicroadk",
          "text": "Ezoic and Mediavine both taking big L's and Raptive capitalizing on it. What a start to 2026",
          "score": 4,
          "created_utc": "2026-02-20 03:15:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6cyzdw",
              "author": "Icy-Papaya-2967",
              "text": "Wonder how long that will last lol",
              "score": 2,
              "created_utc": "2026-02-20 03:19:44",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6d5230",
                  "author": "mrmicroadk",
                  "text": "Mediavine might barely make it work but I don't think Ezoic will. Because Mediavine and Raptive pays 5-6X of what Ezoic pays and requires less traffic requirements to join.",
                  "score": 5,
                  "created_utc": "2026-02-20 03:59:42",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6i0a65",
          "author": "dezignmywebsite",
          "text": "I will say, after installing their javascript code it's been better. Before, you had to point to their nameservers. Also, i'm starting to see EPMV's go up, so I wonder if this is going to help us bloggers that are grandfathered in.",
          "score": 3,
          "created_utc": "2026-02-20 21:55:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6eg3km",
          "author": "Sypheix",
          "text": "To be fair to these companies, they are getting hit from all angles and bleeding revenue.  I suspect Ezoic is trying to trim the fat on headcount so they can focus on larger publishers.  It's likely a strategy to save the company.  It's quite possible that none of these three companies exist in a few years. ",
          "score": 2,
          "created_utc": "2026-02-20 10:46:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6bziay",
          "author": "Southern_Control6820",
          "text": "Até onde sei, é possível editar a mostragem de anúncios do Ezoic na sua página. Evitando que muitos anúncios sejam exibidos e acabem assim atrapalhando a experiência de usuário.",
          "score": 1,
          "created_utc": "2026-02-19 23:45:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ixjxp",
          "author": "MrCastIronCooks",
          "text": "What are our options, though, as smaller bloggers? Adsense only?",
          "score": 1,
          "created_utc": "2026-02-21 01:01:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6j5xgy",
              "author": "Icy-Papaya-2967",
              "text": "Adsense is by far best for small publishers, though if you qualify for journey by mv, I’d say it delivers a superior return balancing UX for the most part. Now if you have 25k plus views per month, go for Raptive Rise- can’t go wrong with that.",
              "score": 1,
              "created_utc": "2026-02-21 01:53:55",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6lrfcy",
                  "author": "MrCastIronCooks",
                  "text": "One thing I do like about Ezoic is the ability to earn revenue from my YouTube videos. I don’t think AdSense has that, but not sure.",
                  "score": 1,
                  "created_utc": "2026-02-21 14:23:37",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6shjf8",
          "author": "Key_Switch6028",
          "text": "Good feedback on ezoic i am exploring ad partners now",
          "score": 1,
          "created_utc": "2026-02-22 16:04:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6w9zzl",
          "author": "thepublisherindex",
          "text": "I think this a sensible move but a little too late for Ezoic.\n\nThey have far too many low quality sites with low traffic compared to Raptive and Mediavine. They need a proper culling.\n\nAs an advertiser you would naturally choose to go direct to the others other Ezoic for this exact reason.",
          "score": 0,
          "created_utc": "2026-02-23 04:04:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6wb4q6",
              "author": "Icy-Papaya-2967",
              "text": "Woah- looks like your first comment. What exactly do you do?",
              "score": 1,
              "created_utc": "2026-02-23 04:12:34",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1rcltzi",
      "title": "From Mediavine Journey to Mediavine",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1rcltzi/from_mediavine_journey_to_mediavine/",
      "author": "ceomds",
      "created_utc": "2026-02-23 16:19:26",
      "score": 9,
      "num_comments": 2,
      "upvote_ratio": 0.84,
      "text": "Hello everyone,\n\nMy wife has a blog for some years and she was on mediavine journey since end of 2024.\n\nHer blog was hit by famous Google search update in 2024 and it seems that (knock on the wood), she is not impacted by 2025 google search updates and she is today around 81% increase compared to previous year period with around 36-40k views (65% france, %15 USA and rest from canada/uk/Singapour etc).\n\nEnd of 2025 mediavine contacted her( even though she didn't have 5k revenue nor 50k sessions), they asked her if she wants to graduate her blog to Mediavine. Now we are at the end, finalizing couple of last steps to go live.\n\nI tried to check and didn't see many people that had this. therefore, i am wondering if anyone moved from journey to mediavine and did it get better than journey and how long did it take for it to really stabilize etc?\n\nThanks a lot,",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/Blogging/comments/1rcltzi/from_mediavine_journey_to_mediavine/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o7041kl",
          "author": "Holiday-Oil2598",
          "text": "Would love to know if it’s worth it in the end. Ad revenue is the worst it’s ever been",
          "score": 2,
          "created_utc": "2026-02-23 19:15:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o73j95w",
          "author": "Lola_Jay_Yum",
          "text": "I graduated from journey to mediavine in December. The RPMs didn’t get negatively impacted. Didn’t even feel like there was an adjustment period. \n\nEarnings haven’t been great in January / February but that’s normal for this time of year. Apart from better earnings, you get direct support and a lot more control over ads etc. overall a better experience.",
          "score": 1,
          "created_utc": "2026-02-24 07:17:49",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r9t900",
      "title": "How Do You Write About Highly Technical Topics Without Losing Readers?",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1r9t900/how_do_you_write_about_highly_technical_topics/",
      "author": "Unique_Inevitable_27",
      "created_utc": "2026-02-20 11:47:27",
      "score": 6,
      "num_comments": 13,
      "upvote_ratio": 0.87,
      "text": "I’ve been experimenting with writing about technical subjects lately, specifically something like Windows patch management, and it’s harder than I expected.\n\nThe challenge isn’t understanding the topic. It’s explaining it in a way that doesn’t feel like documentation. Terms like vulnerability, patch cycles, compliance, and update rollouts can easily turn into dry paragraphs if you’re not careful.\n\nWhat helped me was shifting the focus from definitions to real-world impact. Instead of just explaining what patch management is, I tried framing it around everyday consequences like delayed updates, system instability, and security exposure.\n\nFor bloggers who write in technical or B2B niches:\n\n* How do you keep complex topics readable?\n* Do you prioritize storytelling, structure, or simplicity?\n* How technical is too technical for a general audience?\n\nFor background, I recently blogged on [Windows patch management](https://blog.scalefusion.com/what-is-windows-patch-management/?utm_campaign=Scalefusion%20Promotion&utm_source=Reddit&utm_medium=social&utm_term=KD) and made an effort to make it easily accessible.",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/Blogging/comments/1r9t900/how_do_you_write_about_highly_technical_topics/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o6ensau",
          "author": "MarktMaverick",
          "text": "Integrate the use of graphics to illustrate your points.",
          "score": 2,
          "created_utc": "2026-02-20 11:50:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6er08y",
          "author": "corelabjoe",
          "text": "It is a bit wall of text like... Break that up with callout cards, infographics, tables and what I try to do is tell a bit of a story.\n\nKind of explaining why they should bother and how it benefits them.\n\nMind you I'm not blogging for B2B mine is about selfhosting and cybersecurity.",
          "score": 2,
          "created_utc": "2026-02-20 12:13:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6fv17p",
              "author": "[deleted]",
              "text": "[removed]",
              "score": 2,
              "created_utc": "2026-02-20 15:51:30",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6g4fsu",
                  "author": "corelabjoe",
                  "text": "Holy crap, that's pretty good!!! Thanks! Very interesting product you've made there...",
                  "score": 1,
                  "created_utc": "2026-02-20 16:34:39",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6fal9v",
          "author": "RobertLigthart",
          "text": "biggest thing that helped me was writing like I'm explaining it to a smart friend who just doesnt know this specific topic. not dumbing it down, just removing the assumption that they already know the jargon\n\n  \nalso... start with the problem not the solution. nobody cares what patch management is until you explain what happens when you dont do it",
          "score": 2,
          "created_utc": "2026-02-20 14:10:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6f9b4s",
          "author": "vsurresh",
          "text": "I had a quick glance at your post and it looks like a doc from a vendor website. I think an AI can generate what you wrote. I’m a tech blogger myself and the way I write or approach content is write about the challenges that I face in real life with patch management, how to use a specific patch management app, etc. Your post seems very generic, just my two cents.​​​​​​​​​​​​​​​​",
          "score": 1,
          "created_utc": "2026-02-20 14:03:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6gj04f",
          "author": "ShapeEquivalent6388",
          "text": "One relatable analogy is your best tool.",
          "score": 1,
          "created_utc": "2026-02-20 17:41:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6gri3q",
          "author": "dwoodro",
          "text": "This depends on what the topic is. Depending on the nature of the topic, you could have additional breaker items to incorporate into the material. Textbooks are often great at this, as we know those are always such great reads. The use of tips, stories, highlights, charts, graphs, images, quotes, and other call-outs serves to control the cadence of the written piece. Use of section headings, bold text, etc, helps to control the path of the reader's eye movement. What you're trying to do is control the flow of the material, how fast or slow the reader moves through the maze, and what points you absolutely want them to retain.\n\nIt's almost an art form when done properly.",
          "score": 1,
          "created_utc": "2026-02-20 18:20:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ilrd3",
          "author": "GrowthHackerMode",
          "text": "In terms of structure, this works quite well:\n\n1. The problem to be solved (analogies fit here)\n\n2. What happens if you ignore the problem\n\n3. How it works (in a simplified manner)\n\n4. What to actually do\n\nEven if someone through this, they still walk away with key information about the topic.",
          "score": 1,
          "created_utc": "2026-02-20 23:52:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6lwv5j",
          "author": "Lonely_Mark_8719",
          "text": "Writing about technical topics without losing readers is less about “dumbing down” and more about **scaffolding knowledge**: give readers a clear entry point, then build complexity step by step.",
          "score": 1,
          "created_utc": "2026-02-21 14:54:55",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rc2tk4",
      "title": "is there a way to automate pin creation without spending hours in Canva every week",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1rc2tk4/is_there_a_way_to_automate_pin_creation_without/",
      "author": "Justin_3486",
      "created_utc": "2026-02-23 00:36:35",
      "score": 6,
      "num_comments": 14,
      "upvote_ratio": 0.88,
      "text": "food blog getting decent traffic but I'm spending 8-10 hours weekly just making pins in Canva and it's completely unsustainable I have like 200+ blog posts and need to create fresh pins for them regularly but designing each one individually is killing me tried some AI pin generators but they all look terrible, super generic and obviously AI-generated. need something that actually looks professional is there any tool that can automate pinterest pin design without making them look like garbage? or am I stuck doing this manually forever",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/Blogging/comments/1rc2tk4/is_there_a_way_to_automate_pin_creation_without/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o6vkzn3",
          "author": "ActuaryMean6433",
          "text": "Short of paying someone else to do it for you, I don’t think there really is, but I’m also not the most tech hip.  Can you try to find a way to streamline the process like templates?  Is Canva itself slowing you down?  Unfortunately, ultimately, it’s just the nature of the beast, really.",
          "score": 2,
          "created_utc": "2026-02-23 01:27:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6w9ox9",
          "author": "jarvandamere",
          "text": "Just create 3 different pins for each article and reuse them. With so many articles there will be a very long gap between pinning the same pin.",
          "score": 2,
          "created_utc": "2026-02-23 04:02:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6x9hyb",
          "author": "QuiteEarner",
          "text": "I ran into the same problem after realizing how many pins you actually need per blog post. What helped me was creating a few reusable Canva templates and just swapping the headline and image instead of designing from scratch every time. It still takes effort, but it’s much faster than starting from zero.\n\nFrom what I’ve seen, fresh pin variations matter more than perfect design, so template-based pins seem to work fine if the headline is strong.",
          "score": 2,
          "created_utc": "2026-02-23 09:08:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6xbvr2",
          "author": "ssunflow3rr",
          "text": "tailwind just released premium smartpin templates that actually look professional not like ai slop. can use your real photos and it creates designs automatically with your keywords included. been using it and went from 10 hours weekly in canva to maybe 1 hour reviewing pins",
          "score": 1,
          "created_utc": "2026-02-23 09:32:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6xc7zx",
          "author": "billarr",
          "text": "u/Justin_3486 do you follow a specific template for the designs that may help you streamline this a bit? How about posting on social media do you do it manually or you got that figured out? I'm the founder of Nuelink, a social media scheduling platform that can help with the scheduling part, either by sending the images directly from Canva to Nuelink or using our bulk upload features to upload 100 of posts at once. We have a built in automation that auto post from different blogs to social media; but uses the featured image mainly, not sure if this would help in your case? ",
          "score": 1,
          "created_utc": "2026-02-23 09:35:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6xw1ec",
          "author": "OverFlow10",
          "text": "I'm following the method (and use the product fyi) mentioned in this video: [https://youtu.be/RxMgboDOog0?si=QC7x7womKxb3nnRe](https://youtu.be/RxMgboDOog0?si=QC7x7womKxb3nnRe)\n\ngetting 50k monthly page views through pinterest that way ",
          "score": 1,
          "created_utc": "2026-02-23 12:30:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6yxeku",
          "author": "RobertLigthart",
          "text": "8-10 hours is way too much even with 200+ posts. the canva template approach others mentioned is the move but the real time saver is batching... set up 5-6 templates, then do all your pins for the week in one sitting instead of switching between writing and designing throughout the week\n\n  \nfor a food blog specifically your actual food photos are the asset. a simple template with a strong headline overlay on your own photo will outperform any fancy design. pinterest rewards fresh pins but they dont need to be complicated",
          "score": 1,
          "created_utc": "2026-02-23 15:58:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o72h7bm",
          "author": "scrtweeb",
          "text": "canva has templates which helps a bit but yeah still takes forever to customize each one",
          "score": 1,
          "created_utc": "2026-02-24 02:42:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o72jwzx",
              "author": "Justin_3486",
              "text": "even with templates im spending like 5-10 minutes per pin, adds up fast when you need dozens weekly",
              "score": 1,
              "created_utc": "2026-02-24 02:58:04",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o72ztft",
          "author": "ScrollWalker",
          "text": "Does your Blog post use original images or AI?",
          "score": 1,
          "created_utc": "2026-02-24 04:41:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o73dot8",
          "author": "Responsible-Alps152",
          "text": "I have made 50 premium Pinterest templates. Edit text, add images that's it. You can make 10 Pinterest pins within 5-10mins. I made this for my online store but don't use now. If anyone want these templates, just text here I will send it to you and it's free. If mods allows me, I can share direct download link here.",
          "score": 1,
          "created_utc": "2026-02-24 06:28:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ydpdd",
          "author": "Lisapatb",
          "text": "I use Pin Generator, a great tool to make pins right from your blog or website. You can create dozens in minutes. You can also edit and schedule them.\n\nI wrote about it here if you are interested: [https://inspiretothrive.com/pin-generator/](https://inspiretothrive.com/pin-generator/)",
          "score": 0,
          "created_utc": "2026-02-23 14:18:55",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rd4o5k",
      "title": "Blogging Sometimes Feels Lonely",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1rd4o5k/blogging_sometimes_feels_lonely/",
      "author": "bylandoo",
      "created_utc": "2026-02-24 04:02:35",
      "score": 6,
      "num_comments": 6,
      "upvote_ratio": 1.0,
      "text": "I've been blogging for a while now and I enjoy writing, but lately I've been feeling a bit lonely. You spend hours researching, writing, editing... and then you publish and everything goes silent.\n\nI don't expect to go viral or anything, but sometimes I wonder if I'm doing something wrong. I try to focus on improving my content and being consistent, but growth feels slow.\n\nWhat helped you start seeing real engagement?",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/Blogging/comments/1rd4o5k/blogging_sometimes_feels_lonely/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o72vyml",
          "author": "Impossible-Koala-368",
          "text": "I get this. I wish I could talk to my partner about my progress and excitement about my blog in a way that doesn’t sound like I’m speaking another language.",
          "score": 1,
          "created_utc": "2026-02-24 04:14:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o731csd",
          "author": "vaibh990",
          "text": "Yep, It does feel that way. The silence of initial years might lead to something fruitful later, but it's difficult to keep the motivation going.",
          "score": 1,
          "created_utc": "2026-02-24 04:51:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o73asno",
          "author": "Obvious_Jelly_8062",
          "text": "i've been blogging for a while now and i definitely know the feeling of loneliness that can come with it - sometimes it feels like i'm just writing into a void. one thing that's helped me is joining online communities of other bloggers, it's nice to be able to connect with people who understand what i'm going through. do you think it's possible to build a sense of community around a blog, or is that just not something that can be replicated online?",
          "score": 1,
          "created_utc": "2026-02-24 06:04:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o73id1j",
          "author": "TrendyIncome",
          "text": "Yeah sometimes it feel lonely but if you love the peace of working alone there is no job comparison to this. But keep in mind blogging is changing very quickly, if you completely focus on google traffic, google may vanish you. You need to focus on different traffic source like socia media",
          "score": 1,
          "created_utc": "2026-02-24 07:09:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o73n1jv",
          "author": "dwoodro",
          "text": "What are you blogging about? \n\nTopics that encourage discussion will be more likely to encourage interaction. Many times, a blog post is \"informative\", and people might just read it and move on. Other posts could be deeply moving and get others to open up. \n\nAdditional writing techniques, such as open-ended questions, cliffhangers, call-to-actions (does not have to be a paid process), etc, can be implemented to draw additional interactions. \n\nYou know what I mean? <--- sample, if I stop here it would encourage a reply.\n\nBut that's just one example, more coming....  <-- people don't like unfinished steps. \n\nMake sure you upvote the post! <-- being encouraged to take direct actions. \n\nHope this helps get the ideas flowing. Keep us posted. ",
          "score": 1,
          "created_utc": "2026-02-24 07:52:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o73t3xn",
          "author": "Used-Temperature-699",
          "text": "In initial months of new domain, it's a normal thing but how you represent your blogging is the most important thing.\n\nOrganic traffic on new blogs are often less to 0, but when you post consistently, you can see better results.\n\nTake benefit of social medial platforms to reach your targeted audience.\n\nIt will create huge difference before and after results, just implement the steps and see some traffic on your blog. ",
          "score": 1,
          "created_utc": "2026-02-24 08:49:52",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r9q6q9",
      "title": "Stuck with niche ideas, please guide!",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1r9q6q9/stuck_with_niche_ideas_please_guide/",
      "author": "Khajooor",
      "created_utc": "2026-02-20 08:47:49",
      "score": 5,
      "num_comments": 13,
      "upvote_ratio": 0.86,
      "text": "Hello, been running a blog for more than a decade now and now I'm stuck deciding a new niche.\n\nThe thing is, I love writing and being a marketer for more than 7 years and working with companies managing their content, SEO, Meta ads and all, I again want to go to writing blogs, the way I used to do.\n\nThe old blog I had has started performing average and now bad, as AI is taking over. That niche was technology and now everyone knows AI is better than reading my post.\n\nI want to start writing something about adult desires or stories. But, am confused if that is allowed on monetizing platforms? Do EU, USA, India, Singaporean, Australian law allow consuming that?\n\nUSA, India and Australia were the most traffic giving countries on my previous blog. So, I'm confused if I should take any precautions?",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/Blogging/comments/1r9q6q9/stuck_with_niche_ideas_please_guide/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o6e5t3n",
          "author": "QuiteEarner",
          "text": "I’m at the beginner stage of building my blog, and niche selection was honestly confusing for me too.\nOne thing I kept seeing repeatedly was that some niches can be harder to monetize even if they get traffic. Adult content especially seems like it has restrictions with certain ad networks and platforms, which made me personally avoid it for now.\n\nI’m trying to focus on something I can grow long term through search and platforms like Pinterest instead of choosing something that might limit monetization later.\n\nI’d be really interested to know from people with experience whether monetization was harder in certain niches compared to others.",
          "score": 2,
          "created_utc": "2026-02-20 09:11:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6e60zq",
              "author": "Khajooor",
              "text": "Thanks for sharing your view. Makes sense, working on content that would create issues in the future should not become the niche for thew new blog.",
              "score": 2,
              "created_utc": "2026-02-20 09:13:34",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6e6l47",
                  "author": "QuiteEarner",
                  "text": "Glad it helped in some way. I’ve been thinking the same, choosing something that won’t create limitations later feels safer long term.\nSince you already have experience running a blog, do you think starting in a completely new niche is better, or improving and repositioning an existing blog works better?\nI’m asking because I’m still early in the process and trying to understand what’s more sustainable.",
                  "score": 2,
                  "created_utc": "2026-02-20 09:18:56",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6lxb4x",
          "author": "Lonely_Mark_8719",
          "text": "you can create a simple spreadsheet with niche ideas, audience pain points, content angles like blog, newsletters, videos use validation metrics like search volume, reddit activity, engagement... and use tools like Runable, Mailchimp, Ahrefs, Buffer to make things easier",
          "score": 1,
          "created_utc": "2026-02-21 14:57:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6mo0s3",
              "author": "Khajooor",
              "text": "Good idea, since the inception of GenAI, I’ve stopped creating and started consuming more.\n\nWill follow your tips.",
              "score": 1,
              "created_utc": "2026-02-21 17:13:14",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6r95mk",
          "author": "zetabyte00",
          "text": "Was your old technology blog about what? Hardware, Windows ...?",
          "score": 1,
          "created_utc": "2026-02-22 11:38:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6r9l5d",
              "author": "Khajooor",
              "text": "No No, generic tech - mostly covering latest updates/news - both hardware, software, device launches and more.\n\nBut as a solopreneur, was not able to cop up with all the latest changes and eventually ended up stopping last year. Was having a full-time job, so did not give my 100%.",
              "score": 2,
              "created_utc": "2026-02-22 11:42:09",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6ra9ya",
                  "author": "zetabyte00",
                  "text": "So didn't the blog monetize, right?",
                  "score": 1,
                  "created_utc": "2026-02-22 11:48:10",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6rc2ik",
          "author": "Yougggundam",
          "text": "Just seen you do blogging in the tech space?, might have any experinces building traffic for tech sites with low domain authority trying to build traffic?\n\nEspecially towards the UK/EU market",
          "score": 1,
          "created_utc": "2026-02-22 12:03:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6rwfcq",
              "author": "Khajooor",
              "text": "Have also worked with B2B SaaS tools, so kinda yes.",
              "score": 1,
              "created_utc": "2026-02-22 14:20:30",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r7f8zo",
      "title": "Anyone facing Low Rpm or Adsense Limit?",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1r7f8zo/anyone_facing_low_rpm_or_adsense_limit/",
      "author": "Sea-Rub-7139",
      "created_utc": "2026-02-17 19:00:20",
      "score": 5,
      "num_comments": 6,
      "upvote_ratio": 1.0,
      "text": "Hey everyone,\n\nI’ve noticed a lot of publishers here mentioning two common problems lately:\n\n* Getting 20k+ monthly impressions but still earning under $1 RPM on AdSense\n* Facing AdSense ad serving limits, even when traffic seems legit\n\nI work closely with an ad network on the Google side, and our goal is honestly to help publishers who are in exactly this situation, not hard-selling anything here, just sharing info.\n\nA few things that stood out to me and might be useful to some of you:\n\n* Works well for sites/apps with 20,000+ monthly impressions\n* Helps publishers diversify demand beyond standard AdSense\n* Payments are net 21 days, same cycle as AdSense\n* Payments are made directly by Google, which adds a layer of trust\n* In many cases, this setup helps stabilize RPMs or reduce dependency when limits are applied\n\nThis isn’t a magic fix, and results depend on traffic quality, geo mix, and layout — but for some publishers, it’s been a solid alternative or backup when AdSense alone wasn’t performing or was restricted.\n\nIf you’re already doing fine with AdSense, this probably isn’t for you.  \nBut if you’re stuck or recently limited and looking for options, I’m happy to answer questions or share what’s worked for others.\n\nHope this helps someone here ",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/Blogging/comments/1r7f8zo/anyone_facing_low_rpm_or_adsense_limit/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o5wx7mw",
          "author": "biubiuf",
          "text": "Diversify with a network like Mediavine or AdThrive; they need 50k sessions/month but RPMs often hit $20+. Also, run AdSense experiments in your dashboard to test placements—Google's data can pinpoint winners. Tbh, boosting US/UK traffic via SEO usually helps more than any ad tweak alone.",
          "score": 2,
          "created_utc": "2026-02-17 19:02:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5wz15c",
          "author": "MrBilal34",
          "text": "id like to try on MA basis ",
          "score": 1,
          "created_utc": "2026-02-17 19:11:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5x1dk9",
              "author": "Sea-Rub-7139",
              "text": "Surething Brother.",
              "score": 1,
              "created_utc": "2026-02-17 19:22:37",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5x1pgk",
                  "author": "Sea-Rub-7139",
                  "text": "Sent you the message",
                  "score": 1,
                  "created_utc": "2026-02-17 19:24:11",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o679sbe",
          "author": "shajid-dev",
          "text": "IMPRESSIONS DUDE! Not sessions or views. ",
          "score": 1,
          "created_utc": "2026-02-19 06:50:37",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r7tfyb",
      "title": "I shut down my ecommerce store, accidentally built a podcast, and then had to reinvent everything again when AI showed up. Here's what I learned.",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1r7tfyb/i_shut_down_my_ecommerce_store_accidentally_built/",
      "author": "dangomaps",
      "created_utc": "2026-02-18 04:35:40",
      "score": 4,
      "num_comments": 7,
      "upvote_ratio": 0.67,
      "text": "I'll start with the embarrassing part. Eight years ago I started an ecommerce store selling print on demand maps. Posters, that kind of thing. I thought if I built it, people would come. They didn't. I worked really hard on it for a long time before I finally had to face the fact that it was costing me more than I was making. Shutting it down was genuinely difficult. Sunk cost is a real psychological trap and I fell right into it.\n\nTo drive traffic to the store I started a podcast, purely as a content strategy. I work in a pretty niche industry and there was nothing else like it out there, so I figured the transcripts alone would be good for SEO. The podcast ended up being more successful than the store ever was. So I shut the store down and leaned into the podcast instead.\n\nFor a few years I was also paying writers to produce articles for the site. Informational stuff, how-tos, that kind of content. It worked for a while. Then AI arrived and basically ate that whole category of content overnight. Watching that happen while sitting on a bunch of sunk costs in articles I'd paid for was not fun.\n\nRather than keep doubling down on something that wasn't working anymore, I made a call to stop writing articles entirely and start building interactive tools instead. In my case, web based map applications. The logic was that people engage with interactive tools in a way they just don't with written content. They share them, they link to them, and they keep coming back.\n\nThe first few were duds. I made a lot of mistakes. But I kept at it, got more systematic about keyword research, and started going after very specific terms rather than chasing volume. One of the biggest things I learned was that if you actually want to make money from programmatic advertising, the keywords that matter are not necessarily the ones with the most traffic. They're the ones where advertisers are willing to pay a premium to reach that audience. Some of my lower traffic pages make significantly more money than my higher traffic ones because of this.\n\nOnce I committed to producing these tools consistently and stopped second guessing myself, the analytics started moving in the right direction. Traffic up, ad revenue up.\n\nThen something unexpected started happening. People who were trying to rank for the same keywords started reaching out to me. Some of them just wanted to buy the map outright. Others asked if I could build something similar for their own site. I hadn't planned for any of that, it just came from ranking well for specific terms. So now alongside the ad revenue, I also do this as a service for other website owners, building these kinds of tools for them. It's become a genuine part time income stream on top of everything else, and every client has come inbound, from the work already being visible online.\n\nA few things I really wish I'd figured out earlier:\n\nMove faster. Identify what isn't working and drop it. I held on to things way too long out of a sense of obligation to the time I'd already put in.\n\nGive yourself a budget and actually use it. I was so cautious about spending money early on that I slowed myself down. Being willing to invest, whether that's in tools, in help, in experiments, speeds up the whole process of figuring out what works.\n\nOn the technical side, with AI you honestly don't need to be a developer to build things like this anymore. The unfair advantage I have is knowing where the good data lives and understanding enough about the tools to know what to ask for. That's the part that takes time to learn but it's learnable.\n\nThe plan now is to keep building, and when something gets real traction, spin it off into its own small product rather than just leaving it sitting on the site earning ad revenue. Redirect the URL, build something simple around it, see if it converts.\n\nIt's been a weird, winding road. But the thing I keep coming back to is that the moments that felt like failures at the time, shutting down the store, walking away from the content strategy I'd invested in, were the ones that actually pushed me somewhere better.",
      "is_original_content": false,
      "link_flair_text": "Progress Report",
      "permalink": "https://reddit.com/r/Blogging/comments/1r7tfyb/i_shut_down_my_ecommerce_store_accidentally_built/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o60g6j9",
          "author": "Arvind3887",
          "text": "Smart pivot. You moved from traffic-chasing to value-capturing, that’s the real game. High-intent, high-CPC keywords + utility-driven tools beat generic content every time. Also, inbound demand from rankings is the strongest validation you can get. You didn’t fail, you iterated and that’s why it’s working now.",
          "score": 2,
          "created_utc": "2026-02-18 06:54:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o60hghk",
              "author": "dangomaps",
              "text": "Thanks, I have to say it sure felt like a fail for a while. Looking back, it was absolutely the right move! ",
              "score": 1,
              "created_utc": "2026-02-18 07:05:54",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o60jjao",
                  "author": "Arvind3887",
                  "text": "👍 Sometimes the toughest phases feel like failure, but they’re just part of the pivot. The fact that you stayed the course and adapted made all the difference. Onward and upward",
                  "score": 2,
                  "created_utc": "2026-02-18 07:24:29",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o605uco",
          "author": "Ok_Ant_4058",
          "text": "Didn't expect to run into a fellow GIS goer in the Blogger section, nice!",
          "score": 1,
          "created_utc": "2026-02-18 05:29:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o60hjzg",
              "author": "dangomaps",
              "text": "Maps are the best form of content :) whats your blogging story? ",
              "score": 1,
              "created_utc": "2026-02-18 07:06:45",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o60r3t0",
                  "author": "Ok_Ant_4058",
                  "text": "I blog about football and daily life too keep it a hobby  \napart from my Masters in CS (GIS DB)",
                  "score": 1,
                  "created_utc": "2026-02-18 08:34:27",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6idpv2",
          "author": "Extra_Reeaach",
          "text": "Yeah, sunk cost killed more projects for me than bad ideas ever did. Pivoted my blogging game hard after SEO Mastery Summit in HCMC – 4 days of workshops with guys like Koray Gübür showed how topical maps slash content waste by 60% and get you ranking faster. What's your next pivot look like?",
          "score": 1,
          "created_utc": "2026-02-20 23:06:33",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r873c8",
      "title": "Backlink Strategy - could this hurt my site?",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1r873c8/backlink_strategy_could_this_hurt_my_site/",
      "author": "100_days_away_blog",
      "created_utc": "2026-02-18 16:09:05",
      "score": 3,
      "num_comments": 6,
      "upvote_ratio": 0.81,
      "text": "Hi all. \n\nI have a family travel blog that we have been running for about a year and a half, and it has seen quite a bit of traffic over the last 9 months, but it seems to have plateaued at the moment. \n\nOne area that I have struggled with is getting back links as a) I don’t really have the budget to pay for them, and b) even if I did, I really don’t know where to start. \n\nI have seen quite a few sites have done a post on their site that is called “our favourite travel bloggers” or something to that effect, where we would link out to other bloggers or travel sites. \n\nI’m hoping this might help two fold - firstly it’s quite a searched for topic so we may get some traffic to the site, but I’m hoping that by linking to others it may encourage others to link back to our site. \n\nIs this a bad strategy as I would be linking to my competitors?  \n\nWould love any other ideas people have that I could research too. \n\nThanks ",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/Blogging/comments/1r873c8/backlink_strategy_could_this_hurt_my_site/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o630no1",
          "author": "Holiday-Oil2598",
          "text": "Mmm not really worth it. If it ranks, then it’s passing page rank to all your competitors. Even if you’re okay with that, where are you hoping they will link back to? Everyone needs back links, find everyone you like that’s in the same location but targeting different things( you can’t all boost each other if you’re trying to rank the same pages) and email them asking if they want to do reciprocal back link sharing. Start a WhatsApp group or Facebook group(what I did) and invite them all to join. Then, offer to link swap on old or new posts. Just don’t overdo it. Look at abc linking",
          "score": 2,
          "created_utc": "2026-02-18 17:01:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o63644q",
          "author": "Confident-Tank-899",
          "text": "The reciprocal linking concern is real but less relevant now than it used to be. Google's pretty good at detecting and ignoring mutual link exchanges. What actually matters more:\n\n\n\n1) Link relevance - are these travel/lifestyle sites? That's good. Are they random PBN sites? Bad.\n\n2) Anchor text - if everyone links with the exact same phrase, that's a red flag\n\n3) Link growth pattern - natural spikes are fine, but a sudden burst of 100 links in a day looks artificial\n\n\n\nYour collaborative blogger approach is actually solid. Just keep it genuine - only link to sites you actually recommend, and make sure the content is relevant to your audience.",
          "score": 2,
          "created_utc": "2026-02-18 17:25:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o639dzb",
              "author": "100_days_away_blog",
              "text": "Thanks. Yes these are things that I would be doing and it would genuinely be sites that I read myself. The thing is my site is a little different in that there are really two main topics that I write about. \n\nThe first is family travel and all about taking kids out of school for a family sabbatical. This was the origins intent of the site but it’s taking time to build up that content.\n\nThe other side is more specifically around Calgary, Alberta and the Canadian Rockies where we live. Lots of hiking, activities, etc. \n\nSo I could target the local blogs but also more generic travel sites, so arguably might not actually be targeting even the same key word. \n\nThanks",
              "score": 1,
              "created_utc": "2026-02-18 17:40:52",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o68bqax",
          "author": "RestaurantGreedy6662",
          "text": "My fav backlink strategy is PR. I also dont want to pay for backlinks. So, to get quality and free backlinks, I answer journalist questions. As far as I know, there are two free platforms: HARO and MentionMatch. Basically everyday an email comes from those platforms.  In the email there are many questions/categories. You can answer that and if you answer gets picked, they publish your answer with a dofollow link sometimes.",
          "score": 2,
          "created_utc": "2026-02-19 12:30:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6hvpdt",
          "author": "Extra_Reeaach",
          "text": "Yeah with two topics silo your backlinks so each gets its own cluster with 70%+ topical relevance otherwise you're diluting authority. I heard Kyle Roof at SEO Mastery Summit say pruning just 10-15% off-topic links recovered rankings for one agency with a 35% traffic lift. HARO's great for starting that naturally.",
          "score": 1,
          "created_utc": "2026-02-20 21:32:39",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r7ejei",
      "title": "why can't I figure out Pinterest keyword research, some pins blow up and others get 3 views",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1r7ejei/why_cant_i_figure_out_pinterest_keyword_research/",
      "author": "cafefrio22",
      "created_utc": "2026-02-17 18:35:54",
      "score": 3,
      "num_comments": 9,
      "upvote_ratio": 1.0,
      "text": "this is driving me absolutely insane and I need someone to explain what I'm missing\n\nI post pins consistently, some randomly get 2000+ clicks to my blog and others literally get 8 clicks total. I cannot for the life of me figure out what makes the difference\n\nthe designs look similar, posting times are consistent, topics are related. my only guess is I'm accidentally hitting the right keywords on successful pins and completely whiffing on others??\n\nbut how do you even research Pinterest keywords? I've tried the trends tool and it shows basically nothing useful. I've seen people say to manually search terms and write down all the autocomplete suggestions but that would take literally hours\n\nam I supposed to just keep guessing until something works? this feels like throwing darts blindfolded and occasionally hitting the bullseye by pure luck",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/Blogging/comments/1r7ejei/why_cant_i_figure_out_pinterest_keyword_research/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o60jhgn",
          "author": "SuitableSwim1431",
          "text": "100% keywords, i had the exact same random results until i started using tailwinds keyword tool. shows actual search volumes and which terms have shopping intent vs informational. finally figured out what people actually type vs what i thought they searched",
          "score": 10,
          "created_utc": "2026-02-18 07:24:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5y1d3d",
          "author": "h_2575",
          "text": "I had the same frustration. Most people just use autosuggest terms from the search bar. \n\nIf you want to be more fancy. Pinterest has search volumens on idea pages. These are pages with /ideas/ in the url. Sometimes they are listed as interests pages. Try to find one when you are not logged in.\n\nThe issue is you cannot search for them. You can try Google with 'site:pinterest.com ideas keyword'\n\nHere is the thing. All 11-12 mio of these interest pages are included in their sitemap as URLs. So you can download them and put them into a database for search. \n\nFor getting search volumens into the database you most then read the HTML and take the search volumes. (Scrape). Than you can search and sort.\n\nI think there is a commercial tool for this (not mine).\n\nFrom my experience. All topics that jump into your face when you are not logged in are hot: nails, beauty, fashion, tattoo, recipes, diy, hello kitty get the highest traffic. Nails is highest with about 40mio searches a month. The shorter the keyword the more volume. But i also look for the number of keywords that include a short keywords. This is an indication how broad a topic is on Pinterest.\n\nAnother good way to find new keywords is to look at your pins when not logged in. Pinterest annotates pins after 2-3 weeks with additional keywords. If you click on them you get to the magic ideas pages with search volumes i was talking about . These annotations are the bridge from your pins to interests of people. I.e. if someone searches chicken recipes and you do chicken recipes, Pinterest knows it can show a pin from you.\n\n\nLook at your good pins when not logged in, you may discover a keyword that was assigned by Pinterest. But also if people engage or just stop scrolling with your pin visible it may signal something to Pinterests algo.\n\nJust keep going!",
          "score": 2,
          "created_utc": "2026-02-17 22:12:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o65ryvk",
              "author": "Danish-M",
              "text": "Golden nuggets! How much traffic you're getting from Pinterest?",
              "score": 1,
              "created_utc": "2026-02-19 00:55:58",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o67kluv",
                  "author": "h_2575",
                  "text": "I have stopped using it for now . Wall Art did not work. At 140k views / mo i got 75 clicks only. The reason is people look for inspiration in that niche, not for buying anything. I tried text overlays , collages... But did not work. Keywords don't always help if you are in the wrong niche. I could not find my way into nails or tattoos... So best is a niche like recipes, where there is a natural reason to click through to get the full value.",
                  "score": 2,
                  "created_utc": "2026-02-19 08:29:38",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o60q74t",
          "author": "Xev007",
          "text": "check your analytics to see if the successful ones are coming from search vs feed, that'll tell you if its a keyword thing",
          "score": 2,
          "created_utc": "2026-02-18 08:25:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o613hyp",
              "author": "cafefrio22",
              "text": "wait how do i check that, didnt know pinterest showed that breakdown",
              "score": 1,
              "created_utc": "2026-02-18 10:29:07",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o657kx8",
                  "author": "hypnot1k",
                  "text": "That's because there is no such breakdown.",
                  "score": 1,
                  "created_utc": "2026-02-18 23:03:55",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5yanu7",
          "author": "TextResponsible7825",
          "text": "Look in trend section",
          "score": 1,
          "created_utc": "2026-02-17 23:00:19",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r77oyk",
      "title": "At what point does a blog stop growing because of structure, not content quality?",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1r77oyk/at_what_point_does_a_blog_stop_growing_because_of/",
      "author": "BoringShake6404",
      "created_utc": "2026-02-17 14:37:55",
      "score": 3,
      "num_comments": 3,
      "upvote_ratio": 1.0,
      "text": "I’ve been thinking about this after reviewing a few mid-sized blogs (50–200+ posts).\n\n* Most bloggers focus on:\n* Writing better\n* Publishing consistently\n* Improving SEO basics\n\nBut after a certain point, growth seems to stall, even when content quality improves.\n\nAnd what I keep noticing isn’t “bad articles.”\n\nIt’s structural issues:\n\n* Multiple posts targeting variations of the same topic\n* Old articles that overlap but were never consolidated\n* No clear hierarchy between foundational pieces and supporting content\\\\\n* Internal links are added randomly over time instead of strategically\n\nAt that stage, publishing more doesn’t necessarily fix anything. It sometimes just increases confusion.\n\nFor bloggers who’ve crossed the 50+ post mark:\n\nHave you ever paused publishing to restructure?\n\nDid pruning/merging improve traffic more than creating new content?\n\nOr do you think structure naturally resolves itself as authority grows?\n\nCurious how others think about this phase of blogging.",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/Blogging/comments/1r77oyk/at_what_point_does_a_blog_stop_growing_because_of/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o5vmho3",
          "author": "Bor845",
          "text": "We didn’t really pause publishing to restructure, because we try not to let publishing outrun structure in the first place. We think about the site more like a library than a timeline. Posts are written to fit a role, either as a foundational piece or as supporting content, and internal links are applied consistently as part of that structure rather than added ad-hoc over time.\n\nPruning and merging absolutely helps, especially when older posts overlap or no longer serve a clear purpose. But in our experience, it’s not a silver bullet. Some older posts that look expendable may still be contributing topical context that helps define the subject as a whole. The bigger gains usually come from clarity, having a clear hierarchy so both readers and search engines know what actually matters.\n\nI don’t think structure naturally resolves itself as authority grows. If anything, authority just amplifies whatever structure is already there, good or bad. Publishing more without that backbone tends to increase confusion instead of fixing it.",
          "score": 2,
          "created_utc": "2026-02-17 15:17:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6yellj",
          "author": "Lisapatb",
          "text": "Yes, I've paused publishing new posts to clean things up first.\n\nOn Inspire To Thrive, **updating older content has helped** more than rushing out new articles. In many cases, a solid refresh (new screenshots, better headers, updated tools, clearer intent) gives quicker wins because the post already has history, links, and search visibility.\n\nI've also **pruned content** when it no longer fits. That means I've:\n\n* **Deleted very outdated posts** that didn't serve readers anymore\n* **Merged overlapping topics** so one page becomes the clear \"best answer.\"\n* **Reworked internal links** so related posts support each other\n\nAfter that cleanup, I try to publish in **pillars**. In other words, I focus on a **few core topics** (social media, blogging, SEO) and build supporting posts around those themes instead of posting random one-offs.\n\nAs for structure \"fixing itself,\" some of it improves as authority grows, but I don't count on that alone. **Old content doesn't organize itself.** If you don't prune and group it on purpose, you end up with thin pages, overlap, and confused site signals. \n\nA simple restructure, even just consolidating and building pillar clusters, keeps the site easier for both readers and search engines to understand.",
          "score": 1,
          "created_utc": "2026-02-23 14:23:48",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r8goxj",
      "title": "⚠️ Warning: Ghost(Pro) does NOT back up your site and cannot restore it. Learn from my mistake.",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1r8goxj/warning_ghostpro_does_not_back_up_your_site_and/",
      "author": "milehighcityguy303",
      "created_utc": "2026-02-18 21:57:55",
      "score": 3,
      "num_comments": 6,
      "upvote_ratio": 1.0,
      "text": "**UPDATE 2 (2/19):** I've been in touch with John directly, and the Ghost team is actively working on solutions for this right now. Really great to see how quickly they've moved on this once it was brought to their attention. Hopefully, this means better restore options and clearer backup policies for all Ghost(Pro) customers going forward.\n\n**UPDATE 1 (2/19):** Roughly 48 hours after my initial support request, John O'Nolan, the founder of Ghost, personally stepped in and restored my site. Credit where it's due, I'm grateful he made it right.\n\n\\--------------\n\nI want to save someone else from the nightmare I just went through.\n\nIf you're running a Ghost(Pro) site and assuming your data is protected because of their \"automatic backups\" messaging, think again. **Ghost(Pro) cannot and will not restore your site.**\n\n**What happened:**\n\nYesterday, a script interacting with the Ghost Admin API accidentally bulk-updated a large number of posts incorrectly. It was an honest mistake — anyone working with APIs knows these things can happen. The moment I realized what occurred, I immediately contacted Ghost support to request a restore.\n\nIt took exactly 24 hours to get a response. And when it finally came? This:\n\n>\n\nThat's it. No restore. No rollback. Nothing.\n\n**The misleading marketing:**\n\nHere's the part that really stings. Ghost has a help article titled \"Does Ghost automatically back up my data?\" that opens with:\n\n>\n\nSounds reassuring, right? But buried further down the page, they clarify that site archives are \"not provided for service continuity and are not provided as backups.\" They only provide archives if you're closing your site, migrating away, or setting up a staging environment.\n\nRead that again: **the backups they advertise are not actually backups.** They won't use them to restore your site under any circumstances. So what exactly are they backing up, and for whose benefit?\n\n**The takeaway:**\n\nIf you're on Ghost(Pro), you are on your own when it comes to disaster recovery. There is no safety net. If something goes wrong — whether it's a bad API call, a botched integration, or anything else — Ghost support will not restore your data, even though they market the platform as having \"automatic backups.\"\n\n**What you should do right now if you're on Ghost(Pro):**\n\n1. Set up your own automated backups using the Content API and Admin API\n2. Export your content regularly from Ghost Admin and store it somewhere safe\n3. Back up your images and media separately — the standard JSON export doesn't include them\n4. Do NOT assume \"we've got you covered\" means what you think it means\n\nI'm sharing this so nobody else gets blindsided. If you're evaluating Ghost(Pro) vs self-hosting, factor in that \"managed\" doesn't mean \"protected\" here. You're paying premium prices for hosting with no meaningful disaster recovery.\n\nHas anyone else run into this?",
      "is_original_content": false,
      "link_flair_text": "Tips/Info",
      "permalink": "https://reddit.com/r/Blogging/comments/1r8goxj/warning_ghostpro_does_not_back_up_your_site_and/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o65g0hd",
          "author": "gptbuilder_marc",
          "text": "That’s a rough surprise.\n\nYou expect managed hosting to mean safety nets. Then something archives at the infrastructure level and there’s no easy undo.\n\nDid you have regular exports or versioned backups running, or were you relying fully on Ghost’s internal backups?",
          "score": 1,
          "created_utc": "2026-02-18 23:49:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o67hwal",
              "author": "milehighcityguy303",
              "text": "We have a backup over 2 months old that we exported for some local testing. It is an expensive lesson to learn.",
              "score": 1,
              "created_utc": "2026-02-19 08:03:20",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o67pzv8",
                  "author": "gptbuilder_marc",
                  "text": "Yeah that’s usually how it hits. Not total wipeout. Just a backup that’s a little too old to feel safe.\n\nA lot of people assume managed hosting means rollback for everything. It usually just covers hardware or major outages. If an API call makes a change and the system thinks it was legit, there’s nothing to “fix.” It did what it was told.\n\nBulk scripts are basically production access with no seatbelt. Versioned exports stop being optional at that point.\n\nDoes this change how you’ll handle API pushes going forward? Maybe staging first before touching live?",
                  "score": 1,
                  "created_utc": "2026-02-19 09:23:08",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o67mww2",
          "author": "johnonolan",
          "text": "Hi - John from Ghost here - I'm sorry for the confusion we created in the support ticket you sent. To confirm: Your site has been restored to the point-in-time backup you requested, and I've sent you an additional copy of the backup by email. \n\nGhost(Pro) sites are backed up automatically at 3 hour intervals with 60 days retention and can be restored or exported at any time, on request.",
          "score": 1,
          "created_utc": "2026-02-19 08:52:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o67n0m9",
          "author": "johnonolan",
          "text": "Hi - John from Ghost here - I'm sorry for the confusion we created in the support ticket you sent. To confirm: Your site has been restored to the point-in-time backup you requested, and I've sent you an additional copy of the backup by email. \n\nGhost(Pro) sites are backed up automatically at 3 hour intervals with 60 days retention and can be restored or exported at any time, on request.",
          "score": 1,
          "created_utc": "2026-02-19 08:53:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o68vclj",
          "author": "Far_Move2785",
          "text": "Dang that's rough with Ghost losing your site. Total nightmare.\n\nThis might not be your exact problem but I had huge conversion issues too. Turned out most of my drop off was from in-app browsers.\n\nWhen people click ads on Instagram/Facebook/TikTok they land in those app browsers and those things are terrible for checkout. No credit card autofills, no Apple Pay, and way slower.\n\nMy conversion was 1.2% in those browsers vs 4% in Safari.\n\nFix was routing people to their real browser before checkout. Saw 15% revenue lift from same ad spend.\n\nCheck your analytics for conversion by browser. If Instagram or Facebook is way lower than Safari that's your leak.\n\nhttps://tryhoox.com handles the redirect automatically if you want to test it",
          "score": 1,
          "created_utc": "2026-02-19 14:27:28",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1ra5z0t",
      "title": "Pinterest keeps flagging my links as spam… did anyone actually fix this?",
      "subreddit": "Blogging",
      "url": "https://www.reddit.com/r/Blogging/comments/1ra5z0t/pinterest_keeps_flagging_my_links_as_spam_did/",
      "author": "AmazingPandph",
      "created_utc": "2026-02-20 20:07:01",
      "score": 3,
      "num_comments": 11,
      "upvote_ratio": 1.0,
      "text": "Hey everyone, I’m trying to figure out something really confusing happening with Pinterest and I’m wondering if others have seen the same thing.\n\nPinterest recently started blocking links on many of my older pins, especially ones that used to perform very well and drive consistent traffic.\n\nWhat’s strange is:\n\nNew pins with the same domain work normally\n\nMy account and boards are fine\n\nDomain is verified\n\nContent is original (no affiliate links, no redirects, no shorteners)\n\nThe affected pins were active for months or even years before this happened\n\nBasically, older pins that previously ranked and brought traffic suddenly have blocked URLs or stopped sending clicks, while newly published pins linking to the exact same site are not affected.\n\nSo it doesn’t look like a domain ban or account penalty.\n\nThings I already tried:\n\nappealing through Pinterest support\n\nchecking URLs and page health\n\nupdating descriptions/images\n\nreducing pinning frequency\n\nSupport replies didn’t explain anything specific.\n\nI’m trying to understand whether this is:\n\nsome kind of re-evaluation of older pins\n\nan algorithm cleanup targeting legacy content\n\nor a trust reset on older outbound links\n\nHas anyone recovered traffic on old pins after this?\n\nDid editing or recreating pins help, or is it better to just remake them completely?\n\nWould really appreciate hearing real experiences because this feels very random right now.\n\nThanks!",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/Blogging/comments/1ra5z0t/pinterest_keeps_flagging_my_links_as_spam_did/",
      "domain": "self.Blogging",
      "is_self": true,
      "comments": [
        {
          "id": "o6hkxkf",
          "author": "poorpatheticplanet",
          "text": "not sure what you’re choosing when you contact support, but don’t use “pinterest blocked my site”. use something like “create or edit pins” under “creators and creative tools” or “pins” under “profile, features and settings”. after i contacted them with my issue through support, i replied to the automatic email with the issue as well. this is the only way i got to talk to a human and have it fixed. i honestly don’t think they even look at support tickets sent through “pinterest blocked my site”. i didn’t really pay attention to the analytics so unfortunately i don’t have any insight on that",
          "score": 2,
          "created_utc": "2026-02-20 20:39:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6hlxm1",
              "author": "AmazingPandph",
              "text": "I did this, and I chose \"create or edit pins,\" and I got a response from a human. But after a couple of emails, they sent me a message saying that they sent my case to another team to review, and this appeal is closed at their end.",
              "score": 1,
              "created_utc": "2026-02-20 20:44:20",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6hnrdk",
                  "author": "poorpatheticplanet",
                  "text": "ahh i’m sorry, i don’t have any other advice then. personally i would continue to send polite emails and follow ups",
                  "score": 2,
                  "created_utc": "2026-02-20 20:53:17",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6s06rf",
          "author": "QuiteEarner",
          "text": "I haven’t dealt with this at scale yet, but I’ve seen discussions about Pinterest periodically re-evaluating older pins based on engagement decay. If the original pins lost saves or CTR over time, it might trigger a reclassification even if the domain is fine. Have you checked whether the affected pins had declining engagement before they were blocked?",
          "score": 2,
          "created_utc": "2026-02-22 14:41:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6s86wy",
              "author": "AmazingPandph",
              "text": "All the blocked links belong to the top-performing pins with the most saves and clicks.",
              "score": 1,
              "created_utc": "2026-02-22 15:22:08",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6x8zuu",
                  "author": "QuiteEarner",
                  "text": "That’s interesting. If the top-performing pins were affected, it probably isn’t engagement decay. I’ve seen people mention that Pinterest sometimes “resets” trust on older pins, especially if they’re much older compared to newer content on the same domain. Some people recovered traffic by recreating fresh pins linking to the same post instead of relying on the old ones.\n\nIt seems like Pinterest currently favors fresh pin cycles more than legacy pins, even when the older ones performed well.",
                  "score": 2,
                  "created_utc": "2026-02-23 09:03:16",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6hegfv",
          "author": "AmazingPandph",
          "text": "Extra detail: the pins worked perfectly for a long time before being blocked. Nothing changed on the website itself, which makes this even harder to understand.",
          "score": 1,
          "created_utc": "2026-02-20 20:07:27",
          "is_submitter": true,
          "replies": []
        }
      ]
    }
  ]
}