{
  "metadata": {
    "last_updated": "2026-02-13 03:16:08",
    "time_filter": "week",
    "subreddit": "Business_Ideas",
    "total_items": 20,
    "total_comments": 166,
    "file_size_bytes": 189881
  },
  "items": [
    {
      "id": "1r1osnw",
      "title": "Ending homelessness with this one",
      "subreddit": "Business_Ideas",
      "url": "https://i.redd.it/x5axizuxwsig1.jpeg",
      "author": "order-rejected",
      "created_utc": "2026-02-11 05:28:06",
      "score": 204,
      "num_comments": 34,
      "upvote_ratio": 0.84,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Idea Feedback",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1r1osnw/ending_homelessness_with_this_one/",
      "domain": "i.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "o4svhod",
          "author": "clopticrp",
          "text": "In my city, there are areas where certain homeless people \"adopt\" a corner. That is where you will find them every day, and they will keep it clean and swept. They often try to also do things to cheer passing autos, like decorate with simple art. \n\nIt touches me that they are genuinely making an effort to make the world better in the small ways that they can, with nothing of their own. \n\nNot viable as a business, however.",
          "score": 13,
          "created_utc": "2026-02-11 14:12:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4tgv85",
              "author": "mrjbelfort",
              "text": "That sounds lovely. In my city (Denver) I have the fortune of thugs standing on corners “washing” peoples windows at red lights, and then intimidating them into giving them money. \n\n\nSeems like it would be a solid gig OP",
              "score": 3,
              "created_utc": "2026-02-11 16:00:03",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o4tjhuz",
              "author": "drrrrrdeee",
              "text": "Yeah and in my area same thing on they will fight over said area. Not all the time but it definitely happens.",
              "score": 3,
              "created_utc": "2026-02-11 16:12:19",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4rv4cn",
          "author": "gridsandorchids",
          "text": "This is a joke right? Who the fuck would ever go out of their way to pay money to throw away at best a bottle or empty mcdonalds bag? Nobodies driving around with a big pile of trash ready to toss out during a few seconds at an intersection. Why wouldn't anyone just do exactly the same thing for free at a gas station?",
          "score": 13,
          "created_utc": "2026-02-11 09:51:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4s0coy",
              "author": "gg_bene",
              "text": "I'm sorry to have to agree with this. Trash cans and dumpsters are free around any town. And if you set up a govmnt-type process to pay the homeless for trash- they'll just make more trash to exploit it. Fun idea though!",
              "score": 2,
              "created_utc": "2026-02-11 10:39:02",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o4rzf35",
              "author": "order-rejected",
              "text": "You will be surprised, besides if you are ever donating to a homeless person he might as well do something to earn it. I will gladly give 2-3 bucks to a homeless man standing in a traffic light with a trash bag.",
              "score": 2,
              "created_utc": "2026-02-11 10:30:28",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4tyxqq",
                  "author": "Cburns6976",
                  "text": "As an exhomeless addict, I agree. This is a step up from flying a sign saying \"anything helps\"\n\nEncourages both people to feel better about the transaction.. at least I'm doing something.. offering a small service or convenience to encourage the person who wants to help anyways. Might be what pushes a hesitant person into throwing a dollar out there",
                  "score": 3,
                  "created_utc": "2026-02-11 17:24:27",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o4wsm5p",
                  "author": "gridsandorchids",
                  "text": "And they have to buy trash bags.",
                  "score": 1,
                  "created_utc": "2026-02-12 02:04:50",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4s1tvf",
          "author": "No_Dragonfruit_4286",
          "text": "It’s all in vain when housing is unaffordable even for working people nowadays.",
          "score": 10,
          "created_utc": "2026-02-11 10:52:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4sbg72",
          "author": "vonGlick",
          "text": "Sadly this is terrible idea. You are running into all sort of problems. \n\nFirst of all, who would pay? A city council? What if that person cross city boarders? Citizens? \n\nSecond is accountability. How do you know they are actually doing any work? You either needs monitor them or set up stations to collect garbage. So infra costs. Next how do you know if they do GOOD job? What if they pick just some trash but leave other (for example you pay for volume or you pay for weight making them prioritize certain type).\n\nLastly, cities already employ people or companies for this. So they will now pay double?",
          "score": 10,
          "created_utc": "2026-02-11 12:10:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4r2v0a",
          "author": "Urasquirrel",
          "text": "The sentiment and the idea os beautiful as a whole and you could easily get people behind it, if...\n\nPeople weren't just going to pull some garbage out of the can and put it in their bag and then take a nap.",
          "score": 5,
          "created_utc": "2026-02-11 05:34:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4r5bac",
              "author": "StonksGoUppppp",
              "text": "No the drivers are throwing their trash away in the unhoused people’s trash bags, and giving a tip for this service. Getting trash out of a trash can wouldn’t result in money.",
              "score": 5,
              "created_utc": "2026-02-11 05:54:41",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4ra5vs",
                  "author": "Urasquirrel",
                  "text": "Oomph, that's going ro turn alot of people off. Rich people don't want to deal with dangerous randos.\n\nIn Atlanta, we have water boys. \n\nIt's a lil gang of kids on 4-wheelers racing around the city.\n\nThey sell water bottles at major intersections near the interstate.\n\nLegit, you give them a few bucks and they give you water.\n\nAnd they are kids so, not much risk involved.\n\nWith adults, it doesn't work out so well.\n\nOne thing I loved when I was visiting Florida is they would employ a homeless person for next to nothing to clean the gas station, stock shelves, and clean bathrooms.",
                  "score": 6,
                  "created_utc": "2026-02-11 06:35:52",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4wmz23",
          "author": "Stoic_hawaiian808",
          "text": "My horse after surviving the suicide charge towards the beast titan",
          "score": 6,
          "created_utc": "2026-02-12 01:30:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4xoxkq",
          "author": "Copyman3081",
          "text": "What you're describing is what homeless people have done for ages. Except it's cans and liquor bottles instead of McDonald's wrappers.",
          "score": 5,
          "created_utc": "2026-02-12 05:43:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ydoq8",
          "author": "LeadWithLogic",
          "text": "Better idea - replace the homeless person with a bin that holds the bag so there are no labor costs.",
          "score": 3,
          "created_utc": "2026-02-12 09:35:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4yt9xq",
          "author": "MuhammadMatennah",
          "text": "Shelter homes for the public",
          "score": 3,
          "created_utc": "2026-02-12 11:56:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4wtd5w",
          "author": "smoky_ate_it",
          "text": "He will make them pay",
          "score": 2,
          "created_utc": "2026-02-12 02:09:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ydsow",
          "author": "Tzar_Sartor",
          "text": "Idea: vending machines in traffic lights",
          "score": 2,
          "created_utc": "2026-02-12 09:36:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o50mv4w",
          "author": "dd3mon",
          "text": "A Horse Is Not a Home.",
          "score": 2,
          "created_utc": "2026-02-12 17:45:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4t8ron",
          "author": "Poster_Nutbag207",
          "text": "I mean if you’re a homeless person trying to make slightly more by panhandling it’s a good idea I suppose? But it certainly isn’t a business and it’s insulting/idiotic to say it would “end homelessness” how much would you pay someone to throw out your coffee cup? Maybe $1 tops?",
          "score": 4,
          "created_utc": "2026-02-11 15:21:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ubw7y",
          "author": "Cleanbriefs",
          "text": "Also a lot of homeless people are not cut out for home ownership and the staggering responsibility of dealing with bills, insurance and taxes plus home maintenance. \nI am yet to see a homeless person with a sign that says “I want a home like you.”",
          "score": 2,
          "created_utc": "2026-02-11 18:24:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4wk218",
              "author": "demomagic",
              "text": "What",
              "score": 5,
              "created_utc": "2026-02-12 01:12:31",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o4zl2fq",
              "author": "deloidian",
              "text": "Saying straight shit bro",
              "score": 1,
              "created_utc": "2026-02-12 14:45:27",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4wea5k",
          "author": "Plexicity",
          "text": "Better idea, take over all the best corners and hire the panhandlers to pay you a percentage of their earnings per day for access to the spot. Hold up this sounds like something else...",
          "score": 1,
          "created_utc": "2026-02-12 00:38:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4wnfrq",
              "author": "Swimming-ln-Circles",
              "text": "Lol start a union for pan handlers",
              "score": 1,
              "created_utc": "2026-02-12 01:33:27",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o4xmt23",
              "author": "isunktheship",
              "text": "Why don't they just learn b2b sales???",
              "score": 1,
              "created_utc": "2026-02-12 05:25:54",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4ygxk3",
          "author": "DoctorNurse89",
          "text": "Schedule 1?",
          "score": 1,
          "created_utc": "2026-02-12 10:07:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4yib0o",
              "author": "PlayfulNorth3517",
              "text": "Lmaooooo, underrated reference.",
              "score": 2,
              "created_utc": "2026-02-12 10:20:06",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4r62u3",
          "author": "dhv503",
          "text": "I have heard but haven’t verified that they do this with homeless people in Japan?",
          "score": 1,
          "created_utc": "2026-02-11 06:00:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ubjed",
          "author": "Cleanbriefs",
          "text": "You just don’t know how much money pandhandlers make a day do you? Zero expenses so everything goes to their pockets. ",
          "score": -2,
          "created_utc": "2026-02-11 18:23:02",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r1upwd",
      "title": "How to start a business - An in-depth reddit guide from a successful business owner",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1r1upwd/how_to_start_a_business_an_indepth_reddit_guide/",
      "author": "dtsummery",
      "created_utc": "2026-02-11 11:18:24",
      "score": 170,
      "num_comments": 37,
      "upvote_ratio": 0.98,
      "text": "Hey everyone. Today I'm going to share with you the most important knowledge that I've accumulated from starting 9 different companies, reading 59 books on business and personal development, and most importantly successfully breaking $2,000,000 in yearly revenue.\n\nMy goal is that if even 1 person reads this and it gives them the confidence to get started I will have contributed positively to somebodies life, and that brings me joy.\n\nNow let's go.\n\n# Pick a business model \n\nThis is the easiest part to get hung up on, the way I've conquered this obstacle is by realizing I don't have to reinvent the wheel. There are thousands of profitable business models in the world and if you truly want to live the dream of financial freedom and break the chains of the 9-5 you can very simply pick one and replicate it. Remember “good artists borrow, great artists steal.”\n\n**Okay, but how do I pick one? There are so many that it's hard to choose!** Don't worry I got you, choice paralysis is real, we all get it.\n\n*Here are the 3 variables you need to be investigating and doing the math around in order to pick the right business for you.*\n\nVariable #1 **- Cost to start up AKA barrier to entry:** This variable is identified by simply imagining what would go into starting this business. *What are the costs associated with those things?* Imagine you were starting a meal prep business, you would need the right kitchen equipment, plastic containers, the food itself, and the transportation to bring it to the clients. Investigate how much these things would cost you and total it up, the number you land on is the Barrier to Entry Cost, write this down.\n\nVariable #2 **- Skills needed to be successful in this industry:** Some businesses require experts, while others can utilize high school students at minimum wage. If you are already an expert in a field it may be easier to build something you are comfortable with but it's absolutely not a requirement. Out of the 7 companies I have built I was only fluent in 1 and my most successful I knew nothing about. Figure out which skills are needed and do some thinking, do you have access to people with these skills? Can you hire people with these skills? Can you learn these skills in a day on youtube? Typically the lower the skill needed the more simple a business will be and trust me you want simple because once you start doing millions in revenue the headaches will pile up.\n\nVariable #3 **- How long will it take to get this business operational?** You would be surprised how quickly you can start *most* businesses. In a matter of 2 weeks I had people calling my phone for my biggest company and all it took were some street signs. Do some thinking on how long it will take for you to buy all the necessary equipment and get that phone to ring. Do you need a website? Do you need equipment or a product that will take months to develop or get to you? I highly recommend starting with a business model that can be operational in under a month, I say this because in order to withstand the punches that the business world will throw at you it helps to see tangible progress. When you spend 6 months in R&D it's tough to stay motivated.\n\n# Personal tips for choosing your FIRST business model\n\n1. Don't start a business where you will need to raise money to be successful, chances are if you are reading this it's not happening. The people that successfully raise money typically have rich parents or already have a track record of success. Choose a model you have close to enough cash to fund yourself. (My businesses had barrier-to-entry costs ranging from as low as 1k to as high as 22k)\n2. Choose a model that doesn't require full-time experts, these people cost a lot of money to employ and they typically don't want the risk of working with a pre-cash flow business.\n3. Choose a model that you can spin up in a couple of weeks to a month.\n\nBy now you should have a couple of assets in your head, which model you like, the things you need and how much they cost, and which skills you will need to hire for or know yourself to be successful.\n\n# NOW WHAT?\n\nNow we build.\n\nDepending on your model you will have 1 or more of the following. Google Listing and Website.\n\nGoogle listing you can make yourself but unless you're experienced in web development and digital product marketing 100% do not do this yourself, it is a colossal waste of time and it will hurt your ability to make the phone ring because it will take months and months of iterating in order for it to be halfway decent. Hire someone to build a website for you, there are services that do it for a $300 startup fee and $100 a month. DON'T BUILD YOUR OWN SITE.\n\nWith the website/google listing live we now focus on sales and in order to do that we need to make the phone ring AKA drive leads. Depending on the industry you choose these are the magic tools that will bring you money.\n\n**GOOGLE PAY PER CLICK -** I can't stress this enough, it works. 99% of industries can utilize google PPC, Meal prep? PPC, Cleaning service? PPC, E-comm? PPC, Sex toys? ALSO PPC. (I spend roughly 5k a month on PPC, it's magic.) **AVERAGE SETUP COST $800**\n\n**Facebook Ads and Instagram ads -** Known your target audience before spending money here, does your audience live on these platforms? Does your industry fit on a social media platform where people are probably watching cat videos? **AVERAGE SETUP COST $600**\n\n**Angi's list and other contractor platforms -** The leads can be hit or miss but they absolutely will make your phone ring. **AVERAGE SETUP COST $350 MONTHLY**\n\n**Upwork and other freelance platforms -** Lower quality leads but a great way to cut your teeth in an industry. **SETUP COST FREE**\n\n**YARD SIGNS (Zip tied to telephone poles) -** I've used this in several of my businesses and it has driven hundreds of thousands of revenue, (Legal disclaimer I don't know the rules of your area, but in mine certain towns call us and say it's not allowed and others leave them up or take them down themselves) **you can get 50 signs for roughly $500 from your local sign maker.** those 50 signs could stay up for 10 years and drive you significant revenue. (Vista print signs are much cheaper quality than something you would get locally, if you want the sign to last years, don't skimp on the $50 you would save)\n\nThe equation is simple - How much does it cost to create 1 customer using X ad platform, and how much profit does 1 customer on average bring your business? if the profit created is higher than the cost to acquire the customer then it is a successful marketing strategy and you can dump thousands into it and consistently make a profit.\n\n**Okay but what if I don't know how to set up google PPC or Facebook ads?** NO PROBLEM I DONT EITHER!\n\nHere's where the special sauce comes in, listen carefully.\n\nWhen you don't know something, but you need it in order to build the business do this exactly.\n\n1. Go to Upwork or a similar site\n2. Create a detailed, simple, and KIND job posting that shows that you mean business and are serious about hiring for this position.\n3. Book calls with as many experts as you possibly can (I personally just put my phone number on the listing and open the floodgates because the scheduling process can be annoying)\n4. Talk to ATLEAST 6 experts describing what you need to accomplish and asking them specifically how they would go about accomplishing it if you were to hire them. (Ask as many questions as you possibly can)\n5. Use your best judgment to choose the highest-value contractor to achieve your goal.\n6. PROFIT? No, but really, I use this process probably 8 times a year, by speaking with experts for hours on end who are trying to win your business they will give you all the insight you need to have a working knowledge of a subject.\n\nDon't be afraid of the hourly rate they have, it usually ends up being a lot less hours than you would think\n\nDISCLAIMER: Freelance websites have a lot of low-quality contractors, DO NOT hire someone until you've talked to 6 people, you need to find the diamond in the rough. (Trust me they are there, I have found some incredible partners who I still have on retainer to this day)\n\nExamples of hires I have made through freelance websites\n\nWeb development, Graphics Design, Drawing up a sales contract, SEO, Fashion Designer, Logo Maker.\n\n\\*\\*Okay so now we a website/google listing and leads coming in, whats next?\\*\\*Fulfill the orders!! Sell those shirts, cook those meals, cut those lawns, develop those websites, WHATEVER IT IS JUST DO IT!\n\nThere is a 100% chance you will make mistakes and clients will get mad at you, welcome to the business world. Stand behind your work and make it right, don't do shady shit.\n\nI promise this is one of the most rewarding things you can do with your life, when done right it can pay you far more than any job would and more importantly give you your time back! Imagine only working 5 hours a week (From your cell phone) and getting paid 30k a month. That's only possible by owning your own business. Don't stop pushing, don't let the punches knock you out. Take what you deserve and never settle.\n\n# Managing Your Cash Flow\n\nYou can have $1M in sales and still go bankrupt if your bank account hits zero on rent day. This is the \"boring\" stuff that separates the amateurs from the $1M+ founders.\n\n**The \"Net-30\" Trap:** If you’re doing B2B (business-to-business), many clients won't pay you for 30, 60, or even 90 days. If you have to pay your contractors *today* but don't get paid for two months, you are effectively a bank lending money to your clients.   \n  \nAlways try to get a **50% deposit upfront** or use \"Progress Payments.\" Never finance a client's project with your own rent money.  \n  \n**The \"Profit vs. Cash\" Reality:** Profit is what’s left on paper. Cash is what’s in the bank. You need a \"War Chest\" of at least 3 months of operating expenses.\n\nAs soon as you make your first $5,000, don't buy a watch. Put it in a high-yield savings account. That is your \"Stay in the Game\" fund for when Google Ads gets expensive or a client disputes a charge.  \n  \n**Automate Your Accounting:** Spend the $30/month on software like QuickBooks or Xero immediately. If you wait until tax season to \"figure out your numbers,\" you’ve already lost. You need to see your **burn rate** (how much you spend monthly) in real-time.\n\n# Final general tips \n\nDO NOT try to do everything yourself, you are definitely not the best person to be doing it and you will kill yourself in the process. Bad end product and not sustainable, hire 1099 experts.\n\nLaunch before you're ready, do not try to make everything perfect, do not try to dot all your i's and cross all your T's it will never happen. The learning is in the doing, its in the mistakes, its in the mad clients.\n\nOutsource as much of the business as you can, find no-contract partners to do everything you don't know how to do. Example - I have an accounting partner, ($300 a month) a tax strategist partner ($2500 a quarter) an SEO partner ($1700 a month) a google PPC partner ($300 a month) a content creation partner ($800 a month)\n\nIt is better to be at the higher end of industry pricing for whatever market you are in, higher cost = higher margins and less headaches because it requires fewer customers. And oddly enough its the smaller customers that are the neediest.\n\nRemember to pay yourself first, never under any circumstances be the least paid person in the business. It is far too easy to get in the habit of oh ill make money next year. No make a profitable business now or go work for someone. Build a rock-solid foundation that lines your pocket and doesn't require 80 hours of your time a week.\n\nWell guys that's about all the writing I have in me, there is definitely more I wanted to include but its almost 5am where I'm currently living. I'm starting a discord for people who want help getting started (Think lists of softwares, people i trust in different industries ect) all 100% free just trying to give back to a community that I love so much. Send me a PM if you would like to be apart of it\n\nGood luck out there.",
      "is_original_content": false,
      "link_flair_text": "A How-To Guide that no one asked for",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1r1upwd/how_to_start_a_business_an_indepth_reddit_guide/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o4tpmnt",
          "author": "WALWAL44",
          "text": "1. Identify your business model by looking at existing successful business models and considering which one you could replicate.\n2. Calculate the cost to start up the business, also known as the barrier to entry, by considering what resources and equipment you would need and how much they would cost.\n3. Determine the skills needed to be successful in your chosen industry, and evaluate whether you or someone you know has those skills, or if they can be easily acquired.\n4. Consider how long it will take to get the business up and running, and aim for a model that can be operational within a month.\n5. Avoid business models that require significant funding or expertise, and choose a model that you can easily finance yourself.\n6. Once you have selected a business model, create a plan to acquire the necessary resources and skills, and set a timeline for getting the business operational.\n7. Take action and start your business. Remember to stay motivated and focused, and don't be afraid to seek out advice and guidance from other successful business owners.",
          "score": 6,
          "created_utc": "2026-02-11 16:40:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4zzse9",
              "author": "dtsummery",
              "text": "These are some nice points.",
              "score": 1,
              "created_utc": "2026-02-12 15:57:17",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4t99bn",
          "author": "TheBlazingKFC",
          "text": "This is quite a nice in-depth guide. And the personal tips you added are also one of the best I have seen. \n\nThank you for this!",
          "score": 3,
          "created_utc": "2026-02-11 15:23:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4zzn9g",
              "author": "dtsummery",
              "text": "Happy to help. Are you an entrepreneur yourself?",
              "score": 1,
              "created_utc": "2026-02-12 15:56:38",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4ugywb",
          "author": "theredhype",
          "text": "There are really only about 25 or so business models that describe 99% of the businesses in the world. Here’s a good roundup by Dave Parker: \n\nhttps://www.dkparker.com/startup_business_models/\n\nAlso, NEVER go straight from brainstorming to building. \n\nThe most important step after considering which type or model of business is a good fit for you is to do rapid iterative customer discovery work focused on a problem you hope to solve or improve. Some tips from the pros here: r/CustomerDiscovery",
          "score": 2,
          "created_utc": "2026-02-11 18:48:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o500k1n",
              "author": "dtsummery",
              "text": "That’s a killer resource. Thanks for dropping that link. Dave Parker definitely knows his stuff when it comes to the technical taxonomy of startups.\n\nI’m going to have to respectfully disagree with you on the \"Never go straight from brainstorming to building\" rule.\n\nIn my experience, especially for someone's *first* business, \"Customer Discovery\" can easily become a fancy term for procrastination. I’ve seen so many founders spend six months doing interviews, surveys, and \"iterative discovery\" without ever actually asking for a credit card number. They get stuck in a feedback loop where they’re solving problems that don't actually exist in a paying market.\n\nFor the types of service-based or high-intent businesses I’m talking about (like the ones that use Google PPC), the market is the discovery.  \n  \nIf I put up a landing page and $500 of PPC spend, and the phone doesn't ring? *That* is my customer discovery. It’s fast, it’s objective, and it doesn't rely on people \"nicely\" telling me they like my idea during an interview.\n\nI’m curious though. In your experience, where do you see the \"Build First\" method fail the hardest? Is it usually a product-market fit issue, or just people wasting money on an industry that’s already too saturated?",
              "score": 1,
              "created_utc": "2026-02-12 16:00:50",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4ssce8",
          "author": "rhox_13",
          "text": "Great guide!",
          "score": 1,
          "created_utc": "2026-02-11 13:55:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4zzk66",
              "author": "dtsummery",
              "text": "Happy to help!",
              "score": 1,
              "created_utc": "2026-02-12 15:56:14",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4xxm6o",
          "author": "Financial_Leopard_53",
          "text": "Thks for sharing",
          "score": 1,
          "created_utc": "2026-02-12 06:59:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o501z7x",
              "author": "dtsummery",
              "text": "wlcm",
              "score": 1,
              "created_utc": "2026-02-12 16:07:29",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4ys2wp",
          "author": "EducationalBad9106",
          "text": "Took notes of these , i assumed many things the opposite of what i thought, thanks, lets help each other out",
          "score": 1,
          "created_utc": "2026-02-12 11:46:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o502fnc",
              "author": "dtsummery",
              "text": "which parts were the complete opposite of what you expected?\n\nI’m betting it was either the \"Don't build your own website\" part or the bit about hiring people even when you don't know the subject yourself. Most people think they have to be a master of every trade before they launch, but that’s actually the fastest way to stay stuck in the \"planning phase\" forever.",
              "score": 1,
              "created_utc": "2026-02-12 16:09:38",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4z3wlt",
          "author": "moonletdesignstuff",
          "text": "That was a nice, helpful read, much appreciated 🙏",
          "score": 1,
          "created_utc": "2026-02-12 13:10:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4zkk7b",
          "author": "aurorasparkl",
          "text": "Thank you for this. Following.",
          "score": 1,
          "created_utc": "2026-02-12 14:42:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4zsahq",
          "author": "Sure_Spite5671",
          "text": "We're running a small crypto faucet site that earns from ads/offers. Happy to share if anyone’s curious. Dm me.",
          "score": 1,
          "created_utc": "2026-02-12 15:21:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o502l47",
              "author": "dtsummery",
              "text": "Isn't the margin vs. time ratio on a crypto faucet site pretty brutal?",
              "score": 1,
              "created_utc": "2026-02-12 16:10:20",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o50kot9",
          "author": "Aldoperu",
          "text": "I have a question. Why do so many people in r/Business_Ideas talk about all the multiple businesses they've started? I mean, if you have a successful business, why wouldn't you pour all of your time and energy into growing it, rather than starting something else?",
          "score": 1,
          "created_utc": "2026-02-12 17:34:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o51934o",
          "author": "mr-goond",
          "text": "Thanks for posting. It’s a great summary. I don’t currently run a small business but I’ve worked for a few in the past - the Net 30 trap is a great call out. All of the small businesses I worked for had this problem, they had a few much larger companies as clients who could push these terms, one even had NET 90 days payment which really made it to manage cash flow. \n\nAnother great point is using Xero or quickbooks as they both have automated invoicing reminders. I spent a lot of time just chasing payments for these small businesses (the owners didn’t have time as they were focusing on winning new clients) so I agree getting deposits upfront and also adding late payment clauses can also really help. \n\nFinally just wanted to say thanks for calling out Google ads and digital marketing experts! That’s my full time job now. I first ran Google ads for a small design studio and it made a huge difference to their business, enough that I pursued it as a full time career. So if op or anyone in the comments has questions about it feel free to dm me :)",
          "score": 1,
          "created_utc": "2026-02-12 19:29:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o52h8vu",
          "author": "theswedishguy94",
          "text": "great write up, thanks! would love to join the discord but your account is blocked now. :(",
          "score": 1,
          "created_utc": "2026-02-12 23:04:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o52h97j",
          "author": "dealsleds8",
          "text": "Thank you. Following.",
          "score": 1,
          "created_utc": "2026-02-12 23:04:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o52tnfp",
          "author": "education",
          "text": "Can you PM me the discord link? Great post",
          "score": 1,
          "created_utc": "2026-02-13 00:15:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4x7gqq",
          "author": "porcupine_head",
          "text": "Those are some really good points.",
          "score": 1,
          "created_utc": "2026-02-12 03:35:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5012mq",
              "author": "dtsummery",
              "text": "Happy to help.",
              "score": 1,
              "created_utc": "2026-02-12 16:03:15",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4x9p30",
          "author": "D_Kip",
          "text": "This gives me some more ideas on building my business, thanks!",
          "score": 1,
          "created_utc": "2026-02-12 03:50:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5019t4",
              "author": "dtsummery",
              "text": "Happy to hear it, but I’ve gotta be honest. Ideas are actually the dangerous part. Most people I talk to get stuck in \"idea mode\" for six months, and then by the time they actually try to launch, they’ve lost all their momentum or the market has shifted.\n\nWhich specific idea from the post are you planning to actually take action on this week? If you’re stuck between a few different models, tell me what they are, I’ll tell you which one is a headache and which one is actually going to make the phone ring.",
              "score": 1,
              "created_utc": "2026-02-12 16:04:11",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4xfvv4",
          "author": "Savini72",
          "text": "Incredible write-up. On the Yard Signs point, I’ve thought about doing this for a local service biz, but I'm terrified of getting fined by the city.   \n  \nYou mentioned some towns call you. Have you ever actually faced a heavy fine, or is it usually just a 'hey, take these down' kind of warning? Also, do you find the ROI on signs is better than Local Services Ads (the Google 'guaranteed' ones)?",
          "score": 1,
          "created_utc": "2026-02-12 04:33:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o501p1a",
              "author": "dtsummery",
              "text": "Great questions. This is usually the part that makes people the most nervous because it involves the law, but in my experience, the reality is much more about simple logistics than getting hit with a $10,000 fine on day one.\n\n# 1. The \"Fines\" vs. \"Warnings\" Reality\n\nI have never, in 9 businesses, seen a city lead with a heavy fine. It is almost always a \"Hey, take these down\" phone call first.\n\nThink about it from the city's perspective: they have to prove *who* put the sign up. Just because your number is on it doesn't mean you were the one who zip-tied it to the pole (technically). They usually start by calling the number and being annoyed. When that happens, I just say, \"Oh, I'm so sorry, I had a contractor putting those out. I'll have him go pull them right now.\" Then I just don't put them back in *that* specific town for a few months.\n\n**The exception:** Texas just passed a law (Sept 2025) that can actually hit up to $5,000 for \"bandit signs\" if you're a repeat offender. So, if you're in a state that's actively cracking down, you have to be smarter—put them up on Friday evening after the city offices close and take them down Sunday night.\n\n# 2. ROI: Yard Signs vs. Local Services Ads (LSA)\n\nI’m actually going to say something controversial: **For a brand new local biz, I find Yard Signs have a better** ***initial*** **ROI than LSA.** \\* **LSA (The Google \"Guaranteed\" checkmark):** These are amazing because you only pay per lead, but the barrier is high. You need a background check, insurance docs, and a bunch of reviews before you even show up. It can take weeks to get approved.  \n  \nYard Signs give you \"Social Proof\" before you have it. If someone sees a sign in their neighbor's yard (or even just at the entrance of their neighborhood), they assume you're the \"local guy.\"\n\nIn my most successful service biz, LSA leads were costing me about $35–$60 per phone call. With yard signs, I was getting calls for roughly $4–$7 per lead based on the cost of the signs vs. the volume of calls.",
              "score": 1,
              "created_utc": "2026-02-12 16:06:10",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4wicit",
          "author": "NetLazy6134",
          "text": "Ive read this a few times now; thanks!",
          "score": 0,
          "created_utc": "2026-02-12 01:02:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o500tmt",
              "author": "dtsummery",
              "text": "Hey, I'm really glad it resonated enough for a re-read.\n\nBut I actually want to push back on you a bit—don't read it a fourth time.\n\nThe biggest trap people fall into with these guide is using them as a form of productive procrastination. You feel like you're working because you're learning, but your bank account hasn't changed.\n\nIf you've read it three times, you already have more than enough info to take the first step. What's the actual bottleneck for you right now? Is it the capital, the niche, or just the fear of the phone not ringing?\n\nTell me where you're stuck and let's see if we can get you past the reading phase.",
              "score": 1,
              "created_utc": "2026-02-12 16:02:05",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4wlxpr",
          "author": "UnemployedCricket",
          "text": "So refreshing to see practical advice. Loved this",
          "score": 0,
          "created_utc": "2026-02-12 01:24:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o501193",
              "author": "dtsummery",
              "text": "Thanks man, I appreciate that. I’m glad it landed well.",
              "score": 1,
              "created_utc": "2026-02-12 16:03:04",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4xe3wz",
          "author": "SwaziGoldenChild",
          "text": "thank you",
          "score": 0,
          "created_utc": "2026-02-12 04:20:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o501cx2",
              "author": "dtsummery",
              "text": "You're welcome.",
              "score": 1,
              "created_utc": "2026-02-12 16:04:36",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4xm2zp",
          "author": "beau-DS-mag",
          "text": "Thanks. In my second year now. It's growing, but I needed the reminder that im not the best person for every job. I'm spending way too much time building the equipment I need to increase productivity, that I'm losing productivity. I'll be contacting contractors.",
          "score": 0,
          "created_utc": "2026-02-12 05:20:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o501xgb",
              "author": "dtsummery",
              "text": "I’m going to give you some tough love here. Stop building your own equipment immediately.\n\nUnless your business *is* a high-end custom engineering shop, you aren't an equipment manufacturer, you’re a business owner. Every hour you spend with a wrench in your hand is an hour you aren't spending on the \"High Leverage\" tasks like scaling your PPC or refining your sales scripts.\n\nThink about it this way: if you could hire a contractor to build that gear for $50/hour, but your time spent on sales generates $300/hour in lifetime value per lead, you are literally losing $250 every single hour you play \"handyman.\"",
              "score": 1,
              "created_utc": "2026-02-12 16:07:16",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qylnxn",
      "title": "Our anonymous video chat platform Vooz hit 15k daily users yesterday!",
      "subreddit": "Business_Ideas",
      "url": "https://i.redd.it/i5klh8lga4ig1.jpeg",
      "author": "Electrical-Face-9291",
      "created_utc": "2026-02-07 18:39:21",
      "score": 84,
      "num_comments": 23,
      "upvote_ratio": 0.94,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Review my website, please",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1qylnxn/our_anonymous_video_chat_platform_vooz_hit_15k/",
      "domain": "i.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "o461afk",
          "author": "maopro56",
          "text": "itting 15k without even knowing who’s behind the camera is basically the grown‑up version of walking into the wrong Zoom call and pretending you belong",
          "score": 6,
          "created_utc": "2026-02-07 23:54:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o44hs5j",
          "author": "[deleted]",
          "text": "How do you guys earn money",
          "score": 5,
          "created_utc": "2026-02-07 18:49:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o44ly53",
              "author": "wavepointsocial",
              "text": "There’s always money in the banana stand",
              "score": 3,
              "created_utc": "2026-02-07 19:10:23",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o45dwrl",
              "author": "Electrical-Face-9291",
              "text": "\n\nWe aren't earning yet yet. We just started monetizing with premium features like gender and location filters etc. We will be earning in a few weeks once more monetization features are released",
              "score": 3,
              "created_utc": "2026-02-07 21:39:13",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o44tl5l",
          "author": "Critical_Nobody_4237",
          "text": "\n\nCongrats on the traffic numbers, that's impressive.\n\nThe real question everyone is thinking: How exactly does your \"strict AI moderation\" handle the Chatroulette/Omegle problem? (i.e., unsolicited nudity). Running real-time computer vision models on daily video chats to detect nudity is incredibly expensive and latency-heavy. \n\nAre you processing every frame or just sampling?",
          "score": 7,
          "created_utc": "2026-02-07 19:49:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o45d8mh",
              "author": "Electrical-Face-9291",
              "text": "\n\nWe have multiple AI models running in the background to detect nudity. If one model detects a hit, the other models confirm it by running checking it in quick succession. It is super detailed and very rarely can someone escape.",
              "score": 1,
              "created_utc": "2026-02-07 21:35:40",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o45k1ih",
                  "author": "hi_im_antman",
                  "text": "Yes, I think he understands that. He's asking about the cost of performance. You would essentially need to run the AI checks continuously (or frequently) on every active live stream. Even with frame sampling, doing it at scale is expensive and “multiple models” just increases the compute bill. \n\nAnd if you aren't doing it regularly, then the claim of being strict on nudity isn't really true. I can't imagine what it would be like if you had over a million users.",
                  "score": 9,
                  "created_utc": "2026-02-07 22:12:20",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o45u4z0",
          "author": "HospitalAny8632",
          "text": "Did you need turn server as fallback?",
          "score": 3,
          "created_utc": "2026-02-07 23:09:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o44gj19",
          "author": "Dear-Aspect-6969",
          "text": "Great achievement,   \nI'd like to know about tech stack and the cloud you are using to manage the infrastructure, and total costs per months from a technical side ofc, if you don't mind",
          "score": 2,
          "created_utc": "2026-02-07 18:43:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o45eviu",
              "author": "Electrical-Face-9291",
              "text": "\n\nTech stack is .net backend, nextjs front end, azure, webrtc\n\nWe aren't using any third party could server for our infra. Video streaming is p2p. Total costs per month is sustainable since we aren't using any third party subscriptions, can't disclose the numbers tho",
              "score": 1,
              "created_utc": "2026-02-07 21:44:27",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o44z2oo",
          "author": "Comfortable_Cap8037",
          "text": "\nWhich tech stack did you use?",
          "score": 2,
          "created_utc": "2026-02-07 20:19:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o45c7ss",
              "author": "Electrical-Face-9291",
              "text": "\n\nTech stack is .net backend, nextjs front end, azure, webrtc",
              "score": 2,
              "created_utc": "2026-02-07 21:30:11",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o44g1d7",
          "author": "Electrical-Face-9291",
          "text": "https://vooz.co \n\nBest anonymous chat site on the internet!",
          "score": 1,
          "created_utc": "2026-02-07 18:41:00",
          "is_submitter": true,
          "replies": [
            {
              "id": "o450twv",
              "author": "definitelynotgayhaha",
              "text": "\n\nWhy name it Vooz? Sounds spooky lol",
              "score": 1,
              "created_utc": "2026-02-07 20:28:39",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o45cuz2",
                  "author": "Electrical-Face-9291",
                  "text": "\n\nIt just came to us lol.. sounded cool and different, nothing else",
                  "score": 1,
                  "created_utc": "2026-02-07 21:33:39",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o44n7nr",
          "author": "MrMooseCreature",
          "text": "Love it",
          "score": 1,
          "created_utc": "2026-02-07 19:16:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o44nc0a",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-07 19:17:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o45ekpl",
              "author": "Electrical-Face-9291",
              "text": "\n\nYeah I am actually anticipating that lol. Dming you. Gotta discuss something",
              "score": 1,
              "created_utc": "2026-02-07 21:42:49",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4r006m",
          "author": "order-rejected",
          "text": "Who is “We” you and ChatGPT bro?",
          "score": 1,
          "created_utc": "2026-02-11 05:12:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o44p3rs",
          "author": "Wooden-Ad-9894",
          "text": "Do build an app for it. You can send notifications on users phones everyday which will improve retention and Vooz will always be on the back of their minds. Just a small business tip",
          "score": -2,
          "created_utc": "2026-02-07 19:26:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o45dlo5",
              "author": "word2trio",
              "text": "fuqoff",
              "score": 1,
              "created_utc": "2026-02-07 21:37:36",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o45dt6n",
              "author": "Electrical-Face-9291",
              "text": "\n\nYeah we will build an app once we have some bandwidth. Right now super occupied with creating monetization features",
              "score": -2,
              "created_utc": "2026-02-07 21:38:42",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qyzwe3",
      "title": "What are some major tasks in small/medium businesses that still require a lot of manual work but should be automated?",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1qyzwe3/what_are_some_major_tasks_in_smallmedium/",
      "author": "Original_Map3501",
      "created_utc": "2026-02-08 04:56:38",
      "score": 19,
      "num_comments": 19,
      "upvote_ratio": 0.89,
      "text": "Hey everyone,  \n  \nI’m trying to understand where small and medium businesses still lose a lot of time on manual work.  \n  \nFrom your experience, what are some repetitive or painful tasks you or your team still do manually that feel like they should already be automated?  \n  \nFor example:  \n  \nData entry and spreadsheet updates  \n  \nLead and customer follow-up tasks  \n  \nReport generation tasks  \n  \nInvoicing and payment processing and reminder creation tasks  \n  \nDocument and email organization tasks  \n  \nTask and deadline and approval tracking tasks  \n  \nI want to investigate which processes waste time and create daily operational difficulties because I have no intention to sell anything.  \n  \nIf you run a business or work closely with one:  \n  \nWhat task do you hate doing manually?  \n  \nWhat do you wish a tool would just “handle in the background”?  \n  \nI want to understand actual problems that people experience in day-to-day life. Thank you for your help.",
      "is_original_content": false,
      "link_flair_text": "Idea Feedback",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1qyzwe3/what_are_some_major_tasks_in_smallmedium/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o4d3m0n",
          "author": "Ecaglar",
          "text": "the training/onboarding answer is spot on. every company reinvents that wheel and its always chaos. the follow up problem is also universal - remembering who you sent what to is just broken workflow",
          "score": 5,
          "created_utc": "2026-02-09 02:24:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4dwsnp",
              "author": "Original_Map3501",
              "text": "When onboarding breaks down, what’s the most painful part for you personally creating training material, tracking who’s done what, or constantly following up with people?",
              "score": 2,
              "created_utc": "2026-02-09 05:22:37",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4to3v7",
                  "author": "chadvavra",
                  "text": "as an employee I was constantly finding out about benefits I never knew I had.",
                  "score": 1,
                  "created_utc": "2026-02-11 16:33:44",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o47exwb",
          "author": "GotTools",
          "text": "What I have noticed just about everywhere I’ve worked so far is that nothing is optimized in the way of standards and procedures. \n\nIt’s not like there aren’t countless solutions to making those tasks 100x more optimized, but that everyone is too focused on the thing that directly makes them money and not optimizing the process that supports it. You would be surprised how many companies still run of decade old computers. \n\nA lot of companies know their processes are complete crap and need redone, but they do the job for now.\n\nIt’s hard to come up with a solution to a problem in an industry you know nothing about, so get some real world experience in what you are passionate about and start looking for problems that need solutions.",
          "score": 5,
          "created_utc": "2026-02-08 05:17:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o47f8sg",
              "author": "Original_Map3501",
              "text": "So basically they are too lazy to optimize it or they dont wanna get out of the comfort zone and just keep using the old tech and not touch it if tis working?",
              "score": 2,
              "created_utc": "2026-02-08 05:20:14",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o49arpd",
                  "author": "Botboy141",
                  "text": "There are a lot of ways to make money in this world.\n\nA profitable, growing business, doesn't always have to focus on every opportunity for efficiency and optimization.\n\nA lot of the time, a small tweak to their marketing or sales process will yield great short-mid term results, for less effort, than actually addressing inefficient operations.\n\nInefficient operations become more relevant at scale, and is where most business fail.",
                  "score": 4,
                  "created_utc": "2026-02-08 14:39:51",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o47gmn0",
                  "author": "Green-Setting5062",
                  "text": "I know with some apps they charge you by the page for basically smart parsing from ocr scanned documents. I was working on my own receipts and invoice intake system because I think thay would eventually require that i hire someone to do it for me, but I was able to make a python tool that can parse my bank statement and certain invoices. Its just manual trial and error and I use a json as the profile template. My problem is I feel its too jankey to sell but I deal with the jankey stuff because I can spend an hour and get a profile dialed in and save it and it works 90% of the time and im able to get the money info and dates into a database that can export csv or whatever for a book keeper. I developed it because I have adhd and I cant stay organized with paperwork everywhere so its way easier to keep a folder on the PC with each month of records and then get it all into a data base and its all there basically. Ive automated a huge chunk of the repeating tasks basically all I gotta do is take pictures of receipts with a scanner app and then transfer them into the folder when im home. And boom I can process the receipts and bank accounts in under an hour. And hell im usually screwing around on my phone for most of the hour so a normal person it would probably be 30 mins lol 😆",
                  "score": 2,
                  "created_utc": "2026-02-08 05:31:09",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o48zda5",
          "author": "indexintuition",
          "text": "honestly, anything that requires me to remember to follow up later is where things fall apart. emails especially, drafting them, formatting them, then remembering who i sent what to. invoicing too, not the sending part but the reminders and tracking who paid without digging through spreadsheets. i also hate moving the same info between tools because it feels like pure brain drain. i wish more stuff just synced quietly in the background so i could spend my limited time actually working instead of managing the work. as a small business, the mental load is almost worse than the time itself.",
          "score": 5,
          "created_utc": "2026-02-08 13:31:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o494ydk",
              "author": "Original_Map3501",
              "text": "The statement that the mental burden is worse than the actual time struck a chord with me.  \nI'm thinking about this, and I would appreciate your frank opinion. Imagine a tool that tracks invoices and follow-ups in the background without requiring you to check spreadsheets or set reminders. It remembers who sent what, automatically reminds you to pay unpaid invoices, and marks tasks as completed when payment is received.\n\nIt would only interrupt you if something was past due or required attention; otherwise, you would continue working as you currently do.\n\nFor you, would something like that truly lower the mental overhead? If so, what is more important automatic payment detection, follow-up notifications, or avoiding the need to maintain tool synchronization?",
              "score": 1,
              "created_utc": "2026-02-08 14:05:51",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4anhl0",
                  "author": "eldowns",
                  "text": "Almost all invoicing platforms already do this.",
                  "score": 3,
                  "created_utc": "2026-02-08 18:39:43",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o47ek1p",
          "author": "feudalle",
          "text": "So I've been in dev since the 90s. The problem is every small business does it diffently. You need to customize per client or you can try the over saturated SaaS option.",
          "score": 3,
          "created_utc": "2026-02-08 05:14:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o47fbfm",
              "author": "Original_Map3501",
              "text": "What exactly do you mean by \"customize per client\"?",
              "score": 1,
              "created_utc": "2026-02-08 05:20:49",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o47fvks",
                  "author": "feudalle",
                  "text": "So client 1 keeps there spreadsheets in layout x on google sheets. Client 2 uses share point and excel and links it to powerbi. Client 3 has an access database their nephew built in 2006 for them. Client 4 uses salesforce but keep notes of things thfy need to enter in on a txt file on their desktop. No good way of automating that with 1 solution. If your thought is you'll have them all entered it in your way fir uour solution, good luck pushing the boulder up the hill. 30 years of dev experience for small company to multinationals you are fighting human nature.",
                  "score": 3,
                  "created_utc": "2026-02-08 05:25:13",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o48xupu",
          "author": "senraku",
          "text": "An auto salt and pepper shaker hopper/quick fill for restaurants",
          "score": 3,
          "created_utc": "2026-02-08 13:21:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o497tl6",
          "author": "Aero002",
          "text": "Training, onboarding, upskilling employees - takes hours and hours. Even with material. ",
          "score": 3,
          "created_utc": "2026-02-08 14:22:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ix2y4",
          "author": "Ecaglar",
          "text": "invoicing and bookkeeping for small businesses is still painful. also scheduling and appointment management for service businesses is a mess. people use like 5 different tools that dont talk to each other",
          "score": 3,
          "created_utc": "2026-02-09 23:52:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4t0ohj",
          "author": "chadvavra",
          "text": "I worked in consulting for 20 years for both large and small businesses.  What was universally bad for both employees, consultants, agencies... really anyone on their first month of working internally... was onboarding.\n\nOthers have said that there is no standard, everything is all over the place, because there will never be a single platform that can do everything and small/medium businesses don't have the resources to build their own integrations.\n\n[https://www.workday.com/](https://www.workday.com/) attempts to cover off on the HR and Financial management aspect, but I suspect it's too expensive for most SMBs\n\n[https://www.useparagon.com/actionkit](https://www.useparagon.com/actionkit) is pretty interesting in the integration/AI agent space and I could see it being used to fill the gap a bit, but it does lead to multiplying monthly subscription costs for users.\n\nI like the idea a lot though and I'm going to run it through my own app Chat Agency AI to see what could be done to innovate in the space.",
          "score": 2,
          "created_utc": "2026-02-11 14:40:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o47zkv0",
          "author": "imabetaunit",
          "text": "I’m having trouble identifying what business idea is being shared.",
          "score": 1,
          "created_utc": "2026-02-08 08:20:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4f4t3m",
          "author": "Comfortable_Mark_556",
          "text": "Keep it up! Looking forward to your next publications.",
          "score": 1,
          "created_utc": "2026-02-09 12:04:41",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r0vxlw",
      "title": "Looking for people to build a housing startup with me",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1r0vxlw/looking_for_people_to_build_a_housing_startup/",
      "author": "Gravitronhybrid",
      "created_utc": "2026-02-10 09:07:02",
      "score": 11,
      "num_comments": 13,
      "upvote_ratio": 0.72,
      "text": "I’m working on a startup called Living Plus, Building something bigger than just a property management company, Most housing startups in India stop at listings or property management. Living Plus is about building the system behind renting. property management is just one layer, not the core business.\nI’m building Living Plus to go deeper, a  startup focused on flexible, managed homes designed for modern renters, without the usual friction.\n\nThe core idea is simple:\nDon’t rent. Subscribe to your home.\n\nEarly stage, serious execution.  I’m looking for people who want to build something foundational, not just another startup:\n\nProduct / Tech Builders (especially proptech, marketplaces, SaaS)\nOperations & on-ground execution\nReal estate, property management, or urban planning folks\nMarketing / brand / growth (especially early-stage startups)\n\nOpen to co-founders and early team members (equity-based).\nIf you want to help shape something that could become big, comment or DM.",
      "is_original_content": false,
      "link_flair_text": "Business Partner Sought - Business has NOT been established",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1r0vxlw/looking_for_people_to_build_a_housing_startup/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o4pnfes",
          "author": "ForeverInIt",
          "text": "How is subscribing to your property any different than a monthly rent payment? Are you technical?",
          "score": 4,
          "created_utc": "2026-02-11 00:07:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4sengo",
              "author": "Mysterious-Change954",
              "text": "I had the same thought.   \n\n\"Dont lease this car...subscribe to it\".    Ok,,, and what happens when the \"subscription\" is over?  lol",
              "score": 2,
              "created_utc": "2026-02-11 12:33:04",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4th9a5",
          "author": "Lucifer_9786",
          "text": "Interesting",
          "score": 1,
          "created_utc": "2026-02-11 16:01:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ubgx7",
          "author": "TildeMester",
          "text": "I would be interested in building the tech.",
          "score": 1,
          "created_utc": "2026-02-11 18:22:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4yha3h",
          "author": "Mprofessor007",
          "text": "I am also searching for a partner\nHope we will be good business partners.",
          "score": 1,
          "created_utc": "2026-02-12 10:10:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4q7aza",
          "author": "Ok_Stay_8530",
          "text": "The framing is interesting. \"Don't rent. Subscribe to your home\" is the kind of positioning that sticks.\n\nThe India angle is interesting too. The renting experience there is genuinely broken and anyone who's navigated brokers, deposits and lease challenges knows there's a real problem to solve.\n\nOne thing worth thinking about early is who your first subscriber looks like...\n\nYoung pros in metros? \n\nRemote workers who move cities every few months? \n\nGetting specific and targeted on your idea ICP will be one foundational peices..\n\nThe subscription model also opens up some interesting questions around churn. A renter who moves every 6 months is very different from one who wants to stay 2 years. \n\nHow would you handle that flexibility and scale?\n\nHave you validated the willingness to pay for the subscription model specifically versus traditional renting? That's the question I'd be stress testing right now before hiring or building.\n\nHence, that's actually what r/BuildrBoard is for. A community where solopreneurs and early stage founders validate their ideas with real people before going all in. Would love to see you drop this in there and get more eyes on it.",
          "score": 1,
          "created_utc": "2026-02-11 02:04:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ndm95",
          "author": "Sachinkumarsakri",
          "text": "Let's discuss",
          "score": 0,
          "created_utc": "2026-02-10 17:31:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4nm0s1",
          "author": "Zealousideal_Bag6976",
          "text": "This is really great idea. I want to learn more about the concept of how rent / subscription based is different. I am open to discussions.",
          "score": 0,
          "created_utc": "2026-02-10 18:10:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4noptr",
          "author": "EntertainmentFew361",
          "text": "Can connect and discuss about idea\nAs currently working as BA in icici group (product side+ strategy)",
          "score": 0,
          "created_utc": "2026-02-10 18:22:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4pmnde",
          "author": "smithms176",
          "text": "Would this be for properties in India?",
          "score": 0,
          "created_utc": "2026-02-11 00:02:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4q46mq",
          "author": "RepeatSignificant678",
          "text": "Would have to change the name cause it makes me think of Succession otherwise interesting idea",
          "score": 0,
          "created_utc": "2026-02-11 01:45:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4qi1k0",
          "author": "shamid898",
          "text": "Hey let's connect",
          "score": 0,
          "created_utc": "2026-02-11 03:09:23",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qyu20r",
      "title": "Business Idea Feedback - Mens Mentoring Group?",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1qyu20r/business_idea_feedback_mens_mentoring_group/",
      "author": "UnusualAd3207",
      "created_utc": "2026-02-08 00:20:13",
      "score": 7,
      "num_comments": 5,
      "upvote_ratio": 0.78,
      "text": "This might sound harsh but.. I don't think there's a male loneliness epidemic going on right now, I think there's just a male loser epidemic\n\nGuys need to focus on improving themselves and building a lifestyle that attracts what they want\n\nWomen, friends, business opportunities, etc\n\nIn 2023 I sold my tech company for a lot of money, and I invested heavily into self improvement\n\nBecause even though I now had money, I was a loser in basically every other area of life.\n\nI was a shy tech nerd who was super insecure about my looks, had basically zero confidence, zero success with women, out of shape, etc\n\nLearning how to communicate, learning how to be confident in social situations, learning out to dress for my body, have style, how build attraction with women beyond looks, getting in shape, and maximizing my potential as a man has dramatically improved my life.\n\nI find it easy to make friends, business people reach out to me often, women comment on my IG posts and DM me often (something that Iv'e never ever experienced in life)\n\nAll because I improved my lifestyle, I think that's the key, if you do that, everything you want will be attracted to you, you wont have to chase it.\n\nBe an attractor not a fisherman. Stop chasing..\n\nSo Iv'e been thinking about putting together a group mentoring program for men, because I think so many need it so bad\n\nGirls Dm's are filled with out of shape broke dudes who are totally desperate and it's sad.\n\nI'd bring in experts to teach different areas. Like starting / growing a business, dating, communications coaches, social dynamics, looksmaxxing, style consultants, nutrition / diet, fitness, financial literacy / investing, etc.\n\nBasically all the areas in which I think men should be maximizing to get ahead in life\n\nI'd host it in some kind of community app like Discord or Skool, and do weekly group calls\n\nThoughts? Good idea? Bad idea? Something no one would probably care about and I'm one of the rare people that cares so much about improving all those areas? lmk!\n\nThis is just a thought, nothing in motion yet, so not promoting",
      "is_original_content": false,
      "link_flair_text": "Idea Feedback",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1qyu20r/business_idea_feedback_mens_mentoring_group/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o4ix5cm",
          "author": "Ecaglar",
          "text": "the willingness to pay is the hard part here. most guys who want mentoring also dont have money. and the ones with money usually want 1on1 coaching not group stuff",
          "score": 2,
          "created_utc": "2026-02-09 23:53:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o46ah68",
          "author": "Ok_Rock_8421",
          "text": "If discord doesn’t work or you have a problem getting traction start with social media posts and build funnels to the discord server",
          "score": 1,
          "created_utc": "2026-02-08 00:49:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o49bbmn",
          "author": "Good-Work2301",
          "text": "I would host it in Skool. Would attract like minded men.",
          "score": 1,
          "created_utc": "2026-02-08 14:42:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o49o8tj",
          "author": "ChestChance6126",
          "text": "I get the instinct, but the framing matters more than the mechanics here. There is demand for men wanting structure and accountability, but the second it smells like contempt for the audience, conversion and retention drop fast. What tends to work better is positioning around skills and outcomes, social confidence, health, and career leverage, rather than diagnosing people as broken. Also worth pressure testing if this is really a mentoring program or a curriculum plus community, those are very different beasts operationally. I would validate with a small paid cohort and one or two core tracks first, instead of boiling the ocean. The idea itself is not crazy, but the edge is in execution and tone, not the concept.",
          "score": 1,
          "created_utc": "2026-02-08 15:50:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4d3otq",
          "author": "Ecaglar",
          "text": "the framing matters here. \"loser epidemic\" will alienate your exact target audience before you even start. position around skills and outcomes not contempt",
          "score": 1,
          "created_utc": "2026-02-09 02:24:39",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qy4sdt",
      "title": "Do you need an LLC to sell online?",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1qy4sdt/do_you_need_an_llc_to_sell_online/",
      "author": "Vengsta",
      "created_utc": "2026-02-07 04:59:30",
      "score": 7,
      "num_comments": 11,
      "upvote_ratio": 1.0,
      "text": "Hey everyone,  \n  \nSo I’ve been thinking about starting a small online store selling handmade pens. I’ve been doing a ton of research, but I keep going back and forth on whether I need to form an LLC or if I can just start selling as a sole proprietor.  \n  \nHere’s the thing, I’m not planning to quit my day job anytime soon, and I’m starting super small. Like, maybe $500 in sales a month if I’m lucky. But I’ve heard horror stories about people getting sued or having their personal assets at risk because they didn’t have an LLC. On the other hand, I don’t want to overcomplicate things or spend money on legal fees if it’s not necessary right now.  \n  \nMy cousin started selling vintage clothes on Etsy a few years ago and never bothered with an LLC. She was doing pretty well until someone claimed they got a rash from one of her sweaters (turned out they were just allergic to wool, but still). She ended up settling out of court, and it was a huge headache. Now she swears by her LLC, but I’m not sure if her situation applies to me.  \n  \nSo, do I need an LLC from the start, or can I wait until I’m making more money? For those of you who sell online, did you start with an LLC or wait until later? Any advice would be super appreciated.",
      "is_original_content": false,
      "link_flair_text": "Marketing / Operational / Financial / Regularotry Advice sought",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1qy4sdt/do_you_need_an_llc_to_sell_online/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o41h72y",
          "author": "Apprehensive_Yam1771",
          "text": "Hey! you don't need an LLC to start, but it can be beneficial once you have consistent sales or more risk.\n\nI started my own Etsy store a while ago, on the side, and what you can do, is register as a sole proprietor. It's simple, and free, but make sure to report the income on your regular taxes. \n\nThe reason you'd want to open an LLC, is to have limited liability. If someone sues your business, an LLC helps keep your personal assets (like your car, savings, etc.) separate from the business. That’s what your cousin’s situation was really about.\n\nSince it's a small business, and you're selling handmade pens specifically, your risk is relatively low, and I would definitely recommend starting as sole proprietor. If later on you decide to go full in, it might be a good idea to open an LLC once you’re making steady money or scaling up.\n\nPS. If you need help building a website or want marketing/advertising services, feel free to reach out ;)",
          "score": 2,
          "created_utc": "2026-02-07 06:34:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o41ic4e",
              "author": "AaronDoud",
              "text": "To add to this one should always understand two principals when talking about how an LLC/Corp limits liability.\n\nFirst is the idea of piercing the veil which is the legal point that the courts can choose to let a lawsuit of an LLC/Corp go directly after personal assets.  This normally happens when the corp is closely held by one or a small number of owners and said owner(s) are directly involved.\n\nSecond is they can always sue you personally even if you are just an employee. \n\nA lot of advice to small and/or new business way overhype the protection you get from an LLC.   If they sue they will go after your personal assets and nothing will stop that if you are a solo owner working in the business.  Any lawyer worth his salt will at least sue the owner in addition to the business.  \n\nLoads of reasons to have an LLC but the \"limited liability\" part needs to be framed correctly.\n\nMost small and especially new businesses have no reason to be LLCs when they are basically a relatively low paid job for the owner/worker.  \n\nOnce you get bigger, have employees, and/or have tax or other reasons to then get an LLC or other corp.",
              "score": 1,
              "created_utc": "2026-02-07 06:45:14",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o44y5ww",
          "author": "BusinessAnywhereio",
          "text": "You do not need an LLC to sell online. In most states you can start today as a sole proprietor and report the income on your personal taxes.\n\nWhat an LLC does (and doesn’t) do:\n\n* It can help separate business liabilities from your personal assets, if you run it properly.\n* It does not stop someone from suing you. It just changes what’s typically at risk.\n* If you mix funds, skip basic paperwork, or personally cause harm (negligence), the “shield” can be weaker.\n\nFor handmade pens, the bigger early risks are usually practical, not legal structure:\n\n* Sales tax and permits: you may need a sales tax permit and to collect/remit sales tax depending on where you sell and where buyers are.\n* Local business license and a DBA/fictitious name filing if you sell under a shop name.\n* Product liability: consider simple product liability insurance once you’re shipping regularly, especially if you use finishes, adhesives, or include small parts.\n\nA common path (and what we see at BusinessAnywhere) is:  \nStart as a sole proprietor with a separate bank account and clean records, then form an LLC once sales are consistent, you’re taking larger orders, or you’re worried about personal asset exposure.",
          "score": 2,
          "created_utc": "2026-02-07 20:14:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o48za6i",
          "author": "WrestlingDadPA",
          "text": "You don't \"need\" an LLC, you'll most likely never get sued anyway... and a cheap insurance policy protect you there. However, an LLC is a cleaner business entity, and you want to separate your business money (with a checking account and separate taxes) from personal, and an LLC costs $125 and about an hour of your time. No legal fees required, it's honestly super super easy. ChatGPT will walk you right through it, along with the ancillary steps of opening accounts, getting your EIN number, etc. I would never have a sole proprietorship, I have multiple LLC's and S-corps.",
          "score": 2,
          "created_utc": "2026-02-08 13:30:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4rvaok",
          "author": "menhoan15",
          "text": "Are you actively selling? \n\nI think you should check out your state laws/ tax permits. Even if you file an LLC or stay as a sole prop, you likely do need a Sales Tax Permit from your state to sell physical goods legally.",
          "score": 2,
          "created_utc": "2026-02-11 09:52:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o426ypg",
          "author": "Firm-Organization374",
          "text": "I would love to design your professional logo.",
          "score": 1,
          "created_utc": "2026-02-07 10:42:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4l6a8j",
          "author": "Aldoperu",
          "text": "You don't need an LLC to legally sell. A sole proprietorship is the default. But you should still get a DBA name so you aren't using your personal name for everything. ",
          "score": 1,
          "created_utc": "2026-02-10 09:32:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4l9boh",
          "author": "beth_weird75",
          "text": "Liability isn't just about rashes. Your cousin's wool allergy story is a perfect example. For pens, you could think along the lines of ink leaks ruining expensive rugs or a component being a choking hazard. \n\nIf you're worried, getting an LLC can act as your corporate veil.",
          "score": 1,
          "created_utc": "2026-02-10 10:02:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4mg125",
          "author": "CharacterFarm8196",
          "text": "In some states (for example Kentucky) an LLC is $40 and 10 minutes of work. In California, it's $800+ a year. If the fee is low in your state, just do it for the peace of mind. ",
          "score": 1,
          "created_utc": "2026-02-10 14:53:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4s194v",
          "author": "psairi",
          "text": "Honestly, if you're just starting out and it's a side hustle, I wouldn't stress about an LLC right away. I started selling prints on Etsy as a sole proprietor and only formed an LLC after I hit $10k in sales. Just make sure you have liability insurance. It’s cheaper and gives you some peace of mind.",
          "score": 1,
          "created_utc": "2026-02-11 10:47:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4xg35l",
          "author": "Savini72",
          "text": "Unpopular opinion maybe, but for handmade pens, Product Liability Insurance is actually more important than an LLC right now. An LLC protects your house if the business goes bankrupt or gets sued for a contract, but it doesn't always stop a 'piercing the veil' situation if you're negligent. If a pen clip snaps and someone’s kid swallows it, you want an insurance policy to pay the lawyer, not just an LLC shell.   \n  \nDid you look into what a basic $1M liability policy costs for makers?",
          "score": 1,
          "created_utc": "2026-02-12 04:34:48",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qxevno",
      "title": "I executed on the idea of \"Zapier for Hackers\"",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1qxevno/i_executed_on_the_idea_of_zapier_for_hackers/",
      "author": "Deep-Bandicoot-7090",
      "created_utc": "2026-02-06 11:14:21",
      "score": 7,
      "num_comments": 2,
      "upvote_ratio": 1.0,
      "text": "I always saw people asking for a way to automate security testing without writing scripts. The idea was simple: \"Make it visual.\"\n\nSo we actually built it.\n\nIt’s called **ShipSec Studio**. It allows you to build security pipelines using a visual node editor. You can use it to automate bug bounties, cloud audits, or just check your home lab.\n\nWe just open-sourced the code today.\n\n**Repo:**[github.com/shipsecai/studio](https://github.com/shipsecai/studio)",
      "is_original_content": false,
      "link_flair_text": "Idea Feedback",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1qxevno/i_executed_on_the_idea_of_zapier_for_hackers/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o48dgnd",
          "author": "raxblackwood",
          "text": "Imma check it out",
          "score": 1,
          "created_utc": "2026-02-08 10:32:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4l5725",
          "author": "Ok-Carob6350",
          "text": "This is a solid direction — a **visual pipeline builder for security workflows** is exactly what a lot of folks *wish* their “glue scripts” were.\n\n\n\nA couple questions that’ll help people evaluate it fast:\n\n\n\n* What’s the **threat model / guardrails** (sandboxing, secrets handling, scope controls) so it doesn’t become “point-and-click chaos”?\n* Does it ship with **templates** (e.g., recon → asset inventory → misconfig checks → reporting) and **sample pipelines**?\n* How extensible is it — can we add custom nodes/plugins easily, and what tools are supported out of the box?\n\n",
          "score": 1,
          "created_utc": "2026-02-10 09:21:46",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r0ty5t",
      "title": "A ymca but instead of gym equipment its filled with musical instruments, recording software, rooms to record and make music etc.",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1r0ty5t/a_ymca_but_instead_of_gym_equipment_its_filled/",
      "author": "living_condom_ad",
      "created_utc": "2026-02-10 07:01:11",
      "score": 7,
      "num_comments": 11,
      "upvote_ratio": 0.9,
      "text": "I would sell monthly memberships also pay people to give lessons and have groups to bring musicians together that want to jam etc.",
      "is_original_content": false,
      "link_flair_text": "Idea Feedback",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1r0ty5t/a_ymca_but_instead_of_gym_equipment_its_filled/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o4m9p5q",
          "author": "kawaiian",
          "text": "This is what recording studios do",
          "score": 3,
          "created_utc": "2026-02-10 14:20:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4mdmsh",
              "author": "living_condom_ad",
              "text": "Not even close. Recording studios dont provide instruments most of the time and youre paying for a producer to proffessional put your track together and you pay a shit ton of money per session. This just sets you up with everyhing you need and you gotta figure it out on your own",
              "score": 1,
              "created_utc": "2026-02-10 14:40:56",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4me0kk",
                  "author": "kawaiian",
                  "text": "Every legitimate recording studio I’ve been to offers the standard instruments",
                  "score": 2,
                  "created_utc": "2026-02-10 14:42:56",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o4os761",
                  "author": "Solid_Mongoose_3269",
                  "text": "They could easily add instruments and write the costs off at tax time",
                  "score": 1,
                  "created_utc": "2026-02-10 21:25:26",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o5297is",
                  "author": "Rocinante1283",
                  "text": "Most professional recording studios have relationships with local gear rental facilities and coordinate rentals on behalf of clients.",
                  "score": 1,
                  "created_utc": "2026-02-12 22:22:22",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4os3v7",
          "author": "Solid_Mongoose_3269",
          "text": "So a studio?",
          "score": 3,
          "created_utc": "2026-02-10 21:25:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4pw3x3",
          "author": "2legit2sleep",
          "text": "This is a cool idea. If you are able to get the local community involved that could help a ton. Maybe give options to someone in sponsoring a K-12 student for some classes.",
          "score": 1,
          "created_utc": "2026-02-11 00:56:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4q06pi",
          "author": "amberjletang",
          "text": "This is actually a really nice concept and I can see why it appeals. A shared creative space solves a real problem for musicians who do not have access to gear, space, or a community to collaborate with.\n\nThe biggest thing I would think about early is usage patterns. Gyms work because people come regularly and equipment scales well. Music spaces tend to be more bursty. Someone might come a lot for a few weeks and then disappear. That does not kill the idea, but it affects how memberships should be structured and priced.\n\nNoise control, scheduling, and wear on equipment are also real operational challenges. You would probably want very clear time slots, booking rules, and accountability so it does not turn into chaos or burnout for whoever is running it.\n\nWhere this really shines is community. If people feel like they belong there and not just rent a room, retention becomes much easier. Group jams, beginner friendly sessions, and hosted events could matter more than the gear itself.\n\nOverall it feels viable if started small and local, almost like a pilot space. If you can prove people show up consistently and bring friends, that is when the membership model really starts to make sense.",
          "score": 1,
          "created_utc": "2026-02-11 01:21:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4q7pj2",
          "author": "Ok_Stay_8530",
          "text": "This is a great idea. Musicians need space and gear but most can't afford a home studio. \n\nYou're solving a real problem.\n\nThe YMCA model works here too. Low monthly fee, shared access, community built in.\n\nThe lessons and jam sessions are smart add-ons. That's what turns members into regulars.\n\nBiggest question before you build: have you talked to local musicians about what they'd actually pay per month?\n\nDrop it over at r/BuildrBoard, a community built exactly for validating ideas like this before going all in...",
          "score": 1,
          "created_utc": "2026-02-11 02:06:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4qkf4w",
          "author": "gridsandorchids",
          "text": "I dont think it will work as a low cost \"YMCA\" model. Think about any other space like that for other activities - the public equipment has to be something durable and simple, like gym stuff, to handle all the traffic and dumb people. \n\nInstruments and expensive music equipment would be too fragile and require too much maintenance. People are gross, and dumb, and break things. You would need a lot of supervision and staffing. Once you get to a point to where it makes sense conceptually its basically just the existing private studio model. \n\nThe only thing similar that works would be something like Vera Project in Seattle - a community based art venue that runs on a non profit model, passionate volunteers, grants, etc. Alternately, bands tend to rent practice space in industrial areas that are inexpensive.\n\nAn analog to think about is science and children museums - the sophisticated stuff is almost always broken or janky.",
          "score": 1,
          "created_utc": "2026-02-11 03:24:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o52ac39",
              "author": "Rocinante1283",
              "text": "This is correct. Professional recording equipment is expensive and often too complicated for someone walking in off the street. Most people don't know how to use a $250,000 SSL board.",
              "score": 1,
              "created_utc": "2026-02-12 22:28:08",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qzqadh",
      "title": "Two business ideas I would love feedback on:",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1qzqadh/two_business_ideas_i_would_love_feedback_on/",
      "author": "Apricotsandtoast",
      "created_utc": "2026-02-09 00:59:56",
      "score": 6,
      "num_comments": 24,
      "upvote_ratio": 0.8,
      "text": "1.)  I live in a suburb of Chicago.  Weather is terrible, all our cars look terrible most of the time but I still like to get my car washed regularly.  Other unrelated fact: shopping centers are suffering.  I live near Oak Brook mall and I would LOVE if a car wash service posted up in one of the parking garages.  It feels archaic to have to go to some random car wash and just sit there and wait.  I understand this probably does take place in certain areas of the US but not near me!  I know there are also mobile car washes but not near me...especially in the winter.  I would love to either be home or able to run a few errands such as at a mall while my car was getting washed.  I know at some large corporate buildings they offer this in their parking garages but people are working onsite less so I could see a need for this.  Plus, I would think the shopping malls would cut a deal on the real estate required because it would bring in more traffic.  I would happily go to the mall and walk around (probably end up buying something) if this existed.  Thoughts?\n\n2.)  I think there should be some type of app where people can anonymously upload their budget spreadsheets.  You'd also need to fill in your annual household income.  I think it would be incredibly helpful to look at other people's budgets that have a similar household income as me.  My husband and I argue about what our annual budget should be.  We have SO much in savings (a lot a lot) and he constantly thinks we should be saving more.  I think let's enjoy life a little more.  Quick background, when he grew up his house was foreclosed on so I think he operates from a place of fear and saving brings him SUCH comfort.  So we have done a good job at that for a long time but, at a certain point, at what cost?  I think it would be helpful to compare and understand spending statistics of other similar families.  I also think people that are poor with savings could really learn from how other families do it.  Thoughts?",
      "is_original_content": false,
      "link_flair_text": "Idea Feedback",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1qzqadh/two_business_ideas_i_would_love_feedback_on/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o4ebm7q",
          "author": "BigShinyTrees09",
          "text": "There’s one of these mall car washes where I live - I use it all the time, it’s in a really crappy corner of the parking garage that went unused previously. They have something called a ‘rainy day special’ for when the weather is bad: a deal on both the interior and exterior cleaning. It’s fast, cheap and convenient. \n\nReal world ‘messy’ businesses always do better than apps. But be unique, and don’t stop when it gets hard. Just. Keep. Washing. \n\nA few name ideas:\n\nLot Wash\nPark & Polish\nStall Scrub\nMall Wash Pros\nShop n’ Scrub",
          "score": 2,
          "created_utc": "2026-02-09 07:29:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4d6ex7",
          "author": "theredhype",
          "text": "I haven't seen an app like that. But here are some real world examples published by YNAB budgeting software. You're right. It's very interesting to see different types of people's budgets. \n\nhttps://www.ynab.com/category/real-examples",
          "score": 1,
          "created_utc": "2026-02-09 02:38:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4dbe3w",
              "author": "Apricotsandtoast",
              "text": "Very interesting.  Thanks for the link!",
              "score": 1,
              "created_utc": "2026-02-09 03:04:26",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4e3zuh",
          "author": "vonGlick",
          "text": "1) I know one place in Helsinki, Finland like that. I think it makes a lot of sense.\n\n2) For this one to draw any reasonable conclusions you need huge scale. Even if you take another family in Chicago. Do they have as much saving as you? Are they having same number of kids? Are they similar age? Do they own property? If you take number of parameters you would need to compare you would find out you need hundreds of thousands of people before you get enough similar families to draw meaningful conclusions.",
          "score": 1,
          "created_utc": "2026-02-09 06:20:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ix0l1",
          "author": "Ecaglar",
          "text": "pick one. seriously. two ideas = half the focus on each. which one do you find yourself thinking about more when youre not working?",
          "score": 1,
          "created_utc": "2026-02-09 23:52:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4k2dx6",
              "author": "Apricotsandtoast",
              "text": "I think the car wash would be easier to make successful.  I'm at the very beginning stages...it's really just an idea at this point but I think my next step would be to talk to the shopping center.  To be completely frank, I don't know that much about the car wash business.  I do know of a top quality car wash chain near me that is family owned.  It crossed my mind to talk to them as well but I don't quite know how to do it without them just taking my idea and doing it without me.  ",
              "score": 1,
              "created_utc": "2026-02-10 03:56:16",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4jcag1",
          "author": "gjr23",
          "text": "What sort of capital do you have access to? These seem vastly different from a start up cost standpoint and maybe your decision is already then made?",
          "score": 1,
          "created_utc": "2026-02-10 01:19:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4poggy",
          "author": "AnyMiniMoo",
          "text": "My opinion is your second option you should just forget about it and remove it from existence. \n\nBut the idea about the car wash have you thought about doing a portable car wash literally a pickup truck with its own water pump system on the back of it that is being able to be sprayed because you have an air pump connected to it that's running on gas probably or you could have a generator so that you have plugs to be able to buff out vehicles or do other types of cleaning and stuff two of vehicle",
          "score": 1,
          "created_utc": "2026-02-11 00:12:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4pva6g",
          "author": "Competitive-Fox-1743",
          "text": "1. The mall car wash idea solves a real convenience problem. People hate waiting, malls need traffic, and winter makes this even more valuable. The main challenges are permits, water use, insurance, and winter conditions, so starting with simple low water detailing and interior cleaning makes the most sense.\n2. The budget sharing idea has a real emotional need behind it, but it will be hard to execute. Trust, privacy, and getting enough users to make comparisons useful are big hurdles. A simpler version would be collecting spending by categories and showing averages by income and family type instead of sharing full spreadsheets.",
          "score": 1,
          "created_utc": "2026-02-11 00:52:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4qhjds",
              "author": "Apricotsandtoast",
              "text": "Yeah, that makes sense on both ideas.",
              "score": 1,
              "created_utc": "2026-02-11 03:06:14",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4qj20q",
          "author": "Apricotsandtoast",
          "text": "Additional question: if I went with the car wash idea, does it make any sense to partner with an existing car wash company who already has all the equipment needed?  I'm a stay-at-home mom and part-time bookkeeper for a small business.  I would obviously quit my part-time job to pursue this but my availability, knowledge of the car wash business, access to equipment is very limited.  My husband is the bread winner so it's ok if this business takes a little longer to be pouring in the money.  Please no judgements on this, I really am just looking for business advice.",
          "score": 1,
          "created_utc": "2026-02-11 03:15:49",
          "is_submitter": true,
          "replies": []
        },
        {
          "id": "o4twzgx",
          "author": "cewp",
          "text": "The mall car wash idea reminds me of a business I came across – a car detailer setup in the parking lot at a golf course. They would detail your car while you play a round of golf. Good business model imo. ",
          "score": 1,
          "created_utc": "2026-02-11 17:15:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4uv5zs",
          "author": "Ok-Conference-1336",
          "text": "The car was concept is common in U.K. shopping malls. You either see them really full or really empty and have become increasingly more expensive than a regular wash elsewhere due to the mall’s rent cost.",
          "score": 1,
          "created_utc": "2026-02-11 19:55:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4d3g6e",
          "author": "Ecaglar",
          "text": "the mall car wash idea is solid - you solve the waiting problem AND drive traffic to a dying retail format. malls would probably cut a deal because theyre desperate for foot traffic. the budget app has validation issues tho - people lie about money and the shame factor would kill adoption",
          "score": 0,
          "created_utc": "2026-02-09 02:23:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4dauu3",
              "author": "Apricotsandtoast",
              "text": "But wouldn't the anonymous factor of the budget app eliminate the need/desire to lie and the shame?",
              "score": 1,
              "created_utc": "2026-02-09 03:01:43",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4l5yqp",
          "author": "Ok-Carob6350",
          "text": "Both ideas are interesting — #1 feels **more immediately monetizable**, #2 is **valuable but harder** because of trust + privacy.\n\n\n\n**1) “Mall garage car wash while you shop”**\n\n\n\n* This is legit: convenience + winter pain + “kill two birds” is a real pull.\n* Biggest hurdles: **water runoff / drainage rules, permits, insurance/liability, access to water/electric**, and mall/operator contracts. Winter adds freezing issues.\n* The simplest v1 is not a full tunnel wash — it’s **eco/low-water detailing** (rinseless wash + interior) with booked slots, done by crews in a dedicated section of the garage.\n* If you can get one mall to say yes, it’s a strong wedge: malls want **foot traffic + revenue share**. You’d pitch it like a pop-up service.\n\n\n\n\n\n**2) Anonymous budget spreadsheet sharing by income**\n\n\n\n* The “I want to see how similar households spend” is a *real* need (and couples will use it).\n* Hard parts: people won’t upload raw sheets unless you nail **privacy + anonymization**, and you need enough volume to be useful.\n* A better MVP: users paste numbers into categories (housing, food, travel, childcare, etc.) and you show **percentiles by income + location + family size**. No raw spreadsheets.\n* Monetization could be optional: “compare vs peers” + “couples budget alignment” tools, but you’d need trust first.\n\n\n\n\n\nIf I had to pick: **#1 is a clean local business with fast validation** (go talk to mall management + run a weekend pilot). **#2 is a longer-term product** that needs careful privacy design + data density.",
          "score": -1,
          "created_utc": "2026-02-10 09:29:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4lyld1",
              "author": "Apricotsandtoast",
              "text": "Thanks so much for this feedback. Very helpful recommendations and analysis.",
              "score": 1,
              "created_utc": "2026-02-10 13:18:27",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4n3n93",
                  "author": "Ok-Carob6350",
                  "text": "Glad you found it helpful. Thanks",
                  "score": 1,
                  "created_utc": "2026-02-10 16:45:57",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o4m7w1v",
              "author": "Solid_Mongoose_3269",
              "text": "Thanks, ChatGPT",
              "score": 1,
              "created_utc": "2026-02-10 14:10:11",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4n5uk0",
                  "author": "Ok-Carob6350",
                  "text": "For your reference, it is not written by ChatGPT. What do you gain by degrading people like that? Genuine question.",
                  "score": -1,
                  "created_utc": "2026-02-10 16:56:03",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1r1j8rh",
      "title": "business idea feedback- improved vending machine",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1r1j8rh/business_idea_feedback_improved_vending_machine/",
      "author": "Big-Meringue1411",
      "created_utc": "2026-02-11 01:08:02",
      "score": 6,
      "num_comments": 12,
      "upvote_ratio": 0.81,
      "text": "I have an idea for a new type of vending machine that dispenses fountain soda instead of regular bottles. the profit margins would be about 60% more than that of regular vending machines since concentrated syrup is cheaper than full bottles. the only real problems are that its going to need a water line to be installed and sanitation could become an issue. other than that it seems promising",
      "is_original_content": false,
      "link_flair_text": "Idea Feedback",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1r1j8rh/business_idea_feedback_improved_vending_machine/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o4pzpds",
          "author": "amberjletang",
          "text": "Interesting idea, the margin logic makes sense on paper, but the constraints you mentioned are actually the whole business here, not side issues.\n\nThe need for a water line massively limits placement. Traditional vending works because it can be dropped almost anywhere. As soon as you require plumbing, permits, and ongoing sanitation checks, your buyer is no longer a vending operator, it is a venue operator who already has alternatives like fountains or bar soda guns.\n\nSanitation is also not a small problem. Anything involving reusable nozzles, ice, or exposed liquid creates maintenance and liability costs that can easily erase the margin advantage unless you solve this with a very simple, very robust design.\n\nIf I were pressure testing this, I would first ask where this works better than existing options. High foot traffic venues that do not want staff involvement but already have water access might be the only real fit. Offices, gyms, campuses, hospitals. If you cannot clearly name the buyer and the installation decision maker, that is where most hardware ideas die.\n\nNot saying it cannot work, but the success here is less about soda economics and more about installation friction, compliance, and who actually says yes.",
          "score": 4,
          "created_utc": "2026-02-11 01:18:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4pyops",
          "author": "hunt27er",
          "text": "Coca-Cola has this type of machines which can dispense something like 120 different flavors. Most gas stations (USA) have the fountain soda already which use syrup bags delivered by coke/pepsi. You’re gonna have to go back to the drawing board bud.",
          "score": 2,
          "created_utc": "2026-02-11 01:12:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4q1mvz",
              "author": "Big-Meringue1411",
              "text": "but mine could be portable. it could be placed in rec centers, gyms, universities, and anywhere with a waterline and foot traffic",
              "score": 2,
              "created_utc": "2026-02-11 01:30:13",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4qhwdr",
                  "author": "gridsandorchids",
                  "text": "Its not really portable if it needs a water line and maintenance right? You also have to supply disposables like cups, lids, etc. It would be more complex than a gas station fountain, not less.\n\nThe aforementioned coke machines are super sophisticated and expensive. The main benefit is selection and novelty.\n\nhttps://share.google/images/JT3SpFUpP18eg9ZVs",
                  "score": 1,
                  "created_utc": "2026-02-11 03:08:29",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o4sma0p",
                  "author": "senraku",
                  "text": "They call it a Culligan",
                  "score": 1,
                  "created_utc": "2026-02-11 13:21:21",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4r0kye",
          "author": "InvitePatient9411",
          "text": "You mentioned two problems that might be insurmountable.\nWater and hygiene.\nIf you have hygiene issues, it could become risky; they'll shut you down after two days.\n\nMy advice, to see if it really works, is to create one and test it in the field.\nNothing tells you better if the idea is a winner.\nCreate it somehow and then pitch it to some early adopters who can test it without you.\n\nYou'll understand much more than the numbers on paper.",
          "score": 1,
          "created_utc": "2026-02-11 05:17:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4r2gqi",
          "author": "Lucidcranium042",
          "text": "Why?",
          "score": 1,
          "created_utc": "2026-02-11 05:31:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4rhqem",
              "author": "Big-Meringue1411",
              "text": "Why what",
              "score": 1,
              "created_utc": "2026-02-11 07:44:24",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4x1lfx",
                  "author": "Lucidcranium042",
                  "text": "Why would sanitation become an issue?",
                  "score": 1,
                  "created_utc": "2026-02-12 02:58:15",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4rtwv2",
          "author": "BadFish512",
          "text": "Just do it for water. It sells for as much or more at convenient stores and don’t need the plumbing for co2. Just sell squirts off Dasani for a dollar.",
          "score": 1,
          "created_utc": "2026-02-11 09:40:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4soslk",
          "author": "ChestChance6126",
          "text": "the margin idea makes sense, syrup is cheaper. but the real issue is friction. once you need a water line and sanitation compliance, it stops being simple vending and starts looking like food service operations. I’d validate by talking to location owners first and confirming they’re willing to handle plumbing and health requirements before investing further.",
          "score": 1,
          "created_utc": "2026-02-11 13:35:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4szc0n",
          "author": "David5904",
          "text": "What about a vending machine that sells more niche drinks Tailored to middle higher class so you’ll sell like sparkling drinks and like poppi or olí pop ?",
          "score": 1,
          "created_utc": "2026-02-11 14:33:29",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qzwoyz",
      "title": "I’m building a tool to automate employee onboarding & follow-ups would this actually help managers and employees?",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1qzwoyz/im_building_a_tool_to_automate_employee/",
      "author": "Original_Map3501",
      "created_utc": "2026-02-09 06:18:39",
      "score": 6,
      "num_comments": 15,
      "upvote_ratio": 0.8,
      "text": "I’m working on a lightweight tool to improve how onboarding and training actually happen in real teams, and I’d really value honest feedback from managers and employees.\n\nThe problem I keep seeing is not a lack of docs or training content, but the **mental load** around onboarding:\n\n* Managers forgetting who needs what next\n* Employees unsure what to do after the first few days\n* Constant manual follow-ups (“did you read this?”, “did you finish that?”)\n* Progress scattered across docs, Slack, and memory\n\n# The idea:\n\nA system that quietly handles onboarding **in the background**.\n\n* Managers provide their existing content (docs, links, videos)\n* New hires automatically receive steps in the right order\n* The system tracks progress\n* Follow-ups are sent automatically if someone gets stuck\n* Managers are only notified when something actually needs attention\n\nNo heavy dashboards, no daily checking just fewer things to remember.\n\n# I’m trying to validate:\n\n* As a **manager**, would this reduce the mental effort of onboarding?\n* As an **employee**, would this make it clearer what you need to do next?\n* What part of onboarding causes the most frustration today: tracking progress, follow-ups, or clarity?\n\nI am trying to understand if this solves a real problem or if I’m missing something obvious.",
      "is_original_content": false,
      "link_flair_text": "Idea Feedback",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1qzwoyz/im_building_a_tool_to_automate_employee/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o4qohn9",
          "author": "Ok_Stay_8530",
          "text": "You've nailed the real problem. It's not missing content, it's the mental stress of tracking who did what and what comes next. The \"quiet background system\" angle is smart positioning. Managers don't want another dashboard to check, they want fewer things to worry about...\n\nThe automatic follow-ups feature alone could sell this. That one thing saves hours every week. But One question worth stress testing: who owns the buying decision? The manager who feels the pain or the HR team who controls the budget?",
          "score": 3,
          "created_utc": "2026-02-11 03:50:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4qr6xe",
              "author": "Original_Map3501",
              "text": "Great point. In smaller teams the manager usually owns the decision, but in larger orgs HR might. I’m leaning toward targeting small-to-mid teams first where the person feeling the pain can actually buy. Does that match what you’ve seen?",
              "score": 1,
              "created_utc": "2026-02-11 04:09:08",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o4qtem6",
              "author": "Original_Map3501",
              "text": "Would you be interested in trying out the mvp version of this tool and provide feedback based on your experience?",
              "score": 1,
              "created_utc": "2026-02-11 04:24:30",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4e7zcm",
          "author": "PPRec",
          "text": "This is a genuine problem. I actually was given a talk from someone because attrition of young people in my industry is an issue as they have been used to a parenting style that lays out the steps they need to take / clears a path for them and they are being managed by managers who are often super busy who assume they can 'work it out' or are too busy to spend time thinking properly about how to manage early stage careers. This is no poke at young people btw it's our challenge to manage better. I guess my feedback is be careful to not build something that feels too impersonal for the new employee though. More of an aid for the manager.",
          "score": 2,
          "created_utc": "2026-02-09 06:55:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4qtp8h",
              "author": "Original_Map3501",
              "text": "That’s a really thoughtful point. I definitely don’t want this to replace human connection more to make sure structure exists so managers actually have more space for meaningful conversations instead of chasing checklists.\n\nThe goal is clarity + follow-through, not robotic onboarding. I appreciate you calling that out. \n\nAlso would you be interested in trying out the mvp of this tool?",
              "score": 1,
              "created_utc": "2026-02-11 04:26:36",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4ggzvu",
          "author": "restacked_",
          "text": "We built a tool for my employer that does things similar. Lets them design and build workflows with approval processes and such. Multi-tenancy so our different clients could all use it for their onboarding processes. It’s an internal tool, but we built it for very large clients of ours, there is appetite for this king of tool. Good luck!",
          "score": 2,
          "created_utc": "2026-02-09 16:37:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4iwy9j",
          "author": "Ecaglar",
          "text": "onboarding tools are saturated but if you nail a specific niche like healthcare or construction where compliance is a mess it could work. generic hr tools are a tough sell tho",
          "score": 2,
          "created_utc": "2026-02-09 23:52:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4q0s2r",
          "author": "amberjletang",
          "text": "Yes this would genuinely help, and you have identified the right problem. Most onboarding tools focus on storing information, not on the cognitive load of remembering what happens next and who needs attention.\n\nAs a manager, the biggest relief here is only being notified when something actually needs intervention. That alone removes a lot of background stress. As an employee, having a clear sequence instead of guessing what is expected next would reduce anxiety, especially after the first week when support usually drops off.\n\nOne thing to watch is flexibility. Onboarding often changes based on role, pace, or context, so allowing lightweight adjustments without rebuilding flows will matter. But the idea of quiet automation rather than another dashboard feels like a strong direction and definitely solves a real problem.",
          "score": 2,
          "created_utc": "2026-02-11 01:24:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4qa2j2",
              "author": "Original_Map3501",
              "text": "Do you think theres really a demand for this tool that im building.",
              "score": 1,
              "created_utc": "2026-02-11 02:21:00",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4r02f2",
                  "author": "amberjletang",
                  "text": "There can be demand, but the real question is not whether the problem exists. It does.\n\nThe better question is whether people feel the pain strongly enough to pay to remove it.\n\nOnboarding frustration is common, but many teams tolerate it because it feels normal. That is what you need to test.\n\nIf three managers say “this would save me time” that is interest. If one says “I would pay for this tomorrow” that is signal.\n\nRight now you are not validating the idea. You are validating urgency.\n\nIf you can prove urgency, demand follows.",
                  "score": 2,
                  "created_utc": "2026-02-11 05:13:01",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4tavy1",
          "author": "chadvavra",
          "text": "I actually just posted about this being a problem.  \n[https://www.reddit.com/r/Business\\_Ideas/comments/1qyzwe3/comment/o4t0ohj/?context=3](https://www.reddit.com/r/Business_Ideas/comments/1qyzwe3/comment/o4t0ohj/?context=3) ",
          "score": 2,
          "created_utc": "2026-02-11 15:31:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o50rfp4",
          "author": "Weekly_Accident7552",
          "text": "This nails a real pain point. We were constantly chasing new hires for training completion and managers were forgetting to loop in IT or assign buddies. Manifestly automated the step by step checklists with auto reminders and progress nudges so HR just sets it once and it runs itself. Managers love only getting pinged for exceptions and employees say it cuts the \"what do I do next\" confusion. Definitely solves the coordination mess.\n\n",
          "score": 2,
          "created_utc": "2026-02-12 18:06:23",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qxw0tr",
      "title": "I built an idea from this subreddit and it got 50 users within a week.",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1qxw0tr/i_built_an_idea_from_this_subreddit_and_it_got_50/",
      "author": "dot90zoom",
      "created_utc": "2026-02-06 22:28:02",
      "score": 5,
      "num_comments": 4,
      "upvote_ratio": 0.63,
      "text": "There are some serious goldmines on this subreddit.\n\nLast week I built an idea that was posted a few times throughout this subreddit, and mainly a mix of ideas, [here](https://www.reddit.com/r/Business_Ideas/comments/1gwipgp/aipowered_microskill_learning/), [here](https://www.reddit.com/r/Business_Ideas/comments/1jrki4k/selling_my_2yo_saas_learningwithai/) and [here](https://www.reddit.com/r/Business_Ideas/comments/1gwipgp/aipowered_microskill_learning/).\n\nThe app is basically \"Duolingo for Anything\".\n\nIt took me \\~4months to build, even with my degree in ML, there were a lot of challenges as I really wanted to ensure that the courses generated were Quality and built around the user's learning habits, the more the user used the app.\n\nEventually if this thing grows, I hope to have a mix of both real generated courses that users can submit, as well as AI courses for more niche topics. I wanted to know if you guys think this would be a good idea, and business model, perhaps teachers getting a commission off courses they submit (and are used).",
      "is_original_content": false,
      "link_flair_text": "Idea Feedback",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1qxw0tr/i_built_an_idea_from_this_subreddit_and_it_got_50/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o4d3s0k",
          "author": "Ecaglar",
          "text": "50 users in a week from an idea you found here is actually a good sign. most people never ship anything. what matters now is whether those 50 are using it consistently or just signed up and bounced",
          "score": 2,
          "created_utc": "2026-02-09 02:25:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o40xckg",
          "author": "Ecaglar",
          "text": "50 users in a week is solid validation. the teacher commission model is interesting but youd need to figure out quality control - ai generated stuff can be hit or miss and if you mix in human courses youll need some way to verify theyre actually good. curious what your retention looks like after week one, thats usually where learning apps struggle",
          "score": 0,
          "created_utc": "2026-02-07 04:00:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3zh852",
          "author": "tatum103",
          "text": "I’m diagnosed with adhd, so I feel like this could help me with my studies. do you mind giving me the name?\n\nalso yes, if there the human submitted courses, they will be more tailored for humans",
          "score": -2,
          "created_utc": "2026-02-06 22:45:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3zi7k2",
              "author": "dot90zoom",
              "text": "[sure, here's the App Store link](http://trycoursify.com)  \n  \nfeel free to give feedback, its still new so tell me any thing wrong\n\nit has a free trial. I will add a freemium model as it grows but currently ai credits are expensive, so I need to stay even ;-;",
              "score": -1,
              "created_utc": "2026-02-06 22:50:39",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qz45sh",
      "title": "Weekly Free For All Thread - Spam your business - Post your surveys - Tell us about your awesome MLM scheme - [UNMODERATED POST] (except for site rules of course)",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1qz45sh/weekly_free_for_all_thread_spam_your_business/",
      "author": "AutoModerator",
      "created_utc": "2026-02-08 09:01:01",
      "score": 5,
      "num_comments": 11,
      "upvote_ratio": 1.0,
      "text": "Hey r/Business_Ideas! \n\n**Welcome to Small Business Sundays!** \n\nThis is the ONLY place you can solicit on this subreddit, so feel free to plug your business and services here and get the word out about your offerings! \n\nYou should try to include:\n\n* your industry\n* your experience (or portfolio)\n* the type of customer you're looking for\n* any other relevant info \n\nThe only rules still in force are Reddit's site-wide rules and 'Be Real & Be Nice', otherwise, spam away!",
      "is_original_content": false,
      "link_flair_text": "WEEKLY THREAD",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1qz45sh/weekly_free_for_all_thread_spam_your_business/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o49twga",
          "author": "SolidHuman9936",
          "text": "My wife has a 1000-day Duolingo streak and still could not write or communicate efficiently - so I built something for her\n\nShe has been learning English and French for years.  \nShe’s consistent. She has a \\~1000-day Duolingo streak. She can communicate. (well she can in English but she is not improving)\n\nBut every time she tried to *write* \\- short messages, emails, journaling - she’d say the same thing:  \n“I know this is wrong, but I don’t know why.”\n\nIf you’re stuck at that annoying intermediate plateau and like writing, I’m very open to feedback (good or bad).\n\n[https://polyglotty.io](https://polyglotty.io/)\n\n[https://apps.apple.com/pl/app/polyglotty-language-learning/id6757529562](https://apps.apple.com/pl/app/polyglotty-language-learning/id6757529562)",
          "score": 2,
          "created_utc": "2026-02-08 16:18:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o48d5jk",
          "author": "ajay9452",
          "text": "i built bulk invoice to excel tool. Here you can dump 1000s of invoices -> get the excel with columns like vendor, date, total, or anything u define.\n\n[validinvo.com](http://validinvo.com)",
          "score": 1,
          "created_utc": "2026-02-08 10:29:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4or9tb",
          "author": "Special_Quote7039",
          "text": "I have created a list of 20 business ideas that are aimed at young people that want to start making some level of money. I would love if someone were to take a look and review it as well as the concept so I can improve it for the better :)",
          "score": 1,
          "created_utc": "2026-02-10 21:21:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4zw9vf",
          "author": "BattleBornClothing",
          "text": "High quality Screen printing and embroidery services, DTF printing as well as premium Toyota Apparel Located in Yerington,NV and shipping world wide. Curently looking for high volume orders to keep our massive printing press running. [https://shopbattlebornclothing.com/](https://shopbattlebornclothing.com/)",
          "score": 1,
          "created_utc": "2026-02-12 15:40:48",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qxfhso",
      "title": "21yo Merchant Mariner saving up capital. Want to build a business/invest but I’m at sea 6 months a year. Where should I start?",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1qxfhso/21yo_merchant_mariner_saving_up_capital_want_to/",
      "author": "Fuzzy_Examination_96",
      "created_utc": "2026-02-06 11:48:05",
      "score": 5,
      "num_comments": 5,
      "upvote_ratio": 1.0,
      "text": "Hi Reddit! I’m 21, and I work as a sailor. My job keeps me away at sea for long periods, which gives me two things: a decent salary to invest and a lot of time to think/learn, but zero physical presence on land.\n\nI don’t want to be a sailor forever. I want to build a business that I can eventually scale or manage remotely.\n\nI have no physical access to a shop/office for months.\n\nSaving up a good portion of my income.\n\nI have never run a business before. \n\nWhat kind of business models would you recommend for someone with my lifestyle? Should I focus on high-yield investments, or start building a digital brand/agency while I’m on watch? I’d love to hear some \"out of the box\" ideas",
      "is_original_content": false,
      "link_flair_text": "What business do I start?",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1qxfhso/21yo_merchant_mariner_saving_up_capital_want_to/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o3zb9kr",
          "author": "choclate45",
          "text": "a service based agency model could be your best bet for now. add that to the investments you are already doing and you should be set for when you retire/deboard in the next 5 years.\n\njust play around with your skills and interest when you off watch, groom them to the degree that you confident to render a service and start from there. also, please don't grind too much in your off hours, safety at sea is paramount. ahoy!",
          "score": 1,
          "created_utc": "2026-02-06 22:14:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3zfgu0",
          "author": "Ok_Stay_8530",
          "text": "Do you have any skills / experience that you can productitize for a specific niche?",
          "score": 1,
          "created_utc": "2026-02-06 22:36:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o405icc",
          "author": "Solid_Mongoose_3269",
          "text": "Stay a merchant mariner. My dad was a chief engineer, and barely got his white jumpsuit dirty. Ai isn’t coming after those jobs",
          "score": 1,
          "created_utc": "2026-02-07 01:04:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o40xeob",
          "author": "Ecaglar",
          "text": "your constraint is actually an advantage for certain business models. anything that can run async while youre at sea is perfect. content sites, digital products, or investing in index funds all work. the agency model mentioned by another commenter is tricky because clients usually want fast responses. id lean toward building something with your unique perspective - content about life at sea, or tools for other mariners. you know that world way better than anyone on land",
          "score": 1,
          "created_utc": "2026-02-07 04:00:58",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r0xvtf",
      "title": "Is Northwest registered agent actually legit?",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1r0xvtf/is_northwest_registered_agent_actually_legit/",
      "author": "brian135792",
      "created_utc": "2026-02-10 11:06:42",
      "score": 5,
      "num_comments": 13,
      "upvote_ratio": 0.86,
      "text": "TL.DR: Looking for a deep dive review/experience before I pull the trigger for a Texas LLC. \n\nHey everyone.\n\nI could really use some real-world feedback right now. I'm planning to start a service-based business and I'll likely be operating in multiple states eventually, but starting off with Texas.\n\nI've been looking at Northwest Registered Agent and they seem to be darling of Reddit compared to other services like Legalzoom or Zenbusiness. But I'm always skeptical when it sounds too good to be true, or over-whelming good reviews. \n\nI've read that they let you use their office address on the actual Articles of Organization (not just for service of process). Does this actually work in Texas to keep my home address off the public record?  \n  \nThey claim they scan everything locally and notify you immediately. For those who use them, is the dashboard actually clean? There's a lot of talk about having Corporate Guides instead of a random call center. Has anyone actually called them with a weird question? Do they actually know their stuff, or is it just marketing speak for \"customer support\"?\n\nAnd since I'm looking at expanding, how easy is it to add a second or third state later? Is it a nightmare to manage multiple registered agents through one account?\n\nI had a friend who used a different LLC formation service, and while the first year was $0, the renewal fee jumped to like $300 without warning. I’ve also heard horror stories about some services selling your data to business credit telemarketers the second you file. Do Northwest actually respect your data, or am I going to get 50 calls a day for business loans once I sign up?\n\nIf you've used them recently (especially in 2025/2026), I’d love to hear the good, the bad, and the ugly.",
      "is_original_content": false,
      "link_flair_text": "No applicable flair exists for my post",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1r0xvtf/is_northwest_registered_agent_actually_legit/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o4m8sd7",
          "author": "Hecker8778",
          "text": "I've been using Northwest for about 3 years now, and they're legit the only ones who didn't bait and switch me on fees. Places like ZenBusiness get u with that $0 entry but then hit u with massive renewals later, whereas NW has stayed flat for me the whole time. The privacy thing is real too—they let u use their address for the filings so ur home address doesn't get blasted on the public record, and their support is actual people who know what they're talking about, not just reading scripts. If u want to avoid the spam calls and keep ur data somewhat safe, they're probably ur best bet for a service-based biz.",
          "score": 2,
          "created_utc": "2026-02-10 14:15:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4mhxci",
              "author": "CharacterFarm8196",
              "text": "so you pay the same amount every year? How much did it cost to file initially? If you remember..\n\n",
              "score": 1,
              "created_utc": "2026-02-10 15:03:04",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4plz59",
                  "author": "SilverTongueSociety",
                  "text": "It depends on what services you’re paying for (they have a LOT of options) but their prices are very upfront.",
                  "score": 1,
                  "created_utc": "2026-02-10 23:59:03",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4mwno8",
          "author": "InitialWorldliness91",
          "text": "They are one of the biggest registered agents and are multistate I use them for my C-Corp and an LLC. Not expensive and their web portal does the job.\n\nI first started in 2011 and the price has remained pretty stable. I don't recall the price but it's less than $150 year.\n\nI don't recall ever getting spam from anything that is tied to my businesses.",
          "score": 1,
          "created_utc": "2026-02-10 16:13:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4tbxvb",
              "author": "SquidChair",
              "text": "Wow. You've been using them for 15 years and the fact that the price has remained stable tells a lot of about how stable they are. Do you remember what you paid for filing back then?",
              "score": 1,
              "created_utc": "2026-02-11 15:36:55",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4tknnq",
                  "author": "InitialWorldliness91",
                  "text": "My bad, in 2017 I switched to Buffalo Registered Agents because at the time Northwest was $99 and Buffalo was and still is $49.",
                  "score": 1,
                  "created_utc": "2026-02-11 16:17:41",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4n36up",
          "author": "edyang73",
          "text": "They are def legit and take user privacy very seriously, solid option.",
          "score": 1,
          "created_utc": "2026-02-10 16:43:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4pww6i",
          "author": "Ornery_Day_6483",
          "text": "I’ve used other agents and they actually lost IRS mail. NW always promptly forwards.",
          "score": 1,
          "created_utc": "2026-02-11 01:01:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4q2onm",
          "author": "amberjletang",
          "text": "I have seen a lot of the same feedback you mentioned and my impression is that they are legit, but very much a registered agent first rather than a full formation hand holding service.\n\nUsing their address for public filings does work in many states for privacy purposes, but it is still important to understand which address appears where and what still needs to be disclosed at the bank or tax level. That is usually where people get surprised.\n\nFrom what I have heard, the dashboard and scanning are solid and the appeal is consistency and privacy rather than bells and whistles. The bigger risk is not the service itself but forgetting about renewals or assuming everything is covered automatically.\n\nIf you are expanding to multiple states, having one provider can simplify things, but costs add up quickly so it helps to be very intentional about where you actually need to register versus where you are just operating remotely.",
          "score": 1,
          "created_utc": "2026-02-11 01:36:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4tbj46",
          "author": "SquidChair",
          "text": "I transferred my LLC to Northwest Registered Agent LLC service after the second year of forming it due to upsell and and high cost from the previous registered agent I was using. And I've had a great experience with them since then.\n\nI'd say they are transparent with pricing with no upselling like you see with the other LLC services in this space. And their customer service is really responsive. At least, based on my experience with them.\n\nSo I believe the reason why they get so much love on Reddit is that they're low-key, reliable, and don't nickel-and-dime you like some of the others. I'm talking about Zenbusiness, Legalzoom, Bizee.\n\nIf I had to do it again, I'd still choose Northwest without hesitation. ",
          "score": 1,
          "created_utc": "2026-02-11 15:34:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4xf85d",
          "author": "Savini72",
          "text": "They seem solid. Just be aware and I'm pretty sure about this: you can't use their addresses for Google My Business if that is important to you (as it is for most business types.)\n\nWhen you create your GMB, you'll need to add an address and have a verification postcard sent by Google's verification system.\n\nGoogle has flagged these virtual address providers (along with coworking spaces, shared offices, PO boxes etc.) due to shady marketers doing shady stuff in Google/Google Maps using those addresses.  This means you'll have challenges or find it impossible to use a Northwest address for GMB.\n\nGiven GMB is massively important place to create social proof with online reviews and huge driver of business for us, not being able to verify a GMB would be a total deal breaker.  Would that be an issue for you?\n\nOther than that ... I hear nothing but good things about them, as you can see from the other comments in here.",
          "score": 1,
          "created_utc": "2026-02-12 04:28:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o50mzzk",
          "author": "Aldoperu",
          "text": "They're fine for simple business structures. But not the best choice for more complex setups. I personally had a negative experience using one of these LLC services (not northwest) for my multi-state real estate holdings. They provided incorrect advice regarding my privacy and other matters and made some filing errors.\n\nIf your business structure is straightforward, you might consider using an online LLC formation service like Northwest Registered Agent. But if you have a more complex need, I would advice you to explore other options such as consulting with a business attorney. ",
          "score": 1,
          "created_utc": "2026-02-12 17:45:58",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r1ws2i",
      "title": "I GOT MY FIRST MASSIVE PRODUCT SHIPMENT WITHOUT SCAMS",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1r1ws2i/i_got_my_first_massive_product_shipment_without/",
      "author": "OKAMI_TAMA",
      "created_utc": "2026-02-11 13:02:07",
      "score": 5,
      "num_comments": 5,
      "upvote_ratio": 1.0,
      "text": "When I first decided to order in bulk I was terrified I would lose money or end up with boxes of junk that no one would use and pages of messages back and forth without an answer. I spent weeks reading what others posted here and noticed the difference between marketplaces like Made-in-China.com and older sites where you could easily get ghosted or get low quality products that were not like the pictures you saw. The ease of sending photos and having suppliers reply quickly changed my whole view on how sourcing should work and it made me feel like I was finally in control of the process. I placed an order and waited with that nervous feeling you get when you spend too much on something you have never seen before, and when it arrived I realized the quality was much\nbetter than I expected because I had drilled down on details like exact measurements and fabric type before I paid.",
      "is_original_content": false,
      "link_flair_text": "No applicable flair exists for my post",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1r1ws2i/i_got_my_first_massive_product_shipment_without/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o4smlr5",
          "author": "iblamechauhan",
          "text": "That nervous wait after placing a big order is something every importer remembers, and the only\nreason mine went smoothly was because I forced myself to slow down and double check details\non platforms like Made-in-China.com instead of rushing.",
          "score": 2,
          "created_utc": "2026-02-11 13:23:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4so1iy",
          "author": "Successful-Rate-1839",
          "text": "Sooooo what’s the product?!",
          "score": 2,
          "created_utc": "2026-02-11 13:31:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4tpopw",
          "author": "barry_allen_8804",
          "text": "Congrats mate, that first bulk order is terrifying its kinda phobia but it goes away.   \ngood you did  : not over-communicate specs before paying. I also always request production photos + small paid samples first. Did you use trade assurance or escrow?",
          "score": 2,
          "created_utc": "2026-02-11 16:41:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4sll0i",
          "author": "Ok_Conference_4115",
          "text": "What are you selling if I may ask?",
          "score": 1,
          "created_utc": "2026-02-11 13:17:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o50xf0i",
          "author": "Jazzlike-Reporter152",
          "text": "As a manufacturer myself I didn’t know how common such scams were",
          "score": 1,
          "created_utc": "2026-02-12 18:34:09",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qzlu9j",
      "title": "In a mess with loan, need ideas",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1qzlu9j/in_a_mess_with_loan_need_ideas/",
      "author": "Soul_of_Garlic",
      "created_utc": "2026-02-08 21:44:05",
      "score": 5,
      "num_comments": 18,
      "upvote_ratio": 0.78,
      "text": "My life is a mess financially. I made the dumbest decision of my life in 2021. The devil called and I accepted, that is, the SBA called and offered me a loan during Covid that crippled me and now, bankruptcy seems to be the only way out.\n\nHowever, I don’t want to do that.\n\nMonthly payments — $4,000\n\nStill have around $150K\n\nThe business LLC is still in operation but only generates roughly $700 gross monthly.\n\nI have a w2 job making $130K/annually.\n\nNo payments have ever been late or missed.\n\nI was one of the first to market in my state for search engine marketing I had many good years, but competition became fierce. Meanwhile, I never figured out how to scale. I’m creative, great with clients, and get results, but definitely lack business acumen in certain areas.  The main purpose was to have the time to raise my daughters. Also, severe depression/anxiety happened in 21, and I lost a lot of momentum (and clients).\n\nIn terms of scaling, I can’t in good conscience spend a cent more of this money to market my failing LLC.\n\nI’m working on finding a couple of second jobs as a commission-only sales rep for other marketing agencies to bring in some extra cash.\n\nMy questions are: How could I put some of the money that remains to use in a smart way so that it grows? High-yield savings is the obvious choice, but curious if anyone has any other ideas?",
      "is_original_content": false,
      "link_flair_text": "Marketing / Operational / Financial / Regularotry Advice sought",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1qzlu9j/in_a_mess_with_loan_need_ideas/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o4q1sn5",
          "author": "amberjletang",
          "text": "First off, I want to say this does not read like someone who made reckless choices. It reads like someone who made a hard decision during an abnormal time, kept their commitments, and is now carrying a heavy load because of it.\n\nYou already did something important by stabilising with a W2 income and keeping payments current. That matters more than most people here will admit. At this stage, growth might actually be the wrong goal. Preserving flexibility and reducing mental pressure is probably the priority.\n\nIf the LLC is no longer viable, it is not a failure to stop feeding it. You can separate your identity and skills from that entity. Your experience still exists even if the structure does not. Sometimes the smartest move is containment rather than recovery.\n\nI do not have a magic answer, but I do think you are asking the right questions. This feels less like a money problem and more like a pressure management problem. Reducing decision fatigue and protecting your future options may be worth more than chasing returns right now.",
          "score": 4,
          "created_utc": "2026-02-11 01:31:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4tnvop",
              "author": "Soul_of_Garlic",
              "text": "Thank you for your kind feedback. \n\nIt’s a mountain of debt and unfortunately the SBA based it on the last four years of my business that were crazy good and aberrations. Digital Marketing has since changed and been disrupted by AI. \n\nThat moment from It’s a Wonderful Life hits where he stands over the bridge and replays the line from Potter, “You’re worth more dead than alive.” Except there’s no town coming to save me. I’ve contemplated tripling my life insurance and doing the honorable thing and taking the dirt nap or divorcing my wife.",
              "score": 1,
              "created_utc": "2026-02-11 16:32:41",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4c443r",
          "author": "DreamingForProperty",
          "text": "Missing way to much info.....scale your business? bankruptcy is not going to fix the problem.",
          "score": 2,
          "created_utc": "2026-02-08 23:04:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4chvij",
              "author": "NorthCoast30",
              "text": "Of course it is. He’s doing $700 a month and has a $4000 payment. Chapter 11 and restructure.\n\n“Make more money” - I’m guessing that’s crossed his mind by this point.",
              "score": -1,
              "created_utc": "2026-02-09 00:24:53",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4daorq",
                  "author": "Soul_of_Garlic",
                  "text": "I was one of the first to market in my state for search engine marketing I had many good years, but competition became fierce. Meanwhile, I never figured out how to scale. I’m creative, great with clients, and get results, but definitely lack business acumen in certain areas.  The main purpose was to have the time to raise my daughters. Also, severe depression/anxiety happened in 21, and I lost a lot of momentum (and clients).\n\nIn terms of scaling, I can’t in good conscience spend a cent more of this money, especially when I’m not sure if it will change the outcome or just dig me deeper. \n\nChapter 11 and restructuring not a bad idea — I’m trying to get PT with other digital marketing companies in commission-only sales roles. However, isn’t Chapter 11 restructuring prohibitively expensive in attorneys’ fees?",
                  "score": 1,
                  "created_utc": "2026-02-09 03:00:52",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4d3j2t",
          "author": "Ecaglar",
          "text": "thats a brutal position to be in. the 4k monthly on 130k income is survivable but painful. the business doing 700/month is dead weight - either scale it aggressively or close it and focus on side income",
          "score": 2,
          "created_utc": "2026-02-09 02:23:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4gst9p",
          "author": "ogold45",
          "text": "You have $150k or you owe 150k?",
          "score": 2,
          "created_utc": "2026-02-09 17:33:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ll2h4",
          "author": "Hopeful_Ad6095",
          "text": "I’m really sorry you’re in such a tight spot — that’s a heavy payment to carry even with a good W-2 income. One idea that might be worth exploring before throwing more money at the LLC is separating the cashflow problem from the debt problem, because they’re actually two different challenges.\nOn the cashflow side, look for predictable, demand-based income, even if it isn’t sexy. Things like small service businesses with recurring demand (cleaning, detail/maintenance, local contract work) often convert time directly into revenue, which helps with meeting payments without bleeding savings.\nOn the debt side, there are sometimes ways to restructure or refinance an SBA loan that keeps you current without as much immediate pressure — many people don’t realize that negotiation often gets better terms without bankruptcy if you go to the lender with a clear plan rather than silence.\nI know that sounds like a lot, but separating the income problem from the loan problem helped me think clearly when I was balancing income swings. It also helps you pick opportunities that actually pay bills instead of just looking “good on paper.”",
          "score": 2,
          "created_utc": "2026-02-10 11:45:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4d0bom",
          "author": "woundedkarma",
          "text": "What's the business? can it scale?  I know nothing. but you have to give people information or you're just ... not going to get any real responses.",
          "score": 1,
          "created_utc": "2026-02-09 02:07:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4gdvp1",
          "author": "Party-Inside-2871",
          "text": "Hmu message me",
          "score": 1,
          "created_utc": "2026-02-09 16:22:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4i4cqi",
          "author": "AdUnlucky2432",
          "text": "Renegotiate the loan.",
          "score": 1,
          "created_utc": "2026-02-09 21:23:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4brekf",
          "author": "azicedout",
          "text": "Bankruptcy?",
          "score": 0,
          "created_utc": "2026-02-08 21:55:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4cvz6t",
          "author": "tech1983",
          "text": "Why don’t you take some accountability instead of blaming the SBA for your shitty decisions and business.",
          "score": -2,
          "created_utc": "2026-02-09 01:44:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4d8owl",
              "author": "Soul_of_Garlic",
              "text": "It was THE worst mistake of my life, one that I replay over and over. However, you can gfy.",
              "score": 5,
              "created_utc": "2026-02-09 02:50:33",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r0wjhh",
      "title": "Creating an LLC in New Mexico - any tips or advice?",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1r0wjhh/creating_an_llc_in_new_mexico_any_tips_or_advice/",
      "author": "Aldoperu",
      "created_utc": "2026-02-10 09:45:27",
      "score": 4,
      "num_comments": 18,
      "upvote_ratio": 0.75,
      "text": "Hey everyone, I'm thinking of creating a New Mexico LLC for freelance services, is it actually as simple as it looks?\n\nI'm a freelancer in the service industry (working full-time for as single client based abroad). I'm currently at a crossroads with my business structure. I've lived outside my home country for a while now, and since the tax burden back home is spiraling, I'm looking for a more stable and cost-effective way to manage my income. \n\nI only need to issue one invoice per month. My research keeps pointing toward New Mexico as the best pick for low-maintenance setups, but I’m looking for some real-world sanity checks before I file.\n\nNM LLC seems to be the cheapest in the US. $50 filing fee and $0 annual report fees. I compared it to California’s $800 yearly tax or even Wyoming’s annual report, it feels like a steal.   \n  \nI’m not looking for complex tax shelters. I just want a straightforward structure to receive USD and keep my accounting clean. And I know New Mexico is famous for privacy, but honestly, I don't really care about that. I just want a structure that won't give me a headache during taxes.\n\nHOWEVER, I’ve heard that even if the LLC is easy to set up, getting a business bank account (like Mercury or Relay) as a non-resident can be a coin toss. Has anyone done this recently? Do I really need a physical US address, or will a CMRA (mail forwarder) suffice?\n\nI know I need an EIN to do anything. I’ve heard the \"faxing the SS-4\" route for non-residents is taking ages lately. Is it still taking 4–6 weeks, or has it gotten better?\n\nI’m planning to use a registered agent service to handle the initial filing. But before I pay the fees, I want to know, has anyone here actually regretted going the New Mexico route? \n\n",
      "is_original_content": false,
      "link_flair_text": "Marketing / Operational / Financial / Regularotry Advice sought",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1r0wjhh/creating_an_llc_in_new_mexico_any_tips_or_advice/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o4ruvyn",
          "author": "menhoan15",
          "text": "I registered a New Mexico LLC from outside the US. The registration was really smooth and I got the EIN and all. \n\nGetting a bank account as a non-resident is where I did get stuck too. None of the online banks offered to create a bank account for my country and I couldn't find a way out. I just abandoned my LLC after that because there was nothing else I could do.\n\nI would just ask you be wary of the bank account formation process for New mexico LLCs. \n\nAnd if anyone has advice for me on how i can get a bank account, please do help me out. ",
          "score": 2,
          "created_utc": "2026-02-11 09:49:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o50idt8",
              "author": "Aldoperu",
              "text": "Which banks did you try? If you only hit the Mercury, Relay, or Brex, there might be alternatives like Grabfi or Airwallex that are sometimes more flexible with international founders.\n\nDo you have your EIN letter (CP575 or 147C)? I’ve heard some people try to apply with just the application, but banks are now 100% requiring the official IRS confirmation letter.",
              "score": 1,
              "created_utc": "2026-02-12 17:24:02",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4majlx",
          "author": "IntroductionLumpy552",
          "text": "New Mexico’s $50 filing and no annual fee are genuine perks, but the real hassle is the banking – non‑resident owners still need a US address that a registered‑agent mailbox rarely satisfies, so expect extra paperwork or a friend’s address to get an account. The EIN process for foreign owners has improved; most get it within a week after a properly completed SS‑4, so the delay isn’t a deal‑breaker.",
          "score": 1,
          "created_utc": "2026-02-10 14:24:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4mhl7x",
              "author": "CharacterFarm8196",
              "text": "Could you explain more on the extra paperwork point? Do you mean getting a virtual address in NM?",
              "score": 2,
              "created_utc": "2026-02-10 15:01:19",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4rvzbb",
                  "author": "IntroductionLumpy552",
                  "text": "Banks usually want a real street address — a utility bill or lease in a friend’s name works better than a simple mailbox, so you’ll need to gather that proof of residency; a virtual NM address often isn’t enough. If you can use a trusted local contact’s address for the account, the extra paperwork is usually just a few forms confirming that link.",
                  "score": 1,
                  "created_utc": "2026-02-11 09:59:10",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o50gvux",
              "author": "Aldoperu",
              "text": "I've heard some people are getting around the mailbox ban by using specialized virtual mailbox services that provide a true physical street address.",
              "score": 1,
              "created_utc": "2026-02-12 17:16:51",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o50r6r9",
                  "author": "IntroductionLumpy552",
                  "text": "Exactly, those virtual mailbox services can give you a real street address, but many banks still want additional proof like a utility bill, so having a friend's address as a backup can save you extra hassle.",
                  "score": 1,
                  "created_utc": "2026-02-12 18:05:13",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4mlep4",
          "author": "Christine2912",
          "text": "Yes, opening a business bank account can be a hassle. \nI do have accounts in Mercury, Relay and Meow as a non resident. \n\nI got it done from https://incorply.xyz/\nIn their LLC package they offer the application process for banks, EIN for these plus help with the forms",
          "score": 1,
          "created_utc": "2026-02-10 15:20:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o50hedp",
              "author": "Aldoperu",
              "text": "Are you planning to pay yourself a salary or just draw the funds as a member distribution? I'm asking because that might change how I approach the banking setup.",
              "score": 1,
              "created_utc": "2026-02-12 17:19:19",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4mqacw",
          "author": "So_Heres_The_Thing12",
          "text": "The best thing you can do when dealing with banks is to reach out to them and ask what they would need from you to open an account. All banks are different and may require different things, so give a couple a call.  My registered agent suggested that to me and it saved me a lot of time. \n\nI'd also say to make sure you have a good registered agent. Mine has been awesome, helped me get everything set up and even helped me keep things as private as possible. For me it's def been worth the money.",
          "score": 1,
          "created_utc": "2026-02-10 15:44:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4tc8ok",
              "author": "SquidChair",
              "text": "Which registered agent are you using for your NM LLC, if you don't mind me asking?",
              "score": 1,
              "created_utc": "2026-02-11 15:38:21",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4ux1gr",
                  "author": "So_Heres_The_Thing12",
                  "text": "Sure thing! Northwest Registered Agent",
                  "score": 1,
                  "created_utc": "2026-02-11 20:04:05",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o50hxyc",
              "author": "Aldoperu",
              "text": "Nice to know your registered agent was worth it. I’m still on the fence about whether a premium agent actually gets you through the door with banks, or if they just provide a nicer dashboard for the same $50 filing. Did your agent provide a unique physical address for the banking application, or did they just help with the state paperwork?\n\nAlso, if you don't mind me asking, how long did it actually take for your EIN to come back? I'm still hearing horror stories about the 4-6 week fax wait for non-residents.",
              "score": 1,
              "created_utc": "2026-02-12 17:21:55",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4td555",
          "author": "SquidChair",
          "text": "Don't let the $0 tax thing fool you. As a foreign-owned single member LLC in New Mexico, you have to file Form 5472 and Form 1120-F with the IRS.\n\nThe penalty for missing this is currently more than $25K. The LLC is cheap, but the specialized accountant to get you out of this mess isn't. So just make sure you have everything covered from the beginning. ",
          "score": 1,
          "created_utc": "2026-02-11 15:42:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4xflfx",
          "author": "Savini72",
          "text": "Since you mentioned working for a single client abroad, be careful with how you structure your contracts. If you’re a single-member LLC, the IRS views you as a disregarded entity.\n\nEven if you owe $0 in US tax (because your work is performed outside the US), you must file Form 5472 and Form 1120 every year. The penalty for missing this is now $25,000. NM’s $0 annual fee is great, but the cost of a US tax accountant to handle these specific \"Foreign-Owned LLC\" forms is where your real maintenance cost will be.\n\nAlso, you mentioned comparing New Mexico to California’s $800 tax. Just a heads up: if you ever decide to move to California (or any state with high taxes) while running your NM LLC, CA will still demand that $800. They consider you \"doing business\" in CA if the person running the show (you) is physically located there. But as long as you stay abroad, you’re in the clear.",
          "score": 1,
          "created_utc": "2026-02-12 04:31:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o50kotn",
          "author": "Big_Caregiver_7301",
          "text": "Hey, looks like you’re trying to set up a New Mexico LLC for your freelance services and want a straightforward, low maintenance structure. I was in a similar position and found that New Mexico is great for this $50 to file, no annual report fees, and minimal hassle. I used BusinessAnywhere to help with the LLC filing. They made the process really smooth, and everything was set up without issues. The EIN took a few weeks (about 5 weeks for me as a non-resident), but that’s pretty typical. For the U.S. business bank account, it can be a bit tricky as a non-resident, but I used a CMRA (mail forwarding service) for the physical address, and that worked fine. Just double-check with the bank to see if they accept that setup. Once the LLC was in place, the rest of the process was straightforward. If you’re just looking for a simple way to get started, I’d definitely recommend checking out BusinessAnywhere. They handled the filing, and I didn’t have to deal with any headaches.",
          "score": 0,
          "created_utc": "2026-02-12 17:34:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o50l315",
              "author": "Aldoperu",
              "text": "how much did it cost?",
              "score": 1,
              "created_utc": "2026-02-12 17:36:51",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o51kkqp",
                  "author": "Few_Resident_3251",
                  "text": "Did if you can't tell that's AI bot spam you shouldn't be starting a business.",
                  "score": 1,
                  "created_utc": "2026-02-12 20:24:27",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1r2252q",
      "title": "Creating an LLC in Pennsylvania - have some questions",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1r2252q/creating_an_llc_in_pennsylvania_have_some/",
      "author": "WALWAL44",
      "created_utc": "2026-02-11 16:34:48",
      "score": 3,
      "num_comments": 11,
      "upvote_ratio": 0.72,
      "text": "Finally pulling the trigger on a Pennsylvania LLC (Philly area) and have some quick questions about the Registered Office vs Registered Agent thing?\n\nI’m finally starting my own HVAC/handyman business here in Delco after talking about it for like three years. I’m doing the paperwork on the PA Business One-Stop Shop portal tonight, but I’m a little stuck on the \"Registered Office\" section.\n\nI know most states call it a \"Registered Agent,\" but PA seems to insist on a physical \"Registered Office\" address. I'm currently working out of my house. Is it a bad idea to just use my home address? I’ve heard horror stories about your personal address being plastered all over public records for every solicitor to find, but I don't really want to shell out $200/year for a CROP (Commercial Registered Office Provider) if I don't have to.  \n  \nAlso, I saw that PA just switched from that weird 10-year \"decennial\" report to a **yearly $7 report** starting last year. If I file my Certificate of Organization today (Feb 2026), is my first $7 report due by Sept 30th of *this* year, or do I get a pass until 2027?  \n  \nThe online portal mentions a \"Docketing Statement\" (Form DSCB:15-134A). Is this something I have to fill out separately, or does the system just generate it when I finish the Certificate of Organization?  \n  \nI’m thinking of calling it \"Delco Draft & Pipe LLC,\" but I read somewhere that PA is super picky about \"restricted\" words. Does anyone know if \"Draft\" is going to trigger some manual review because it sounds like a bank or something?\n\nAny advice from fellow PA small biz owners would be huge. Trying to avoid that $125 filing fee going to waste because I checked the wrong box.\n\nCheers!",
      "is_original_content": false,
      "link_flair_text": "No applicable flair exists for my post",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1r2252q/creating_an_llc_in_pennsylvania_have_some/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o4vdkf6",
          "author": "zenbusinesscommunity",
          "text": "Using your home address for the registered office is allowed, but yeah, it becomes public record. It's still perfectly normal, just depends on personal preference. If you're not comfortable with that or don't want solicitation mail showing up, a CROP (Commercial Registered Office Provider) can handle that for you. For the annual report, if you're filing in February 2026, your first $7 report won't be due until September 30, 2027 (the year after formation). The PA DOS site has info on the docketing statement and other filing details once you're in the portal.",
          "score": 1,
          "created_utc": "2026-02-11 21:24:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o50jz53",
              "author": "Aldoperu",
              "text": "How much should a CROP cost for a PA LLC?",
              "score": 1,
              "created_utc": "2026-02-12 17:31:33",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o50n0lb",
                  "author": "zenbusinesscommunity",
                  "text": "It's usually around $100-$200/year, depending on the provider and what's included in the service.",
                  "score": 1,
                  "created_utc": "2026-02-12 17:46:03",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4x6wnh",
          "author": "WrestlingDadPA",
          "text": "I have a couple LLC's and an S-Corp, and I've recently just opened another LLC for my nephew. I used my accountant for the S-Corp and one of the LLC's, I used my office address of the S-Corp for the other LLC.... and for my nephew I just used his Mom's address because it's stable and reliable. They may get some junk mail, but it won't be anything major. No sales reps or anyone like that are going to cold call / visit a residential office address, so that's a non-issue. I'm personally way more comfortable using an address I know has a connection to me than I am trusting that Zen Business (or whoever) will reliably get me mail that comes for me.  \n\nIt's minimal.... use your home address. You can always change it later.",
          "score": 1,
          "created_utc": "2026-02-12 03:31:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o50jsww",
              "author": "Aldoperu",
              "text": "Are these LLCs based in Pennsylvania?",
              "score": 1,
              "created_utc": "2026-02-12 17:30:43",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o51hexd",
                  "author": "WrestlingDadPA",
                  "text": "Yep. I don't think that part really matters though, I think it would be the same in any state. I have an old Ohio LLC also, but it's (active) but operationally defunct. I think the answer (for me at least) would be the same regardless of state. LLC's are not a big deal or anything to waste bandwidth on. There is a lot to running a successful business, your LLC is not one of those things. ",
                  "score": 1,
                  "created_utc": "2026-02-12 20:09:23",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o503e6m",
          "author": "dtsummery",
          "text": "You are 100% correct. Pennsylvania is one of the few states that requires a Registered Office instead of a Registered Agent. It is perfectly legal to use your home address in Delco, but yes, it will be public. If a solicitor (or an angry customer) searches your LLC on the DOS Business Search, your front door is what pops up.  \n  \nYou don’t *have* to pay $200. There are Pennsylvania-based CROPs (Commercial Registered Office Providers) that charge as little as **$50–$100 a year**. If you’re doing HVAC, you’ll be out at job sites all day; if a process server ever shows up with legal papers and you aren't home, that’s a \"failed service\" which can lead to other headaches. Using a CROP ensures someone is always there during business hours.\n\nAbout that new $7 Annual Report\n\nThis is a brand-new change (Act 122).  \n  \nThe Deadline: LLC reports are due by September 30th every year.  \n  \nYour 2026 Status: Since you are forming the business *this* year (Feb 2026), you generally get a pass for your first year. Your first $7 report should be due by September 30, 2027.  \n  \nKeep an eye out for a postcard or email from the Department of State in July/August 2027. They’re being lenient with penalties for the first two years (2025-2026), but starting in 2027, they’ll actually start dissolving LLCs that forget to pay.\n\nIf you use the online portal to file your Certificate of Organization, the system automatically generates the Docketing Statement info for you. It’s basically just a summary for the Department of Revenue so they know what kind of taxes you'll be liable for. You won't need to upload a separate PDF unless you were doing a paper filing.\n\n# ",
          "score": 1,
          "created_utc": "2026-02-12 16:14:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o50jdcp",
          "author": "Aldoperu",
          "text": "You can use your home address. PA LLCs don't have a requirement for a registered agent the way Delaware or Wyoming does. They just need a physical Registered Office. Since you're service-based and going to the customer anyway, your home is your office. \n\nThe solicitor thing is real. But if you ask me honestly, as a handyman, you'll likely be putting your info on Google, Yelp, and your truck anyway. Just keep an eye on your mailbox. \n\nYou'll get official-looking scams that look like invoices for $100 compliance posters. Shred those, they're fake.",
          "score": 1,
          "created_utc": "2026-02-12 17:28:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o50v9gx",
          "author": "DisturbGamer45",
          "text": "Since you're filing your PA LLC in Feb 2026, you're safe for this year. The law (Act 122) says you file the year following the year of formation. So your first $7 is due by Sept 30, 2027. Just a heads up, PA is notorious for not sending reminders for these things.   \n  \nSet a calendar alert now for August 2027, because if you miss it, the state can eventually administratively dissolve you, which is a massive pain to fix. $7 is cheap, but the reinstatement fee isn't.",
          "score": 1,
          "created_utc": "2026-02-12 18:24:09",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}