{
  "metadata": {
    "last_updated": "2026-03-02 09:15:17",
    "time_filter": "week",
    "subreddit": "Business_Ideas",
    "total_items": 15,
    "total_comments": 126,
    "file_size_bytes": 121317
  },
  "items": [
    {
      "id": "1rckv28",
      "title": "Why helping foreigners set up a US LLC might be one of the most underrated business opportunities right now",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1rckv28/why_helping_foreigners_set_up_a_us_llc_might_be/",
      "author": "Italcan",
      "created_utc": "2026-02-23 15:43:39",
      "score": 44,
      "num_comments": 43,
      "upvote_ratio": 0.75,
      "text": "Millions of freelancers and devs outside the US - Latin America, Eastern Europe, India, Nigeria - desperately want a US LLC. Not because they live here, but because it unlocks Stripe, PayPal, US clients, and real banking. The demand is huge.\n\nThe actual cost to set someone up? Embarrassingly low. Wyoming LLC formation (\\~$99 via [InCorp](https://www.incorp.com) for example) + registered agent (\\~$129/year) = under $230 total. That's your cost base.\n\nBut foreigners don't do it themselves because the process has some issues\n\n1. EIN can't be applied online without a US SSN. Non-residents fax Form SS-4 and wait 2-5 weeks (one wrong field = start over) 2) Foreign-owned LLCs must file Form 5472 annually or face a $25K IRS penalty - most people find out *after* the fact 3) Opening a US bank account as a non-resident has gotten significantly harder since 2024\n\nNone of this is complicated. It's just confusing and terrifying if English isn't your first language.\n\nThe business: \"done for you\" setup service. You handle everything, charge $400-600, keep $200-400 margin per client. But the real opportunity is going niche - Spanish-speaking founders, Indians dealing with FEMA compliance, Nigerians locked out of Stripe Atlas. Each is an underserved community with zero localized competition.\n\nThe knowledge barrier is real but learnable. And for these clients, a US LLC isn't a nice-to-have - it's the difference between getting paid or not.\n\nAm I missing something?? I think it's to good to be true, that's why I'm asking you to give some feedback",
      "is_original_content": false,
      "link_flair_text": "Idea Feedback",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1rckv28/why_helping_foreigners_set_up_a_us_llc_might_be/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o6zmo3n",
          "author": "praneethb7",
          "text": "It’s not “too good to be true”, but it’s not as simple as it looks.\n\nA few realities you should think about:\n\n**1. Compliance risk is real.**  \nIf you mess up EIN, 5472, BOI reporting, or state filings, you’re not just losing a client, you’re exposing them to penalties. That $25k 5472 fine isn’t theoretical. You’ll need airtight processes and probably legal/accounting backing.\n\n**2. Banking is the real bottleneck.**  \nLLC formation is easy. Getting a usable US bank account without visiting physically is getting harder. If you can’t reliably solve that, your offer weakens.\n\n**3. Trust > pricing.**  \nForeign founders wiring $500+ to someone abroad need extreme trust signals, content, testimonials, community presence. This is a credibility business.\n\n**4. Long-term liability.**  \nAre you just forming LLCs? Or are you becoming their de facto compliance advisor every year? Recurring filings are opportunity… but also responsibility.\n\nThe niche angle (Spanish founders, Indian devs, etc.) is smart. But this is closer to a regulated services business than a simple arbitrage play.\n\nThe opportunity is real. The risk is in execution and liability, not demand.",
          "score": 12,
          "created_utc": "2026-02-23 17:56:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o71h8ll",
              "author": "SuperAlekZ",
              "text": "ChatGPT lol",
              "score": 3,
              "created_utc": "2026-02-23 23:17:38",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o721hzf",
          "author": "Lowkey9",
          "text": "So you want to use your SSN on what is probably a highly suspect business?",
          "score": 10,
          "created_utc": "2026-02-24 01:11:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o728ww8",
              "author": "Dry_Ninja7748",
              "text": "I’ve helped register foreign entity as owners of c corps multiple times and never had to use a ssn nor was it difficult",
              "score": 2,
              "created_utc": "2026-02-24 01:54:32",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o732s5p",
              "author": "Italcan",
              "text": "I wouldn’t touch anyone’s SSN, the whole point is helping non‑residents navigate the paperwork without shortcuts",
              "score": 2,
              "created_utc": "2026-02-24 05:02:16",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7040f7",
          "author": "Raioc2436",
          "text": "As a foreigner I’m much more price sensitive. 25K sounds bad to you? That would be life ending for me at a 6 to 1 dollar conversion rate. \n\nWhy on earth would I trust such an important legal filling to a nobody when I can go to Stripe Atlas or other services on the market with much more credibility and resources?",
          "score": 7,
          "created_utc": "2026-02-23 19:14:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o732uzh",
              "author": "Italcan",
              "text": "A lot of foreigners I’ve talked to want someone who speaks their language and guides them through the IRS forms step by step",
              "score": 1,
              "created_utc": "2026-02-24 05:02:50",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o71mtiw",
          "author": "Chris_in_Lijiang",
          "text": "Am I missing something??\n\nThe USA is currently more unpopular than at any time since it independence.  Are you also pushing time shares in South Sudan?",
          "score": 6,
          "created_utc": "2026-02-23 23:49:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6zjmn1",
          "author": "awsomekidpop",
          "text": "Your overstating the interest in this greatly, and unless that’s your entire business model your going to run into customer service hell, you’ll need efficient translation and a number for these people to call when they have questions.\n\nAdditionally rubber stamping your name an SSN on paperwork sounds easy until one of them does something wrong somewhere and the only person regulators know how to reach is you. The cost would have to match the potential harassment.",
          "score": 5,
          "created_utc": "2026-02-23 17:42:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6z8wd4",
          "author": "Queasy-Grass4126",
          "text": "It is a very good idea, but it is a bit more complicated than you make it seem and would need to be done slightly differently to work out. \n\nWhat many would need is a someone who can act as a US based co-founder for the LLC, who can handle the legal, financial, tax, and other regulatory framework for everything for the US side of the operation in a way that does not become prohibitively expensive from hiring accounts and attorneys to handle it. \n\nThen, in order to simplify the processing for receiving funds from the US bank account in their home country, they would need to form a sister corporation in their home countries to properly link them to reduce their global financial AML/CTF risk profile.\n\nSo, the best way to do this would be to create a company that helps by acting as a minority co-owner for foreigners and handles US side logistics, including offering to act as an initial point of contact with US facing clients, and then effectively outsourcing operations for the foreign national to take care of.",
          "score": 3,
          "created_utc": "2026-02-23 16:51:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o71v3fc",
              "author": "SarkHD",
              "text": "I had a family member from abroad reach out to me on behalf of someone they know who wanted to set up a US based entity to sell their products here locally and I explained this to them and they were immediately like this doesn’t worth the hassle.",
              "score": 2,
              "created_utc": "2026-02-24 00:34:56",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6zk1hy",
          "author": "_koenig_",
          "text": "This is already done...",
          "score": 5,
          "created_utc": "2026-02-23 17:43:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6zzysq",
          "author": "Puzzleheaded-Gas6210",
          "text": "This can be a great idea. As an individual located in the caribbean region (Trinidad & Tobago) I am presently looking into incorporating a dual-entity real estate development and construction platform. \n\nThe goal is to organize the platform under a US domiciled holding company (Delaware LLC) intended for investor governance and capital participation, alongside a Trinidad & Tobago-based operating subsidiary responsible for on-the-ground residential development and construction execution. \n\nThe intention is to separate capital governance at the HoldCo level from execution at the OpCo level, while deploying project-specific SPVs for individual developments once the base structure is in place. \n\nI was thinking \" if \" the best option moving forward might be finding a co-founder located in the US region who may have interest, as it could be the easiest part forward. Currently brainstorming, i'm open to any insights or advice.",
          "score": 4,
          "created_utc": "2026-02-23 18:56:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o732xvy",
              "author": "Italcan",
              "text": "hmmm, separating HoldCo and OpCo makes investor governance cleaner, isnt it?",
              "score": 1,
              "created_utc": "2026-02-24 05:03:27",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o703lw1",
          "author": "spidey_ken",
          "text": "Isn't stripe atlas doing this ?",
          "score": 4,
          "created_utc": "2026-02-23 19:13:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ze07c",
          "author": "bselite",
          "text": "The problem is there can end up being a lot of overhead when you start scaling and 50 customers all have random questions or complaints about their business being formed.\n\nAnother thing is that it’s not easy to find new customers and in the places your customers can be found. You already have places like Stripe Atlas, Doola, and a few other smaller startups. It can be done but definitely not as “easy” as it sounds.",
          "score": 3,
          "created_utc": "2026-02-23 17:15:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o721qwm",
          "author": "Jason_Steakcum",
          "text": "Surely this isn’t some targeted SEO bullshit for when you eventually change the comment and/or reply to this post with some grifter ass company you run right?",
          "score": 7,
          "created_utc": "2026-02-24 01:12:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o73w256",
              "author": "Informal-Virus4452",
              "text": "haha fair question tbh. Reddit has trained us to be paranoid.\n\nnot running some secret funnel here. just sharing a thought and getting feedback like everyone else.\n\nif I ever link something I built, I’ll say it straight up. no ninja edits, no bait and switch.\n\nhealthy skepticism is valid though. keeps the grifters nervous 😅",
              "score": 1,
              "created_utc": "2026-02-24 09:18:14",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o7ebmtk",
              "author": "spliffgates",
              "text": "Probably right",
              "score": 1,
              "created_utc": "2026-02-25 21:07:59",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o708zq7",
          "author": "Heavy_Stable_2042",
          "text": "Another chat GPT post",
          "score": 7,
          "created_utc": "2026-02-23 19:38:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6z69kp",
          "author": "Old_fart5070",
          "text": "You mean Stripe Atlas?",
          "score": 2,
          "created_utc": "2026-02-23 16:39:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o72ci1x",
              "author": "Pure-Ad2664",
              "text": "How is this not the top comment?",
              "score": 1,
              "created_utc": "2026-02-24 02:15:13",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6zsbh2",
          "author": "Leather_Replacement3",
          "text": "Practising Company Secretary and Lawyer this side based in Hyderabad. I already have incorporated Wyoming LLC and obtained EIN and other stuff. I handle FEMA RBI Compliances. There are very less people doing it.",
          "score": 2,
          "created_utc": "2026-02-23 18:21:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o71n1an",
              "author": "Chris_in_Lijiang",
              "text": "Please share how to easily obtain an EIN.",
              "score": 1,
              "created_utc": "2026-02-23 23:50:16",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o73877m",
          "author": "Divyanggjc",
          "text": "The India angle is genuinely underserved right now. Tons of freelancers and indie devs here who want Stripe access but the FEMA compliance layer adds confusion on top of already confusing IRS stuff. A service that explains it in plain Hindi or Telugu with someone actually accountable on the other end would get word of mouth really fast in those communities.\n\nThe risk is mostly trust, people handing over $500 to a stranger for legal paperwork. Nail that one thing and the business works.",
          "score": 2,
          "created_utc": "2026-02-24 05:43:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o73vsta",
          "author": "Informal-Virus4452",
          "text": "you’re not crazy, the demand is real. a lot of non-US devs would pay just to avoid IRS forms and bank drama. confusion + fear is a real opportunity.  \nbut compliance isn’t a joke. one mistake and it’s a $25k problem, not a UX bug. you’d need solid expertise or a CPA partner.  \ncompetition isn’t zero either (Stripe Atlas, Firstbase, etc). your edge would be niche + language + hand-holding.  \nI’d test it manually first. simple landing page (even mocked in Notion/Runable), talk to 10 people, see what they’re actually stuck on. promising, just not “easy money.”",
          "score": 2,
          "created_utc": "2026-02-24 09:15:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o74pv1w",
          "author": "hotcurvyangel",
          "text": "Operating in this space requires you to be hyper-vigilant about the evolving landscape of US banking regulations and anti-money laundering laws. One small mistake on an annual Form 5472 filing can land your client a massive penalty and destroy your reputation instantly.",
          "score": 2,
          "created_utc": "2026-02-24 13:16:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o75050u",
          "author": "CompiledIO",
          "text": "I used [firstbase.io](http://firstbase.io) and they charge a small fee, do an excellent job and you get amazing benefits when you register for them.\n\nI like your idea since I am a foreigner owning an LLC and would rather pay someone to ensure its setup correctly but firstbase is doing it well.",
          "score": 2,
          "created_utc": "2026-02-24 14:12:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7cgqwn",
          "author": "Bisqwa",
          "text": "You're not wrong about demand but banking is awful now. Most banks won't touch foreign LLCs remotely anymore. The compliance stuff (BOI, 5472) will eat you alive if you mess up. doola handles this exact problem, there's a reason it's not just \"file and forget\"",
          "score": 2,
          "created_utc": "2026-02-25 16:01:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7k9mwb",
              "author": "analog_afterdark6",
              "text": " You're spot on about the banking challenges; it feels like a maze out there. The compliance hurdles like the BOI and 5472 forms can truly overwhelm anyone trying to make sense of it. That's why having a service like doola can be incredibly helpful, especially when the stakes are so high.",
              "score": 1,
              "created_utc": "2026-02-26 18:51:44",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6z18hl",
          "author": "FalseRegister",
          "text": "There's not \"millions\" of people \"desperate\" for an US LLC\n\nAlso, Stripe Atlas (and many others) offer this service. Opening a US LLC is very straightforward nowadays. \n\nIf you can automate or swallow some costs to lower your price, then yes, it can work.",
          "score": 2,
          "created_utc": "2026-02-23 16:16:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o70iqdu",
          "author": "MMorsiA",
          "text": "hello , i created an LLC since september 2024 in Delaware, there is no activity started till no and no debt , active and good standing i have the EIN ,the plan was to use it in retail business but till now i didnt use it , also maybe i will not use till the end of this years so for that i want to sell it",
          "score": 1,
          "created_utc": "2026-02-23 20:24:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o74sx9f",
          "author": "ProfessionalBison411",
          "text": "The demand is absolutely real, we see it every day at Foothold America. But a few people in this thread have touched on the thing that makes this harder than it looks on paper, and it's not the formation itself.\n\nThe compliance tail is where this gets complicated. You're not just filing some paperwork and collecting a fee. Foreign-owned LLCs have ongoing IRS obligations that most formation services either don't explain properly or don't handle at all. Form 5472, BOI reporting, understanding what creates a tax nexus, these aren't one-time tasks and if your client misses them you're the person they're calling when the $25k penalty arrives.\n\nBanking is also genuinely getting harder, not easier. Anyone positioning this as a simple arbitrage play is probably underestimating how much has changed since 2024 with KYC requirements. That's actually where most clients hit a wall after the formation is done.\n\nThe niche angle is smart though. Spanish-speaking founders, Indian devs navigating FEMA on top of IRS requirements, these are real underserved communities and the trust problem is solvable if you're actually embedded in those communities. Generic formation services like Stripe Atlas and Firstbase don't do that.\n\nThe businesses that do this well treat it as a proper advisory service rather than a document filing operation. That's a much higher bar but also why there's still room in the market. ",
          "score": 1,
          "created_utc": "2026-02-24 13:33:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7j9914",
          "author": "ArcherParty6445",
          "text": "Claude assessment! \n\nOkay, here’s the honest assessment:\n\nThe Market is Already Pretty Saturated\nThere are well-funded, well-established players targeting your exact niche:\n\n\t∙\tdoola (formerly StartPack) was built specifically for international founders and includes LLC formation, registered agent, EIN for non-residents, US bank account setup, and payment processor support at around $297/year\n\n\t∙\tGlobalfy has over 10 years of experience with 10,000+ clients across 85+ countries and provides LLC formation, banking help, and Form 5472 compliance guidance specifically for non-US entrepreneurs\n\n\t∙\tUSFormation - Full service for non-residents at $399 (complete LLC + EIN + bank account help)\n\n\t∙\tEntity Inc. - Bundle everything at transparent pricing\n\n\t∙\tTailor Brands just launched “Tailor Embedded” in January 2026, allowing other SaaS platforms to integrate LLC formation directly into their products via API \nPlus the big generalist players: ZenBusiness, LegalZoom, Northwest, Bizee, Swyft Filings  all have non-resident options now.\n\nWhy It’s Hard to Win:\n\n\t1.\tPrice compression - Formation services are racing to the bottom. $99-399 total. The margin you’re imagining ($400-600 revenue, $200-400 profit per client) assumes nobody else is competing. They are.\n\n\t2.\tSpecialized competitors are better - doola, Globalfy, USFormation were built for this. They have:\n\t∙\tRelationships with banks that accept non-residents\n\t∙\tForm 5472 compliance built in\n\t∙\tWhatsApp/multilingual support\n\t∙\tEIN process figured out for non-residents\n\t∙\t1000s of testimonials\nYou’d be starting from zero with these advantages.\n\n\t3.\tEmbedded is eating the future - Tailor Embedded lets SaaS companies embed LLC formation directly into their products as an API feature . This means the real value is moving to who controls the customer relationship, not who processes the paperwork.\n\n\t4.\tBanking is still the real bottleneck - Most review sites explicitly mention that banking is where non-residents get stuck after formation, and companies like doola partner with specific banks to handle this . You can’t solve that with a SaaS alone.\n\nMy Take:\nNot worth building another general LLC formation SaaS.\n\nThe Reddit post made it sound like free money. It’s not. The real opportunity isn’t LLC formation—it’s compliance and accounting after the LLC exists.",
          "score": 1,
          "created_utc": "2026-02-26 16:04:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ykqck",
          "author": "Big_Caregiver_7301",
          "text": "You’re looking to help non-US freelancers and devs set up a US LLC, which is a solid idea since the process can be confusing. A lot of people get stuck with the EIN application, the IRS requirements like Form 5472, and the challenges of opening a US bank account, especially if English isn’t their first language. When I went through setting up my LLC, I faced some of the same challenges. I used BusinessAnywhere to help with the paperwork and the registered agent part, and it definitely made the process smoother for me. They helped me sort out the EIN and other details, so I didn’t have to spend time stressing over the forms or the fines. After the LLC is set up, I’d recommend making sure they know about the EIN and the IRS forms like Form 5472 to avoid penalties down the line. It can be a bit of a headache if you're not familiar with all of it.",
          "score": 1,
          "created_utc": "2026-02-28 23:04:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o82q362",
          "author": "MrQueCarter",
          "text": "That’s dope",
          "score": 1,
          "created_utc": "2026-03-01 16:31:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6yxuas",
          "author": "vesperumco",
          "text": "So bypassing the proper channels has clear benefits. Got it. But, those channels must be in place for a reason? \n\nIdk. Sounds a little sketch, especially if the US government and banks find out and don’t like what you’re doing…",
          "score": 1,
          "created_utc": "2026-02-23 16:00:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6z6w6k",
          "author": "Subject-Athlete-1004",
          "text": "honestly this is a legit opportunity and you're not missing much 😅 the demand is very real — i've seen so many devs and freelancers in latam and southeast asia struggle with exactly this stuff. the margin math checks out too. the main thing i'd watch out for is liability... you're essentially giving tax and legal-adjacent advice to people in different countries and if something goes wrong like a missed 5472 filing that $25k penalty is on THEM but they're blaming YOU. so make sure your terms of service are bulletproof and maybe partner with an actual cpa or tax professional rather than winging it yourself. also the niche angle is spot on — going after spanish-speaking founders or specific regional communities where you can build trust is way smarter than trying to be a generic formation service competing with stripe atlas and firstbase. recurring revenue is where this gets interesting tho... don't just do the one-time setup, bundle ongoing compliance and annual filing for like $50-100/month and suddenly you've got a real business not just a service. what community are you thinking of targeting first?",
          "score": 1,
          "created_utc": "2026-02-23 16:42:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6yyr5y",
          "author": "restacked_",
          "text": "Yea sounds illegal lol",
          "score": -1,
          "created_utc": "2026-02-23 16:04:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6yx15p",
          "author": "Eastern_Teaching5845",
          "text": "Stripe Atlas already exists. However, doesn’t that kill the opportunity? Like with a proper marketing you can earn decent money",
          "score": 0,
          "created_utc": "2026-02-23 15:56:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6yxvcr",
          "author": "Michael-Traction",
          "text": "I think your challenge is going to be marketing. How are you going to find the market? ",
          "score": -1,
          "created_utc": "2026-02-23 16:00:28",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rfnie5",
      "title": "The most overlooked business opportunities are in channels everyone abandoned too early",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1rfnie5/the_most_overlooked_business_opportunities_are_in/",
      "author": "Matteo_172736",
      "created_utc": "2026-02-26 21:46:22",
      "score": 24,
      "num_comments": 7,
      "upvote_ratio": 0.93,
      "text": "There's a pattern I keep noticing when I look at businesses that quietly print money in unattractive niches- they're usually using a channel that everyone else wrote off.\n\nEmail was \"dead\" in 2015. Direct mail was \"dead\" in 2012. Both are still generating insane ROI for the people who stuck around after the crowd left.\n\nRight now I think the same thing is happening with voice. Everyone moved to text-only funnels because calls felt intrusive. But there's a gap between \"cold call that interrupts someone's day\" and \"completely silent outreach\" - and some small operators are quietly exploiting it.\n\nI've seen some businesses built around this logic\n\n\\- local home services (HVAC, roofing, solar) using ringless voicemail and sms texts via [Drop Cowboy](https://www.dropcowboy.com/) to follow up on quote requests - no ring, message goes straight to voicemail, callbacks at 8-12%\n\n\\- insurance brokers automating policy renewal reminders with a cloned version of their own voice - personal feel at zero marginal effort\n\n\\-small medical practices that cut no-shows by 60%+ just by switching from email reminders to voicemail drops\n\nNone of these are *glamorous*. None require VC. They're just service businesses that figured out a channel arbitrage before their competitors noticed.\n\nThe business idea isn't necessarily \"build a voicemail company.\" It's: pick any local services niche, add a layer of outreach that your competitors are too lazy or too trendy to use, and own that communication advantage.\n\nWhat abandoned channels have you seen making a quiet comeback?",
      "is_original_content": false,
      "link_flair_text": "Idea Feedback",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1rfnie5/the_most_overlooked_business_opportunities_are_in/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o7nuzlo",
          "author": "Healthy_Library1357",
          "text": "SMS done right is a sleeper. Open rates north of 90 percent are common, but the key is two way conversation, not blast campaigns. Once it feels human, response rates can sit in the 15 to 25 percent range for local offers. Community papers and trade mags are similar. Smaller reach, but way higher intent. A roofing company doesn’t need 100k impressions, it needs 20 homeowners ready to buy. Same with meetups. Ten solid conversations can outperform 10k cold impressions. On the CRM question, I wouldn’t call it abandoned, more underused. Most businesses use maybe 30 percent of what their CRM can actually do. The opportunity isn’t the tool, it’s operational discipline. The companies squeezing real value out of CRM data are usually the boring ones quietly compounding while everyone else chases the next shiny channel.",
          "score": 3,
          "created_utc": "2026-02-27 07:13:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7nipt7",
          "author": "pragavi",
          "text": "•\tSMS (done conversationally, not spammy) outperforming email for local offers\n\t•\tCommunity newspapers + niche trade magazines driving high-intent leads\n\t•\tIn-person events / meetups in B2B where everyone else went fully digital\n\t•\tReferral partnerships (old-school JV style) instead of paid ads\n\t•\tEven well-optimized Google Business Profiles while competitors chase TikTok",
          "score": 2,
          "created_utc": "2026-02-27 05:33:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7okynd",
          "author": "Mean-Arm659",
          "text": "Voice is interesting because attention shifted, not necessarily effectiveness. The operators winning there are probably just meeting customers where competitors stopped showing up.\n\nThe bigger play is not the channel itself but the timing advantage before saturation hits. Every “dead” channel tends to reward the people who optimize it while everyone else chases trends.",
          "score": 2,
          "created_utc": "2026-02-27 11:13:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7nhvvp",
          "author": "FlashyInvestigator57",
          "text": "Would you consider CRM abandoned channels? Like, multi-functional CRM, not just those that are specifically used just for marketing automation/sales?",
          "score": 1,
          "created_utc": "2026-02-27 05:26:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o87313a",
          "author": "Majestic-Strain3155",
          "text": "Ringless voicemail feels kind of outdated. Why would anyone pick up on that in 2026?",
          "score": 1,
          "created_utc": "2026-03-02 08:08:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o8732lr",
              "author": "Matteo_172736",
              "text": "most people abandoned it, so the channel isn’t saturated. In niches like HVAC or dental practices, callback rates are way higher than email or ads.",
              "score": 1,
              "created_utc": "2026-03-02 08:08:33",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1reywtz",
      "title": "Will you guys please help me come up with a domain/company name for my window replacement/installation company?",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1reywtz/will_you_guys_please_help_me_come_up_with_a/",
      "author": "External_Ad_4673",
      "created_utc": "2026-02-26 03:11:54",
      "score": 13,
      "num_comments": 45,
      "upvote_ratio": 0.89,
      "text": "I’m not creative at all and chatgpt is so buns. I been thinking for so long. You guys are my last hope 🙏🙏",
      "is_original_content": false,
      "link_flair_text": "Need a name",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1reywtz/will_you_guys_please_help_me_come_up_with_a/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o7g7vdt",
          "author": "AutoModerator",
          "text": "Thank you for submitting your request for a business name!\n\nTo help our community members provide the most fitting and creative suggestions, please ensure your post includes:\n\n1. A detailed description of your business, its services, target audience, and unique value proposition.\n2. Any names you've already considered, including those you like and those you don't, and why. This helps avoid suggestions you've already contemplated and guides the community's creativity in the right direction.\n\nThe more context you provide, the better the suggestions you'll receive. Thanks for helping us help you find the perfect name for your business!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Business_Ideas) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-26 03:11:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7gkuix",
          "author": "imabetaunit",
          "text": "Pane Free Windows",
          "score": 10,
          "created_utc": "2026-02-26 04:33:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7gofc3",
              "author": "HellaHellerson",
              "text": "When other companies are a pane in the glass, try Pane Free Windows!",
              "score": 6,
              "created_utc": "2026-02-26 04:58:40",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7hfqfc",
                  "author": "Muenstervision",
                  "text": "Windows should be painless… not pane less””",
                  "score": 5,
                  "created_utc": "2026-02-26 08:50:35",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7hibkk",
          "author": "duh-one",
          "text": "Pane in the glass",
          "score": 7,
          "created_utc": "2026-02-26 09:15:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7i421c",
              "author": "brereddit",
              "text": "Remarkable. Truly.",
              "score": 2,
              "created_utc": "2026-02-26 12:24:16",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7gb9va",
          "author": "ds_insider",
          "text": "What I did in your situation was I went to Wiktionary and searched for the terms I thought described my business. Then I clicked around and found the say old English or Germanic equivalent. This gives you some connection and meaning but a fairly distinct name.",
          "score": 3,
          "created_utc": "2026-02-26 03:32:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7gsdyz",
          "author": "kolitics",
          "text": "MacroHard Windows",
          "score": 3,
          "created_utc": "2026-02-26 05:27:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7hg68c",
              "author": "CosmoKramerRiley",
              "text": "Elon would sue.",
              "score": 3,
              "created_utc": "2026-02-26 08:54:49",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7gzj99",
          "author": "Aventador777",
          "text": "Haulin’ Glass",
          "score": 3,
          "created_utc": "2026-02-26 06:23:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7gn2ng",
          "author": "OutlandishnessFew484",
          "text": "I’d  keep it broad incase u want to eventually offer other things as well.\n \nTeal T-shirt home improvement\n\nRed shirt remodeling \n\nJust pick something arbitrary like that and just always wear whatever color shirts so people will remember you. They remember those random little things",
          "score": 2,
          "created_utc": "2026-02-26 04:49:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7i1pjr",
          "author": "tolani13",
          "text": "“Winder,winder, glass and cinder(blocks).” 😏",
          "score": 2,
          "created_utc": "2026-02-26 12:07:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7j3004",
          "author": "EafLoso",
          "text": "Total Smartglass\n\nGrowing Panes\n\nSiliCAN!\n\nLinux",
          "score": 2,
          "created_utc": "2026-02-26 15:35:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7j68aa",
          "author": "woundedkarma",
          "text": "A kill to a view.\n\nBroken window -> fixed window \n\nSide by side. 😅",
          "score": 2,
          "created_utc": "2026-02-26 15:50:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7j6hf5",
          "author": "fitandhealthyguy",
          "text": "O&S Windows as in Open and Shut",
          "score": 2,
          "created_utc": "2026-02-26 15:52:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7mx2b3",
          "author": "lafangah",
          "text": "EasyDay\n\n\nSo even if you have to expand into other services this will be good",
          "score": 2,
          "created_utc": "2026-02-27 03:09:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7gb9oe",
          "author": "kawaiian",
          "text": "We Feel Your Pane: Window Replacement & Installation",
          "score": 3,
          "created_utc": "2026-02-26 03:32:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7gh59h",
          "author": "nidamo",
          "text": "Clear Choice\nMajor Pane",
          "score": 2,
          "created_utc": "2026-02-26 04:08:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7gxe3v",
          "author": "mathaiser",
          "text": "Uncle Festers Fensters.",
          "score": 1,
          "created_utc": "2026-02-26 06:06:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7gxt8z",
          "author": "Connect_Advantage116",
          "text": "Windows xD",
          "score": 1,
          "created_utc": "2026-02-26 06:09:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7h71tz",
          "author": "Fantastic_Comb_6103",
          "text": "Blinders",
          "score": 1,
          "created_utc": "2026-02-26 07:28:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7h7exc",
          "author": "NWRegAgentJaq",
          "text": "Seeing a lot of funny/punny suggestions here already, so just a quick note: before you get too attached to a name, do a couple quick things: check to see whether it's available in your state (might be able to get away with it as a DBA, but generally if you're forming an LLC or corp your options are limited to names no one else in the state is using), check to see whether it's already trademarked, and check to see whether it's available as a domain name. Hitting all three can help you figure out what you *can't* call it.\n\nBest bets are to keep it simple, easy to spell/memorize, and something that isn't just a bunch of keywords. (You know, the way everything seems to be called \"Midnight Sun\" or \"Arctic\" something or other if it's north enough, or \"Lakeside\" or \"Lakeshore\" if there's a relevant body of water nearby, etc. Means you'll be competing for brand recognition and keywords in a really crowded field.)",
          "score": 1,
          "created_utc": "2026-02-26 07:32:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7iio8s",
              "author": "WebDevMom",
              "text": "Also, social media availability. For local businesses, that can be pretty important.",
              "score": 2,
              "created_utc": "2026-02-26 13:53:18",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7qhzxf",
                  "author": "NWRegAgentJaq",
                  "text": "D'oh, can't believe I forgot that one! Thanks and good call.",
                  "score": 1,
                  "created_utc": "2026-02-27 17:36:18",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7hfp0o",
          "author": "chrisramphoto",
          "text": "Winner Windows, Winning Window, Wonder Window. Maybe a WW so it's memorable. \"Puzzles Windows.\" Why is it called puzzles Windows? Well that's the puzzle!",
          "score": 1,
          "created_utc": "2026-02-26 08:50:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7hjmjg",
          "author": "Novel_Ad_3466",
          "text": "Premium Windows",
          "score": 1,
          "created_utc": "2026-02-26 09:28:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7hjpl9",
          "author": "Samon711",
          "text": "Cachet Windows",
          "score": 1,
          "created_utc": "2026-02-26 09:29:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7hjwam",
          "author": "Novel_Ad_3466",
          "text": "PrimePane.com\nPanepro.com",
          "score": 1,
          "created_utc": "2026-02-26 09:31:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7hna74",
          "author": "blumonste",
          "text": "Rays of Sunshine",
          "score": 1,
          "created_utc": "2026-02-26 10:04:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7hukxf",
          "author": "Key-Philosopher2501",
          "text": "your last name impact",
          "score": 1,
          "created_utc": "2026-02-26 11:10:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7hy1ef",
          "author": "Flexclusive",
          "text": "Wewashwindows.com",
          "score": 1,
          "created_utc": "2026-02-26 11:39:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ia6cp",
          "author": "tramplemestilsken",
          "text": "“The window guys, city”",
          "score": 1,
          "created_utc": "2026-02-26 13:04:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ig81e",
          "author": "Preconf",
          "text": "Clarity windows, vantage windows, All Glass, Windowers, Glass Tech, Visibility inc... I'm sure I'll think of more",
          "score": 1,
          "created_utc": "2026-02-26 13:39:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ikn9i",
          "author": "TotalRuler1",
          "text": "SEALTEK",
          "score": 1,
          "created_utc": "2026-02-26 14:03:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7jo9gy",
          "author": "Busy-Wing-6115",
          "text": "Depending on the size of your company and type of business, e.g sole trader/freelancer or business company.  And what type of window products do you sell? There are many types of windows and glass panel with better layer structures and protective such as heat, cold, noisy, etc. You need to find the words from dictionary. \n\nSo, I made this three example words:\n\n* WinSolar Window\n* Kolar Glass Window\n* Triplex Glass Window",
          "score": 1,
          "created_utc": "2026-02-26 17:13:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7kltc6",
          "author": "meat-critter",
          "text": "I can make a website and help with Google business/yelp/ Nextdoor pages etc. shoot a dm and I can send my portfolio.",
          "score": 1,
          "created_utc": "2026-02-26 19:49:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7l5kho",
          "author": "JerryRoth",
          "text": "Window Pain Repair",
          "score": 1,
          "created_utc": "2026-02-26 21:23:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ml878",
          "author": "mtnfunandsun99",
          "text": "Clearview Glass (or Windows)\nClearvüe Glass (or Windows)\n\nSummit Windows\n\nApex Glass and Window \n\nWhere are you located? Maybe there’s something relevant geographically or landmark etc that we can suggest? Like the person above suggested “shark”, which makes the most sense in coastal locations.",
          "score": 1,
          "created_utc": "2026-02-27 02:00:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ngnai",
          "author": "wasabi9605",
          "text": "Glazed and Confused",
          "score": 1,
          "created_utc": "2026-02-27 05:17:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7so2mq",
          "author": "NestorKirchneer",
          "text": "Amigos, reemplaza e instala ventanas, le estan dando nombres como que tiene una multinacional. Yo le pondría \"Averturas External\"",
          "score": 1,
          "created_utc": "2026-02-28 00:15:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7sscza",
          "author": "Wrong_Acadia",
          "text": "NewView",
          "score": 1,
          "created_utc": "2026-02-28 00:40:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7vgdfl",
          "author": "akhil_v",
          "text": "Where are you located, I would research keywords and make the name around that, Helps a ton in ranking locally and also in organic if you get it right..\nCheck for domain availability also",
          "score": 1,
          "created_utc": "2026-02-28 13:06:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7z8a0y",
          "author": "MarkyMark4Eva",
          "text": "Windows R US \n\n",
          "score": 1,
          "created_utc": "2026-03-01 01:24:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o85xem3",
          "author": "Prestigious-Meal8359",
          "text": "Smart view windows",
          "score": 1,
          "created_utc": "2026-03-02 02:44:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7gk4k2",
          "author": "_-Fractal-_",
          "text": "Where I’m from one of the most popular and memorable firms is “Polar Bear Windows”. Originally I was thinking of names to make you sound premium like “Provista Windows” for example, but actually, when it comes to stuff like that an initially corny / silly unrelated name could be the way to go? Like if I saw provista id think hmm yeh they’re gonna charge me a fortune. \n\nCould explore animals, colours, other unrelated words / images? \n\nI remember Polar Bear Windows ran radio ads with jingles too which probably cemented them as the go to and added weight to a seemingly silly name at first.\n\nTitan Window\n\nPheonix Windows\n\nApex Windows\n\nFalcon Windows\n\nGreat White Windows (Shark van livery could look awesome if done well).",
          "score": 0,
          "created_utc": "2026-02-26 04:28:44",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1ri79aq",
      "title": "Turning “Boring Local Services” Into Premium Micro-Brands. Am I Thinking About This the Right Way?",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1ri79aq/turning_boring_local_services_into_premium/",
      "author": "Khushboo1324",
      "created_utc": "2026-03-01 19:56:53",
      "score": 13,
      "num_comments": 8,
      "upvote_ratio": 1.0,
      "text": "I’ve been thinking about something that most people ignore.\n\nWe always talk about startups, apps, AI, SaaS, etc. But in almost every city there are “boring” local services that are poorly branded, slow to respond, and stuck in the past.\n\nExamples:\n\n* Car detailing\n* Home cleaning\n* Mobile phone repair\n* Landscaping\n* Pressure washing\n* Appliance repair \n\nThe service itself is not exciting. But the experience usually is outdated. So here’s the idea:\n\nInstead of inventing something new, what if we build a small, premium, well-branded local service company in one of these boring niches and focus heavily on:\n\n1. Clear pricing\n2. Fast response time\n3. Online booking\n4. Clean branding and trust signals\n5. Upsells and subscription packages\n\nFor example, a car detailing service that feels like a tech brand. Clean website. Simple packages. SMS updates. Before/after photos automatically sent. Monthly maintenance subscription.\n\nNot revolutionary. Just better execution.\n\nMy background:\n\n* Moderate capital, around $15k to start\n* Experience in digital marketing and basic operations\n* No previous brick-and-mortar business\n* Preference for local service with potential to scale into multiple crews\n\nMy questions:\n\n* In your experience, is the main bottleneck in these industries marketing or operations?\n* What usually kills these types of businesses early?\n* If you had to pick one of the “boring” industries above, which has the healthiest margins long term?\n\nI’m trying to avoid building something flashy and instead build something durable and cash flowing. Would love to hear from anyone who has operated a local service business. What am I underestimating?",
      "is_original_content": false,
      "link_flair_text": "Idea Feedback",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1ri79aq/turning_boring_local_services_into_premium/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o84fdth",
          "author": "vesperumco",
          "text": "We’re doing this in our niche. \n\nYou’re going to find out quickly how difficult it is to find reliable hires. I would test your idea in a small local zone first and get your processes, billing, and logistics down for the few customers YOU can service, individually. \n\nThen, think about scaling to one employee. Refine your processes, billing, and logistics. Then scale upward from there.\n\nGrow slowly.",
          "score": 3,
          "created_utc": "2026-03-01 21:31:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o840nn3",
          "author": "travisjd2012",
          "text": "If I had to pick out of your examples I'd go with Home Cleaning or \\*light\\* Landscaping (essentially mowing) because it's labor anyone can do without too much special equipment and you have a high likelyhood of repeat customers who treat it more like a utility bill than a one-time thing. Car detailing CAN have this as well if you find the right clientele (Hint: Realtors)\n\nThe worst of the bunch would be phone repair, you have a high liability device and you at the mercy of parts pricing and hardware shifts combined with your own abilities, and many devices will end up being unfixable leaving you doing labor without compensation 20% of the time or so.",
          "score": 2,
          "created_utc": "2026-03-01 20:15:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o843rbd",
              "author": "Khushboo1324",
              "text": "That’s a really solid breakdown. I like the point about repeat customers treating it like a utility bill, that’s exactly the kind of predictable revenue I’m thinking about.\n\nThe Realtor angle for car detailing is interesting too. I hadn’t really considered that niche specifically but it makes sense since presentation directly affects their listings and yeah phone repair feels riskier the more I think about it. The liability + constant hardware changes sound like a headache. Appreciate you laying that out clearly.",
              "score": 1,
              "created_utc": "2026-03-01 20:31:53",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o83zh3x",
          "author": "travisjd2012",
          "text": "Operations of course, with a low price and an ad in a mailer you could probably get 50 people wanting service, but how are you going to get them all done?\n\nQuickly you've bought a job that is really all about finding, training, and keeping great employees who don't mind physical labor unless you are planning to do it all yourself.",
          "score": 1,
          "created_utc": "2026-03-01 20:09:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o843uc2",
              "author": "Khushboo1324",
              "text": "That’s honestly the part I’m most cautious about. Getting customers feels solvable with decent marketing, but fulfilling consistently at scale seems like the real challenge.\n\nYou’re right, it quickly becomes a people and systems game. Hiring, training, quality control, retention. That’s probably where most of these businesses either grow or stall.\n\nWould you say the biggest early mistake is expanding too fast before operations are tight?",
              "score": 1,
              "created_utc": "2026-03-01 20:32:19",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o84qrdz",
                  "author": "travisjd2012",
                  "text": "Are you going to do the work yourself or start with hiring right out the gate?",
                  "score": 1,
                  "created_utc": "2026-03-01 22:31:34",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o85u3z9",
          "author": "Diabeetsreversal",
          "text": "AYS app is like task rabbit but with incentives. I think you can work with them on your ideas. They’re growing their user and provider base atm by using networking but sustainably (unlike product-based). So if you sign up someone else either as a service provider or end user, you get 5% everytime they book a client or book a service.",
          "score": 1,
          "created_utc": "2026-03-02 02:24:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o86czmx",
          "author": "essa__dee",
          "text": "Seems like your best bet would be to find an independent contractor offering great service who doesn’t have time to spend on operations and offer to help them scale in exchange for partial ownership. Start building relationships until you find someone you trust who seems ready to make a leap and wants a business partner.",
          "score": 1,
          "created_utc": "2026-03-02 04:28:26",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rdlpxa",
      "title": "Secured Land Now Planning a Tire Processing Facility (Looking for Feedback)",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1rdlpxa/secured_land_now_planning_a_tire_processing/",
      "author": "triceh0526",
      "created_utc": "2026-02-24 16:57:47",
      "score": 9,
      "num_comments": 8,
      "upvote_ratio": 1.0,
      "text": "My name is Mekia and I am a Black female business owner and based in Georgia. I am currently working to open what will be the first Black woman-owned tire processing center in the state of Georgia.\n\nThis project is more than just a business venture it represents job creation, environmental impact, and economic growth for our community. I have already secured the land for the facility and am now seeking financial support and strategic partners to help bring the processing center fully online.\n\nI have reached out to several organizations but have not yet received responses. I would truly appreciate the opportunity to connect with individuals or institutions interested in supporting sustainable infrastructure, minority-owned businesses, and innovative recycling solutions.\n\nI need help raising money and or finding angel investors",
      "is_original_content": false,
      "link_flair_text": "Idea Feedback",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1rdlpxa/secured_land_now_planning_a_tire_processing/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o76nagx",
          "author": "Khushboo1324",
          "text": "tbh securing land is already a huge step, most people get stuck there so good progress 👌\n\nbut with tire processing the real complexity usually starts after that. few things i’d personally think through early:\n\n• input supply → where are tires coming from consistently (dealers, scrap yards, municipalities)  \n• output market → crumb rubber, pyrolysis oil, steel recovery etc. which one are you targeting first  \n• permits & environmental compliance → this can slow projects more than machinery tbh  \n• capex vs throughput → many plants look profitable on paper but struggle at low utilization  \n• offtake agreements → having buyers lined up reduces a lot of risk\n\nimo biggest mistake in recycling businesses is building capacity before validating steady inflow + demand. sometimes even small pilot processing with outsourced machinery gives better learning than jumping into full plant.\n\nwhen i plan projects like this i usually map the whole flow (supplier → process → buyer) and run mini validation loops. i kinda use a mix of tools for that… runable to connect small workflow steps and track experiments, plus notion and sheets for ops visibility. nothing fancy but it helps spot bottlenecks early before money gets locked into equipment.\n\ncurious what processing route you’re planning first and whether you already have tire supply sources lined up 👀",
          "score": 2,
          "created_utc": "2026-02-24 18:45:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7e80zn",
          "author": "Khushboo1324",
          "text": "this is actually a solid space to explore tbh because tire waste is massive and the supply side is usually not the problem, execution is\n\nbiggest things I’d look at early  \npermits and environmental compliance (this alone can delay projects a lot)  \nconsistent feedstock contracts with garages, fleets, municipalities  \nand most importantly your output market, like crumb rubber buyers, asphalt companies, playground surfacing etc\n\na lot of recycling ventures struggle not because they can process material but because they don’t lock buyers first\n\nalso worth running small pilot volumes before scaling equipment spend just to validate logistics + margins\n\nreally cool project though, wishing you success with this. curious if you already have offtake partners lined up?",
          "score": 2,
          "created_utc": "2026-02-25 20:51:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7eb7j2",
              "author": "triceh0526",
              "text": "Thank you. I have not found any partners yet",
              "score": 1,
              "created_utc": "2026-02-25 21:06:01",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7iqqc1",
                  "author": "Khushboo1324",
                  "text": "happy to help!!\n\n",
                  "score": 1,
                  "created_utc": "2026-02-26 14:36:02",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7eafxo",
          "author": "Eugeniusz87",
          "text": "Congrats on securing the land, that's a big milestone and shows real commitment.  \nFor projects like this, investors usually want to see 3 very clearly: reliable feedstock, confirmed offtake, and realistic unit economics. If you haven't already, it may help to line up letters of intent from suppliers and buyers, plus a simple financial model showing capacity, costs, and margins.  \nYou might also get traction through state environmental programs, recycling grants, and local economic development groups, many have funding or can open doors to the right partners.\n\nWishing you real progress with this project, projects like yours create both business and community impact.",
          "score": 2,
          "created_utc": "2026-02-25 21:02:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o76txcp",
          "author": "triceh0526",
          "text": "I forgot to add I am currently a tire carrier so I get a ton of tires and know all the carriers in my area. I spend over 33k a month dumping tires which is why I want to do this.",
          "score": 1,
          "created_utc": "2026-02-24 19:15:13",
          "is_submitter": true,
          "replies": []
        },
        {
          "id": "o7febbn",
          "author": "ConstantSurround4321",
          "text": "hello I would love to know about your business and if it fits right I would love getting along - from india - 9022493626 feel free to connect this is my business number",
          "score": 1,
          "created_utc": "2026-02-26 00:24:31",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rfh85m",
      "title": "Product Support soft skills training idea",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1rfh85m/product_support_soft_skills_training_idea/",
      "author": "ironman_of_my_word",
      "created_utc": "2026-02-26 17:55:24",
      "score": 7,
      "num_comments": 2,
      "upvote_ratio": 1.0,
      "text": "Hi everyone, I am considering starting a business in a space I am familiar with - product support/customer support.  \n\nI have two paths I was thinking about going. One is b2b where I would offer training to small tech companies who are expanding their help desk support. The idea is that these companies often hire on technical ability and there employees may suffer from communication issues if they are customer facing. In a previous role I've had as a product support engineer, I've had this exact training by a third party my company would hire. \n\n  \nThe alternative path would be to offer a career-oriented skills training bootcamp as a b2c. This would be a similar training to the corporate training, but would be offered to individuals. It would assess their communication abilities and help orient them to software customer support roles. The training would be marketed as a way to break into tech, as many software companies, especially at enterprise level, offer customer support as part of their contracts. Even if AI is implemented into low tier tickets, real agents are still used for escalation. \n\n  \nI like the idea of the training for consumers as a way to build out the training and get real testimonials, and then pivoting towards the corporate training down the line, as getting corporate contracts would be much more difficult. \n\n  \nFor those with experience, does this idea sound like something a consumer would use, or is it better to try to jump directly to b2b?",
      "is_original_content": false,
      "link_flair_text": "Idea Feedback",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1rfh85m/product_support_soft_skills_training_idea/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o7k318d",
          "author": "Khushboo1324",
          "text": "tbh the idea makes sense because product support roles really struggle with empathy + communication gaps, but the tricky part is proving behaviour change not just content delivery\n\nyou might want to clarify  \nwho exactly this is for (saas support, bpo, internal teams etc)  \nwhat moment the training targets (escalations, angry users, onboarding calls)  \nand how improvement is measured\n\nimo scenario based simulations or roleplay style practice could be strong differentiator vs generic courses\n\nalso if you can validate willingness to pay from team leads or support managers early, that’ll give much clearer signal than individual interest\n\ninteresting space overall, just sharpen ICP + measurable outcome 👍",
          "score": 1,
          "created_utc": "2026-02-26 18:21:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7kfms4",
              "author": "ironman_of_my_word",
              "text": "Funny enough you've hit the nail on the head. The training I've designed is fully roleplay based, so it focuses on \"doing\" rather than just sitting and clicking through slides or watching someone drone on in front of a board. \n\n\nI think the target on the b2b side would be SaaS teams, whatever human support they offer (whether it's initial support or AI-escalation teams). \n\n\nI think my struggle on the b2c side is, does this type of training/delivery make sense as a career transition certificate, or should it strictly be b2b.",
              "score": 1,
              "created_utc": "2026-02-26 19:19:45",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1rdj07m",
      "title": "Looking for advice on online side hustle",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1rdj07m/looking_for_advice_on_online_side_hustle/",
      "author": "SeaInfluence8097",
      "created_utc": "2026-02-24 15:19:32",
      "score": 6,
      "num_comments": 10,
      "upvote_ratio": 0.88,
      "text": "Hi everyone, I’m looking to start an online side hustle. \nI would like to do remote freelance work for small wellness businesses / content creators since I also have experience in that field. I was thinking of two different types of services to offer:\n\n\nAdministrative support:\nSocial media inbox management, replying to comments, reposting\nBooking coordination \nClient communication/ support\n\n\nMarketing support:\nEmail newsletter writing and sending \nVideo editing (short and long form)\n\n\nDoes it seem cohesive? And do you think it would be easy/ hard to get clients? Especially considering a lot of virtual assistants are charging very low prices that are just not realistic for me (I’m from Europe).  \nI just think my plus would be that I have experience in the industry of my ideal client, am in the same time zone and speak 2 languages (almost 3).\nI would be very grateful for any thoughts or advice :)",
      "is_original_content": false,
      "link_flair_text": "Idea Feedback",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1rdj07m/looking_for_advice_on_online_side_hustle/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o75jbqh",
          "author": "Remarkable_Junket185",
          "text": "Why would you write newsletters for someone else when you can make money by writing your own newsletter issues. \n\nI began my newsletter 3 weeks ago, have made $300 since then",
          "score": 2,
          "created_utc": "2026-02-24 15:46:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o76id1f",
              "author": "-M83",
              "text": "hey that’s amazing congrats on your success!\n\nif I may ask what niche is your newsletter and is there a platform you’d recommend? cheers & thanks & congrats again!!\n",
              "score": 2,
              "created_utc": "2026-02-24 18:23:47",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o78761n",
                  "author": "Remarkable_Junket185",
                  "text": "This is my [newsletter](https://wifimoolah.com) \n\nAnd this is the platform i use : [beehiiv](https://www.beehiiv.com?via=Kris-M)",
                  "score": 1,
                  "created_utc": "2026-02-24 23:07:54",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7681ng",
          "author": "DeepankarKumar",
          "text": "This actually feels more cohesive than you might think  because you’re essentially positioning yourself as a “client communication + content support” partner, which is a real pain point for small wellness brands.\n\nA lot of founders don’t just need tasks done, they need someone who understands tone, audience, and sensitivity around client communication, so your industry experience is a strong differentiator if you lean into it.\n\nFrom what I’ve seen, the challenge usually isn’t demand — it’s clarity of positioning. The more specific you are (for example: inbox + community + newsletter support for coaches/therapists/studios), the easier it is to justify higher pricing and avoid competing with low-cost general VAs.\n\nGetting clients may feel slow at first, but once you land 1–2 who trust you, referrals tend to compound pretty quickly in that space.\n\nOut of curiosity are you planning to package this as fixed monthly retainers or hourly services?",
          "score": 1,
          "created_utc": "2026-02-24 17:37:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7afabz",
              "author": "smarkman19",
              "text": "Go with simple retainers, not hourly. Hourly makes clients nitpick time and makes you feel like an employee. Wellness folks usually want “peace of mind,” not time tracking.\n\nI’d start with 2–3 clear packages tied to outcomes, not tasks. For example:\n\n1) Starter: inbox + DMs + basic client support, up to X messages/day, response time within Y hours.\n\n2) Community + content: everything in Starter plus comment replies and 1 newsletter/week.\n\n3) Premium: above + light launch support (extra broadcasts, simple funnels, etc.).\n\nPrice each for what would feel good if they took your full mental bandwidth that month. Add boundaries: working hours, channels you use, what’s “urgent,” and a cap on revisions for video.\n\nMain point: sell clear monthly packages around “we keep your audience and clients taken care of,” not random hours of admin work.",
              "score": 1,
              "created_utc": "2026-02-25 07:36:18",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o7p76q5",
              "author": "inkandstatic1103",
              "text": " Sounds like you’ve tapped into a serious pain point! Positioning yourself as that go-to \"client communication + content support\" wizard is golden. Starting slow is just part of the game, but once you get those initial clients, it’s like a wellness referral party! Are you thinking of going the retainer route for those sweet steady payments? ",
              "score": 1,
              "created_utc": "2026-02-27 13:45:16",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7b5tyq",
          "author": "indexintuition",
          "text": "i actually think it feels cohesive if you frame it around being a right hand for wellness founders rather than listing random tasks. admin plus light marketing makes sense because a lot of small creators need both but do not want to hire two different people. i would probably niche even tighter at the beginning, maybe position yourself as inbox and newsletter support for wellness coaches, so your industry experience becomes the main selling point instead of competing on price. getting clients is rarely easy at first, but being in the same time zone and speaking multiple languages is a real advantage, especially for european brands that are tired of huge time gaps. you could also start with a very small beta offer for one or two clients to refine your workflow and testimonials before trying to scale.",
          "score": 1,
          "created_utc": "2026-02-25 11:37:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7e89cm",
          "author": "Khushboo1324",
          "text": "tbh this actually feels pretty cohesive because you’re basically offering client communication + content support, which is exactly where many wellness creators struggle\n\nimo your biggest advantage isn’t the tasks, it’s industry context + timezone + language. that combo already separates you from generic VAs competing on price\n\nI’d just niche the positioning more like “inbox + newsletter support for wellness coaches” so people instantly get it\n\nclient acquisition might feel slow at first but once you land 1–2 good fits, referrals in that space tend to snowball\n\nare you thinking hourly or monthly retainers? feels like retainers would match this type of work better",
          "score": 1,
          "created_utc": "2026-02-25 20:52:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ol0bx",
          "author": "Mean-Arm659",
          "text": "It is cohesive if you position it as growth support for wellness brands rather than generic VA work. Your niche experience and language advantage are differentiators, so lean into specialization instead of competing on price.",
          "score": 1,
          "created_utc": "2026-02-27 11:13:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7pltkp",
          "author": "Lost_Barnacle_5074",
          "text": "I’m based in Europe and operate within a service based business environment.\n\nThe services you listed are cohesive from a task perspective. The real question is strategic positioning. When someone presents themselves as a general virtual assistant, the market naturally compares them on price. That is where downward pressure begins.\n\nWhat tends to work better is narrowing the scope around a defined client type and understanding their workflow deeply. For example, wellness businesses have predictable patterns in booking, communication and content cycles. If you position yourself around solving those specific operational bottlenecks, you shift the conversation from hourly cost to business impact.\n\nIn service models, clarity of problem solved usually matters more than the number of tasks offered. Generalists compete on availability. Specialists compete on relevance.\n\nOver time, the latter is more sustainable.",
          "score": 1,
          "created_utc": "2026-02-27 15:03:08",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rdae8f",
      "title": "Buying a food truck in the uk",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1rdae8f/buying_a_food_truck_in_the_uk/",
      "author": "cuntthemage",
      "created_utc": "2026-02-24 08:05:42",
      "score": 5,
      "num_comments": 18,
      "upvote_ratio": 0.86,
      "text": "So I've been blessed with the opportunity of having some money gifted to start a business I'm looking into getting a food truck and doing deliveroo/ weddings / festivals and events.\n\nI'm torn between Mexican and BBQ food as there's not much in the area that caters to that taste. \n\nMy partner has worked restaraunts pubs and bars her whole life from running them to working as a waitress.\n\nShe has connections to suppliers and I have connections with marketing people, vinyl wrappers for the van and graphic designers\n\nAny one with experience have any suggestions / pitfalls to look out for / warnings against etc?\n",
      "is_original_content": false,
      "link_flair_text": "Idea Feedback",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1rdae8f/buying_a_food_truck_in_the_uk/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o74g3hi",
          "author": "Front_Improvement178",
          "text": "If I was to make you a suggestion why don’t you work for someone who’s in the business and try it out and see if it’s for you or not first before pulling the trigger and spending your money. Good way to test the market and your own ability.",
          "score": 2,
          "created_utc": "2026-02-24 12:12:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o756q93",
          "author": "whatishappeninyall",
          "text": "Mexican 100%.  BBQ takes forever to prep. And if an event rains out etc with BBQ then youre stuck with a bunch of useless food.  Mexican is FAR more manageable and likely far more profitable.",
          "score": 2,
          "created_utc": "2026-02-24 14:46:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7hcxqm",
              "author": "IsleelNyden",
              "text": " Totally get that! I once tried making BBQ for an outdoor event, and it turned into a food wasteland when the rain hit. Mexican really does have that edge for flexibility and profit. Plus, tacos never hurt anyone!",
              "score": 1,
              "created_utc": "2026-02-26 08:23:27",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o73v7nx",
          "author": "Informal-Virus4452",
          "text": "food trucks look fun but it’s long hours + tight margins. festivals especially are not as glamorous as they seem.\n\nI’d pick whatever is simpler to execute fast. BBQ sounds great but long cook times can be a pain. mexican with a tight menu might move quicker.\n\nbiggest tip: keep the menu small and test with pop-ups before going all in. learn cheap, not expensive.",
          "score": 1,
          "created_utc": "2026-02-24 09:10:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o73xjdw",
              "author": "cuntthemage",
              "text": "That makes a lot of sense appreciate the suggestions",
              "score": 1,
              "created_utc": "2026-02-24 09:32:31",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o73wb54",
          "author": "Ill_Football9443",
          "text": "Cold storage:  where are you going to store food during and between events?  If you're going to go after festivals that go all day/night, then you won't have enough room on board for storage.\n\nParking:  Do you have somewhere to park the truck & trailer without frustrating your local council?\n\nEnergy:  a one off investment in a on/off-grid power system might reduce your operating costs.  Meaning, cover the roof and trailer in panels, a decent inverter (with generator input + control) and batteries might mitigate your running costs (not running a generator the entire time)\n\nPermits:  What does your government have to say about where you can operate?\n\nWhat are your outgoing costs (the money leaving your wallet every day that it sits there)?  Insurance, registration, servicing, food spoilage, parking/storage... what else?",
          "score": 1,
          "created_utc": "2026-02-24 09:20:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o73wt2w",
          "author": "theDaveB",
          "text": "Can you explain what you mean by Deliveroo?",
          "score": 1,
          "created_utc": "2026-02-24 09:25:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o73x58e",
              "author": "cuntthemage",
              "text": "Deliveroo is like door dash or Uber eats",
              "score": 1,
              "created_utc": "2026-02-24 09:28:44",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o73xcsi",
                  "author": "theDaveB",
                  "text": "I know but how will that work with a food truck?",
                  "score": 1,
                  "created_utc": "2026-02-24 09:30:44",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o7eg0rj",
              "author": "SorynthValecar",
              "text": " Deliveroo? It's like asking if you can explain the Big Bang to a caveman! But really, it’s just a delivery service for food. Perfect for bringing that BBQ or Mexican goodness right to people’s doors, just in case they don’t want to move from their couch to enjoy some tasty bites.",
              "score": 1,
              "created_utc": "2026-02-25 21:28:14",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7eu491",
                  "author": "theDaveB",
                  "text": "I meant in relation to a food truck, didn’t realise temporary food trucks could be on it.",
                  "score": 1,
                  "created_utc": "2026-02-25 22:35:42",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o7kl21f",
              "author": "midnightparcel_0",
              "text": " Deliveroo is a delivery service that connects restaurants to customers, kind of like having a personal food courier! It's a great way to get your tasty tacos or BBQ to people who can't resist. That could really boost your business at events too!",
              "score": 1,
              "created_utc": "2026-02-26 19:45:36",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o73xcve",
          "author": "UpsetMarsupial",
          "text": "Festivals are seasonal, so you will have lots of downtime during the winter period and probably longer. You will either need to ensure that your takings during the on-season are enough to cover you over the rest of the year, or instead find a different trade for the quieter periods.",
          "score": 1,
          "created_utc": "2026-02-24 09:30:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o743hyf",
              "author": "cuntthemage",
              "text": "Yeah that's something we've factored in were both happy to go work bar jobs etc in the winter if we can't build a local following",
              "score": 1,
              "created_utc": "2026-02-24 10:28:06",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o75s99i",
          "author": "ChestChance6126",
          "text": "I’d choose the concept based on throughput, not taste. In a truck, speed per order and prep simplicity matter more than variety. Tight menu, high margin items, low waste. test both ideas at small markets before committing to a full build. festivals look big, but the real question is profit per hour after fees and spoilage. ",
          "score": 1,
          "created_utc": "2026-02-24 16:26:48",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rg2mb3",
      "title": "how to protect my idea?",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1rg2mb3/how_to_protect_my_idea/",
      "author": "Mobile-Vegetable7536",
      "created_utc": "2026-02-27 09:57:59",
      "score": 5,
      "num_comments": 20,
      "upvote_ratio": 0.69,
      "text": "so this serious question iv being struggling for ages to get the correct advice I have this idea that helps  prevent one of the worlds biggest issues (mobile theft) and I'm unsure where to go to get help and co collaboration to bring this to life while protecting my idea I did reach out to a company and they was willing to help but who do I trust I suppose  my question is do I try to patern my idea before I reach out to other company/investors? ",
      "is_original_content": false,
      "link_flair_text": "Idea Feedback",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1rg2mb3/how_to_protect_my_idea/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o7qvstn",
          "author": "Khushboo1324",
          "text": "tbh ideas themselves are hard to protect, execution usually matters more.\n\nstill you can reduce risk by below following:  \n• sharing details only when needed  \n• using NDAs with partners/devs  \n• registering trademark for name/logo  \n• filing provisional patent if there’s real invention  \n• keeping records of your work timeline\n\nimo be selective but don’t stay too secret, feedback is still important.\n\nis it a tech product or service idea?",
          "score": 2,
          "created_utc": "2026-02-27 18:41:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o80uegx",
              "author": "Mobile-Vegetable7536",
              "text": "iv basically invented a tech product that deters theft and disrupts the re sell of stolen phone I reached out to a company that works with dragons den uk they are called innovate there are really interested and ask me to do a full patent check before we proceed.",
              "score": 1,
              "created_utc": "2026-03-01 08:36:20",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o840jhp",
                  "author": "Khushboo1324",
                  "text": "really cool idea bro.....🫡",
                  "score": 1,
                  "created_utc": "2026-03-01 20:15:19",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7r7mon",
          "author": "NellieApp",
          "text": "All early entrepreneurs think about this, in reality it's not at all about your idea. I absolutely guarantee you someone has thought of your idea before. It's about execution.\n\nPeople want projects that succeed, nobody is trying to copy ideas that didn't succeed. If you implement your project, and it succeeds, then you did it right. Make your name synonymous with the purpose of your app and no matter how many times people duplicate the idea you will stay on top.",
          "score": 2,
          "created_utc": "2026-02-27 19:38:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7p1ets",
          "author": "rsteele1981",
          "text": "Ideas are pretty common. \n\nThe implementation, execution, and actual process of making them work and be useful is where the magic is.\n\n\nA million others have the same idea. You need to be the one that makes it work for it to matter.",
          "score": 2,
          "created_utc": "2026-02-27 13:11:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7t0yuq",
          "author": "braskel",
          "text": "Execution > Idea. Your idea is worth nearly nothing unless you take action on it",
          "score": 4,
          "created_utc": "2026-02-28 01:32:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7odzq0",
          "author": "__vivek",
          "text": "As a dev agency owner, I can tell you this: an idea alone is not enough, all that matters is execution.\n\nIf you are going to work with a developer or an agency to bring this to life, just make sure they sign an NDA before you share technical details.",
          "score": 2,
          "created_utc": "2026-02-27 10:10:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7ofn84",
              "author": "Mobile-Vegetable7536",
              "text": "thankyou I'm in process of learning cad 3d so I can make physical  prototype withought any help.  thanks for your advice ",
              "score": 2,
              "created_utc": "2026-02-27 10:25:45",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7pn6xa",
                  "author": "rsteele1981",
                  "text": "That's the way! \nDo it! \nI feel hopeful when people with great ideas are in control of their own destiny!",
                  "score": 1,
                  "created_utc": "2026-02-27 15:09:55",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7oxuxx",
          "author": "Solid_Mongoose_3269",
          "text": "Guarantee your idea isn’t this great billion dollar one you think it is",
          "score": 2,
          "created_utc": "2026-02-27 12:49:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7q0a38",
              "author": "Mobile-Vegetable7536",
              "text": "maybe not but then I have no regrets if I dont 🤔",
              "score": 1,
              "created_utc": "2026-02-27 16:12:46",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7pwehd",
          "author": "kops212",
          "text": "Nobody will steal your idea. You'll get much more value by telling people about it with a low threshold because that's how you get valuable feedback.",
          "score": 2,
          "created_utc": "2026-02-27 15:54:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7okx59",
          "author": "Mean-Arm659",
          "text": "If it is patentable, speak to a patent attorney before broadly sharing details. In the meantime use NDAs and only disclose what is necessary until you know who you are dealing with.",
          "score": 1,
          "created_utc": "2026-02-27 11:12:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7qx726",
          "author": "GuitarAgitated8107",
          "text": "The idea in itself is just an idea. It does not have research, validation, capital or any kind of value that would allow those who would copy / steal to take it. Those who have the capital or means to produce might often hear millions of ideas. They are selective on how they go about doing things. \n\nIf anything get a lawyer who can research your options, if it's not worth the price to pay the lawyer then the idea is probably not worth much. ",
          "score": 1,
          "created_utc": "2026-02-27 18:48:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7wnd1y",
          "author": "Dapper_Zombie_3871",
          "text": "Question of the decade.",
          "score": 1,
          "created_utc": "2026-02-28 17:00:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7wwj6u",
          "author": "c4pl4b",
          "text": "Was ist denn genau deine Idee?",
          "score": 1,
          "created_utc": "2026-02-28 17:47:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o81vcqe",
          "author": "capitalsovereign",
          "text": "The hard truth in startups is that ideas are rarely stolen, but execution is everything. Instead of worrying about a patent (which is expensive and hard to defend for software/logic), focus on building a Minimum Viable Product (MVP). Most investors won't even sign an NDA just to hear an idea. You protect your idea by being the first and best at executing it.",
          "score": 1,
          "created_utc": "2026-03-01 13:50:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7pq6gx",
          "author": "Techy-Girl-2024",
          "text": "Yes, patent first then pitch. A provisional patent is like $150 and buys you a year. So don't skip this step, you'll regret it.",
          "score": 0,
          "created_utc": "2026-02-27 15:24:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o81rwhn",
          "author": "indexintuition",
          "text": "i’m not a lawyer, but from what i’ve seen and experienced, ideas by themselves usually aren’t as protected as people hope, it’s the execution that really matters. before spending a lot on patents, it might be worth validating whether people would actually use or pay for your solution, even in a super basic form. you could also talk to a proper patent attorney for a short consult just to understand what is realistically protectable versus what isn’t. a lot of founders end up realizing that moving thoughtfully but steadily, and building something real, is often more powerful than trying to guard the concept in isolation.",
          "score": 0,
          "created_utc": "2026-03-01 13:28:53",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rfi205",
      "title": "Thinking of getting into watch making.",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1rfi205/thinking_of_getting_into_watch_making/",
      "author": "distilledwater__",
      "created_utc": "2026-02-26 18:25:12",
      "score": 3,
      "num_comments": 8,
      "upvote_ratio": 0.72,
      "text": "I’ve been in sales and marketing for over 20 years. Feels weird to say that. My business partner is an engineer. Long story short. We partnered up and do rapid prototyping for manufacturing companies. The business is taking off, which is fun. It’s not a problem but, both the owner and I are into products. In particular I’m into watches . We have a few CNC machines and a bunch of other things. We’ve been pondering starting a new business. He wants to do a larger, how do business for things that go zoom in the water. \n\nWe would have to raise capital for that business. Which, I’m not opposed to because I think I could put the plan and do the pitches. \n\nFor the watches I’ve been thinking of machining our own cases and buying movements from a Swiss supplier. I’m dreaming up a few designs of things that I personally enjoy for my current collection. I figure this would be an expensive endeavor but maybe we don’t buy movements and just do the parts and assembly internally? I think it would be fun, we have the skills and mindset to get this done. Not sure if the whole idea is formulated yet. I’ll probably do another 5 mind maps before I get it flushed out. Think Nomos, fredrique constant etc.\n\nSide note: we will keep doing rapid prototyping until this next venture takes off. ",
      "is_original_content": false,
      "link_flair_text": "Idea Feedback",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1rfi205/thinking_of_getting_into_watch_making/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o7kctvy",
          "author": "random-guy-here",
          "text": "Out local watch repair guy had the machines to reproduce watch gears.  Amazing skills.  Sadly he is deceased.\n\nIt would be quite impressive to work on items of such a small scale.\n\nBuying movements is likely the quickest way to enter the business.  You can be known for the watch cases with a unique look / style.",
          "score": 1,
          "created_utc": "2026-02-26 19:06:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7l00a7",
              "author": "distilledwater__",
              "text": "I think so too. The more I think about it the more I nod my head to it. Maybe it’s small batch production with a good price point and a strong marketing campaign. Strike up a few partnerships with distributors and move items that way and online.",
              "score": 1,
              "created_utc": "2026-02-26 20:57:31",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7kopjm",
          "author": "funkopopruler",
          "text": "Sounds like a lucrative plan tbh",
          "score": 1,
          "created_utc": "2026-02-26 20:03:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7matcu",
          "author": "mrtomd",
          "text": "Did you come from r/seikomods? 🙂",
          "score": 1,
          "created_utc": "2026-02-27 01:00:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7mpd1d",
              "author": "distilledwater__",
              "text": "I didn’t but I have done my own mods on some of my seikos haha.",
              "score": 2,
              "created_utc": "2026-02-27 02:24:20",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7niysd",
          "author": "pragavi",
          "text": "•\t“Things that go zoom in the water” = bigger upside, bigger capital risk, longer runway.\n\t•\tWatches = tighter niche, brand-heavy, but you can start lean and validate demand before going all in.\n\n•If you’re already into watches, that’s an unfair advantage. You understand the buyer psychology — which matters more than machining skill.\n\n•I’d test the watch idea scrappily first: design → prototype → build audience → pre-sell → then scale.\n\n•Capital-heavy plays are fun. Cash-flow-funded brands are powerful.",
          "score": 1,
          "created_utc": "2026-02-27 05:34:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7qj5xn",
              "author": "distilledwater__",
              "text": "Part of me feels like I could do the zoom on water project as the main business venture and do watches as my passion project. Rapid prototyping is boring but very easy to sell. Sometimes it feels like it’s a race to the bottom and margins aren’t always the best. This latest round of tariffs really had us start the exploration. We are going to white board next month. I’ll update from there. Lotus chart here we come!",
              "score": 1,
              "created_utc": "2026-02-27 17:41:59",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1rdivjp",
      "title": "I want to test a boxing punch machine in Mapleton. Has anyone tried it?",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1rdivjp/i_want_to_test_a_boxing_punch_machine_in_mapleton/",
      "author": "SadStill830",
      "created_utc": "2026-02-24 15:14:40",
      "score": 3,
      "num_comments": 0,
      "upvote_ratio": 1.0,
      "text": "So I’ve been thinking about a small side business and I wanted to see what people here think. I live in Mapleton, a town of about 5,100 people, but it gets around 1.3 million tourists a year because of our summer music festival, a weekend car show, and hiking trails nearby. I’m considering putting a boxing punch machine outside a busy café or near the festival area. Something that’s low-effort but could be a fun little attraction for visitors. I’ve looked at different machines online, Alibaba, Amazon, even eBay. A lot of reviews mention that water-filled bases tip or leak, so sand seems more reliable. Durability is key since it could see hundreds of hits on a busy weekend. Pricing per play is tricky too: I want it to cover costs and maybe generate a bit of profit, but still cheap enough that people actually give it a try instead of walking past. Has anyone tried something like this in a tourist-heavy area? Do these machines really make money consistently, or is it more of a novelty that wears off fast? How much maintenance should I expect, and is there anything I should watch out for if it’s outside all day? I’m also wondering if placement really matters, would near a café work better than a high-traffic street corner? Would love to hear real experiences, numbers, or tips. I’m trying to figure out if a boxing punch machine could actually be a sustainable little side hustle instead of just a flashy gimmick.",
      "is_original_content": false,
      "link_flair_text": "Idea Feedback",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1rdivjp/i_want_to_test_a_boxing_punch_machine_in_mapleton/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": []
    },
    {
      "id": "1rgeaw1",
      "title": "How do you find reliable prefab / timber house suppliers in Europe?",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1rgeaw1/how_do_you_find_reliable_prefab_timber_house/",
      "author": "gytisbuda",
      "created_utc": "2026-02-27 18:13:21",
      "score": 3,
      "num_comments": 5,
      "upvote_ratio": 0.8,
      "text": "\nI’ve been researching the European prefab / timber house manufacturing sector and noticed a large number of suppliers from Eastern Europe.\nFor those who distribute or import prefab houses, what criteria do you use when selecting a manufacturer?\nIs it mainly: – Lead time reliability?\n– Margin potential?\n– Certification & structural compliance?\n– Communication & project management?\n– Customization flexibility?\nI’m interested in understanding how distributors reduce risk when working with overseas manufacturers.\nWould appreciate insights from people with real experience.",
      "is_original_content": false,
      "link_flair_text": "Business Partner Sought - Business has NOT been established",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1rgeaw1/how_do_you_find_reliable_prefab_timber_house/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o7qtyho",
          "author": "Khushboo1324",
          "text": "tbh there’s rarely a single “best” prefab timber supplier, it’s more about how you validate them.\n\nfew things that help are folllowing:  \n• ask to see real completed projects, not just renders  \n• talk to past buyers about delays + hidden costs  \n• check structural certifications, timber treatment and warranty  \n• prefer manufacturers closer to your site to reduce transport issues  \n• see if they have certified installers in your area\n\nimo visiting one finished house tells you more than hours of research.\n\nis this for your own build or a development idea?",
          "score": 1,
          "created_utc": "2026-02-27 18:32:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7qui3r",
              "author": "gytisbuda",
              "text": "Thanks for the detailed insights — really valuable points.\nIt’s more from a distribution / partnership perspective. I’m involved in the timber manufacturing side and trying to better understand how distributors evaluate long-term suppliers, especially when working across borders.\nYour point about visiting finished houses is spot on — real projects always reveal more than brochures.\nOut of curiosity, have you worked with European suppliers before?",
              "score": 1,
              "created_utc": "2026-02-27 18:35:22",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7rdu7j",
                  "author": "Khushboo1324",
                  "text": "no not actually but one of my friend had ",
                  "score": 1,
                  "created_utc": "2026-02-27 20:09:38",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1riabbg",
      "title": "How can we do better? Looking for feedback on our business model🙏🏻",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1riabbg/how_can_we_do_better_looking_for_feedback_on_our/",
      "author": "One_Daikon_598",
      "created_utc": "2026-03-01 21:53:15",
      "score": 3,
      "num_comments": 0,
      "upvote_ratio": 1.0,
      "text": "hey everyone,\n\ni run an accounting firm and come from a finance / business controlling background. over the past few years, working closely with entrepreneurs, i kept noticing the same thing.\n\nonce a company grows to around 5–25 employees, things get more complex fast. more payroll, more inventory, bigger investments, tighter cash cycles. but financially, a lot of founders are still steering mostly on instinct.\n\nthey have an accountant. sometimes some dashboards. but no structural business control.\n\nat the same time (at least in my country), there’s a serious shortage of experienced business controllers. hiring one full-time is expensive and often unrealistic for companies in this phase.\n\nso i started building a service company around that gap, together with my team.\n\nwe act as external business controllers for growing companies. we build their KPI structure, set up management dashboards, deliver monthly reports with variance analysis, and help translate numbers into concrete decisions.\n\nbut it’s not just reporting.\n\nin between reporting cycles, we proactively think along on things like inventory financing, hiring decisions, margin pressure, liquidity risk, and bank conversations. software is just a tool for us. the real product is structured, recurring financial control combined with direct human involvement. Going the extra mile for our clients.\n\none example: a client invested in a new machine that was supposed to be more energy-efficient. on paper, costs should have gone down. We wanted to figure out the actual usage, as part of ‘going the extra mile’.\n\nDuring our analysis, we found that actual energy consumption had nearly doubled because of configuration and usage patterns. Revenue growth masked it, but margin was leaking. fixing that resulted in a six-figure improvement over time.\n\nwe’re starting with 10 pilot companies to refine the model and build credibility. the pilot runs for six months at 50% of our normal pricing. we already have 7 pilots running.\n\nnormal pricing:\n\n€5,000–€8,000 setup\n\n€1.250–€1,750 per month, full service.\n\nComplex modelling or additional solutions that take a lot of time, are obviously not included in the monthly fee.\n\ni genuinely enjoy doing this. seeing clarity replace uncertainty for founders is something i could do all day.\n\ni’m not here to pitch aggressively. i’m honestly looking for feedback from you as a community. How could we do better? In regards to our model, and the service to our clients.\n\nif you were running a growing company, would you consider our service?\n\nand if not: what would we need to change, improve, or prove to make it worth your while?",
      "is_original_content": false,
      "link_flair_text": "Idea Feedback",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1riabbg/how_can_we_do_better_looking_for_feedback_on_our/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": []
    },
    {
      "id": "1rh1kd9",
      "title": "I’m testing a “carpooling but for skip bins” startup. Roast this idea.",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1rh1kd9/im_testing_a_carpooling_but_for_skip_bins_startup/",
      "author": "Antique-Speed779",
      "created_utc": "2026-02-28 12:36:09",
      "score": 2,
      "num_comments": 13,
      "upvote_ratio": 0.67,
      "text": "I’m exploring a startup in Australia (starting in Melbourne) and would love some brutal feedback.\n\nThe problem: skip bin hire is expensive ($300–$600+) and most people only use 30–50% of the bin. With cost of living rising and more people renovating, it feels inefficient and wasteful.\n\nThe idea: a platform where neighbours can share a skip bin and split the cost, similar to carpooling or Airbnb.\n\nExample:\n\n• Someone in a suburb posts they need a skip next weekend\n\n• Others nearby join and book a time slot or volume\n\n• The platform coordinates logistics and payment\n\n• Skip provider still delivers one bin, but it’s fully utilised\n\nWhy I think this might work:\n\n• Cost savings for households\n\n• Better utilisation for skip companies\n\n• Sustainability angle\n\n• Strong in dense suburbs and apartments\n\n• Network effects over time\n\n• Potential B2B version for strata, property managers and tradies\n\nQuestions I’m trying to answer:\n\n\t1.\tWhat are the biggest risks or blind spots here?\n\n\t2.\tWould skip providers partner or see this as a threat?\n\n\t3.\tDoes this feel like a marketplace with strong enough retention?\n\n\t4.\tWhat would the moat be long-term?\n\n\t5.\tAny similar startups globally I should study?\n\n\t6.\tWould you focus on consumers first or go B2B?",
      "is_original_content": false,
      "link_flair_text": "Idea Feedback",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1rh1kd9/im_testing_a_carpooling_but_for_skip_bins_startup/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o7z56rx",
          "author": "random-guy-here",
          "text": "Each client is going to say the other guys put way too much in the bin.  They could not even fully use their part of it.\n\nNow you are just dealing with quarreling children.",
          "score": 3,
          "created_utc": "2026-03-01 01:05:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o80ly33",
              "author": "Antique-Speed779",
              "text": "Thanks for this insight. It does make sense.",
              "score": 2,
              "created_utc": "2026-03-01 07:16:48",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7xhdk8",
          "author": "Ill_Football9443",
          "text": "Australian birthright: if a neighbour has a skip, it's fair game to throw your shit in it. You're thinking about making the transaction more difficult by introducing a third party; cutting the baby in half rarely works out well.",
          "score": 2,
          "created_utc": "2026-02-28 19:32:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o80lo50",
              "author": "Antique-Speed779",
              "text": "lol, I’m just curious about people that want to do things the right way and just seeing if it’s a possible opportunity.",
              "score": 1,
              "created_utc": "2026-03-01 07:14:15",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o80mthx",
                  "author": "Ill_Football9443",
                  "text": "I casually know my neighbours, our garages meet so our NBN points are close. I suggested sharing internet - many more times the speed for less cost, just needs a cable from one garage to the other. No real interest shown. \n\nWhat you're aiming to do is find two neighbours who need a skip at the same time, that will use your service and only take up their 50% of available volume. It makes sense on paper, but your target audience is extremely narrow, making it hard to target marketing at.",
                  "score": 1,
                  "created_utc": "2026-03-01 07:24:53",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o81u5fg",
          "author": "capitalsovereign",
          "text": "From an engineering and logistics perspective, your biggest hurdle isn't just the platform, it's volume estimation and contamination. How do you ensure neighbor A doesn't fill 80% when they paid for 30%? Or worse, putting hazardous materials (like asbestos) that ruin the whole load? You’d need a very solid verification system for what goes into that bin.",
          "score": 2,
          "created_utc": "2026-03-01 13:43:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7vi9eo",
          "author": "No-Wish5218",
          "text": "What’s a skip bin",
          "score": 2,
          "created_utc": "2026-02-28 13:19:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7vjyco",
              "author": "Antique-Speed779",
              "text": "It’s an a large open-topped waste container designed for loading onto a special type of lorry called a skip truck.",
              "score": 1,
              "created_utc": "2026-02-28 13:30:18",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7wmpd4",
                  "author": "reddit-ate",
                  "text": "So ...a dumpster?",
                  "score": 0,
                  "created_utc": "2026-02-28 16:57:37",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7xutfz",
          "author": "michaeldonut2",
          "text": "wouldn’t people just throw their stuff in their bin anyway? or if they wanna split the dumpster, i’m sure they can just ask. idk if they need a specific service with a whole website/app for that imo",
          "score": 1,
          "created_utc": "2026-02-28 20:43:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o80lw56",
              "author": "Antique-Speed779",
              "text": "It’s more about connecting people in the same suburb who are planning a clean-up or renovation so they can coordinate and share a skip, rather than just sharing with immediate neighbours.",
              "score": 1,
              "created_utc": "2026-03-01 07:16:17",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o80skkb",
          "author": "psuedojon",
          "text": "I’m not sure your position of only using 30-50% of the bin is correct - my own data point is that I’d only ever get a skip once I am throwing a skip bins worth away and secondly you mention of cost living pressure yet people are renovating. This seems contradictory and if someone is renoing, the cost of a skip bin is negligible compared to the renovation cost.\n\nTldr- initial assumptions are wrong imo.",
          "score": 1,
          "created_utc": "2026-03-01 08:18:55",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rgf15s",
      "title": "I’ve started a new business and would love some feedback",
      "subreddit": "Business_Ideas",
      "url": "https://i.redd.it/uu2tqeeu03mg1.png",
      "author": "Apprehensive_Park202",
      "created_utc": "2026-02-27 18:40:15",
      "score": 2,
      "num_comments": 4,
      "upvote_ratio": 0.63,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Idea Feedback",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1rgf15s/ive_started_a_new_business_and_would_love_some/",
      "domain": "i.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "o7vcrbe",
          "author": "buyMeSomeNo",
          "text": "hi, i here in gujarat. I do something similar but in marketing industry, you are in real estate. this is a worthwhile idea. \n\nmy only advise in the biginning is to find yourself Investor type clients & not budget buyers.",
          "score": 1,
          "created_utc": "2026-02-28 12:41:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7velmg",
              "author": "Apprehensive_Park202",
              "text": "Thank you man",
              "score": 1,
              "created_utc": "2026-02-28 12:54:35",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7yftim",
          "author": "Designer-Rabbit-3828",
          "text": "I love it... but just do you know AI might take this over soon. Good luck tho!",
          "score": 1,
          "created_utc": "2026-02-28 22:37:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o82q10r",
          "author": "MrQueCarter",
          "text": "Perfect",
          "score": 1,
          "created_utc": "2026-03-01 16:31:36",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}