{
  "metadata": {
    "last_updated": "2026-02-23 17:19:57",
    "time_filter": "week",
    "subreddit": "Business_Ideas",
    "total_items": 20,
    "total_comments": 122,
    "file_size_bytes": 153664
  },
  "items": [
    {
      "id": "1ra2i2m",
      "title": "Starting a newsletter can make you some serious money",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1ra2i2m/starting_a_newsletter_can_make_you_some_serious/",
      "author": "Remarkable_Junket185",
      "created_utc": "2026-02-20 17:59:17",
      "score": 107,
      "num_comments": 35,
      "upvote_ratio": 0.85,
      "text": "I made $200 in the last 2 weeks from mine. Proof in comments if you don’t believe me.\n\nMy goal is $2k/month by end of year. And no, I’m not going hard on this, I’m putting in maybe 1-2 hours a week. So that’s why it’ll take 10 months instead of 2. Slow and steady but basically passive so I’m not complaining.\n\nAnyway here’s what I’m doing if you want to copy it:\n\nNiche first\n\nFinance pays the best CPMs but don’t just do “finance.” Go specific. Finance for single moms, stock market for complete beginners, that kind of thing. AI is also a solid bet right now, it’s genuinely exploding. Health, dating, local news — all work too. Just pick something and commit.\n\nBuild it like a company not a diary\n\nSeriously don’t attach your name to it. You want something you could sell one day. A newsletter with your name on it is a freelance gig. A newsletter brand is an actual asset. Different things.\n\nPlatform\n\nSubstack is free and fine for starting. I use beehiiv. Better customization and they have their own ad network built in, which means you can monetize from day 1 without finding a single sponsor yourself. That alone sold me on it.\n\nGetting subscribers\n\nThis is where most people get stuck. Options are:\n\nMeta ads — reliable but expensive. beehiiv has a paid boost feature too where other newsletters basically send their readers your way. Both cost money though.\n\nFree route is content. X, LinkedIn, Reddit. Reddit has been my main thing. I post about side hustles, people find value in it, they subscribe. Got around 150 new subs just last week from Reddit. This exact type of post is how I do it.\n\nSending issues\n\nJust send consistently. AI helps a lot with organizing and formatting but you still have to know how to use it properly or the output is terrible. I use it as a tool not a ghostwriter.\n\n(Writing this post myself by the way, hence the grammar crimes lol)\n\nMoney\n\nSmall newsletter? Use the beehiiv ad network. I’m at 2k subscribers and making $15-20 per issue from it. Not retiring off it but I’m sending the newsletter anyway so it’s basically found money.\n\nHit 5k and you can start going after real sponsors — $100 to $400 per placement depending on your niche. That’s when it gets genuinely interesting.\n\nYou can also do digital products or affiliate stuff on top of that. Multiple streams from the same audience.\n\nAutopilot\n\nOnce you’re at 5k, set up a beehiiv boost at like $1.50-$2 per subscriber. Keep some budget running and you get new subscribers without doing anything.\n\nFor the actual issues, either get a VA or build out an AI workflow that does the heavy lifting. You just review and send. Sponsors tend to stick once you have a relationship going.\n\nEnd result: $2k/month for a couple hours of work a week. That’s the goal anyway.\n\nIf you want to go bigger — $15k, $50k, $1M/month (yes those newsletters exist) — that’s a whole different level of effort. But that’s not what this post is about.\n\nStarted writing this thinking it’d be 200 words. Oops.\n\nDrop any questions in the comments, happy to answer. Proofs going in comments too 👇​​​​​​​​​​​​​​​​",
      "is_original_content": false,
      "link_flair_text": "A How-To Guide that no one asked for",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1ra2i2m/starting_a_newsletter_can_make_you_some_serious/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o6gwr4c",
          "author": "natojudg",
          "text": "$200 in 2 weeks is cute but everyone in here is pretending that means \"serious money\" and its not. Beehiiv ad network payouts are basically lunch money until you have real volume, and \"1-2 hours a week\" is only true if youre fine publishing generic recap slop. Also the \"dont attach your name\" thing is backwards for most newbies: trust sells, faceless newsletters get ignored unless youre already buying subs with Meta ads or Boosts. The hard part isnt picking \"finance for single moms\", its distribution that doesnt die after your first 3 Reddit posts.",
          "score": 11,
          "created_utc": "2026-02-20 18:43:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6p9lbx",
              "author": "BearRootCrusher",
              "text": "I'm an asshole on the internet but at least I'm not this bad",
              "score": 0,
              "created_utc": "2026-02-22 01:46:27",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6twi3b",
                  "author": "natojudg",
                  "text": "lol fair, my comment was spicy. I just hate how ppl sell newsletters like its passive income when its really \"post daily and beg for distribution.\" What part did u disagree with tho, the Beehiiv payouts being tiny or the faceless thing? Curious what you've seen work in the wild.",
                  "score": 1,
                  "created_utc": "2026-02-22 20:01:05",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6qhbye",
          "author": "Big_Statistician2566",
          "text": "Em-dash",
          "score": 8,
          "created_utc": "2026-02-22 07:12:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6qgsr0",
          "author": "cegsywegs",
          "text": "AI slop",
          "score": 7,
          "created_utc": "2026-02-22 07:07:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6jtyvx",
          "author": "Otherwise-69",
          "text": "You're carging from subscriber or generating revenue via ads?",
          "score": 6,
          "created_utc": "2026-02-21 04:32:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6jxmnr",
              "author": "Remarkable_Junket185",
              "text": "Ads",
              "score": 2,
              "created_utc": "2026-02-21 05:00:02",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6jxr88",
                  "author": "Otherwise-69",
                  "text": "Thats new to me will try it definitely",
                  "score": 1,
                  "created_utc": "2026-02-21 05:00:59",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6kqjtw",
          "author": "Appropriate-Fee-7973",
          "text": "how do you find the right subreddits to promote your letter?",
          "score": 3,
          "created_utc": "2026-02-21 09:23:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6pdtxe",
              "author": "Remarkable_Junket185",
              "text": "Hit and trial",
              "score": 1,
              "created_utc": "2026-02-22 02:13:45",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6q301f",
                  "author": "Doctorazy",
                  "text": "I'm sure its hit and trial but most mods remove posts the moment it's linked to something. Have had far too many posts removed especially since my niche is functional health. But thanks for the write up. Here's to hope 👏",
                  "score": 1,
                  "created_utc": "2026-02-22 05:08:56",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6izk57",
          "author": "Remarkable_Junket185",
          "text": "This is my [newsletter](https://wifimoolah.com) for you guys to check out\n\nAnd this is the platform I use [beehiiv](https://www.beehiiv.com?via=Kris-M)",
          "score": 5,
          "created_utc": "2026-02-21 01:13:48",
          "is_submitter": true,
          "replies": []
        },
        {
          "id": "o6uloos",
          "author": "TheFlamingoTraders",
          "text": "Does anyone ever do anything without bragging about it for no reason? You made $200 in two weeks and spent 5 hours posting about it on Reddit. Congrats. The homeless guy on my street corner made more than you, but thanks for dropping knowledge to us idiots.",
          "score": 2,
          "created_utc": "2026-02-22 22:08:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6qcrz8",
          "author": "Relevant_Ant869",
          "text": "That’s honestly a solid start with a $200 in two weeks for a couple hours of work is nothing to shrug at. I like that you’re treating it like a business and playing the long game instead of chasing quick hype. Just keep an eye on your numbers so you know what’s actually profitable and stay consistent. If you track it somewhere simple like https://app.fina.money/signup?ref=f-6jaf0761 it’s easier to see if you’re really on pace for that $2k/month goal.",
          "score": 2,
          "created_utc": "2026-02-22 06:31:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6hlglv",
          "author": "Pickle-Joose",
          "text": "Question for you: how do you get your audience to your newsletter? Do you have a blog? Or where are you directing your audience to? And also how much do you pay a month for your Beehiv subs?",
          "score": 1,
          "created_utc": "2026-02-20 20:42:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6iz2zc",
              "author": "Remarkable_Junket185",
              "text": "Through Reddit mostly. No I do not have a blog. \n\nBeehiiv for me is $69/month",
              "score": 1,
              "created_utc": "2026-02-21 01:10:50",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6jvutx",
                  "author": "Pickle-Joose",
                  "text": "I understand that part but I mean how are you collecting their emails? Are they dm-ing to you? I'm trying to understand how they are getting off reddit to your newsletter ",
                  "score": 1,
                  "created_utc": "2026-02-21 04:46:52",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6ixk21",
          "author": "AngleBackground157",
          "text": "would u be willing to promote my site sourceleader.com and we can work out  rev share deal",
          "score": 1,
          "created_utc": "2026-02-21 01:01:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6iz4zz",
              "author": "Remarkable_Junket185",
              "text": "Dm",
              "score": 1,
              "created_utc": "2026-02-21 01:11:11",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6tlwm3",
          "author": "Electronic_Peak_9366",
          "text": "nice",
          "score": 1,
          "created_utc": "2026-02-22 19:08:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6wyl0r",
          "author": "Time_Stop_3645",
          "text": "If I'm forced to drop my email somewhere it usually goes to my trashmail... who reads newsletters in 2026?",
          "score": 1,
          "created_utc": "2026-02-23 07:22:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6xbmt0",
              "author": "Remarkable_Junket185",
              "text": "You’ll be surprised to know the answer to your question",
              "score": 1,
              "created_utc": "2026-02-23 09:29:45",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6gpyq9",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-20 18:13:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6krmra",
              "author": "Picklejar75",
              "text": "How are you generating revenue via your blog?",
              "score": 1,
              "created_utc": "2026-02-21 09:34:34",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6hriqk",
          "author": "extrapointsmb",
          "text": "Are you like, 11?",
          "score": -2,
          "created_utc": "2026-02-20 21:11:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6q0os3",
          "author": "RatedR_2736",
          "text": "Looks dope! I have a few ideas for an app, but I wanted to understand how you guys source the icons and images used in the app.",
          "score": 0,
          "created_utc": "2026-02-22 04:51:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6wen0j",
              "author": "Remarkable_Junket185",
              "text": "Lol what app",
              "score": 1,
              "created_utc": "2026-02-23 04:37:25",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6gytn3",
          "author": "[deleted]",
          "text": "[deleted]",
          "score": -1,
          "created_utc": "2026-02-20 18:53:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6h99sl",
              "author": "Ill_Football9443",
              "text": "Is the spammer in the room with us now?!?",
              "score": 1,
              "created_utc": "2026-02-20 19:42:15",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6q4fv3",
          "author": "HarjjotSinghh",
          "text": "this passive hustle sounds like a dream.",
          "score": -2,
          "created_utc": "2026-02-22 05:20:24",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r6k91f",
      "title": "Subscription plan that gets cheaper the longer you're subscribed",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1r6k91f/subscription_plan_that_gets_cheaper_the_longer/",
      "author": "the_armanda",
      "created_utc": "2026-02-16 20:03:16",
      "score": 34,
      "num_comments": 19,
      "upvote_ratio": 0.95,
      "text": "Hey, this is just a shower thought. If businesses are already doing this then great but I just haven't seen it yet:\n\nHow about a subscription plan that gets cheaper the longer you're subscribed and thus rewards you for staying loyal to the business/brand? Let's be real: the economy sucks. While money is getting tighter, everything's becoming a subscription. If you're trying a subscription model, you're competing with a dozen other subscriptions. The customer's probably very hesitant to add one more to set and forget, so why not make the decision easier?\n\nMany services, when you cancel, will beg you to stay with a super marked-down price for like two or three months. From my perspective at least, when they pull this it feels like someone promising really hard to change when you wanna cut things off... only to go back to the same shit. Why not build a relationship with the customer before that: say \"hey, if you join us and stay with us, we'll hog less of your wallet.\"\n\nNow, obviously it wouldn't go down to $0. Maybe in a year a monthly subscription incrementally goes from $10 to $5 and stays that way. The point is that the customer sees value not just in the subscription and service but continuing to stick with it. Dropping the subscription would feel like throwing away a long-term benefit.\n\nI imagine this pressure would lead to higher retention. Sure some people are paying less but those are the people that stay, the people you can rely on the most.\n\nYou could probably handle cancellation however you want but personally I wouldn't cut off the benefit immediately; maybe just incrementally increase the subscription price each month they're away until it's back to the original.\n\nI don't really have anything I'd use this model for. I freelance articles and those prices are based on word count. I'm working on a webcomic and I'd probably just ask for donations each month in exchange for early releases and bonus content. But if anyone else thinks this is a good idea and wants to try it (or is doing it already), tell me how it goes! If you think it sucks, the downvote button is right there lol.",
      "is_original_content": false,
      "link_flair_text": "Idea Feedback",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1r6k91f/subscription_plan_that_gets_cheaper_the_longer/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o5quir2",
          "author": "Khushboo1324",
          "text": "This is actually a smart retention idea. People love feeling rewarded for loyalty, but the key will be making the value very visible and easy to understand. If users clearly see how much they’re saving over time and what they unlock by staying, it can turn into a psychological win rather than just a pricing trick. I’d also test it with a small group first to see how it impacts churn versus margins, because sustainability matters as much as creativity here.\n\nWhen I was experimenting with a similar concept, having a simple runnable setup where users could log in and track their progress made a big difference in engagement. I used Runable for that part and it helped me get early feedback quickly. Just sharing what worked for me.",
          "score": 7,
          "created_utc": "2026-02-16 20:24:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5qyypi",
              "author": "the_armanda",
              "text": "That's really cool! Yeah maybe on a subscription page there's a scale or chart of your savings over time, where you are and what benefits you gained.",
              "score": 1,
              "created_utc": "2026-02-16 20:46:17",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5r1g7p",
                  "author": "Khushboo1324",
                  "text": "Yeah exactly, a visual like that could make a huge difference. If people can literally *see* their savings growing over time, it turns the subscription into something they feel invested in rather than just another monthly charge. You could even experiment with small milestone rewards along the way, not just price drops, so there are moments of positive reinforcement before the big discount kicks in. That emotional progress might matter just as much as the financial one.",
                  "score": 1,
                  "created_utc": "2026-02-16 20:58:26",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5r93ym",
          "author": "DenverKim",
          "text": "It doesn’t get cheaper, but the CRM software I use for my small business grandfathered me in at the original rate I signed up for… I’ve been using it for 10 years now and I am paying half of what I would pay if I signed up as a new customer today or if I signed up for any of the other competing companies. There is actually another company I would prefer to use at this point (they even offered me a free year to switch over to their service) but it’s not worth it to justify doubling the monthly cost in the long run, so they basically have me for life now.",
          "score": 6,
          "created_utc": "2026-02-16 21:35:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5tmmvr",
          "author": "jrbp",
          "text": "Most put their prices up over time to fight losses from inflation; how will you navigate that?",
          "score": 6,
          "created_utc": "2026-02-17 06:17:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5quex6",
          "author": "pranimtun",
          "text": "JetBrains does that with the PHPStorm license. If I remember correctly you pay the second and the third year less money than in the first year.",
          "score": 4,
          "created_utc": "2026-02-16 20:23:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5rlfiu",
          "author": "FangedJaguar",
          "text": "I really like this idea, but I would not advertise it upfront. The fear of loss is a great way to keep customers, but if I saw a higher upfront price, it would be a huge turnoff to me signing up in the first place",
          "score": 4,
          "created_utc": "2026-02-16 22:37:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5rox0x",
          "author": "imabetaunit",
          "text": "OP, you must be the Comcast rep I’ve been complaining to every year when my stupid promo rate expires.",
          "score": 3,
          "created_utc": "2026-02-16 22:55:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5rt3pe",
          "author": "kevmoss",
          "text": "I like it - build in a reward exponential element, introduction fees are bigger the longer you subscribe. \nThere are cons to this but it would be interesting.",
          "score": 3,
          "created_utc": "2026-02-16 23:18:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5tfbei",
          "author": "ChestChance6126",
          "text": "Interesting idea, but I’d watch the unit economics. Your longest term customers are usually your most profitable. Discounting them cuts into the cohort that’s already working. Retention usually comes more from ongoing value than pricing mechanics. ",
          "score": 3,
          "created_utc": "2026-02-17 05:19:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5uvk4k",
          "author": "slowburn_otters",
          "text": "Lowkey I actually like this idea. It flips the usual “we’ll only care once you try to leave” vibe and makes loyalty feel real instead of desperate.\n\nThe only tricky part is pricing psychology — some companies might worry people will game it (sub for a year, cancel, come back later). But if it’s structured right, it could build solid long-term users instead of constant churn.\n\nWay better than those fake “pls don’t go here’s 70% off for 2 months” emails tbh.",
          "score": 3,
          "created_utc": "2026-02-17 12:49:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5y7qrv",
          "author": "mr_asadshah",
          "text": "I do that but it’s unadvertised. Our agency retainer is £1,800 I just drop it to £1,500 after a bit for no reason",
          "score": 2,
          "created_utc": "2026-02-17 22:45:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5szjz4",
          "author": "Wwwweeeeeeee",
          "text": "My auto insurance was like that, once upon a time, Progressive, in CA. My rates got lower every year, due to no accidents or tickets. Every little bit helps and I still obviously recommend them. My adult kid has them too.\n\nAnd my live UK TV subscription hasn't ever raised my rates as a \"Legacy\" member, while new subscribers pay a few euros more, and I appreciate that, very much.  They were originally based out of Ukraine, now I don't know where they're landed, due to the russian invasion, but their service remains consistent and reliable. ",
          "score": 1,
          "created_utc": "2026-02-17 03:29:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o65km1h",
          "author": "springcaterpillar",
          "text": "ndfathering. don't raise prices on existing customers while new signups pay more. it rewards loyalty without complicating the pricing page or attracting people who are only there for the discount curve.",
          "score": 1,
          "created_utc": "2026-02-19 00:14:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6tufuj",
          "author": "nftcollector198",
          "text": "you should start a stripe competitor with your pricing model",
          "score": 1,
          "created_utc": "2026-02-22 19:50:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5qr5cs",
          "author": "Joseots",
          "text": "That’s the opposite of how businesses grow & are profitable. \n\nNot saying it’s a bad idea.  But why would a business choose to be less profitable - when you can still cancel anytime.  \n\nNow a cheaper subscription to guarantee you remain a customer — like annual deals vs monthly are common already.  \n\nExisting customers are a businesses most profitable center, they aren’t gonna shrink the golden goose.",
          "score": 0,
          "created_utc": "2026-02-16 20:07:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5qxo92",
              "author": "the_armanda",
              "text": "First, thank you for your feedback because it did give me pause. Granted, I'm not an entrepreneur but\n\n>Not saying it’s a bad idea. But why would a business choose to be less profitable - when you can still cancel anytime.\n\nYes, the customer can cancel at any time, but if you compare two plans for the exact same service, economically a customer has less reason to cancel a $10 monthly subscription that becomes $5, than a $10 subscription that will always be $10. I guess it'd be akin to a growth-first model that tries to expand the customer base at expense of profit.\n\nAlso the variables can change depending on what's feasible. Maybe instead of going down to $5 it goes down to $7, or instead of going down over the course of a year it goes down over two years, or three.\n\n>Now a cheaper subscription to guarantee you remain a customer — like annual deals vs monthly are common already.\n\nYeah, there are annual deals, but they're not predicated on loyalty and will still spook your wallet. $100 seems steep whether it's 10% off, 20% off, 50% off, et cetera. As a first time subscriber, you don't know whether you're actually gonna need it or use it that much. Monthly savings over time requires less perceived upfront commitment from the customer.\n\n>Existing customers are a businesses most profitable center, they aren’t gonna shrink the golden goose.\n\n[It's already shrinking.](https://www.vice.com/en/article/the-subscription-era-is-over-the-purge-has-begun-in-america/) That's why cord-cutting services are becoming popular (while ironically also asking for subscriptions). This decade has been defined by a lot of economic uncertainty, so hard choices have to be made. I think it's more profitable to have a customer that pays a few dollars less a month than a customer that axes the expense altogether when they don't have a few extra dollars. That's why companies will beg you to stay at a significantly lower price if you threaten to cancel.",
              "score": 6,
              "created_utc": "2026-02-16 20:39:54",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r84c41",
      "title": "Zero Money. Zero Network. Zero Stability. How Do I Actually Build Something?",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1r84c41/zero_money_zero_network_zero_stability_how_do_i/",
      "author": "Realistic_Edge_2267",
      "created_utc": "2026-02-18 14:24:15",
      "score": 26,
      "num_comments": 39,
      "upvote_ratio": 0.95,
      "text": "Hey everyone,\n\nI’m new to business and I genuinely want to build something of my own. I’m open to different models — SaaS, brokerage, service-based, anything practical. My goal is simple: become financially stable first, then grow from there.\n\nMy biggest issue is execution.\n\nI can research, plan, and generate ideas. But when it comes to launching and handling risk, I hesitate — mainly because I don’t have financial backup to absorb losses.\n\nHere’s what I’ve tried so far:\n\n* Looked into dropshipping — realized it requires ad spend and risk tolerance I currently don’t have.\n* Built SaaS projects — development is manageable, but marketing and customer acquisition feel overwhelming without budget.\n* Considered brokerage/middleman models — low capital, but requires strong communication skills (which I’m still improving).\n* Tried freelancing — very competitive as a beginner.\n* Considered social media — but I prefer building something private and scalable rather than personality-driven.\n\nI’m not looking for shortcuts or “get rich quick” ideas.  \nI’m looking for realistic direction.\n\nIf you were starting from:\n\n* Almost zero capital\n* No strong network\n* Limited risk tolerance\n* Beginner-level communication skills\n\nWhat would be the most logical first step to build stability?\n\nShould I:\n\n* Focus on building a skill first?\n* Get a job and stack capital?\n* Start a small service business?\n* Something else entirely?\n\nI’m open to honest feedback — even if it’s tough to hear.\n\nIf you’ve been in a similar situation and managed to build something sustainable, I’d really value your perspective.\n\nThanks for reading.",
      "is_original_content": false,
      "link_flair_text": "Marketing / Operational / Financial / Regularotry Advice sought",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1r84c41/zero_money_zero_network_zero_stability_how_do_i/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o66chwz",
          "author": "VetPrepHelp",
          "text": "Find something you are extremely passionate about that way even if it never works out you will have satisfaction doing it. Ex. I am an Air Force Veteran who was discharged as a result of an accident that happened while i was in service. As a result i experienced temporary homelessness but had enough mentors and support system around me to keep me motivated and not give up. After years and years of going through treatment and fighting the VA, i finally received what i deserved. Since then, not only have i worked for a medical consulting company helping veterans with their claims but have spent my personal time volunteering and helping advice Veterans on their own claims(no longer my day job but something i do for fun).\n\nAs a non technical founder, i was able to somehow build an MVP/prototype platform that a handful of veteran are using for absolutely free. My end goal? Be the National Infrastructure for all things related to Veteran Preparedness starting with VA benefits.  Lofty goal, i know but someone has to claim it so why not me. Other competitors are charging Veterans for the education which to me is absurd and is the reason why i hope to disrupt the market by offering my services for absolutely FREE to all veterans. SO who will my paying customers be? Legal firms, medical consulting companies, accredited organizations, Veteran Service Officers, and the VA themselves. \n\nAm i currently profitable? Heck no...in fact i am in the red but with the feedback ive been getting from my free users, i know i am headed in the right direction. My main goal for now is getting enough Veterans using my platform, find value in it, share it, spread the word out and eventually those other organizations will take me seriously.\n\nThere is a quote that says \"If you don't stand for something, you will fall for anything\"  I stand with the Veteran community and others who are or have ever worn a Uniform in support of this Great Nation. This platform is something i am passionate about and willing to keep going at it even if i never get a single paying customer.\n\nSo to answer your question: How Do I Actually Build Something? Find something you are extremely passionate about, identify a well known problem regarding passion, come up with a solution that will serve others who share similar interest in your passion, go balls to the wall doing it and hang on for dear life.\n\nHope this helps, and best of luck.  Feel free reaching out and keeping in touch. We can do this!!!",
          "score": 5,
          "created_utc": "2026-02-19 02:55:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o69d2fa",
              "author": "Realistic_Edge_2267",
              "text": "Thank you for your help and service without you guys we can't sleep peacefully so once again thank you for duty and also sorry to hear your loss",
              "score": 1,
              "created_utc": "2026-02-19 15:57:44",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o69eo3o",
                  "author": "VetPrepHelp",
                  "text": "Just like with investing, its only a profit/loss once you sell.   \n  \nMy mindset is its only a loss if i quit or stop helping veterans which i do not see myself doing since i will always help other veterans in need.\n\nI haven't lost anything yet since i am still going through the journey, but thank you for empathising. ",
                  "score": 2,
                  "created_utc": "2026-02-19 16:05:30",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o6hfezn",
              "author": "Hot_Society124",
              "text": "This is music to my ears and tremendous advice, I wish you all the best in pursuing it!",
              "score": 1,
              "created_utc": "2026-02-20 20:12:07",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o62nir8",
          "author": "kops212",
          "text": "Get a job, and build that financial buffer. No way around it, suck it up.",
          "score": 3,
          "created_utc": "2026-02-18 16:01:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o62nt1m",
              "author": "Realistic_Edge_2267",
              "text": "But currently I in degree so I m kinda stuck in that without degree no one will give me job",
              "score": 1,
              "created_utc": "2026-02-18 16:03:08",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o65r5xi",
                  "author": "kops212",
                  "text": "Study, graduate, and get a job then?",
                  "score": 1,
                  "created_utc": "2026-02-19 00:51:26",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o684i7r",
                  "author": "That_Response_2648",
                  "text": "Im sorry but fuck a degree ! I don't or arleast didn't one have either in 2011. Starting learning and learning and learning youtube after YouTube video into electronics( built bunch of projects from scrap ) documented the process into portfolio. Drones, automation, kids toys, energy harvesting. You name it. Got a job as a electronic technician. Worked there 3 years and learnt everything I needed. \n\nImmigrated to new country got job in days with the built up portfolio and couple of years experience. Started doing online studies to get my degree. Finished that in 2018. Was dissipointed in the material as it was nothing new. \n\nMoving companies couple of times and now 6 figure salary. Not a single person asked for proof of degree. They want/hire attitude, eagerness to learn and portfolio of experience.  \n\nDegree is an indication of the above attributes becuase it indicates that the person can think but its certainly not a roadblock and definitely out dated requirement.",
                  "score": 1,
                  "created_utc": "2026-02-19 11:36:07",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o634hku",
          "author": "oratosdigital",
          "text": "The odds are against those who build, I think you can start by building your ideas as a side project to validate your ideas and this can help with the network you need too.",
          "score": 3,
          "created_utc": "2026-02-18 17:18:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o634py4",
              "author": "Realistic_Edge_2267",
              "text": "Oh ok",
              "score": 1,
              "created_utc": "2026-02-18 17:19:39",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o68itzi",
          "author": "indexintuition",
          "text": "i say this gently because i used to do the same thing, but if execution is the issue, adding more models to research will not fix it. with zero capital and low risk tolerance, the most logical move is usually to build a skill that someone will pay for, ideally while you have stable income from a job. boring is underrated. a simple service you can deliver manually teaches you sales, scope, communication, and delivery without ad spend or tech overhead. stability first, then experiments on the side in very small tests you can afford to fail. the goal early on is not scale, it is proof that you can close and deliver consistently. that confidence compounds way more than a perfectly planned saas ever will.",
          "score": 3,
          "created_utc": "2026-02-19 13:16:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o69cuhc",
              "author": "Realistic_Edge_2267",
              "text": "Thank you for help",
              "score": 1,
              "created_utc": "2026-02-19 15:56:40",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6f7kf5",
                  "author": "indexintuition",
                  "text": "no prob.\n\n",
                  "score": 1,
                  "created_utc": "2026-02-20 13:54:09",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o6gtoi1",
              "author": "mia_brooklynside",
              "text": " I totally feel you there. Focusing on skill-building while keeping a steady job was my lifesaver when I was in a similar spot. Starting with a simple service really helps you learn the ropes without breaking the bank!",
              "score": 1,
              "created_utc": "2026-02-20 18:29:45",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o69ca5c",
          "author": "Worldly_Berry2703",
          "text": "Similar position. Recently listened to this episode on Lenny. My takeaway from it is to just to go out and do it; build a network / brand. I'm starting to realise 'talking to people with intention' might be the best way to make change. \n\n[https://www.lennysnewsletter.com/p/the-paths-to-power-jeffrey-pfeffer](https://www.lennysnewsletter.com/p/the-paths-to-power-jeffrey-pfeffer)",
          "score": 2,
          "created_utc": "2026-02-19 15:53:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o69ct7c",
              "author": "Realistic_Edge_2267",
              "text": "Thank you for help",
              "score": 1,
              "created_utc": "2026-02-19 15:56:29",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6dojha",
          "author": "Successful_Living242",
          "text": "Get a job → learn a skill → freelance → then build.\nBoring? Yes. The only path that actually works from zero? Also yes.",
          "score": 2,
          "created_utc": "2026-02-20 06:31:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6dveib",
              "author": "Realistic_Edge_2267",
              "text": "Bro i have skills and i have even tried to do freelancing but freelance market is so crowded that i never get work and for job i m currently in an ongoing degree and without degree no one will give me job\n\n",
              "score": 2,
              "created_utc": "2026-02-20 07:33:34",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6q5ihi",
                  "author": "Successful_Living242",
                  "text": "Before I give you any advice, I need to ask a few sharp questions because right now you've given me a vague picture and I'd be doing you a disservice by responding to incomplete information.\n\nTell me specifically:\n\n1. What are your actual skills? (Not categories — be specific. \"Graphic design\" is vague. \"Logo design in Illustrator + brand identity for small businesses\" is a skill.)\n2. How did you try freelancing? Where did you post? \n3. What did your profile/portfolio look like? How many proposals did you send and over what time period?\n4. What degree are you currently pursuing and how far are you into it?\n5. How old are you and what's your financial situation - are you under pressure to earn NOW, or do you have runway?",
                  "score": 1,
                  "created_utc": "2026-02-22 05:29:01",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6231b5",
          "author": "AutoModerator",
          "text": "Due to the status of your account, your post has been flagged (not yet published). Please read the following to get it manually approved:\n\n**Ensure that you have chosen the correct flair**  \nEach flair is specifically designed to facilitate discussion and allows contributing members to filter post types. Incorrect flair selection results in the removal of 70% of posts. Here’s an overview:\n\n- **Idea Feedback**: Use this if you're sharing a business idea for community feedback. Not for requesting ideas—use \"What business do I start?\" instead.\n- **What business do I start?**: Provide relevant details such as interests, capital, skills, preferred business type, and experience.\n- **Business Partner Sought**: AutoModerator will send you additional guidelines for partnership posts.\n- **App/Website Idea**: For technology-based business ideas.\n- **Review my website, please**: Sites collecting emails or requiring login without demo credentials will be removed.\n- **Need a name**: Describe your business, naming preferences, and rejected names.\n- **Marketing / Operational / Financial / Regulatory Advice sought**: Request advice for an existing or proposed business.\n- **A How-to guide that no one asked for**: Share your experiences or guides (no affiliate links allowed).\n- **No applicable flair exists for my post**: Use this only if none of the above apply.\n\n*If your post has the correct flair, continue reading...*\n\n**Advertising Policy**  \nPosts must not promote courses, blogs, newsletters, affiliate links, or websites without prior approval. Unauthorized promotions undermine the community's integrity and will be removed.\n\n**Effort & Formatting Guidelines**  \n- Posts with insufficient details may be removed under the 'low effort' rule. Have you provided enough information for meaningful responses?  \n- Clearly format your post with paragraphs for readability.\n\n**Request Approval**  \nOnce you've reviewed these guidelines, checked your flair, and proofread your post, request approval via this [link](https://www.reddit.com/message/compose/?to=/r/Business_Ideas&subject=Approval&message=/r/Business_Ideas/comments/1r84c41/zero_money_zero_network_zero_stability_how_do_i/).\n\nAdhering to these guidelines will increase your submission’s chances of approval and community engagement.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Business_Ideas) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-18 14:24:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o65krlk",
          "author": "[deleted]",
          "text": "[deleted]",
          "score": 1,
          "created_utc": "2026-02-19 00:15:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o69danh",
              "author": "Realistic_Edge_2267",
              "text": "Can u explain me more in dm",
              "score": 1,
              "created_utc": "2026-02-19 15:58:51",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o65r4q3",
          "author": "arrigus",
          "text": "This is not exactly business advice as I'm still making 0 profit from this, but since you are considering SaaS, I'm assuming you have some development experience or skills, so one very low budget option is static websites. I have very limited budget and zero network like you, so I'm currently trying to go with static websites now.\n\nSome of the advantages are:\n\n\\- They are much cheaper than full stack SaaS. It depends on your hosting provider, but you might end up paying just for your domain, which can be 10 to 30 dollars a year.\n\n\\- They are also much more secure than full stack SaaS, since they have no backend and expose less surface for potential attacks.\n\n\\- They are much easier to build than full stack SaaS. Since they have no backend, you are basically building only the frontend, with no databases to integrate, no user authentication or authorization, no complex (and potentially expensive) backend logic, etc.\n\nSome of the downsides are:\n\n\\- They may be less profitable than SaaS, because you usually have fewer monetization options\n\n\\- Huge competition: since static sites are relatively easier to build, the barrier to entry into this kind of business is very low\n\n\\- Less flexibility: with a static site, you basically have a frontend-only website, so what you can offer is limited to what a frontend-only website can do. For your reference, blogs, product reviews, courses, mini-games, news articles, online portfolios and advertising for existing businesses are the typical applications of static websites.\n\n\\- AI can potentially kill your business. A lot of people today just search through AI models, they don't visit websites directly, so this may kill your traffic. There are options for charging AIs to use your content, but this is still a huge risk.\n\nMarketing is always hard, not only for static websites. SEO is basically free ads for your site, it gives you a big help, but it's extremely hard to get to the top search results, so I would consider social media and active advertisement as well. Not necessarily paid advertisement. For example, you can try to find groups or communities online that are having an issue that your website can solve, and you can offer to give them a hand. It's not easy, but that's an option.\n\nIf you have no ideas for building your own website, you can also build websites for clients. Maybe try freelancing or look for local businesses who may need one (maybe not necessarily a new one, they may also need to improve the website they already have), but in this case you have to first become more familiar with the technology, because businesses may be less forgiving on your mistakes.\n\nOnce again, don't take this as business advice. I've launched two static websites last year, and I haven't earned a single dollar yet, so this may as well be guaranteed failure. But I'm seeing an increase in traffic to my websites, so I thought of suggesting this to you.",
          "score": 1,
          "created_utc": "2026-02-19 00:51:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o69d50z",
              "author": "Realistic_Edge_2267",
              "text": "Thank you for advice",
              "score": 1,
              "created_utc": "2026-02-19 15:58:05",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o6e3qox",
              "author": "smarkman19",
              "text": "Static sites are a solid call, but I’d narrow it even more: pick one tiny problem and build a stupidly focused site around it, not a “blog” or “resources hub.” Single problem, single audience, single action.\n\nA few things that helped me:\n\n1) Ship fast using a basic stack like Astro or just plain HTML + Tailwind. Don’t over-engineer, just get something live in a day or two.\n\n2) Treat each page as a landing page, not an article. Clear pain, clear outcome, one CTA (email form, lead magnet, calculator, etc.). Static doesn’t mean passive.\n\n3) For “free” marketing, I use Ahrefs Webmaster Tools for basic SEO checks, Google Search Console to see what I’m actually ranking for, and Pulse for Reddit in the background to surface threads where people are already asking about the exact problem my page solves so I can jump in naturally.\n\nPoint is: keep the tech simple, obsess over one tiny use case, and use communities + search data to guide what you build next.",
              "score": 1,
              "created_utc": "2026-02-20 08:51:52",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6fhwwc",
          "author": "OpsGuy82",
          "text": "This might be a controversial opinion but it sounds to me like you are a good fit for an owner/operator franchise model. Something like Junk King can give you processes to follow, support in execution and practically eliminate many areas that you find difficult. My tip would not be to buy directly from the franchisor, but see if you can buy from someone who thought they could be an absentee owner and is selling their equipment and franchise for under $100k. I think a lot of investors bought these models only to realize there is not enough margin for absentee ownership and are selling on the cheap. I have no affiliation with junk king but I am very familiar with the industry. ",
          "score": 1,
          "created_utc": "2026-02-20 14:48:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6fsnot",
          "author": "0xAdr7",
          "text": "Look into the services that you willing to pay monthly, then copy it and build it with AI. Sell it with cheaper subscriptions fee",
          "score": 1,
          "created_utc": "2026-02-20 15:40:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6hsabe",
              "author": "Certain-Rhubarb4796",
              "text": "how to copy with ai?",
              "score": 1,
              "created_utc": "2026-02-20 21:15:45",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6smfmk",
                  "author": "Same_Poem1311",
                  "text": "use claude code or cursor its very good trust me",
                  "score": 1,
                  "created_utc": "2026-02-22 16:25:59",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o6i9p7t",
              "author": "vapenation1312",
              "text": "1 example",
              "score": 1,
              "created_utc": "2026-02-20 22:44:42",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6ft4e0",
          "author": "Relevant-Solid-784",
          "text": "Here is what I would do, you seem good at building but need good mentors for operations. Build what you know and iterate on it. Most businesses fail because the person doesn’t seem reaction fast enough, maybe sit down and go through and evaluate why these ideas didn’t take off",
          "score": 1,
          "created_utc": "2026-02-20 15:42:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6i9kjl",
          "author": "vapenation1312",
          "text": "Gl",
          "score": 1,
          "created_utc": "2026-02-20 22:44:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6nasus",
          "author": "Remarkable_Being9148",
          "text": "I'm not a businessman or anything of that sort, but the first step should always be to get a job that can provide both capital for your business,emergency fund, investments, etc. And teach you skills that will come in handy in your business or part of your business. Obviously, you can't handle a large business on your own. Eventually, you will need employees. So, for instance, if you work in cybersecurity, once you create a business, get it off the ground and grow it, you can handle the cybersecurity side of your business and get employees or outsource freelancers to handle other parts of your business. But since your main concern is starting your business, I'd say find a job that can teach you valuable skills and once you feel secure enough, start your business and just face things as you go.",
          "score": 1,
          "created_utc": "2026-02-21 19:06:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6r7tc8",
          "author": "Happyut0",
          "text": "👍",
          "score": 1,
          "created_utc": "2026-02-22 11:25:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6478gc",
          "author": "Physical_Carrot_6283",
          "text": "1996 a guy wanted to open a restaurant that only sold chicken fingers.  He couldn’t find any investors.  He took a job as an Alaskan Fisherman and saved his money.  Now we have Rasing Cane’s",
          "score": 0,
          "created_utc": "2026-02-18 20:12:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o69dcjt",
              "author": "Realistic_Edge_2267",
              "text": "Thank you for an amazing story",
              "score": 1,
              "created_utc": "2026-02-19 15:59:07",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1rckv28",
      "title": "Why helping foreigners set up a US LLC might be one of the most underrated business opportunities right now",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1rckv28/why_helping_foreigners_set_up_a_us_llc_might_be/",
      "author": "Italcan",
      "created_utc": "2026-02-23 15:43:39",
      "score": 10,
      "num_comments": 10,
      "upvote_ratio": 0.75,
      "text": "Millions of freelancers and devs outside the US - Latin America, Eastern Europe, India, Nigeria - desperately want a US LLC. Not because they live here, but because it unlocks Stripe, PayPal, US clients, and real banking. The demand is huge.\n\nThe actual cost to set someone up? Embarrassingly low. Wyoming LLC formation (\\~$99 via InCorp for example) + registered agent (\\~$129/year) = under $230 total. That's your cost base.\n\nBut foreigners don't do it themselves because the process has some issues\n\n1. EIN can't be applied online without a US SSN. Non-residents fax Form SS-4 and wait 2-5 weeks (one wrong field = start over) 2) Foreign-owned LLCs must file Form 5472 annually or face a $25K IRS penalty - most people find out *after* the fact 3) Opening a US bank account as a non-resident has gotten significantly harder since 2024\n\nNone of this is complicated. It's just confusing and terrifying if English isn't your first language.\n\nThe business: \"done for you\" setup service. You handle everything, charge $400-600, keep $200-400 margin per client. But the real opportunity is going niche - Spanish-speaking founders, Indians dealing with FEMA compliance, Nigerians locked out of Stripe Atlas. Each is an underserved community with zero localized competition.\n\nThe knowledge barrier is real but learnable. And for these clients, a US LLC isn't a nice-to-have - it's the difference between getting paid or not.\n\nAm I missing something?? I think it's to good to be true, that's why I'm asking you to give some feedback",
      "is_original_content": false,
      "link_flair_text": "Idea Feedback",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1rckv28/why_helping_foreigners_set_up_a_us_llc_might_be/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o6z8wd4",
          "author": "Queasy-Grass4126",
          "text": "It is a very good idea, but it is a bit more complicated than you make it seem and would need to be done slightly differently to work out. \n\nWhat many would need is a someone who can act as a US based co-founder for the LLC, who can handle the legal, financial, tax, and other regulatory framework for everything for the US side of the operation in a way that does not become prohibitively expensive from hiring accounts and attorneys to handle it. \n\nThen, in order to simplify the processing for receiving funds from the US bank account in their home country, they would need to form a sister corporation in their home countries to properly link them to reduce their global financial AML/CTF risk profile.\n\nSo, the best way to do this would be to create a company that helps by acting as a minority co-owner for foreigners and handles US side logistics, including offering to act as an initial point of contact with US facing clients, and then effectively outsourcing operations for the foreign national to take care of.",
          "score": 3,
          "created_utc": "2026-02-23 16:51:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6z69kp",
          "author": "Old_fart5070",
          "text": "You mean Stripe Atlas?",
          "score": 2,
          "created_utc": "2026-02-23 16:39:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6z18hl",
          "author": "FalseRegister",
          "text": "There's not \"millions\" of people \"desperate\" for an US LLC\n\nAlso, Stripe Atlas (and many others) offer this service. Opening a US LLC is very straightforward nowadays. \n\nIf you can automate or swallow some costs to lower your price, then yes, it can work.",
          "score": 2,
          "created_utc": "2026-02-23 16:16:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ze07c",
          "author": "bselite",
          "text": "The problem is there can end up being a lot of overhead when you start scaling and 50 customers all have random questions or complaints about their business being formed.\n\nAnother thing is that it’s not easy to find new customers and in the places your customers can be found. You already have places like Stripe Atlas, Doola, and a few other smaller startups. It can be done but definitely not as “easy” as it sounds.",
          "score": 1,
          "created_utc": "2026-02-23 17:15:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6z6w6k",
          "author": "Subject-Athlete-1004",
          "text": "honestly this is a legit opportunity and you're not missing much 😅 the demand is very real — i've seen so many devs and freelancers in latam and southeast asia struggle with exactly this stuff. the margin math checks out too. the main thing i'd watch out for is liability... you're essentially giving tax and legal-adjacent advice to people in different countries and if something goes wrong like a missed 5472 filing that $25k penalty is on THEM but they're blaming YOU. so make sure your terms of service are bulletproof and maybe partner with an actual cpa or tax professional rather than winging it yourself. also the niche angle is spot on — going after spanish-speaking founders or specific regional communities where you can build trust is way smarter than trying to be a generic formation service competing with stripe atlas and firstbase. recurring revenue is where this gets interesting tho... don't just do the one-time setup, bundle ongoing compliance and annual filing for like $50-100/month and suddenly you've got a real business not just a service. what community are you thinking of targeting first?",
          "score": 1,
          "created_utc": "2026-02-23 16:42:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6yyr5y",
          "author": "restacked_",
          "text": "Yea sounds illegal lol",
          "score": -1,
          "created_utc": "2026-02-23 16:04:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6yx15p",
          "author": "Eastern_Teaching5845",
          "text": "Stripe Atlas already exists. However, doesn’t that kill the opportunity? Like with a proper marketing you can earn decent money",
          "score": 0,
          "created_utc": "2026-02-23 15:56:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6yxuas",
          "author": "vesperumco",
          "text": "So bypassing the proper channels has clear benefits. Got it. But, those channels must be in place for a reason? \n\nIdk. Sounds a little sketch, especially if the US government and banks find out and don’t like what you’re doing…",
          "score": 0,
          "created_utc": "2026-02-23 16:00:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6yxvcr",
          "author": "Michael-Traction",
          "text": "I think your challenge is going to be marketing. How are you going to find the market? ",
          "score": -1,
          "created_utc": "2026-02-23 16:00:28",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rag9rx",
      "title": "Soon to be a freshman in college: how do I start my journey?",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1rag9rx/soon_to_be_a_freshman_in_college_how_do_i_start/",
      "author": "Tan_Kot",
      "created_utc": "2026-02-21 03:19:23",
      "score": 9,
      "num_comments": 16,
      "upvote_ratio": 1.0,
      "text": "I’m soon going to be a freshman in college, and was looking for any ideas as to start my first business. For context, I have great tech interests and also write a lot. I’m practically starting from zero capital too, however - i’d like to keep this business online, and preferably in the self-help or technology communities.",
      "is_original_content": false,
      "link_flair_text": "What business do I start?",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1rag9rx/soon_to_be_a_freshman_in_college_how_do_i_start/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o6l054x",
          "author": "Marre_Parre",
          "text": "Start small and use what you already have. With zero capital and your interests, you could begin a blog or newsletter about tech and self-help topics. It's free, builds your writing skills, and shows initiative. Also get involved with campus entrepreneurship clubs tons of opportunities come from just showing up and meeting people. Good luck\n\n  \n",
          "score": 2,
          "created_utc": "2026-02-21 10:57:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6l1ft6",
              "author": "Tan_Kot",
              "text": "Thank you so much :)",
              "score": 1,
              "created_utc": "2026-02-21 11:10:00",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o6ze2fj",
              "author": "fern_602spark",
              "text": " Starting with a blog sounds like a solid plan! When I was in college, I started a tech blog for free, and it helped me connect with so many people. Joining those campus clubs is key too; you never know who you’ll meet!",
              "score": 1,
              "created_utc": "2026-02-23 17:15:49",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6jjei7",
          "author": "AutoModerator",
          "text": "This subreddit sees a lot of posts by users asking the question 'What business do I start?' and many of them seem to be new to Reddit, so while they think that their post is unique, it almost always is not.\n\nWe welcome your post, and we hope to help you discover a business that is the right fit, but **help us help you** by ensuring that you have provided enough information about yourself, such as:\n\n  - Interests\n  - Available capital\n  - Skills & experience\n  - Business style (B2B, brick & mortar, online, etc.)\n  - Industry/market\n  - Location (state/country), if relevant\n  - Commitment (full-time, part-time, side-gig)\n  - Preferred role (physical work, sales, e-commerce, etc.)\n\nWhile answers to **all of** these are not mandatory, your post will be reviewed by a moderator. If they decide that your post does not contain enough information, it may be removed.\n\n**Community Members**\n\nIf, in your opinion, this post does not contain sufficient information, kindly click this [link](https://www.reddit.com/message/compose/?to=/r/Business_Ideas&subject=Reporting%20Non-compliant%20Post&message=/r/Business_Ideas/comments/1rag9rx/soon_to_be_a_freshman_in_college_how_do_i_start/) to report it, and the moderation team will investigate.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Business_Ideas) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-21 03:19:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ne2r5",
          "author": "Forsaken_Lie_8606",
          "text": "ime so i started my first saas product in college too, and honestly it was a wild ride - i had to learn everything from scratch, from coding to marketing, and it took me about 6 months to get my first 100 paying customers, which was a big milestone for me. what really helped me was focusing on a specific niche, in my case it was project management for small teams, and creating content around that, like blog posts and youtube videos, which helped me build an audience and eventually sell my product to them.",
          "score": 1,
          "created_utc": "2026-02-21 19:22:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6nfiwi",
              "author": "Tan_Kot",
              "text": "that’s great man",
              "score": 1,
              "created_utc": "2026-02-21 19:30:09",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6o4hl1",
          "author": "sjamesparsonsjr",
          "text": "Double down on your education.  What are you studying?  Find a niche and leverage your education studies on that endeavor.   Even if the idea doesn’t pan out you can use it for your resume.",
          "score": 1,
          "created_utc": "2026-02-21 21:41:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6p96qe",
              "author": "Tan_Kot",
              "text": "still figuring that out too, i’ve kept multiple generalist fields and computer science as options",
              "score": 1,
              "created_utc": "2026-02-22 01:43:53",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6pe7l6",
                  "author": "sjamesparsonsjr",
                  "text": "Do you want to make money or impact?",
                  "score": 1,
                  "created_utc": "2026-02-22 02:16:14",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6xrrgm",
          "author": "Successful_Living242",
          "text": "Good instincts - online, low capital, skills you already have. Let's build on reality though.\n\nReality Check\n\nYou haven't started college yet. You don't know your schedule, workload, social dynamics, or how much bandwidth you'll actually have. Most freshmen who plan businesses in August are surviving midterms by October.\n\nDon't build a business yet. \nBuild the foundation for one.\n\nWhat You Actually Have?\n\nWriting ability + tech interest is a legitimate combo. Content, SaaS tools, newsletters, dev tutorials - these are all real markets. You're not starting from zero on skills, just on audience and proof.\n\n\n60-Day Freshman Plan\n\nDays 1-30: Don't start a business. Start a body of work.\n\nPick one specific angle - tech writing, self-improvement for students, software tutorials - and publish 8-10 pieces. Medium, Substack, or LinkedIn. Free. No branding needed yet. You're testing what gets traction and what you can sustain.\n\nDays 31-60: Find one person to help for free.\n\nBuild something, write something, solve something for a real human. This teaches you more about business than any course. It also becomes your first case study.\n\nThe Business Model That Actually Fits You Right Now\n\nA newsletter or content platform at the intersection of tech and self-improvement. Low capital, uses your writing, scalable, and teaches you audience building - the single most valuable skill for any online business.\n\nMistakes to Avoid\n\nDon't incorporate anything yet. Don't buy tools, domains, or courses before you have an audience. \n\nDon't pick a niche based on what's trending pick based on what you can write about consistently for a year without burning out.\n\nWhen you write now, what do you write about? \nThat answer is probably your niche.",
          "score": 1,
          "created_utc": "2026-02-23 11:57:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6xz6i6",
              "author": "Tan_Kot",
              "text": "This is truly phenomenal, thank you so much!",
              "score": 1,
              "created_utc": "2026-02-23 12:52:28",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6kcewm",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 0,
          "created_utc": "2026-02-21 07:05:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6kh9s3",
              "author": "Outrageous_Knee5785",
              "text": "Oh😂",
              "score": 1,
              "created_utc": "2026-02-21 07:51:57",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r7lxrr",
      "title": "Okay so I started something without realizing it",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1r7lxrr/okay_so_i_started_something_without_realizing_it/",
      "author": "Commercial-Week-6558",
      "created_utc": "2026-02-17 23:06:50",
      "score": 8,
      "num_comments": 3,
      "upvote_ratio": 0.91,
      "text": "I’m an eu citizen but I also have a duel citizen from a third world country I know how both market works and how things work basically on all factors . One day my father called me wanting to buy a car from eu and import it to the set country once we did that I realized that there is a huge gap in supply for cars in that region with huge markups that reaches to pretty much 2x in luxury vehicles \n\nObviously started slow and don’t want to export cars from my eu country because once I did the market research I found out that Chinese cars are way cheaper to export and higher in the markup imported two with documentations and everything and ended up making 70% on my money in around three months ( the length of shipping the cars from china) now I’m kind of stuck if and want to know if I should scale up start an import export company what’s the right move here ",
      "is_original_content": false,
      "link_flair_text": "Idea Feedback",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1r7lxrr/okay_so_i_started_something_without_realizing_it/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o604m30",
          "author": "JacobAldridge",
          "text": "I see two options, call it “more risk more money”.\n\n**Option 1: Import Business**\n\nYou buy the cars, move them, sell them on the ground in your home country.\n\nPros:\n\n* Control the process\n\n* People will pay more for a car they can touch, test, and buy today\n\nCons:\n\n* Cash is tied up in the time on boats\n\n* Export and Import licensing\n\n* Car dealership rules in your home country may limit how much you can sell a year\n\n**Option 2: Brokering / Sourcing Business**\n\nInstead of charging the full mark-up, you charge a fee to help people in your home country buy a car directly.\n\nYou can still bundle the money so your margin is hidden.\n\nPros:\n\n* Less capital tied up, so may be able to scale faster\n\n* May be less regulated since you never buy or sell a car yourself\n\nCons:\n\n* Harder to explain, and buyers have to trust you\n\n* May have less margin\n\nEither way, sounds like it’s worth pursuing!",
          "score": 1,
          "created_utc": "2026-02-18 05:20:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6wlva4",
          "author": "TopDeckPatches",
          "text": "Hey, can we chat",
          "score": 1,
          "created_utc": "2026-02-23 05:32:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6wo290",
              "author": "Commercial-Week-6558",
              "text": "Sure",
              "score": 1,
              "created_utc": "2026-02-23 05:49:58",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r6gucr",
      "title": "Does business setup complexity kill your motivation to test ideas?",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1r6gucr/does_business_setup_complexity_kill_your/",
      "author": "funkopopruler",
      "created_utc": "2026-02-16 18:01:34",
      "score": 8,
      "num_comments": 17,
      "upvote_ratio": 1.0,
      "text": "I am validating a few business ideas right now and one thing that keeps holding me back is the setup and ongoing requirements. The idea itself feels simple but the thought of incorporation, taxes, compliance, and all the legal stuff makes me hesitate. It feels like a big mental barrier before even testing the market. I am curious if others feel this friction early on or if I am overthinking it?",
      "is_original_content": false,
      "link_flair_text": "App/Website Idea",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1r6gucr/does_business_setup_complexity_kill_your/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o5q21ip",
          "author": "ogold45",
          "text": "Overthinking. Test first then if it’s working set everything up.",
          "score": 1,
          "created_utc": "2026-02-16 18:09:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5qmp2c",
              "author": "funkopopruler",
              "text": "Noted!",
              "score": 1,
              "created_utc": "2026-02-16 19:45:50",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5q5a91",
          "author": "BizUpUSA",
          "text": "You’re definitely not overthinking it, that mental barrier is real for a lot of people. The admin side can feel heavier than the actual idea sometimes.\n\nWhat helped most of the business was separating “testing” from “formalizing.” You don’t need to incorporate to validate demand — you can test interest, talk to users, even get first customers before worrying about structure.\n\nOnce there’s real signal, the paperwork feels way less intimidating because you know it’s worth it.",
          "score": 1,
          "created_utc": "2026-02-16 18:24:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5qmnrm",
              "author": "funkopopruler",
              "text": "Very helpful!",
              "score": 1,
              "created_utc": "2026-02-16 19:45:40",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5q81wz",
          "author": "Bisqwa",
          "text": "Test first, incorporate later. But when you're ready to formalize, nowadays there are services that handles the whole mess (LLC, EIN, banking), so i wouldn't worry about that just yet ",
          "score": 1,
          "created_utc": "2026-02-16 18:36:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5qmkgx",
              "author": "funkopopruler",
              "text": "Cool, thanks!",
              "score": 1,
              "created_utc": "2026-02-16 19:45:13",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5qkqnt",
          "author": "zenbusinesscommunity",
          "text": "You don't need to incorporate right away, so it's worth testing with a few early customers first and formalizing once there's traction. That said, if you're taking payments or have liability exposure, setting up an LLC is straightforward and gives you protection. The tax and compliance pieces usually aren't as bad as they seem once you're actually dealing with them, but don't hesitate to loop in a CPA or a service to help handle those tasks for you to keep it off your plate.",
          "score": 1,
          "created_utc": "2026-02-16 19:36:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6qsgte",
              "author": "r0xanne_marlow",
              "text": " Totally feel you on that mental barrier! It's wild how the legal stuff can loom over you. But yeah, testing with a few early customers can ease that pressure; sometimes you just gotta dive in and see what sticks.",
              "score": 2,
              "created_utc": "2026-02-22 08:58:47",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o5qmfzc",
              "author": "funkopopruler",
              "text": "Noted!",
              "score": 1,
              "created_utc": "2026-02-16 19:44:37",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5t4l7r",
          "author": "indexintuition",
          "text": "yes, that mental barrier is very real. i used to stall out before even testing an idea because my brain would jump straight to incorporation, bookkeeping, taxes, all of it, and it made something small feel huge. what helped me was separating testing from building a full business. i started validating ideas in the simplest way possible first, sometimes just a basic landing page or a small paid beta, before worrying about formal structures. once there is actual traction, the admin stuff feels more worth the effort. you are not overthinking, but you might be trying to solve step ten before step one.",
          "score": 1,
          "created_utc": "2026-02-17 04:02:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6895g1",
              "author": "funkopopruler",
              "text": "Relatable",
              "score": 1,
              "created_utc": "2026-02-19 12:11:57",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5vam2c",
          "author": "chadvavra",
          "text": "It did, but once I did it for the first time I realized it's not that hard and there are a ton of almost free tools to support you.  In fact, Claude is pretty good at creating/filling out documents.  I wouldn't trust it to do my taxes, but it was pretty great at a provisional patent filing.",
          "score": 1,
          "created_utc": "2026-02-17 14:16:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6896x0",
              "author": "funkopopruler",
              "text": "Wow, interesting",
              "score": 1,
              "created_utc": "2026-02-19 12:12:14",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5ycjjg",
          "author": "dont_mess_with_tx",
          "text": "That's why I consider myself a libertarian. We can't punish small businesses with all this burden.",
          "score": 1,
          "created_utc": "2026-02-17 23:10:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o65ttrn",
          "author": "springcaterpillar",
          "text": "start with the simplest possible version, even just a landing page and some paid ads to see if people click. you don't need an LLC, an accountant, or compliance figured out until you've confirmed someone will actually pay for the thing. most of the admin stuff takes a few days once you actually need it.",
          "score": 1,
          "created_utc": "2026-02-19 01:06:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o691ck8",
          "author": "techside_notes",
          "text": "Absolutely. I’ve felt the same friction when the setup feels bigger than the idea itself. For me, the mental load of worrying about compliance or tools often blocked the actual testing.\n\nWhat helped was separating the idea from the formalities, sketch it, validate it with a tiny experiment, even manually if needed, before touching any legal or tech setup. That way, you know whether it’s worth investing energy into the formal side at all.",
          "score": 1,
          "created_utc": "2026-02-19 14:59:08",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r9zoc9",
      "title": "Buying a car through my LLC with no money down - for business",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1r9zoc9/buying_a_car_through_my_llc_with_no_money_down/",
      "author": "DisturbGamer45",
      "created_utc": "2026-02-20 16:16:53",
      "score": 7,
      "num_comments": 14,
      "upvote_ratio": 1.0,
      "text": "I’m trying to understand whether it’s actually possible to purchase or finance a vehicle for my business using my LLC and its EIN instead of my personal SSN. I’ve heard a few people claim they’ve done this without putting any money down, but it sounds a little too good to be true.\n\nA coworker was telling me he managed to get a brand new work van strictly through his LLC with no personal credit involved, which made me curious how realistic that actually is. Has anyone here successfully bought or financed a vehicle this way?\n\nTrying to separate fact from hype before I waste time chasing something that isn’t possible.\n\nI need to get a truck for my landscaping business and wanted to see if there was a way I could get the truck on my LLC's credit profile. My LLC is 5 years old and is in good standing, I submit the annual report every year.",
      "is_original_content": false,
      "link_flair_text": "Marketing / Operational / Financial / Regularotry Advice sought",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1r9zoc9/buying_a_car_through_my_llc_with_no_money_down/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o6nlhte",
          "author": "mtbcouple",
          "text": "It doesn’t really work like that. \n\nThe business needs credit history, and insurance often ends up being like 4x more expensive. \n\nBuy it personally and deduct certain expenses, or check with an accountant about how to deduct the full cost, depending on how you use it.",
          "score": 2,
          "created_utc": "2026-02-21 20:01:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6qik45",
          "author": "Aldoperu",
          "text": "Unless your business has solid revenue and history, a lender won't consider it a reliable borrower. The EIN alone doesn't mean much without credit. You will probably have to back the loan yourself instead of getting the car through LLC.",
          "score": 2,
          "created_utc": "2026-02-22 07:24:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6rrunc",
              "author": "beth_weird75",
              "text": "Exactly. And a vehicle in an LLC's name needs commercial auto insurance. This is 2 or 3 times more expensive than a personal insurance policy.",
              "score": 2,
              "created_utc": "2026-02-22 13:54:16",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o6shxhs",
              "author": "brian135792",
              "text": "Yeah, they will need Tier 2 or Tier 3 business credit for this to work.",
              "score": 1,
              "created_utc": "2026-02-22 16:06:10",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6gl2mz",
          "author": "zenbusinesscommunity",
          "text": "It’s possible, but yeah the “EIN only, no personal guarantee, no money down” version gets oversold a lot. In most cases, especially for small owner‑run businesses, the lender still wants a personal guarantee even if the truck is bought under the LLC. The vehicle can be in the business name, but your credit may still be part of the deal. If your LLC is 5 years old and has solid revenue and some business credit built up, you’ve got a better shot. Just don’t be surprised if they still tie it back to you personally.",
          "score": 1,
          "created_utc": "2026-02-20 17:51:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6lrgpm",
              "author": "DAM3825",
              "text": "⬆️",
              "score": 1,
              "created_utc": "2026-02-21 14:23:52",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6k5s4s",
          "author": "larshalle",
          "text": "But why? You'll pay way more for insurance. Made that mistake ",
          "score": 1,
          "created_utc": "2026-02-21 06:06:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6qiqu4",
              "author": "Aldoperu",
              "text": "How much more did you end up paying for the insurance, as compared to if you bought it in your name?",
              "score": 1,
              "created_utc": "2026-02-22 07:26:16",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6ncdd2",
          "author": "demanbmore",
          "text": "For a purchase, sure.  For financing, maybe, but the LLC better have credit history and meet lots of other requirements for a lender to extend credit without needing a personal guarantee.  Stop into the institution where your LLC does its banking and ask them what their requirements are for this sort of thing.",
          "score": 1,
          "created_utc": "2026-02-21 19:14:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6ue4cd",
              "author": "bordered_twist",
              "text": " That's solid advice! I remember when I thought I could finance my first work vehicle through my LLC. Turns out the lender wanted to see a few years of good credit history first. Definitely check in with your bank; they might have some helpful insights!",
              "score": 1,
              "created_utc": "2026-02-22 21:30:12",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6rr7mi",
          "author": "beth_weird75",
          "text": "Even if you have a 5 year old LLC, most traditional lenders will still require a Personal Guarantee. This means your SSN is still on the hook if the business fails to pay, even if the debt only shows up on your business credit report.",
          "score": 1,
          "created_utc": "2026-02-22 13:50:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6rs2qc",
          "author": "TheBlazingKFC",
          "text": "To bypass your SSN entirely, you will need a commercial fleet line of credit. These are usually reserved for businesses with high annual revenue and established Paydex scores (Dun & Bradstreet).",
          "score": 1,
          "created_utc": "2026-02-22 13:55:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6shmmp",
          "author": "brian135792",
          "text": "To get a vehicle with just an EIN, you usually need Tier 2 or 3 business credit. This involves having seasoned tradelines like Net-30 accounts with suppliers already reporting. If you are filing an LLC just to get a car through it, it likely isn't going to work. ",
          "score": 1,
          "created_utc": "2026-02-22 16:04:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6wjvdv",
          "author": "RightAwayInsurance",
          "text": "If you have a Duns number, Trade lines like a business credit card, or business installment loans you can qualify for a loan without personally guarantee from certain lenders Ally Financial is one that I've used without having to personally guarantee the losn  Chase auto may also give you a loan if you have a relationship with them such as business checking account, business credit card etc.  I hope this helps. ",
          "score": 1,
          "created_utc": "2026-02-23 05:16:23",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r7qvm4",
      "title": "A way to quantify Hazards, toxins, bad habits, pollution, and carcinogens",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1r7qvm4/a_way_to_quantify_hazards_toxins_bad_habits/",
      "author": "HalfwaydonewithEarth",
      "created_utc": "2026-02-18 02:36:31",
      "score": 6,
      "num_comments": 7,
      "upvote_ratio": 0.87,
      "text": "I am not doing this but thought it would be interesting to have a gradation on disappointing things so I can make a choice. \n\nThe business owner could make money by making entities test and certify the way food nutrition works. \n\nSo I want to know what is worse at several points during the day:\n\nThe carcinogen from bacon or the nonstick pan it is cooked in?\n\nThe artificial sweetener from a Coke Zero or the microplastic from the bottle?\n\nWould beer causing gout and diabetes be worse or sunbathing in uv rays with no sunscreen?\n\nWhat is my damage score if I jog in polluted air, or  drink flourinated tap water?\n\nAre WiFi emf radio signals when I am sleeping near my cell phone worse or the Glyphosate gluten crossiant made with butter from a cow that was injected?\n\nA massive study was done that hot coffee was terrible for the heat on the esophagus daily and wears down the silica. I want to know each temperature.\n\nIs short sleep worse or Red Bull worse? Now studies are coming out energy drinks destroy kidneys. \n\nFried food is suppose to be hexane heavy a neurotoxin... \n\nWhat is worse French Fries or blue light destroying our eyes on cell phones?\n\nSo if there was some type of gradation that would be awesome.\n\n",
      "is_original_content": false,
      "link_flair_text": "A How-To Guide that no one asked for",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1r7qvm4/a_way_to_quantify_hazards_toxins_bad_habits/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o5zo390",
          "author": "TangerineSeparate431",
          "text": "So this business would be like an insurance company or an analytical testing facility? \n\n\nAll of the things mentioned above have been studied to various amounts and a cursory AI web search could give you these answers. I don't know how this would be profitable or marketable. ",
          "score": 1,
          "created_utc": "2026-02-18 03:30:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5zsitl",
              "author": "HalfwaydonewithEarth",
              "text": "I want to know the intensity of the damage. What if some of this is negligible?\n\nWhat if some of it is massively toxic.\n\nIt could be like a database score like calorie counting.\n\nThey use to have smog days telling us when it is unsafe to run outside.",
              "score": 1,
              "created_utc": "2026-02-18 03:57:48",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o60fqld",
                  "author": "robots-in-disguise",
                  "text": "What you're describing is essentially a risk mitigation ai that can give you real time feedback about the risks of what you're doing.",
                  "score": 2,
                  "created_utc": "2026-02-18 06:50:51",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o61lok5",
          "author": "ChestChance6126",
          "text": "The big issue is you’re mixing very different risk types into one bucket. Chronic, high dose exposures like air pollution, heavy drinking, smoking, and UV have strong outcome data. A lot of the other stuff people worry about is either low dose, poorly quantified, or highly context dependent. If you built anything, it would need to normalize to something concrete, like adding lifetime risk per 100k people, with clear assumptions. Otherwise, the “score” would feel scientific but be mostly vibes.",
          "score": 1,
          "created_utc": "2026-02-18 12:47:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o65tp4k",
          "author": "springcaterpillar",
          "text": "individual genetics, and combination effects all matter. comparing bacon carcinogens to nonstick pan fumes is like comparing a paper cut to a sunburn, they're both \"damage\" but the mechanisms and severity aren't on the same axis. an app like this would need to be extremely careful about oversimplifying or people would make worse decisions thinking they're optimizing.",
          "score": 1,
          "created_utc": "2026-02-19 01:05:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o66bilg",
              "author": "HalfwaydonewithEarth",
              "text": "Ok so its a bad idea?\n\nI thought maybe everything could be on a Range from 1-100",
              "score": 1,
              "created_utc": "2026-02-19 02:49:42",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6ob1go",
          "author": "YtterbiusAntimony",
          "text": "Wifi is radio waves, it carries basically no energy. It does not interact with biology at all.\n\n\nYou're describing what the FDA, USDA, & EPA do. Or at least were supposed to be able to do if they weren't constantly being gutted by corporate goons.\n\n\nAll of these things have been studied. People don't listen.",
          "score": 1,
          "created_utc": "2026-02-21 22:16:58",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rcblur",
      "title": "THoughts on a table business/Furniture?",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1rcblur/thoughts_on_a_table_businessfurniture/",
      "author": "Outrageous_Fox5142",
      "created_utc": "2026-02-23 08:04:23",
      "score": 6,
      "num_comments": 6,
      "upvote_ratio": 1.0,
      "text": "https://preview.redd.it/kj33nt4sc7lg1.png?width=1024&format=png&auto=webp&s=4f246ca7c8debb256d137a1149f8273f0c3b58b4\n\nThis is no genius out of the box idea but i was thinking of starting a furniture business but that is already been done by tons of people. I live in india and 80% of the furniture market is unorganized with no brands still. I was thinking of making a business that only has tables. Y'all seen those trendy side tables which look likes dice. I was thinking of starting something as such.\n\nA good collection of Side tables- Designed with modern themes(like those chess board tables), inbuilt charging sockets, equipped with lamps and whatnot.\n\nA lot could be done with these honestly. And I think it can be sold if marketing and branding is done well. Main problem is with margins. I am not sure what margins I can save for cashflow. Knowing that logistics would eat a lot of it so I need to know if it's a profitable and scalable business.  \nCan anyone give me an idea about what Net margins i can expect. And what are the problems with furniture business?",
      "is_original_content": false,
      "link_flair_text": "Idea Feedback",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1rcblur/thoughts_on_a_table_businessfurniture/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o6xo976",
          "author": "heretohelp999",
          "text": "I’m doing something similar but the challenge for you is actually curating a portfolio and then finding the channel. Across product, channel and consumer - how will you be different?",
          "score": 3,
          "created_utc": "2026-02-23 11:28:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6y14uf",
              "author": "Outrageous_Fox5142",
              "text": "Finding channels and consumers is not the bigger task. It's the logistics that'll bleed. Differentiating in product would require you to build a foolproof product. Let's take it to dms\n\n",
              "score": 2,
              "created_utc": "2026-02-23 13:05:17",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6y273a",
                  "author": "heretohelp999",
                  "text": "Assuming logistics work. Why would I buy? Why would it be this brand that I buy? U need to think about it. U don’t need a foolproof product, u need to solve a problem.",
                  "score": 3,
                  "created_utc": "2026-02-23 13:11:58",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6x59re",
          "author": "moonletdesignstuff",
          "text": "Maybe this will help, but I don't know to name any table specific furniture brand. All of them are general ones. \nYes, I've seen people who do handmade tables, but that feels different. Not like a brand which deals with only tables of all kinds.",
          "score": 2,
          "created_utc": "2026-02-23 08:26:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6xjpew",
              "author": "Outrageous_Fox5142",
              "text": "Do you think It'll be solid because I myself not know of a table specific brand when it is such a big market and everyone needs a bed side table ",
              "score": 1,
              "created_utc": "2026-02-23 10:47:18",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6xkdyb",
                  "author": "moonletdesignstuff",
                  "text": "If you work on it, sure, why not. Everyone needs all kinds of tables - dinning, kitchen, bedside, coffee tables. I'd focus on 'tables', one furniture category. But not restrict it to bedside ones. So you can differentiate from the market, but also be inclusive of multiple client needs.",
                  "score": 1,
                  "created_utc": "2026-02-23 10:53:36",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1r7b85w",
      "title": "Feedback please",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1r7b85w/feedback_please/",
      "author": "aclgetmoney",
      "created_utc": "2026-02-17 16:43:10",
      "score": 5,
      "num_comments": 13,
      "upvote_ratio": 0.86,
      "text": "I’ve posted about this in the past and would like some feedback on the idea. \n\nI’d like to build something in the senior space and I began with the idea of aging in place home modifications. Until I realized I’m not a blue collar type of guy lol. \n\nNow I’m debating on building something online that may support this space. \n\nI guess I’m either looking for someone who has explored this or is planning on it. Just some feedback on if this is a good path to explore or not. \n\nThe silver tsunami is here and there’s plenty of\n\nOpportunity. Especially for those who care enough to see seniors get taken care of the RIGHT way. \n\nRight now the industry is fragmented and it feels like a meat market unfortunately. \n\nI appreciate the time! ",
      "is_original_content": false,
      "link_flair_text": "Idea Feedback",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1r7b85w/feedback_please/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o5w7q85",
          "author": "f1zombie",
          "text": "I did a lot of thinking in the space. Unfortunately, most of the opportunity lies in infrastructure, processes and people. \n\nThat being said, I wonder if there's something that helps keep seniors busy and with a sense of purpose. Maybe mentoring, friend networks, etc.?",
          "score": 2,
          "created_utc": "2026-02-17 17:03:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5wi2vk",
              "author": "aclgetmoney",
              "text": "Shoot me a DM",
              "score": 1,
              "created_utc": "2026-02-17 17:53:41",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o6eppko",
              "author": "simpson_5haze",
              "text": " Totalmente de acuerdo, mantener a los abuelos ocupados y con propósito es clave. He leído que las actividades como mentorías pueden ser muy enriquecedoras. Tal vez podrías explorar algo en línea que conecte a las personas mayores con jóvenes para compartir experiencias, sería un win-win, ¿no?",
              "score": 1,
              "created_utc": "2026-02-20 12:04:14",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6x2lp3",
                  "author": "f1zombie",
                  "text": "Absolutely! There are some interesting use cases!",
                  "score": 1,
                  "created_utc": "2026-02-23 08:00:19",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5wpody",
          "author": "Khushboo1324",
          "text": "I actually like this idea ,senior care is one of those areas where families feel stressed and unsure who to trust. If I were you, I’d start super focused. Solve one specific headache really well instead of trying to cover the whole space from day one. If you can make one part of the process feel simpler or safer for families, that alone could be valuable.",
          "score": 2,
          "created_utc": "2026-02-17 18:28:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5wwd85",
              "author": "aclgetmoney",
              "text": "Thank you. I appreciate the advice.",
              "score": 2,
              "created_utc": "2026-02-17 18:59:00",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5x1piz",
          "author": "UpsetMarsupial",
          "text": "What country or region are you looking at ?",
          "score": 2,
          "created_utc": "2026-02-17 19:24:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5xaiqm",
              "author": "aclgetmoney",
              "text": "I’m in the US",
              "score": 1,
              "created_utc": "2026-02-17 20:05:33",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o6iod41",
              "author": "midnight_snack_ctrl",
              "text": " That's a great question! I'm looking primarily at the U.S. market since the aging population is massive here. I think there’s a lot of potential to create meaningful online resources tailored for seniors, especially considering how fragmented the industry is. What about you?",
              "score": 1,
              "created_utc": "2026-02-21 00:07:49",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5yd232",
          "author": "Spirited_Radio9804",
          "text": "Sell it before 2036 demographics tell the story!",
          "score": 2,
          "created_utc": "2026-02-17 23:13:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5ymcxw",
              "author": "aclgetmoney",
              "text": "Why’s that?",
              "score": 1,
              "created_utc": "2026-02-18 00:04:55",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5ym7mn",
          "author": "sum-9",
          "text": "You haven’t actually put forward an idea?",
          "score": 2,
          "created_utc": "2026-02-18 00:04:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5ymk9b",
              "author": "aclgetmoney",
              "text": "Idea isn’t quite clear I guess. Just more looking for thoughts of the space and if anyone has built something in the industry.",
              "score": 1,
              "created_utc": "2026-02-18 00:06:03",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r94ty6",
      "title": "How can I monetize my sub forum?",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1r94ty6/how_can_i_monetize_my_sub_forum/",
      "author": "NickyB808",
      "created_utc": "2026-02-19 17:06:53",
      "score": 4,
      "num_comments": 1,
      "upvote_ratio": 1.0,
      "text": "I currently have an Ai and business based sub forum called aisolobusinesses on Reddit. I have built myself up to 5k followers and 8.8k visitors per week. I feel like I’m starting to make some good traction, but my biggest question coming up is going to be how to monetize. I have thought about doing affiliate marketing with Ai tools and writing my own ebook, but what do you think I should do to start monetizing? ",
      "is_original_content": false,
      "link_flair_text": "Idea Feedback",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1r94ty6/how_can_i_monetize_my_sub_forum/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o6akmk7",
          "author": "Drumroll-PH",
          "text": "5k followers is real traction. I’d start simple. Test affiliate links for tools you actually use, then validate demand by asking your audience what they struggle with before writing an ebook.\n\n",
          "score": 3,
          "created_utc": "2026-02-19 19:24:55",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r89rkw",
      "title": "I want to network",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1r89rkw/i_want_to_network/",
      "author": "Disastrous-Jump2058",
      "created_utc": "2026-02-18 17:43:14",
      "score": 3,
      "num_comments": 12,
      "upvote_ratio": 0.81,
      "text": "I am looking to connect with people who are interested in tech, especially in building SaaS products.\n\nI’m a self-taught full-stack developer with several years of industry experience.\n\nRight now, I’m focused on creating small, fast-to-build micro-SaaS projects that generate consistent MRR, allowing me to dedicate more time to bigger ideas.\n\nI’m strong on the technical side, but marketing and getting investments are not my strengths, so I’m looking for people who excel in any of those areas.\n\nAlso if you are also someone who can bring funds, investments and clients, users that would be interesting.\n\nIdeally, I’d like to form a small team and build and launch SaaS nee projects together.\n\nI’m not selling anything and just hoping to connect with like-minded people who want to build together.\n\nIf this sounds interesting, feel free to reach out with comments or dm.\n\nI am ok with equity split or smaller equity with a minimal payment.\n\nBy the way, I also manage and participate a business group with about 26 members.\n\nFeel free to dm if anyone interested in joining the group. By the way, we might turn it to a business association as well in the future. If you can help with that, feel free to dm.\n\nPlease don't comment dm you because sometimes notifications don't arrive or can't read because of this app not working well for whatever reason.\n\nI also have my own company set up and have a few projects working.\n\nIf you have anything interesting you can offer, feel free to dm to network.",
      "is_original_content": false,
      "link_flair_text": "Business Partner Sought - Business has NOT been established",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1r89rkw/i_want_to_network/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o667zxu",
          "author": "VetPrepHelp",
          "text": "Solo non technical founder to VetPrep(dot)Help, a platform focused on veterans education, preparedness and organization of records before either filling on their own or meeting with professionals or the VA themselves for the VA Benefits.. Always open to networking and sharing ideas open with others",
          "score": 1,
          "created_utc": "2026-02-19 02:29:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o66r4s3",
              "author": "Disastrous-Jump2058",
              "text": "SUre les connect ",
              "score": 1,
              "created_utc": "2026-02-19 04:27:21",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o66s84k",
                  "author": "VetPrepHelp",
                  "text": "Looking forward to building and growing! Just messaged you back.",
                  "score": 1,
                  "created_utc": "2026-02-19 04:34:48",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6cqfj5",
          "author": "Traditional-Yam6118",
          "text": "Let’s connect. I have overall 10+ years of experience on these areas",
          "score": 1,
          "created_utc": "2026-02-20 02:26:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6epjig",
              "author": "Disastrous-Jump2058",
              "text": "cool lets connect",
              "score": 1,
              "created_utc": "2026-02-20 12:03:00",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6mhtvq",
          "author": "Severe_Life_6959",
          "text": "hello kindly reach out \n\nhttps://www.linkedin.com/in/zeinkhamis",
          "score": 1,
          "created_utc": "2026-02-21 16:42:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6mz3wx",
              "author": "Disastrous-Jump2058",
              "text": "ok",
              "score": 1,
              "created_utc": "2026-02-21 18:09:14",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o6yuzpp",
              "author": "Disastrous-Jump2058",
              "text": "Sent yo a request\n\n",
              "score": 1,
              "created_utc": "2026-02-23 15:47:04",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6x1fdo",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-23 07:49:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6x20pd",
              "author": "Disastrous-Jump2058",
              "text": "I am building [busin.us](http://busin.us/)\n\nbusiness control room \n\nto support its development\n\nI am making microsaas \n\nfeel free to join [r/businus](https://www.reddit.com/r/businus)\n\nwhatsapp : [https://chat.whatsapp.com/HsdOzfQchGP9W430S7e0yM](https://chat.whatsapp.com/HsdOzfQchGP9W430S7e0yM)\n\n",
              "score": 1,
              "created_utc": "2026-02-23 07:54:54",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r9xzte",
      "title": "Starting an LLC in Georgia state - what do I need to know?",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1r9xzte/starting_an_llc_in_georgia_state_what_do_i_need/",
      "author": "dtsummery",
      "created_utc": "2026-02-20 15:14:59",
      "score": 3,
      "num_comments": 14,
      "upvote_ratio": 0.6,
      "text": "Hi all,\n\nMy wife and I are thinking about launching a mobile food cart (a dream we’ve had for a while), but we’re total newbies to the business side of things. We’ve heard that an LLC is a good idea for protection, but we have zero clue how to actually get one set up in Georgia.\n\nIs the paperwork something two people can manage on their own, or is it worth paying someone to do it for us? Also, any Georgia specific quirks or fees we should know about before diving in?\n\nWould love to hear from anyone who’s started an LLC here recently, especially if you were as clueless as we are. Appreciate any advice.\n\nThrough initial research, we originally started with Inc Authority but we got a called yesterday telling us we needed to pay an additional $292 dollars on top of that $182 we’d already paid for documents they claim are required. I can’t find any reference to these documents and the reps tone change when I told him we wouldn’t be paying this extra fee. These forms they claim I didn’t submit but there’s nothing in our portal and no forms were required.\n\nI’ve seen Zenbusiness recommended but after filling out the information I see they are charging us $225 for the GA state fee, the GA state fee is only $105, which they also state on their website.\n\nWe’ve already had a bad experience with registered agents and we’re not keen to jump into another situation.",
      "is_original_content": false,
      "link_flair_text": "No applicable flair exists for my post",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1r9xzte/starting_an_llc_in_georgia_state_what_do_i_need/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o6km6w3",
          "author": "ChestChance6126",
          "text": "you can file a georgia LLC yourselves directly through the secretary of state site, it’s around $100 online plus a $50 annual registration.\n\nyou don’t need to pay extra for “required documents.” most of those upsells are optional add-ons.\n\nfor a food cart, the real complexity is local permits, health department approval, and city licensing, not the LLC  itself. focus your energy there.",
          "score": 2,
          "created_utc": "2026-02-21 08:40:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6qkatc",
              "author": "Aldoperu",
              "text": "One of the optional add-ons might be the operating agreement document.\n\nYes, it's not mandated by the state of Georgia, but since it's a husband-wife LLC, wouldn't it be risky to skip it?",
              "score": 1,
              "created_utc": "2026-02-22 07:41:03",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6ig6io",
          "author": "TheOsprey95",
          "text": "Formation wasn't hard for my business last year, the Georgia state site basically walks you through it all. Biggest thing is if you want to have yourself as the registered agent or pay for someone to be one for you. Only difference is really if you get served for some reason it would go to the registered agent instead of you which can be nice for privacy but I'd research agents if you go that route as some are notoriously bad and do not let you know if you have been served. The cost isn't expensive to do this yourself you will get tons of soliciting for filling a new business telling you need this and that and they are required by law to tell you if it's a solicitation. For food I'm not to sure I am a saas service so there might be some difference but probably not to big. I'd recommend finding some food trucks and talking to them as they will probably have the best info for you. Another thing to note is you have to file a BOI with FinCEN it is free but required by the government, basically just says who owns the business to prevent money laundering this was newly required last year and comes and goes when they require it vs not needing it.",
          "score": 1,
          "created_utc": "2026-02-20 23:20:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6sim3i",
              "author": "brian135792",
              "text": "What registered agent are you using in Georgia?",
              "score": 1,
              "created_utc": "2026-02-22 16:09:05",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6sk19r",
                  "author": "TheOsprey95",
                  "text": "I'm not using one, I just used myself",
                  "score": 1,
                  "created_utc": "2026-02-22 16:15:14",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6omf7o",
          "author": "monkey6",
          "text": "_GO_ https://sos.ga.gov/how-to-guide/how-guide-register-domestic-entity",
          "score": 1,
          "created_utc": "2026-02-21 23:22:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6osb3x",
          "author": "wordsnkisses",
          "text": "It's not hard to start an LLC in Georgia. Here's a quick guide to help you get started:\n\n1. Choose a name for your LLC. It must be unique and have the words \"\"LLC\"\" or \"\"Limited Liability Company\"\" in it.\n\n2. Registered Agent: Your LLC will need a registered agent to sign for legal papers. A person or a business can be a registered agent.\n\n3. File Articles of Organization: This is the most important paper you need to start your LLC. You will send it to the Georgia Secretary of State, and the fee to file it is $100. This can be done online.\n\n4.An operating agreement is not mandatory in Georgia; however, it is advisable to have one in order to delineate the operations of your LLC and prevent potential issues.\n\n5. Obtain an Employer Identification Number (EIN) An Employer Identification Number (EIN) from the IRS is required in order to employ personnel or establish a separate business bank account. This can be accomplished for free via the internet.\n\n6. Sign up for state taxes: If your business sells goods or services, you need to sign up for sales tax with the Georgia Department of Revenue.\n\n7. Annual Registration: You have to pay $50 each year to file your annual registration. It's due on the same day as the anniversary of your LLC's formation.\n\nNeed Help?\nYou can do all of this on your own, but if you'd rather not have to deal with any surprises or extra fees, you might want to think about using a service like BusinessAnywhere. I have personally employed them and was impressed by the simplicity and clarity of their process.They helped me with everything and made sure there were no surprise charges. If you're not sure you can handle all the paperwork on your own, this is definitely something to think about. I hope everything goes well with your mobile food cart! It sounds like a fun and interesting project.",
          "score": 1,
          "created_utc": "2026-02-21 23:58:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6qk323",
              "author": "Aldoperu",
              "text": "In Georgia, the Annual Registration isn't actually due on your anniversary date. The SoS website says you have a specific window between 1st January and 1st April every year. Regardless of when you formed the LLC. \n\nIf you miss the April deadline, you are hit with a $25 penalty. It's not huge but if your anniversary date is in August, you'll already be in the red.",
              "score": 1,
              "created_utc": "2026-02-22 07:39:01",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6qjknf",
          "author": "Aldoperu",
          "text": "Congratulations on fulfilling your dream!!! \n\nWishing you both good luck and success.\n\nI would definitely advice you to set up an LLC in Georgia for liability purposes. You just never know... especially in the food industry.\n\nYou can definitely file everything yourself on the Georgia Secretary of State website. Filing yourself is pretty easy, if you list yourself as registered agent, your address will be listed publicly. \n\nSince it's a mobile food cart, I'm assuming you'd list your home address. If you decided to do this, please look into what you're agreeing to by being your own registered agent in Georgia. I personally think that hiring a registered agent service for your Georgia LLC is better as it will keep your address of public records and also give you peace of mind. ",
          "score": 1,
          "created_utc": "2026-02-22 07:34:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6rt5e5",
              "author": "beth_weird75",
              "text": "Do you mean hiring a registered agent service to do the LLC filing or just act as the registered agent in Georgia?",
              "score": 1,
              "created_utc": "2026-02-22 14:01:41",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6rsp6i",
          "author": "beth_weird75",
          "text": "Stop paying those services immediately. You are being upsold on things Georgia doesn't require. go directly to the Georgia Secretary of State website, eCorp.   \n  \nIt's $100 to file your LLC online in Georgia and it takes only 10 minutes. You're being charged a 100% markup for someone to just type your name into a web form. ",
          "score": 1,
          "created_utc": "2026-02-22 13:59:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6rtm68",
          "author": "TheBlazingKFC",
          "text": "In GA, you have to renew your LLC every year between Jan 1st and April 1st. It costs $50. If you miss it, they dissolve your business pretty quickly. \n\nSo just put a calendar alert in your phone when you file.",
          "score": 1,
          "created_utc": "2026-02-22 14:04:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6sied0",
          "author": "brian135792",
          "text": "The real cost of forming an LLC in Georgia is $100 + $10.   \n  \nThe state filing fee for a domestic LLC is $100. If you file online, there is a $10 service charge.\n\nAnything more than that is a service fee for a company you don't need.",
          "score": 1,
          "created_utc": "2026-02-22 16:08:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6gu5fz",
          "author": "zenbusinesscommunity",
          "text": "Yeah if you’re seeing $225 with us, that usually means a package upgrade or add‑ons were selected somewhere in the flow. Because you're right, Georgia's filing fee is $100 plus that processing fee.\n\nThat said, you definitely don’t have to use a service at all if you're comfortable tackling the formation yourself, which a lot of folks are. You can submit directly through the Georgia Secretary of State, apply for an EIN for free on the IRS website, and you can even act as your own registered agent as long as you have a Georgia address and are available during business hours. It really just comes down to whether you’d rather DIY it or have someone handle the paperwork.",
          "score": 0,
          "created_utc": "2026-02-20 18:31:52",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r75g95",
      "title": "Mixing match-3 with falling obstacles. Does this mechanic make sense?",
      "subreddit": "Business_Ideas",
      "url": "https://i.redd.it/0fbd7qr8y0kg1.png",
      "author": "Recent_Jellyfish2190",
      "created_utc": "2026-02-17 13:03:56",
      "score": 3,
      "num_comments": 3,
      "upvote_ratio": 1.0,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "App/Website Idea",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1r75g95/mixing_match3_with_falling_obstacles_does_this/",
      "domain": "i.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "o5wq7ms",
          "author": "Khushboo1324",
          "text": "This actually looks pretty fun. I like the survival with the combo angle , the falling obstacles add pressure, which could make matches feel more meaningful instead of just casual swiping. Only thing I’d watch is cognitive overload. If too much is happening at once, it might feel stressful instead of satisfying. But as a twist on classic match-3, it definitely stands out. I’d try it.",
          "score": 1,
          "created_utc": "2026-02-17 18:30:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5wy9yk",
              "author": "Recent_Jellyfish2190",
              "text": "That’s a really important point, thanks for calling that out.\nI definitely don’t want it to become cognitively overwhelming. My idea is to introduce the survival/falling mechanic in short phases, maybe every 10–15 moves, rather than making it the dominant mechanic the whole time.\nRight now I’m mainly testing whether this survival twist works as a strong hook to grab attention, not necessarily as the core loop of the entire game.\nReally appreciate the feedback.",
              "score": 2,
              "created_utc": "2026-02-17 19:07:58",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5x05rx",
                  "author": "Khushboo1324",
                  "text": "That sounds like a smart way to test it.   \nIntroducing it in phases makes it feel like a spike of intensity instead of constant pressure ,which could actually make it more exciting. If you’re testing it as a hook, it might also be interesting to see how new players react in the first 2–3 minutes. If they “get it” quickly and feel clever instead of confused, you’re probably on the right track.\n\nExcited to see how it evolves.",
                  "score": 1,
                  "created_utc": "2026-02-17 19:16:54",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1r70aes",
      "title": "Starting up on my own",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1r70aes/starting_up_on_my_own/",
      "author": "Level-Pea-2172",
      "created_utc": "2026-02-17 08:08:57",
      "score": 3,
      "num_comments": 7,
      "upvote_ratio": 1.0,
      "text": "I need some advice and see if what others opinions are on this. For context I am based in UK. \n\nI have worked in a type of construction/maintenance industry for a while, which supplies B2B customers mainly. I know the products and suppliers really well but not the installation process which I am learning now in my current role. I am on 60k salary and company car + some other perks, but I cant shift the idea of starting on my own and sub contracting the work at first with eventually getting my staff/van to carry out the work whilst i focus on pricing/selling. \n\nI have had couple of side hustles in the past so I can build the website, marketing, sales, crm etc. My contract doesn’t mention anything about conflict of interest etc. but of course I will have to keep it on the quiet right until I start.\n\nI am in my 30s with a mortgage and 1 baby.\n\nQuestions- what are people opinions, thoughts? \n\nWhat should I look out for? Is it worth having your own business these days in UK? ",
      "is_original_content": false,
      "link_flair_text": "Idea Feedback",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1r70aes/starting_up_on_my_own/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o67m5lt",
          "author": "reviewsthatstickteam",
          "text": "If you can’t shake the idea, that usually means something. £60k and a car is comfy, especially with a mortgage and a baby, but you’ve got solid industry knowledge which is half the battle. Just make sure you’ve got a decent runway saved up and properly check your contract before you do anything risky going out on your own is great, but it’s not as easy as Instagram makes it look.",
          "score": 2,
          "created_utc": "2026-02-19 08:44:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5wqwfw",
          "author": "Khushboo1324",
          "text": "Sounds like you’re doing the hardest part already , taking the first step. Starting on your own is scary, but it teaches you so much faster than waiting for the “perfect moment.” One thing that helped me (and others I know) is to pick one small thing you can ship this week , even if it feels tiny , just to build momentum.\n\nWhat’s one thing you can move forward with today?",
          "score": 1,
          "created_utc": "2026-02-17 18:34:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5wy4d5",
          "author": "NoNeedleworker8427",
          "text": "Sounds interesting, I’m in a similar boat. \n\nDo you mind if I ask what sector or the construction industry you’re in? HVAC? \n\nDrop me a message, would be great to combine ideas. \n\nI think it’s definitely worth having a business in the U.K.!",
          "score": 1,
          "created_utc": "2026-02-17 19:07:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5xdoa0",
          "author": "Infinite_Drive3182",
          "text": "Talk to an accountant about the correct tax structure for your business and how it will effect your personal tax. I work for a company but if you want I can sort out some basics.",
          "score": 1,
          "created_utc": "2026-02-17 20:20:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5xl9a0",
          "author": "Loose-Anxiety4319",
          "text": "imo it's always worth it. especially if you can't get it out your mind, then you should definitely give it a shot or else you'll always wonder 'what would've happened if you did'.\n\n  \nyou can beat a 60k salary pretty easily, if you break it down that's basically 5k/mo, that's can be 1 high paying client or 2 medium paying clients which you should be able to close in 3 months.\n\n  \npick a service based business that you know you'll be able to deliver, start on the side before quitting your job. build a website, polish your linkedin and start reaching out to companies who you can serve via linkedin and email (and x if you can). \n\n  \nonce you get the groove of things and start scheduling some intro / demo calls (shouldn't take longer than 1 month) you can consider quitting your job. \n\n  \nonce you close yoru first client you should feel confident enough about quitting your job (shouldn't take longer than 2 months for a total beginner, which you're not so you'll probably get there faster). \n\n  \nand then just repeat more of the same and get more clients. \n\n  \nat first i'd fulfill the service myself if i was you. get as high cash flow as possible, start scaling with outbound, optimise for cashflow so you feel comfy and once you're at around 10k/mo you can start hiring and delegating and all that stuff.\n\n  \nhope this helps.",
          "score": 1,
          "created_utc": "2026-02-17 20:56:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6k22dh",
          "author": "Jackd10se101",
          "text": "One tip I would give, is have a process in place from the start if customers don't pay or so you have regular payment for the job. A lack of cash flow can be the biggest business killer",
          "score": 1,
          "created_utc": "2026-02-21 05:34:53",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r8sqoo",
      "title": "What’s the biggest mistake people make when testing a new business idea?",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1r8sqoo/whats_the_biggest_mistake_people_make_when/",
      "author": "AdWrong9284",
      "created_utc": "2026-02-19 07:21:10",
      "score": 3,
      "num_comments": 2,
      "upvote_ratio": 1.0,
      "text": "One big mistake is trying to validate the idea by asking friends or family instead of real potential customers. Feedback from people who wouldn’t actually pay can create false confidence and delay real testing.",
      "is_original_content": false,
      "link_flair_text": "Marketing / Operational / Financial / Regularotry Advice sought",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1r8sqoo/whats_the_biggest_mistake_people_make_when/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o6cf0lx",
          "author": "LCRTE",
          "text": "I agree 100%, and imo it can also create false fears, as people tend to think that if they are not willing to pay for a product, nobody will.",
          "score": 1,
          "created_utc": "2026-02-20 01:16:24",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r9qgms",
      "title": "For starting a technical company in the UAE, is it better to hire directly or use manpower supply services?",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1r9qgms/for_starting_a_technical_company_in_the_uae_is_it/",
      "author": "Minute-Badger-7475",
      "created_utc": "2026-02-20 09:05:19",
      "score": 3,
      "num_comments": 3,
      "upvote_ratio": 1.0,
      "text": "Hi everyone,\n\nIf planning to start a technical services company in the UAE (likely in areas like MEP, maintenance, or construction support), and how decide on the hiring model.\n\nWould it be better to:\n\n1. Hire employees directly or\n2. Partner with a manpower supply company and outsource staffing?\n\nFrom what I understand:\n\nDirect hiring gives more control over quality and company culture.\n\nManpower supply services may reduce administrative workload and upfront costs.\n\nUAE labour laws, visa processing, and compliance can be complex for new businesses.\n\nMy main concerns are: cost efficiency, Scalability as projects increase, Legal compliance and risk management, Long term profitability\n\nFor those who have started businesses in the UAE, especially in technical or construction related fields, what worked better for you and why?\n\nAppreciate any real world insights",
      "is_original_content": false,
      "link_flair_text": "Business Partner Sought - Business has NOT been established",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1r9qgms/for_starting_a_technical_company_in_the_uae_is_it/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o6lqgbs",
          "author": "Alternative_Can3704",
          "text": "Sorry this is completely out of the topic, but are you also by any chance looking for anyone that’s good in marketing and graphic designing for your project",
          "score": 1,
          "created_utc": "2026-02-21 14:17:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6wtsp5",
          "author": "LunchLegal4997",
          "text": "For technical services in the UAE, both hiring models have pros and cons. Direct hiring gives control over quality and culture but comes with higher admin, visa, and compliance responsibilities. Manpower supply/outsourcing reduces administrative load and upfront costs, but can limit control over quality and alignment with your company. Many businesses use a hybrid approach: a core team hired directly, plus outsourced staff for project-based scalability. If you’re looking for guidance on UAE labour compliance, visa processing, and efficient staffing solutions, our services help businesses like yours hire the right people while managing legal and administrative risks, ensuring cost-efficient, scalable operations. Happy to share examples of how technical/construction companies structured their teams in Dubai!",
          "score": 1,
          "created_utc": "2026-02-23 06:39:09",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r84mde",
      "title": "Inflatable tent brand idea",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1r84mde/inflatable_tent_brand_idea/",
      "author": "Extension_Life_6207",
      "created_utc": "2026-02-18 14:35:33",
      "score": 3,
      "num_comments": 5,
      "upvote_ratio": 1.0,
      "text": "I’m exploring the idea of starting a small inflatable tent brand and wanted to get some advice from people who’ve been down a similar path or have manufacturing experience.\n\nThe concept is to focus on durable, easy-to-set-up inflatable tents for outdoor use, events, or even emergency and temporary shelter applications. Right now, I’m trying to decide between two main approaches: importing raw materials and producing locally, or working with manufacturers in China to produce fully customized inflatable tents under my own brand.\n\nI’ve been browsing B2B platforms like Alibaba, and it seems like many suppliers offer customization options such as fabric thickness, air beam design, valves, colors, logos, and packaging. At the same time, I’m aware there can be risks around quality control, communication, minimum order quantities, and long lead times.\n\nFor those who’ve imported outdoor gear or inflatable products, what were the biggest challenges you faced early on? How did you vet suppliers and ensure consistent quality? Would you recommend starting with small customized orders from overseas, or sourcing materials and assembling locally to begin with?\n\nAny insights on costs, certifications, branding, or mistakes to avoid would be really appreciated.",
      "is_original_content": false,
      "link_flair_text": "Idea Feedback",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1r84mde/inflatable_tent_brand_idea/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o628hfc",
          "author": "Aasheshh_Kulkarni",
          "text": "I am glad that you are thinking through this before jumping in. Inflatable structures look simple, but they are manufacturing heavy and quality sensitive.\nA manufacturing nightmare literally! \n\nBefore choosing China vs local assembly, the first question is: where are you planning to sell? TG Location changes everything.\n\nIf your primary market is the US or Europe, certifications, fire retardancy standards, liability insurance and product testing become serious. If you are looking at India or Southeast Asia, the cost structure and compliance layer is different, but logistics and service becomes the bigger differentiator.\n\nSecondly, do not think just supplier, think failure mode.\n\nWith inflatable tents, your brand will be judged on:\n\n– seam strength\n– air beam reliability\n– valve durability\n– repairability\n– after sales support \nand other customer centric/specific experience. One bad batch can kill early traction.\n\nPersonally, I would not start with large customized MOQs from overseas. I would:\n\n1. Validate demand with a small, tight SKU line.\n\n2. Order samples from 2 to 3 shortlisted suppliers and stress test them aggressively.\n\n3. Understand landed cost including freight, duties, warehousing and defect rate. Also, any unplanned expenses that might show up. \n\n4. Decide whether you want to be a brand or a product company.\n\nThere is a big difference.\n\nAlso, emergency and temporary shelter is a completely different buyer compared to outdoor leisure. Mixing these two verticals at the early stage is not recommended. \n\nIf you are open to sharing which geography you are targeting and what price band you are aiming for, happy to share more specific thoughts. This is one of those businesses where early structural decisions determine whether you build a brand or just import inventory. I hope this helps..",
          "score": 3,
          "created_utc": "2026-02-18 14:51:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6fd9sk",
              "author": "Extension_Life_6207",
              "text": "This is incredibly helpful. Thank you for laying it out this way.\n\nYou’re right. The more I dig into this, the more I realize this isn’t just “find a factory and add a logo.” There are structural decisions here that will define the whole direction of the business.\n\nRight now I’m leaning toward focusing on one specific use case instead of trying to cover both emergency and leisure markets. The customer expectations and buying psychology are completely different, and I don’t want to dilute positioning early on.\n\nThe geography question is something I’m actively evaluating. My initial thought is to target a market where I can realistically support after-sales service instead of just shipping products and hoping for the best. Long-term, I’d rather build something known for reliability and support than compete purely on price.\n\nAppreciate you taking the time to break this down. It definitely gives me more to think through before making any big commitments.",
              "score": 2,
              "created_utc": "2026-02-20 14:24:23",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o642ipn",
              "author": "EVERYTHINGGOESINCAPS",
              "text": "I don't know if this is AI or not (the bad batch killing traction feels it, but the rest not)\n\nEither way either a pretty good AI or amazing input from a rando.",
              "score": 1,
              "created_utc": "2026-02-18 19:50:36",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o67oz9q",
          "author": "reviewsthatstickteam",
          "text": "Sounds like a cool idea, inflatable stuff is having a bit of a moment. I’d just be careful with overseas manufacturing at the start, quality issues and long lead times can mess you up quick if you’re small. Maybe test with a small run first and really vet the supplier hard before going all in.",
          "score": 1,
          "created_utc": "2026-02-19 09:12:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6fc96n",
              "author": "Extension_Life_6207",
              "text": "Appreciate that. That’s exactly what I’m weighing. The lead times plus potential QC issues feel like the biggest early risks.\n\nI’m leaning toward starting with one core model and doing a small test run before scaling.",
              "score": 1,
              "created_utc": "2026-02-20 14:19:02",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1rbkk1g",
      "title": "how to make socks feel premium through packaging and branding",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1rbkk1g/how_to_make_socks_feel_premium_through_packaging/",
      "author": "Pale-Tie-2760",
      "created_utc": "2026-02-22 12:23:33",
      "score": 3,
      "num_comments": 3,
      "upvote_ratio": 1.0,
      "text": "Hi everyone,\nI’m in the early stages of starting a custom socks business and trying to figure out how to position my brand as premium from the start. I know the quality of the socks themselves matters, but packaging and branding play a huge role in shaping customer perception.\n\n\nI’m exploring ideas like minimalistic packaging, eco-friendly materials, and branded boxes or sleeves. I’m also looking at sourcing packaging from bulk B2B suppliers such as Alibaba, Uline, Packlane, and Paper Mart. One of the challenges I’m running into is comparing prices and minimum order quantities across these suppliers to find options that feel high-end without going over budget.\n\n\nI’d love to hear from anyone who has experience with premium sock brands or small apparel startups:\n•\tWhat elements made the brand feel high-end to you as a customer?\n•\tDo you have any tips for sourcing packaging from bulk suppliers while keeping quality premium?\n•\tAre there any mistakes I should avoid in the early stages when picking packaging or suppliers?\n\n\nThanks so much for any advice or insights you can share",
      "is_original_content": false,
      "link_flair_text": "Marketing / Operational / Financial / Regularotry Advice sought",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1rbkk1g/how_to_make_socks_feel_premium_through_packaging/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o6tp5dy",
          "author": "KING---___---",
          "text": "HEY BRO WHERE R FROM",
          "score": 1,
          "created_utc": "2026-02-22 19:24:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6v4tvh",
          "author": "hfxadv",
          "text": "I had a premium dog leash company. Instead of following the crowd with standard collars on cardboard backing and zip ties, I went a completely different route. I sourced custom wooden boxes because I knew the business was about the presentation and the premium pricing. While the competition stayed basic, I focused on the unboxing experience, colourways and lifetime warranty aspect that made my designs last.\n\n[https://flic.kr/p/9GshQd](https://flic.kr/p/9GshQd)",
          "score": 1,
          "created_utc": "2026-02-22 23:54:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6x8b5y",
          "author": "ChestChance6126",
          "text": "Premium usually shows up in restraint, not extras. The sock brands that feel high end to me keep it tight. One strong color palette, minimal copy, heavier stock band or sleeve, and clean typography. No clutter, no five bullet point feature lists. the weight and texture of the paper often matter more than adding another insert.\n\nBefore you go deep on custom boxes, test unit economics. A rigid box can eat your margin fast, especially with shipping. I’ve seen early apparel brands lock into high MOQs on packaging, then pivot the brand slightly and get stuck with dead inventory. If I were you, I’d prototype small batches with 2 to 3 packaging styles and get real customer feedback. Ask what made it feel premium or cheap. Let perception data guide you before you commit to a big print run.",
          "score": 1,
          "created_utc": "2026-02-23 08:56:26",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}