{
  "metadata": {
    "last_updated": "2026-02-20 17:10:01",
    "time_filter": "week",
    "subreddit": "Business_Ideas",
    "total_items": 17,
    "total_comments": 89,
    "file_size_bytes": 126025
  },
  "items": [
    {
      "id": "1r6k91f",
      "title": "Subscription plan that gets cheaper the longer you're subscribed",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1r6k91f/subscription_plan_that_gets_cheaper_the_longer/",
      "author": "the_armanda",
      "created_utc": "2026-02-16 20:03:16",
      "score": 32,
      "num_comments": 16,
      "upvote_ratio": 0.94,
      "text": "Hey, this is just a shower thought. If businesses are already doing this then great but I just haven't seen it yet:\n\nHow about a subscription plan that gets cheaper the longer you're subscribed and thus rewards you for staying loyal to the business/brand? Let's be real: the economy sucks. While money is getting tighter, everything's becoming a subscription. If you're trying a subscription model, you're competing with a dozen other subscriptions. The customer's probably very hesitant to add one more to set and forget, so why not make the decision easier?\n\nMany services, when you cancel, will beg you to stay with a super marked-down price for like two or three months. From my perspective at least, when they pull this it feels like someone promising really hard to change when you wanna cut things off... only to go back to the same shit. Why not build a relationship with the customer before that: say \"hey, if you join us and stay with us, we'll hog less of your wallet.\"\n\nNow, obviously it wouldn't go down to $0. Maybe in a year a monthly subscription incrementally goes from $10 to $5 and stays that way. The point is that the customer sees value not just in the subscription and service but continuing to stick with it. Dropping the subscription would feel like throwing away a long-term benefit.\n\nI imagine this pressure would lead to higher retention. Sure some people are paying less but those are the people that stay, the people you can rely on the most.\n\nYou could probably handle cancellation however you want but personally I wouldn't cut off the benefit immediately; maybe just incrementally increase the subscription price each month they're away until it's back to the original.\n\nI don't really have anything I'd use this model for. I freelance articles and those prices are based on word count. I'm working on a webcomic and I'd probably just ask for donations each month in exchange for early releases and bonus content. But if anyone else thinks this is a good idea and wants to try it (or is doing it already), tell me how it goes! If you think it sucks, the downvote button is right there lol.",
      "is_original_content": false,
      "link_flair_text": "Idea Feedback",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1r6k91f/subscription_plan_that_gets_cheaper_the_longer/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o5quir2",
          "author": "Khushboo1324",
          "text": "This is actually a smart retention idea. People love feeling rewarded for loyalty, but the key will be making the value very visible and easy to understand. If users clearly see how much they’re saving over time and what they unlock by staying, it can turn into a psychological win rather than just a pricing trick. I’d also test it with a small group first to see how it impacts churn versus margins, because sustainability matters as much as creativity here.\n\nWhen I was experimenting with a similar concept, having a simple runnable setup where users could log in and track their progress made a big difference in engagement. I used Runable for that part and it helped me get early feedback quickly. Just sharing what worked for me.",
          "score": 6,
          "created_utc": "2026-02-16 20:24:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5qyypi",
              "author": "the_armanda",
              "text": "That's really cool! Yeah maybe on a subscription page there's a scale or chart of your savings over time, where you are and what benefits you gained.",
              "score": 1,
              "created_utc": "2026-02-16 20:46:17",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5r1g7p",
                  "author": "Khushboo1324",
                  "text": "Yeah exactly, a visual like that could make a huge difference. If people can literally *see* their savings growing over time, it turns the subscription into something they feel invested in rather than just another monthly charge. You could even experiment with small milestone rewards along the way, not just price drops, so there are moments of positive reinforcement before the big discount kicks in. That emotional progress might matter just as much as the financial one.",
                  "score": 1,
                  "created_utc": "2026-02-16 20:58:26",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5r93ym",
          "author": "DenverKim",
          "text": "It doesn’t get cheaper, but the CRM software I use for my small business grandfathered me in at the original rate I signed up for… I’ve been using it for 10 years now and I am paying half of what I would pay if I signed up as a new customer today or if I signed up for any of the other competing companies. There is actually another company I would prefer to use at this point (they even offered me a free year to switch over to their service) but it’s not worth it to justify doubling the monthly cost in the long run, so they basically have me for life now.",
          "score": 6,
          "created_utc": "2026-02-16 21:35:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5tmmvr",
          "author": "jrbp",
          "text": "Most put their prices up over time to fight losses from inflation; how will you navigate that?",
          "score": 6,
          "created_utc": "2026-02-17 06:17:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5quex6",
          "author": "pranimtun",
          "text": "JetBrains does that with the PHPStorm license. If I remember correctly you pay the second and the third year less money than in the first year.",
          "score": 4,
          "created_utc": "2026-02-16 20:23:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5rlfiu",
          "author": "FangedJaguar",
          "text": "I really like this idea, but I would not advertise it upfront. The fear of loss is a great way to keep customers, but if I saw a higher upfront price, it would be a huge turnoff to me signing up in the first place",
          "score": 4,
          "created_utc": "2026-02-16 22:37:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5rox0x",
          "author": "imabetaunit",
          "text": "OP, you must be the Comcast rep I’ve been complaining to every year when my stupid promo rate expires.",
          "score": 3,
          "created_utc": "2026-02-16 22:55:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5rt3pe",
          "author": "kevmoss",
          "text": "I like it - build in a reward exponential element, introduction fees are bigger the longer you subscribe. \nThere are cons to this but it would be interesting.",
          "score": 3,
          "created_utc": "2026-02-16 23:18:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5tfbei",
          "author": "ChestChance6126",
          "text": "Interesting idea, but I’d watch the unit economics. Your longest term customers are usually your most profitable. Discounting them cuts into the cohort that’s already working. Retention usually comes more from ongoing value than pricing mechanics. ",
          "score": 3,
          "created_utc": "2026-02-17 05:19:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5uvk4k",
          "author": "slowburn_otters",
          "text": "Lowkey I actually like this idea. It flips the usual “we’ll only care once you try to leave” vibe and makes loyalty feel real instead of desperate.\n\nThe only tricky part is pricing psychology — some companies might worry people will game it (sub for a year, cancel, come back later). But if it’s structured right, it could build solid long-term users instead of constant churn.\n\nWay better than those fake “pls don’t go here’s 70% off for 2 months” emails tbh.",
          "score": 3,
          "created_utc": "2026-02-17 12:49:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5y7qrv",
          "author": "mr_asadshah",
          "text": "I do that but it’s unadvertised. Our agency retainer is £1,800 I just drop it to £1,500 after a bit for no reason",
          "score": 2,
          "created_utc": "2026-02-17 22:45:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5szjz4",
          "author": "Wwwweeeeeeee",
          "text": "My auto insurance was like that, once upon a time, Progressive, in CA. My rates got lower every year, due to no accidents or tickets. Every little bit helps and I still obviously recommend them. My adult kid has them too.\n\nAnd my live UK TV subscription hasn't ever raised my rates as a \"Legacy\" member, while new subscribers pay a few euros more, and I appreciate that, very much.  They were originally based out of Ukraine, now I don't know where they're landed, due to the russian invasion, but their service remains consistent and reliable. ",
          "score": 1,
          "created_utc": "2026-02-17 03:29:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o65km1h",
          "author": "springcaterpillar",
          "text": "ndfathering. don't raise prices on existing customers while new signups pay more. it rewards loyalty without complicating the pricing page or attracting people who are only there for the discount curve.",
          "score": 1,
          "created_utc": "2026-02-19 00:14:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5qr5cs",
          "author": "Joseots",
          "text": "That’s the opposite of how businesses grow & are profitable. \n\nNot saying it’s a bad idea.  But why would a business choose to be less profitable - when you can still cancel anytime.  \n\nNow a cheaper subscription to guarantee you remain a customer — like annual deals vs monthly are common already.  \n\nExisting customers are a businesses most profitable center, they aren’t gonna shrink the golden goose.",
          "score": 1,
          "created_utc": "2026-02-16 20:07:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5qxo92",
              "author": "the_armanda",
              "text": "First, thank you for your feedback because it did give me pause. Granted, I'm not an entrepreneur but\n\n>Not saying it’s a bad idea. But why would a business choose to be less profitable - when you can still cancel anytime.\n\nYes, the customer can cancel at any time, but if you compare two plans for the exact same service, economically a customer has less reason to cancel a $10 monthly subscription that becomes $5, than a $10 subscription that will always be $10. I guess it'd be akin to a growth-first model that tries to expand the customer base at expense of profit.\n\nAlso the variables can change depending on what's feasible. Maybe instead of going down to $5 it goes down to $7, or instead of going down over the course of a year it goes down over two years, or three.\n\n>Now a cheaper subscription to guarantee you remain a customer — like annual deals vs monthly are common already.\n\nYeah, there are annual deals, but they're not predicated on loyalty and will still spook your wallet. $100 seems steep whether it's 10% off, 20% off, 50% off, et cetera. As a first time subscriber, you don't know whether you're actually gonna need it or use it that much. Monthly savings over time requires less perceived upfront commitment from the customer.\n\n>Existing customers are a businesses most profitable center, they aren’t gonna shrink the golden goose.\n\n[It's already shrinking.](https://www.vice.com/en/article/the-subscription-era-is-over-the-purge-has-begun-in-america/) That's why cord-cutting services are becoming popular (while ironically also asking for subscriptions). This decade has been defined by a lot of economic uncertainty, so hard choices have to be made. I think it's more profitable to have a customer that pays a few dollars less a month than a customer that axes the expense altogether when they don't have a few extra dollars. That's why companies will beg you to stay at a significantly lower price if you threaten to cancel.",
              "score": 5,
              "created_utc": "2026-02-16 20:39:54",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r5hlgn",
      "title": "Should you get an LLC before starting a business?",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1r5hlgn/should_you_get_an_llc_before_starting_a_business/",
      "author": "dtsummery",
      "created_utc": "2026-02-15 15:37:40",
      "score": 24,
      "num_comments": 25,
      "upvote_ratio": 0.81,
      "text": "Let's talk about the legal trap. Do you actually need an LLC to start your business?\n\nI see this every single day. Someone has a killer idea for a junk removal business or a niche e-commerce store, and instead of finding their first customer, they spend three weeks obsessing over articles about Delaware S-Corps, registered agents, and operating agreements.\n\nThey haven't made a single dollar, but they’re already worried about protecting their assets.\n\nIf you haven't started yet, you don't have any business assets to protect.\n\nMy goal today is to save you from the administrative abyss that kills 90% of entrepreneurs before they even launch. I’ve started 9 companies. Some I LLC’d on day one (mistake), and others I didn't touch until we hit $10k a month.\n\nHere is the raw, unfiltered truth.\n\n# The Reality Check: Revenue vs. Paperwork\n\nThe biggest mistake you can make is confusing activity with progress. Filing paperwork feels like progress because you get a fancy document from the Secretary of State, but it doesn't put money in your bank account.\n\nIn the beginning, your only job is Validation. Does anyone actually want what you’re selling?\n\n* **The \"Solo\" Phase:** If you are just testing the waters, selling handmade candles on Etsy or mowing three neighbors' lawns, you are a **Sole Proprietorship** by default. You don't need to file anything. You are the business.\n\nAsk yourself, \"What is the worst-case scenario today?\" If you’re a consultant giving advice, the risk is low. If you’re performing surgery in your garage (please don't), the risk is high.\n\n# When to actually pull the trigger\n\nDon't get an LLC because you feel like a CEO. Get an LLC when the math and risk demand it. Here are the 3 variables I use to decide when it's time to file.\n\n**Variable #1 - The \"Sleep at Night\" Factor (Liability):** The primary purpose of an LLC (Limited Liability Company) is to create a \"corporate veil\" between your personal bank account/house and your business lawsuits.\n\n* **Low Risk:** Digital marketing, graphic design, writing, coaching. (You can wait).\n* **High Risk:** Construction, food service, childcare, physical products that could explode or choke someone. (Get the LLC early).\n\n**Variable #2 - The \"Professionalism\" Barrier:**\n\nAre you chasing B2B (Business to Business) clients? Big companies often won't cut a check to \"John Smith.\" They want to pay \"Smith Consulting LLC.\" If your business model requires a professional facade to even get a meeting, then the $300–$800 setup cost is just a marketing expense. Write it down and pay it.\n\n**Variable #3 - The Tax Pivot Point:**\n\nOnce you start making real money (usually around the $50k–$70k profit mark), an LLC allows you to elect **S-Corp status**. This is the \"magic trick\" that saves you thousands in self-employment taxes. But if you're making $0? An LLC actually *costs* you money in annual fees and franchise taxes.\n\n# Personal Tips for the Legal Phase\n\n* **Don't Hire a Lawyer Yet:** Unless you have partners (which I don't recommend for your first rodeo), do not spend $2,500 on a lawyer to file an LLC. Use a service like Northwest Registered Agent or even do it yourself on your State’s website for the cost of the filing fee. It takes 15 minutes.\n* **The \"Bank Account\" Rule:** The second you get that LLC, you **must** open a separate business bank account. If you mix your grocery money with your business revenue, you \"pierce the corporate veil\" and the LLC becomes a useless piece of paper. A judge will laugh at your \"protection\" if you're paying for Netflix out of the business fund.\n* **Insurance > LLC:** Most people think an LLC is a magic shield. It’s not. A good General Liability insurance policy ($500/year) will protect you more in the early days than a piece of paper from the government will.\n\n# THE \"SPECIAL SAUCE\" FOR FILING \n\nJust like I told you with PPC and Web Dev: If you don't know how to do it, don't waste 20 hours learning it.\n\n1. Go to your state's Secretary of State website.\n2. Look for the \"Articles of Organization\" form.\n3. If it looks like Greek to you, go back to Upwork.\n4. Hire a paralegal or a business filing expert for $100 to do the legwork for you. Don't pay anyone more than that.\n\nDO NOT let the lack of an LLC be the reason you haven't launched. I have seen \"entrepreneurs\" spend 6 months choosing a name and filing an LLC for a business that never made a single sale.\n\n# What’s the move?\n\nIf your business is low-risk, **start today**. Sell the product. Get the lead. Make the phone ring. Once you have $2,000 in the bank from actual customers, use $500 of that \"found money\" to file your LLC.\n\nBuild the engine before you paint the car.\n\nThe \"chains of the 9-5\" aren't broken by filing forms. They’re broken by generating revenue. Go get some.\n\nI'm still hanging out in the discord if you guys need a checklist of which states are the cheapest to file in or which insurance providers I use for my service businesses. It's all free.",
      "is_original_content": false,
      "link_flair_text": "A How-To Guide that no one asked for",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1r5hlgn/should_you_get_an_llc_before_starting_a_business/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o5lf0lh",
          "author": "egads_wheres_my_ship",
          "text": "ai;dr",
          "score": 5,
          "created_utc": "2026-02-15 23:37:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5mwox0",
              "author": "FlowZenMaster",
              "text": "😂😂\n\nliterally same. saw the format, scrolled down, replied to you. I feel bad for adding a comment to this but I haven't seen that phrasing yet and I love it. so relevant.",
              "score": 2,
              "created_utc": "2026-02-16 05:30:45",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5oeby4",
          "author": "ReturnOfNogginboink",
          "text": "I didn't read past, \"If you haven't started yet, you don't have any business assets to protect.\"\n\nThe point of forming an LLC is to protect your personal assets from your business liabilities.",
          "score": 3,
          "created_utc": "2026-02-16 13:13:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5lkqaj",
          "author": "R12Labs",
          "text": "Where do you find liability insurance for $500 a year?",
          "score": 2,
          "created_utc": "2026-02-16 00:11:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5m5405",
              "author": "strange-humor",
              "text": "You can often add to home owners for some side hustles for under $100 a year.",
              "score": 1,
              "created_utc": "2026-02-16 02:18:08",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o5th2w9",
              "author": "No_Mood2658",
              "text": "NEXT Insurance....i pay 50 a month for general liability and Errors & Ommissions",
              "score": 1,
              "created_utc": "2026-02-17 05:32:48",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5o9yzr",
          "author": "No-Pilot5559",
          "text": "AI slip again",
          "score": 2,
          "created_utc": "2026-02-16 12:44:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5nviz8",
          "author": "fitandhealthyguy",
          "text": "What if you already have significant personal assets? Just get a good umbrella policy?",
          "score": 1,
          "created_utc": "2026-02-16 10:48:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5pa2p1",
              "author": "BingeBoss33",
              "text": "If you have significant personal assets, it's probably best to go the LLC route. An umbrella policy doesn't create a legal barrier between you and your business. So with the LLC, if your business gets sued or whatever, your personal assets (house savings, investments, etc) generally are off limits. If you decide to go the LLC route, make sure you get yourself a good registered agent. The one we went with has been amazing and is all about privacy protection (keeping our home address off of the Internet) etc.",
              "score": 2,
              "created_utc": "2026-02-16 15:59:58",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o6fq967",
              "author": "dtsummery",
              "text": "That’s a fair point, and it’s usually the first thing people with a nest egg worry about. But here’s the candid reality, an umbrella policy is a safety net, not a wall.\n\nI’d actually argue that if you have significant personal assets, relying *only* on insurance is a gamble you don't need to take. \n\nInsurance is great, until you hit an exclusion clause. If a claimant sues you for something your policy doesn't explicitly cover (or if they claim \"willful negligence\"), your insurance company might step back and leave your personal house and savings exposed. The LLC is your second line of defense; it limits the \"blast radius\" to the business itself.\n\nIf you are operating as a sole proprietor and have a $2M umbrella policy, you are a very attractive target. A plaintiff's attorney will go after *you* personally because that’s where the money (and the policy) sits. With an LLC, the lawsuit is technically against the entity. It creates a massive hurdle for them to \"pierce the veil\" to get to your personal brokerage account.\n\nIf you already have assets, you clearly have the capital to afford the filing. My advice in the post is mostly for the \"broke and starting\" crowd. If you’ve got a house, a 401k, and a family to protect:\n\n* **The Move:** Spend the $300 on the LLC **and** keep the umbrella policy.\n* **The Result:** You’ve built a stone wall (LLC) *and* bought a safety net (Insurance).\n\nIf you have nothing to lose, skip the LLC. If you have a lot to lose, the LLC isn't administrative abyss, it's cheap sleep insurance.",
              "score": 1,
              "created_utc": "2026-02-20 15:28:57",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5q7wdj",
          "author": "BizUpUSA",
          "text": "Agree with this. Way too many people hide in paperwork instead of testing if anyone will actually pay.\n\nLLC makes sense once there’s real signal or higher risk, otherwise it just feels like productive procrastination.",
          "score": 1,
          "created_utc": "2026-02-16 18:36:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6fpyr5",
              "author": "dtsummery",
              "text": "Productive procrastination is the perfect term for it. It’s the ultimate comfort blanket for people who are terrified of actually asking for a sale.",
              "score": 1,
              "created_utc": "2026-02-20 15:27:33",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5tve7t",
          "author": "Realistic-Divide-564",
          "text": "facts. people love feeling busy instead of making a sale. validate first, paperwork later unless the risk is real.",
          "score": 1,
          "created_utc": "2026-02-17 07:35:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6fpq67",
              "author": "dtsummery",
              "text": "That’s exactly it. It’s the \"Entrepreneurship Cosplay\" trap. It feels a lot more comfortable to sit in a home office designing a logo and waiting for a Certificate of Formation than it does to actually pick up the phone and get rejected by a prospect.",
              "score": 1,
              "created_utc": "2026-02-20 15:26:25",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5ubust",
          "author": "funkopopruler",
          "text": "Most people overthink the LLC thing when they should be finding customers first. Only exception is if you're selling physical products or highrisk services, get that liability protection early. For the filing part, doola handles the whole mess for a fraction of the cost and you're done in days",
          "score": 1,
          "created_utc": "2026-02-17 10:11:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6fpe55",
              "author": "dtsummery",
              "text": "For physical products or high-risk stuff, I actually suggest going to a local independent insurance agent before even hitting a filing service.\n\nAn insurance policy will actually pay for your lawyer if you get sued, an LLC just tries to keep them from taking your house after you lose the case.\n\nIf you have the $500 to spend on a service like doola, I’d argue you’re better off filing the LLC yourself for $100 and putting the other $400 into Meta ads or a better landing page.\n\nBuild the engine, then hire the mechanics. Would you rather have a perfectly filed LLC and zero sales, or a messy sole-prop with $5k in the bank? I'll take the $5k every time.",
              "score": 1,
              "created_utc": "2026-02-20 15:24:50",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5uoizm",
          "author": "likelyculprit",
          "text": "I’ve been in business since 2012 and formed an LLC last month. Didn’t really need it until I wanted to switch to S Corp taxation. All really depends on your line of work and what liabilities you face.",
          "score": 1,
          "created_utc": "2026-02-17 12:00:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6fp7jz",
              "author": "dtsummery",
              "text": "While I’m the first person to tell a newbie to stop obsessing over paperwork, waiting 12 years introduces a massive \"Invisible Risk.\" Even if you’re in a low-liability niche, a decade is a long time for a freak accident or a disgruntled client to come out of the woodwork.  \n  \nIf you were making decent profit back in, say, 2018, you likely handed the IRS thousands in self-employment taxes that an S-Corp election could have shielded. The \"tax drag\" of staying a sole prop usually starts hurting once you're netting over $50k.  \n  \nIf you get audited after 10 years of running everything through your personal name, untangling \"business\" from \"personal\" for a decade’s worth of bank statements is a special kind of hell.  \n  \nDon't get me wrong, I love that you prioritized the work over the fluff. But for the person reading this who is 3 years in and profitable: **don't wait until year 12.** Once the math makes sense for the S-Corp, you're essentially paying a \"stubbornness tax\" every year you don't file.",
              "score": 1,
              "created_utc": "2026-02-20 15:23:57",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5v3l4c",
          "author": "digital_nurd",
          "text": "These are good times actually. You don't even need a website anymore. Just start sharing your process and routine on tiktok. build your own community. ",
          "score": 1,
          "created_utc": "2026-02-17 13:37:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6foy3v",
              "author": "dtsummery",
              "text": "You’re 100% right that attention is the new currency. Documenting the process on TikTok is the fastest way to build trust and get those first few \"validation\" sales without spending a dime on ads. It’s the ultimate low-friction start.\n\nHowever, there is a massive platform risk trap there.\n\nIf you build your entire business on TikTok and the algorithm changes (or the app gets banned/restricted), your community vanishes overnight. You don't own those followers, the platform does.",
              "score": 1,
              "created_utc": "2026-02-20 15:22:42",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5y3i0e",
          "author": "UrBiz_NotMine",
          "text": "AI writing a novel once again.",
          "score": 1,
          "created_utc": "2026-02-17 22:23:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o604qmj",
          "author": "TonyPajaaamas",
          "text": "As a law student with an emphasis in business law, this is terrible advice 😂😂😂 ",
          "score": 1,
          "created_utc": "2026-02-18 05:21:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6fope6",
              "author": "dtsummery",
              "text": "Spoken like someone who hasn't had to make payroll yet. 😂\n\nMy advice isn't about ignoring the law. It's about prioritizing momentum. If you’re a freelance writer or a kid mowing lawns, the corporate veil is often a psychological barrier rather than a functional necessity in month one.\n\nI’d love to hear your take, though, as a future lawyer, where is the *actual* line for you? At what specific dollar amount or 'event' does a side hustle become 'negligent' to run as a sole prop in your books?",
              "score": 1,
              "created_utc": "2026-02-20 15:21:33",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o64bvgl",
          "author": "sweetlemon1025",
          "text": "Hello, this may be a dumb question - Can I ask the people doubting this advice: I'm starting a zine subscription through my online following. It is a physical product that requires being shipped in the mail. (costs roughly $5.90 in COGS and selling for $16.99). I have high personal assets. What realistically are the risks that should be driving me towards completing the LLC paperwork? Someone sues me over a papercut? The mail doesn't deliver on time and I have to resend the letter? ",
          "score": 1,
          "created_utc": "2026-02-18 20:34:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6fod9t",
              "author": "dtsummery",
              "text": "You aren’t being dumb at all. You’re being logical. In a world of sue-happy horror stories, we tend to lose perspective on scale.\n\nIf I’m in your shoes, here is the unfiltered perspective on your business:\n\nThis is the only reason to even have this conversation. If you have a $500k brokerage account or a paid-off house, you have a \"target\" on your back that a broke college student doesn't.\n\nHowever, an LLC is not a magic invisibility cloak. If you personally drop a heavy box of zines on a postal worker’s foot, they can still sue *you* for your negligence. The LLC protects you from **contractual** mess-ups or \"business\" debts. Since you aren't taking out a $50,000 equipment loan or signing a 5-year office lease, your \"entity\" risk is actually quite low.\n\nWhat could actually happen?\n\n* **Copyright Infringement:** You accidentally use a photo or a font you don't have the rights to. The artist sues for $10k.\n* **The \"Exploding\" Zine:** Your printer uses a weird chemical ink that gives a kid a massive allergic reaction. (Extreme? Yes. Possible? Technically).\n* **The \"Slip and Fall\":** You hire a neighbor kid to help you stuff envelopes, they trip on a rug in your house and break their arm.\n\nNormally, I say wait. But for *you,* with a physical product and high personal assets, I’m going to give you a slightly different \"Move\":\n\nGet Insurance, not just an LLC. An LLC is a shield that stays in the closet. General Liability Insurance is a shield you actually carry into the fight. For a zine business, a policy might cost you $300 a year. If someone sues you over a \"papercut\" (or a copyright claim), the insurance company pays for the lawyer. The LLC does *not* provide you with a lawyer; it just limits what the other guy can take if you lose.",
              "score": 1,
              "created_utc": "2026-02-20 15:19:57",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r84c41",
      "title": "Zero Money. Zero Network. Zero Stability. How Do I Actually Build Something?",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1r84c41/zero_money_zero_network_zero_stability_how_do_i/",
      "author": "Realistic_Edge_2267",
      "created_utc": "2026-02-18 14:24:15",
      "score": 20,
      "num_comments": 27,
      "upvote_ratio": 0.96,
      "text": "Hey everyone,\n\nI’m new to business and I genuinely want to build something of my own. I’m open to different models — SaaS, brokerage, service-based, anything practical. My goal is simple: become financially stable first, then grow from there.\n\nMy biggest issue is execution.\n\nI can research, plan, and generate ideas. But when it comes to launching and handling risk, I hesitate — mainly because I don’t have financial backup to absorb losses.\n\nHere’s what I’ve tried so far:\n\n* Looked into dropshipping — realized it requires ad spend and risk tolerance I currently don’t have.\n* Built SaaS projects — development is manageable, but marketing and customer acquisition feel overwhelming without budget.\n* Considered brokerage/middleman models — low capital, but requires strong communication skills (which I’m still improving).\n* Tried freelancing — very competitive as a beginner.\n* Considered social media — but I prefer building something private and scalable rather than personality-driven.\n\nI’m not looking for shortcuts or “get rich quick” ideas.  \nI’m looking for realistic direction.\n\nIf you were starting from:\n\n* Almost zero capital\n* No strong network\n* Limited risk tolerance\n* Beginner-level communication skills\n\nWhat would be the most logical first step to build stability?\n\nShould I:\n\n* Focus on building a skill first?\n* Get a job and stack capital?\n* Start a small service business?\n* Something else entirely?\n\nI’m open to honest feedback — even if it’s tough to hear.\n\nIf you’ve been in a similar situation and managed to build something sustainable, I’d really value your perspective.\n\nThanks for reading.",
      "is_original_content": false,
      "link_flair_text": "Marketing / Operational / Financial / Regularotry Advice sought",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1r84c41/zero_money_zero_network_zero_stability_how_do_i/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o66chwz",
          "author": "VetPrepHelp",
          "text": "Find something you are extremely passionate about that way even if it never works out you will have satisfaction doing it. Ex. I am an Air Force Veteran who was discharged as a result of an accident that happened while i was in service. As a result i experienced temporary homelessness but had enough mentors and support system around me to keep me motivated and not give up. After years and years of going through treatment and fighting the VA, i finally received what i deserved. Since then, not only have i worked for a medical consulting company helping veterans with their claims but have spent my personal time volunteering and helping advice Veterans on their own claims(no longer my day job but something i do for fun).\n\nAs a non technical founder, i was able to somehow build an MVP/prototype platform that a handful of veteran are using for absolutely free. My end goal? Be the National Infrastructure for all things related to Veteran Preparedness starting with VA benefits.  Lofty goal, i know but someone has to claim it so why not me. Other competitors are charging Veterans for the education which to me is absurd and is the reason why i hope to disrupt the market by offering my services for absolutely FREE to all veterans. SO who will my paying customers be? Legal firms, medical consulting companies, accredited organizations, Veteran Service Officers, and the VA themselves. \n\nAm i currently profitable? Heck no...in fact i am in the red but with the feedback ive been getting from my free users, i know i am headed in the right direction. My main goal for now is getting enough Veterans using my platform, find value in it, share it, spread the word out and eventually those other organizations will take me seriously.\n\nThere is a quote that says \"If you don't stand for something, you will fall for anything\"  I stand with the Veteran community and others who are or have ever worn a Uniform in support of this Great Nation. This platform is something i am passionate about and willing to keep going at it even if i never get a single paying customer.\n\nSo to answer your question: How Do I Actually Build Something? Find something you are extremely passionate about, identify a well known problem regarding passion, come up with a solution that will serve others who share similar interest in your passion, go balls to the wall doing it and hang on for dear life.\n\nHope this helps, and best of luck.  Feel free reaching out and keeping in touch. We can do this!!!",
          "score": 5,
          "created_utc": "2026-02-19 02:55:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o69d2fa",
              "author": "Realistic_Edge_2267",
              "text": "Thank you for your help and service without you guys we can't sleep peacefully so once again thank you for duty and also sorry to hear your loss",
              "score": 1,
              "created_utc": "2026-02-19 15:57:44",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o69eo3o",
                  "author": "VetPrepHelp",
                  "text": "Just like with investing, its only a profit/loss once you sell.   \n  \nMy mindset is its only a loss if i quit or stop helping veterans which i do not see myself doing since i will always help other veterans in need.\n\nI haven't lost anything yet since i am still going through the journey, but thank you for empathising. ",
                  "score": 2,
                  "created_utc": "2026-02-19 16:05:30",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o62nir8",
          "author": "kops212",
          "text": "Get a job, and build that financial buffer. No way around it, suck it up.",
          "score": 3,
          "created_utc": "2026-02-18 16:01:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o62nt1m",
              "author": "Realistic_Edge_2267",
              "text": "But currently I in degree so I m kinda stuck in that without degree no one will give me job",
              "score": 1,
              "created_utc": "2026-02-18 16:03:08",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o65r5xi",
                  "author": "kops212",
                  "text": "Study, graduate, and get a job then?",
                  "score": 1,
                  "created_utc": "2026-02-19 00:51:26",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o684i7r",
                  "author": "That_Response_2648",
                  "text": "Im sorry but fuck a degree ! I don't or arleast didn't one have either in 2011. Starting learning and learning and learning youtube after YouTube video into electronics( built bunch of projects from scrap ) documented the process into portfolio. Drones, automation, kids toys, energy harvesting. You name it. Got a job as a electronic technician. Worked there 3 years and learnt everything I needed. \n\nImmigrated to new country got job in days with the built up portfolio and couple of years experience. Started doing online studies to get my degree. Finished that in 2018. Was dissipointed in the material as it was nothing new. \n\nMoving companies couple of times and now 6 figure salary. Not a single person asked for proof of degree. They want/hire attitude, eagerness to learn and portfolio of experience.  \n\nDegree is an indication of the above attributes becuase it indicates that the person can think but its certainly not a roadblock and definitely out dated requirement.",
                  "score": 1,
                  "created_utc": "2026-02-19 11:36:07",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o634hku",
          "author": "oratosdigital",
          "text": "The odds are against those who build, I think you can start by building your ideas as a side project to validate your ideas and this can help with the network you need too.",
          "score": 3,
          "created_utc": "2026-02-18 17:18:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o634py4",
              "author": "Realistic_Edge_2267",
              "text": "Oh ok",
              "score": 1,
              "created_utc": "2026-02-18 17:19:39",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o68itzi",
          "author": "indexintuition",
          "text": "i say this gently because i used to do the same thing, but if execution is the issue, adding more models to research will not fix it. with zero capital and low risk tolerance, the most logical move is usually to build a skill that someone will pay for, ideally while you have stable income from a job. boring is underrated. a simple service you can deliver manually teaches you sales, scope, communication, and delivery without ad spend or tech overhead. stability first, then experiments on the side in very small tests you can afford to fail. the goal early on is not scale, it is proof that you can close and deliver consistently. that confidence compounds way more than a perfectly planned saas ever will.",
          "score": 3,
          "created_utc": "2026-02-19 13:16:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o69cuhc",
              "author": "Realistic_Edge_2267",
              "text": "Thank you for help",
              "score": 1,
              "created_utc": "2026-02-19 15:56:40",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6f7kf5",
                  "author": "indexintuition",
                  "text": "no prob.\n\n",
                  "score": 1,
                  "created_utc": "2026-02-20 13:54:09",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o69ca5c",
          "author": "Worldly_Berry2703",
          "text": "Similar position. Recently listened to this episode on Lenny. My takeaway from it is to just to go out and do it; build a network / brand. I'm starting to realise 'talking to people with intention' might be the best way to make change. \n\n[https://www.lennysnewsletter.com/p/the-paths-to-power-jeffrey-pfeffer](https://www.lennysnewsletter.com/p/the-paths-to-power-jeffrey-pfeffer)",
          "score": 2,
          "created_utc": "2026-02-19 15:53:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o69ct7c",
              "author": "Realistic_Edge_2267",
              "text": "Thank you for help",
              "score": 1,
              "created_utc": "2026-02-19 15:56:29",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6dojha",
          "author": "Successful_Living242",
          "text": "Get a job → learn a skill → freelance → then build.\nBoring? Yes. The only path that actually works from zero? Also yes.",
          "score": 2,
          "created_utc": "2026-02-20 06:31:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6dveib",
              "author": "Realistic_Edge_2267",
              "text": "Bro i have skills and i have even tried to do freelancing but freelance market is so crowded that i never get work and for job i m currently in an ongoing degree and without degree no one will give me job\n\n",
              "score": 1,
              "created_utc": "2026-02-20 07:33:34",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6231b5",
          "author": "AutoModerator",
          "text": "Due to the status of your account, your post has been flagged (not yet published). Please read the following to get it manually approved:\n\n**Ensure that you have chosen the correct flair**  \nEach flair is specifically designed to facilitate discussion and allows contributing members to filter post types. Incorrect flair selection results in the removal of 70% of posts. Here’s an overview:\n\n- **Idea Feedback**: Use this if you're sharing a business idea for community feedback. Not for requesting ideas—use \"What business do I start?\" instead.\n- **What business do I start?**: Provide relevant details such as interests, capital, skills, preferred business type, and experience.\n- **Business Partner Sought**: AutoModerator will send you additional guidelines for partnership posts.\n- **App/Website Idea**: For technology-based business ideas.\n- **Review my website, please**: Sites collecting emails or requiring login without demo credentials will be removed.\n- **Need a name**: Describe your business, naming preferences, and rejected names.\n- **Marketing / Operational / Financial / Regulatory Advice sought**: Request advice for an existing or proposed business.\n- **A How-to guide that no one asked for**: Share your experiences or guides (no affiliate links allowed).\n- **No applicable flair exists for my post**: Use this only if none of the above apply.\n\n*If your post has the correct flair, continue reading...*\n\n**Advertising Policy**  \nPosts must not promote courses, blogs, newsletters, affiliate links, or websites without prior approval. Unauthorized promotions undermine the community's integrity and will be removed.\n\n**Effort & Formatting Guidelines**  \n- Posts with insufficient details may be removed under the 'low effort' rule. Have you provided enough information for meaningful responses?  \n- Clearly format your post with paragraphs for readability.\n\n**Request Approval**  \nOnce you've reviewed these guidelines, checked your flair, and proofread your post, request approval via this [link](https://www.reddit.com/message/compose/?to=/r/Business_Ideas&subject=Approval&message=/r/Business_Ideas/comments/1r84c41/zero_money_zero_network_zero_stability_how_do_i/).\n\nAdhering to these guidelines will increase your submission’s chances of approval and community engagement.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Business_Ideas) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-18 14:24:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o65krlk",
          "author": "springcaterpillar",
          "text": "dy a real skill. the problem isn't that you lack ability, it's that you're trying to go from zero revenue to a full business in one step. pick one SaaS idea, build an MVP in a weekend, put it on Product Hunt or an indie hacker community, and see if anyone cares. the marketing doesn't have to cost money, it just has to be specific. who exactly has the problem you're solving?",
          "score": 1,
          "created_utc": "2026-02-19 00:15:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o69danh",
              "author": "Realistic_Edge_2267",
              "text": "Can u explain me more in dm",
              "score": 1,
              "created_utc": "2026-02-19 15:58:51",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o65r4q3",
          "author": "arrigus",
          "text": "This is not exactly business advice as I'm still making 0 profit from this, but since you are considering SaaS, I'm assuming you have some development experience or skills, so one very low budget option is static websites. I have very limited budget and zero network like you, so I'm currently trying to go with static websites now.\n\nSome of the advantages are:\n\n\\- They are much cheaper than full stack SaaS. It depends on your hosting provider, but you might end up paying just for your domain, which can be 10 to 30 dollars a year.\n\n\\- They are also much more secure than full stack SaaS, since they have no backend and expose less surface for potential attacks.\n\n\\- They are much easier to build than full stack SaaS. Since they have no backend, you are basically building only the frontend, with no databases to integrate, no user authentication or authorization, no complex (and potentially expensive) backend logic, etc.\n\nSome of the downsides are:\n\n\\- They may be less profitable than SaaS, because you usually have fewer monetization options\n\n\\- Huge competition: since static sites are relatively easier to build, the barrier to entry into this kind of business is very low\n\n\\- Less flexibility: with a static site, you basically have a frontend-only website, so what you can offer is limited to what a frontend-only website can do. For your reference, blogs, product reviews, courses, mini-games, news articles, online portfolios and advertising for existing businesses are the typical applications of static websites.\n\n\\- AI can potentially kill your business. A lot of people today just search through AI models, they don't visit websites directly, so this may kill your traffic. There are options for charging AIs to use your content, but this is still a huge risk.\n\nMarketing is always hard, not only for static websites. SEO is basically free ads for your site, it gives you a big help, but it's extremely hard to get to the top search results, so I would consider social media and active advertisement as well. Not necessarily paid advertisement. For example, you can try to find groups or communities online that are having an issue that your website can solve, and you can offer to give them a hand. It's not easy, but that's an option.\n\nIf you have no ideas for building your own website, you can also build websites for clients. Maybe try freelancing or look for local businesses who may need one (maybe not necessarily a new one, they may also need to improve the website they already have), but in this case you have to first become more familiar with the technology, because businesses may be less forgiving on your mistakes.\n\nOnce again, don't take this as business advice. I've launched two static websites last year, and I haven't earned a single dollar yet, so this may as well be guaranteed failure. But I'm seeing an increase in traffic to my websites, so I thought of suggesting this to you.",
          "score": 1,
          "created_utc": "2026-02-19 00:51:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o69d50z",
              "author": "Realistic_Edge_2267",
              "text": "Thank you for advice",
              "score": 1,
              "created_utc": "2026-02-19 15:58:05",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o6e3qox",
              "author": "smarkman19",
              "text": "Static sites are a solid call, but I’d narrow it even more: pick one tiny problem and build a stupidly focused site around it, not a “blog” or “resources hub.” Single problem, single audience, single action.\n\nA few things that helped me:\n\n1) Ship fast using a basic stack like Astro or just plain HTML + Tailwind. Don’t over-engineer, just get something live in a day or two.\n\n2) Treat each page as a landing page, not an article. Clear pain, clear outcome, one CTA (email form, lead magnet, calculator, etc.). Static doesn’t mean passive.\n\n3) For “free” marketing, I use Ahrefs Webmaster Tools for basic SEO checks, Google Search Console to see what I’m actually ranking for, and Pulse for Reddit in the background to surface threads where people are already asking about the exact problem my page solves so I can jump in naturally.\n\nPoint is: keep the tech simple, obsess over one tiny use case, and use communities + search data to guide what you build next.",
              "score": 1,
              "created_utc": "2026-02-20 08:51:52",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6fhwwc",
          "author": "OpsGuy82",
          "text": "This might be a controversial opinion but it sounds to me like you are a good fit for an owner/operator franchise model. Something like Junk King can give you processes to follow, support in execution and practically eliminate many areas that you find difficult. My tip would not be to buy directly from the franchisor, but see if you can buy from someone who thought they could be an absentee owner and is selling their equipment and franchise for under $100k. I think a lot of investors bought these models only to realize there is not enough margin for absentee ownership and are selling on the cheap. I have no affiliation with junk king but I am very familiar with the industry. ",
          "score": 1,
          "created_utc": "2026-02-20 14:48:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6fsnot",
          "author": "0xAdr7",
          "text": "Look into the services that you willing to pay monthly, then copy it and build it with AI. Sell it with cheaper subscriptions fee",
          "score": 1,
          "created_utc": "2026-02-20 15:40:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ft4e0",
          "author": "Relevant-Solid-784",
          "text": "Here is what I would do, you seem good at building but need good mentors for operations. Build what you know and iterate on it. Most businesses fail because the person doesn’t seem reaction fast enough, maybe sit down and go through and evaluate why these ideas didn’t take off",
          "score": 1,
          "created_utc": "2026-02-20 15:42:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6478gc",
          "author": "Physical_Carrot_6283",
          "text": "1996 a guy wanted to open a restaurant that only sold chicken fingers.  He couldn’t find any investors.  He took a job as an Alaskan Fisherman and saved his money.  Now we have Rasing Cane’s",
          "score": 0,
          "created_utc": "2026-02-18 20:12:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o69dcjt",
              "author": "Realistic_Edge_2267",
              "text": "Thank you for an amazing story",
              "score": 1,
              "created_utc": "2026-02-19 15:59:07",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r54uji",
      "title": "Sanity-check my idea: Using healthy seniors as trained caregivers for daycare.",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1r54uji/sanitycheck_my_idea_using_healthy_seniors_as/",
      "author": "Odd_Departure_1159",
      "created_utc": "2026-02-15 04:01:25",
      "score": 8,
      "num_comments": 22,
      "upvote_ratio": 0.9,
      "text": "Hi everyone,\n\nI’m looking for brutally honest feedback on a startup idea I’ve been thinking about for some time. I’m not trying to pitch I genuinely want to stress-test this and understand where it can fail.The problem I see\n\nIndia is heading toward a retirement / old-age crisis:\n\nA large percentage of Indians work in the informal sector\n\nMany will reach 60 without meaningful retirementsavings or pensions.At the same time, more women are entering the workforce, increasing demand fchildcare.So we have two growing needs:\n\n1.Elderly people who need income, purpose, and care\n\n2.Working parents who need reliable childcare\n\nThe core idea at high level is \n\nCreate an intergenerational care model:\n\nHealthy seniors (60+, able to walk, talk, interact, and handle children)\n\nTrained for \\~1 year in a structured pedagogy for early childhood care\n\nThen employed inside a combined old-age home + daycare center\n\ntgere are many possible verticals like one to one care ,hospital integration peadgogy design\n\nSeniors gain income + dignity + purpose\n\nParents get lower-cost childcare\n\nChildren get more attention than typical overcrowded daycares\n\nWhere I want your help:\n\nWhat are the biggest problems in business model you see or any legal landmines i can face ",
      "is_original_content": false,
      "link_flair_text": "Idea Feedback",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1r54uji/sanitycheck_my_idea_using_healthy_seniors_as/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o5gn3p0",
          "author": "Tr1pp_",
          "text": "Diseases perhaps? Kids are terrible at spreading diseases and elders are more fragile",
          "score": 3,
          "created_utc": "2026-02-15 05:21:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5gnl9f",
              "author": "Odd_Departure_1159",
              "text": "Hospitals antibiotics",
              "score": -1,
              "created_utc": "2026-02-15 05:25:09",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5hfm8b",
          "author": "kunalkhatri12",
          "text": "Mixing seniors and toddlers is a beautiful idea but you are essentially running a nursing home and a nursery at the same time which is a legal nightmare. \n\nYour biggest risk is a physical one because if a senior has a sudden health issue while holding a baby or if a fast toddler causes an elderly person to fall your brand will collapse overnight. \nParents in India love the idea of Grandparent Wisdom but they will stop trusting you the moment they feel the caregiver isn't agile enough to handle an emergency. \n\nTo make this work you should hire younger staff for the heavy lifting and safety while letting the seniors focus entirely on storytelling and emotional bonding.",
          "score": 3,
          "created_utc": "2026-02-15 09:48:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ggw8r",
          "author": "Glum-Yak8422",
          "text": "Your biggest problem could be seniors energy levels versus young kids.), especially seniors over 70. Another issue could be pulling those seniors from their grandkids. So do their grandkids get discounted or free day care?",
          "score": 2,
          "created_utc": "2026-02-15 04:32:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5gich1",
              "author": "Odd_Departure_1159",
              "text": "It could be added ,same problem my mom stated i am thinking a way around because for validating i need money which i do not have",
              "score": 1,
              "created_utc": "2026-02-15 04:43:43",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o5gnolv",
              "author": "Odd_Departure_1159",
              "text": "Could give only funvtional old people chance to do day care those who cannot will be charged anyways",
              "score": 1,
              "created_utc": "2026-02-15 05:25:54",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5h2xcl",
          "author": "PaleontologistNo6995",
          "text": "I'm not sure about the laws where you are but I'd definitely recommend background checks and shorter schedules for retirees. This could be an interesting return to work program for seniors.\n\nI've managed people in the childcare industry, and now I'm a working parent so I've got a good pulse on the area. Having good management, the right physical space to host it at and training will go a long way.\n\nI think your heart is in the right place which is huge and it could help a lot of people, which is great. Keep us posted.",
          "score": 2,
          "created_utc": "2026-02-15 07:44:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5hc7j6",
              "author": "Odd_Departure_1159",
              "text": "Because of your experience in this  Do people see problem if older person take care of their child the plan is to train them some certification in child care.",
              "score": 1,
              "created_utc": "2026-02-15 09:14:37",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5qp8mt",
                  "author": "PaleontologistNo6995",
                  "text": "I think it should be a mix of ages caring for the kids for a lot of different reasons but thats just my opinion. Probably a good idea to talk with parents in your are and see what they think and how they'd feel about the way you're positioning it. \n\nThere's a definitely a way to do this that would support the community. We have grandparents that watch our kids but after a few hours the grandparents are exhausted and need a break.\n\nKids also appreciate consistency, so if you had a few people (managers, supervisors) \"run the show\" so to speak and have older generations come in and out it could be pretty cool, they could teach things like cooking, making lemonade and passing down some old stories. Start small, expand what works, change what doesn't. Seems cool though, keep us updated",
                  "score": 1,
                  "created_utc": "2026-02-16 19:58:12",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5heouy",
          "author": "ChestChance6126",
          "text": "The idea has emotional appeal, but childcare is a zero margin for error business. Liability, health screening, and parent trust will make or break this. I’d test small first. Prove safety, consistency, and unit economics before building full facilities. The ops complexity is the real risk here.",
          "score": 2,
          "created_utc": "2026-02-15 09:39:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5hgggl",
          "author": "HalfwaydonewithEarth",
          "text": "Old people are often grouchy and agitated or annoyed by loud kids. \n\nThey pay extra to not be around them and travel in First Class.\n\nWhat they do in the USA is Adult Daycare.\n\nSo basically a van picks up the old people and drops them off. The family can work jobs this way. The family only needs to give them a bath, dinner, and bedtime. \n\nAll of the stuff is done at the daycare. The old people sit in chairs, couches, take naps, play cards, watch TV, exercise, hair done, and breakfast lunch. \n\nThe family can also drop off and pick up if the van is too expensive.",
          "score": 2,
          "created_utc": "2026-02-15 09:56:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5gwdtc",
          "author": "GenZedsMother",
          "text": "I think it’s an excellent idea. Obviously seniors who require a high level of medical care, would go to a nursing home. if they are unable to care for children, even with support staff. \n\nI’m imagining an amazing retirement village / early childhood facility with working gardens producing food, art and music!",
          "score": 1,
          "created_utc": "2026-02-15 06:42:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5h0hfm",
              "author": "Odd_Departure_1159",
              "text": "Yes plus they get at lesser cost ( if done right even 0 )if someone is unwilling to or cannot participate in child care he can pay to avail same facilities .",
              "score": 1,
              "created_utc": "2026-02-15 07:21:01",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5hdbwj",
          "author": "DuckDuckSeagull",
          "text": "Assuming they're subject to background checks, training, and assessments to ensure they're not clinging to old fashioned childcare ideas... my main concerns would be physical fitness and disease.\n\nElder care centers and daycares are both notorious for spreading disease.  Both populations have weakened immune systems. If you co-locate the daycare with the residential facility you won't have a lot of easy ways to quarantine and clean if there's something like a viral outbreak.\n\nThen there's fitness. Is it difficult for people 60+ to get a job if they're fit and healthy enough to work in childcare - which is very physically demanding? Or are you going to largely get a population of people who *can't* find other employment.\n\nI'd probably look at a model where you have a traditional caretaker (whatever that looks like), working a normal shift and **supplemented** by elderly aides. The aides could rotate in with shorter shifts and lower frequency. Since they would be supervised, you could get away with lower training requirements.\n\nBecause the other issue I think you'll have is cost. Training people for a year is going to be expensive. What if they don't make it through the training? What if they do and then immediately decide the work is too difficult? Childcare is already an expensive business.",
          "score": 1,
          "created_utc": "2026-02-15 09:25:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5hdkgy",
              "author": "Odd_Departure_1159",
              "text": "🤌🤌so very difficult to crack",
              "score": 1,
              "created_utc": "2026-02-15 09:28:04",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o5kn0gd",
              "author": "Marina_Westbrook",
              "text": " You make some solid points about the potential for disease spread and physical demands. I remember working in a daycare where we had to juggle so many illnesses going around. It's definitely tricky to balance a fit workforce with older aides. Maybe a tiered approach could help ease those costs? Shorter shifts could keep the energy high and the training manageable. Plus, having a mix might help with those tough physical demands you mentioned!",
              "score": 1,
              "created_utc": "2026-02-15 21:06:43",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o5qthb5",
              "author": "AlenyoMasharin",
              "text": " You raise some valid points about the potential difficulties that could arise, especially with physical fitness and disease spread among both the elderly and children. It's crucial to ensure that there's a robust training program and clear health protocols in place, considering the high demand for reliable childcare. Balancing cost and effective training will definitely be a challenge. Your suggestion of integrating traditional caretakers with elderly aides sounds like a smart way to mitigate some risks.",
              "score": 1,
              "created_utc": "2026-02-16 20:18:58",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5iph4o",
          "author": "Appropriate-Bar6993",
          "text": "Old people who want to do this already do this.",
          "score": 1,
          "created_utc": "2026-02-15 15:22:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5l8z3s",
          "author": "bornonOU_Texas_wknd",
          "text": "Children get sick in group settings - a lot.  Caregivers get sick in group set tings - a lot.",
          "score": 1,
          "created_utc": "2026-02-15 23:02:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5uwbfx",
          "author": "Dry_Studio_2114",
          "text": "Kids have lots of energy. Seniors do not. Child care is physically & emotionally draining. Many seniors are not patient or may utilize corporal punishment-- which is frowned on today. You will have a hard time finding \"healthy\" seniors. It would be very difficult even for a \"healthy\"  senior to care for a large group of children on a daily basis. If a senior has a medical emergency in front of the children that would be very traumatic for the kids.",
          "score": 1,
          "created_utc": "2026-02-17 12:54:24",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r6gucr",
      "title": "Does business setup complexity kill your motivation to test ideas?",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1r6gucr/does_business_setup_complexity_kill_your/",
      "author": "funkopopruler",
      "created_utc": "2026-02-16 18:01:34",
      "score": 8,
      "num_comments": 15,
      "upvote_ratio": 1.0,
      "text": "I am validating a few business ideas right now and one thing that keeps holding me back is the setup and ongoing requirements. The idea itself feels simple but the thought of incorporation, taxes, compliance, and all the legal stuff makes me hesitate. It feels like a big mental barrier before even testing the market. I am curious if others feel this friction early on or if I am overthinking it?",
      "is_original_content": false,
      "link_flair_text": "App/Website Idea",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1r6gucr/does_business_setup_complexity_kill_your/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o5q21ip",
          "author": "ogold45",
          "text": "Overthinking. Test first then if it’s working set everything up.",
          "score": 1,
          "created_utc": "2026-02-16 18:09:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5qmp2c",
              "author": "funkopopruler",
              "text": "Noted!",
              "score": 1,
              "created_utc": "2026-02-16 19:45:50",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5q5a91",
          "author": "BizUpUSA",
          "text": "You’re definitely not overthinking it, that mental barrier is real for a lot of people. The admin side can feel heavier than the actual idea sometimes.\n\nWhat helped most of the business was separating “testing” from “formalizing.” You don’t need to incorporate to validate demand — you can test interest, talk to users, even get first customers before worrying about structure.\n\nOnce there’s real signal, the paperwork feels way less intimidating because you know it’s worth it.",
          "score": 1,
          "created_utc": "2026-02-16 18:24:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5qmnrm",
              "author": "funkopopruler",
              "text": "Very helpful!",
              "score": 1,
              "created_utc": "2026-02-16 19:45:40",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5q81wz",
          "author": "Bisqwa",
          "text": "Test first, incorporate later. But when you're ready to formalize, nowadays there are services that handles the whole mess (LLC, EIN, banking), so i wouldn't worry about that just yet ",
          "score": 1,
          "created_utc": "2026-02-16 18:36:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5qmkgx",
              "author": "funkopopruler",
              "text": "Cool, thanks!",
              "score": 1,
              "created_utc": "2026-02-16 19:45:13",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5qkqnt",
          "author": "zenbusinesscommunity",
          "text": "You don't need to incorporate right away, so it's worth testing with a few early customers first and formalizing once there's traction. That said, if you're taking payments or have liability exposure, setting up an LLC is straightforward and gives you protection. The tax and compliance pieces usually aren't as bad as they seem once you're actually dealing with them, but don't hesitate to loop in a CPA or a service to help handle those tasks for you to keep it off your plate.",
          "score": 1,
          "created_utc": "2026-02-16 19:36:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5qmfzc",
              "author": "funkopopruler",
              "text": "Noted!",
              "score": 1,
              "created_utc": "2026-02-16 19:44:37",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5t4l7r",
          "author": "indexintuition",
          "text": "yes, that mental barrier is very real. i used to stall out before even testing an idea because my brain would jump straight to incorporation, bookkeeping, taxes, all of it, and it made something small feel huge. what helped me was separating testing from building a full business. i started validating ideas in the simplest way possible first, sometimes just a basic landing page or a small paid beta, before worrying about formal structures. once there is actual traction, the admin stuff feels more worth the effort. you are not overthinking, but you might be trying to solve step ten before step one.",
          "score": 1,
          "created_utc": "2026-02-17 04:02:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6895g1",
              "author": "funkopopruler",
              "text": "Relatable",
              "score": 1,
              "created_utc": "2026-02-19 12:11:57",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5vam2c",
          "author": "chadvavra",
          "text": "It did, but once I did it for the first time I realized it's not that hard and there are a ton of almost free tools to support you.  In fact, Claude is pretty good at creating/filling out documents.  I wouldn't trust it to do my taxes, but it was pretty great at a provisional patent filing.",
          "score": 1,
          "created_utc": "2026-02-17 14:16:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6896x0",
              "author": "funkopopruler",
              "text": "Wow, interesting",
              "score": 1,
              "created_utc": "2026-02-19 12:12:14",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5ycjjg",
          "author": "dont_mess_with_tx",
          "text": "That's why I consider myself a libertarian. We can't punish small businesses with all this burden.",
          "score": 1,
          "created_utc": "2026-02-17 23:10:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o65ttrn",
          "author": "springcaterpillar",
          "text": "t with the simplest possible version, even just a landing page and some paid ads to see if people click. you don't need an LLC, an accountant, or compliance figured out until you've confirmed someone will actually pay for the thing. most of the admin stuff takes a few days once you actually need it.",
          "score": 1,
          "created_utc": "2026-02-19 01:06:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o691ck8",
          "author": "techside_notes",
          "text": "Absolutely. I’ve felt the same friction when the setup feels bigger than the idea itself. For me, the mental load of worrying about compliance or tools often blocked the actual testing.\n\nWhat helped was separating the idea from the formalities, sketch it, validate it with a tiny experiment, even manually if needed, before touching any legal or tech setup. That way, you know whether it’s worth investing energy into the formal side at all.",
          "score": 1,
          "created_utc": "2026-02-19 14:59:08",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r7lxrr",
      "title": "Okay so I started something without realizing it",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1r7lxrr/okay_so_i_started_something_without_realizing_it/",
      "author": "Commercial-Week-6558",
      "created_utc": "2026-02-17 23:06:50",
      "score": 7,
      "num_comments": 1,
      "upvote_ratio": 0.9,
      "text": "I’m an eu citizen but I also have a duel citizen from a third world country I know how both market works and how things work basically on all factors . One day my father called me wanting to buy a car from eu and import it to the set country once we did that I realized that there is a huge gap in supply for cars in that region with huge markups that reaches to pretty much 2x in luxury vehicles \n\nObviously started slow and don’t want to export cars from my eu country because once I did the market research I found out that Chinese cars are way cheaper to export and higher in the markup imported two with documentations and everything and ended up making 70% on my money in around three months ( the length of shipping the cars from china) now I’m kind of stuck if and want to know if I should scale up start an import export company what’s the right move here ",
      "is_original_content": false,
      "link_flair_text": "Idea Feedback",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1r7lxrr/okay_so_i_started_something_without_realizing_it/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o604m30",
          "author": "JacobAldridge",
          "text": "I see two options, call it “more risk more money”.\n\n**Option 1: Import Business**\n\nYou buy the cars, move them, sell them on the ground in your home country.\n\nPros:\n\n* Control the process\n\n* People will pay more for a car they can touch, test, and buy today\n\nCons:\n\n* Cash is tied up in the time on boats\n\n* Export and Import licensing\n\n* Car dealership rules in your home country may limit how much you can sell a year\n\n**Option 2: Brokering / Sourcing Business**\n\nInstead of charging the full mark-up, you charge a fee to help people in your home country buy a car directly.\n\nYou can still bundle the money so your margin is hidden.\n\nPros:\n\n* Less capital tied up, so may be able to scale faster\n\n* May be less regulated since you never buy or sell a car yourself\n\nCons:\n\n* Harder to explain, and buyers have to trust you\n\n* May have less margin\n\nEither way, sounds like it’s worth pursuing!",
          "score": 1,
          "created_utc": "2026-02-18 05:20:38",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r7b85w",
      "title": "Feedback please",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1r7b85w/feedback_please/",
      "author": "aclgetmoney",
      "created_utc": "2026-02-17 16:43:10",
      "score": 5,
      "num_comments": 11,
      "upvote_ratio": 0.86,
      "text": "I’ve posted about this in the past and would like some feedback on the idea. \n\nI’d like to build something in the senior space and I began with the idea of aging in place home modifications. Until I realized I’m not a blue collar type of guy lol. \n\nNow I’m debating on building something online that may support this space. \n\nI guess I’m either looking for someone who has explored this or is planning on it. Just some feedback on if this is a good path to explore or not. \n\nThe silver tsunami is here and there’s plenty of\n\nOpportunity. Especially for those who care enough to see seniors get taken care of the RIGHT way. \n\nRight now the industry is fragmented and it feels like a meat market unfortunately. \n\nI appreciate the time! ",
      "is_original_content": false,
      "link_flair_text": "Idea Feedback",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1r7b85w/feedback_please/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o5w7q85",
          "author": "f1zombie",
          "text": "I did a lot of thinking in the space. Unfortunately, most of the opportunity lies in infrastructure, processes and people. \n\nThat being said, I wonder if there's something that helps keep seniors busy and with a sense of purpose. Maybe mentoring, friend networks, etc.?",
          "score": 2,
          "created_utc": "2026-02-17 17:03:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5wi2vk",
              "author": "aclgetmoney",
              "text": "Shoot me a DM",
              "score": 1,
              "created_utc": "2026-02-17 17:53:41",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o6eppko",
              "author": "simpson_5haze",
              "text": " Totalmente de acuerdo, mantener a los abuelos ocupados y con propósito es clave. He leído que las actividades como mentorías pueden ser muy enriquecedoras. Tal vez podrías explorar algo en línea que conecte a las personas mayores con jóvenes para compartir experiencias, sería un win-win, ¿no?",
              "score": 1,
              "created_utc": "2026-02-20 12:04:14",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5wpody",
          "author": "Khushboo1324",
          "text": "I actually like this idea ,senior care is one of those areas where families feel stressed and unsure who to trust. If I were you, I’d start super focused. Solve one specific headache really well instead of trying to cover the whole space from day one. If you can make one part of the process feel simpler or safer for families, that alone could be valuable.",
          "score": 2,
          "created_utc": "2026-02-17 18:28:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5wwd85",
              "author": "aclgetmoney",
              "text": "Thank you. I appreciate the advice.",
              "score": 2,
              "created_utc": "2026-02-17 18:59:00",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5x1piz",
          "author": "UpsetMarsupial",
          "text": "What country or region are you looking at ?",
          "score": 2,
          "created_utc": "2026-02-17 19:24:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5xaiqm",
              "author": "aclgetmoney",
              "text": "I’m in the US",
              "score": 1,
              "created_utc": "2026-02-17 20:05:33",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5yd232",
          "author": "Spirited_Radio9804",
          "text": "Sell it before 2036 demographics tell the story!",
          "score": 2,
          "created_utc": "2026-02-17 23:13:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5ymcxw",
              "author": "aclgetmoney",
              "text": "Why’s that?",
              "score": 1,
              "created_utc": "2026-02-18 00:04:55",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5ym7mn",
          "author": "sum-9",
          "text": "You haven’t actually put forward an idea?",
          "score": 2,
          "created_utc": "2026-02-18 00:04:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5ymk9b",
              "author": "aclgetmoney",
              "text": "Idea isn’t quite clear I guess. Just more looking for thoughts of the space and if anyone has built something in the industry.",
              "score": 1,
              "created_utc": "2026-02-18 00:06:03",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r6xg6c",
      "title": "Slow transitions",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1r6xg6c/slow_transitions/",
      "author": "Derp0189",
      "created_utc": "2026-02-17 05:24:53",
      "score": 5,
      "num_comments": 1,
      "upvote_ratio": 1.0,
      "text": "I work full time and want to transition to business owner slowly over ~5 years and then leave current job completely.\n\nMany ideas about getting started are centered around putting in lots of hours at the beginning.  I understand that's like 90% of businesses, but kinda interested in that 10% that can realistically be a part time thing at the beginning and can scale up later.\n\nI have lots of low level skills but no specific, targeted expertise.  Plenty of overhead $$ to start, but limited on time availability.",
      "is_original_content": false,
      "link_flair_text": "Idea Feedback",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1r6xg6c/slow_transitions/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": []
    },
    {
      "id": "1r4mgau",
      "title": "A Noise-Audit Company",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1r4mgau/a_noiseaudit_company/",
      "author": "MelloLikesJello",
      "created_utc": "2026-02-14 14:47:48",
      "score": 4,
      "num_comments": 0,
      "upvote_ratio": 1.0,
      "text": "A retail/cafe/restaurant/workspace focused audit and certification company that monitors and proposes corrections for the noise levels in the premises. I’m toying with the idea- but I need some unbiased POVs. Help :)",
      "is_original_content": false,
      "link_flair_text": "Idea Feedback",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1r4mgau/a_noiseaudit_company/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": []
    },
    {
      "id": "1r7qvm4",
      "title": "A way to quantify Hazards, toxins, bad habits, pollution, and carcinogens",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1r7qvm4/a_way_to_quantify_hazards_toxins_bad_habits/",
      "author": "HalfwaydonewithEarth",
      "created_utc": "2026-02-18 02:36:31",
      "score": 4,
      "num_comments": 6,
      "upvote_ratio": 0.75,
      "text": "I am not doing this but thought it would be interesting to have a gradation on disappointing things so I can make a choice. \n\nThe business owner could make money by making entities test and certify the way food nutrition works. \n\nSo I want to know what is worse at several points during the day:\n\nThe carcinogen from bacon or the nonstick pan it is cooked in?\n\nThe artificial sweetener from a Coke Zero or the microplastic from the bottle?\n\nWould beer causing gout and diabetes be worse or sunbathing in uv rays with no sunscreen?\n\nWhat is my damage score if I jog in polluted air, or  drink flourinated tap water?\n\nAre WiFi emf radio signals when I am sleeping near my cell phone worse or the Glyphosate gluten crossiant made with butter from a cow that was injected?\n\nA massive study was done that hot coffee was terrible for the heat on the esophagus daily and wears down the silica. I want to know each temperature.\n\nIs short sleep worse or Red Bull worse? Now studies are coming out energy drinks destroy kidneys. \n\nFried food is suppose to be hexane heavy a neurotoxin... \n\nWhat is worse French Fries or blue light destroying our eyes on cell phones?\n\nSo if there was some type of gradation that would be awesome.\n\n",
      "is_original_content": false,
      "link_flair_text": "A How-To Guide that no one asked for",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1r7qvm4/a_way_to_quantify_hazards_toxins_bad_habits/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o5zo390",
          "author": "TangerineSeparate431",
          "text": "So this business would be like an insurance company or an analytical testing facility? \n\n\nAll of the things mentioned above have been studied to various amounts and a cursory AI web search could give you these answers. I don't know how this would be profitable or marketable. ",
          "score": 1,
          "created_utc": "2026-02-18 03:30:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5zsitl",
              "author": "HalfwaydonewithEarth",
              "text": "I want to know the intensity of the damage. What if some of this is negligible?\n\nWhat if some of it is massively toxic.\n\nIt could be like a database score like calorie counting.\n\nThey use to have smog days telling us when it is unsafe to run outside.",
              "score": 1,
              "created_utc": "2026-02-18 03:57:48",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o60fqld",
                  "author": "robots-in-disguise",
                  "text": "What you're describing is essentially a risk mitigation ai that can give you real time feedback about the risks of what you're doing.",
                  "score": 2,
                  "created_utc": "2026-02-18 06:50:51",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o61lok5",
          "author": "ChestChance6126",
          "text": "The big issue is you’re mixing very different risk types into one bucket. Chronic, high dose exposures like air pollution, heavy drinking, smoking, and UV have strong outcome data. A lot of the other stuff people worry about is either low dose, poorly quantified, or highly context dependent. If you built anything, it would need to normalize to something concrete, like adding lifetime risk per 100k people, with clear assumptions. Otherwise, the “score” would feel scientific but be mostly vibes.",
          "score": 1,
          "created_utc": "2026-02-18 12:47:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o65tp4k",
          "author": "springcaterpillar",
          "text": "individual genetics, and combination effects all matter. comparing bacon carcinogens to nonstick pan fumes is like comparing a paper cut to a sunburn, they're both \"damage\" but the mechanisms and severity aren't on the same axis. an app like this would need to be extremely careful about oversimplifying or people would make worse decisions thinking they're optimizing.",
          "score": 1,
          "created_utc": "2026-02-19 01:05:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o66bilg",
              "author": "HalfwaydonewithEarth",
              "text": "Ok so its a bad idea?\n\nI thought maybe everything could be on a Range from 1-100",
              "score": 1,
              "created_utc": "2026-02-19 02:49:42",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r94ty6",
      "title": "How can I monetize my sub forum?",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1r94ty6/how_can_i_monetize_my_sub_forum/",
      "author": "NickyB808",
      "created_utc": "2026-02-19 17:06:53",
      "score": 4,
      "num_comments": 1,
      "upvote_ratio": 1.0,
      "text": "I currently have an Ai and business based sub forum called aisolobusinesses on Reddit. I have built myself up to 5k followers and 8.8k visitors per week. I feel like I’m starting to make some good traction, but my biggest question coming up is going to be how to monetize. I have thought about doing affiliate marketing with Ai tools and writing my own ebook, but what do you think I should do to start monetizing? ",
      "is_original_content": false,
      "link_flair_text": "Idea Feedback",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1r94ty6/how_can_i_monetize_my_sub_forum/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o6akmk7",
          "author": "Drumroll-PH",
          "text": "5k followers is real traction. I’d start simple. Test affiliate links for tools you actually use, then validate demand by asking your audience what they struggle with before writing an ebook.\n\n",
          "score": 3,
          "created_utc": "2026-02-19 19:24:55",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r5ibdq",
      "title": "Need advice on registering an LLC in Ohio",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1r5ibdq/need_advice_on_registering_an_llc_in_ohio/",
      "author": "Main-suspect12",
      "created_utc": "2026-02-15 16:06:10",
      "score": 3,
      "num_comments": 7,
      "upvote_ratio": 0.67,
      "text": "My husband and I are finally pulling the trigger on starting a business where he’ll be providing a specialized service (specialized refrigeration repair). He is extremely knowledgeable in his area, and honestly, with how many people have been asking for his help lately, I think he’s going to be really successful.\n\nMy question is about the paperwork side of things. We are in the process of getting the LLC through the Ohio Secretary of State (using the Ohio Business Central site). After we get the Articles of Organization back and the $99 is paid... do we just… start? Can he just start taking customers and invoicing them?\n\nI’m planning on heading to the Huntington or Chase branch down the street to get a business bank account once the filing is approved, but I feel like we are missing a step somewhere.\n\nA few specific things I’m worried about. Should I put myself as the Statutory agent for this, but do I need to do anything else for it? Vendor's License**,** since he’s doing a service, do we need one of these from the county auditor?\n\nI just want to make sure we don't get six months down the road and realize we’re \"illegal\" or something because we missed a random filing. Any Ohio small business owners have a checklist of what they did right after the SOS approval?",
      "is_original_content": false,
      "link_flair_text": "Marketing / Operational / Financial / Regularotry Advice sought",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1r5ibdq/need_advice_on_registering_an_llc_in_ohio/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o5j05h1",
          "author": "Sensitive-Path-4807",
          "text": "DM. we are Agence from Montana, we can register your LLC in US wirh EIN und Busniess Bank account just fo 90$ [https://double-click-agnce.online/](https://double-click-agnce.online/) \n\n",
          "score": 1,
          "created_utc": "2026-02-15 16:15:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5j90sv",
          "author": "gptbuilder_marc",
          "text": "Honestly the part where you said “just start” is where people get tripped up.\n\nIn Ohio the LLC filing feels like the finish line, but it’s really just the first checkbox. The vendor license especially depends on whether he’s reselling parts during refrigeration repairs or strictly billing labor. That one detail flips the tax setup pretty fast.\n\nIs he planning to include parts on invoices or keeping it service-only at first?",
          "score": 1,
          "created_utc": "2026-02-15 16:57:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5lcno7",
          "author": "NorthCoast30",
          "text": "Some services are required to pay sales tax and some aren’t. You can check with the state (and likely check online) if that applies to his business type. If you are you need a vendors license which you can apply for online.\n\nYou can put yourself as agent or pay for a registered agent. Primarily they’re looking for someone with a physical presence in the state that can receive legal service during business hours.\n\nThere are additional things like if he has employees, will he needs workers comp? Other business insurance? Etc.\n\nBut generally no, there is no one that is going to tell you you’re ready to start.",
          "score": 1,
          "created_utc": "2026-02-15 23:23:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5mzt0f",
          "author": "egogceo",
          "text": "Register with the state, get your EIN from the [IRS.gov](http://IRS.gov) website, and get an LLC operating agreement and you are good.  But yes you can start doing what you're doing.  Go get the bank account and run everything through it.  Just don't forget to file your paperwork!",
          "score": 1,
          "created_utc": "2026-02-16 05:56:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o64e076",
          "author": "BusinessAnywhereio",
          "text": "Yes. Once Ohio approves your Articles of Organization, he can start taking customers and invoicing. Just knock out a few basics so you do not get blindsided later.\n\nQuick Ohio post approval checklist\n\n1. Get an EIN. Banks usually require it and it keeps your SSN off business paperwork.\n2. Operating agreement. Not filed with the state, but it helps with banking, taxes, and liability protection. Especially important if you both own the LLC.\n3. Open the business bank account and keep business income and expenses separate from personal.\n4. Statutory agent choice Being your own agent: your address can become public, you must be available during business hours, and if you miss a lawsuit notice or state letter you can lose good standing or get a default judgment. Service of process can also happen at your home or in front of customers. Professional agent: costs money each year and you still have to watch for notices, but it is usually more private and more reliable.\n5. Vendor’s license: mainly for collecting Ohio sales tax. Labor only services are often not taxed, but refrigeration repair usually involves parts. If you charge for parts, you likely need to collect and remit sales tax.\n6. Insurance and any trade credentials: general liability at minimum, plus commercial auto if he is driving to jobs.\n\nIf you want a simple walkthrough, this guide covers the steps: [How to Start an LLC in Ohio](https://businessanywhere.io/how-to-start-an-llc-in-ohio/). BusinessAnywhere sees people get tripped up most often on mixing funds, missing statutory agent mail, and sales tax on parts.",
          "score": 1,
          "created_utc": "2026-02-18 20:44:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6fspfr",
          "author": "dtsummery",
          "text": "You are definitely on the right track, but there are about three or four boring administrative steps you need to hit before you are officially bulletproof in the eyes of the state and the IRS.\n\n**1. The EIN (Federal Tax ID)** Do not go to the bank yet. You cannot open a business account at Huntington or Chase without an EIN from the IRS. It is free and takes ten minutes on the IRS website. Think of it as a social security number for the business. You will need the Articles of Organization from the SOS first to apply for it.\n\n**2. The Statutory Agent** You can absolutely be the agent. The only \"catch\" is that your home address becomes public record on the Secretary of State website. If you are fine with that, go for it. Just remember that if you move, you have to update that filing immediately or the state can technically dissolve your LLC.\n\n**3. The Vendor’s License** In Ohio, this is a big one. Even if he is just providing a \"service,\" refrigeration repair often involves parts (valves, refrigerant, etc.). If he bills for those parts, he is making a retail sale. You should get a **County Vendor’s License** through the Ohio Department of Taxation (usually $25). It allows you to collect sales tax and, more importantly, gives you a \"tax exempt\" certificate so he doesn't have to pay sales tax when he buys parts at the supply house.\n\n**4. Local Licensing and Insurance** Since he is doing specialized repair, check if your specific municipality requires a local trades license or a bond. More importantly, **get General Liability insurance immediately.** If he accidentally causes a leak or a fire in a commercial kitchen, you do not want that coming out of your personal bank account.",
          "score": 1,
          "created_utc": "2026-02-20 15:40:34",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r75g95",
      "title": "Mixing match-3 with falling obstacles. Does this mechanic make sense?",
      "subreddit": "Business_Ideas",
      "url": "https://i.redd.it/0fbd7qr8y0kg1.png",
      "author": "Recent_Jellyfish2190",
      "created_utc": "2026-02-17 13:03:56",
      "score": 3,
      "num_comments": 3,
      "upvote_ratio": 1.0,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "App/Website Idea",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1r75g95/mixing_match3_with_falling_obstacles_does_this/",
      "domain": "i.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "o5wq7ms",
          "author": "Khushboo1324",
          "text": "This actually looks pretty fun. I like the survival with the combo angle , the falling obstacles add pressure, which could make matches feel more meaningful instead of just casual swiping. Only thing I’d watch is cognitive overload. If too much is happening at once, it might feel stressful instead of satisfying. But as a twist on classic match-3, it definitely stands out. I’d try it.",
          "score": 1,
          "created_utc": "2026-02-17 18:30:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5wy9yk",
              "author": "Recent_Jellyfish2190",
              "text": "That’s a really important point, thanks for calling that out.\nI definitely don’t want it to become cognitively overwhelming. My idea is to introduce the survival/falling mechanic in short phases, maybe every 10–15 moves, rather than making it the dominant mechanic the whole time.\nRight now I’m mainly testing whether this survival twist works as a strong hook to grab attention, not necessarily as the core loop of the entire game.\nReally appreciate the feedback.",
              "score": 2,
              "created_utc": "2026-02-17 19:07:58",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5x05rx",
                  "author": "Khushboo1324",
                  "text": "That sounds like a smart way to test it.   \nIntroducing it in phases makes it feel like a spike of intensity instead of constant pressure ,which could actually make it more exciting. If you’re testing it as a hook, it might also be interesting to see how new players react in the first 2–3 minutes. If they “get it” quickly and feel clever instead of confused, you’re probably on the right track.\n\nExcited to see how it evolves.",
                  "score": 1,
                  "created_utc": "2026-02-17 19:16:54",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1r70aes",
      "title": "Starting up on my own",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1r70aes/starting_up_on_my_own/",
      "author": "Level-Pea-2172",
      "created_utc": "2026-02-17 08:08:57",
      "score": 3,
      "num_comments": 6,
      "upvote_ratio": 1.0,
      "text": "I need some advice and see if what others opinions are on this. For context I am based in UK. \n\nI have worked in a type of construction/maintenance industry for a while, which supplies B2B customers mainly. I know the products and suppliers really well but not the installation process which I am learning now in my current role. I am on 60k salary and company car + some other perks, but I cant shift the idea of starting on my own and sub contracting the work at first with eventually getting my staff/van to carry out the work whilst i focus on pricing/selling. \n\nI have had couple of side hustles in the past so I can build the website, marketing, sales, crm etc. My contract doesn’t mention anything about conflict of interest etc. but of course I will have to keep it on the quiet right until I start.\n\nI am in my 30s with a mortgage and 1 baby.\n\nQuestions- what are people opinions, thoughts? \n\nWhat should I look out for? Is it worth having your own business these days in UK? ",
      "is_original_content": false,
      "link_flair_text": "Idea Feedback",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1r70aes/starting_up_on_my_own/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o5wqwfw",
          "author": "Khushboo1324",
          "text": "Sounds like you’re doing the hardest part already , taking the first step. Starting on your own is scary, but it teaches you so much faster than waiting for the “perfect moment.” One thing that helped me (and others I know) is to pick one small thing you can ship this week , even if it feels tiny , just to build momentum.\n\nWhat’s one thing you can move forward with today?",
          "score": 1,
          "created_utc": "2026-02-17 18:34:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5wy4d5",
          "author": "NoNeedleworker8427",
          "text": "Sounds interesting, I’m in a similar boat. \n\nDo you mind if I ask what sector or the construction industry you’re in? HVAC? \n\nDrop me a message, would be great to combine ideas. \n\nI think it’s definitely worth having a business in the U.K.!",
          "score": 1,
          "created_utc": "2026-02-17 19:07:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5xdoa0",
          "author": "Infinite_Drive3182",
          "text": "Talk to an accountant about the correct tax structure for your business and how it will effect your personal tax. I work for a company but if you want I can sort out some basics.",
          "score": 1,
          "created_utc": "2026-02-17 20:20:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5xl9a0",
          "author": "Loose-Anxiety4319",
          "text": "imo it's always worth it. especially if you can't get it out your mind, then you should definitely give it a shot or else you'll always wonder 'what would've happened if you did'.\n\n  \nyou can beat a 60k salary pretty easily, if you break it down that's basically 5k/mo, that's can be 1 high paying client or 2 medium paying clients which you should be able to close in 3 months.\n\n  \npick a service based business that you know you'll be able to deliver, start on the side before quitting your job. build a website, polish your linkedin and start reaching out to companies who you can serve via linkedin and email (and x if you can). \n\n  \nonce you get the groove of things and start scheduling some intro / demo calls (shouldn't take longer than 1 month) you can consider quitting your job. \n\n  \nonce you close yoru first client you should feel confident enough about quitting your job (shouldn't take longer than 2 months for a total beginner, which you're not so you'll probably get there faster). \n\n  \nand then just repeat more of the same and get more clients. \n\n  \nat first i'd fulfill the service myself if i was you. get as high cash flow as possible, start scaling with outbound, optimise for cashflow so you feel comfy and once you're at around 10k/mo you can start hiring and delegating and all that stuff.\n\n  \nhope this helps.",
          "score": 1,
          "created_utc": "2026-02-17 20:56:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o67m5lt",
          "author": "reviewsthatstickteam",
          "text": "If you can’t shake the idea, that usually means something. £60k and a car is comfy, especially with a mortgage and a baby, but you’ve got solid industry knowledge which is half the battle. Just make sure you’ve got a decent runway saved up and properly check your contract before you do anything risky going out on your own is great, but it’s not as easy as Instagram makes it look.",
          "score": 1,
          "created_utc": "2026-02-19 08:44:57",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r89rkw",
      "title": "I want to network",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1r89rkw/i_want_to_network/",
      "author": "Disastrous-Jump2058",
      "created_utc": "2026-02-18 17:43:14",
      "score": 3,
      "num_comments": 6,
      "upvote_ratio": 1.0,
      "text": "I am looking to connect with people who are interested in tech, especially in building SaaS products.\n\nI’m a self-taught full-stack developer with several years of industry experience.\n\nRight now, I’m focused on creating small, fast-to-build micro-SaaS projects that generate consistent MRR, allowing me to dedicate more time to bigger ideas.\n\nI’m strong on the technical side, but marketing and getting investments are not my strengths, so I’m looking for people who excel in any of those areas.\n\nAlso if you are also someone who can bring funds, investments and clients, users that would be interesting.\n\nIdeally, I’d like to form a small team and build and launch SaaS nee projects together.\n\nI’m not selling anything and just hoping to connect with like-minded people who want to build together.\n\nIf this sounds interesting, feel free to reach out with comments or dm.\n\nI am ok with equity split or smaller equity with a minimal payment.\n\nBy the way, I also manage and participate a business group with about 26 members.\n\nFeel free to dm if anyone interested in joining the group. By the way, we might turn it to a business association as well in the future. If you can help with that, feel free to dm.\n\nPlease don't comment dm you because sometimes notifications don't arrive or can't read because of this app not working well for whatever reason.\n\nI also have my own company set up and have a few projects working.\n\nIf you have anything interesting you can offer, feel free to dm to network.",
      "is_original_content": false,
      "link_flair_text": "Business Partner Sought - Business has NOT been established",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1r89rkw/i_want_to_network/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o667zxu",
          "author": "VetPrepHelp",
          "text": "Solo non technical founder to VetPrep(dot)Help, a platform focused on veterans education, preparedness and organization of records before either filling on their own or meeting with professionals or the VA themselves for the VA Benefits.. Always open to networking and sharing ideas open with others",
          "score": 1,
          "created_utc": "2026-02-19 02:29:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o66r4s3",
              "author": "Disastrous-Jump2058",
              "text": "SUre les connect ",
              "score": 1,
              "created_utc": "2026-02-19 04:27:21",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o66s84k",
                  "author": "VetPrepHelp",
                  "text": "Looking forward to building and growing! Just messaged you back.",
                  "score": 1,
                  "created_utc": "2026-02-19 04:34:48",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6cqfj5",
          "author": "Traditional-Yam6118",
          "text": "Let’s connect. I have overall 10+ years of experience on these areas",
          "score": 1,
          "created_utc": "2026-02-20 02:26:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6epjig",
              "author": "Disastrous-Jump2058",
              "text": "cool lets connect",
              "score": 1,
              "created_utc": "2026-02-20 12:03:00",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r64ty6",
      "title": "A New Revolution for Mobile accessories shops",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1r64ty6/a_new_revolution_for_mobile_accessories_shops/",
      "author": "EarlyListen2398",
      "created_utc": "2026-02-16 09:07:34",
      "score": 3,
      "num_comments": 12,
      "upvote_ratio": 1.0,
      "text": "I want to build a standardized, system-driven mobile accessories and quick-service business that combines the trust of a physical shop with the convenience of same-day local delivery and home service. Instead of focusing on selling smartphones, I will center the business on high-demand accessories like covers, chargers, cables, screen guards, and camera lens protection—products people frequently need but usually buy from unorganized, inconsistent shops. Customers will be able to either walk into the store or order through a website or app for same-day delivery within a defined area. In addition, small but time-sensitive services such as screen guard replacement, camera lens replacement, minor fixes, and pickup-and-drop repairs can be booked as home services, making the business convenience-first rather than location-dependent.To focus on Retention a structured loyalty system will encourage repeat behavior: early visits will provide small, cost-controlled rewards, and completing the cycle will upgrade customers to a “Gold” status that offers priority handling, smoother service, and ongoing small privileges, shifting retention from discounts to relationship and trust. \n\nshare any advice if you have, help me to grow with your advice.",
      "is_original_content": false,
      "link_flair_text": "Idea Feedback",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1r64ty6/a_new_revolution_for_mobile_accessories_shops/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o5q40a5",
          "author": "pekingsnail",
          "text": "why the shops should cooperate with you?\nwhats the value added part?\ncost of marketing for bilateral business model？",
          "score": 1,
          "created_utc": "2026-02-16 18:18:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5q4er5",
              "author": "EarlyListen2398",
              "text": "I'm not doing partnership with shops, im using my own shop",
              "score": 1,
              "created_utc": "2026-02-16 18:20:19",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5q59s1",
          "author": "pekingsnail",
          "text": "a online website of your shop? it seems a traditional way, whats the key point?",
          "score": 1,
          "created_utc": "2026-02-16 18:24:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5q5m6b",
              "author": "EarlyListen2398",
              "text": "Not just a website, we are offering same day delivery of mobile accessories in local defined area \nI think you didn't read full paragraph",
              "score": 1,
              "created_utc": "2026-02-16 18:25:44",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5q6utm",
          "author": "pekingsnail",
          "text": "i cannot see any innovative point, perhaps in your region there is no delivery at same day apps. i can buy any  mobile accessories in many apps delivery at 1 hours.  for example, noon app at dubai, urber at south america markets.",
          "score": 1,
          "created_utc": "2026-02-16 18:31:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5q7073",
              "author": "EarlyListen2398",
              "text": "Where are you from brother?",
              "score": 1,
              "created_utc": "2026-02-16 18:32:01",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5q7vd6",
          "author": "pekingsnail",
          "text": "im from China, there are many apps you can buy any living staffs, all of them will be deliveryed at 20 minutes to your door.",
          "score": 1,
          "created_utc": "2026-02-16 18:35:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5q814s",
              "author": "EarlyListen2398",
              "text": "Oh, nice to meet you \nI'm from India \nCan we have a chat?",
              "score": 1,
              "created_utc": "2026-02-16 18:36:42",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5tmrel",
          "author": "Born_Crew1214",
          "text": "The \"Vending Machine\" Micro-Retail Strategy\nPhysical shops have high rent. Instead of opening many stores, use Smart Vending Kiosks in high-traffic areas (malls, tech parks, or large corporate offices).\nThe Twist: These aren't just for snacks. They stock your top-selling chargers, cables, and lens protectors.\nThe Bridge: If a customer buys from the machine, they get a QR code for a \"Free Professional Fitment\" at your main hub or via your home-service biker. This creates a low-cost funnel for high-value service customers.",
          "score": 1,
          "created_utc": "2026-02-17 06:18:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5upmw6",
              "author": "EarlyListen2398",
              "text": "Where are you from?",
              "score": 1,
              "created_utc": "2026-02-17 12:08:36",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5uti88",
                  "author": "Born_Crew1214",
                  "text": "Una, Himachal Pradesh ",
                  "score": 1,
                  "created_utc": "2026-02-17 12:35:52",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1r8sqoo",
      "title": "What’s the biggest mistake people make when testing a new business idea?",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1r8sqoo/whats_the_biggest_mistake_people_make_when/",
      "author": "AdWrong9284",
      "created_utc": "2026-02-19 07:21:10",
      "score": 3,
      "num_comments": 2,
      "upvote_ratio": 1.0,
      "text": "One big mistake is trying to validate the idea by asking friends or family instead of real potential customers. Feedback from people who wouldn’t actually pay can create false confidence and delay real testing.",
      "is_original_content": false,
      "link_flair_text": "Marketing / Operational / Financial / Regularotry Advice sought",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1r8sqoo/whats_the_biggest_mistake_people_make_when/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o6cf0lx",
          "author": "LCRTE",
          "text": "I agree 100%, and imo it can also create false fears, as people tend to think that if they are not willing to pay for a product, nobody will.",
          "score": 1,
          "created_utc": "2026-02-20 01:16:24",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}