{
  "metadata": {
    "last_updated": "2026-02-08 16:49:57",
    "time_filter": "week",
    "subreddit": "Business_Ideas",
    "total_items": 20,
    "total_comments": 76,
    "file_size_bytes": 115876
  },
  "items": [
    {
      "id": "1qylnxn",
      "title": "Our anonymous video chat platform Vooz hit 15k daily users yesterday!",
      "subreddit": "Business_Ideas",
      "url": "https://i.redd.it/i5klh8lga4ig1.jpeg",
      "author": "Electrical-Face-9291",
      "created_utc": "2026-02-07 18:39:21",
      "score": 56,
      "num_comments": 22,
      "upvote_ratio": 0.91,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Review my website, please",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1qylnxn/our_anonymous_video_chat_platform_vooz_hit_15k/",
      "domain": "i.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "o44hs5j",
          "author": "Fun_Lock2003",
          "text": "How do you guys earn money",
          "score": 4,
          "created_utc": "2026-02-07 18:49:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o45dwrl",
              "author": "Electrical-Face-9291",
              "text": "\n\nWe aren't earning yet yet. We just started monetizing with premium features like gender and location filters etc. We will be earning in a few weeks once more monetization features are released",
              "score": 2,
              "created_utc": "2026-02-07 21:39:13",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o44ly53",
              "author": "wavepointsocial",
              "text": "There’s always money in the banana stand",
              "score": 1,
              "created_utc": "2026-02-07 19:10:23",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o44tl5l",
          "author": "Critical_Nobody_4237",
          "text": "\n\nCongrats on the traffic numbers, that's impressive.\n\nThe real question everyone is thinking: How exactly does your \"strict AI moderation\" handle the Chatroulette/Omegle problem? (i.e., unsolicited nudity). Running real-time computer vision models on daily video chats to detect nudity is incredibly expensive and latency-heavy. \n\nAre you processing every frame or just sampling?",
          "score": 7,
          "created_utc": "2026-02-07 19:49:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o45d8mh",
              "author": "Electrical-Face-9291",
              "text": "\n\nWe have multiple AI models running in the background to detect nudity. If one model detects a hit, the other models confirm it by running checking it in quick succession. It is super detailed and very rarely can someone escape.",
              "score": 0,
              "created_utc": "2026-02-07 21:35:40",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o45k1ih",
                  "author": "hi_im_antman",
                  "text": "Yes, I think he understands that. He's asking about the cost of performance. You would essentially need to run the AI checks continuously (or frequently) on every active live stream. Even with frame sampling, doing it at scale is expensive and “multiple models” just increases the compute bill. \n\nAnd if you aren't doing it regularly, then the claim of being strict on nudity isn't really true. I can't imagine what it would be like if you had over a million users.",
                  "score": 6,
                  "created_utc": "2026-02-07 22:12:20",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o461afk",
          "author": "maopro56",
          "text": "itting 15k without even knowing who’s behind the camera is basically the grown‑up version of walking into the wrong Zoom call and pretending you belong",
          "score": 3,
          "created_utc": "2026-02-07 23:54:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o44gj19",
          "author": "Dear-Aspect-6969",
          "text": "Great achievement,   \nI'd like to know about tech stack and the cloud you are using to manage the infrastructure, and total costs per months from a technical side ofc, if you don't mind",
          "score": 2,
          "created_utc": "2026-02-07 18:43:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o45eviu",
              "author": "Electrical-Face-9291",
              "text": "\n\nTech stack is .net backend, nextjs front end, azure, webrtc\n\nWe aren't using any third party could server for our infra. Video streaming is p2p. Total costs per month is sustainable since we aren't using any third party subscriptions, can't disclose the numbers tho",
              "score": 1,
              "created_utc": "2026-02-07 21:44:27",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o44z2oo",
          "author": "Comfortable_Cap8037",
          "text": "\nWhich tech stack did you use?",
          "score": 2,
          "created_utc": "2026-02-07 20:19:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o45c7ss",
              "author": "Electrical-Face-9291",
              "text": "\n\nTech stack is .net backend, nextjs front end, azure, webrtc",
              "score": 1,
              "created_utc": "2026-02-07 21:30:11",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o45u4z0",
          "author": "HospitalAny8632",
          "text": "Did you need turn server as fallback?",
          "score": 2,
          "created_utc": "2026-02-07 23:09:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o44g1d7",
          "author": "Electrical-Face-9291",
          "text": "https://vooz.co \n\nBest anonymous chat site on the internet!",
          "score": 1,
          "created_utc": "2026-02-07 18:41:00",
          "is_submitter": true,
          "replies": [
            {
              "id": "o450twv",
              "author": "definitelynotgayhaha",
              "text": "\n\nWhy name it Vooz? Sounds spooky lol",
              "score": 1,
              "created_utc": "2026-02-07 20:28:39",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o45cuz2",
                  "author": "Electrical-Face-9291",
                  "text": "\n\nIt just came to us lol.. sounded cool and different, nothing else",
                  "score": 1,
                  "created_utc": "2026-02-07 21:33:39",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o44n7nr",
          "author": "MrMooseCreature",
          "text": "Love it",
          "score": 1,
          "created_utc": "2026-02-07 19:16:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o44nc0a",
          "author": "harxuu",
          "text": "10k daily organic users is wild congrats 🔥 seo play was clearly the move\n\none thing tho — once monetization kicks in you're gonna get flooded with support tickets and moderation edge cases. been there lol. we hired a couple of ops people from the ph thru a recruitment firm before our growth spike hit and it saved us so much headache. super affordable too which helps when you're bootstrapped\n\nsick product, rooting for you",
          "score": 1,
          "created_utc": "2026-02-07 19:17:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o45ekpl",
              "author": "Electrical-Face-9291",
              "text": "\n\nYeah I am actually anticipating that lol. Dming you. Gotta discuss something",
              "score": 1,
              "created_utc": "2026-02-07 21:42:49",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o44p3rs",
          "author": "Wooden-Ad-9894",
          "text": "Do build an app for it. You can send notifications on users phones everyday which will improve retention and Vooz will always be on the back of their minds. Just a small business tip",
          "score": -1,
          "created_utc": "2026-02-07 19:26:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o45dlo5",
              "author": "word2trio",
              "text": "fuqoff",
              "score": 0,
              "created_utc": "2026-02-07 21:37:36",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o45dt6n",
              "author": "Electrical-Face-9291",
              "text": "\n\nYeah we will build an app once we have some bandwidth. Right now super occupied with creating monetization features",
              "score": 0,
              "created_utc": "2026-02-07 21:38:42",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1quq6nb",
      "title": "How a Window Cleaning Business Made $79K/Month (And Why Your Industry Can Too)",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1quq6nb/how_a_window_cleaning_business_made_79kmonth_and/",
      "author": "4PFmel",
      "created_utc": "2026-02-03 12:05:36",
      "score": 33,
      "num_comments": 2,
      "upvote_ratio": 0.91,
      "text": "So Brandon and Carter got laid off during COVID. Instead of doom-scrolling, they noticed something: service trucks were everywhere, but people hated dealing with them. No-shows, surprise charges, dirty boots through clean houses.\n\nThey spent $153 at Home Depot and started cleaning windows in Austin. Fast forward to 2025: Pink's Window Services is a multi-million dollar franchise network with 236+ units across 29 states.\n\nBut here's what actually matters, they didn't win on the service. They won on the *strategy*.\n\n**The marketing playbook:**\n\n**1. Pick a story first, service second**  \nThey didn't start with \"we clean windows.\" They started with \"bring dignity back to blue-collar work.\" That one sentence became their north star for everything: name, branding, how they hire, how they show up.\n\n**2. Make boring things visually unforgettable**  \nNavy trucks. Crisp uniforms. Pink accents everywhere. It looks like a 1950s gas station mixed with a streetwear brand.\n\n[pink windows services](https://preview.redd.it/s0mvyzg9s9hg1.png?width=1080&format=png&auto=webp&s=05fae98584a485b9207dda61e05bdff940f7a02f)\n\nOther home service companies could do this tomorrow. Most just... don't.\n\n**3. Turn operations into marketing**  \nOn-time arrivals when they say they'll arrive. Online booking instead of phone tag. Handwritten thank-you notes. Free pressure washing on driveways for recurring customers.\n\nWhen your actual service experience is better than 90% of competitors, people talk about it. Their reviews mention the *people* and the *experience* more than the actual clean windows.\n\n**4. Content isn't an afterthought, it's the strategy**  \nThey post VHS-style videos, clips of techs doing kickflips in uniform, \"comp clean of the week\" features of local businesses.\n\nIt reads like a lifestyle brand, not \"commercial window cleaning LLC trying to sell you something.\"\n\n**5. Merch becomes word-of-mouth**  \nThey give genuinely cool gear to staff and top customers. People started buying Pink's hats, jackets, socks, not because they needed them, but because they look good.\n\nThat's free marketing walking around.\n\n**Why this matters:**\n\nYou don't need a new app or a new category/industry. You can take something as unglamorous as window cleaning and, through clear positioning, strong branding, thoughtful operations, and consistent content, build something franchisees actually want to be part of.\n\nThe playbook works for HVAC, plumbing, landscaping, handyman services, pest control—literally anything blue-collar right now.\n\nThe question isn't whether your industry is boring. It's whether you're willing to make it interesting.\n\n*Edit: Lots of people asking how they got franchisees to buy in early. Short answer: proof in the numbers. Their Austin location did $750K-$985K with 30%+ margins. Hard to say no to that. You can find their exact marketing strategy* [here](https://marketingcrafted.com/case-studies/pink-windows)",
      "is_original_content": false,
      "link_flair_text": "Marketing / Operational / Financial / Regularotry Advice sought",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1quq6nb/how_a_window_cleaning_business_made_79kmonth_and/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o3c5xyf",
          "author": "MrMooseCreature",
          "text": "Good on em",
          "score": 2,
          "created_utc": "2026-02-03 13:24:44",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qvmuxc",
      "title": "Career Digital Twin",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1qvmuxc/career_digital_twin/",
      "author": "Broad-Rip-2260",
      "created_utc": "2026-02-04 12:09:06",
      "score": 13,
      "num_comments": 3,
      "upvote_ratio": 1.0,
      "text": "I’m building an app which allows you to create a digital twin of your career / role / responsibilities. I would listen to the internet and picks up signals which might impact one or more of your tasks (e.g. imminent automation) and then gives you advice on where to build skills, diversify, augment etc… thoughts on whether this is a good idea?",
      "is_original_content": false,
      "link_flair_text": "Idea Feedback",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1qvmuxc/career_digital_twin/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": []
    },
    {
      "id": "1quscay",
      "title": "Please help, i am stuck.",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1quscay/please_help_i_am_stuck/",
      "author": "drteeworks",
      "created_utc": "2026-02-03 13:46:40",
      "score": 10,
      "num_comments": 23,
      "upvote_ratio": 0.92,
      "text": "So I just started a business which is a 90 minute one to one Personal or Professional Goals Mapping and Priority Setting Session for aspiring Product Managers and Directors.\n\nThe problem is client acquisition.\n\nWhat I tried so far includes offering 10 slots for free, posting my offer on a couple of subreddits, although my posts got removed and I was banned, and direct messaging people who I felt were a good fit.\n\nWhat happened is that luckily some people saw my posts before they were removed and they contacted me. I also received some replies from people I messaged, which suggests that there is demand.\n\nWhat I cannot do for now is any form of paid advertising due to financial reasons.\n\nWhat I am thinking of trying next is creating my own subreddit where I can share my service.\n\nI have also considered creating content on social media, but I do not want something that would take eight months or a year before I start getting clients. I want an approach that can start producing some results within one or two months, even if small, so I can begin getting in contact with people more quickly. This is one of the main reasons why I initially chose Reddit, because it allows for direct and immediate interaction. I can message people, they can message me, comment, and engage in real time, which makes the process much more dynamic and direct.\n\nWho am I, you might ask. I am a Senior Director and SEO with over five years of experience in the tech industry. I have worked on different projects including apps, websites, machine learning, database management, and AI, delivering technical solutions and products, market studies, and strategies. I have mainly worked with local factories, stores, and large warehouses. I stopped working for a year to study AI algorithms and solutions. \nDuring this time, I discovered that I really enjoy helping others in their journey to become Product Managers, Directors, and leaders, and to achieve their personal and professional goals. I want to do this for a living because I find it deeply fulfilling.\n\nPlease, any recommendation will help, thank you in advance.",
      "is_original_content": false,
      "link_flair_text": "Marketing / Operational / Financial / Regularotry Advice sought",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1quscay/please_help_i_am_stuck/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o3ciera",
          "author": "Wide_Brief3025",
          "text": "Tapping into existing communities where your target audience already hangs out can often lead to faster traction than building your own subreddit from scratch. Using a tool like ParseStream to monitor real time discussions about career transitions or product management might help you spot conversations you can naturally join and offer guidance. This way you stay active without spamming and get in front of people at the exact time they're asking for help.",
          "score": 3,
          "created_utc": "2026-02-03 14:33:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3cj2q6",
              "author": "drteeworks",
              "text": "Thank you so much, i'll try it. Do you suggest offering advice only or pitching?",
              "score": 1,
              "created_utc": "2026-02-03 14:36:46",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3coi0d",
          "author": "kawaiian",
          "text": "What guidance can you offer if you can’t guide yourself here? Gently, it doesn’t sound like you’re successful yet. Can you advise yourself first?\n\nDon’t you have a network built where people could use your services? Your first five clients will come from friends of friends, and after that, you get referrals from folks.",
          "score": 3,
          "created_utc": "2026-02-03 15:04:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3cr2qn",
              "author": "drteeworks",
              "text": "I have expirience in creating tech products but i don't know much about marketing, and that is the reason why i'm here, and i already have my first client from people that i know, but the thing is , just getting referrals from people that you know can only get you to a certains point then it stops, and that why i want to use internet for more visibility.",
              "score": 1,
              "created_utc": "2026-02-03 15:17:16",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3ca8ry",
          "author": "feudalle",
          "text": "A senior director that cant spend anything on advertising?",
          "score": 2,
          "created_utc": "2026-02-03 13:49:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3casgr",
              "author": "drteeworks",
              "text": "I did have a business and i stopped for a year, and spend a lot of money on paying bills, and some equipements for studying. Thank you for your question.",
              "score": 0,
              "created_utc": "2026-02-03 13:52:03",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3cflfy",
          "author": "LifeTelevision1146",
          "text": "DM me your email I'm sharing something valuable and pointing right at your domain. It's a document and can't post it here.",
          "score": 1,
          "created_utc": "2026-02-03 14:18:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3cii96",
              "author": "drteeworks",
              "text": "Your account is privite and i can't dm you, you can dm me so i can send you my email.",
              "score": 1,
              "created_utc": "2026-02-03 14:33:46",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3cjnxo",
                  "author": "LifeTelevision1146",
                  "text": "Sent you a chat request",
                  "score": 1,
                  "created_utc": "2026-02-03 14:39:52",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o3coozs",
                  "author": "kawaiian",
                  "text": "Don’t fall for scams bud",
                  "score": 1,
                  "created_utc": "2026-02-03 15:05:31",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3ky1hw",
          "author": "springcaterpillar",
          "text": "The subreddit idea probably won't work, you'll just get removed for self-promotion like before. What works better: contribute genuinely useful answers in communities where your target audience already asks questions. LinkedIn is actually ideal for the PM/director audience, posting about real decisions you've made, frameworks you've used, lessons learned. The catch with your 1-2 month timeline is that trust-based services need trust first. The people who saw your posts before they got removed and reached out, that's the model working at small scale. The sustainable version: answer questions in PM-focused subreddits without pitching, have a clear profile bio that explains what you do, and let interested people find you. Slower but doesn't get you banned.",
          "score": 1,
          "created_utc": "2026-02-04 19:08:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3p31yc",
              "author": "drteeworks",
              "text": "Thank you so much for taking time and sharing. This definitely helps and gives me what i'll do for now. Wish you the best.",
              "score": 1,
              "created_utc": "2026-02-05 10:52:19",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3ozuj7",
          "author": "superironthorman",
          "text": "This is a piss take, by definition someone with your credentials can't be this useless.",
          "score": 1,
          "created_utc": "2026-02-05 10:22:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3p3ldf",
              "author": "drteeworks",
              "text": "Thank you for taking time and sharing your opinion. Do you have any suggestion for this problem since you are an ex-faang pm? Anything would be appreciated. Wish you the best.",
              "score": 1,
              "created_utc": "2026-02-05 10:57:07",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3qtabz",
          "author": "Proud_Reality_3817",
          "text": "Hey well, welcome to the exciting and chaotic world of client acquisition and marketing haha !\n\nFirst of all, I'm a bit intrigued on the urgency leading you to want to money so quickly ? Do you have any deadline or particular reasons for it ?\n\nI'd say, from your main 90-minute coaching offer, that your best shot could very well be on LinkedIn, as that is where you could find lots of Active Product Managers and Directors. You could use posts to give tips, exercises and frameworks that could be useful to them and get their attention, and, at the same time, use LinkedIn to connect and reach out directly to Product Managers and Directors, offering a lead magnet or a free audit (that will allow you to then upsell them to your main 90-minute offer). Aiming for 100 personalised reach outs a week would be great, at first just asking them about how their work is going, creating trust, and then when Quarter-Reviews are approaching, shoot your shot and tell them about your offer !\n\nNow, I read through the comment and saw that you were experienced in creating tech product, and not so much in marketing. So, I would add that if you haven't heard of it yet or haven't set it up for your business and offers, I'd highly encourage you to build what's called a Growth Engine (Scorecard + The Actual Engine). This helps you monitor your whole business and user experience, from start to finish, and will help you convert more and keep your clients and prospects in the loop for longer.\n\nIf you want Ryan Deiss has a great template and framework for that. I'm also always glad to be of help so if you need any more details on that or anything marketing just reach out and I'll be there !",
          "score": 1,
          "created_utc": "2026-02-05 16:52:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3siwkx",
              "author": "drteeworks",
              "text": "Thank you so much for taking time and sharing, that is definitely helpful. And yes, linkedin is a better place where a lot of pms and directors exist. I've tried linkedin, and it is slower than reddit for some reason. I got better engagement on here. I already got my first bookings from here, so i guess i'll just continue testing on reddit for now. Thank you, appreciate your help.",
              "score": 1,
              "created_utc": "2026-02-05 21:41:00",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o43v70w",
              "author": "slowburn_otters",
              "text": " Haha, thanks for the warm welcome! The urgency is pretty real since I’m eager to help others and get things rolling financially. I totally agree about LinkedIn; it seems like a goldmine for connecting with Product Managers and Directors. I’ll definitely think about that Growth Engine concept you mentioned—sounds like a good structure to keep everything on track as I build my client base! Appreciate the offer to help!",
              "score": 1,
              "created_utc": "2026-02-07 16:58:11",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3wngy8",
          "author": "Gary-Barber-SCORE",
          "text": "The magic begins before you start the business. It’s called market research. That is where you talk with candidate clients to figure out if there is demand for your service, what form the service should take, and in this process you learn how to make contact with your customers. I always tell would be entrepreneurs, “if you can’t talk with them before you start a business, it will be even harder when you’re trying to sell them something!”\n\nDo you have a repeatable methodology for your service? Goals are pretty hollow without execution. So how do you propose to ensure execution?  Maybe you should use Eventbrite to setup a time to present your methodology, or MeetUp. It’s hard to get traction before you have success stories, and that will take some time to accumulate.",
          "score": 1,
          "created_utc": "2026-02-06 14:27:56",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qukwas",
      "title": "Just published my 12th best-selling book. Closing in on 100,000 copies of my books sold. Here is a detailed overview of the process, to the best of my experience.",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1qukwas/just_published_my_12th_bestselling_book_closing/",
      "author": "DannyFlood",
      "created_utc": "2026-02-03 06:48:02",
      "score": 10,
      "num_comments": 6,
      "upvote_ratio": 0.69,
      "text": "Hello everyone,\n\nI just hit a personal milestone last week: [I published my 12th book, *Unlimit*](https://www.amazon.com/dp/B0GH1D5YLB) 🥳🎉 \n\nIn the past week, the book hit #1 in four different Entrepreneurship categories, beating out a number of mainstream published \"heavyweights\" like Cal Newport, Seth Godin, James Altucher and many others. 💪 \n\nLooking at the dashboard, I've sold just under 100,000 copies across all my titles since I began this self-publishing journey back in 2014.\n\n**In this post, I'll share an outline covering every step of the process so that you can duplicate my success. If you follow the steps in this post, you're well on your way to earning $20,000 per book through self-publishing** (potentially more, if you take advantage of the post launch opportunities as well)!\n\n**The Case For Writing a Book**\n\nA published book is like an online business card. Your book carries your message, showcases your expertise, and builds a relationship with the reader in a way that few other mediums can. If someone spends a weekend reading your writing, they’ve spent a long time becoming acquainted with you through your words.\n\nAn ebook is a self-liquidating lead source, and an Amazon book is an excellent top-of-funnel item. When you look at a book as a potent form of marketing – and a relationship building tool for you – suddenly a world of possibilities open up. A free book is seen as a gift – it’s a welcome form of advertising – which people embrace with open arms. And it costs almost no money or time to give them away. An e-book can be reproduced indefinitely with no marginal cost.\n\nAlthough I have tons to say on this topic, I'll try not to make this “ultimate guide” too long and only tell you what you need to know 🤣\n\nIn the book, I share hundreds of ways to optimize your motivation, willpower, energy, and effectiveness. Here's a quick outline of hacks anyone can use:\n\n**How to Write a 100,000+ Word Book in Six Weeks**\n\n**1. Create Just the Right Amount of Pressure to Perform at Your Best (not too little, not too much)**\n\nThe 19th-century Russian novelist, Fyodor Dostoyevsky, had an unusual habit: he would deliberately gamble away his money whenever he became financially successful from the sales of his books. By creating extra pressure, he motivated himself to produce great work, far faster, to pay off his debts.\n\nFunny enough, Dostroyevsky wrote his book The Gambler in just 26 days to pay off one of his gambling debts. Without all of the trappings of wealth distracting him, his true purpose would again materialize. He was forced into a position where he needed to produce or starve. Just the right amount of pressure and the ticking clock forced him to focus and perform at the highest level.\n\nWhile performing research for my book, I learnt about the Yerkes-Dodson Law which asserts that just the right amount of pressure - not too little, not too much - leads us to perform at our best. This lends itself to a \"golden mean\" of mental arousal where we are able to find our \"genius zone.\n\n**2. Set Deliberate Time Constraints**\n\nYou can create this effect for yourself by setting time constraints and deadlines, and scheduling launches, live events, and so on where there is more pressure to succeed.\n\nWe tend to become much more focused and productive when we work in \"sprints\" - for example, if I have half an hour to write a post such as this one before several morning appointments, it compels me to make use of every minute and not waste any time.\n\n**3. Commit Publicly to Your Goal - No Half Measures**\n\nNext, I made a public commitment. A big reason why I was so motivated to complete my book is because I placed the book up for preorder on Publishizer, where I sold more than 300 pre-orders before I even began to write. Because I had already made a public commitment to the book and people had already paid for it, the extra pressure propelled me forward.\n\n**4. Use your phone to dictate everything** \n\nWhenever I try to sit down at a desk in my room or in an office, my mind starts to rebel and begin racing anywhere else besides the task at hand like a disobedient child.\n\nSo I wrote the entire book while working out at the gym, or hanging out at the park, or at the beach and just talking into my phone. This was the best way to put what was in my head into the document without any friction or internal resistance. \n\n**5. Maximize Your Energy**\n\nSunlight upon waking up and throughout the day, intermittent fasting, movement (even just 10 minutes of strenuous exercise like sprints, calisthenics, bodyweight, animal flow, etc) – all of these are daily routines that help a great deal.\n\n**6. Overcome the tyranny of the blank page** \n\nIf you already have existing content, you can save all of this in PDFs and import it into Google Notebook LM to help you build an outline and brainstorm ideas for your book. \n\nIf nothing else, this will remind you of some of your favorite concepts that you can build into chapters for your book. This is based on the “tickler files”  psycho-cybernetics hack created by Maxwell Maltz and is especially helpful if you just need a push to get started.\n\nYou can copy all of your LinkedIn posts, for example, or save transcripts from your videos on YouTube. I also upload my presentations from my in person workshops. One of my favorite tools is an extension called “IG post exporter,” it collects all of the meta information from any Instagram profile and exports it as a CSV, which you can convert into a PDF and import into Notebook.\n\n*Once you have your manuscript all or partially completed, you are ready to move on to the pre-launch phase.*\n\n**Four-Phase Book Marketing Strategy**\n\n**1) Pre-launch warmup and list building campaign.** We begin by connecting with users through value-added initiatives, such as free resources, lives, in-person meetups and workshops, and Google meets where we connect with individual users and help them with their problems. \n\nThese interactions with your readers are gold and uncover all kinds of insights, plus these people become your early advocates and beta readers. \n\nWith this group as your foundation, you can build up a pre-launch email list using highly valuable free offers and Facebook form advertising. \n\n**2) Launch a high-energy, high-interest prelaunch book crowdfunding campaign.** This allows us to validate the market, build a pre-order list, and upsell our respective coaching and products directly to the people who need them most.\n\nYou can create a proposal on Publishizer before the manuscript is even created, generate pre-orders from your tribe, promote the book online and at live events, and attract interest from agents and publishers. This completed, we can move onto step 3.\n\n**3) A successful Publishizer campaign gives us a launchpad to go deeper.** We can leverage our success further through a launch on Kickstarter, and advertise to even more users. We can enlist the services of crowdfunding specialists and marketing newsletters (resources are listed at the end of this post) and lists to drive maximum traffic to our book pre-launch, as well as Kickstarter’s own massive organic traffic. \n\n**4) After generating this massive groundswell of interest and pre-orders, we can officially “launch” the book.** If we receive an attractive offer from a mainstream publisher, we can accept their agreement and collect the advance royalty payments and royalties. If we choose to self-publish, we proceed with a launch on Amazon and take #1 best-seller in every category. \n\n**Here’s a breakdown of the Amazon Launch Timeline:**\n\n*Day 1: Publish the book.*\n\n*Days 2-6: Run a free promotion and get as many reviews as humanly possible. E-mail everyone you know. Ideally you gave out a bunch of copies to beta-readers a few weeks before publishing. Now’s the time to get in touch with them! Ask people to download the book from Amazon for free, then write a review. It will be listed as a “Verified Purchase” review.*\n\n*Days 7-9: get blasted out on 99 cent promo sites*\n\n*Days 10-16ish: remain at 99 cents and get as many downloads as possible*\n\n*Day 17ish: change to real price, ideally with #1 hot new release and #1 bestseller in your categories.*\n\nMake certain to schedule all of your promotions at the same time, to maximize your chances of shooting up the rankings and getting organic traffic from Amazon. \n\nWhen submitting your book, choose categories that are not overly competitive so that you can easily get the number one best seller position. Since you can choose three subcategories, you can try choosing one that's very niche (to rank at the top and get the bestseller badge) and two bigger ones where you get more visibility.\n\nYou can also consider setting up some advertisements for your book to help increase its visibility. I wrote a step-by-step guide about how to create Amazon ads, without breaking the bank, here.\n\nCross sell your other books (if any) and other products after the title page. You can link directly to your other books on Amazon, or offer a coupon code for a product on another platform like Gumroad. I did this very successfully for my book about freelancing on Upwork: I read a bunch of free promotions with a coupon code inside to download my freelancing business in a bundle at a much higher price point, selling several hundreds of these.\n\n**5) Use the book to generate more revenue and equity for your businesses.** This includes things like cross-sells, list building, public relations, paid speaking opportunities, and as a front-end lead source for higher-ticket products and offers. You can also tap into direct revenue streams from a successful book, such as selling the foreign rights of the book so that it gets translated into different languages. I have one friend who pocketed $8,000 just from selling the rights to translate his book into Korean. The contacts you make through Publishizer can help connect you to agents to sell the rights to translate your book, otherwise just type this into Google and start connecting with agents on LinkedIn:\n\n*site:linkedin.com/in/ \"foreign rights\" \"manager\"*\n\n*site:linkedin.com/in/ \"foreign rights\" \"agent\"*\n\n**Take care and all the best! Happy publishing 😊** I know there was a lot covered, so if you have any questions let me know and I’ll be happy to jump in with additional tips!\n\nDanny\n\n**PS Links to resources and tools linked in the comments 👇**",
      "is_original_content": false,
      "link_flair_text": "What business do I start?",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1qukwas/just_published_my_12th_bestselling_book_closing/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o3bteu6",
          "author": "Nozdoz",
          "text": "What a detailed and practical rundown of something I previously knew nothing about. Thank you Danny and good luck!",
          "score": 3,
          "created_utc": "2026-02-03 12:01:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3gfc4v",
              "author": "DannyFlood",
              "text": "My pleasure and thank you for the well wishes! Best of luck to you as well.",
              "score": 2,
              "created_utc": "2026-02-04 02:03:34",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3av4ix",
          "author": "AutoModerator",
          "text": "This subreddit sees a lot of posts by users asking the question 'What business do I start?' and many of them seem to be new to Reddit, so while they think that their post is unique, it almost always is not.\n\nWe welcome your post, and we hope to help you discover a business that is the right fit, but **help us help you** by ensuring that you have provided enough information about yourself, such as:\n\n  - Interests\n  - Available capital\n  - Skills & experience\n  - Business style (B2B, brick & mortar, online, etc.)\n  - Industry/market\n  - Location (state/country), if relevant\n  - Commitment (full-time, part-time, side-gig)\n  - Preferred role (physical work, sales, e-commerce, etc.)\n\nWhile answers to **all of** these are not mandatory, your post will be reviewed by a moderator. If they decide that your post does not contain enough information, it may be removed.\n\n**Community Members**\n\nIf, in your opinion, this post does not contain sufficient information, kindly click this [link](https://www.reddit.com/message/compose/?to=/r/Business_Ideas&subject=Reporting%20Non-compliant%20Post&message=/r/Business_Ideas/comments/1qukwas/just_published_my_12th_bestselling_book_closing/) to report it, and the moderation team will investigate.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Business_Ideas) if you have any questions or concerns.*",
          "score": 2,
          "created_utc": "2026-02-03 06:48:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3av8e8",
          "author": "DannyFlood",
          "text": "**Resources and Tools to successfully launch books! ⭐**\n\nI can't link to all of these resources here, so I put them in a Google document: [https://docs.google.com/document/d/191SW1it7JHx1INqIrZ9eGS1HsHnxOyZds8BL1azg\\_FI/edit?tab=t.0](https://docs.google.com/document/d/191SW1it7JHx1INqIrZ9eGS1HsHnxOyZds8BL1azg_FI/edit?tab=t.0)",
          "score": 1,
          "created_utc": "2026-02-03 06:48:59",
          "is_submitter": true,
          "replies": []
        },
        {
          "id": "o3myi7q",
          "author": "flightwatcher45",
          "text": "Wow its that easy? Haha I'll stick to reading. Amazing job!",
          "score": 1,
          "created_utc": "2026-02-05 01:15:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o48g2rw",
          "author": "CosmoKramerRiley",
          "text": "What's your business backgroud outside of publishing books?",
          "score": 1,
          "created_utc": "2026-02-08 10:57:04",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qxevno",
      "title": "I executed on the idea of \"Zapier for Hackers\"",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1qxevno/i_executed_on_the_idea_of_zapier_for_hackers/",
      "author": "Deep-Bandicoot-7090",
      "created_utc": "2026-02-06 11:14:21",
      "score": 7,
      "num_comments": 1,
      "upvote_ratio": 1.0,
      "text": "I always saw people asking for a way to automate security testing without writing scripts. The idea was simple: \"Make it visual.\"\n\nSo we actually built it.\n\nIt’s called **ShipSec Studio**. It allows you to build security pipelines using a visual node editor. You can use it to automate bug bounties, cloud audits, or just check your home lab.\n\nWe just open-sourced the code today.\n\n**Repo:**[github.com/shipsecai/studio](https://github.com/shipsecai/studio)",
      "is_original_content": false,
      "link_flair_text": "Idea Feedback",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1qxevno/i_executed_on_the_idea_of_zapier_for_hackers/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o48dgnd",
          "author": "raxblackwood",
          "text": "Imma check it out",
          "score": 1,
          "created_utc": "2026-02-08 10:32:24",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qvxp4p",
      "title": "Tips for New Importers, Finding Reliable Suppliers and Avoiding Scams",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1qvxp4p/tips_for_new_importers_finding_reliable_suppliers/",
      "author": "KhabibNurmagomedov_",
      "created_utc": "2026-02-04 19:08:15",
      "score": 7,
      "num_comments": 4,
      "upvote_ratio": 0.9,
      "text": "Hi everyone, I’m just starting out with importing products and want to make sure I avoid common mistakes. One of my biggest concerns is finding suppliers that are reliable and steering clear of scams. I’ve heard of platforms like Made in China, it’s a platform similar to Alibaba and also a B2B platform but I’m not sure how to properly evaluate a supplier or what warning signs to look for.\n\nIf you have experience with importing, I’d love to hear how you verify suppliers, how you build trust before placing an order, and any tips you have for someone new to this process. Your advice and experiences would be really helpful!",
      "is_original_content": false,
      "link_flair_text": "Marketing / Operational / Financial / Regularotry Advice sought",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1qvxp4p/tips_for_new_importers_finding_reliable_suppliers/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o3kzakq",
          "author": "springcaterpillar",
          "text": "A few things that helped when sourcing: start with small test orders before committing to volume. Request video calls with the factory, legit ones are usually willing. Check how long they've been on the platform and look for reviews from buyers in your region. Ask for references from other customers. Trade Assurance or similar payment protection is worth the fees for first orders. Warning signs: pressure to pay outside the platform, prices way below market, inconsistent communication, and reluctance to show production. Alibaba tends to have more verified suppliers than Made in China in my experience, but either works if you do your due diligence.",
          "score": 1,
          "created_utc": "2026-02-04 19:14:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3nk499",
          "author": "iwonderthesethings",
          "text": "I have been doing this for over 26 years - before the internet even became a thing to source with. So I 'm quite the expert on vetting suppliers and starting a brand with product dev from start to finish. There is so much to know, it's not funny. My own experience cost me tens of thousands - if not hundreds of thousands - of lost dollars, but it was priceless to know. I sold my business a few years ago and while I wait to launch my new offering, I figured I'd launch a web app to help others, which will include suppliers I've personally vetted as well on how to vet new ones yourself, along with other info. I'll be charging from $99 for this app. Would you pay for something like this?",
          "score": 1,
          "created_utc": "2026-02-05 03:20:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3pu16f",
          "author": "ChestChance6126",
          "text": "Don’t rely on marketplace badges alone. Always order a paid sample matching your exact specs and treat the first bulk run as a test, not a profit order. Also, ask for recent production or inventory videos and verify business registration. Most issues aren’t scams, they’re quality drift or miscommunication, which clear written specs and QC checks usually prevent.",
          "score": 1,
          "created_utc": "2026-02-05 13:59:12",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qyu20r",
      "title": "Business Idea Feedback - Mens Mentoring Group?",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1qyu20r/business_idea_feedback_mens_mentoring_group/",
      "author": "UnusualAd3207",
      "created_utc": "2026-02-08 00:20:13",
      "score": 7,
      "num_comments": 3,
      "upvote_ratio": 1.0,
      "text": "This might sound harsh but.. I don't think there's a male loneliness epidemic going on right now, I think there's just a male loser epidemic\n\nGuys need to focus on improving themselves and building a lifestyle that attracts what they want\n\nWomen, friends, business opportunities, etc\n\nIn 2023 I sold my tech company for a lot of money, and I invested heavily into self improvement\n\nBecause even though I now had money, I was a loser in basically every other area of life.\n\nI was a shy tech nerd who was super insecure about my looks, had basically zero confidence, zero success with women, out of shape, etc\n\nLearning how to communicate, learning how to be confident in social situations, learning out to dress for my body, have style, how build attraction with women beyond looks, getting in shape, and maximizing my potential as a man has dramatically improved my life.\n\nI find it easy to make friends, business people reach out to me often, women comment on my IG posts and DM me often (something that Iv'e never ever experienced in life)\n\nAll because I improved my lifestyle, I think that's the key, if you do that, everything you want will be attracted to you, you wont have to chase it.\n\nBe an attractor not a fisherman. Stop chasing..\n\nSo Iv'e been thinking about putting together a group mentoring program for men, because I think so many need it so bad\n\nGirls Dm's are filled with out of shape broke dudes who are totally desperate and it's sad.\n\nI'd bring in experts to teach different areas. Like starting / growing a business, dating, communications coaches, social dynamics, looksmaxxing, style consultants, nutrition / diet, fitness, financial literacy / investing, etc.\n\nBasically all the areas in which I think men should be maximizing to get ahead in life\n\nI'd host it in some kind of community app like Discord or Skool, and do weekly group calls\n\nThoughts? Good idea? Bad idea? Something no one would probably care about and I'm one of the rare people that cares so much about improving all those areas? lmk!\n\nThis is just a thought, nothing in motion yet, so not promoting",
      "is_original_content": false,
      "link_flair_text": "Idea Feedback",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1qyu20r/business_idea_feedback_mens_mentoring_group/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o46ah68",
          "author": "Ok_Rock_8421",
          "text": "If discord doesn’t work or you have a problem getting traction start with social media posts and build funnels to the discord server",
          "score": 1,
          "created_utc": "2026-02-08 00:49:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o49bbmn",
          "author": "Good-Work2301",
          "text": "I would host it in Skool. Would attract like minded men.",
          "score": 1,
          "created_utc": "2026-02-08 14:42:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o49o8tj",
          "author": "ChestChance6126",
          "text": "I get the instinct, but the framing matters more than the mechanics here. There is demand for men wanting structure and accountability, but the second it smells like contempt for the audience, conversion and retention drop fast. What tends to work better is positioning around skills and outcomes, social confidence, health, and career leverage, rather than diagnosing people as broken. Also worth pressure testing if this is really a mentoring program or a curriculum plus community, those are very different beasts operationally. I would validate with a small paid cohort and one or two core tracks first, instead of boiling the ocean. The idea itself is not crazy, but the edge is in execution and tone, not the concept.",
          "score": 1,
          "created_utc": "2026-02-08 15:50:51",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qtlj9p",
      "title": "what do you think of this??",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1qtlj9p/what_do_you_think_of_this/",
      "author": "Remote-Career6774",
      "created_utc": "2026-02-02 04:44:55",
      "score": 6,
      "num_comments": 25,
      "upvote_ratio": 0.8,
      "text": "so i was thinking of starting a side hustle and came up with this idea might not be new but hear me out. i plan to look for clinics salons or similar businesses that do not have their own website. then i would approach them and ask if they want one to improve their online presence and reach more people. if they agree i would hire a web designer from fiverr or freelancer brief them on what is needed get the website made and then deliver it to the business.",
      "is_original_content": false,
      "link_flair_text": "Idea Feedback",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1qtlj9p/what_do_you_think_of_this/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o34e0kb",
          "author": "EmbarrassedOne2329",
          "text": "Nothing to lose here, I think if you are excited about it, why not try. Also I would suggest that for some clients you should build the websites for free or charge them only the Domain and Host cost, and ask them to give you a review or suggest to their friends.",
          "score": 3,
          "created_utc": "2026-02-02 08:02:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o34f4nt",
              "author": "Remote-Career6774",
              "text": "makes sense, I will surely do this, thanks mate",
              "score": 1,
              "created_utc": "2026-02-02 08:12:44",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o35kb9c",
              "author": "Remote-Career6774",
              "text": "but also the thing is yeah that i tried finding people on fiverr and freelancer but couldn't find one guy. there are some who cost either 70-80k or some with no profile.",
              "score": 1,
              "created_utc": "2026-02-02 13:47:54",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o35kqof",
                  "author": "Ok_Rock_8421",
                  "text": "It sounds like that means you have found a gap in market need vs market supply. If you can’t outsource the work sounds like a good opportunity to upskill and market yourself",
                  "score": 2,
                  "created_utc": "2026-02-02 13:50:17",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o35r6fm",
          "author": "mrashrafuul",
          "text": "its a fine idea but your problem isnt the website its getting yeses, most of these businesses dont care about sites, you’ll hear “we already have Instagram” a lot, so instead of selling a website sell one clear result like “more bookings”, offer a simple landing page plus Google profile setup not a full custom site, charge a small setup fee plus monthly maintenance, and only target places that look busy but messy online, do that and you’ll close way more than flipping random Fiverr sites.",
          "score": 3,
          "created_utc": "2026-02-02 14:25:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o35sbgc",
              "author": "Remote-Career6774",
              "text": "i live in mumbai so i feel a lot of people here would genuinely be interested since it is kind of a status thing. and i am good with words so i will try to do my best.",
              "score": 2,
              "created_utc": "2026-02-02 14:31:30",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o395fwk",
          "author": "JacobAldridge",
          "text": "As some else said, you have nothing to lose by trying.\n\nIn business training, what you’re describing is known as “the village with no shoes”.\n\nTwo salespeople are sent to a village to see if opening a shoe store would be a good idea.\n\nThe first salesperson calls his boss: “This is a terrible idea. Nobody in the village wears shoes, so we will have no customers.”\n\nThe second salesperson calls *his* boss: “This is a great idea. Nobody in the village wears shoes, so we will have lots of customers!”\n\nFor small businesses without a website, which salesperson is correct? You have the chance to find out!\n\n(I personally think the first salesperson is correct. If a business doesn’t have a website today, that probably means they don’t want one enough to ever pay for it. You are better off targeting businesses with bad / old websites and having them upgrade - then at least you are selling shoes to people who have bought shoes before.\n\nBut my view is filtered through richer Western cities where I work. The experience in Mumbai, where perhaps it’s harder to find good cheap website builders, may be different and the second salesperson may prove correct and wealthy.)\n\nGood luck!",
          "score": 2,
          "created_utc": "2026-02-03 00:13:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3a2ptm",
              "author": "Remote-Career6774",
              "text": "that actually makes a lot of sense and i like the analogy. i get your point about businesses without websites possibly not valuing one enough to pay for it, and i agree that targeting outdated or bad websites is probably an easier sell in many cases.\n\nat the same time i feel mumbai might be a bit different. a lot of small clinics and salons here still run fully offline not because they don’t see value, but because they don’t know where to start or think it’s too expensive or complicated. i was thinking of testing both approaches and seeing what works better in the real world.\n\neither way you’re right, i don’t really have anything to lose by trying. thanks for sharing your perspective, it was genuinely helpful.",
              "score": 4,
              "created_utc": "2026-02-03 03:22:38",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o39lud9",
          "author": "DicksDraggon",
          "text": "I think you are better off learning AI SEO or GEO. Building a site yourself that is actually good. Then renting it out to a service business. You could make 15 sites and rent them out for $500 a month or try for higher priced and have less of them... maybe 4 $2000 sites. The organic way is called rank & rent or you can spend money on ads and do it backwards and then it is called rent & rank. But I don't think rent & rank will work with ai searches.... yet.\n\nI would not trust anyone else to build my sites. I see what junk is on the internet.",
          "score": 2,
          "created_utc": "2026-02-03 01:45:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3a2xsq",
              "author": "Remote-Career6774",
              "text": "that’s a solid point and i agree with you on not trusting random builders with quality, there really is a lot of junk out there. learning to actually build and optimise the site myself would give way more control and long term value.\n\nrank and rent is interesting too, especially the organic side of it. i haven’t gone deep into ai seo or geo yet but it’s definitely something i should explore before locking myself into just the middleman model. i guess my current idea was more of a low barrier entry test, but your approach makes more sense if i want to scale and not depend on others.\n\nthanks for the perspective, gave me something concrete to think about.",
              "score": 3,
              "created_utc": "2026-02-03 03:23:58",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3fadbr",
          "author": "Solid_Mongoose_3269",
          "text": "lol. If a business that’s making money doesn’t have a site, your inexperienced self isn’t going to change things. \n\nIs this 2001?",
          "score": 2,
          "created_utc": "2026-02-03 22:21:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3h00vr",
              "author": "insideoutpiff",
              "text": "I'm making websites for general contractors, electricians etc. Go figure.",
              "score": 0,
              "created_utc": "2026-02-04 04:04:34",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3kbeu4",
          "author": "lilyphansen",
          "text": "People already do this and advertise it as a side hustle. I don’t know if they make the website first and then present it to the customer. It comes up all over my fb feed for whatever reason. People sell masterclasses on how to do it. So if I had to guess..there’s a market for it. I wouldn’t hire somebody to do it if you can make a template and do it yourself. I believe they also pay a hosting fee per month.",
          "score": 2,
          "created_utc": "2026-02-04 17:26:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3kbup7",
          "author": "lilyphansen",
          "text": "Also, maybe A lot of businesses don’t have a website bc it’s in their to do list but never got around to it…or got really expensive quotes.",
          "score": 2,
          "created_utc": "2026-02-04 17:28:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o36srkq",
          "author": "Beginning_Alarm784",
          "text": "essaye par toi meme de créer les sites, aujourd'hui avec le vibe coding tu peux faire des choses géniales",
          "score": 1,
          "created_utc": "2026-02-02 17:25:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o36tbm3",
              "author": "Remote-Career6774",
              "text": "i have started learning coding mainly python and stuff like that",
              "score": 1,
              "created_utc": "2026-02-02 17:28:00",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3o8h05",
          "author": "ExistingScallion7329",
          "text": "Applaud your thinking and congratulations on looking for opportunities. You could look at the links in Facebook profiles and you’ll most likely find many are broken or need an upgrade. Another angle if you want to consider is buying domains and reselling. It’s terribly difficult to find trustworthy people to build websites. Have a look at EasyWP I’ve dm you the link",
          "score": 1,
          "created_utc": "2026-02-05 06:08:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3o8t13",
              "author": "ExistingScallion7329",
              "text": "https://youtu.be/y3yu-6acw2g?si=X7mXzx5-B5TW3raB",
              "score": 1,
              "created_utc": "2026-02-05 06:11:30",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3oc6cu",
                  "author": "Remote-Career6774",
                  "text": "thanks mate but i think i will actually learn and put around 3 months into this. that way i will learn something have something to add to my resume and it might even help me earn. so instead of getting other people to do it i am doing it myself.",
                  "score": 1,
                  "created_utc": "2026-02-05 06:40:17",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3s2dpm",
          "author": "PavelBoss13",
          "text": "The idea may be ok, but there are a whole bunch of people who will offer the same services. I know 10 people in my environment who can do it. Although I don't specifically surround myself with such people. It's just so relevant that there are more people who can create a website than those who need this website (businessmen, for example)",
          "score": 1,
          "created_utc": "2026-02-05 20:21:34",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qyzwe3",
      "title": "What are some major tasks in small/medium businesses that still require a lot of manual work but should be automated?",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1qyzwe3/what_are_some_major_tasks_in_smallmedium/",
      "author": "Original_Map3501",
      "created_utc": "2026-02-08 04:56:38",
      "score": 6,
      "num_comments": 12,
      "upvote_ratio": 0.87,
      "text": "Hey everyone,  \n  \nI’m trying to understand where small and medium businesses still lose a lot of time on manual work.  \n  \nFrom your experience, what are some repetitive or painful tasks you or your team still do manually that feel like they should already be automated?  \n  \nFor example:  \n  \nData entry and spreadsheet updates  \n  \nLead and customer follow-up tasks  \n  \nReport generation tasks  \n  \nInvoicing and payment processing and reminder creation tasks  \n  \nDocument and email organization tasks  \n  \nTask and deadline and approval tracking tasks  \n  \nI want to investigate which processes waste time and create daily operational difficulties because I have no intention to sell anything.  \n  \nIf you run a business or work closely with one:  \n  \nWhat task do you hate doing manually?  \n  \nWhat do you wish a tool would just “handle in the background”?  \n  \nI want to understand actual problems that people experience in day-to-day life. Thank you for your help.",
      "is_original_content": false,
      "link_flair_text": "Idea Feedback",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1qyzwe3/what_are_some_major_tasks_in_smallmedium/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o47ek1p",
          "author": "feudalle",
          "text": "So I've been in dev since the 90s. The problem is every small business does it diffently. You need to customize per client or you can try the over saturated SaaS option.",
          "score": 3,
          "created_utc": "2026-02-08 05:14:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o47fbfm",
              "author": "Original_Map3501",
              "text": "What exactly do you mean by \"customize per client\"?",
              "score": 1,
              "created_utc": "2026-02-08 05:20:49",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o47fvks",
                  "author": "feudalle",
                  "text": "So client 1 keeps there spreadsheets in layout x on google sheets. Client 2 uses share point and excel and links it to powerbi. Client 3 has an access database their nephew built in 2006 for them. Client 4 uses salesforce but keep notes of things thfy need to enter in on a txt file on their desktop. No good way of automating that with 1 solution. If your thought is you'll have them all entered it in your way fir uour solution, good luck pushing the boulder up the hill. 30 years of dev experience for small company to multinationals you are fighting human nature.",
                  "score": 3,
                  "created_utc": "2026-02-08 05:25:13",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o47exwb",
          "author": "GotTools",
          "text": "What I have noticed just about everywhere I’ve worked so far is that nothing is optimized in the way of standards and procedures. \n\nIt’s not like there aren’t countless solutions to making those tasks 100x more optimized, but that everyone is too focused on the thing that directly makes them money and not optimizing the process that supports it. You would be surprised how many companies still run of decade old computers. \n\nA lot of companies know their processes are complete crap and need redone, but they do the job for now.\n\nIt’s hard to come up with a solution to a problem in an industry you know nothing about, so get some real world experience in what you are passionate about and start looking for problems that need solutions.",
          "score": 3,
          "created_utc": "2026-02-08 05:17:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o47f8sg",
              "author": "Original_Map3501",
              "text": "So basically they are too lazy to optimize it or they dont wanna get out of the comfort zone and just keep using the old tech and not touch it if tis working?",
              "score": 2,
              "created_utc": "2026-02-08 05:20:14",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o49arpd",
                  "author": "Botboy141",
                  "text": "There are a lot of ways to make money in this world.\n\nA profitable, growing business, doesn't always have to focus on every opportunity for efficiency and optimization.\n\nA lot of the time, a small tweak to their marketing or sales process will yield great short-mid term results, for less effort, than actually addressing inefficient operations.\n\nInefficient operations become more relevant at scale, and is where most business fail.",
                  "score": 3,
                  "created_utc": "2026-02-08 14:39:51",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o47gmn0",
                  "author": "Green-Setting5062",
                  "text": "I know with some apps they charge you by the page for basically smart parsing from ocr scanned documents. I was working on my own receipts and invoice intake system because I think thay would eventually require that i hire someone to do it for me, but I was able to make a python tool that can parse my bank statement and certain invoices. Its just manual trial and error and I use a json as the profile template. My problem is I feel its too jankey to sell but I deal with the jankey stuff because I can spend an hour and get a profile dialed in and save it and it works 90% of the time and im able to get the money info and dates into a database that can export csv or whatever for a book keeper. I developed it because I have adhd and I cant stay organized with paperwork everywhere so its way easier to keep a folder on the PC with each month of records and then get it all into a data base and its all there basically. Ive automated a huge chunk of the repeating tasks basically all I gotta do is take pictures of receipts with a scanner app and then transfer them into the folder when im home. And boom I can process the receipts and bank accounts in under an hour. And hell im usually screwing around on my phone for most of the hour so a normal person it would probably be 30 mins lol 😆",
                  "score": 2,
                  "created_utc": "2026-02-08 05:31:09",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o47zkv0",
          "author": "imabetaunit",
          "text": "I’m having trouble identifying what business idea is being shared.",
          "score": 2,
          "created_utc": "2026-02-08 08:20:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o48xupu",
          "author": "senraku",
          "text": "An auto salt and pepper shaker hopper/quick fill for restaurants",
          "score": 2,
          "created_utc": "2026-02-08 13:21:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o48zda5",
          "author": "indexintuition",
          "text": "honestly, anything that requires me to remember to follow up later is where things fall apart. emails especially, drafting them, formatting them, then remembering who i sent what to. invoicing too, not the sending part but the reminders and tracking who paid without digging through spreadsheets. i also hate moving the same info between tools because it feels like pure brain drain. i wish more stuff just synced quietly in the background so i could spend my limited time actually working instead of managing the work. as a small business, the mental load is almost worse than the time itself.",
          "score": 2,
          "created_utc": "2026-02-08 13:31:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o494ydk",
              "author": "Original_Map3501",
              "text": "The statement that the mental burden is worse than the actual time struck a chord with me.  \nI'm thinking about this, and I would appreciate your frank opinion. Imagine a tool that tracks invoices and follow-ups in the background without requiring you to check spreadsheets or set reminders. It remembers who sent what, automatically reminds you to pay unpaid invoices, and marks tasks as completed when payment is received.\n\nIt would only interrupt you if something was past due or required attention; otherwise, you would continue working as you currently do.\n\nFor you, would something like that truly lower the mental overhead? If so, what is more important automatic payment detection, follow-up notifications, or avoiding the need to maintain tool synchronization?",
              "score": 1,
              "created_utc": "2026-02-08 14:05:51",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o497tl6",
          "author": "Aero002",
          "text": "Training, onboarding, upskilling employees - takes hours and hours. Even with material. ",
          "score": 2,
          "created_utc": "2026-02-08 14:22:50",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qwzra3",
      "title": "Would you guys invest in this?",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1qwzra3/would_you_guys_invest_in_this/",
      "author": "Adventurous-Rub-6980",
      "created_utc": "2026-02-05 22:26:13",
      "score": 5,
      "num_comments": 7,
      "upvote_ratio": 0.74,
      "text": "I’m not asking for money or trying to promote anything. I just want honest feedback on a business idea.\n\nI’m considering starting a small business selling rings made from recycled car parts or meteorite materials. I’ve already found manufacturers that can produce these, and the idea is to focus on unique, story-driven pieces made from unconventional materials.\n\nDo you think there’s a market for something like this? I’d appreciate any thoughts on demand, pricing, or potential challenges before I go further with it.",
      "is_original_content": false,
      "link_flair_text": "Idea Feedback",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1qwzra3/would_you_guys_invest_in_this/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o3st4ov",
          "author": "gridsandorchids",
          "text": "There's already tons of businesses that do this.",
          "score": 6,
          "created_utc": "2026-02-05 22:31:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3t12rp",
              "author": "Adventurous-Rub-6980",
              "text": "Like what",
              "score": 0,
              "created_utc": "2026-02-05 23:12:58",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3td4xn",
                  "author": "scooter950",
                  "text": "Download an app called Shop. Its a blueish/purple color. It's legit, a lot of brands/retailers use it. You can search for an item and the results are retailers that sell what you searched.\n\nIt's funny this came across my feed because just last night I was scrolling for a new wedding band and the amount of brands that sell rings are crazy.",
                  "score": 2,
                  "created_utc": "2026-02-06 00:20:54",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3wk67g",
          "author": "ChestChance6126",
          "text": "There’s likely a niche market, but the risk isn’t demand, it’s differentiation and trust. “Unique materials” get attention, but buyers care about craftsmanship, the legitimacy of the materials, and the story being verifiable. Before scaling, I’d test willingness to pay with a few SKUs and real proof points, not just interest.",
          "score": 1,
          "created_utc": "2026-02-06 14:10:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3x0xz5",
          "author": "Extra_Intro_Version",
          "text": "This would make an art fair booth. \n\nWould you understand whether the properties of the materials are suitable to their intended usage?\n\nLike, not all metals are compatible with human skin. Is engine block iron good to be on your finger? Or vehicle frame steel? Or whatever rando metal parts get melted down? How much gold, silver or stainless steel are you expecting to find on a car?\n\nI was at an art fair where a guy was selling really beautiful knives made from steel reclaimed from a well known suspension bridge. Cool concept- but he had no clue whatsoever if that steel was suitable for a functional knife. 0 knowledge of metallurgy- hard pass, bro. \n\nI’ve seen cool art pieces made from multiple coats of built up paint reclaimed from historical-ish factory machinery and walls. Any idea what chemicals are in that paint dating back 100 years? Nope. Hard pass again.",
          "score": 1,
          "created_utc": "2026-02-06 15:35:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o40xgty",
          "author": "Ecaglar",
          "text": "the other commenter is right that theres competition already but that doesnt mean its saturated. the story-driven angle is key - you need to make the sourcing verifiable and interesting. like if you can say \"this ring was made from the engine block of a 1967 mustang that drove 200k miles\" thats way more compelling than just \"recycled car parts\". the meteorite angle is harder to verify and has more trust issues. id start with car parts where you can trace the origin",
          "score": 1,
          "created_utc": "2026-02-07 04:01:22",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qwxa0y",
      "title": "Most founders don’t fail because of execution. They fail before they start.",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1qwxa0y/most_founders_dont_fail_because_of_execution_they/",
      "author": "Calm_Parking_8939",
      "created_utc": "2026-02-05 20:53:53",
      "score": 5,
      "num_comments": 7,
      "upvote_ratio": 0.73,
      "text": "When you start a company, nobody really tells you where to begin.  \nYou read advice. You copy templates. You look at competitors.  \nBut most of it assumes you already know what kind of business you want to build.  \n  \nThe hardest part is not writing a business plan.  \nIt’s aligning the business with who you actually are.\n\nIf your plan forces you into a role you don’t believe in, you might survive short term.  \nLong term, burnout does the killing.\n\nHow did you decide what kind of business you were really building?",
      "is_original_content": false,
      "link_flair_text": "Marketing / Operational / Financial / Regularotry Advice sought",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1qwxa0y/most_founders_dont_fail_because_of_execution_they/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o3upn6b",
          "author": "indexintuition",
          "text": "for me, it really started with what felt manageable alongside family life. i knew i wanted something small, something i could test in short bursts while the kids were at school or asleep. i spent a weekend just sketching ideas that didn’t feel overwhelming, then picked one that felt doable rather than “perfect.” over time, i refined it based on what actually worked and what didn’t drain me. it made launching something small feel less scary and more realistic.",
          "score": 2,
          "created_utc": "2026-02-06 05:23:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3xd44y",
          "author": "Money-Cover",
          "text": "I can’t stress this enough: nothing, and I truly mean NOTHING, matters more than a business that aligns with you personally from a skill, personality, and value position.\n\nWhen things get tough, and they will, the drive comes from within when you’re building something you believe in, that aligns with you personally, and that excites you. \n\nObviously there are caveats e.g., I like Pepsi zero, but I’m not going to try and start a company to produce it; I like Porsche cars, I’m not going to start a company to build one. You have to be realistic in goals and expectations, but having something that aligns with you is the greatest tool for surviving and growth.",
          "score": 1,
          "created_utc": "2026-02-06 16:32:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3shmy1",
          "author": "radjackmalone",
          "text": "I think people need to totally throw out the generic advice online that includes starting a business plan. Any fool can use chatGPT to write one but not everyone can execute it successfully. So I say skip it.",
          "score": 1,
          "created_utc": "2026-02-05 21:34:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3t1f57",
              "author": "joeasks",
              "text": "I am a believer in building a financial model, unless you've got an extremely passionate why. Business plans can be helpful, especially if you do the work yourself",
              "score": 1,
              "created_utc": "2026-02-05 23:14:50",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o3xkf6b",
              "author": "Delicious-Pin7594",
              "text": "\n\nDo you really think ChatGPT is good for building a business plan?\nFrom my experience, it starts hallucinating pretty fast… and the plan quickly becomes inconsistent.\nFor me, the value of a business plan isn’t the document itself, it’s the reference points it creates. It helps structure your thinking and check whether you’re actually moving on a coherent trajectory.\nWithout that, you’re executing… but without a compass.",
              "score": 1,
              "created_utc": "2026-02-06 17:07:11",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qxw0tr",
      "title": "I built an idea from this subreddit and it got 50 users within a week.",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1qxw0tr/i_built_an_idea_from_this_subreddit_and_it_got_50/",
      "author": "dot90zoom",
      "created_utc": "2026-02-06 22:28:02",
      "score": 5,
      "num_comments": 3,
      "upvote_ratio": 0.65,
      "text": "There are some serious goldmines on this subreddit.\n\nLast week I built an idea that was posted a few times throughout this subreddit, and mainly a mix of ideas, [here](https://www.reddit.com/r/Business_Ideas/comments/1gwipgp/aipowered_microskill_learning/), [here](https://www.reddit.com/r/Business_Ideas/comments/1jrki4k/selling_my_2yo_saas_learningwithai/) and [here](https://www.reddit.com/r/Business_Ideas/comments/1gwipgp/aipowered_microskill_learning/).\n\nThe app is basically \"Duolingo for Anything\".\n\nIt took me \\~4months to build, even with my degree in ML, there were a lot of challenges as I really wanted to ensure that the courses generated were Quality and built around the user's learning habits, the more the user used the app.\n\nEventually if this thing grows, I hope to have a mix of both real generated courses that users can submit, as well as AI courses for more niche topics. I wanted to know if you guys think this would be a good idea, and business model, perhaps teachers getting a commission off courses they submit (and are used).",
      "is_original_content": false,
      "link_flair_text": "Idea Feedback",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1qxw0tr/i_built_an_idea_from_this_subreddit_and_it_got_50/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o40xckg",
          "author": "Ecaglar",
          "text": "50 users in a week is solid validation. the teacher commission model is interesting but youd need to figure out quality control - ai generated stuff can be hit or miss and if you mix in human courses youll need some way to verify theyre actually good. curious what your retention looks like after week one, thats usually where learning apps struggle",
          "score": 0,
          "created_utc": "2026-02-07 04:00:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3zh852",
          "author": "tatum103",
          "text": "I’m diagnosed with adhd, so I feel like this could help me with my studies. do you mind giving me the name?\n\nalso yes, if there the human submitted courses, they will be more tailored for humans",
          "score": -2,
          "created_utc": "2026-02-06 22:45:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3zi7k2",
              "author": "dot90zoom",
              "text": "[sure, here's the App Store link](http://trycoursify.com)  \n  \nfeel free to give feedback, its still new so tell me any thing wrong\n\nit has a free trial. I will add a freemium model as it grows but currently ai credits are expensive, so I need to stay even ;-;",
              "score": -1,
              "created_utc": "2026-02-06 22:50:39",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qtzor1",
      "title": "What’s the most viable low-budget entry point for a punching machine startup?",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1qtzor1/whats_the_most_viable_lowbudget_entry_point_for_a/",
      "author": "Jealous-Parfait-951",
      "created_utc": "2026-02-02 16:26:10",
      "score": 5,
      "num_comments": 0,
      "upvote_ratio": 0.86,
      "text": "I’m exploring a low-budget startup idea and could really use some outside perspectives. I’m thinking of setting up a punching machine outside a local pub as a small pay-per-use attraction, but I’m working on a tight budget and trying to choose the most viable entry point.\n\n\nRight now, I’m torn between two options: buying an older refurbished punching machine from a local seller, or going for a new aftermarket machine that’s often sold at discounted prices on platforms like Amazon, Alibaba, and eBay. On paper, the aftermarket machines look attractive because they’re cheaper, easier to find, and sometimes come with basic warranties. At the same time, I keep hearing that refurbished older machines are generally more durable and better built, even if they come with some wear.\n\n\nMy main concerns are reliability, long-term maintenance costs, and how well either option would hold up in an outdoor or semi-outdoor pub environment. I’m also thinking about customer perception. Does the machine feel solid and legit enough to attract people to try it and keep coming back?\n\n\nFor anyone who has started small, worked with arcade-style machines, or dealt with refurbished versus aftermarket equipment, which option seems more viable for a low-budget startup like this, and why?",
      "is_original_content": false,
      "link_flair_text": "Marketing / Operational / Financial / Regularotry Advice sought",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1qtzor1/whats_the_most_viable_lowbudget_entry_point_for_a/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": []
    },
    {
      "id": "1qx3qrg",
      "title": "Match-3 attack game",
      "subreddit": "Business_Ideas",
      "url": "https://i.redd.it/viwxxtevxrhg1.png",
      "author": "Recent_Jellyfish2190",
      "created_utc": "2026-02-06 01:15:22",
      "score": 5,
      "num_comments": 0,
      "upvote_ratio": 0.86,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "App/Website Idea",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1qx3qrg/match3_attack_game/",
      "domain": "i.redd.it",
      "is_self": false,
      "comments": []
    },
    {
      "id": "1qy4sdt",
      "title": "Do you need an LLC to sell online?",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1qy4sdt/do_you_need_an_llc_to_sell_online/",
      "author": "Vengsta",
      "created_utc": "2026-02-07 04:59:30",
      "score": 5,
      "num_comments": 6,
      "upvote_ratio": 1.0,
      "text": "Hey everyone,  \n  \nSo I’ve been thinking about starting a small online store selling handmade pens. I’ve been doing a ton of research, but I keep going back and forth on whether I need to form an LLC or if I can just start selling as a sole proprietor.  \n  \nHere’s the thing, I’m not planning to quit my day job anytime soon, and I’m starting super small. Like, maybe $500 in sales a month if I’m lucky. But I’ve heard horror stories about people getting sued or having their personal assets at risk because they didn’t have an LLC. On the other hand, I don’t want to overcomplicate things or spend money on legal fees if it’s not necessary right now.  \n  \nMy cousin started selling vintage clothes on Etsy a few years ago and never bothered with an LLC. She was doing pretty well until someone claimed they got a rash from one of her sweaters (turned out they were just allergic to wool, but still). She ended up settling out of court, and it was a huge headache. Now she swears by her LLC, but I’m not sure if her situation applies to me.  \n  \nSo, do I need an LLC from the start, or can I wait until I’m making more money? For those of you who sell online, did you start with an LLC or wait until later? Any advice would be super appreciated.",
      "is_original_content": false,
      "link_flair_text": "Marketing / Operational / Financial / Regularotry Advice sought",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1qy4sdt/do_you_need_an_llc_to_sell_online/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o41h72y",
          "author": "Apprehensive_Yam1771",
          "text": "Hey! you don't need an LLC to start, but it can be beneficial once you have consistent sales or more risk.\n\nI started my own Etsy store a while ago, on the side, and what you can do, is register as a sole proprietor. It's simple, and free, but make sure to report the income on your regular taxes. \n\nThe reason you'd want to open an LLC, is to have limited liability. If someone sues your business, an LLC helps keep your personal assets (like your car, savings, etc.) separate from the business. That’s what your cousin’s situation was really about.\n\nSince it's a small business, and you're selling handmade pens specifically, your risk is relatively low, and I would definitely recommend starting as sole proprietor. If later on you decide to go full in, it might be a good idea to open an LLC once you’re making steady money or scaling up.\n\nPS. If you need help building a website or want marketing/advertising services, feel free to reach out ;)",
          "score": 2,
          "created_utc": "2026-02-07 06:34:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o41ic4e",
              "author": "AaronDoud",
              "text": "To add to this one should always understand two principals when talking about how an LLC/Corp limits liability.\n\nFirst is the idea of piercing the veil which is the legal point that the courts can choose to let a lawsuit of an LLC/Corp go directly after personal assets.  This normally happens when the corp is closely held by one or a small number of owners and said owner(s) are directly involved.\n\nSecond is they can always sue you personally even if you are just an employee. \n\nA lot of advice to small and/or new business way overhype the protection you get from an LLC.   If they sue they will go after your personal assets and nothing will stop that if you are a solo owner working in the business.  Any lawyer worth his salt will at least sue the owner in addition to the business.  \n\nLoads of reasons to have an LLC but the \"limited liability\" part needs to be framed correctly.\n\nMost small and especially new businesses have no reason to be LLCs when they are basically a relatively low paid job for the owner/worker.  \n\nOnce you get bigger, have employees, and/or have tax or other reasons to then get an LLC or other corp.",
              "score": 1,
              "created_utc": "2026-02-07 06:45:14",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o44y5ww",
          "author": "BusinessAnywhereio",
          "text": "You do not need an LLC to sell online. In most states you can start today as a sole proprietor and report the income on your personal taxes.\n\nWhat an LLC does (and doesn’t) do:\n\n* It can help separate business liabilities from your personal assets, if you run it properly.\n* It does not stop someone from suing you. It just changes what’s typically at risk.\n* If you mix funds, skip basic paperwork, or personally cause harm (negligence), the “shield” can be weaker.\n\nFor handmade pens, the bigger early risks are usually practical, not legal structure:\n\n* Sales tax and permits: you may need a sales tax permit and to collect/remit sales tax depending on where you sell and where buyers are.\n* Local business license and a DBA/fictitious name filing if you sell under a shop name.\n* Product liability: consider simple product liability insurance once you’re shipping regularly, especially if you use finishes, adhesives, or include small parts.\n\nA common path (and what we see at BusinessAnywhere) is:  \nStart as a sole proprietor with a separate bank account and clean records, then form an LLC once sales are consistent, you’re taking larger orders, or you’re worried about personal asset exposure.",
          "score": 2,
          "created_utc": "2026-02-07 20:14:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o41hikn",
          "author": "whoever12",
          "text": "No , you do not.",
          "score": 1,
          "created_utc": "2026-02-07 06:37:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o426ypg",
          "author": "Firm-Organization374",
          "text": "I would love to design your professional logo.",
          "score": 1,
          "created_utc": "2026-02-07 10:42:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o48za6i",
          "author": "WrestlingDadPA",
          "text": "You don't \"need\" an LLC, you'll most likely never get sued anyway... and a cheap insurance policy protect you there. However, an LLC is a cleaner business entity, and you want to separate your business money (with a checking account and separate taxes) from personal, and an LLC costs $125 and about an hour of your time. No legal fees required, it's honestly super super easy. ChatGPT will walk you right through it, along with the ancillary steps of opening accounts, getting your EIN number, etc. I would never have a sole proprietorship, I have multiple LLC's and S-corps.",
          "score": 1,
          "created_utc": "2026-02-08 13:30:53",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qu1ne2",
      "title": "What’s a cool name for this tool?",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1qu1ne2/whats_a_cool_name_for_this_tool/",
      "author": "Deep-Wealth8494",
      "created_utc": "2026-02-02 17:34:31",
      "score": 4,
      "num_comments": 21,
      "upvote_ratio": 0.84,
      "text": "I kept running into deals that looked real on the surface.\n\nGood conversations. Real interest. Then they just stalled forever.\n\nOut of frustration I started building a small tool that sanity checks a company before you spend weeks chasing the deal. It tries to flag early whether there is actually a path to buying or if internal blockers will say no later.\n\nBefore I go further with it I am curious how other Saas founders handle this.\n\nHow do you decide early that a deal is not worth pursuing?\n\nWhat signals do you trust the most?",
      "is_original_content": false,
      "link_flair_text": "Need a name",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1qu1ne2/whats_a_cool_name_for_this_tool/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o36uqhr",
          "author": "AutoModerator",
          "text": "Thank you for submitting your request for a business name!\n\nTo help our community members provide the most fitting and creative suggestions, please ensure your post includes:\n\n1. A detailed description of your business, its services, target audience, and unique value proposition.\n2. Any names you've already considered, including those you like and those you don't, and why. This helps avoid suggestions you've already contemplated and guides the community's creativity in the right direction.\n\nThe more context you provide, the better the suggestions you'll receive. Thanks for helping us help you find the perfect name for your business!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Business_Ideas) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-02 17:34:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o37mg6e",
          "author": "Dusskulll",
          "text": "Fraudar -- Fraud Radar, howdah",
          "score": 1,
          "created_utc": "2026-02-02 19:40:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o37mwvl",
              "author": "Deep-Wealth8494",
              "text": "Ah yes I’m a fraud because I built a tool to try and help people you got me! I’m sure you can tell by how I also didn’t ask anyone to try it out on this sub! You got me!",
              "score": 1,
              "created_utc": "2026-02-02 19:42:49",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o37n77k",
                  "author": "Dusskulll",
                  "text": "Your question is what should you call a tool that finds frauds\n\nMy answer was Fraud Radar **TO YOUR QUESTION** \n\nI am not saying YOU are the fraud",
                  "score": 1,
                  "created_utc": "2026-02-02 19:44:09",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o37vszl",
          "author": "theredhype",
          "text": "This requires a tool? \n\nAgencies and salespeople just learn how to quickly qualify a lead. \n\nWhat’s the budget. What’s the timeline / urgency. What’s the size / scope. What internal resources does the client allocate to supporting implementation. \n\nIt’s pretty easy to filter out bad leads if you know your industry, client types, etc.",
          "score": 1,
          "created_utc": "2026-02-02 20:24:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o37w9za",
              "author": "Deep-Wealth8494",
              "text": "Totally agree that good agencies learn to qualify quickly.\n\nWhat I kept running into was situations where the lead looked qualified on paper and even in early calls, but the deal still died later because of internal stuff you do not always see up front.\n\nThe tool is less about replacing qualification and more about pressure testing assumptions early. Basically a second opinion before spending weeks on it.\n\nCurious how you personally catch those hidden blockers early.",
              "score": 1,
              "created_utc": "2026-02-02 20:27:08",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o37y1sj",
                  "author": "theredhype",
                  "text": "What other flags do you need? E.g.\n\nAre executives bought in to the effort?  \nWho makes the buying decisions?  \nWhat other departments are involved?  \nWhat systems does this need to integrate with…\n\nI’m failing to imaging what a tool does that isn’t still basically a checklist for lead qualifying.",
                  "score": 1,
                  "created_utc": "2026-02-02 20:35:35",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o3821g5",
                  "author": "theredhype",
                  "text": "Perhaps this could be used as a general training tool for new salespeople. Examples of how to surface the various insights you need through conversation with a client would be good for the inexperienced.",
                  "score": 1,
                  "created_utc": "2026-02-02 20:54:22",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o394q9r",
          "author": "Drumroll-PH",
          "text": "I like names that signal clarity and filtering, not hype. Something like DealCheck, Greenlight, Pathclear, or CloseProof fits what you described. As for deals, I learned to trust budget clarity and decision ownership early, if those are fuzzy, the deal usually dies.",
          "score": 1,
          "created_utc": "2026-02-03 00:10:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3bt0nu",
          "author": "ChestChance6126",
          "text": "Name aside, the idea resonates. Early disqual isn’t about interest, it’s about the ability to decide. I usually look for three signals fast: a clear economic buyer, an explicit decision timeline, and evidence they’ve bought something similar before. If any of those stay fuzzy after a few calls, the deal usually stalls, no matter how good the conversations feel.",
          "score": 1,
          "created_utc": "2026-02-03 11:58:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o43v6fc",
              "author": "atlas_fairwind",
              "text": " Totally feel you on that! Those early signals are crucial. I like your emphasis on a clear economic buyer and decision timeline. It makes all the difference to avoid wasting time on deals that just fizzle out later. I’ll definitely keep that in mind for my tool!",
              "score": 1,
              "created_utc": "2026-02-07 16:58:06",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3mcdb8",
          "author": "iWantBots",
          "text": "Names mean nothing marketing means everything",
          "score": 1,
          "created_utc": "2026-02-04 23:13:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3rgeyt",
              "author": "Forsaken_Lie_8606",
              "text": ",disagree slightly names signal credibility in b2b sales tho. fundable vs greenlight create different first impressions. but agree on marketing being the long-term differentiator",
              "score": 1,
              "created_utc": "2026-02-05 18:39:08",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qtisjt",
      "title": "Feedback on a concierge-style subscription to automate birthday gifts (flowers)",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1qtisjt/feedback_on_a_conciergestyle_subscription_to/",
      "author": "jademaester",
      "created_utc": "2026-02-02 02:37:28",
      "score": 3,
      "num_comments": 7,
      "upvote_ratio": 0.81,
      "text": "Looking for feedback.  Idea is a concierge service for busy, high net worth individuals to never miss an important birthday. Basically paying for peace of mind and automating bday gift giving. \n\nI would create a form for people to fill out with names, birthdays, budget and gift (would likely start with flowers). I would then send out the bday gifts so it would be set it and forget it for the customer. Value is removing cognitive load and avoiding missed birthdays, not the flowers themselves.\n\nI would do an annual fee and then take a service fee on each delivery. There’s obviously ways to automate, get better bulk pricing, etc. down the line but right now I’m testing the idea and then working to get initial customers (probably waive the annual fee for their first few) and doing everything manually. \n\nThoughts? Feedback? Trying to pressure test if there’s something here. ",
      "is_original_content": false,
      "link_flair_text": "Idea Feedback",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1qtisjt/feedback_on_a_conciergestyle_subscription_to/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o33jkxi",
          "author": "theredhype",
          "text": "Like this? https://madianite.com/",
          "score": 1,
          "created_utc": "2026-02-02 04:02:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o33k2c5",
          "author": "theredhype",
          "text": "It's an assumption you'll have to test, but I suspect HNWIs probably already delegate this task to an executive assistant, family member, etc.",
          "score": 1,
          "created_utc": "2026-02-02 04:05:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o33k8nb",
          "author": "theredhype",
          "text": "Most of the gift giving platforms I've seen focus on corporate, group, event, or special event niches. It's a guess, but I suspect some of them probably pivoted that direction after finding that people wouldn't use this dynamic for close personal gifts.",
          "score": 1,
          "created_utc": "2026-02-02 04:06:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o35hpjt",
          "author": "ChestChance6126",
          "text": "The value prop makes sense, but the risk isn’t flowers, it’s trust and edge cases. Miss one date or send the wrong thing, and the whole premise collapses fast, especially with high net worth clients who have zero patience for ops mistakes.\n\nI’d pressure test willingness to pay before building anything fancy. Manually onboard a handful of people and see if they actually hand over a list of names and budgets, and let you handle it without micromanaging. That behavior tells you more than survey feedback.\n\nAlso, I’d consider whether birthdays alone are enough surface area. The real leverage might be “important dates I don’t want to think about” rather than one occasion. If it stays too narrow, churn could be brutal once the novelty wears off.",
          "score": 1,
          "created_utc": "2026-02-02 13:33:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3kyw5x",
          "author": "springcaterpillar",
          "text": "The HNWI angle feels like an uphill battle since most already have someone handling this. Might be worth testing with busy professionals who don't have assistants but would pay for the automation. The cognitive load argument is solid, just maybe aimed at the wrong segment.",
          "score": 1,
          "created_utc": "2026-02-04 19:12:31",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qxfhso",
      "title": "21yo Merchant Mariner saving up capital. Want to build a business/invest but I’m at sea 6 months a year. Where should I start?",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1qxfhso/21yo_merchant_mariner_saving_up_capital_want_to/",
      "author": "Fuzzy_Examination_96",
      "created_utc": "2026-02-06 11:48:05",
      "score": 3,
      "num_comments": 5,
      "upvote_ratio": 0.81,
      "text": "Hi Reddit! I’m 21, and I work as a sailor. My job keeps me away at sea for long periods, which gives me two things: a decent salary to invest and a lot of time to think/learn, but zero physical presence on land.\n\nI don’t want to be a sailor forever. I want to build a business that I can eventually scale or manage remotely.\n\nI have no physical access to a shop/office for months.\n\nSaving up a good portion of my income.\n\nI have never run a business before. \n\nWhat kind of business models would you recommend for someone with my lifestyle? Should I focus on high-yield investments, or start building a digital brand/agency while I’m on watch? I’d love to hear some \"out of the box\" ideas",
      "is_original_content": false,
      "link_flair_text": "What business do I start?",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1qxfhso/21yo_merchant_mariner_saving_up_capital_want_to/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o3zb9kr",
          "author": "choclate45",
          "text": "a service based agency model could be your best bet for now. add that to the investments you are already doing and you should be set for when you retire/deboard in the next 5 years.\n\njust play around with your skills and interest when you off watch, groom them to the degree that you confident to render a service and start from there. also, please don't grind too much in your off hours, safety at sea is paramount. ahoy!",
          "score": 1,
          "created_utc": "2026-02-06 22:14:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3zfgu0",
          "author": "Ok_Stay_8530",
          "text": "Do you have any skills / experience that you can productitize for a specific niche?",
          "score": 1,
          "created_utc": "2026-02-06 22:36:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o405icc",
          "author": "Solid_Mongoose_3269",
          "text": "Stay a merchant mariner. My dad was a chief engineer, and barely got his white jumpsuit dirty. Ai isn’t coming after those jobs",
          "score": 1,
          "created_utc": "2026-02-07 01:04:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o40xeob",
          "author": "Ecaglar",
          "text": "your constraint is actually an advantage for certain business models. anything that can run async while youre at sea is perfect. content sites, digital products, or investing in index funds all work. the agency model mentioned by another commenter is tricky because clients usually want fast responses. id lean toward building something with your unique perspective - content about life at sea, or tools for other mariners. you know that world way better than anyone on land",
          "score": 1,
          "created_utc": "2026-02-07 04:00:58",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qwl9sl",
      "title": "Do you think tokenization tools will become their own business category?",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1qwl9sl/do_you_think_tokenization_tools_will_become_their/",
      "author": "CategoryLong4026",
      "created_utc": "2026-02-05 13:28:13",
      "score": 3,
      "num_comments": 1,
      "upvote_ratio": 0.81,
      "text": "Most people talk about tokenization as a feature, but I’m starting to see more standalone tools built around it.\n\nPlatforms like **VestaScan** suggest there may be room for dedicated businesses focused only on tracking and understanding tokenized assets.\n\nDo you think this becomes a real market, or just a temporary niche?",
      "is_original_content": false,
      "link_flair_text": "Idea Feedback",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1qwl9sl/do_you_think_tokenization_tools_will_become_their/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": []
    }
  ]
}