{
  "metadata": {
    "last_updated": "2026-02-03 17:18:13",
    "time_filter": "week",
    "subreddit": "Business_Ideas",
    "total_items": 20,
    "total_comments": 137,
    "file_size_bytes": 169441
  },
  "items": [
    {
      "id": "1qspnpb",
      "title": "I analyzed trucking bankruptcies. Carriers are losing $226K/truck while competitors run illegal ops.",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1qspnpb/i_analyzed_trucking_bankruptcies_carriers_are/",
      "author": "Ogretribe",
      "created_utc": "2026-02-01 05:25:26",
      "score": 66,
      "num_comments": 37,
      "upvote_ratio": 0.9,
      "text": "I've been building a pipeline that scrapes court filings, DOT enforcement actions, and industry cost benchmarks to find operational failures - basically where businesses lose money due to broken processes.\n\nJust finished a deep dive into **Trucking & Freight** and wanted to share what stood out.\n\n**The method:** I pull data from FMCSA compliance records, ATRI cost benchmarking studies, and commercial insurance loss data. Then cross-reference with bankruptcy filings to estimate actual dollar impact.\n\n**Operating Costs Hit $2.26/Mile While Rates Crater**\n\nNon-fuel operating costs alone reached $1.779 per mile in 2024 - the highest in 17 years of tracking. Meanwhile, the freight recession drove rates below breakeven in most markets. We're talking $35,600 to $226,000 per truck annually just bleeding out because fuel, insurance, maintenance, and driver wages are climbing faster than carriers can raise prices. The math just doesn't work anymore.\n\nBased on documented cases from ATRI industry benchmarking affecting every carrier regardless of size.\n\n**Foreign Fleets Running Tampered ELDs and Underpaying Drivers 40%**\n\nThis one's wild. Foreign-owned operations are running drivers with tampered electronic logging devices to exceed federal hours-of-service limits. They're paying 40% below market rates and undercutting legitimate operators on price while violating DOT safety regs. Law enforcement doesn't have the resources to police it effectively, so legal carriers just... lose contracts to people breaking the law. Estimated $100K-$300K in lost revenue for typical small operations.\n\nDocumented through DOT enforcement actions, though actual prevalence is likely way higher than reported.\n\n**Insurance Premiums Up 36% While Nuclear Verdicts Multiply**\n\nCommercial trucking insurance exploded 36% over eight years. The litigation environment got hostile - $10M+ jury awards are becoming common in truck accident cases. Insurers don't care about your individual safety record anymore, they're just jacking rates across the board. For a 10-truck operation, you're looking at $45K-$180K annually just for coverage. Fatal crashes are up 40% since 2014 because regulatory changes let less-qualified people get CDLs, which feeds right back into the insurance nightmare.\n\nIndustry-wide challenge documented across all major commercial trucking insurers.\n\n**The Working Capital Black Hole**\n\nShippers pay net-30 to net-60+ while you're covering fuel, wages, and maintenance daily. You're essentially financing your customers' operations for 30-90 days. Most new carriers don't realize they need $50K-$200K in working capital just to bridge the gap between expense and revenue. This cash flow mismatch is a contributing factor in the majority of small carrier bankruptcies.\n\nDocumented in payment delay cases and factoring industry analysis.\n\n**What I'm seeing:** There's no carrier-focused rate optimization platform despite persistent rate compression. No driver competency assessment tools despite the 40% crash increase. The infrastructure just doesn't exist to help legitimate operators compete.\n\nI have 15 more documented gaps in this industry with solution blueprints (pricing models, where to find first clients, estimated launch costs).\n\nDoes anyone here actually work in this niche? Is it really this bad on the inside?\n\nI have a document with the full raw data list. If you want to dig in, let me know and I'll DM it.\n\nIf you're in a different industry and want me to run the same analysis, tell me which one.\n\n",
      "is_original_content": false,
      "link_flair_text": "Idea Feedback",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1qspnpb/i_analyzed_trucking_bankruptcies_carriers_are/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o2yqubb",
          "author": "DreamingForProperty",
          "text": "Been working in transportation industry for 8 years....trucks are the wild wild west of the U.S. No one has any idea lol.\n\nWait till you read about companies sponsoring work visa's to get drivers into the united states and then forcing them into sleepers for dirt cheap prices for years to pay of the debt of the visa.....the company then can run shipments even cheaper then anyone...which also drives the prices down...\n\n  \nThe amount of double brokering going on, fake MC's, phony cdl schools, the list can go one for awhile.  \n   \nYou dont need a raw list of data to see this either. Work at a brokerage for 3 months and youll see/hear it all.",
          "score": 12,
          "created_utc": "2026-02-01 13:13:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2zp37v",
              "author": "mancala33",
              "text": "Is there an opportunity to make a good living while cleaning up this mess? What is the low hanging fruit or obvious things that can be fixed?",
              "score": 2,
              "created_utc": "2026-02-01 16:16:08",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2zzqxv",
                  "author": "DreamingForProperty",
                  "text": "Hard to say honestly, lots of startups have been created to combat these issues, like alternative versions of carrier411 with more details/updates. But you would need experience and backend work to make that doable.\n\nFraud is the least of truckers worries right now, margins are getting tighter then ever and carrier companies are going out of business left and right.\n\n  \nHustle: Right now, if I were to start a company to help out carriers/companies, it would be selling pre-trip inspections for the company and filling up there trucks. Specifically to larger fleets of 20+ that are contracted locally. Finding ways to save them money...essentially and continue operations without a hiccup.\n\nReason: The people that drive trucks.....are slow.(not all, but its embarrassing) They fill up trucks with gas all the time or put diesel in the def, crash into bridges.... They will straight up drive off the lot without seeing they have 2 blown out tires and the brakes are smoking..... This costs the company so much time and money....drivers will do anything to avoid inspections and working. If you could secure a deal per truck that you do a inspection on each one, you would save them so much time....and nip the issues in the butt before having to call a tow truck on the other side of the city to bring to a shop to fix..\n\n  \nanyways good luck",
                  "score": 4,
                  "created_utc": "2026-02-01 17:05:01",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2yy759",
          "author": "crdog",
          "text": "Very interesting. I do work in this space (wouldn't call it niche there's a lot of us) in particular I am upper mgmgt at a larger private carrier, so im privy to the Financials.\n\nMost carriers run around 95% operating ratio. The good ones can achieve 85 to 90. Margins have always been slim. One thing you missed in your calculations is asset depreciation.\n\nRrs your analysis is spot on in regards to the challenges we face.",
          "score": 7,
          "created_utc": "2026-02-01 13:58:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2yu99w",
          "author": "RangeBow8",
          "text": "One portion that this doesn’t capture is driver retention. Industry average for driver turnover is. North of 70% annually. This list of factors is endless and there’s is nothing stopping drivers from just going from place to place non-stop because the national shortage for drivers is more than 100,000. \n\nI’d argue your point about working capital is something every company, especially a contractor endures, it’s not unique to trucking to have to carry costs until AR catches up.",
          "score": 5,
          "created_utc": "2026-02-01 13:35:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o30gbmk",
          "author": "Background_Unit_6535",
          "text": "Don't worry. Help is on the way. Driverless autonomous trucks will reduce costs dramatically and increase margins. This is all \"planned\" human obsolesces.",
          "score": 4,
          "created_utc": "2026-02-01 18:20:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o30gjd6",
              "author": "Ogretribe",
              "text": "Fair enough",
              "score": 1,
              "created_utc": "2026-02-01 18:21:01",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o330mrv",
              "author": "marcoshid",
              "text": "Yeah, I’ve been saying this for the last couple of years, a lot of this feels planned. Even the whole “driver shortage” narrative. It all seems like a setup to push driverless trucks out faster and with less fuss.\n\nEdit: cleaned up my misspellings and grammar",
              "score": 1,
              "created_utc": "2026-02-02 02:11:05",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2z0qfm",
          "author": "Local-Chart-2394",
          "text": "Interesting analysis, just note down transports (DJT) is up significantly now in 2026 vs where it was in 2024, trucking is cyclical due to nature of supply & demand and small operators do naturally go bankrupt first in rough environments",
          "score": 4,
          "created_utc": "2026-02-01 14:13:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2xfgb9",
          "author": "LifeTelevision1146",
          "text": "I don't work in the niche, I help the niche with ops",
          "score": 3,
          "created_utc": "2026-02-01 06:21:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2xl2ix",
              "author": "Ogretribe",
              "text": "Any wishes?",
              "score": 1,
              "created_utc": "2026-02-01 07:10:03",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2xp7g3",
                  "author": "LifeTelevision1146",
                  "text": "Will ask my clients",
                  "score": 2,
                  "created_utc": "2026-02-01 07:47:41",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2xifm1",
          "author": "moeterminatorx",
          "text": "There’s an owner operator Sun as well as trucking sub. You may get more response there.",
          "score": 3,
          "created_utc": "2026-02-01 06:47:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2xl2tz",
              "author": "Ogretribe",
              "text": "Thanks!",
              "score": 1,
              "created_utc": "2026-02-01 07:10:07",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o32yx13",
          "author": "R12Labs",
          "text": "So what do we do with this information?",
          "score": 3,
          "created_utc": "2026-02-02 02:01:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2zo7rx",
          "author": "_flipcannon",
          "text": "From ‘21-‘25, for example, we saw an almost 100% increase in insurance rates for one truck w/ spotless safety record. All while rates more than halved. I’m getting offers now in my inbox for dry van loads that pay  $200. 😂😂",
          "score": 2,
          "created_utc": "2026-02-01 16:12:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o35suvp",
          "author": "SuchPrior2313",
          "text": "This was a great read. I’d love to see the full data/documents",
          "score": 2,
          "created_utc": "2026-02-02 14:34:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o388x8g",
          "author": "Mysterious-String149",
          "text": "Nice. Would love to see the full data.",
          "score": 2,
          "created_utc": "2026-02-02 21:26:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2z8gy1",
          "author": "No-Archer6181",
          "text": "Hi",
          "score": 2,
          "created_utc": "2026-02-01 14:55:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o30bjcs",
              "author": "Ogretribe",
              "text": "dm?",
              "score": 1,
              "created_utc": "2026-02-01 17:58:44",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o30kcl6",
          "author": "SpiritGood123",
          "text": "Great write up, would love to see the full data.",
          "score": 3,
          "created_utc": "2026-02-01 18:37:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o30kn7s",
              "author": "Ogretribe",
              "text": "Dm you)",
              "score": 1,
              "created_utc": "2026-02-01 18:39:13",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2zoe84",
          "author": "TheBigJervis",
          "text": "Please dm me the documents",
          "score": 1,
          "created_utc": "2026-02-01 16:12:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o30bdpz",
              "author": "Ogretribe",
              "text": "done",
              "score": 1,
              "created_utc": "2026-02-01 17:58:03",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o337nie",
          "author": "MezcalCC",
          "text": "Would like to have the data since you are offering. ",
          "score": 1,
          "created_utc": "2026-02-02 02:50:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3531y4",
          "author": "TheFirstMercury",
          "text": "I would love to see the documents",
          "score": 1,
          "created_utc": "2026-02-02 11:53:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o392ujx",
          "author": "Chemical-Gap1385",
          "text": "I would like to see the one for trucking. Was in industry for years and possibly looking to get back in. I appreciate the time and effort.",
          "score": 1,
          "created_utc": "2026-02-02 23:59:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o39t93d",
          "author": "Walksthemound",
          "text": "Would love the data. Own a small logistics company.",
          "score": 1,
          "created_utc": "2026-02-03 02:27:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2y9p9x",
          "author": "ledoscreen",
          "text": "Great work and interesting data. Thank you.\n\nHowever, looking at your numbers, I see a different story.\n\n1st The destructive role of the State. You seem to treat regulations like the Ten Commandments, as if they are unchangeable laws of nature. In reality, they are artificial cost drivers imposed by third parties who have no skin in the game. You are analyzing the symptoms, but the disease is the regulatory burden itself.\n\n2) Terminology error. You label carriers 'unscrupulous' simply for not following these arbitrary rules. This is incorrect. A business is only unscrupulous if it fails to fulfill obligations to its customers, employees, or suppliers.\n\nThose who successfully bypass arbitrary bureaucratic hurdles are not 'bad'. They are actually performing a huge service to society. By evading inefficient rules, they increase productivity and lower prices for the consumer. They keep the market alive while compliant but inefficient competitors fail.",
          "score": -5,
          "created_utc": "2026-02-01 10:56:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2yg4bd",
              "author": "Canofmeat",
              "text": "This is a bad take. I prefer that my family and me not be killed or maimed by a fatigued, inexperienced truck driver.",
              "score": 11,
              "created_utc": "2026-02-01 11:52:52",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o2yvi43",
              "author": "mathaiser",
              "text": "I mean, the guy says accidents/deaths are up 46% because the CDL went lax on their rules.  \n\nSo sure, expensive and we live,  go cheap and a few more will die but we will be ok.\n\nThis is the thinking of a Boeing executive man…. \n\nI want less government involvement, more free market.  But we can’t trust the bad actors out there.",
              "score": 6,
              "created_utc": "2026-02-01 13:42:49",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2zm0i7",
                  "author": "ledoscreen",
                  "text": "\\> the guy says accidents/deaths are up 46% because the CDL went lax on their rules  \n  \nI would also like to take a look at the study that served as the source of information for this guy.",
                  "score": -2,
                  "created_utc": "2026-02-01 16:01:47",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o2yd057",
              "author": "Ogretribe",
              "text": "thx for comment",
              "score": 1,
              "created_utc": "2026-02-01 11:26:14",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o330g7a",
          "author": "marcoshid",
          "text": "What do you mean by foreign carriers?\n\nI'm pretty interested in this data, I've worked with many carriers and still help quite a few out from idea all the way through daily operations.",
          "score": 0,
          "created_utc": "2026-02-02 02:10:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o332c14",
              "author": "brazucadomundo",
              "text": "Owned by someone brown.",
              "score": 2,
              "created_utc": "2026-02-02 02:20:44",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qt2lp7",
      "title": "As an introvert, I’d rather help creators with their back end",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1qt2lp7/as_an_introvert_id_rather_help_creators_with/",
      "author": "LilTiit",
      "created_utc": "2026-02-01 16:13:50",
      "score": 31,
      "num_comments": 24,
      "upvote_ratio": 1.0,
      "text": "I checked it and all surveys asking kids their dream career find that the winner by far is youtuber, tiktok creator, streamer, etc. The supply of creators is growing every single year because the internet and phones are becoming more and more accessible, especially in third world countries.\n\nLuckily, that also means demand is growing for people who help monetize views and build boring backend systems.\n\nIf you have the discipline to put your head down and focus on boring back end tasks without filming yourself every single second (unlike creators), then getting clients will not be a problem. I’ve had to keep raising my fee just to avoid taking on more work than I can handle.\n\nThis also works with businesses. Not because owners are dopamine-addicted like creators, but because they’re just old. For example, I work with a crane rental company that rents industrial cranes for high-rise construction. I help them find contracts for 15 cranes per year totaling roughly $6M in profit for them. My 5% commission on that is not bad.\n\nI guess ask me anything, just wanted to give hope to introverts still starting out. You don’t need to be public and exposed online to make money.\n",
      "is_original_content": false,
      "link_flair_text": "A How-To Guide that no one asked for",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1qt2lp7/as_an_introvert_id_rather_help_creators_with/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o31bubb",
          "author": "aBitofRnRplease",
          "text": "Wish I had a business brain. I see posts like this and know I can handle the basics technicalities but not the attitude. Good for you. Appreciate the read. ",
          "score": 3,
          "created_utc": "2026-02-01 20:47:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o31c7an",
              "author": "[deleted]",
              "text": "[deleted]",
              "score": 1,
              "created_utc": "2026-02-01 20:49:46",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o31dzxp",
                  "author": "aBitofRnRplease",
                  "text": "Hmm not sure. Maybe it's a drive thing? The thought of trying to value my skills and then to sell them to others is massively unappealing. I'm a teacher and enjoy not having to sell things to anyone... But I know I've got the skills to run a business, from a technical point of view, but I'm not aggresive or pushy or willing to charge more than a simple profit for work. I've done graphic design and worked with publishers on stuff, but I never made any decent money cos I just don't have that drive, attitude or perhaps willingness to value myself financially. ",
                  "score": 1,
                  "created_utc": "2026-02-01 20:58:40",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o31zl20",
          "author": "Single-Desk9428",
          "text": "What does building a backend for creators look like? Like what do you actually do :)",
          "score": 3,
          "created_utc": "2026-02-01 22:44:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o34jd6h",
              "author": "LilTiit",
              "text": "Lets take IG fitness influencer for example\n\n* I’ll help him develop a scalable product, like 1:1 coaching calls or pre-recorded tutorial videos\n* I build him a really effective landing page\n* Help start building an email list\n* Set up automations for his IG page, like ‘Comment “DIET” for a free diet plan’\n* Send out email sequences, etc.\n\nPut broadly, goal is turning views/attention into money, so I do whatever to build a bridge between those two :)",
              "score": 2,
              "created_utc": "2026-02-02 08:53:19",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o357gli",
                  "author": "VanitasPelvicPower",
                  "text": "Will you help me?I am ready to launch an app and a video course . My niche is boring which no one wants to talk about.\nI have 25 years experience and have developed a protocol for men to overcome urine leakage following removal of cancerous prostate .\nMen as young as 45 have to wear diapers to prevent urine leakage. As you can imagine it is extremely demoralizing for men.\nI do have a client list of 3000 very grateful patients many of them engineers since I live in the Space coast of Florida.\nThank you in advance 🙏🏻",
                  "score": 3,
                  "created_utc": "2026-02-02 12:27:01",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o311jb0",
          "author": "[deleted]",
          "text": "[deleted]",
          "score": 2,
          "created_utc": "2026-02-01 19:57:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3128jy",
              "author": "LilTiit",
              "text": "Thanks!",
              "score": 1,
              "created_utc": "2026-02-01 20:00:54",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o314i9z",
                  "author": "PlayWithMia",
                  "text": "Mind if I pick your brain if you have a moment?",
                  "score": 2,
                  "created_utc": "2026-02-01 20:11:53",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o31zjr3",
          "author": "WaNaBeEntrepreneur",
          "text": "How did you find tasks or clients?\n\nI'm a very experienced software developer (read: probably older than you) who is also introvert and a homebody, so I don't have any connections.",
          "score": 2,
          "created_utc": "2026-02-01 22:44:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o329xi0",
              "author": "Wide_Brief3025",
              "text": "I've had good luck joining creator focused forums and Discord groups to connect with people needing backend help. If you want a more passive approach, there are tools like ParseStream that watch places like Reddit and Quora for specific keywords so you get notified when someone is looking for your skills. Makes finding gigs much less stressful, especially if you prefer to work behind the scenes.",
              "score": 2,
              "created_utc": "2026-02-01 23:41:14",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o336zz8",
                  "author": "WaNaBeEntrepreneur",
                  "text": "Thanks for the reply. Where did you find the forums and group?",
                  "score": 2,
                  "created_utc": "2026-02-02 02:47:05",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o34ip1v",
              "author": "LilTiit",
              "text": "Right now just getting ton of referrals, but if I had to start from 0 I’d probably start DMing really small creators on IG and offer them to work for free, then use them as a case study and continue DMing larger and larger creators over time\n\nAre you a software developer as a freelancer or running like an agency?",
              "score": 2,
              "created_utc": "2026-02-02 08:46:59",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o34o7cj",
                  "author": "WaNaBeEntrepreneur",
                  "text": "I'm a software developer with a regular 9-5 job.",
                  "score": 1,
                  "created_utc": "2026-02-02 09:40:49",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o32ttgq",
          "author": "Drumroll-PH",
          "text": "This really resonates with me. I am an introvert too and most of my wins came from doing the boring backend work others avoid. You can create real value without being visible or loud.",
          "score": 2,
          "created_utc": "2026-02-02 01:32:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o34kbra",
              "author": "LilTiit",
              "text": "And we are still getting respected. Everybody thinks that since we are not 'famous' we are invisible, but in my experience everybody that even remotely knows me, has like a loyal type of respect towards me. Like way stronger respect than between 2 egotistical celebrities I expect. Does it make sense :D?",
              "score": 1,
              "created_utc": "2026-02-02 09:02:34",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o33kike",
          "author": "Warm_Ad3441",
          "text": "Everyone's trying to be the face of their business when the real money is in being the invisible person making the face look good. The crane rental example is perfect.. nobody wakes up wanting to do lead gen for industrial equipment, but that's exactly why it pays.",
          "score": 2,
          "created_utc": "2026-02-02 04:08:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o34kt22",
              "author": "LilTiit",
              "text": "Exactly, I personally think that you’re going to get compensated with extra money if you are capable of putting your ego aside and doing something without instant glamour or recognition\n\nAre you running a business?",
              "score": 1,
              "created_utc": "2026-02-02 09:07:20",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o35k2k2",
          "author": "planet_alex",
          "text": "This will be a growing business. I consult small businesses, and they ask for this all the time. The problem is, even though I can facilitate nearly everything easily since I've been doing it so long, I am not really a creator in that sense. I know \"what\" to do... but I can't get in there and actually create anything. This is a big deal. Glad you brought this to light.",
          "score": 2,
          "created_utc": "2026-02-02 13:46:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o36bb7d",
          "author": "gardenia856",
          "text": "The main point here is that “boring” backend work is where the quiet money is, and you’re spot on to lean into that as an introvert.\n\nThe next level is productizing what you do so you’re not just selling hours. Turn your process into a simple package: audit, fix, then monthly optimization. Even a basic playbook like “lead capture → nurture → offer → follow-up” you run for every creator or business lets you scale, hire help, and eventually step out of ops.\n\nI’d also split by niche: one track for creators (funnels, fan monetization, sponsorship systems) and one for old-school businesses (lead gen, quoting, follow-up automations). Tools like HighLevel or HubSpot for the plumbing, Ahrefs or Similarweb for research, and Pulse alongside those to watch Reddit for raw buyer questions and language you can plug straight into your funnels.\n\nMain point: if you can systemize backend value instead of chasing attention, you can quietly build something big and defensible.",
          "score": 2,
          "created_utc": "2026-02-02 16:04:53",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qp57a6",
      "title": "Here's the secret to building upon a successful startup idea",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1qp57a6/heres_the_secret_to_building_upon_a_successful/",
      "author": "VishuIsPog",
      "created_utc": "2026-01-28 07:53:11",
      "score": 27,
      "num_comments": 13,
      "upvote_ratio": 1.0,
      "text": "I used to believe the hardest part of building a startup was coming up with a completely original idea. Every new concept felt exciting at first, but most of them fell apart once I tried to imagine real customers paying for them.\n\nRecently, while browsing StartupIdeas DB (i came across it on google) I noticed something interesting. Many of the most compelling businesses weren’t novel at all. They were existing ideas executed better, adapted to a new niche, or brought to a different market. In hindsight, this pattern shows up everywhere once you start looking for it.\n\nCopying gets a bad reputation, but most successful startups are really just proven businesses with a twist. Sometimes the twist is better UX, sometimes pricing, sometimes distribution, and sometimes geography. Very few are truly “from scratch” innovations.\n\nBuilding something completely new often means educating customers, validating demand the hard way, and making expensive mistakes no one else has made yet. Copying a business that already works shifts the challenge from “will this idea work?” to “can I execute better or differently?”, which feels like a much more solvable problem.\n\nI’m curious how others here think about this. Have you had more success innovating versus adapting? Where do you draw the line between copying and learning? And do you have examples of unoriginal ideas that worked surprisingly well for you?",
      "is_original_content": false,
      "link_flair_text": "A How-To Guide that no one asked for",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1qp57a6/heres_the_secret_to_building_upon_a_successful/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o26u0j1",
          "author": "ChestChance6126",
          "text": "I would like to agree with this. execution and distribution matter way more than novelty in practice. starting from a proven model turns the problem into positioning and ops, which is much easier to test and fix.",
          "score": 3,
          "created_utc": "2026-01-28 10:11:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o26vrk4",
              "author": "VishuIsPog",
              "text": "Agreed. Once demand is proven, it’s no longer about guessing—it’s about positioning, distribution, and running the ops better. Those are hard, but they’re fixable. Novelty just adds unnecessary risk",
              "score": 2,
              "created_utc": "2026-01-28 10:27:04",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o285sgn",
          "author": "Odd_Brother_5635",
          "text": "I’ve come to the same conclusion over time.\n\nOriginality is overrated early on — *execution risk* is the real killer. Copying something that already works doesn’t remove difficulty, it just shifts it to areas you can actually control: distribution, positioning, UX, and speed.\n\nMost people underestimate how hard those are anyway.",
          "score": 2,
          "created_utc": "2026-01-28 15:12:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o28jmfn",
              "author": "VishuIsPog",
              "text": "Well put. Copying doesn’t make things easy, it just trades unknown risk for execution risk. Distribution, positioning, and speed are still brutally hard, but at least they’re controllable and improvable",
              "score": 1,
              "created_utc": "2026-01-28 16:14:01",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o26incc",
          "author": "ePidemiic",
          "text": "It’s true, if you’re more fit for someone else or your product/service is better.. well, you get the bag! \nBeing innovative is much more risk-adverse than inventive.",
          "score": 1,
          "created_utc": "2026-01-28 08:26:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o26jd0j",
              "author": "VishuIsPog",
              "text": "Yeah, exactly. Market fit and execution decide the outcome, not how original the idea sounds. Innovation is about reducing risk by improving what already works, while invention is a much bigger gamble",
              "score": 2,
              "created_utc": "2026-01-28 08:33:07",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2eoi0q",
          "author": "senraku",
          "text": "I tried putting a TV and sound bar on a mobile cart with an arm to fit over your bed. I built the thing and came up with some jank ass marketing but people were scared of the product and the price. You're right part of educating the people about your brand new product and making them feel safe. Rather everyone who looked at it saw themself as someone who wouldn't spend enough time in bed watching TV to justify it and that it was for other, less healthy people. Or at least they felt pressed to give an answer to some Random inventor demoing it outside on the sidewalk in the space between family dollar and tobacco hut",
          "score": 1,
          "created_utc": "2026-01-29 13:32:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2eutyo",
              "author": "VishuIsPog",
              "text": "Yeah, that’s a textbook example of invention friction. You weren’t just selling a product, you were asking people to change how they see themselves. That’s a much harder sell than improving something they already use. Novel ideas fail less because they’re bad and more because the education, trust, and behavior change costs are brutal.",
              "score": 1,
              "created_utc": "2026-01-29 14:06:08",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2gj5fl",
          "author": "Subject-Athlete-1004",
          "text": "this is so true and honestly something i wish i internalized earlier. spent way too long trying to come up with \"original\" ideas when the reality is most successful stuff is just better execution or existing ideas applied to a different vertical. like uber for X memes aside, that pattern works bc the demand is already validated — you're just asking \"can i do this for \\[specific niche\\] better or cheaper?\" instead of praying people want what you built. i think the line between copying and learning is basically whether you're just cloning vs actually understanding *why* something works and adapting it. the best \"copies\" i've seen add one twist that makes it way stickier for a specific audience... same bones, different skin basically 😅",
          "score": 1,
          "created_utc": "2026-01-29 18:42:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2gji45",
              "author": "VishuIsPog",
              "text": "Exactly. Chasing originality early is a distraction. Starting from validated demand turns the problem into execution instead of hope. The difference between copying and learning is understanding the why and then adapting it for a specific audience. Same bones, better fit",
              "score": 1,
              "created_utc": "2026-01-29 18:44:30",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o319y4u",
          "author": "SeraphSurfer",
          "text": "I had 4 bizes doing the exact same sorts of things AT&T does for the govt, telecom and IT.  We focused on keeping costs low, very good service, and rapid response for classified customers.   The 4 bizes at their peak were doing a combined $250M ARR.  \n\nOne example: We competed head to head vs AT&T,  VErizon,  and Sprint on a contract worth $50M / year for DOD. We figured out how to use the same equipment those other incs had in a more efficient manner.  \n\nSo i agree with OP.  Novel and ground breaking aren't required.",
          "score": 1,
          "created_utc": "2026-02-01 20:38:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2e0fw4",
          "author": "Solid_Mongoose_3269",
          "text": "Do you have a successful startup?  If not , hush",
          "score": 0,
          "created_utc": "2026-01-29 10:44:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2euwts",
              "author": "VishuIsPog",
              "text": "You don’t need a billion-dollar exit to recognize patterns. Most lessons come from watching what works and what fails, not just from the wins",
              "score": 2,
              "created_utc": "2026-01-29 14:06:33",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1quq6nb",
      "title": "How a Window Cleaning Business Made $79K/Month (And Why Your Industry Can Too)",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1quq6nb/how_a_window_cleaning_business_made_79kmonth_and/",
      "author": "4PFmel",
      "created_utc": "2026-02-03 12:05:36",
      "score": 22,
      "num_comments": 2,
      "upvote_ratio": 0.89,
      "text": "So Brandon and Carter got laid off during COVID. Instead of doom-scrolling, they noticed something: service trucks were everywhere, but people hated dealing with them. No-shows, surprise charges, dirty boots through clean houses.\n\nThey spent $153 at Home Depot and started cleaning windows in Austin. Fast forward to 2025: Pink's Window Services is a multi-million dollar franchise network with 236+ units across 29 states.\n\nBut here's what actually matters, they didn't win on the service. They won on the *strategy*.\n\n**The marketing playbook:**\n\n**1. Pick a story first, service second**  \nThey didn't start with \"we clean windows.\" They started with \"bring dignity back to blue-collar work.\" That one sentence became their north star for everything: name, branding, how they hire, how they show up.\n\n**2. Make boring things visually unforgettable**  \nNavy trucks. Crisp uniforms. Pink accents everywhere. It looks like a 1950s gas station mixed with a streetwear brand.\n\n[pink windows services](https://preview.redd.it/s0mvyzg9s9hg1.png?width=1080&format=png&auto=webp&s=05fae98584a485b9207dda61e05bdff940f7a02f)\n\nOther home service companies could do this tomorrow. Most just... don't.\n\n**3. Turn operations into marketing**  \nOn-time arrivals when they say they'll arrive. Online booking instead of phone tag. Handwritten thank-you notes. Free pressure washing on driveways for recurring customers.\n\nWhen your actual service experience is better than 90% of competitors, people talk about it. Their reviews mention the *people* and the *experience* more than the actual clean windows.\n\n**4. Content isn't an afterthought, it's the strategy**  \nThey post VHS-style videos, clips of techs doing kickflips in uniform, \"comp clean of the week\" features of local businesses.\n\nIt reads like a lifestyle brand, not \"commercial window cleaning LLC trying to sell you something.\"\n\n**5. Merch becomes word-of-mouth**  \nThey give genuinely cool gear to staff and top customers. People started buying Pink's hats, jackets, socks, not because they needed them, but because they look good.\n\nThat's free marketing walking around.\n\n**Why this matters:**\n\nYou don't need a new app or a new category/industry. You can take something as unglamorous as window cleaning and, through clear positioning, strong branding, thoughtful operations, and consistent content, build something franchisees actually want to be part of.\n\nThe playbook works for HVAC, plumbing, landscaping, handyman services, pest control—literally anything blue-collar right now.\n\nThe question isn't whether your industry is boring. It's whether you're willing to make it interesting.\n\n*Edit: Lots of people asking how they got franchisees to buy in early. Short answer: proof in the numbers. Their Austin location did $750K-$985K with 30%+ margins. Hard to say no to that. You can find their exact marketing strategy* [here](https://marketingcrafted.com/case-studies/pink-windows)",
      "is_original_content": false,
      "link_flair_text": "Marketing / Operational / Financial / Regularotry Advice sought",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1quq6nb/how_a_window_cleaning_business_made_79kmonth_and/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o3c5xyf",
          "author": "MrMooseCreature",
          "text": "Good on em",
          "score": 1,
          "created_utc": "2026-02-03 13:24:44",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qr3kbf",
      "title": "Reintroducing the Third Space",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1qr3kbf/reintroducing_the_third_space/",
      "author": "pandarama25",
      "created_utc": "2026-01-30 12:02:10",
      "score": 20,
      "num_comments": 32,
      "upvote_ratio": 0.88,
      "text": "I’m validating a brick and mortar concept and looking for human feedback before I go further.\n\nThe idea is to create membership based “third spaces”, places you can spend hours without feeling like you have to keep buying things.Not a bar. Not a typical coffee shop. Not a traditional coworking space.\n\nMore like:\nA quiet work/study lounge with café drinks and reservable private pods for calls and isolation\n\nA creative studio with big tables, sewing machines, 3D printers, and  niche craft spaces\n\nYou’d pay a monthly membership (like a gym), then just show up and use the space. Some specialty rooms/tools might be bookable.\n\nTarget users: students, remote workers, freelancers, hobbyists, apartment dwellers.\n\nA few questions:\nWould you pay for something like this?\nWhich version sounds most useful to you?\nWhat monthly price feels reasonable?\nWhy would you NOT use it?\n\nBe blunt I’m trying to pressure test the idea.",
      "is_original_content": false,
      "link_flair_text": "Idea Feedback",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1qr3kbf/reintroducing_the_third_space/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o2nr1fv",
          "author": "khoelzeman",
          "text": "I love the idea, but I don't see how it breaks even or makes any money. \n\nA few similar things have started near me - the monthly cost needed to be much higher than originally expected. The last one was passed around to 3 different nonprofits who couldn't stomach the losses once the grant-funding dried up. \n\nI personally ran the numbers on co-working spaces a few years ago and it's next to impossible to make money. \n\nIf you put in 3D printers, Sewing Machines, etc... you're going to have to charge way more than $40-$50/month, or have some additional stream of revenue. \n\nThis is the kind of thing that I think needs to be community-focused and run similar to a co-op.",
          "score": 9,
          "created_utc": "2026-01-30 19:28:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2nrfmy",
              "author": "pandarama25",
              "text": "So The monthly fee gets you in the door to the space to utilize specialty equipment like that would just have a surcharge to cover Operation and margin. Plus like I said there would be an entire food and beverage focused on low-cost high margin items to increase dwell time and revenue.",
              "score": 2,
              "created_utc": "2026-01-30 19:30:32",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2o4bvg",
                  "author": "khoelzeman",
                  "text": "What doe the numbers that you've run look like? \n\nHow many members do you need to break even?\n\nMy advice would be to have the numbers tightly dialed in before you go sign a multi-year lease with a pg. \n\nWhen I ran the numbers on a co-working space, with $0 build out, I needed just over $10k/month in revenue to break even on rent. In my area that equated to 40 desks paying $250/month. Once I added in basic competitive amenities (free basic coffee, commercial wifi, etc...), plus insurance, membership management software and janitorial,I was over $16K/month to break even before I ever started paying back CAC, furniture, hiring a part-time front desk person, etc... \n\nI was a customer of a co-working space for 3 years. I saw 5 different coffee shops fail in the lobby.",
                  "score": 4,
                  "created_utc": "2026-01-30 20:30:43",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2n9k0d",
          "author": "GuitarAgitated8107",
          "text": "Feels like it would be the wrong place to ask. My own take is that third spaces are going to become more popular but it is going to be more of a conversion of existing spaces / place of business that adapt. The membership will make it as exclusivity which might work against the third space concept. \n\nI personally wouldn't pay for the space but I would pay for the amenities.",
          "score": 6,
          "created_utc": "2026-01-30 18:11:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2nay1q",
              "author": "pandarama25",
              "text": "The membership serves to limit access, it would be something affordable like 40-50 monthly, however I thought of the idea of turning a portion like $20 of that into a f&b credit to make the barrier of entry lower and add benefit",
              "score": 1,
              "created_utc": "2026-01-30 18:17:43",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2lb72r",
          "author": "Single-Desk9428",
          "text": "It sounds like you have two separate ideas here - the quiet work study lounge (which is basically a library) and  a creative studio with sewing machines etc (that's basically a makerspace). You'll struggle to keep both of these in the same area given how noisy some machines are. \n\nDo you have any local makerspaces in your area? Or libraries? Why would anybody pay to access a quiet space when there are spaces like these available? I think makerspaces are generally a flawed model given how expensive they are to actually run. Membership at my local one was like 30-50 bucks a week, and for that price you really want to be doing some serious making. That's not super accessible for casual crafters or makers.",
          "score": 3,
          "created_utc": "2026-01-30 12:29:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2lc8ow",
              "author": "pandarama25",
              "text": "So I would skew my prices lower by introducing a cafe/lounge side to both concepts. Serving low cost light fare, high margin coffee and tea drinks and RTD non alcoholic beverages. \n\nI'm essence it is 2 sister concepts but they're both multifunctional third spaces. The first is geared towards academia and remote work. With a lounge space for evening programming, a collaborative work study space, and isolated deep focus pods to eliminate exterior noise.\n\nThe latter  being a maker space, with that same f&b design but couples with a space for various creative hobbys, supplying basic tools , margin retail for common hobby products and tool rental for specialized work",
              "score": 1,
              "created_utc": "2026-01-30 12:36:53",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2ldxdq",
                  "author": "Single-Desk9428",
                  "text": "Love the idea as a way of getting more people into third spaces, but how would you compete with something like a library? Every library where I live has a cafe in it doing the same thing. \n\nI like the night time aspect given libraries and cafes are closed then, but then I'm old so I get home after work and just want to rot on my couch! A friend of a friend tried to get a similar concept off the ground, but I think it's a lot of effort to keep people coming back given they could just work at home in their PJs! What age range would you be mainly targeting? I can see something like this being super useful for like students living on university campus who only have a tiny studio apartment (but then they would also have access to the university I guess)",
                  "score": 1,
                  "created_utc": "2026-01-30 12:47:43",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2n8o9q",
          "author": "smx501",
          "text": "It isn't the facility, it is the commute.\n\nPut a mediocre cafe 2 doors down and I'll be there five times a week. Put a great cafe 3 miles away and I'll go a few times per year.",
          "score": 4,
          "created_utc": "2026-01-30 18:07:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2n9uii",
              "author": "pandarama25",
              "text": "For me the design is A Social lounge with a work study space. So I get that pov, if your work space was up stairs and there was a lounge with coffee, espresso, boba, and NA Drinks plus light fare right down stairs it's a place to dwell. Then by the time you're done working that space is transitioning more into a happy hour lounge",
              "score": 1,
              "created_utc": "2026-01-30 18:12:57",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2n0l8q",
          "author": "ansy7373",
          "text": "I think what would be a cool idea would be a tool “shed” for urban areas.  You pay a monthly fee and have access to all kinds of tools.  Owning a lot of tools in an apartment is a pain in the ass.  And buying a tool for a one time use sucks. Storage considerations and all.  Also having someone that can show you how to use it would be helpful.",
          "score": 3,
          "created_utc": "2026-01-30 17:32:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2na9b0",
              "author": "pandarama25",
              "text": "I briefly thought of a 3rd concept that nearly fills that and then some tool but also the space to work on things and heavy tools usage. But that's far down the line",
              "score": 1,
              "created_utc": "2026-01-30 18:14:44",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2p0ugj",
                  "author": "ansy7373",
                  "text": "I was thinking of having a place to work on shit too, but it would be a pain in the ass to bring your work project back and forth.",
                  "score": 1,
                  "created_utc": "2026-01-30 23:09:46",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2lwppc",
          "author": "flightwatcher45",
          "text": "Making money is impossible. Libraries, community centers, coffee places, book stores all essentially do what you're saying. I agree its a great idea but nobody will pay enough.",
          "score": 5,
          "created_utc": "2026-01-30 14:30:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2lumyu",
          "author": "rsuess14",
          "text": "This is just Common Desk/We Work.",
          "score": 5,
          "created_utc": "2026-01-30 14:19:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2lv6ja",
              "author": "pandarama25",
              "text": "Yes it's basically a coworking space meets dry lounge, with curated programming/events",
              "score": 2,
              "created_utc": "2026-01-30 14:22:22",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2muu9g",
          "author": "Previous_Shopping361",
          "text": "Target neurodivergent individuals they'll love this...",
          "score": 2,
          "created_utc": "2026-01-30 17:06:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2nnca4",
          "author": "Ambitious-Ocelot8036",
          "text": "A cross between the library and Panera bread?",
          "score": 2,
          "created_utc": "2026-01-30 19:11:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2npr62",
              "author": "pandarama25",
              "text": "More like a social lounge that has a dedicated space for quiet and collaborative work and study",
              "score": 2,
              "created_utc": "2026-01-30 19:22:51",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2qe52v",
          "author": "M17SST",
          "text": "I’m developing something similar. Key for me is that I own the building, and I have a business that sustains the building. If I had to rent/lease I don’t think it would be viable given the size of space needed",
          "score": 2,
          "created_utc": "2026-01-31 03:56:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2qp9ts",
          "author": "gold3lox",
          "text": "This may depend on the area you are planning to open in. I work with small business a lot who say one of their main reasons for opening was to create a 3rd space. Unfortunately, that isn't really enough to carry a business and most of them are struggling. The reason coffee shops and bars work as 3rd spaces is because they aren't just offering space, but also offering something to do (order coffee or a drink). ",
          "score": 2,
          "created_utc": "2026-01-31 05:13:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2rolnr",
          "author": "BoSutherland",
          "text": "I love the idea of a viable third space, both as a frequent customer but also as an occasional business idea tinkerer.\n\nFirst thing, identify what business you’re in.\n\nYou’re basically in the real estate game, not social clubs, coffee or food. It’s important to know what industry you’re working in. Companies like WeWork and the like are your peers and competitors.\n\nUnless you own the space, or offer a truly unique concept, it’s going to be an uphill battle to recoup your investment or make any significant profit. Coffee, pretzels and 3d printers ain’t gonna cut it, unfortunately.\n\nWith that said, there’s a need for the type of space you’ve described. It’s just very hard to make it financially viable in an economy of high commercial real estate prices and a customer base whose purchasing powers are constantly declining.\n\nGood luck!",
          "score": 2,
          "created_utc": "2026-01-31 10:30:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o30d5yz",
          "author": "krasnomo",
          "text": "If you are in a town with lots of remote workers it could work well, but maybe not how you envision. \n\nMy coworking space has over 100 members paying at least $250 a month (mostly their companies paying for them). \n\nOnly like 10 of us are regulars haha. They make a lot per month, for very little effort.",
          "score": 2,
          "created_utc": "2026-02-01 18:05:53",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qrfbh9",
      "title": "The Amazon of Good Stuff",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1qrfbh9/the_amazon_of_good_stuff/",
      "author": "Additional-Sky-7436",
      "created_utc": "2026-01-30 19:26:35",
      "score": 11,
      "num_comments": 5,
      "upvote_ratio": 0.87,
      "text": "I've thought that it would be a great idea to create a web store that is basically the opposite of Amazon and Walmart. \n\nThe Amazon of Good Stuff. \n\nOnly sell one product per product category. But that product is the best in that category. Like, we would sell only one brand of USB cables that we specifically tested and certified for sale. If another company wants us to sell their cables instead, they have to pass our rigorous published testing and score better than what we are currently selling. \n\nWe still one wood book case, but it's a quality solid wood book case.\n\nThat way, a consumer knows that if we sell the product, it's going to be good.",
      "is_original_content": false,
      "link_flair_text": "App/Website Idea",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1qrfbh9/the_amazon_of_good_stuff/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o2o0vpl",
          "author": "travisjd2012",
          "text": "This is kind of the idea behind Costco just with a physical presence.\n\nYou'd probably be best off doing this idea but using Amazon affiliate links, you would just show \"the best\" products from different categories which was more-or-less the idea and business model of The Wirecutter.",
          "score": 9,
          "created_utc": "2026-01-30 20:14:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2o75t9",
          "author": "UpsetMarsupial",
          "text": "What makes the \"best\" will depend on person by person. Taking the bookshelf example, should it have 6 shelves, or 5 or 4? Be 24 inches wide or 30? Be 4ft tall, 6ft or 8 ft? Be pine, oak, mahogany or cherry?\n\nDifferent people will want different things.\n\nLet's take another example: What makes a good mobile phone will also depend on the owner. A phone that is used by someone in a remote location with unreliable power should have a long battery life. But one used by a tech worker should likely be fuller featured and thus place a heavier burden on the battery.",
          "score": 5,
          "created_utc": "2026-01-30 20:44:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2s1m73",
          "author": "dontfeedtheclients",
          "text": "Nah.",
          "score": 1,
          "created_utc": "2026-01-31 12:24:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o33f5vc",
          "author": "frankb69n",
          "text": "Just go to Amazon.jp lol \n\nNo, seriously. I like this idea. Consumers need to put a focus back on quality products instead of cheap crap. I support it.",
          "score": 1,
          "created_utc": "2026-02-02 03:35:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o361j4p",
          "author": "MathewGeorghiou",
          "text": "With all the fake reviews and manipulation we all have to wade through, the idea is interesting but execution will be challenging.\n\nPerhaps focus on a specific niche to start — where cost is not an issue for the buyer.\n\nAs u/travisjd2012 suggests, creating a store of affiliate links is an easy way to test the concept, but you need to make it look like a store rather than a typical review site otherwise it will get lost in all of the noise.",
          "score": 1,
          "created_utc": "2026-02-02 15:18:33",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qp108f",
      "title": "How to Find Your Market (Early on)",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1qp108f/how_to_find_your_market_early_on/",
      "author": "_Justindonavan",
      "created_utc": "2026-01-28 04:10:44",
      "score": 11,
      "num_comments": 6,
      "upvote_ratio": 0.88,
      "text": "Many of us here are founders with a product or a set of skills we genuinely believe in. The problem is not that what we built is bad. \n\nThe problem is that we do not actually know who it is for, who would buy it, or how to find those people in the first place.\n\nMost of the time this is not a worth problem. It is a branding problem.\n\nMore specifically, it is a branding problem caused by tunnel vision. We get so close to what we are building that we forget how rare or difficult it might be for someone else. Something that feels obvious or easy to us can be genuinely painful or confusing for others.\n\nFor example, I am good with ideas and communication, but I am terrible at math. \n\nSomeone could sell me a calculator far more easily than they could sell me an AI agent that does what I already do. \n\nValue shows up where ability is missing.\n\nA lot of founders spend time and energy stressing themselves out trying to find their market. \n\nWe ask each other, create echo chambers, and reinforce our own assumptions, when the better move might be to step outside our bubble and identify the group of people who are naturally bad at the thing we are offering. Those people feel the problem most often, and they are the ones actively looking for relief.\n\nThat is your market. That is who your brand who you should focus on speaking to. \n\nIf you try to sell to everyone, you usually end up selling to no one.",
      "is_original_content": false,
      "link_flair_text": "A How-To Guide that no one asked for",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1qp108f/how_to_find_your_market_early_on/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o26i1q9",
          "author": "toy_scouter",
          "text": "But where is the answer of your title?... I thought you would explain some sort of strategy...",
          "score": 1,
          "created_utc": "2026-01-28 08:21:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o27223c",
          "author": "ConnectionOpening505",
          "text": "Early on, focus on identifying a specific problem for a clearly defined customer segment, not a broad market. Talk directly to potential users to understand their pain points, current alternatives, and willingness to pay. Validate demand with small experiments or pilots before scaling. Strong early traction usually comes from solving one urgent problem really well for a narrow niche, then expanding from there.",
          "score": 1,
          "created_utc": "2026-01-28 11:20:30",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qrwi5z",
      "title": "A 100% Online Pawnshop",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1qrwi5z/a_100_online_pawnshop/",
      "author": "Dunn74",
      "created_utc": "2026-01-31 08:02:25",
      "score": 11,
      "num_comments": 7,
      "upvote_ratio": 0.93,
      "text": "This is one of those middle of the night ideas that is probably hard to actually do right but I just had this idea for a pawnshop but it is 100% online no actual store. I looked online and surprisingly I cant find anything exactly like this. Only issue I can think of is that I am not sure how fast I could get someone there money as I would probably need to have the item in hand before money can be transfered to prevent getting scammed.\n\nAgain this is just a random idea I just thought up while trying to fall asleep so its probably crap but I figured why not post about it here and see what people say about it. Any feedback good or bad is appreciated. Thanks.",
      "is_original_content": false,
      "link_flair_text": "Idea Feedback",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1qrwi5z/a_100_online_pawnshop/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o2reh45",
          "author": "dj55i",
          "text": "Isn’t this just like eBay resellers?",
          "score": 8,
          "created_utc": "2026-01-31 08:53:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2rl0fa",
              "author": "Dunn74",
              "text": "No it would be like an actual pawn shop where you can sell and pawn things. It would work Just like one but all online.",
              "score": 2,
              "created_utc": "2026-01-31 09:56:00",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2tg3uf",
                  "author": "TheLastPrinceOfJurai",
                  "text": "So what does the business model look like? What kind of profit margins are you looking for to hold the item if they come back to retrieve it?",
                  "score": 1,
                  "created_utc": "2026-01-31 17:04:16",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2sxsuk",
          "author": "JimmyTheDog",
          "text": "You would still need a physical place to store the items pawned or sold to you. Same place to sell items... It seems to me, limited experience on my part, but people like to see and touch the used item they are buying... There could be legal requirements for pawn shops in your area... Drop this into google where xxxxx is your city or area     \"legal requirements for pawn shops in xxxxx\". In my area pawn shops are highly regulated.",
          "score": 2,
          "created_utc": "2026-01-31 15:36:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2toq8r",
          "author": "rsteele1981",
          "text": "Shipping costs are going to be a problem.",
          "score": 2,
          "created_utc": "2026-01-31 17:46:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o355uj2",
          "author": "jo0stjo0st",
          "text": "Distribution costs might be an issue, actually valuation and validating the pawned items will probably be an issue. People trying to scam you is a very very big issue (you're going to get offered 10.000 fake rolexes a day). Local rules on pawnshops might be an issue (its regulated in a lot of countries). You might need a high spend to attract the \"fun shoppers\", which pawnshops often attract anyway (the ever changing inventory has a fun-component). I think there is a reason its mainly an offline thing now, but local pawnshops do list (some) inventory online.",
          "score": 1,
          "created_utc": "2026-02-02 12:15:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o358e81",
          "author": "camvill",
          "text": "Wouldn't work because pawn shops operate on people needing quick cash.",
          "score": 1,
          "created_utc": "2026-02-02 12:33:43",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qpftha",
      "title": "Easiest way to get an LLC?",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1qpftha/easiest_way_to_get_an_llc/",
      "author": "NoSleep980",
      "created_utc": "2026-01-28 16:18:52",
      "score": 11,
      "num_comments": 45,
      "upvote_ratio": 0.83,
      "text": "Looking for the simplest, and I guess, cheapest way to get an LLC registered in my name. I've not finalized the state yet but I'll choose from either Texas, Florida, or Nevada. That apart, I'm just asking for the easiest way I can get an LLC?  \n  \nFor those who have registered their LLCs on their own, would you recommend DIY or paying an LLC service to do it for you. I've heard I need to get a registered agent any way so it's better to pay a bit more upfront and let them handle all of it.",
      "is_original_content": false,
      "link_flair_text": "No applicable flair exists for my post",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1qpftha/easiest_way_to_get_an_llc/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o29ud04",
          "author": "rankhornjp",
          "text": "Easiest way - go to the Sec of State website and file it yourself.  Takes about 20 mins, use yourself as the registered agent (they just want someone responsible for official correspondence).\n\nWait about a week to get confirmation, then go to the IRS website for a FREE EIN.",
          "score": 6,
          "created_utc": "2026-01-28 19:36:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2acach",
              "author": "bikecoguy",
              "text": "This. Don’t pay for either through a third party they are all scams. \n\nBiz is about $50 to incorporate and EIN is free from the gov.",
              "score": 2,
              "created_utc": "2026-01-28 20:56:10",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o2c8bk8",
              "author": "Embarrassed_Key_4539",
              "text": "This is the answer",
              "score": 1,
              "created_utc": "2026-01-29 02:35:57",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o2qhm2t",
              "author": "NoSleep980",
              "text": "I’ve seen some people online saying that if I list myself, my home address becomes public record on the Secretary of State’s website. Fo you know if there’s a way to keep my private info off the official search results without paying for a service?",
              "score": 1,
              "created_utc": "2026-01-31 04:19:31",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2ct7gt",
          "author": "BusinessAnywhereio",
          "text": "If you’re choosing between Texas, Florida, and Nevada, the easiest approach is usually to form in the state where you actually live or operate. Otherwise you can end up doing extra filings as a “foreign LLC” and paying fees in two states.\n\nIf you want to DIY (cheapest and still pretty simple), use a step by step guide for the state you pick:\n\n* Texas: [How to Start an LLC in Texas](https://businessanywhere.io/how-to-start-an-llc-in-texas/)\n* Florida: [How to Start an LLC in Florida](https://businessanywhere.io/how-to-start-an-llc-in-florida/)\n* Nevada: [How to Start an LLC in Nevada](https://businessanywhere.io/how-to-start-an-llc-in-nevada/)\n\nDIY basics in any state:\n\n* File the LLC online with the state\n* Use a registered agent if you don’t have a reliable in-state address and availability\n* Get an EIN from the IRS (free)\n* Keep up with the annual report/franchise tax requirements\n\nIf you’d rather pay for convenience, a service can be worth it if you want someone to handle the filing, registered agent, reminders, and avoid missing steps. Just watch for year-2 pricing on registered agent renewals and “compliance subscription” upsells. BusinessAnywhere is one option that bundles formation + registered agent + mailbox-style address handling, so you’re not piecing things together.",
          "score": 3,
          "created_utc": "2026-01-29 04:41:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2qhd65",
              "author": "NoSleep980",
              "text": "Does your service usually handle the Operating Agreement too?\n\nAlso, for anyone who went the Nevada route. Is the \"no state income tax\" actually worth the higher initial filing fees compared to Florida?",
              "score": 1,
              "created_utc": "2026-01-31 04:17:50",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2uybur",
                  "author": "BusinessAnywhereio",
                  "text": "Yes, we also do the operating agreement.\n\nBoth Nevada and Delaware or relatively expensive. \n\nIf you live in the US, usually forming in your home state is the best option.\n\nIf you live abroad, I would go with Wyoming, much cheaper than Nevada or Delaware with better privacy and very simple.\n\nIf you live in the US and want an LLC out of your home state for some reason, Wyoming is usually the go to choice.\n\nDelaware rarely makes sense unless you have investors or partners that demand it.",
                  "score": 1,
                  "created_utc": "2026-01-31 21:25:55",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2ffeko",
          "author": "Aldoperu",
          "text": "Do it yourself. You're capable.",
          "score": 3,
          "created_utc": "2026-01-29 15:45:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2frczx",
              "author": "CharacterFarm8196",
              "text": "Everyone is capable. It's just that there's a lot to it than simple form filing. ",
              "score": 3,
              "created_utc": "2026-01-29 16:38:19",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2fqf0c",
          "author": "CharacterFarm8196",
          "text": "Cheaper and easier are more complicated than they sound. Of the three states you listed, FL is significantly cheaper at $125 to register an LLC than Nevada at $436, or Texas at $310.   \n  \nBut, it doesn't sound like you live in Florida. Are you actually \"doing business\" in another state? Will you have to ultimately foreign register and incur more fees? Any industry licenses needed that have varying costs across states? Different state taxes?   \n  \nIf you don't live in Florida and have a FL physical address that you want to list on public record to serve as your own registered agent, then you probably also have to hire a registered agent for your company anyway.  \n  \nI did start LLCs on my own and I definitely did things then that I wouldn't (and don't) do now. But, as a someone with no real idea of what I was doing, it's not like I couldn't handle registration directly with the state well enough to peddle my wares legally, you know? I'm not suggesting that people can't do it themselves if that's what they want to do.",
          "score": 2,
          "created_utc": "2026-01-29 16:34:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2rf5n2",
          "author": "Raii7777",
          "text": "Hey, I totally get where you’re coming from. I was in your shoes recently, trying to figure out the simplest way to get an LLC going without breaking the bank or getting buried in paperwork.\n\nAt first, I was considering DIY since it seemed like the cheapest option. But after digging into it a bit more, I realized there’s a lot of small details that can trip you up, like making sure your registered agent is in place and understanding all the filing steps in your state. That’s when I decided to look into a service, and honestly, I’m glad I did.\n\nI ended up using BusinessAnywhere to help me with the process. They helped me choose the right state (I ended up going with Texas), and they handled everything from setting up the registered agent to filing the necessary paperwork. It was surprisingly affordable, and they took care of the stuff I was stressing over. For me, the time I saved was worth the small extra cost.\n\nSo yeah, if you’re looking to just get it done without diving deep into the weeds of LLC formation, I’d recommend a service like that. It might cost a bit upfront, but it’s way less of a headache, and you can focus on getting your business rolling.\n\nGood luck with it, and hope this helps!",
          "score": 2,
          "created_utc": "2026-01-31 08:59:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2tk37w",
          "author": "menhoan15",
          "text": "What's with everyone looking for an easy or cheap way out of everything? Like if you're starting a business, aren't you invested enough to put some time and money into doing it properly???",
          "score": 2,
          "created_utc": "2026-01-31 17:23:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o310eca",
          "author": "antbrownjob",
          "text": "Choosing where to set up your LLC between Texas, Florida, and Nevada can get a bit tricky with all the different fees and forms, especially if you operate outside the state where you registered. When I was starting my business, I ended up using a service to avoid some headaches. I tried businessanywhere.io and found it handled both the registration and the registered agent stuff without too much hassle, which was nice given how complicated the state rules can be. \n\nUsing their service made submitting the required info and staying on top of ongoing compliance easier than dealing with multiple state websites and paperwork. If you want to keep official mail from falling through the cracks or miss important steps, it was way more reliable for me than doing it all myself in multiple states.",
          "score": 2,
          "created_utc": "2026-02-01 19:52:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o316zve",
          "author": "Ikegaru",
          "text": "Choosing where to set up your LLC between Texas, Florida, and Nevada can get a bit tricky with all the different fees and forms, especially if you operate outside the state where you registered. When I was starting my business, I ended up using a service to avoid some headaches. I tried businessanywhere.io and found it handled both the registration and the registered agent stuff without too much hassle, which was nice given how complicated the state rules can be. \n\nUsing their service made submitting the required info and staying on top of ongoing compliance easier than dealing with multiple state websites and paperwork. If you want to keep official mail from falling through the cracks or miss important steps, it was way more reliable for me than doing it all myself in multiple states.",
          "score": 2,
          "created_utc": "2026-02-01 20:24:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2c28q3",
          "author": "No_Procedure_7297",
          "text": "The easiest and cheapest way is to file the LLC yourself on the state’s official website and hire a registered agent separately; in Texas, Florida, or Nevada this usually takes 10,20 minutes and just involves picking a name, filing the Articles of Organization online, paying the state fee, and listing a registered agent, which typically costs about $50–$150 per year. LLC services like ZenBusiness or LegalZoom are more convenient but usually cost extra and don’t do much more than the DIY route, so they’re only worth it if you want everything handled for you with minimal effort.",
          "score": 1,
          "created_utc": "2026-01-29 02:03:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2qhiak",
              "author": "NoSleep980",
              "text": "10–20 minutes sounds way more manageable than I expected. I was worried there was some hidden complexity that only the big services knew how to handle.\n\nIf I file myself, does my home address end up on the public record? I’ve heard a registered agent service can act as a buffer for that, but does that actually work if I'm the one filling out the rest of the form?",
              "score": 1,
              "created_utc": "2026-01-31 04:18:48",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2vqizt",
                  "author": "No_Procedure_7297",
                  "text": "Yes, if you file it yourself, your home address can end up on public record depending on the state and how you fill out the form. Using a registered agent does work as a buffer for official notices and lawsuits, since their address goes on the registered agent section, but you may still be asked for a mailing or business address elsewhere. The key is to use the registered agent’s address wherever the form allows it and avoid listing your home address unless it’s required.",
                  "score": 1,
                  "created_utc": "2026-01-31 23:53:01",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2e22df",
          "author": "SathyaHQ_",
          "text": "Oh, yeah I think these states of best to form your LLC. Even better Wyoming. \n\nBut you decide. Found this video that helped me make the decision. Check it out. [https://www.youtube.com/watch?v=Sqhds-W8dHY&pp=2AYO](https://www.youtube.com/watch?v=Sqhds-W8dHY&pp=2AYO)",
          "score": 1,
          "created_utc": "2026-01-29 10:58:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2fm89e",
              "author": "beth_weird75",
              "text": "What about they're not based in Wyoming? That should surely make it harder to file right?",
              "score": 1,
              "created_utc": "2026-01-29 16:15:27",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2fo7ng",
                  "author": "SathyaHQ_",
                  "text": "You don't have to be based in Wyoming, even in the US to setup an LLC in Wyoming. So check it out. You can form your LLC in Wyoming. All the best. If you need any further help, you can DM me.",
                  "score": 2,
                  "created_utc": "2026-01-29 16:24:15",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o2qh421",
              "author": "NoSleep980",
              "text": "Thanks. Just finished watching the video. Super helpful.\n\nI hadn't seriously considered Wyoming before, but the video makes a strong case for it being the clear winner for value and fixed annual fees. \\[01:43\\]   \n  \nIt's interesting that it's often the default for people outside the state.",
              "score": 1,
              "created_utc": "2026-01-31 04:16:06",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2flna5",
          "author": "beth_weird75",
          "text": "It's really easy and why spend hundreds of dollars? Especially, if you're in Florida, it should take you 15 minutes hardly to file it yourself.   \n  \nWhat state are you in? Maybe stating that will get you better answers for filing in your exact state.",
          "score": 1,
          "created_utc": "2026-01-29 16:12:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2fniej",
          "author": "brian135792",
          "text": "It is very doable yourself. It's just a matter of time and money.   \n  \nIf you have less of money and more time, spend some time learning and file it yourself. If you have more money and less time, get an LLC service to do the filing on your behalf.",
          "score": 1,
          "created_utc": "2026-01-29 16:21:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2fumz4",
          "author": "Killer320755",
          "text": "Florida was insanely easy. I did it in like 15 mins.   \n  \nJust use sunbiz.org",
          "score": 1,
          "created_utc": "2026-01-29 16:52:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2g19b0",
          "author": "Rakkien",
          "text": "Out of all the states you mentioned, FL has the easiest LLC filing process. Do what you will with that information.",
          "score": 1,
          "created_utc": "2026-01-29 17:22:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2g2e5m",
          "author": "SquidChair",
          "text": "Yes, you can do it by yourself. However, if you are like me that didn't want to risk so early use a service provider. I used Bizze.\n\nQuestion, are you America resident or non resident?\n\nIf resident, best state is your resident state. EIN the same day. If non resident, I will go for Wyoming. Didn't like the Delaware. EIN by fax and calling, 1 to 2 weeks.\n\nRemember to fill the Beneficial Owner Report. Be aware of the type of service and/or products as you might be liable for collecting and paying sales tax.",
          "score": 1,
          "created_utc": "2026-01-29 17:27:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2g461r",
          "author": "teriyakitofu90",
          "text": "You do not need a third party website to register an LLC for you. It is a ripoff. I've registered multiple LLCs myself without my lawyer, and a few more complicated ones with my lawyer.\n\nAll you need is an Articles of Organization that includes the relevant details for your state. As another commenter mentioned, you can find all the forms online.\n\nJust pay to file Articles of Organization or Certificate of Formation, and it's generally less than 1 page in length. You usually just need to identify the owner, an address, and a few relevant details. From there, once you've registered you can get an EIN and other relevant filings to start conducting business, collecting tax, getting licensed, insured, etc.\n\nIt is really not hard. If you mess up, they'll just ask you for some details. You don't get banned for life for screwing up the form.",
          "score": 1,
          "created_utc": "2026-01-29 17:35:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2grqwb",
          "author": "RepulsiveWing4529",
          "text": "If you want the easiest + cheapest, DIY in the state where you actually live/operate is usually the move. Texas/Florida/Nevada “because it’s popular” often adds extra headache (foreign registration, extra fees, compliance).\n\nDIY is straightforward: file the LLC with the state, get an EIN, open a bank account, and keep up with annual reports. Use a paid service only if you value convenience or need privacy/help with paperwork.\n\nRegistered agent: you typically only need a paid RA if you’re not physically in that state during business hours or you don’t want your address public. Otherwise, you can often be your own RA.",
          "score": 1,
          "created_utc": "2026-01-29 19:22:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2qgvdm",
              "author": "NoSleep980",
              "text": "I’ll admit, I was leaning toward Florida or Nevada because I’ve fallen down the YouTube rabbit hole of tax-free havens, but I’m starting to realize that if I’m sitting in a different state, I might just be doubling my paperwork with a Foreign LLC filing anyway.",
              "score": 1,
              "created_utc": "2026-01-31 04:14:27",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2jyu90",
          "author": "Alive-Worldliness514",
          "text": "The simplest and cheapest way to form a single-owner LLC is the DIY method. \n\nThis should be done through each state's Secretary of State website, paying only the filing fee (Texas $300, Florida $125, and Nevada $425). Based on my experience as a business setup consultant, I'll say that Texas has the easiest online process with quick approval and no annual fee required.\n\nFile the Articles of Organization in 15-30 minutes, then get a free EIN from IRS.gov. Use your own physical office address as the registered agent to avoid extra costs. Skip the services unless you want privacy or compliance help.​\n\nNow lets do a DIY vs. Service comparison: \n\n\\- DIY works better for straightforward setups like yours.   \nServices are convenient for handling paperwork, errors, and ongoing filings, especially if you're new or a busy person like me :) \n\nSince you need a registered agent anyway (must have a physical in-state address), paying upfront for a full service often saves you the hassle long-term. However, the DIY keeps it under $350 total for the first year in Texas. Nevada's higher fees make it pricier overall. \n\nWhich is why I'd pick Texas if I were in your place. ",
          "score": 1,
          "created_utc": "2026-01-30 05:45:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2jywha",
              "author": "Alive-Worldliness514",
              "text": "Hope this answers your queries 👍",
              "score": 1,
              "created_utc": "2026-01-30 05:45:58",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o2qgqx2",
              "author": "NoSleep980",
              "text": "You mentioned using my own office address to save cash, but I’ve heard that puts your home/office address on the public record forever. As a consultant, how much of a spam magnet does that actually make you?\n\nAlso, you mentioned Texas has no annual fee. Does that mean I literally just pay the $300 once and I’m good for life (assuming I file my franchise tax reports), or is there a hidden \"gotcha\" somewhere down the line compared to Nevada or Florida?",
              "score": 1,
              "created_utc": "2026-01-31 04:13:37",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o3d9ti3",
              "author": "cinema_archive",
              "text": " Thanks for breaking down the costs and process! Filing the Articles of Organization in under half an hour sounds super easy, especially for someone new to this like the OP. Texas really seems like the way to go with that quick approval and no annual fee!",
              "score": 1,
              "created_utc": "2026-02-03 16:45:38",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2ko2jv",
          "author": "globalabit",
          "text": "Wyoming offer the lowest cost to form an LLC",
          "score": 1,
          "created_utc": "2026-01-30 09:19:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2qglt2",
              "author": "NoSleep980",
              "text": "Interesting. I hadn’t actually considered Wyoming. I usually just hear people talking about the big 3 (TX, FL, NV)\n\nThe main thing I’m stuck on is whether a Wyoming LLC makes sense if I don't actually live there. I’ve read that if I’m physically working out of another state, I might have to register as a Foreign LLC anyway, which basically doubles the paperwork and fees.",
              "score": 1,
              "created_utc": "2026-01-31 04:12:39",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o28mkem",
          "author": "Middle-Substance1257",
          "text": "I literally just did this last week and got my LLC paperwork yesterday. I used ZenBusiness and just declined all of the paid add-ons and got through with paying only the cost to the state.",
          "score": 1,
          "created_utc": "2026-01-28 16:26:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o28phb9",
              "author": "Killer320755",
              "text": "Moment of truth. How much did y'all pay for filing EXCLUDING the state filing fee? I'm very interested to know.",
              "score": 2,
              "created_utc": "2026-01-28 16:39:19",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o28qz4q",
                  "author": "lucky7119",
                  "text": "$0, just paid $300 for TX state fees and $0 for EIN",
                  "score": 1,
                  "created_utc": "2026-01-28 16:45:43",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o28o76c",
              "author": "lucky7119",
              "text": "This, did the same - only paid state filing fees. Got all paperwork done within a week.",
              "score": 1,
              "created_utc": "2026-01-28 16:33:48",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o28pn8d",
                  "author": "Killer320755",
                  "text": "Are you saying you paid $0 except the state filing fee? Nothing for the registered agent either?",
                  "score": 2,
                  "created_utc": "2026-01-28 16:40:02",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o29tnr9",
          "author": "flancafe",
          "text": "For me it was easier to hire a business formation company and have them handle the paperwork for me. I probably needed a lot of hand holding because this was my first time having an LLC. I'm a pretty private purpose overall and having someone do the paperwork to avoid my info being exposed was important for my peace of mind.",
          "score": 1,
          "created_utc": "2026-01-28 19:33:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2fnpc9",
              "author": "brian135792",
              "text": "Which service?",
              "score": 1,
              "created_utc": "2026-01-29 16:21:58",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qs7jos",
      "title": "Best state to form an LLC for non-US citizens",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1qs7jos/best_state_to_form_an_llc_for_nonus_citizens/",
      "author": "beth_weird75",
      "created_utc": "2026-01-31 16:54:59",
      "score": 10,
      "num_comments": 8,
      "upvote_ratio": 0.92,
      "text": "I need to help a client set up an LLC here in the US. I'm their business manager here in the States, and I don't have prior experience with non-US citizen registering an LLC.   \n  \nMy client is currently living in Europe and looking to set up an LLC for a consulting business. I've been  doing a deep dive into the best states for non-US citizens and honestly, the more I read, the more I get confused.\n\nThe business customers/clients are mostly in the US and UK, and we don't plan on having a physical office or employees in the States. So we're mainly looking for low annual maintenance fees and ease of opening a bank account (Mercury/Relay) as a non-resident.\n\nAnother non-US person I know actually tried to DIY their LLC formation last year in Florida because they liked the vibe of the state. Long story short, she ended up with a massive headache regarding the Registered Agent requirement and some unexpected state filings that she didn't realize were mandatory. She almost got her non-US citizen LLC entity dissolved because she missed a notice that was sent to a physical address she didn't have access to. I don't know why she used that address in the first place.\n\nWyoming seems to be the \"budget-friendly\" darling with great privacy. New Mexico keeps popping up for being super cheap, but I don't hear much about it from actual founders.\n\nDo we have to worry about running into any weird tax issues (Form 5472/1120) that can get harder because of the state we choose?\n\nThank you for reading this long-ass post.",
      "is_original_content": false,
      "link_flair_text": "No applicable flair exists for my post",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1qs7jos/best_state_to_form_an_llc_for_nonus_citizens/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o2tergz",
          "author": "MrMooseCreature",
          "text": "Delaware or Wyoming.",
          "score": 3,
          "created_utc": "2026-01-31 16:57:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2tsijx",
          "author": "overDos33",
          "text": "Hey, i am from EU and i currently run a software company opened in Delaware. It has 0% sales tax and i only pay 300$ yearly franchise tax",
          "score": 2,
          "created_utc": "2026-01-31 18:04:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ukuar",
          "author": "NorthCoast30",
          "text": "Your Florida LLC friend’s issues likely were: 1.) registered agent, which your client will need in any state and 2.) Florida has an annual report filing and fee requirement. That’s not uncommon, but not in every state.\n\nSo you will run into #1 and definite possibility on #2 depending on state.",
          "score": 1,
          "created_utc": "2026-01-31 20:19:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2wivw9",
          "author": "michelmyara",
          "text": "For a non-resident, you want a service that offers the following:\n\n1. Delaware LLC if you want your name off public records. Annual fee is $300.  \n2. Florida LLC if you don't mind your name appearing in public records and want a lower annual fee of $138.75.  \n4. A registered agent service that doubled as a virtual office. All mail goes to that address and your client gets an email notification with a link to access scanned mail. This is the only address that is supplied to the state.  \n5. An EIN without an SSN or ITIN. This is required to open a business bank account. Many services can't obtain an EIN without an SSN or ITIN.\n\nI'm the co-founder of looch, a financial platform that does all of the above for $249 all-in (state filing fee included). We also offer no-fee business accounts and accounting. Here's an apples-to-apples comparison: >!https://looch.money/start!<",
          "score": 1,
          "created_utc": "2026-02-01 02:38:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2y1qat",
          "author": "movetosaipan",
          "text": "Less common option: Northern Mariana Islands (CNMI).\n\nIt's a U.S. territory, so you're still forming a U.S. entity with U.S. banking access. I work as a registered agent there, so I can walk you through how it works for non-US citizens.\n\nCosts:\n\nFirst year: \\~$537 (formation docs, registered agent setup, business license)\n\nAnnual: $225 ($75 annual report + $100 business license + $50 registered agent)\n\nBit higher than Wyoming ($110-210/year). More than New Mexico ($50-125/year). Main difference is CNMI requires a business license, Wyoming and New Mexico don't.\n\nWhy this might work:\n\nYour registered agent handles all the admin - filing, deadlines, reminders. That nightmare your friend had with missed notices and almost getting dissolved? That's what you're paying someone to prevent.\n\nYour client doesn't need to be in CNMI. We work with Europe-based clients regularly. U.S. banks operate here, so account setup shouldn't hit roadblocks.\n\nTrade-off:\n\nNot the cheapest - New Mexico wins that. But if you want someone actively keeping everything compliant and making sure nothing slips through the cracks, the extra \\~$100-175/year might be worth it.\n\nQuick note: Form 5472/1120 are federal, so those apply whether you form in Wyoming, New Mexico, or CNMI.",
          "score": 1,
          "created_utc": "2026-02-01 09:43:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o30wq77",
          "author": "c1nnamonapple",
          "text": "Had one registered in Wyoming and was really satisfied",
          "score": 1,
          "created_utc": "2026-02-01 19:34:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o37v4dr",
          "author": "molosar1",
          "text": "Nevada is also a good choice.",
          "score": 1,
          "created_utc": "2026-02-02 20:21:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o39gmzw",
          "author": "Business-Return-6029",
          "text": "Wyoming for single member llc.",
          "score": 1,
          "created_utc": "2026-02-03 01:16:02",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qqchtj",
      "title": "California Registered Agent - should I get it and how much should it cost?",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1qqchtj/california_registered_agent_should_i_get_it_and/",
      "author": "Aldoperu",
      "created_utc": "2026-01-29 16:00:20",
      "score": 8,
      "num_comments": 12,
      "upvote_ratio": 0.91,
      "text": "I'm in the middle of filing my LLC paperwork here in California and I've hit a bit of a crossroads. I'm trying to decide if I should just list myself as the Registered Agent or if I should actually pay for a service.\n\nI really want to list myself as the RA since I meet all the requirements and I need this business address listed somewhere officially connecting it to my business. I'm asking this question because it's a dilemma because of something that happened with a friend and need more people's advice on what to do.   \n  \nSo this friend of mine started a small consulting gig last year and decided to be his own agent to save money. Long story short, he went on a much-needed camping trip for a week where he had zero cell service. That was the exact window when a legal notice regarding a minor contract dispute was delivered to his house. Because he wasn't there to sign for it and accept service, things got messy with the court dates, and he ended up paying way more in legal fees to fix the default than he ever would have spent on a registered agent.\n\nI get that this should convince me to get a registered agent service and I shouldn't be asking over here, but is does this happen frequently or my guy got extra unlucky?\n\nAnd also, what's everyone seeing for pricing? Most of the sites I’ve looked at seem to be in the $100 to $300 per year range, but I’ve seen some introductory offers for $50 that jump up later. Are there any hidden fees I should watch out for?",
      "is_original_content": false,
      "link_flair_text": "No applicable flair exists for my post",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1qqchtj/california_registered_agent_should_i_get_it_and/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o2tg0ui",
          "author": "brian135792",
          "text": "Do you really want a process server handing you a lawsuit in front of your neighbors, clients or family? It's a huge vibe killer.   \n  \nTrust me. I know.",
          "score": 3,
          "created_utc": "2026-01-31 17:03:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2tibyp",
          "author": "Killer320755",
          "text": "If you need an official business address anyway, some registered agent service in California or Virtual Offices bundle these. Check if that solves two problems at once.",
          "score": 3,
          "created_utc": "2026-01-31 17:15:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2grg0b",
          "author": "RepulsiveWing4529",
          "text": "If you’re reliably available during business hours and don’t mind your home address being public, being your own RA is fine. But your friend’s situation isn’t that rare - “service of process” shows up when you least expect it, and missing it can get expensive fast.\n\nFor most small LLCs, paying for an RA is basically cheap insurance. The normal range is \\~$100–$300/yr. Watch for intro offers that renew higher, auto-renew traps, and upsells like mail scanning/forwarding, compliance packages, or per-document fees.\n\nRule of thumb: if you travel, work odd hours, or want privacy, just hire the service. If you’re always home and okay with the address being public, self-RA can work.",
          "score": 2,
          "created_utc": "2026-01-29 19:20:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2mrci5",
          "author": "MarchMadnessManiac",
          "text": "I would most def look into it! If you list yourself as the registered agent in Cali, your name and address go straight on public record. That means Google, marketers, junk mail, basically anyone with wifi can see where you live. Hard pass for me. And once it's out there, it's nearly impossible to get off. I ended up going with the registered agent I did because they are big on privacy. Can never be too careful these days IMO.",
          "score": 2,
          "created_utc": "2026-01-30 16:50:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2tat31",
              "author": "Aldoperu",
              "text": "How much are you paying for the registered agent service?",
              "score": 2,
              "created_utc": "2026-01-31 16:39:04",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o36q3hd",
                  "author": "MarchMadnessManiac",
                  "text": "Sorry for the delay, It's $125 for the year.",
                  "score": 1,
                  "created_utc": "2026-02-02 17:13:08",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2tc83v",
          "author": "beth_weird75",
          "text": "The registered agent's address always goes on the public record. And it's very difficult to take it off once it's there.\n\nIf you use your home, expect junk mail and random knocks for years.",
          "score": 1,
          "created_utc": "2026-01-31 16:45:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2tgu2p",
          "author": "CharacterFarm8196",
          "text": "You mentioned you need this business address listed somewhere officially connecting it to your business. Why is that?",
          "score": 1,
          "created_utc": "2026-01-31 17:07:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2tld5i",
              "author": "psairi",
              "text": "Hmm, I had the same question.",
              "score": 1,
              "created_utc": "2026-01-31 17:29:56",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2tn9lj",
          "author": "teriyakitofu90",
          "text": "California is a much more litigious state. Being 'unlucky' like your friend is actually more common here than in other states. Just get a registered agent and make your life easy.",
          "score": 1,
          "created_utc": "2026-01-31 17:39:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2to97t",
          "author": "SquidChair",
          "text": "A registered agent in California shouldn't cost you more than $150. Anything charging more than that is just ripping you off. There are even some very cheap services that will go like $50 for a year, but better stay clear of them. You don't want poor service to mess up legal correspondence for your business.",
          "score": 1,
          "created_utc": "2026-01-31 17:43:57",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qsd0ee",
      "title": "I need a business partner / startup idea",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1qsd0ee/i_need_a_business_partner_startup_idea/",
      "author": "Happy-Dragonfruit465",
      "created_utc": "2026-01-31 20:17:01",
      "score": 5,
      "num_comments": 10,
      "upvote_ratio": 0.86,
      "text": "I have very strong marketing, ecommerce, website development, financial auditing and organisation/cost profit and revenue tracking and substantial capital, but all of these skills i learned the hard way, by failing, now my only obstacle is a lack of ideas/ventures i have confidence in, this is a new progression in my career, since usually I would just waste money but now im cautious, but this has resulted in me waiting for quite long without starting anything.\n\nWhat do you guys think?",
      "is_original_content": false,
      "link_flair_text": "Business Partner Sought - Business has NOT been established",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1qsd0ee/i_need_a_business_partner_startup_idea/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o2vui4y",
          "author": "AnotherFeynmanFan",
          "text": "Look for customers with a problem.",
          "score": 2,
          "created_utc": "2026-02-01 00:15:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2yt8vy",
          "author": "ChestChance6126",
          "text": "this usually means the bottleneck is idea confidence, not capability. when you have execution skills and capital, waiting for a “great idea” can turn into a form of risk avoidance. what has worked better for me is flipping it around: start with a narrow problem you can test cheaply, not a big venture you need to believe in upfront. confidence tends to come from running small experiments and seeing real signals, not from thinking harder in isolation.",
          "score": 2,
          "created_utc": "2026-02-01 13:28:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ull5e",
          "author": "overDos33",
          "text": "If you have all these skills as you say you do then honestly you don't need a business partner at all.\n\nWhat could a business partner can bring to the table that you feel would bring value (except money)?",
          "score": 1,
          "created_utc": "2026-01-31 20:22:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2umd7d",
              "author": "Happy-Dragonfruit465",
              "text": "The only thing I feel im missing is confidence in a venture, like a future vision and trust something will really work, like a blinding passion, I used to have that, but as I failed more and more ive lost it",
              "score": 1,
              "created_utc": "2026-01-31 20:26:40",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2w43n9",
                  "author": "Cold_Tomato6603",
                  "text": "Welcome to entrepreneurship (Founding) my friend , you could have 1000% confidence and your idea will still fail. That's just the game, you have the skills so just execute. \n\n  \nI'm on my third app which didnt work out, idgaf, i'm executing right now",
                  "score": 3,
                  "created_utc": "2026-02-01 01:09:29",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2vlws8",
          "author": "Ok_Rock_8421",
          "text": "I e got several different in mind but no capital to execute and very little actual business experience. But I have a deep desire to venture out on my own and break the cycle of dependence on someone else taking risk and reaping the rewards. Dm me and I’ll be happy to share some thoughts and you can give me input on whether or not it’s a viable idea to bring to market.",
          "score": 1,
          "created_utc": "2026-01-31 23:26:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2vwym8",
          "author": "senraku",
          "text": "Are you at the stage of life where you want to manage a group of people making money for you in a producing goods or items or saas? Want to do a restaurant or store or something physical with buildings and leases? Looking for something innovative in tech that no one has done and wanna work with one tech cofounder? What's your ideal situation and how much time can you devote to it?",
          "score": 1,
          "created_utc": "2026-02-01 00:29:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2yyr5e",
              "author": "Happy-Dragonfruit465",
              "text": "I'd rather the tech/online side",
              "score": 1,
              "created_utc": "2026-02-01 14:02:10",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2vyvcq",
          "author": "FWTX129",
          "text": "Message me",
          "score": 1,
          "created_utc": "2026-02-01 00:39:34",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qpor0s",
      "title": "Opening up a smaller medical billing company",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1qpor0s/opening_up_a_smaller_medical_billing_company/",
      "author": "Christiann335",
      "created_utc": "2026-01-28 21:34:08",
      "score": 5,
      "num_comments": 26,
      "upvote_ratio": 0.86,
      "text": "Im 24 years old and im thinking of opening my own medical billing company with a smaller team of 20 people. I work in a medical billing comapny, but lately i was thinking why shouldn’t I do that and offer better benefits, salaries and more freedom. I want to open up something different in the meaning of giving more, helping and seeing people happy, make them feel seen… I want to hear your thoughts and you who have experience to tell me how I can start this, what do i need to do, how i can find clients, how i can contact them and get them to work with me and other things that you know that i can add up to get closer to fulfill my goal. Thank you.",
      "is_original_content": false,
      "link_flair_text": "Idea Feedback",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1qpor0s/opening_up_a_smaller_medical_billing_company/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o2fhk0i",
          "author": "Successful-Rate-1839",
          "text": "Brother you are 3 months into the industry. You need years of hands on experience to learn the ins and outs of everything before you should even attempt to start something. The medical field is a gauntlet and there are masses of shady people in it.",
          "score": 4,
          "created_utc": "2026-01-29 15:54:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2gjska",
              "author": "Christiann335",
              "text": "Brother first you need a dream to start doing something. I didn’t say i will start now. For now it’s just a realization and a want, but I know it’s going to take a long time before making it happen.",
              "score": 3,
              "created_utc": "2026-01-29 18:45:49",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2gmjxt",
                  "author": "Successful-Rate-1839",
                  "text": "You didn’t mention any of this with your initial post. You made it sound like you’re ready to move forward now.",
                  "score": 1,
                  "created_utc": "2026-01-29 18:58:12",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2dur24",
          "author": "sjamesparsonsjr",
          "text": "This is what I would do. First, you need to understand everything about the business you want to start—you must become a subject-matter expert. If someone asks how many invoices a company processes per day, month, or year, you should be able to give a solid ballpark answer immediately.\n\nLook for inefficiencies, identify financial leaks, and build your network. I would stay at your current company and study it from the inside out. Create spreadsheets and diagrams outlining the employee structure, salaries, job titles, and deliverables. Build a customer contact network. Spend extra times cross-training, become exceptional at your role, and help others succeed in theirs. Be approachable and professional.\n\nAfter a year or two, you’ll likely move up in the company. By then, you’ll be a subject-matter expert with a clear understanding of where money is wasted, where costs can be reduced, and which processes can be improved. You’ll also have built the relationships needed to eventually start your own medical billing company. Read *How to Become a CEO* by Jeffrey J. Fox.\n\nOnce you’ve effectively reverse engineered your current company, you can approach investors and clearly demonstrate how your ideas improve on an existing model. If someone came to me having done this work, I would invest. If there’s no non compete in place, you may also be able to bring customers and strong employees with you.\n\nGo to work every day with the mindset that you are an undercover CEO. Do your job better than anyone else and never stop learning. This is why so many mailroom employees eventually became CEOs: they understood the business from the ground up.",
          "score": 3,
          "created_utc": "2026-01-29 09:54:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2eoyoc",
              "author": "Poormedicstudenthelp",
              "text": "Hey seems like you know what you’re talking about. Would really like some insight on this if you don’t mind. I am in the planning stages of a quality consulting company for emergency medical services. I have been a paramedic close to 5 years, finishing my bachelors in health admin this spring, and I have previously run QA/QI programs at a mid level management role. I have found that many EMS agencies do QA/QI in a disorganized, aggressive, punitive manner. I’m designing a training program and partnership to teach agencies the right way to do it and keep my company on retainer for when the big problems hit like sentinel events. Most of the foundation content is done and I plan on launching just post my graduation. I’m a subject matter expert in this field and I really think there is a big market for this kind of work. Any ideas or suggestions?",
              "score": 1,
              "created_utc": "2026-01-29 13:34:58",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2exrej",
                  "author": "sjamesparsonsjr",
                  "text": "Sure, happy to share some thoughts. I spent about five years doing emergency medicine in the military as a Navy corpsman/EMT. That included mass-casualty drills, CBRN/CMRNE training, and acting as a medical subject-matter expert during war-game exercises, especially around MEDEVAC workflows. What you’re describing resonates a lot. Punitive QA/QI cultures tend to reduce learning instead of improving outcomes.\n\nA few suggestions that might help as you prepare to launch:\n\n**1. Build and map your network intentionally**  \nAre you collaborating with anyone yet? Network matters a lot in this space. I’d start by making two simple lists:  \n- Everyone you personally know in EMS, education, administration, or adjacent healthcare roles (professors, former supervisors, QA managers, hospital partners, etc.)  \n- A broader market map. Create a spreadsheet organized by state listing EMS agencies, EMT and paramedic programs, community colleges, universities, and large private providers\n\n**2. Study the competitive landscape**  \nLook closely at what’s already being offered. Pay attention to framing, pricing models, and especially what is *not* being addressed well. If you still have university access, use healthcare and industry databases (check out Dun & Bradstreet Million dollar database)  . There’s valuable market data there that most people never bother to look up.\n\n**3. Lead with a value-added free tool**  \nBefore selling anything, consider creating something genuinely useful that QA/QI staff and educators would bookmark and share. For example:  \n- A QA/QI workflow checklist or decision tree  \n- A non-punitive case review framework  \n- A simple web tool that aggregates standards, reporting templates, or triage references  \n\nBrand it lightly and require an email to access it. This builds trust and gives you a warm contact list made up of exactly the people you want to talk to.\n\nFrom there, outreach becomes natural. Introduce yourself, share the free resource, then offer your training or retainer services as an optional next step. Visual clarity also matters. Clean diagrams, short explainer videos, and frictionless payment options go a long way in healthcare administration.\n\nOverall, I think you’re right that there’s a real market for this, especially if QA/QI is framed as a learning and safety system rather than enforcement. Happy to bounce around ideas if you want to dig deeper.\n\nAlso, be the most expensive in your field, use the excess funds to improve the community you’re working in.",
                  "score": 0,
                  "created_utc": "2026-01-29 14:21:22",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o2giuv6",
              "author": "Christiann335",
              "text": "Beautiful insight you gave me there. Thank you. Can you be more specific about studying the company inside out? What informations should i try to find from the company and how and what is an important information in your point of view?",
              "score": 1,
              "created_utc": "2026-01-29 18:41:35",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2hnrht",
          "author": "ArtemLocal",
          "text": "Starting with that mindset is already a huge advantage focusing on better culture and client relationships sets you apart. For getting started, most new medical billing companies begin by: Learning the compliance and legal requirements for handling medical data (HIPAA, licensing, etc.). Building a clear service offering (what types of billing, specialties, or claims you’ll handle). Reaching out to small practices directly emails, calls, or LinkedIn are common first steps. Networking through local medical associations or conferences. You can also offer a pilot program or discounted first month to get your first clients and gather testimonials. Have you thought about which niche or medical specialty you want to target first, or are you keeping it broad?",
          "score": 3,
          "created_utc": "2026-01-29 21:55:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2alma5",
          "author": "Necessary-Primary719",
          "text": "Is this a local business or something you can do nationwide?",
          "score": 1,
          "created_utc": "2026-01-28 21:37:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2am13q",
              "author": "Christiann335",
              "text": "I live in the balkans and im planning to work with clients from america",
              "score": 1,
              "created_utc": "2026-01-28 21:38:52",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2du7sb",
                  "author": "multitalentedboy",
                  "text": "I have dental billing experience and i live in India. Hmu if you think you could outsource some work.",
                  "score": 1,
                  "created_utc": "2026-01-29 09:49:19",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2c7mnx",
          "author": "UsualOkay6240",
          "text": "The reason benefits and salaries are low for that industry is because the profit margin is low. They don’t pay low and offer poor benefits for no reason.",
          "score": 1,
          "created_utc": "2026-01-29 02:32:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2drk2x",
              "author": "Christiann335",
              "text": "Yes, you are right. But the profit margine will be low if i start outside of the balkans where the people take higher salaries or in the US and take americans or people from europe as my employees. In my country the salary is 600 euros at most. The client will pay me per person let’s say around 2500 dollars and in america they pay them for the same job around 3-3500 depends where and what kind of work. I can make them a better deal and they will want to pay less and work with me instead with people in america.",
              "score": 1,
              "created_utc": "2026-01-29 09:24:24",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2chlxs",
          "author": "5kPatel",
          "text": "How much experience do you have in this line of work?",
          "score": 1,
          "created_utc": "2026-01-29 03:28:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2dqu0q",
              "author": "Christiann335",
              "text": "I have 3 months experience working for my client at this company i am right now and i mostly know my job, but Im not in a hurry and I plan to gather more information and experience here.",
              "score": 1,
              "created_utc": "2026-01-29 09:17:32",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2du41m",
                  "author": "5kPatel",
                  "text": "I saw a similar business in India and always was interested to learn/know what the job involves. Would you be willing to share / teach me? I can the be a small investor, if you're looking for investment.",
                  "score": 1,
                  "created_utc": "2026-01-29 09:48:22",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2dppw5",
          "author": "reviewsthatstickteam",
          "text": "It’s cool you’re thinking about building something better, that mindset already matters a lot. Just keep in mind 20 people is big right out the gate, clients and cash flow are the hard part, not the work itself. Maybe start smaller, lock in a few solid practices first, then grow from there.",
          "score": 1,
          "created_utc": "2026-01-29 09:06:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2dqlqj",
              "author": "Christiann335",
              "text": "You are right, but I think it depends with how much clients will i start. Let’s say I start with one client and the client needs 5-10 people. Then im going to start with 5-10. But still you are right and Im going to take it in consideration, since It’s going to be my first time managing people i will start with a lower number. Thank you.",
              "score": 1,
              "created_utc": "2026-01-29 09:15:20",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o3bsj5c",
              "author": "veil_63094",
              "text": " I totally get that! When I started my business, I thought big too, but starting with just a couple of solid clients made all the difference. Locking down those relationships is key, and it really helps build the cash flow you need. Starting small could really make it easier to bring your vision to life later on!",
              "score": 1,
              "created_utc": "2026-02-03 11:55:09",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2mlrdp",
          "author": "lahham99",
          "text": "I think this is really cool. I live in the US and i work in tech. Message me, I’d love to help and get involved.",
          "score": 1,
          "created_utc": "2026-01-30 16:26:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2qdqx6",
          "author": "Dry_Detective4467",
          "text": "If you need to get capital for your business please message me",
          "score": 1,
          "created_utc": "2026-01-31 03:53:53",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qtlj9p",
      "title": "what do you think of this??",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1qtlj9p/what_do_you_think_of_this/",
      "author": "Remote-Career6774",
      "created_utc": "2026-02-02 04:44:55",
      "score": 4,
      "num_comments": 13,
      "upvote_ratio": 0.75,
      "text": "so i was thinking of starting a side hustle and came up with this idea might not be new but hear me out. i plan to look for clinics salons or similar businesses that do not have their own website. then i would approach them and ask if they want one to improve their online presence and reach more people. if they agree i would hire a web designer from fiverr or freelancer brief them on what is needed get the website made and then deliver it to the business.",
      "is_original_content": false,
      "link_flair_text": "Idea Feedback",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1qtlj9p/what_do_you_think_of_this/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o34e0kb",
          "author": "EmbarrassedOne2329",
          "text": "Nothing to lose here, I think if you are excited about it, why not try. Also I would suggest that for some clients you should build the websites for free or charge them only the Domain and Host cost, and ask them to give you a review or suggest to their friends.",
          "score": 3,
          "created_utc": "2026-02-02 08:02:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o34f4nt",
              "author": "Remote-Career6774",
              "text": "makes sense, I will surely do this, thanks mate",
              "score": 1,
              "created_utc": "2026-02-02 08:12:44",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o35kb9c",
              "author": "Remote-Career6774",
              "text": "but also the thing is yeah that i tried finding people on fiverr and freelancer but couldn't find one guy. there are some who cost either 70-80k or some with no profile.",
              "score": 1,
              "created_utc": "2026-02-02 13:47:54",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o35kqof",
                  "author": "Ok_Rock_8421",
                  "text": "It sounds like that means you have found a gap in market need vs market supply. If you can’t outsource the work sounds like a good opportunity to upskill and market yourself",
                  "score": 1,
                  "created_utc": "2026-02-02 13:50:17",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o35r6fm",
          "author": "mrashrafuul",
          "text": "its a fine idea but your problem isnt the website its getting yeses, most of these businesses dont care about sites, you’ll hear “we already have Instagram” a lot, so instead of selling a website sell one clear result like “more bookings”, offer a simple landing page plus Google profile setup not a full custom site, charge a small setup fee plus monthly maintenance, and only target places that look busy but messy online, do that and you’ll close way more than flipping random Fiverr sites.",
          "score": 2,
          "created_utc": "2026-02-02 14:25:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o35sbgc",
              "author": "Remote-Career6774",
              "text": "i live in mumbai so i feel a lot of people here would genuinely be interested since it is kind of a status thing. and i am good with words so i will try to do my best.",
              "score": 1,
              "created_utc": "2026-02-02 14:31:30",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o36srkq",
          "author": "Beginning_Alarm784",
          "text": "essaye par toi meme de créer les sites, aujourd'hui avec le vibe coding tu peux faire des choses géniales",
          "score": 1,
          "created_utc": "2026-02-02 17:25:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o36tbm3",
              "author": "Remote-Career6774",
              "text": "i have started learning coding mainly python and stuff like that",
              "score": 1,
              "created_utc": "2026-02-02 17:28:00",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o395fwk",
          "author": "JacobAldridge",
          "text": "As some else said, you have nothing to lose by trying.\n\nIn business training, what you’re describing is known as “the village with no shoes”.\n\nTwo salespeople are sent to a village to see if opening a shoe store would be a good idea.\n\nThe first salesperson calls his boss: “This is a terrible idea. Nobody in the village wears shoes, so we will have no customers.”\n\nThe second salesperson calls *his* boss: “This is a great idea. Nobody in the village wears shoes, so we will have lots of customers!”\n\nFor small businesses without a website, which salesperson is correct? You have the chance to find out!\n\n(I personally think the first salesperson is correct. If a business doesn’t have a website today, that probably means they don’t want one enough to ever pay for it. You are better off targeting businesses with bad / old websites and having them upgrade - then at least you are selling shoes to people who have bought shoes before.\n\nBut my view is filtered through richer Western cities where I work. The experience in Mumbai, where perhaps it’s harder to find good cheap website builders, may be different and the second salesperson may prove correct and wealthy.)\n\nGood luck!",
          "score": 1,
          "created_utc": "2026-02-03 00:13:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o39lud9",
          "author": "DicksDraggon",
          "text": "I think you are better off learning AI SEO or GEO. Building a site yourself that is actually good. Then renting it out to a service business. You could make 15 sites and rent them out for $500 a month or try for higher priced and have less of them... maybe 4 $2000 sites. The organic way is called rank & rent or you can spend money on ads and do it backwards and then it is called rent & rank. But I don't think rent & rank will work with ai searches.... yet.\n\nI would not trust anyone else to build my sites. I see what junk is on the internet.",
          "score": 1,
          "created_utc": "2026-02-03 01:45:50",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qtisjt",
      "title": "Feedback on a concierge-style subscription to automate birthday gifts (flowers)",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1qtisjt/feedback_on_a_conciergestyle_subscription_to/",
      "author": "jademaester",
      "created_utc": "2026-02-02 02:37:28",
      "score": 3,
      "num_comments": 6,
      "upvote_ratio": 0.81,
      "text": "Looking for feedback.  Idea is a concierge service for busy, high net worth individuals to never miss an important birthday. Basically paying for peace of mind and automating bday gift giving. \n\nI would create a form for people to fill out with names, birthdays, budget and gift (would likely start with flowers). I would then send out the bday gifts so it would be set it and forget it for the customer. Value is removing cognitive load and avoiding missed birthdays, not the flowers themselves.\n\nI would do an annual fee and then take a service fee on each delivery. There’s obviously ways to automate, get better bulk pricing, etc. down the line but right now I’m testing the idea and then working to get initial customers (probably waive the annual fee for their first few) and doing everything manually. \n\nThoughts? Feedback? Trying to pressure test if there’s something here. ",
      "is_original_content": false,
      "link_flair_text": "Idea Feedback",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1qtisjt/feedback_on_a_conciergestyle_subscription_to/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o33jkxi",
          "author": "theredhype",
          "text": "Like this? https://madianite.com/",
          "score": 1,
          "created_utc": "2026-02-02 04:02:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o33k2c5",
          "author": "theredhype",
          "text": "It's an assumption you'll have to test, but I suspect HNWIs probably already delegate this task to an executive assistant, family member, etc.",
          "score": 1,
          "created_utc": "2026-02-02 04:05:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o33k8nb",
          "author": "theredhype",
          "text": "Most of the gift giving platforms I've seen focus on corporate, group, event, or special event niches. It's a guess, but I suspect some of them probably pivoted that direction after finding that people wouldn't use this dynamic for close personal gifts.",
          "score": 1,
          "created_utc": "2026-02-02 04:06:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o35hpjt",
          "author": "ChestChance6126",
          "text": "The value prop makes sense, but the risk isn’t flowers, it’s trust and edge cases. Miss one date or send the wrong thing, and the whole premise collapses fast, especially with high net worth clients who have zero patience for ops mistakes.\n\nI’d pressure test willingness to pay before building anything fancy. Manually onboard a handful of people and see if they actually hand over a list of names and budgets, and let you handle it without micromanaging. That behavior tells you more than survey feedback.\n\nAlso, I’d consider whether birthdays alone are enough surface area. The real leverage might be “important dates I don’t want to think about” rather than one occasion. If it stays too narrow, churn could be brutal once the novelty wears off.",
          "score": 1,
          "created_utc": "2026-02-02 13:33:12",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qok7yx",
      "title": "If you had unlimited funds to create the store of your dreams, what would it be?",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1qok7yx/if_you_had_unlimited_funds_to_create_the_store_of/",
      "author": "Im2hardcore4u",
      "created_utc": "2026-01-27 17:23:46",
      "score": 3,
      "num_comments": 4,
      "upvote_ratio": 0.72,
      "text": "I think I would go for an old fashioned candy store. Wooden interiors with the glass jars of gum balls and everything.",
      "is_original_content": false,
      "link_flair_text": "Idea Feedback",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1qok7yx/if_you_had_unlimited_funds_to_create_the_store_of/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o24c29v",
          "author": "imabetaunit",
          "text": "A store where everything I wish for magically appears and I can take it home with me for free.",
          "score": 2,
          "created_utc": "2026-01-28 00:11:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o25eavv",
          "author": "nut-sack",
          "text": "unlimited funds? A casino. Its rigged the odds are always in the houses favor.",
          "score": 2,
          "created_utc": "2026-01-28 03:32:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o24hipq",
          "author": "AgitatedStranger9698",
          "text": "Dude...every tourist trap town I've been to has that. \n\nSweeties in Phoenix is that as well. \n\nInteresting dream. But readily doable especially if you trade regional locked candies Grey market style with online like nut goody, pecan nut rolls, Mary janes etc. \n\nDouble with pot candies/edibles. \n\nThen its just cost reduction, location, and advertising. \n\nRide a middle to upper class neighborhood line near a high traffic pull, like across from the theatre...\n\n[Ironically, oh look here one](https://rocketfizz.com/)\n\nAlso TWO in downtown rockford, MI. One is more popcorn and the other a chocolate.\n\nThe only twist you have is the willy Wonka candy man setup. \n\nTldr: Why let your dream be dreams. Its doable now.",
          "score": 1,
          "created_utc": "2026-01-28 00:39:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o257iz8",
          "author": "Universal09",
          "text": "I’d love to open a cool dispensary. All of them where I am suck. In addition I’d have an arcade attached/in the dispensary.",
          "score": 1,
          "created_utc": "2026-01-28 02:55:23",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qqj1he",
      "title": "Where/How to market my Time Capsule Film idea",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1qqj1he/wherehow_to_market_my_time_capsule_film_idea/",
      "author": "PeartreeProd",
      "created_utc": "2026-01-29 19:51:20",
      "score": 3,
      "num_comments": 3,
      "upvote_ratio": 1.0,
      "text": "Hi all,\n\nI'm a Director of Photography - I shoot TV shows (BBC, Netflix, A&E, Discovery) by trade.\n\nI'm working up a side business idea and would like some feedback and suggestions as where to market this locally:\n\nThe idea:\n\nFamily Time Capsule Films:\n\n\\- A short celebratory documentary style film whereby elderly family members reflect on their lives so that it can be viewed by future generations.\n\nThe idea is to capture the life story, life lessons etc in a short film.\n\nI live in a high net worth area and was wondering where to begin marketing this idea beyond my immediate network?\n\nI'm due to shoot a proof of concept film with my Father in Law (he's has an incredible life) and intend to use this film as a marketing tool.\n\nTIA",
      "is_original_content": false,
      "link_flair_text": "Idea Feedback",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1qqj1he/wherehow_to_market_my_time_capsule_film_idea/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o2p11mu",
          "author": "No-Building-3798",
          "text": "Checkout \"Remento\". It was a shark tank deal with a similar business model. That said, I like the idea. I would focus on creating viral shorts on youtube and tiktok to drive traffic. Maybe Facebook for the aging boomers who are thinking about their grandkids, and YouTube for the millennials or gen Z who want their parents to leave something for the grandkids.",
          "score": 1,
          "created_utc": "2026-01-30 23:10:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2ptpq7",
              "author": "PeartreeProd",
              "text": "Thanks for the reply. \n\nI checked out Remento, it’s a cool product - def geared towards the mass produced market whereas I’m offering a bespoke service to HNW families that live in my area. \n\nI’ve shot a lot of docos so I’ve extensive experience interviewing subjects. I’d lean into that - do a discovery call beforehand and then tailor my script and shoot accordingly. \n\nI like the idea of using FB as a tool given my target demographic. \nDef will be throwing together some 10-20 sec reels also.",
              "score": 1,
              "created_utc": "2026-01-31 01:52:02",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2qwuqp",
                  "author": "Meminto_stories",
                  "text": "Show it to us! We do keepsakes and memory books as well but are a bit faster to implement helpful new features if they make sense! Google Meminto!",
                  "score": 1,
                  "created_utc": "2026-01-31 06:13:35",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qu1ne2",
      "title": "What’s a cool name for this tool?",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1qu1ne2/whats_a_cool_name_for_this_tool/",
      "author": "Deep-Wealth8494",
      "created_utc": "2026-02-02 17:34:31",
      "score": 3,
      "num_comments": 17,
      "upvote_ratio": 1.0,
      "text": "I kept running into deals that looked real on the surface.\n\nGood conversations. Real interest. Then they just stalled forever.\n\nOut of frustration I started building a small tool that sanity checks a company before you spend weeks chasing the deal. It tries to flag early whether there is actually a path to buying or if internal blockers will say no later.\n\nBefore I go further with it I am curious how other Saas founders handle this.\n\nHow do you decide early that a deal is not worth pursuing?\n\nWhat signals do you trust the most?",
      "is_original_content": false,
      "link_flair_text": "Need a name",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1qu1ne2/whats_a_cool_name_for_this_tool/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o36uqhr",
          "author": "AutoModerator",
          "text": "Thank you for submitting your request for a business name!\n\nTo help our community members provide the most fitting and creative suggestions, please ensure your post includes:\n\n1. A detailed description of your business, its services, target audience, and unique value proposition.\n2. Any names you've already considered, including those you like and those you don't, and why. This helps avoid suggestions you've already contemplated and guides the community's creativity in the right direction.\n\nThe more context you provide, the better the suggestions you'll receive. Thanks for helping us help you find the perfect name for your business!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Business_Ideas) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-02 17:34:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o37mg6e",
          "author": "Dusskulll",
          "text": "Fraudar -- Fraud Radar, howdah",
          "score": 1,
          "created_utc": "2026-02-02 19:40:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o37mwvl",
              "author": "Deep-Wealth8494",
              "text": "Ah yes I’m a fraud because I built a tool to try and help people you got me! I’m sure you can tell by how I also didn’t ask anyone to try it out on this sub! You got me!",
              "score": 1,
              "created_utc": "2026-02-02 19:42:49",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o37n77k",
                  "author": "Dusskulll",
                  "text": "Your question is what should you call a tool that finds frauds\n\nMy answer was Fraud Radar **TO YOUR QUESTION** \n\nI am not saying YOU are the fraud",
                  "score": 1,
                  "created_utc": "2026-02-02 19:44:09",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o37vszl",
          "author": "theredhype",
          "text": "This requires a tool? \n\nAgencies and salespeople just learn how to quickly qualify a lead. \n\nWhat’s the budget. What’s the timeline / urgency. What’s the size / scope. What internal resources does the client allocate to supporting implementation. \n\nIt’s pretty easy to filter out bad leads if you know your industry, client types, etc.",
          "score": 1,
          "created_utc": "2026-02-02 20:24:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o37w9za",
              "author": "Deep-Wealth8494",
              "text": "Totally agree that good agencies learn to qualify quickly.\n\nWhat I kept running into was situations where the lead looked qualified on paper and even in early calls, but the deal still died later because of internal stuff you do not always see up front.\n\nThe tool is less about replacing qualification and more about pressure testing assumptions early. Basically a second opinion before spending weeks on it.\n\nCurious how you personally catch those hidden blockers early.",
              "score": 1,
              "created_utc": "2026-02-02 20:27:08",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o37y1sj",
                  "author": "theredhype",
                  "text": "What other flags do you need? E.g.\n\nAre executives bought in to the effort?  \nWho makes the buying decisions?  \nWhat other departments are involved?  \nWhat systems does this need to integrate with…\n\nI’m failing to imaging what a tool does that isn’t still basically a checklist for lead qualifying.",
                  "score": 1,
                  "created_utc": "2026-02-02 20:35:35",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o3821g5",
                  "author": "theredhype",
                  "text": "Perhaps this could be used as a general training tool for new salespeople. Examples of how to surface the various insights you need through conversation with a client would be good for the inexperienced.",
                  "score": 1,
                  "created_utc": "2026-02-02 20:54:22",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o394q9r",
          "author": "Drumroll-PH",
          "text": "I like names that signal clarity and filtering, not hype. Something like DealCheck, Greenlight, Pathclear, or CloseProof fits what you described. As for deals, I learned to trust budget clarity and decision ownership early, if those are fuzzy, the deal usually dies.",
          "score": 1,
          "created_utc": "2026-02-03 00:10:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3bt0nu",
          "author": "ChestChance6126",
          "text": "Name aside, the idea resonates. Early disqual isn’t about interest, it’s about the ability to decide. I usually look for three signals fast: a clear economic buyer, an explicit decision timeline, and evidence they’ve bought something similar before. If any of those stay fuzzy after a few calls, the deal usually stalls, no matter how good the conversations feel.",
          "score": 1,
          "created_utc": "2026-02-03 11:58:49",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qr10j5",
      "title": "What is the need? And is it a saturated market?",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1qr10j5/what_is_the_need_and_is_it_a_saturated_market/",
      "author": "uzairmajid92",
      "created_utc": "2026-01-30 09:38:54",
      "score": 3,
      "num_comments": 9,
      "upvote_ratio": 0.8,
      "text": "So, I am planning to start a business which is not just marketing but done for you sales. Which involves from generating leads, nurture them, do all the follow ups in automation and put up the booked appointment of service based business’s calendars. \n\nI wanna know if the businesses out here are struggling for generating more leads or getting leads closed? \n\nSo its all numbers I am making model where we dont just generate cold leads but actually booked appointments for businesses. \n\nWhat is the competition? \n\nHow saturated is this market? \n\nDo these SME’s really need such services or they are mostly relying on word of mouth maybe business directories? ",
      "is_original_content": false,
      "link_flair_text": "Idea Feedback",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1qr10j5/what_is_the_need_and_is_it_a_saturated_market/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o2l68z7",
          "author": "ChestChance6126",
          "text": "It’s a real problem, but a crowded market. Most SMEs don’t fail from lack of leads, they fail on follow-up, qualification, and process. To win here, you need a tight niche, a clear definition of a “qualified appointment,” and shared ownership of outcomes, it turns into a blame game fast.",
          "score": 2,
          "created_utc": "2026-01-30 11:55:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2l6f2e",
              "author": "uzairmajid92",
              "text": "So, we can build business in this space then.",
              "score": 1,
              "created_utc": "2026-01-30 11:56:27",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o2l6iq5",
              "author": "uzairmajid92",
              "text": "I believe you are in the same space. Lets connect and see if we can collaborate on some projects.",
              "score": 1,
              "created_utc": "2026-01-30 11:57:12",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2o43en",
          "author": "Marknikov",
          "text": "Can I ask, Which kind of SMEs are your target? Do you have any data,  businesses that purchase such services?",
          "score": 2,
          "created_utc": "2026-01-30 20:29:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2o4fok",
              "author": "uzairmajid92",
              "text": "So the business which involves technical services or people involved in the business operations have to get out for the work. They dont get time to work on their leads and sales or digital presences.",
              "score": 1,
              "created_utc": "2026-01-30 20:31:13",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2l7yc0",
          "author": "Techenthusiast_07",
          "text": "You’re right many small businesses don’t just need more leads, they need help managing follow-ups and turning interest into actual booked appointments which is the key of success. The real value is simplifying the whole process so owners can do their high value task instead of replying leads all day.\n\nin early stages of my business I also find some difficulty but after searching I have noticed AI call assistant tool which helps me to do all which can take more time and efforts of human agents. like it can allow inbound outbound calls effectively and it also schedule an appointment for you by notifying user and client also they can take feedback and summary of the chat for the owner so owner can take a quick tour of the conversation befor meetings.",
          "score": 2,
          "created_utc": "2026-01-30 12:07:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2lamin",
              "author": "uzairmajid92",
              "text": "Yes, I have been doing lead generation for 5 years now. But the problems businesses are facing were more than just generation their day to day operations hinder them managing leads efficiently. So setting up a system and a structure for “done for you appointments” would remove 90% of the business owners hassle. \nI have started building the whole structure. And will get it ready soon. \nThanks for your words on my idea. Lets connect. Hope we get  benefit from our collaboration.",
              "score": 1,
              "created_utc": "2026-01-30 12:26:08",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2kx2ch",
          "author": "Wide_Brief3025",
          "text": "A lot of small service businesses are tired of wasting time on flaky leads and no shows. Automation for nurturing and follow ups is something many wish they had but struggle to set up. If you want to identify real intent on platforms like Reddit, ParseStream can help spot and filter high quality opportunities so you spend less time chasing dead ends.",
          "score": 1,
          "created_utc": "2026-01-30 10:40:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2kxgy9",
              "author": "uzairmajid92",
              "text": "Yes thats why  I am planning to create such model where they will only talk to customer when they wants to book in. Leaving all the leads capture nurture and appointment to us. \nAnd thanks for the suggestion.",
              "score": 1,
              "created_utc": "2026-01-30 10:44:13",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qspeko",
      "title": "Do it yourself market research",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1qspeko/do_it_yourself_market_research/",
      "author": "AdamProbolsky",
      "created_utc": "2026-02-01 05:12:31",
      "score": 2,
      "num_comments": 4,
      "upvote_ratio": 0.67,
      "text": "Is there demand for a market research platform that would allow people with ideas to access real people, real ICPs, to test their idea with? I think there are a ton of companies offering this but at a huge premiums. What if it was accessible to everyone for tens of dollars?",
      "is_original_content": false,
      "link_flair_text": "App/Website Idea",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1qspeko/do_it_yourself_market_research/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o2xn8ya",
          "author": "technically_a_nomad",
          "text": "How is this different than getting up and actually talking with your intended target customer?",
          "score": 1,
          "created_utc": "2026-02-01 07:29:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2xpjsp",
              "author": "AdamProbolsky",
              "text": "Market research is the practice of conducting statistically valid research. Talking to 10 customers is for sure helpful. But talking to 100 is better. Also, people are much more likely to be honest talking to a researcher (company) than someone they are in a business relationship with.",
              "score": 1,
              "created_utc": "2026-02-01 07:50:48",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2xq3nx",
                  "author": "technically_a_nomad",
                  "text": "Eh not really. Market research does not mean you need statistically significant data to act upon customer insights; if 5 customers say they experience something but 5 others don’t, it doesn’t make the experience of the first 5 invalid, nor does it mean you need to talk to 500 customers to make their lived experience more true. You can just act upon that data of 10 customers and act proportionally. Don’t build the most complicated thing known to man if you’ve only talked to 10 people, but don’t wait until you’ve spoken with 100 or more until you try to build something simple.",
                  "score": 1,
                  "created_utc": "2026-02-01 07:55:50",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}