{
  "metadata": {
    "last_updated": "2026-01-19 16:49:57",
    "time_filter": "week",
    "subreddit": "Business_Ideas",
    "total_items": 13,
    "total_comments": 65,
    "file_size_bytes": 78630
  },
  "items": [
    {
      "id": "1qcl7xp",
      "title": "As an introvert, I’d rather build funnels than be an influencer",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1qcl7xp/as_an_introvert_id_rather_build_funnels_than_be/",
      "author": "LilTiit",
      "created_utc": "2026-01-14 11:46:30",
      "score": 18,
      "num_comments": 23,
      "upvote_ratio": 1.0,
      "text": "If I’m not mistaken, the top 1 dream job for kids today is🥁🥁: influencer.\n\nNowadays everyone has a phone and internet, everyone is constantly posting. The barrier of entry is so low, which means insane competition.\n\nBut on the other side of this, there’s now insane demand for monetization experts who know how to turn views into money without leaving a lot on the table.\n\nIn my opinion, learning to build funnels puts you in a golden spot in this influencer era. Finding clients is easy. I’ve had to raise my prices to the point where I won’t even consider anything under $10k/month base fee + commission.\n\nAnd you don’t have to work only with influencers. I built a funnel for a California construction company that sells Chinese backyard rental houses (unit price ~$300k), and now they’re selling around 5 units per month. My 5% commission on that is not bad.\n\nI guess ask me anything. Just wanted to throw this idea out here for those still starting out and standing at a road fork of choosing a business model.",
      "is_original_content": false,
      "link_flair_text": "A How-To Guide that no one asked for",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1qcl7xp/as_an_introvert_id_rather_build_funnels_than_be/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "nzkmdla",
          "author": "gardenia856",
          "text": "Building funnels over chasing clout is the move, especially now that every niche creator is drowning in attention but not revenue. The real leverage is knowing how to grab a stranger from a 15-second clip and walk them through 3–5 clear steps to a purchase without feeling like a scammy bro. The cool thing is that once you’ve built 2–3 solid funnels in different verticals, you start seeing patterns you can charge serious retainers for, just like your construction example.\n\nIf you want to push this further, I’d systemize: one core discovery doc, one funnel blueprint, one reporting template, and one “offer fix” process you run every client through. Tools like HighLevel or HubSpot for the plumbing, ConvertKit or Klaviyo for nurture, and something like Pulse for Reddit to spot real buyer questions and objections in the wild so you can wire that language straight into the funnel. Main point: mastering funnels is a quieter path, but the upside is often bigger and more defensible than being the face on camera.",
          "score": 3,
          "created_utc": "2026-01-14 17:23:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nznkn1f",
          "author": "ChestChance6126",
          "text": "I agree with the general direction, but I think people underestimate how much context and judgment funnels actually require. The mechanics are easy to learn. The hard part is understanding demand, objections, pricing power, and where the funnel should stay simple instead of clever. That is where introverts tend to do well because it rewards thinking and iteration over constant posting. The risk I see is selling funnels as a commodity instead of positioning around outcomes and constraints. When you frame it as helping a business remove friction in how money moves, not just building pages, the work stays interesting and defensible.",
          "score": 2,
          "created_utc": "2026-01-15 01:58:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzp16wf",
              "author": "LilTiit",
              "text": "Agree, there some sort of a knack required to succeed in this, which you only develop through experience. Just like with any valuable skill.\n\nAre you into marketing too?",
              "score": 2,
              "created_utc": "2026-01-15 08:16:10",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzxo1iz",
                  "author": "ChestChance6126",
                  "text": "Yeah, but more on the operator side than the influencer side. I’ve spent a lot of time around funnels, analytics, and experiments where the goal was to reduce friction and uncertainty, not to make things clever. What you said about judgment is the real skill. Anyone can wire pages together, fewer people can decide what to leave out and why. That tends to come from seeing what actually breaks or converts over time, not from templates.",
                  "score": 1,
                  "created_utc": "2026-01-16 15:28:03",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nznlig9",
          "author": "Universal09",
          "text": "Interesting post! Curious how you handle the legal side; contracts, commission terms, etc. Any lessons learned there?",
          "score": 2,
          "created_utc": "2026-01-15 02:03:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzp0ers",
              "author": "LilTiit",
              "text": "Luckily so far no lesson learned :) As a beginner I'd just suggest not messing around with contracts because let's be honest, nobody is going to take legal action over some 2k payments. \n\nI believe in forming a symbiotic relationship with a client, where both need and benefit from each other.\n\nBut with bigger clients we'll just start with building funnels and get things going, and then at some point send a ChatGPT contract with DocuSign :) If the terms are like discussed at start, then there's never any dispute or problem.\n\nDo you have legal background? What business are you in? Have any legal advice for me except for making contracts with ChatGPT? :D",
              "score": 1,
              "created_utc": "2026-01-15 08:08:48",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzon8zz",
          "author": "mothball10",
          "text": "Oh sweet you’re selling a course on how to do this?",
          "score": 2,
          "created_utc": "2026-01-15 06:12:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzoz1f2",
              "author": "LilTiit",
              "text": "Yes and the reason is that at one point the agency business model starts to feel like you are an employee at 20 different companies, always having to deal with each their issues\n\nSo I don't see the problem in taking the next step into mentoring. I've personally paid 5 figures for a piece of advice and think it's ultra valuable",
              "score": 2,
              "created_utc": "2026-01-15 07:56:08",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzsnh9f",
          "author": "metalmansteve",
          "text": "How are you keeping the clients honest? Could they not lie and say they sold no products to give you 0 on the commission?",
          "score": 2,
          "created_utc": "2026-01-15 20:39:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "nztuh09",
              "author": "marcushaerdin",
              "text": "Pretty easy to set that up as part of the deal",
              "score": 2,
              "created_utc": "2026-01-16 00:12:14",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzw5kk7",
                  "author": "LilTiit",
                  "text": "Can you elaborate your idea?",
                  "score": 1,
                  "created_utc": "2026-01-16 09:37:06",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            },
            {
              "id": "nzw5d16",
              "author": "LilTiit",
              "text": "So far I've just relied on trust and I haven't suspected anyone of lying. For larger construction projects there are like legal transparency project progress tracker softwares for everyone to see at what stage the project is, but other than that I'm not sure",
              "score": 1,
              "created_utc": "2026-01-16 09:35:09",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzj3meh",
          "author": "SunKissedHibiscus",
          "text": "Soooo I feel like I’m in a similar situation... I'm experienced in marketing, but I really don’t want to build a personal brand or show my face online. A few questions then since you kindly offered :) \n\nWhat does “building funnels” actually look like in your day-to-day work, and what tools do you use (clickfunnels, webflow, custom dev, email, crm ? \n\nHow did you land your first few clients without an audience or personal brand? Or did you have one otherwise.. \n\nWhat did your initial offer look like before you could justify higher retainers?\nThx!!",
          "score": 1,
          "created_utc": "2026-01-14 12:48:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzjad0b",
              "author": "LilTiit",
              "text": "Sure thanks for tuning in!\n\nDay to day, for new clients build the funnel from scratch (landing page, lead magnets, email nurturing workflows, automations). After that's done I try to identify bottlenecks and which one has the highest ROI to start working on. And then as a numbers guy, my favorite part: doing split tests. Like conversion rate of landing page A vs landing page B, or open rate of email subject like A vs subject line B.\n\nI'm using GoHighLevel CRM for literally everything. I've found an all-in-one tool like HighLevel have more net benefits on my business growth than trying to duct tape Wordpress + some forms plugin + Zapier and whatever together.\n\nI've tried quite every outreach method, cold emailing, messenger and IG outreach, even had my friend do cold calling instead of me :) But the first clients came from cold email and cold call. Then referals started coming unexpectedly fast, even if you have bad results, if you can keep good friendly relations with the client, then you can ask them to refer you to their other biz owner friends. \n\nMy first offer for a dentist client was \"I get you 10 new patients in the first month, or you don't have to pay\". I don't remember how many patients we got her but generated like $120,000 in revenue, so exceeded the expectations by a lot\n\nAre you also running an online business? You sound like you know a lot",
              "score": 2,
              "created_utc": "2026-01-14 13:30:02",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzqzzoo",
                  "author": "SunKissedHibiscus",
                  "text": "Thanks for sharing such a clear breakdown. Always interesting to see how folks structure funnels end to end. So I’ve worked in marketing on the corporate side, R&D type work so that was fun but stressful omgggg. Then ran my own content as a service business for start ups. Now I’m testing out some ideas for my next venture. \n\nAppreciate the generous info. Wishing you lots of success with what you’re building!",
                  "score": 1,
                  "created_utc": "2026-01-15 16:11:10",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzjanwl",
          "author": "MrMightKnow",
          "text": "How do you do it?",
          "score": 1,
          "created_utc": "2026-01-14 13:31:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzjdeo5",
              "author": "LilTiit",
              "text": "I help influencers turn their views into money, so they depend on me quite heavily",
              "score": 2,
              "created_utc": "2026-01-14 13:46:51",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzxq5kw",
                  "author": "MrMightKnow",
                  "text": "I was expecting a little more info, but thank you anyway!",
                  "score": 1,
                  "created_utc": "2026-01-16 15:37:31",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzm3qbg",
          "author": "eindrey",
          "text": "imma just ask this cuz i need help \n\nSo i started to create high quality Ai food images and from these Ai food images i get the recipe with ingredients and instructions. \n\nIve been wanting to post on Facebook and maybe Youtube (with Ai generated short food videos) and although i’ll post curated content( which i do on Pinterest and have gained quite a lot of following and audience) i still wanted to post my own type of content. I was told i wouldn’t need a website and that all i had to do was create the content and put links in the description so people can be sent directly to the affiliate sales page. \n\nSo i want to ask , now that i have started with the Ai food images and videos , would it be a good idea to get a website and how should it be structured or is there some way i can provide my audience the recipe ? cuz i need some sort or guide or plan to boost and maximize engagement. \n\nAny tips would be welcomed",
          "score": 1,
          "created_utc": "2026-01-14 21:23:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzm6aqr",
              "author": "LilTiit",
              "text": "Sure, if you paste a link in the YT short or FB/IG reel title/description, then it’s not clickable so useless.\n\nThe only viable option would be to set up keyword automations, tell the viewer to comment “LINK” or whatever, then automation DMs them the link. This only works on FB and IG. \n\nI’m not even sure how to go about with youtube… there are no good options to be honest, most just use shorts to get more traffic to long form videos\n\nAlso try to delay adding a link to your bio on IG as a small page, some sources are saying that it limits your reach alot. I’m currently testing out this theory",
              "score": 2,
              "created_utc": "2026-01-14 21:35:00",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzok4wy",
                  "author": "eindrey",
                  "text": "alright thank you i’ll keep this in mind",
                  "score": 1,
                  "created_utc": "2026-01-15 05:47:53",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nztv8ox",
          "author": "Bitter-Wonder-7971",
          "text": "the funnel patterns thing is so real. after building email flows for different industries you start seeing the same psychological triggers work everywhere - urgency for fashion, social proof for SaaS, authority for health stuff. but what nobody tells you is how much time you waste on the tech stack at first... i spent months trying every tool when really you just need something that handles the basics well and lets you write emails that sound human not like a robot.\n\nhumanic actually solves this - you just tell it what you want in plain english instead of wrestling with drag-and-drop builders.",
          "score": 1,
          "created_utc": "2026-01-16 00:16:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzpcnm9",
          "author": "goldentonez",
          "text": "this is the smartest flex, elite positioning, low ego, high leverage and way better money. love this",
          "score": 0,
          "created_utc": "2026-01-15 10:07:45",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qdx8rx",
      "title": "Dad needs a job. Just got retired unceremoniously. I have one idea to steal.",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1qdx8rx/dad_needs_a_job_just_got_retired_unceremoniously/",
      "author": "highcaliberwit",
      "created_utc": "2026-01-15 21:59:55",
      "score": 16,
      "num_comments": 24,
      "upvote_ratio": 0.9,
      "text": "So my dad just got fired after about 25 years working for a major trucking company in sales. Semi trucks. Its what happens when you want to bring a younger guys and you wanna push out the old dude. But he’s not one to let it get him down. He knows the industry really well. Tons of accolades from his former company. Recently been watching a YouTube channel called delivered. The guy live streams his car negotiations they do on behalf of customers. The basic concept of his businesses, customers pay him a flat fee to find and negotiate a car that they want on their behalf. I think my dad could essentially take that same concept and apply it to semi trucks. Basically as a consult. You could help guys or small Long just companies that need trucks to make sure that they’re not getting ripped off. We can take out the stress part of negotiating.",
      "is_original_content": false,
      "link_flair_text": "Idea Feedback",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1qdx8rx/dad_needs_a_job_just_got_retired_unceremoniously/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "nzxkwzk",
          "author": "SuspiciousMeat6696",
          "text": "A lot of major trucking companies lease their trucks.  He could help with lease negotiations.",
          "score": 8,
          "created_utc": "2026-01-16 15:13:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0fas2c",
              "author": "Unable-Connection-58",
              "text": "Good point.",
              "score": 2,
              "created_utc": "2026-01-19 04:55:45",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzu614w",
          "author": "sateliteconstelation",
          "text": "Sounds like an excellent idea, very fit for your dad and a very big FU to the trucking companies for discarding him. \nI think if you invest a bit in a clear website, SEO and a linkedin profle, he’ll be swimming in clients in no-time",
          "score": 7,
          "created_utc": "2026-01-16 01:15:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0fay46",
              "author": "Unable-Connection-58",
              "text": "Appreciate it.",
              "score": 1,
              "created_utc": "2026-01-19 04:56:55",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzvpl4e",
          "author": "Unable-Connection-58",
          "text": "This sounds like a reasonable idea given his experience in the industry. Owner-operators and small fleets could benefit from help with fair pricing and avoiding common pitfalls. Starting small to test if people are willing to pay would be a smart first step.",
          "score": 6,
          "created_utc": "2026-01-16 07:12:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0fadzk",
              "author": "Unable-Connection-58",
              "text": "**Well said.**",
              "score": 2,
              "created_utc": "2026-01-19 04:53:02",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0fyk72",
                  "author": "senorcuchillo",
                  "text": "Lmfaoooo did u just comment on your own comment",
                  "score": 2,
                  "created_utc": "2026-01-19 08:09:01",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzvfhvq",
          "author": "Drumroll-PH",
          "text": "This is actually a strong idea. I’ve seen similar models work in cars because buyers hate the game, and trucks are even worse. If he already knows pricing and dealer tricks, that alone is worth paying for.",
          "score": 6,
          "created_utc": "2026-01-16 05:50:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzvi5u8",
              "author": "highcaliberwit",
              "text": "We’ve talked more about it. It’s not just pricing, but also getting the proper build out. It get more technical where they might not buy the proper gear ratio or too little engine that can handle their routs. They can buy too little or too much truck",
              "score": 6,
              "created_utc": "2026-01-16 06:11:11",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0fbbak",
                  "author": "Unable-Connection-58",
                  "text": "Agreed the right spec matters just as much as price.",
                  "score": 2,
                  "created_utc": "2026-01-19 04:59:29",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o0fb3mv",
              "author": "Unable-Connection-58",
              "text": "Agreed.",
              "score": 2,
              "created_utc": "2026-01-19 04:57:59",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzwa29f",
          "author": "historian1067",
          "text": "i’d be interested in trying this out. DM me",
          "score": 5,
          "created_utc": "2026-01-16 10:18:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0fbglu",
              "author": "Unable-Connection-58",
              "text": "Just sent you a DM.",
              "score": 2,
              "created_utc": "2026-01-19 05:00:31",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzta937",
          "author": "Glum-Yak8422",
          "text": "Sounds like a good idea. I would suggest validating the size of the market first to see if it would be worth his time.",
          "score": 3,
          "created_utc": "2026-01-15 22:26:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "nztaf38",
              "author": "highcaliberwit",
              "text": "All he’s got is time",
              "score": 5,
              "created_utc": "2026-01-15 22:26:50",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0fbotn",
                  "author": "Unable-Connection-58",
                  "text": "That’s true.",
                  "score": 1,
                  "created_utc": "2026-01-19 05:02:07",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o0fbl05",
              "author": "Unable-Connection-58",
              "text": "Appreciate the feedback.",
              "score": 1,
              "created_utc": "2026-01-19 05:01:22",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nztjxtg",
          "author": "bigbird988",
          "text": "What about light duty vehicles? Like service technician trucks. What is experience transferred to the process of acquiring these types of vehicles I might have an opportunity.",
          "score": 3,
          "created_utc": "2026-01-15 23:15:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "nztn5ky",
              "author": "highcaliberwit",
              "text": "I’d imagine similar. It’s just know the market in the sense of what prices are reasonable.",
              "score": 4,
              "created_utc": "2026-01-15 23:32:34",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0fc0dy",
                  "author": "Unable-Connection-58",
                  "text": "Absolutely.",
                  "score": 1,
                  "created_utc": "2026-01-19 05:04:25",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o06pj01",
          "author": "Content_Barracuda509",
          "text": "Great idea, and his industry experience is a real advantage - small fleets or owner-operators would likely pay a flat fee to avoid bad deals.",
          "score": 3,
          "created_utc": "2026-01-17 22:30:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0fc5bw",
              "author": "Unable-Connection-58",
              "text": "\n\n**Agreed.**",
              "score": 2,
              "created_utc": "2026-01-19 05:05:23",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0h5k1n",
          "author": "Sufficient_Sell_6103",
          "text": "I know a guy who does that for higher income folks and does really well. Would be a great concept for that industry given the high price of the trucks",
          "score": 1,
          "created_utc": "2026-01-19 13:57:19",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qdm7me",
      "title": "Disappointed with job",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1qdm7me/disappointed_with_job/",
      "author": "Ready-Accountant-502",
      "created_utc": "2026-01-15 15:16:13",
      "score": 13,
      "num_comments": 8,
      "upvote_ratio": 0.88,
      "text": "woke up one day and realized every day for the next 25 years i will be coming to an office, doing a boring desk job.\n\nI basically am stuck doing 6 day work weeks, the job itself isn't bad, but i am having a hard time accepting this.\n\nI'm legitimately heartbroken that i didn't do more with my life when i was younger. I thought having a job, being on my own, making decent money; would make me happy.\n\nInstead i feel empty and asking \"why didn't i do more?\" \n\nWhen it hit me, i was legitimately heartbroken. I'm 40 years old and now my youth is gone, what can i do? I considered going back to college, but my understanding is, even people with masters degrees can't find employment anymore.\n\nI have read stories about people starting businesses and going on to accomplish amazing things, that's sort of my dream at this point. I don't know anything about business and so i'm reaching out for assistance.\n\n",
      "is_original_content": false,
      "link_flair_text": "A How-To Guide that no one asked for",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1qdm7me/disappointed_with_job/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "nzqqky3",
          "author": "Enough_Garlic_2795",
          "text": "Why not use your stability to fuel a passion for now? Or find a fun hobby?",
          "score": 3,
          "created_utc": "2026-01-15 15:28:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzss59b",
          "author": "Geniejc",
          "text": "This is the wobble. The midlife crisis.\n\nI had mine at 35.\n\nI just couldn't see myself doing the job in my 50s and beyond.\n\nI torched everything within 6 months , the girl I was with , gave her my equity in the house and the job.\n\nWhat I will say is I used my last 4 months in the job to learn things to help m start the business.\n\nThe girl I was with really wasn't into the idea of me starting the business , and the relationship had run it's course. It a bloodless split.\n\nGot rid of 90% of my stuff and moved back into my old box room bedroom at my mum and dad's.\n\nStarted a business , dropped 7 stone and got happy , still am.\n\nMet my wife 2 years later got married in at 39 and twins at 43. \n\nI'm 50 now business is just me working from home, I can do this til I'm 70 if I want.\n\nHappiness is under rated.",
          "score": 3,
          "created_utc": "2026-01-15 21:01:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzvs99x",
              "author": "Consistent_Ride7424",
              "text": "Great story of life. Thanks for sharing",
              "score": 1,
              "created_utc": "2026-01-16 07:35:09",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzvaxdh",
          "author": "ChestChance6126",
          "text": "You’re not late, you’re just finally being honest with yourself. A lot of people don’t hit that realization until much later, or never at all. Starting a business doesn’t mean blowing up your life or quitting your job tomorrow. It usually starts with learning how to solve one small, real problem for someone and getting paid for it. At 40, your advantage is perspective, patience, and work ethic, not raw hustle. If I were you, I’d focus on experimenting on the side, low risk, low ego, and see what actually gives you energy. Feeling empty is a signal, not a verdict.",
          "score": 2,
          "created_utc": "2026-01-16 05:17:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzqtsvq",
          "author": "Refuse-National",
          "text": "Your day job does not dictate who you are. Use that stability to do a side gig or pick up a new hobby, etc. I know someone who sold insurance and hated it but it let them do their art so it worked out.",
          "score": 1,
          "created_utc": "2026-01-15 15:43:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzsqjd8",
          "author": "Drumroll-PH",
          "text": "I hit a version of this in my late 20s and it was rough. What helped wasn’t a big reset, it was starting something small on the side that felt mine again and building momentum from there. Forty isn’t the end, it’s usually when people finally know what they don’t want.",
          "score": 1,
          "created_utc": "2026-01-15 20:54:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzuwpqg",
          "author": "Shpongi100",
          "text": "Plus 1 to all of this - I think we all get to this point. Some earlier, some later. But good news is it sounds like you woke up in a not so bad spot. Just use your money and time to find something you enjoy.",
          "score": 1,
          "created_utc": "2026-01-16 03:45:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzrrqil",
          "author": "-M83",
          "text": "Okay. So you’re starting at the bottom of the I-don’t-want-to-work-9-5 mountain. The good news? We should be so lucky - the hardest part is over (realizing you don’t want a 9-5 and getting started aka posting here for advice).\n\nStarting a business is relatively easy, but extremely complex. At the end of the day, applying a reductionist view, someone out there will need to swipe a credit card for something you made/did or will make/do. \n\nWhat’s a common problem you see in your industry? Whats a company that already exists that you can copy/tweak their offering? Products or Services? Bits or Atoms? These are just some questions to get the mind moving in the right direction.\n\nMost businesses just become jobs with extra steps, or a lifestyle. And that’s okay! Because YOU are in control. YOU are the captain now. But, like everything else in life, that is a trade off.\n\nFigure out:\n- What you can offer (what skills do you have? what insight makes you unique?)\n- Who’s gonna buy it (who needs this thing you’re offering?)\n- How are you going to reach them (phone? snail mail? cold email? LinkedIn?)\n- How are they gonna buy it (credit card? recurring? one off? platforms? (Etsy, Gumroad, etc.))\n- How can you make this p/s flywheel more efficient?\n\nOnce you answer all of the above, you can start testing & iterating. From there you are off to the races! Happy to help, just lmk. ",
          "score": 1,
          "created_utc": "2026-01-15 18:15:43",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qee3jq",
      "title": "Small business owners: would this kind of help actually be useful, or am I missing the point?",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1qee3jq/small_business_owners_would_this_kind_of_help/",
      "author": "Enough-Fisherman8536",
      "created_utc": "2026-01-16 11:59:35",
      "score": 7,
      "num_comments": 7,
      "upvote_ratio": 1.0,
      "text": "Hey everyone,\n\nI’m a business analytics postgrad in the UK and honestly... the entry-level analytics market right now is rough.  \nSeeing people with 3–4 years of experience applying for “junior” roles made me rethink the whole apply endlessly and wait approach.\n\nOver the last year, through internships and project work, one thing became very clear to me:  \nmost small businesses don’t need “analytics”..... they need clearer answers to very basic business questions.\n\nSo I’m thinking of building a very small, agency...focused on helping small businesses answer things like:\n\n1. Which products actually make money vs just take up space?\n2. Where is cash or effort leaking day to day?\n3. What should the owner focus on this month vs ignore for now?\n\nNot dashboards for the sake of it.... just clarity.\n\nWhat I’m actually talking about is as following....\n\nFor example, in a recent retail-style setup I worked on, the focus was simply:\n\n1. organising daily sales and stock data in one place (Excel / Sheets)\n2. identifying top-selling vs slow-moving items\n3. linking staff shifts to busy vs quiet periods\n4. ending with a 1-page action plan: what to stock less, what to push more, and what to stop doing\n5. No fancy software. No heavy tools. Just decisions made easier.\n\nHow I’m thinking of working (at least initially)\n\nunderstand how you currently track sales, inventory, staff, costs\n\nI go away, analyse, and come back with:\n\n2–3 clear insights\n\n2–3 concrete actions\n\ndone for free at first, to build real case studies and learn\n\nThis is not a big consultancy pitch nor I’m not pretending to scale this overnight.\n\nBefore I take this any further, I want honest feedback from people who actually run businesses:\n\n1. Would this kind of help be useful at all?\n2. Which part of your business feels the most “blind” right now.....inventory, margins, staffing, planning?\n3. Is this something you’d ever pay for if it saved time or money, or is it mostly a nice-to-have?\n\nIf you’re comfortable sharing:\n\nwhat type of business you run (retail, food, services, etc.) or where decisions feel more like guesswork than clarity or even “this wouldn’t work” is a useful answer.\n\nThank you  \n",
      "is_original_content": false,
      "link_flair_text": "Idea Feedback",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1qee3jq/small_business_owners_would_this_kind_of_help/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "nzz5se1",
          "author": "Man1uss",
          "text": "Hey I like your idea and I have a question. If it turned out to be something that is actually helpful and people want to pay for, how exactly would you charge these businesses? Would this be something like a one-time service where you analize different aspects of a business and give clear feedback for a cartain price? Or would this be your permanent job with monthly salary? Lastly, how much would this type of help cost? Oh and just to clarify - 1. I dont own any type of business as of right now, 2. I do realise that this might be a dumb question but Im just a teen who has no idea about any of this stuff and is trying to learn new things from people like you. Thank you for your time.",
          "score": 1,
          "created_utc": "2026-01-16 19:25:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o00oqdd",
              "author": "Enough-Fisherman8536",
              "text": "Not a dumb question and all.....I am not like an expert on this but i will try to answer your question.\n\nRight now, the focus is on learning and building credibility, so I’m not charging anything. I want to understand real business problems first and make sure the help actually creates value.\n\nIf it *does* turn out to be useful and people are willing to pay later, I’d probably keep it simple and flexible rather than a salary or full-time role. Something like:\n\n* **Basic plan**: one-time review + clear suggestions (what to track, what tools to use, what to fix or improve)\n* **Setup plan**: actually helping set things up (organising data, basic reports, simple systems)\n* **Deeper support**: more hands-on, outcome-focused work (finding leaks, improving decisions, setting priorities)\n\nPricing would depend on business size and effort...but the idea is to keep it affordable and practical, not expensive consulting.\n\nAnd honestly, questions like yours are exactly how people learn this stuff...so keep asking 👍",
              "score": 2,
              "created_utc": "2026-01-16 23:56:28",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o004mhh",
          "author": "EvokeNZ",
          "text": "I use shopify and it has a bunch of prebuilt reports and also raw access to their query language so I can build my own. But I can see how these would be great for a business that doesn’t have a crm. \n\nHere are the most useful reports I’ve used after modifying them myself:\n\nB and C products over the last year - I use this to decide what goes into the bfcm sale\n\nSpecific brand products sold over the last three months and how much of each I have currently - I use this to reorder stock from the supplier\n\nCustomers who bought a specific product more than once - shopify actually can’t do this one even with custom code but it would be useful for loyalty and similar marketing. I can do it manually by exporting to excel but it’s a hassle. \n\nCustomers who have an active order and spent over $X lifetime - I use this to add a little gift to their order. Shopify is really clumsy for this workflow so it’s a bit manual with notes etc. \n\nCustomers who made their 10th order - I send them a review request",
          "score": 1,
          "created_utc": "2026-01-16 22:09:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o04afjr",
              "author": "Enough-Fisherman8536",
              "text": "Actually This is a good eg of what I’ve been noticing. A lot of businesses do have software and data....the problem isn’t lack of data, it’s that most of it stays raw and fragmented.\n\nIn your case, you clearly know what questions matter, but even then you’re still jumping between exports, manual workarounds, and notes to make it usable. That gap between “data exists” and “data actually drives decisions or workflows” feels like where the real opportunity is.\n\nI think sometimes structuring what’s already there and turning that into decision-ready insights feels way more valuable than adding yet another tool.",
              "score": 1,
              "created_utc": "2026-01-17 15:30:05",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o01b9tq",
          "author": "JacobAldridge",
          "text": "Small business advisor here, sharing a few thoughts - definitely a need, likely an opportunity, some obstacles to overcome.\n\nFirst, work out what you mean by “Small business”. When people tell me that’s their niche, I always follow up with “How do you define a small business?” and the answers vary wildly.\n\nTo me a small business is maybe 4-12 employees; I’ve seen definitions that go up to $50 million in annual revenue! And some people talk about solopreneurs as SMEs.\n\nThis is important for a few reasons. You want to know who you’re chasing for work, and make it easy for anyone who might refer you clients. I’ve learned from trial and error that my best clients are 12-48 employees - the vast majority of website enquiries and referrals I’ve received have been much smaller, where I’m often too expensive, making it a waste of time for everyone.\n\nMy other observation is that - outside of digital-native businesses like ecommerce - **most small businesses have very little data**.\n\nI would love, for example, to have an AI version of myself that could make a digital twin of the business and provide constant observations and suggestions. But most of my clients have an accounting platform, bits of disconnected marketing data, maybe some sales or workflow spreadsheets (I’ve often helped them build), and a LOT of stuff in people’s heads and guts.\n\nWorth noting at this point that I don’t work with retail or hospitality - and I guess those are two sectors with good POS data you could use? I avoid them because they’re B2C with low margins, and often too cheap to pay even for good advice.\n\nThe bigger the business, the more software, the more systems, the more consistent and accessible the data. So that’s perhaps your biggest challenge - what are the types and size of businesses that you want to work with, where you can actually help?\n\n**What would my clients pay for (and how much?)**\n\nThere’s definitely money to be made. I helped a law firm get clear on individual billing data - who was producing what, and how could people see that information sooner. That part of a wider project was around $25,000.\n\nI have a few trade / home services businesses that struggle to see daily revenue data - especially in advance. They have scheduling software, usually prices are recorded in their, but there’s no button that says “Next Wednesday you’ll do $20,000 but your target is $30,000”. Getting that data in arrears is unhelpful - give it to them early and you can charge.\n\nMarketing and sales is the other big one. Marketing agencies (and managers) love to report on “conversions”, by which they mean “converted into a lead”. Small business owners don’t care about “lead conversions” they want “converted into a paying client” - and yet showing that data, from enquiry to lead to sale to lifetime value - is surprisingly difficult for most SMEs. Being so close to the money, this is valuable and solutions can charge a lot.\n\nJust sticking with the data, I think you’ll be able to charge either a few thousand up front and/or a few hundred a month ongoing.\n\nIf you can also provide solutions and help execute the change, then clients will be worth tens of thousands per year.\n\nUnless you really do start chasing much larger businesses with solid consulting solutions. That’s now above my area of expertise, but many contracts there start in the hundreds of thousands!\n\nGood luck.",
          "score": 1,
          "created_utc": "2026-01-17 02:13:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o04c19q",
              "author": "Enough-Fisherman8536",
              "text": "WOW!!!....This is incredibly helpful...thank you for taking the time to write this.\n\nYou’re right, “small business” is way too vague, and I’m realising the definition matters a lot. Right now I’m leaning towards businesses that are *past survival mode* but not structured enough to justify a full-time analyst....probably owner-led teams with some software in place, but messy or disconnected data.\n\nI’m also very aware of the data problem you mentioned. A lot of this is intuition, gut feel, and partial systems. That’s actually why I’m trying to start with very narrow, decision-led use cases (like revenue visibility, customer mix, or near-term planning) rather than broad 'analytics'.\n\nAt this stage, I’m intentionally doing a few focused pilots to learn where real value shows up, document outcomes, and avoid building something generic too early. Long-term, I agree...anything close to cash flow or sales-to-value tracking is where owners will actually pay.\n\nReally appreciate you sharing concrete examples.... this gives me a much clearer frame to navigate this properly.\n\nBut finding and reaching out to potential customers still remains a main hurdle I would say!",
              "score": 2,
              "created_utc": "2026-01-17 15:37:51",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o04nh1i",
                  "author": "Wide_Brief3025",
                  "text": "Getting in front of the right small business owners can definitely be tricky, especially with such narrow use cases. One thing that helped me was tracking targeted keywords and conversations in real time on platforms like Reddit and Quora. Using a tool like ParseStream can make it easier by filtering out the noise and surfacing quality leads you might actually want to connect with.",
                  "score": 1,
                  "created_utc": "2026-01-17 16:32:12",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qeh95k",
      "title": "What can exchanges learn from Ferrari’s approach to brand partnerships?",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1qeh95k/what_can_exchanges_learn_from_ferraris_approach/",
      "author": "SirBankz",
      "created_utc": "2026-01-16 14:22:21",
      "score": 6,
      "num_comments": 4,
      "upvote_ratio": 1.0,
      "text": "Ferrari recently announced its first-ever partnership with an exchange, bingx, which stood out to me from a *business strategy* perspective.\n\nFerrari is known for being extremely selective with partnerships, prioritizing long-term brand equity, precision, and global positioning over short-term exposure. This raises an interesting business question:  \nIs this partnership just sponsorship, or a calculated brand-alignment move where both sides are borrowing credibility and audience reach?\n\nFrom a business idea standpoint:\n\n* How do emerging digital platforms use legacy brands to accelerate trust?\n* What makes a partnership “worth it” for a premium brand with decades of reputation at stake?\n* Could this model apply to other high-trust industries (finance, health, education, mobility)?\n\nhttps://preview.redd.it/drnj1rdf0qdg1.png?width=1536&format=png&auto=webp&s=aa29ac856599eb0081cc1439e263fde4ca9e9fbd\n\n  \n",
      "is_original_content": false,
      "link_flair_text": "No applicable flair exists for my post",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1qeh95k/what_can_exchanges_learn_from_ferraris_approach/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "nzxbbgv",
          "author": "Sufficient_Fuel5269",
          "text": "This announcement between these two companies, I believe, is a surprising but logical combination given their shared values: precision, discipline, and performance.\n\nThe comparison between the demands of F1 and trading reinforces the coherence of the partnership.\n\nFurthermore, the market reacted positively, and Ferrari's shares rose after the announcement, a sign of global confidence.",
          "score": 2,
          "created_utc": "2026-01-16 14:26:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzxgh1w",
              "author": "SirBankz",
              "text": "I think the collab will let the two parties get more recognitions in the market.",
              "score": 1,
              "created_utc": "2026-01-16 14:52:36",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0141bs",
          "author": "Cute_Dragonfruit4738",
          "text": "I had a crypto exchange client last year who thought slapping their logo on anything was a win. They burned seven figures before realizing their SVS was in the gutter because the audience just didn't align. Ferrari isn't just renting its logo; this is a hardcore QAE play for BingX, borrowing that legacy trust to instantly upgrade their brand tier. The real test is if the exchange can actually deliver a premium experience that justifies the association, or that EMV will be hollow.",
          "score": 1,
          "created_utc": "2026-01-17 01:27:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o02snsh",
          "author": "Santa_Fei",
          "text": "It feels more like controlled brand alignment than sponsorship. Premium brands care about consistency and long-term trust, not reach. For newer platforms, the value is validation. For legacy brands, it’s staying relevant without diluting identity. That model fits any trust-driven industry.",
          "score": 1,
          "created_utc": "2026-01-17 09:04:26",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qcukx4",
      "title": "Looking for a business partner",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1qcukx4/looking_for_a_business_partner/",
      "author": "DutyArtistic",
      "created_utc": "2026-01-14 18:08:24",
      "score": 6,
      "num_comments": 9,
      "upvote_ratio": 0.81,
      "text": "Hello everyone 🙋‍♂️\n\nIn addition to my studies, I am planning to set up my own business and am therefore looking for an existing entrepreneur who is convinced of their product and would like to establish it on the German market, but currently does not have the necessary size or capital.\n\nMy approach is to purchase larger quantities of the product on a monthly basis. This could be particularly attractive for young entrepreneurs, as it would generate reliable, predictable monthly sales.\n\nThis way, both sides can benefit: the entrepreneur gains a regular customer, while a new market is developed together.\n\nIf you are interested, please get in touch so that we can assess whether a collaboration would be feasible.",
      "is_original_content": false,
      "link_flair_text": "Business Partner Sought - Business has NOT been established",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1qcukx4/looking_for_a_business_partner/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "nzmrxn7",
          "author": "Cervus-non-Servus",
          "text": "I would be interested in a partnership !\n[The SPOT clothing]\n(http://www.thespotnews.space/preorders)",
          "score": 1,
          "created_utc": "2026-01-14 23:19:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzr4i8a",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-15 16:31:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzrjevr",
              "author": "DutyArtistic",
              "text": "Hi,\nI don't have much to do with the topic, but I'm open to anything.",
              "score": 1,
              "created_utc": "2026-01-15 17:38:32",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzyl3sw",
          "author": "Ornery-Jackfruit7206",
          "text": "Hie , pleasure to meet you . What kind of business are you looking for exactly . Do you want product based business , or something digital and internet , fintech or SaaS perhaps.",
          "score": 1,
          "created_utc": "2026-01-16 17:54:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o01dtwu",
          "author": "Original_Fig_66",
          "text": "Interesting Dm",
          "score": 1,
          "created_utc": "2026-01-17 02:30:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0307fs",
          "author": "Fit-Builder1835",
          "text": "Hi what kind of business are we talking about here .",
          "score": 1,
          "created_utc": "2026-01-17 10:16:10",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qfz6s1",
      "title": "Mobile Pop-Up pet photo van",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1qfz6s1/mobile_popup_pet_photo_van/",
      "author": "aw625",
      "created_utc": "2026-01-18 04:45:38",
      "score": 6,
      "num_comments": 1,
      "upvote_ratio": 0.88,
      "text": "  Mobile pop-up pet photo van that opens in the back to different backdrops. Different photo pet packages either just your pet or the whole family. Pet props and outfits. Either print there or I will have different products to choose from to have the picture put on. All digitals are sent to the owner for whatever they would like to do with them. \nAudience \nAnywhere pets are allowed\nTeam up with shelters and non profits \nI come to dogs that don’t travel \nEnd of life portrait - I come to you \nDog parks \nCommunity events with dogs. \n\nDo you think this could be something? \n",
      "is_original_content": false,
      "link_flair_text": "Idea Feedback",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1qfz6s1/mobile_popup_pet_photo_van/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o08t4lz",
          "author": "ChestChance6126",
          "text": "It could be, but the idea itself isn’t the hard part, validation and logistics are.\n\nBefore investing, test demand cheaply: run a single pop-up at a dog park or community event, partner with a shelter for one weekend, and pre-sell a few slots to see if people actually pay\n\nThe questions that decide this aren’t “is it cute?”, they’re “will people book ahead?” and “does one event cover your time, travel, and setup?” If you can get paid bookings with a simple test, then it’s something.",
          "score": 3,
          "created_utc": "2026-01-18 05:35:42",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qcuhvm",
      "title": "How can I create virtual tours with an existing builders floorplan to add new services to my business?",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1qcuhvm/how_can_i_create_virtual_tours_with_an_existing/",
      "author": "revoltinglemur",
      "created_utc": "2026-01-14 18:05:27",
      "score": 5,
      "num_comments": 1,
      "upvote_ratio": 1.0,
      "text": "Im looking to add a service to my marketing agency, that takes builders floorplans and create a virtual tour with staging, for marketing purposes and selling, and im wondering if anyone does this or knows someone who can make them and if they are a decent service model to add on?\n\nLooking to really expand my agency with services, but hoping maybe someone here has experience with this to talk too.",
      "is_original_content": false,
      "link_flair_text": "No applicable flair exists for my post",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1qcuhvm/how_can_i_create_virtual_tours_with_an_existing/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "nzpdhg3",
          "author": "dhemantech",
          "text": "Primitive way is a stable 360° camera walkthrough.",
          "score": 1,
          "created_utc": "2026-01-15 10:15:30",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qd6vtj",
      "title": "Inspiration required (HNW area resident)",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1qd6vtj/inspiration_required_hnw_area_resident/",
      "author": "PeartreeProd",
      "created_utc": "2026-01-15 02:11:24",
      "score": 3,
      "num_comments": 3,
      "upvote_ratio": 1.0,
      "text": "Hi all, \n\nThe title. \n\nBy a stroke of good fortune I (42m) have ended up living in one of the wealthiest suburbs in the US. We’re based 45mins north of NYC. \n\nOur overheads are minimal so I’m fortunate enough to have a solid platform from which to launch a business. \n\nMy professional background is making TV shows. I’m a Director of Photography (camera guy). My wife is a Producer/Director. I own a bunch of camera kit that’s all been paid off. Zero debt.\n\nAs well as making TV shows, my wife and I run a small production agency making corporate videos. I’ve also started a photography business doing family photography in my local area.\n\nI’d like to start another business to supplement the aforementioned revenue streams. It doesn’t necessarily have to be connected to TV/Production. \n\nGiven I live in a recession proof high net worth area (My neighbours are Wall Street millionaires, the country club class) what type of business would you start? \n\nIn terms of local networks, my FIL is a well established local architect so maybe there’s a route there? \n\nOpen to any suggestions and inspiration. \n\nTIA.",
      "is_original_content": false,
      "link_flair_text": "What business do I start?",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1qd6vtj/inspiration_required_hnw_area_resident/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "nznmxjd",
          "author": "AutoModerator",
          "text": "This subreddit sees a lot of posts by users asking the question 'What business do I start?' and many of them seem to be new to Reddit, so while they think that their post is unique, it almost always is not.\n\nWe welcome your post, and we hope to help you discover a business that is the right fit, but **help us help you** by ensuring that you have provided enough information about yourself, such as:\n\n  - Interests\n  - Available capital\n  - Skills & experience\n  - Business style (B2B, brick & mortar, online, etc.)\n  - Industry/market\n  - Location (state/country), if relevant\n  - Commitment (full-time, part-time, side-gig)\n  - Preferred role (physical work, sales, e-commerce, etc.)\n\nWhile answers to **all of** these are not mandatory, your post will be reviewed by a moderator. If they decide that your post does not contain enough information, it may be removed.\n\n**Community Members**\n\nIf, in your opinion, this post does not contain sufficient information, kindly click this [link](https://www.reddit.com/message/compose/?to=/r/Business_Ideas&subject=Reporting%20Non-compliant%20Post&message=/r/Business_Ideas/comments/1qd6vtj/inspiration_required_hnw_area_resident/) to report it, and the moderation team will investigate.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Business_Ideas) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-15 02:11:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzq5x4h",
          "author": "iwonderthesethings",
          "text": "My sister was going to do a business for people wanting to record their older relatives lives as a time capsule type of thing. We never ask our elders about their lives so it would be nice to have that kind of documentary type of thing as a keepsake. I wish we did that with my mum. Getting someone in with a list of questions to ask about their lives makes it easier for them to talk about too, I imagine. I loved the idea but she never got around to doing it.",
          "score": 1,
          "created_utc": "2026-01-15 13:44:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzq8l9h",
              "author": "PeartreeProd",
              "text": "I was just brainstorming this idea. It’s a great suggestion.",
              "score": 1,
              "created_utc": "2026-01-15 13:58:28",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qc341w",
      "title": "DoorDash delivery but it’s my own delivery strictly for In N Out",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1qc341w/doordash_delivery_but_its_my_own_delivery/",
      "author": "Lopsided_Act_1647",
      "created_utc": "2026-01-13 20:57:08",
      "score": 3,
      "num_comments": 5,
      "upvote_ratio": 0.64,
      "text": "I’ll wait for your in n out and pick it up like a regular DoorDash. I’m from the east coast and have only had in n out once (not even that good) but you can’t get it on DoorDash. I will use a website to have people bid every hour and the 2 highest bidders will get their food picked up. It will start at $15 minimum. Scottsdale, Arizona/Phoenix metro so these people have bread and I’m sure wouldn’t mind not having to wait an hour or 2 for their in n out. Can be however many items they want because that probably means more people will be putting money towards a single bid. I expect to have to wait long times that’s the whole point. Also not sure how long it would take to get the licenses and everything but would be banging if I could do it by next month when 15 MLB teams come to spring training \n\nNo refunds. No saying “oh I didn’t get my food waaaaa” I’m gonna record everything possibly with meta glasses. I will quadruple check that everything is there and I’m sure these people aren’t looking to say they didn’t get their food anyway since they aren’t section 8 ",
      "is_original_content": false,
      "link_flair_text": "Idea Feedback",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1qc341w/doordash_delivery_but_its_my_own_delivery/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "nzfzu59",
          "author": "peterwhitefanclub",
          "text": "I hope you love waiting in lines.",
          "score": 2,
          "created_utc": "2026-01-13 23:28:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzf9zxm",
          "author": "HappyGhost13",
          "text": "In N Out will sue you eventually as they are anti-delivery. Plus who wants cold burger 2 hours later?",
          "score": 1,
          "created_utc": "2026-01-13 21:22:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzl710v",
          "author": "savagetank122",
          "text": "I don’t think you’ll make enough money to justify the amount of time this will take",
          "score": 1,
          "created_utc": "2026-01-14 18:55:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o02ffqg",
          "author": "NinerChuck",
          "text": "In-n-out food doesn’t travel well. You kind of need to eat it right away. Customers may not like what they are receiving. Plus in-n-out may have an issue with you too.",
          "score": 1,
          "created_utc": "2026-01-17 07:02:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o035fjr",
          "author": "joeBlow69420",
          "text": "Fuck yea",
          "score": 1,
          "created_utc": "2026-01-17 11:04:36",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qg3v9d",
      "title": "Daycare and boarding for birds",
      "subreddit": "Business_Ideas",
      "url": "https://i.redd.it/5s6iup4vp2eg1.jpeg",
      "author": "HalfwaydonewithEarth",
      "created_utc": "2026-01-18 09:05:45",
      "score": 3,
      "num_comments": 5,
      "upvote_ratio": 0.72,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "A How-To Guide that no one asked for",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1qg3v9d/daycare_and_boarding_for_birds/",
      "domain": "i.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "o0ax1av",
          "author": "hobbythyme",
          "text": "As a bird owner, I would have some Reservations with bringing my bird to socialize with others, especially with the amount of bird flu cases",
          "score": 4,
          "created_utc": "2026-01-18 15:24:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0aff1d",
          "author": "Leemcardhold",
          "text": "Seems like a lot of overhead for a very niche idea and few customers.",
          "score": 3,
          "created_utc": "2026-01-18 13:47:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0asf0y",
          "author": "003E003",
          "text": "So flesh out the business plan. What are the numbers? How much to build and maintain? How much can you charge? What is your capacity? How many birds a day to make money?\n\nHow do you \"recapture\" the birds when it's time to go home? What happens when you lose a bird or one dies at your place? Do some birds attack each other? Can birds carry diseases that can infect other birds? How do you control for these things?",
          "score": 2,
          "created_utc": "2026-01-18 15:00:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0bgg1l",
          "author": "Solid_Mongoose_3269",
          "text": "Sounds like a huge liability",
          "score": 2,
          "created_utc": "2026-01-18 16:57:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0erujq",
          "author": "Dicktater1969",
          "text": "Birds can be very territorial.  It is instinctual for them to attack and drive other birds out of their perceived area.  I for one would not put my bird in an aviary with other birds.",
          "score": 1,
          "created_utc": "2026-01-19 02:58:21",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qek0rf",
      "title": "How to promote my business without having to pay an arm and a leg for advertising",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1qek0rf/how_to_promote_my_business_without_having_to_pay/",
      "author": "Helpful-Ad9654",
      "created_utc": "2026-01-16 16:06:41",
      "score": 3,
      "num_comments": 16,
      "upvote_ratio": 1.0,
      "text": "Im wondering how to promote my business without having to pay a ton for advertising online. I just recently started a pet waste removal/dog walking business but dont want to spend a ton for advertising if it was just gonna end up failing ",
      "is_original_content": false,
      "link_flair_text": "Marketing / Operational / Financial / Regularotry Advice sought",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1qek0rf/how_to_promote_my_business_without_having_to_pay/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "nzy5ggt",
          "author": "ogold45",
          "text": "Door hangers, bandit signs, post on Nextdoor, FB, Craigslist, social media posts. Offer people free services if they’ll allow you to film, use it for content.",
          "score": 1,
          "created_utc": "2026-01-16 16:44:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzzzbhe",
          "author": "samdreamsingreen",
          "text": "Facebook groups are an underrated resource for finding potential clients. Usually there's neighbourhood Facebook groups where people are quite active so just be genuine and tell people your services there. Maybe offer a free trial to get some engagement but these are communities you want to be part of.",
          "score": 1,
          "created_utc": "2026-01-16 21:44:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o00c4gw",
          "author": "If_it_repeats",
          "text": "On foot - it's you're best bet. Will cost you some wear and tare on those arms and legs though (bad joke!). But seriously door knocking is best. Online FB groups and Nextdoor.com. Where are you sending people to though? Putting some written text and a generic pic won't cut through. Give them a landing place to go to to check out your services and productize these the best you can i.e. Weekly Poop Scoop $XX and rate per yard size even or amount of animals etc.",
          "score": 1,
          "created_utc": "2026-01-16 22:47:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o01gxm6",
          "author": "Embarrassed_Key_4539",
          "text": "See if existing clients will allow you to put a small lawn sign for a discount on services",
          "score": 1,
          "created_utc": "2026-01-17 02:49:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o01l5y2",
          "author": "Temporary_Couple_241",
          "text": "If you don’t want to spend money for advertising, then you,are bound to fail.",
          "score": 1,
          "created_utc": "2026-01-17 03:16:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0gq767",
              "author": "PhillyTBfan14",
              "text": "If you're throwing money at something rather than gauging interest, you risk going broke and failing",
              "score": 1,
              "created_utc": "2026-01-19 12:18:14",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o021l3c",
          "author": "yarseee",
          "text": "I have a hair salon and my friend sent me this guide that improved my bookings from google by helping me get into the top 3 ranks when searching for my hair salon in my area. Happy to share!",
          "score": 1,
          "created_utc": "2026-01-17 05:09:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o033hsx",
          "author": "Impressive-Shock-743",
          "text": "Social media is you #1 way to promote your business for free.\n\nYard signs \n\nNetworking - go to events\n\nShow your face in your advertising. Be confident.",
          "score": 1,
          "created_utc": "2026-01-17 10:46:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0390j2",
          "author": "ghostinthecage",
          "text": "Get some cheap flyers / postcards / rack cards printed and go drop them off. At apartment buildings, businesses, and put them in mailboxes. This will get you going. For online, you just need Facebook. Setup a business page. Put an offer of the first 'walk' free. join local groups like neighbourhood watch groups, local associations, etc.  Even those that don't allow 'advertising' and post update and community info with your active profile as your business page. Good luck!",
          "score": 1,
          "created_utc": "2026-01-17 11:37:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o055pa7",
          "author": "Choice_Acanthaceae85",
          "text": "Do seo",
          "score": 1,
          "created_utc": "2026-01-17 17:57:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o06o8dc",
          "author": "vmco",
          "text": "You have a local business that requires talking to people in your local area - why would you need to advertise online? Start at your local pet store, dog groomers, vet clinics.",
          "score": 1,
          "created_utc": "2026-01-17 22:23:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0fjoft",
          "author": "insidiouskermit",
          "text": "try local facebook groups and nextdoor for free, just post about your services when people ask for pet help. i did something similar for my side gig and got my first clients that way. also, you can look into automated tools like beno one to find relevant discussions and engage organically without spending much.",
          "score": 1,
          "created_utc": "2026-01-19 06:02:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0gpxf3",
          "author": "PhillyTBfan14",
          "text": "Posts in your local sub Reddit, create some flyers, print them at at your local library (mine allows 30 free pages a day) and pass them out in neighborhoods you'd like to target. \n\nI think Facebook groups is probably best",
          "score": 1,
          "created_utc": "2026-01-19 12:16:09",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qfoit2",
      "title": "Agri business Idea",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1qfoit2/agri_business_idea/",
      "author": "Enock_kisamiyo",
      "created_utc": "2026-01-17 20:53:02",
      "score": 2,
      "num_comments": 2,
      "upvote_ratio": 0.63,
      "text": "Happy new year friends.\nI am thinking about direct involving in agri business. Since i have enough bare virgin lands in east africa, i am thinking of looking of an investment partner to invest in agri business. I have done research and found that;  dragon fruits,  apples and macadamia nuts are the current most profitable agri products in the world. Now i have enough land suitable for either of these crops but i dont have capital to run the production. \nI am appealing to you, looking for someone who is interested in that business so that we can join into partnership. DM if you need more details.\n We can join hands to make that profitable business. Thank you",
      "is_original_content": false,
      "link_flair_text": "What business do I start?",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1qfoit2/agri_business_idea/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o0666hm",
          "author": "AutoModerator",
          "text": "This subreddit sees a lot of posts by users asking the question 'What business do I start?' and many of them seem to be new to Reddit, so while they think that their post is unique, it almost always is not.\n\nWe welcome your post, and we hope to help you discover a business that is the right fit, but **help us help you** by ensuring that you have provided enough information about yourself, such as:\n\n  - Interests\n  - Available capital\n  - Skills & experience\n  - Business style (B2B, brick & mortar, online, etc.)\n  - Industry/market\n  - Location (state/country), if relevant\n  - Commitment (full-time, part-time, side-gig)\n  - Preferred role (physical work, sales, e-commerce, etc.)\n\nWhile answers to **all of** these are not mandatory, your post will be reviewed by a moderator. If they decide that your post does not contain enough information, it may be removed.\n\n**Community Members**\n\nIf, in your opinion, this post does not contain sufficient information, kindly click this [link](https://www.reddit.com/message/compose/?to=/r/Business_Ideas&subject=Reporting%20Non-compliant%20Post&message=/r/Business_Ideas/comments/1qfoit2/agri_business_idea/) to report it, and the moderation team will investigate.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Business_Ideas) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-17 20:53:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o096umd",
          "author": "DolceVitaa01",
          "text": "Dm me",
          "score": 1,
          "created_utc": "2026-01-18 07:30:27",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}