{
  "metadata": {
    "last_updated": "2025-12-31 08:39:59",
    "time_filter": "week",
    "subreddit": "Business_Ideas",
    "total_items": 12,
    "total_comments": 134,
    "file_size_bytes": 117151
  },
  "items": [
    {
      "id": "1pubyy1",
      "title": "Thinking about converting a decommissioned fire truck into a mobile beer & wine bar – looking for real-world feedback",
      "subreddit": "Business_Ideas",
      "url": "https://i.redd.it/byp5orkva29g1.jpeg",
      "author": "LoverofCloudyDays",
      "created_utc": "2025-12-24 02:20:56",
      "score": 161,
      "num_comments": 156,
      "upvote_ratio": 0.93,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Idea Feedback",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1pubyy1/thinking_about_converting_a_decommissioned_fire/",
      "domain": "i.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "nvonfww",
          "author": "Nuclear_Battery",
          "text": "Wine one one what's your emergency?",
          "score": 14,
          "created_utc": "2025-12-24 07:43:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvnsxns",
          "author": "milleratlanta",
          "text": "No. Too big, too hard to drive, too much expensive retrofitting. Get a panel or box truck.",
          "score": 9,
          "created_utc": "2025-12-24 03:40:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvo4hgc",
              "author": "KennyBlankeenship",
              "text": "Not too big. Not too hard to drive. But it will be insanely expensive to build out.",
              "score": 4,
              "created_utc": "2025-12-24 05:00:51",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nvnlvoi",
          "author": "Packeselt",
          "text": "I like it. Instead of a happy hour, you can have fire sales.",
          "score": 8,
          "created_utc": "2025-12-24 02:55:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvnm312",
          "author": "Ill_Football9443",
          "text": "Engine:  it has frequently been pushed hard and likely on cold starts, meaning more wear and tear than of an equivalent truck engine.\n\nIt would also spend a lot more time idling (while on site) than an equivalent engine\n\nExisting Equipment: none of it will be useful to you - suction pump? High Flow pump?  Values will be too large for your intended use so you'll either need to rip the guts out (to reduce weight) and leave the panel there for show, or remove it and it won't look like a fire truck any more.\n\nRefridgeration:  with tapped beer, how many kegs do you think you'll be able to store in the reduced storage space? How will you cool this space?  Electrically driven cooling from the engine?  Electric plug in? A combination?  1t vans that are refridgerated have a dual energy supply, so it's possible, but you're going to need to insulate the compartment.\n\nWhat will you provide as part of your service and what are your cargo constraints?  I.e. can you carry tables and chairs?  Will you add flood lights?  Glass washer?  What is the water tank capacity?",
          "score": 8,
          "created_utc": "2025-12-24 02:56:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvnrz5e",
              "author": "PapaGolfWhiskey",
              "text": "I would think that the truck sat more than it ran. Of course it depends on the city. Our firetrucks don’t move much and are well maintained",
              "score": 3,
              "created_utc": "2025-12-24 03:34:24",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nvnh0gp",
          "author": "AdditionalCheetah354",
          "text": "Maintenance and Fuel consumption will consume your profits.",
          "score": 7,
          "created_utc": "2025-12-24 02:25:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvnheww",
          "author": "Littlepastaboy",
          "text": "Only if it's gonna spray beer out the hose",
          "score": 8,
          "created_utc": "2025-12-24 02:27:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvnho0d",
              "author": "LoverofCloudyDays",
              "text": "That’s an idea lol",
              "score": 6,
              "created_utc": "2025-12-24 02:29:07",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nvnuvn5",
          "author": "coast2coast16",
          "text": "Someone else mentioned this but you should lean way more into partnering with/featuring local fire stations. Leaning more into the firetruck angle will help differentiate you- if you’re going to do it, do it 100%",
          "score": 7,
          "created_utc": "2025-12-24 03:53:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvskr9b",
          "author": "lastbeer",
          "text": "Im surprised no one has mentioned this yet, but I would strongly recommend chatting up an engineer at your local fire station. You will know within seconds if they think the idea is rad or terribly misguided. And they will give you the unvarnished good, bad, and ugly about maintaining and operating one of these and the feasibility of converting it. \n\nYou could also cross post this to a firefighter subreddit for some good intel. \n\nApart from that, I think it’s a really cool ideal. As a former corporate event producer, I would have been giddy to design an event around this truck.",
          "score": 8,
          "created_utc": "2025-12-24 23:23:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvtixmo",
              "author": "LoverofCloudyDays",
              "text": "My husband purchases fire trucks for our town and makes sure they’re operational.",
              "score": 2,
              "created_utc": "2025-12-25 03:36:24",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nvtu64j",
                  "author": "lastbeer",
                  "text": "Ha! Well in that case you’re well ahead of the game with an in-house SME!",
                  "score": 1,
                  "created_utc": "2025-12-25 05:06:21",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nvnm6fe",
          "author": "Im_a_dumptruck",
          "text": "Anything is possible, but as a person who works on them, don't. Just don't. It's not worth it.",
          "score": 12,
          "created_utc": "2025-12-24 02:57:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvug51j",
          "author": "e17phil",
          "text": "We work at corporate events in the UK.\n\nIt would work very well for brand activations and experiential events.\n\nGet in touch with agencies who do these.\n\nIt's all about the branding on the truck - a full or partial wrap will be expected.\n\nToo many people seem to be focussing on the H & S aspect. Surely it's just a question of gutting it, adding lines, coolers and kegs.",
          "score": 5,
          "created_utc": "2025-12-25 08:40:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvo8c7d",
          "author": "No-Knee-4576",
          "text": "Or hire out to kids party’s as the ultimate water fight machine",
          "score": 5,
          "created_utc": "2025-12-24 05:30:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvspl6i",
          "author": "c-5-s",
          "text": "1) Do a business plan for tow-behind red trailer with beer taps. A events x B cups of beer = C revenue - D expenses = E profit. Then ask how many more cups of beer you are going to sell because it’s a fire truck. My guess is zero additional cups of beer and therefore this idea makes no sense.",
          "score": 4,
          "created_utc": "2025-12-24 23:57:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvtjpl1",
              "author": "LoverofCloudyDays",
              "text": "You’re assuming the only variable is “cups per person.” That’s not how event businesses work. The fire truck is marketing, differentiation, and pricing power — not a magic beer multiplier. If it books more events or commands a premium, the math works. If not, it doesn’t.",
              "score": 2,
              "created_utc": "2025-12-25 03:42:31",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nvtqth9",
                  "author": "pickjohn",
                  "text": "I think for every person that is excited it's a fire truck there are two that aren't. I think you might cut out things like weddings and rigid corporate events/tradeshows.",
                  "score": 3,
                  "created_utc": "2025-12-25 04:39:03",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nvvg0og",
                  "author": "c-5-s",
                  "text": "OK so make number of events the variable in the biz plan — how many more events because it’s a fire truck and do those # of events cover the cost difference between a trailer with beer taps and a fire truck?",
                  "score": 1,
                  "created_utc": "2025-12-25 14:24:20",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nw2h0wh",
          "author": "TheSeanyB",
          "text": "You could call it emergency Wine 11",
          "score": 5,
          "created_utc": "2025-12-26 19:13:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvnl9pv",
          "author": "sneakhunter",
          "text": "Cool idea. Like someone else said I’d be most concerned about the size limiting venues and also licensing for driving the fire truck. Not that it would be hard to get the cdl yourself but would be much harder to find someone to work for you.",
          "score": 3,
          "created_utc": "2025-12-24 02:51:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvnm3g9",
          "author": "Terry-Scary",
          "text": "I would recommend gutting it and not using any of the liquid mechanism from the original truck. Unless you know the complete history of what liquids or foams were used in it there will be potential for hella contamination \n\nOver cool idea",
          "score": 3,
          "created_utc": "2025-12-24 02:56:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvoever",
          "author": "5hallowbutdeep",
          "text": "you gonna need alof of money to fuel that thing up.",
          "score": 5,
          "created_utc": "2025-12-24 06:24:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvthjkp",
              "author": "215HOTBJCK",
              "text": "Yes. They get horrible gas mileage too",
              "score": 1,
              "created_utc": "2025-12-25 03:25:28",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nvoieug",
          "author": "Terrible-Guitar-5638",
          "text": "The only way I could see this working is if you trailered it to events. \n\nBetween cvips, maintenance, insurance and fuel, I think you'd be net negative indefinitely with this thing. \n\nCool idea.",
          "score": 4,
          "created_utc": "2025-12-24 06:56:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvoj94b",
              "author": "craftedht",
              "text": "I would try a phone call with Rosenbauer. They're one of THE coach builders in the US. Very friendly folks. They may have some guidance for you considering they very likely built it.",
              "score": 2,
              "created_utc": "2025-12-24 07:03:35",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nvpnh76",
          "author": "BigPete786",
          "text": "Budget? It will attract  customers",
          "score": 4,
          "created_utc": "2025-12-24 13:12:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvt0w7g",
          "author": "AnyMiniMoo",
          "text": "So you're probably thinking solid stainless steel food grade tanks how would you mount everything you probably could use a milk system because they're in bulk and they use all stainless steel seal pipes I have a wholesaler that sells that.",
          "score": 5,
          "created_utc": "2025-12-25 01:18:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvtnfd8",
              "author": "AnyMiniMoo",
              "text": "I've been thinking about your project you would have to have some type of coolant system in there to chill your beer kegs and have a ice dispenser or some type of ice holding bin",
              "score": 2,
              "created_utc": "2025-12-25 04:11:43",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nvtnhhb",
                  "author": "AnyMiniMoo",
                  "text": "Is this a personal design project or is it something that you've never drawn blueprints on because I really like the idea",
                  "score": 3,
                  "created_utc": "2025-12-25 04:12:11",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nw18dl3",
          "author": "fvmfvm",
          "text": "Do it. \n\nDon’t let anyone tell you differently.\n\nThe people will love it. \n\nEnjoy the ride!",
          "score": 4,
          "created_utc": "2025-12-26 15:17:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "nw19gvn",
              "author": "LoverofCloudyDays",
              "text": "Thank you!!",
              "score": 1,
              "created_utc": "2025-12-26 15:23:26",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nvpmitf",
          "author": "Any-Dog-7995",
          "text": "Fire trucks are soaked in PFAS (toxic foam). It’s almost impossible to get those 'forever chemicals' out of the pumps and lines. One health inspection or liability lawsuit and your business is cooked. It’s a toxic money pit.",
          "score": 7,
          "created_utc": "2025-12-24 13:06:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvpr4ez",
              "author": "Badbullet",
              "text": "Not all departments or even all trucks used foam. This should be recorded by the fire department, as they need special hardware pump side for injecting the foam solution and aerating it, and/or special spray nozzles to effectively use foam if it is not aerated. Even then, OP should be removing the pump and lines to make room for the storage of beer, wine and properly sized food grade lines. Essentially, all for fighting equipment should be gutted. The problem OP will then run into is how is the pump to be removed receiving the power and do they need to keep the pump transmission in to still supply power to the rear axle, or is it just a simple PTO off of the engine transmission.",
              "score": 7,
              "created_utc": "2025-12-24 13:36:42",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nvpq18s",
              "author": "Heineken008",
              "text": "That's a very good point however I think you would have to completely gut the firetruck anyway. Pipes and pumps for delivering high-pressure water are not going to be very useful for serving wine and beer.",
              "score": 4,
              "created_utc": "2025-12-24 13:29:37",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nvq7zw3",
                  "author": "BudLightYear77",
                  "text": "Unless you want to serve to 100+ people simultaneously across the road",
                  "score": 3,
                  "created_utc": "2025-12-24 15:17:23",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nvqn127",
              "author": "LoverofCloudyDays",
              "text": "we would be removing the water tank",
              "score": 1,
              "created_utc": "2025-12-24 16:37:48",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nvrr9xr",
                  "author": "SkullRunner",
                  "text": "I don’t think you understand their comment. The entire vehicle has been soaked and maintained in chemicals and toxins that would never be properly removed even with intense cleaning.\n\nPS your idea is a licensing and liability nightmare that with choke you in regulation and bylaws you will need to be up on in each location you move to and that’s all after you pay to retrofit a vehicle that will put you in the poor house in fuel and maintenance.",
                  "score": 3,
                  "created_utc": "2025-12-24 20:19:47",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nvr298q",
              "author": "ChrisinCB",
              "text": "The foam we use at our dept is basically liquid soap.",
              "score": 1,
              "created_utc": "2025-12-24 18:00:25",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nvrgj7k",
          "author": "clg653",
          "text": "If you’re serious & expect to turn this into a biz and not just a fun side project, I know there are typically state regulations & permits regarding hauling liquids of any kind as well as dispensing/selling alcohol. I would have a friendly “how could this idea work?” exploratory convo with folks at the relevant agency, ideally though a connection to a higher up person.",
          "score": 3,
          "created_utc": "2025-12-24 19:17:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvwbc7p",
          "author": "secondchance35",
          "text": "Guy where I live converted an ambulance into an emergency pizza service. Just do it what’s the worst thing that can happen? You do it happily and it fails or you don’t do it and never know",
          "score": 3,
          "created_utc": "2025-12-25 17:40:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvxkpdo",
              "author": "LoverofCloudyDays",
              "text": "exactly. i’ll always wonder.",
              "score": 2,
              "created_utc": "2025-12-25 22:12:02",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nvxqt1u",
                  "author": "Te_Quiero_Puta",
                  "text": "Never know till you try something no one has",
                  "score": 1,
                  "created_utc": "2025-12-25 22:50:27",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nvxjnzc",
          "author": "redwolf1430",
          "text": "Make this into a mobile hot tub and sauna / BBQ firetruck. Serving up The Hottest BBQ and HOT relaxation. \n\nStart with converting it into a BBQ gas and or wood fired. COMING IN HOT! WITH FRESH BBQ.    \nAdd on Hot tub and Sauna. ;-)\n\nThe truck alone is a novelty that people would love.",
          "score": 3,
          "created_utc": "2025-12-25 22:05:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvytlj9",
          "author": "Bulky_Taste_9215",
          "text": "To be honest, I didn't read any of this other than the title. Just came in to say I that if this showed up to a catering event and I could get my beer filled from a FUCKING FIRE HOSE.. \nI would like that very much.",
          "score": 3,
          "created_utc": "2025-12-26 03:07:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw15x42",
          "author": "okghetto",
          "text": "The real question is how much do people want to pay to get their beer from a fire truck as opposed to a trailer.  Acquisition costs, upfit costs, maintenance seem like a major deterrent.  You’d have to be adding $2 a beer to keep margins.  Craft beer is dying and macros won’t give you the wiggle room to price appropriately.  Imagine this parked next to a competitor serving out of a trailer or tent but they have an attractive blonde in a cowboy hat and short shorts.  Id bet a pretty smile neutralizes your truck in a hurry. Sure a lot of 3 year olds will smile while\nDad waits for your beer,… now if you want to talk about ice cream and justifying a $12 sundae out of a fire truck I’m interested.",
          "score": 3,
          "created_utc": "2025-12-26 15:02:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw3z2ss",
          "author": "Personal-Lock9623",
          "text": "Great idea you can fill the water tank with wine.",
          "score": 3,
          "created_utc": "2025-12-27 00:17:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw4894s",
          "author": "Honest_Response9157",
          "text": "Saw a converted pizza fire truck the other day. If possible to do both pizza and bar would be banging",
          "score": 3,
          "created_utc": "2025-12-27 01:13:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw7n1k1",
          "author": "Technically_Y3S",
          "text": "Seriously though, that’s a clean ass used fire truck.",
          "score": 3,
          "created_utc": "2025-12-27 16:30:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "nw8q7kk",
              "author": "LoverofCloudyDays",
              "text": "agreed.",
              "score": 1,
              "created_utc": "2025-12-27 19:49:48",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nw7u0nc",
          "author": "OnlyRow7629",
          "text": "You need to change iut the tanks. I used to build these bad boys and those tanks are not very clean. Also, the pump house is going to be a nightmare. The amount of valves, hoses and tubing you're going to replace. Its already expensive but now you HAVE to have food grade in order to dispense any alcohol from truck using whats there. My two cents. Beautiful truck though",
          "score": 3,
          "created_utc": "2025-12-27 17:05:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvno1y6",
          "author": "sjamesparsonsjr",
          "text": "Interesting idea,  here’s is my take, if you can get the fire truck for dirt cheap, I would replace the water holding tanks with brewing vessels.  Then I would do a cross country trip, hitting all micro, breweries, and fire houses.  It’s a cool branding gimmick, but I can’t see many wedding venue wanting one.  Maybe bachelor parties.",
          "score": 6,
          "created_utc": "2025-12-24 03:09:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvnkbc6",
          "author": "JimmyTheDog",
          "text": "OP you have a good start on the costs required to legally operate this business. The truck and employees part need some accurate numbers for your formula of costs.",
          "score": 2,
          "created_utc": "2025-12-24 02:45:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvqu44o",
          "author": "Russ915",
          "text": "I think it’s a cool idea… but I think the customer base isn’t very big. I could see it work well for an outdoor brewery if it was branded for them and served their beer",
          "score": 2,
          "created_utc": "2025-12-24 17:16:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvrrehb",
          "author": "AlpacaSwimTeam",
          "text": "You'll have hella good foam on all the beers!",
          "score": 2,
          "created_utc": "2025-12-24 20:20:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvs57ct",
          "author": "CaptainsYacht",
          "text": "I've had a similar idea, but converting it to a mobile grilling unit.\n\nThe problem I see is that maintenance costs would be astronomical. Fire trucks aren't cheap to fix.",
          "score": 2,
          "created_utc": "2025-12-24 21:42:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvs85wq",
          "author": "KonK23",
          "text": "Call it \"Feierwehr\" and germans will buy your whole stock within seconds",
          "score": 2,
          "created_utc": "2025-12-24 22:00:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvs9gwo",
          "author": "SafetyMan35",
          "text": "We purchased a decommissioned ambulance for our business.   It was a money pit and we had to remove all lights and sirens.  Check your local regulations.  \n\nAlso verify you don’t need a CDL to drive the truck.",
          "score": 2,
          "created_utc": "2025-12-24 22:08:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvv5u0h",
          "author": "planet_alex",
          "text": "After reading through some comments I think some of us got goo goo eyed about the truck.\n\nHere's the real deal.\n\nThis is a money pit business.\n You could make money. \nYou have to novelty price crazy high, so providing value will be your challenge. This is an expensive setup that will need to pass inspection. Marketing. Marketing. One more time, you will need to spend money on marketing. By the time this rolls into the first party the negative number will be so high its cringe worthy. You will need to blitz book. Meaning, bulk spend on the setup (truck), liquids, expenses, and marketing, and hope you book an entire season to pay some back.  The ROI plan on this is tough. \n\nAs a hobby business, if you got money to burn, go for it.  I know this isn't the advice you asked for but business-wise... unless you're adding this to an existing rental option line up, its just a cool idea.",
          "score": 2,
          "created_utc": "2025-12-25 13:06:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvvitiw",
              "author": "traker998",
              "text": "I've never been a fan of gimmick businesses. Sometimes they work for a second. Very rarely they work long time. Either way not a solid plan.",
              "score": 1,
              "created_utc": "2025-12-25 14:44:22",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nvv6ac2",
          "author": "michaelrulaz",
          "text": "This would be great if you already owned a brewery but I can’t see how you’d pull off this profitably. The prices you’d have to charge would be too high.",
          "score": 2,
          "created_utc": "2025-12-25 13:10:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvvla2q",
          "author": "squareoak",
          "text": "Your fuel costs may be quite high",
          "score": 2,
          "created_utc": "2025-12-25 15:01:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvw3tei",
          "author": "vikaschadalavada",
          "text": "It is possible, but making money out of it is a niche game unless you’re not location bound. Linus tech tips converted a fire truck into a gaming truck",
          "score": 2,
          "created_utc": "2025-12-25 16:54:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvw8pjs",
          "author": "ScagWhistle",
          "text": "Cool. I would drink beer from a hose. Don't know about wine though... 🤔",
          "score": 2,
          "created_utc": "2025-12-25 17:24:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvwpme4",
          "author": "texred355",
          "text": "There’s a couple of horse trailer mobile bars in the DFW area. Not sure how profitable they are. Near Brenham TX there’s a massive class A 18 wheeler bbq cooker that seemingly stays parked. The fire truck bar could have some good marketing around it. Give it a “shot”.",
          "score": 2,
          "created_utc": "2025-12-25 19:02:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvxk7yh",
              "author": "LoverofCloudyDays",
              "text": "thanks!",
              "score": 2,
              "created_utc": "2025-12-25 22:09:02",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nvza14q",
          "author": "R3XX1J",
          "text": "That is a GREAT idea!",
          "score": 2,
          "created_utc": "2025-12-26 05:08:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw090if",
          "author": "hhazinga",
          "text": "Linus? Is that you?",
          "score": 2,
          "created_utc": "2025-12-26 10:48:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw0uits",
          "author": "yunus89115",
          "text": "Ladder 419 out of Toledo Ohio and I believe there’s also a ladder 410 in Baltimore.\n\nYou should reach out to these guys to either collaborate or try to get lessons learned.\n\nhttps://www.brewingindustryguide.com/thirst-responders-the-convivial-business-of-draft-beer-on-wheels",
          "score": 2,
          "created_utc": "2025-12-26 13:50:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "nw0yq5n",
              "author": "LoverofCloudyDays",
              "text": "wow, thank you for your help!",
              "score": 1,
              "created_utc": "2025-12-26 14:18:12",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nw2ex8b",
          "author": "swing-it-andy",
          "text": "They have a prosecco bar similar to this. Gotta think you’d struggle to rent something this large out on a consistent basis. That’s a LARGE bar.",
          "score": 2,
          "created_utc": "2025-12-26 19:02:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw4kq1n",
          "author": "indyarchyguy",
          "text": "Company here in Indy did this. They take it to Colts games and professional events for marketing. I want to buy one.",
          "score": 2,
          "created_utc": "2025-12-27 02:33:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw60yo5",
          "author": "JumpySense8108",
          "text": "firehose beer nozzle or nothing",
          "score": 2,
          "created_utc": "2025-12-27 09:36:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw7uaj4",
          "author": "GoingCoastal76",
          "text": "My buddy just converted one into a power washing monster.  He is a diesel mechanic, so he's able to do the conversion work himself.",
          "score": 2,
          "created_utc": "2025-12-27 17:07:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw8tesl",
          "author": "Temporary_Couple_241",
          "text": "Everyone is fixated on the physical aspect. My question is how far do you want to travel from your base?  Say 50 mile radius. What is the number of events possible that you could fit into in the circle?  Cut that by half because you will never get to 100%.   \n\nHow will you sell yourself to these events?  How much revenue do you anticipate from these events?  \nAgain cut those numbers by 50%.   Now subtract your and employees labor costs and taxes.  Subtract your food costs. \n\nThat is how much revenue you can expect. Can you make a living with that amount of income?",
          "score": 2,
          "created_utc": "2025-12-27 20:06:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw8uits",
          "author": "Chasing_Sunsets26",
          "text": "Fill the tank with 500 gallons of beer… and unload the deck gun",
          "score": 2,
          "created_utc": "2025-12-27 20:12:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwfmxo2",
              "author": "curtinbrian",
              "text": "Hit it hard from the yard",
              "score": 1,
              "created_utc": "2025-12-28 21:39:20",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nw9bnqn",
          "author": "Particular_Egg9739",
          "text": "that engine will be broken down every other time you try and drive it anywhere. fire apparatus are very high maintenance",
          "score": 2,
          "created_utc": "2025-12-27 21:46:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwb2ney",
              "author": "Cully33",
              "text": "Can confirm. Was a FF for 10 years. This will cost a small fortune to maintain and keep road worthy.",
              "score": 2,
              "created_utc": "2025-12-28 03:48:41",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nw9d1qn",
              "author": "LoverofCloudyDays",
              "text": "looks pretty clean",
              "score": 1,
              "created_utc": "2025-12-27 21:53:29",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nw9qv8a",
                  "author": "Particular_Egg9739",
                  "text": "yea because departments clean and wash them almost daily. just make sure you understand the maintenance that can be involved.",
                  "score": 2,
                  "created_utc": "2025-12-27 23:08:59",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nwcp5uh",
                  "author": "Mr_Bluebird_VA",
                  "text": "That’s a wildly dismissive response to a very valid concern.\n\nI understand that day dream part of planning a business where it seems perfect and nothing can go wrong.\n\nBut please get your head out of the clouds before committing to something like this.\n\nEngine maintenance and down time alone could be enough to sink this business quickly if you don’t plan for it.",
                  "score": 1,
                  "created_utc": "2025-12-28 12:12:24",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwa5mq6",
          "author": "BostonJon86",
          "text": "The answer is yes.  Make the fire hose the tap. Serve up some PSI!",
          "score": 2,
          "created_utc": "2025-12-28 00:32:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwbbic7",
          "author": "Clean-Helicopter-649",
          "text": "Angry cops already did it….",
          "score": 2,
          "created_utc": "2025-12-28 04:47:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwqmsss",
              "author": "LoverofCloudyDays",
              "text": "lol we’re not angry cops",
              "score": 1,
              "created_utc": "2025-12-30 15:00:42",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwbcww7",
          "author": "lettuce-pray55",
          "text": "If they randomly drive by it means they don't have hose.",
          "score": 2,
          "created_utc": "2025-12-28 04:57:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwcpzco",
          "author": "Quadling",
          "text": "Ok so let’s bring it all together. Put a canopy tent or two in the hose bay. Install some bubble machines on top (possibly also in the hose bay) for massive visual presence. Install a pizza oven for food, a refrigerated box for kegs and keeping foodstuffs and wine cold. \n\nIs it worth it? \n\nYou’ve got to do the math on that. My suspicion is that it’s only going to be worth it if you are already heavily connected into the local events space. \n\nGood luck!",
          "score": 2,
          "created_utc": "2025-12-28 12:19:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwdajs5",
          "author": "CatchFront3092",
          "text": "My company bought one for $6000 and we converted into a tailgate FIREBALL truck. It is a showstopper that everyone loves. Most municipalities keep up with the maintenance and so forth. You do need a CDL to drive it though.",
          "score": 2,
          "created_utc": "2025-12-28 14:41:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwqlwly",
              "author": "LoverofCloudyDays",
              "text": "found one for $4000 and are on the process of obtaining it",
              "score": 1,
              "created_utc": "2025-12-30 14:56:02",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwdq33b",
          "author": "Jarhead-DevilDawg",
          "text": "I know someone turned it into a mobile pizza food truck in Wisconsin I believe",
          "score": 2,
          "created_utc": "2025-12-28 16:05:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nweetqj",
          "author": "cloudguy-412",
          "text": "You probably need a CDL to drive that.  That may really complicate things.\n\nWhy not offer liquor?  Seems like you’re arbitrarily limiting yourself.",
          "score": 2,
          "created_utc": "2025-12-28 18:08:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwese1s",
              "author": "Numes1",
              "text": "CDL isn't the end of the world to acquire but if C02 is going to be used in addition to transporting controlled substances(alcohol) will require additional certifications and requirements.",
              "score": 1,
              "created_utc": "2025-12-28 19:10:51",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nwet5f6",
                  "author": "cloudguy-412",
                  "text": "That’s kinda what I was thinking.\nThe CDL limits who can drive this.  Idk if there are odd ball restrictions on a CDL driver also being a mobile bartender and transporting open beverages.  If there are you would need to pay someone to just drive the truck, and then pay them to stand around during the event.   That would certainly add operational costs.",
                  "score": 1,
                  "created_utc": "2025-12-28 19:14:25",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nvo57jk",
          "author": "random99909",
          "text": "What kind of events do you think a mobile fire truck would be best for? Unless it’s a wedding for someone who is a fireman, I don’t see alot of opportunity.\n\nThat said, converting it into a food truck (that perhaps could also sell beer) seems like it would have more options. Or maybe convert it into something that would serve food and ice cream for kids birthdays. You’d probably be booked every weekend for little boys birthday parties.",
          "score": 4,
          "created_utc": "2025-12-24 05:06:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvogsuf",
              "author": "-the7shooter",
              "text": "Parades, sporting events, Christmas bullshit.",
              "score": 2,
              "created_utc": "2025-12-24 06:41:41",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nvngzv0",
          "author": "Away-Flight3161",
          "text": "Only thought is that the size of the truck would limit the venues that could host you. ",
          "score": 3,
          "created_utc": "2025-12-24 02:24:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvo8xji",
          "author": "Sea-North7215",
          "text": "Sounds fun! Just plan for costs, permits, and truck headaches.",
          "score": 2,
          "created_utc": "2025-12-24 05:35:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvp5qoj",
          "author": "Moloko2rufus",
          "text": "The idea is superb, however market research and meeting events organizers can work in your favor and ensures that your investment pays off. It's important to have guaranteed returns atleast 20% of your initial investments.\nOtherwise is worth trying",
          "score": 2,
          "created_utc": "2025-12-24 10:42:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvs3yan",
          "author": "rocknroll2013",
          "text": "This is probably the best idea I have ever heard in my life, and I am chock full of good ideas",
          "score": 2,
          "created_utc": "2025-12-24 21:35:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvscag9",
              "author": "LoverofCloudyDays",
              "text": "Well, thank you!",
              "score": 1,
              "created_utc": "2025-12-24 22:26:50",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nvtckgb",
                  "author": "Doc12TU",
                  "text": "I think that’s a ChatGPT response, so don’t get too excited.",
                  "score": 1,
                  "created_utc": "2025-12-25 02:47:03",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nw2fzju",
          "author": "twelfthmoose",
          "text": "Honestly rent it to kid birthday parties. Bubbles. My two year old is obsessed with fire trucks",
          "score": 2,
          "created_utc": "2025-12-26 19:08:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "nw2k18f",
              "author": "LoverofCloudyDays",
              "text": "also thinking about doing this",
              "score": 1,
              "created_utc": "2025-12-26 19:30:07",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nw34g3t",
                  "author": "twelfthmoose",
                  "text": "Could be an easier entry in terms of not requiring a “liquor” license. I would be curious if you could dispense bubbles easily!",
                  "score": 2,
                  "created_utc": "2025-12-26 21:21:53",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nw33uly",
              "author": "Kookumber",
              "text": "You named your kid bubbles ?",
              "score": 1,
              "created_utc": "2025-12-26 21:18:42",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nw346og",
                  "author": "twelfthmoose",
                  "text": "No but working on number 2 … Bubbles is now a contender for names.",
                  "score": 1,
                  "created_utc": "2025-12-26 21:20:30",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nvnkcyk",
          "author": "jjkingoftown9",
          "text": "I’m not sure why you wouldn’t.",
          "score": 1,
          "created_utc": "2025-12-24 02:45:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvnzzw3",
          "author": "jondoe09",
          "text": "They have done this in NC and one of them is even painted nfl panther colors.",
          "score": 1,
          "created_utc": "2025-12-24 04:28:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvvgu0n",
              "author": "nothingimportant2say",
              "text": "[This is pretty cool. Doesn't look like it has the beer mods for kegs and taps that OP wants though. ](http://Denver resident hosts the hottest tailgate in Charlotte - Lake Norman Publications https://share.google/Yb07zQrfWkQKNt4sC)\n\nOP is looking at a lot.of extra money in cooling equipment to keep all that beer cold.",
              "score": 1,
              "created_utc": "2025-12-25 14:30:14",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nvplngx",
          "author": "GoalRoad",
          "text": "I agree that logistically it might be a challenge/expensive.  That said, I do think using unique/retro vehicles as a photo/“art” piece at events is a good idea especially if they are functional (ie also serve as food or beverage station)",
          "score": 1,
          "created_utc": "2025-12-24 12:59:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvr5je9",
          "author": "MBe300",
          "text": "Will probably be a hit with hose at the party 😉",
          "score": 1,
          "created_utc": "2025-12-24 18:18:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvya2yn",
          "author": "[deleted]",
          "text": "[deleted]",
          "score": 1,
          "created_utc": "2025-12-26 00:53:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvyeoc2",
              "author": "LoverofCloudyDays",
              "text": "100k where did you get this number from?",
              "score": 1,
              "created_utc": "2025-12-26 01:25:01",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nvyiims",
                  "author": "Daytrade_69420",
                  "text": "How much is the truck? Then how much do you think the conversion to make it into a bar setup would be? 75-100k is appropriate. Especially after licensing fees, registration, COGS, etc. Payback period is extremely high",
                  "score": 1,
                  "created_utc": "2025-12-26 01:51:40",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nw1dn51",
          "author": "Apart_Tutor8680",
          "text": "Weddings is the money maker, how many venues within 1-2 hours of you require you to bring your own liquor or bar tenders? VS how many supply that service already? \nYou’re limited to outdoor venues only. Would need canopy incase it rains. \n\nHow many people want a fire truck at their wedding, VS something a little more classy like a horse trailer conversion that looks quite nice.",
          "score": 1,
          "created_utc": "2025-12-26 15:46:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "nw1qf28",
              "author": "LoverofCloudyDays",
              "text": "Not really thinking weddings to be honest",
              "score": 1,
              "created_utc": "2025-12-26 16:54:53",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nw29tpd",
                  "author": "rgmundo524",
                  "text": "Then what were you thinking of? I mean weddings are one of the things you listed",
                  "score": 1,
                  "created_utc": "2025-12-26 18:36:30",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nw2ggpb",
          "author": "DJinKC",
          "text": "Double check your fuel costs, and then model what happens with fluctuations in gas prices.\nAlso, a late model fire engine may require maintenance from very specifically trained (expensive) mechanics.\nI would just really look closely at your operating costs on that rig.",
          "score": 1,
          "created_utc": "2025-12-26 19:11:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "nw2jyq1",
              "author": "LoverofCloudyDays",
              "text": "my husband buys fire trucks for our town and makes sure they’re operational",
              "score": 1,
              "created_utc": "2025-12-26 19:29:45",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nw31rsa",
                  "author": "Pretty_Wind_5878",
                  "text": "What does your husband say the operating costs are per mile on a 40,000 lb Truck. It’s all well and good until washing it costs $500",
                  "score": 1,
                  "created_utc": "2025-12-26 21:07:21",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nw6isit",
          "author": "chmil16",
          "text": "Only if you have five alarm Fridays!",
          "score": 1,
          "created_utc": "2025-12-27 12:25:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw86zbe",
          "author": "Deep-Resource-737",
          "text": "I do this kind of work on vehicles, it’s a very niche market to bring a custom vehicle with custom “kit” for a business to have a mobile ad, or an engagement platform that they can tour the country with. \n\nMy first thought was “I hope they’re not planning on using the tanks from the fire engine to dispense the beer, because that would be stupid and a lot of work.”  As somebody else already pointed out, the tanks and pumps in the truck are going to be scrapped if you want to pump beer and wine through it. As in, you wont want to drink that beer and can’t sell it - so you’ll scrap the pumps. Not that the pumps will be damaged. \n\nSecond thought was “I wonder if the fire truck is even possible if you remove everything behind the cab, what a hassle”. \n\nFrom the beer truck angle, sure whatever floats your boat. From the fire truck angle, I think a school bus would be easier to retrofit and make it look nice (not like a school bus). \n\nA lot of the builds we do, we’re finding a commercial truck with no “box” on the bed, then we build a custom box. This is 90% of our work.",
          "score": 1,
          "created_utc": "2025-12-27 18:11:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "nw8q39y",
              "author": "LoverofCloudyDays",
              "text": "of course we’re not putting beer into the tanks, we’re removing all of it. It’s crazy how many people think that.",
              "score": 0,
              "created_utc": "2025-12-27 19:49:10",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nw8w2v9",
                  "author": "aynrandomness",
                  "text": "I for one would love beer to be dispensed faster.",
                  "score": 2,
                  "created_utc": "2025-12-27 20:21:20",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nw8v4ca",
                  "author": "Deep-Resource-737",
                  "text": "Yea I mean, to be fair, I don’t think that’s a *you* problem. It’s just the internet, where even beer-dispensing fire trucks show up every now and then. \n\nMy big gripe with the fire truck is that all that equipment must be freaking heavy back there. Without an overhead crane, I suspect a lot of it will need to be cut with a torch in place and tossed out the side. \n\nHave you thought about the deconstruction part of the build? Putting a shroud over things to make it look nice is the easy part. Are you thinking about doing a refrigerator? I would run a freezer box and pick up / drop off kegs as needed, and throw them into the box. I don’t know anything about building an insulated box, but I know you can find refrigeration units (like for box trucks) and fit them on just about anything. \n\nIt’s a cool idea man. Just not something I would take on at home. \n\nDefinitely something we would try to do in the big shop though. If a company paid us to, that is.",
                  "score": 1,
                  "created_utc": "2025-12-27 20:16:06",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwd5b4v",
          "author": "Conscious-Soil9055",
          "text": "I think you'll be drinking from a fire hose at first.",
          "score": 1,
          "created_utc": "2025-12-28 14:09:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwdz1ar",
          "author": "HelpUsNSaveUs",
          "text": "I’ve seen one of these somewhere, maybe in the Hudson valley NY. Actually yup, here it is https://www.fireupyourparty.com/blank-1",
          "score": 1,
          "created_utc": "2025-12-28 16:50:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwqls6w",
              "author": "LoverofCloudyDays",
              "text": "awesome, thank you",
              "score": 1,
              "created_utc": "2025-12-30 14:55:23",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwe4jcw",
          "author": "spenserbot",
          "text": "are you planning on having beer on tap or just using coolers and serving cans/bottles? I dont know the lay out of the truck but the first thing you need to consider is where kegs and refrigeration would go. This will be heavily dependent on the layout of the truck. The longer the lines the more complicated it gets. \n\n  \nI am a fireman with 10 years professional brewing expierence and this jumps off the page as a \"dont do it\".  Fire trucks are known pain in the asses and expensive to repair. Thats why they sell relatively cheap.  Consider an ambulance. Ive worked with 2 Am Bru Lances. The layout is already set up better for keg storage and the taps come right through the  box wall.",
          "score": 1,
          "created_utc": "2025-12-28 17:17:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwqljqy",
              "author": "LoverofCloudyDays",
              "text": "removing water tank, yes beers on tap.",
              "score": 1,
              "created_utc": "2025-12-30 14:54:10",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwf6utu",
          "author": "Logical_Resolve_179",
          "text": "cool idea But imagine replacing hoses and tanks to be expensive depending how you use it",
          "score": 1,
          "created_utc": "2025-12-28 20:20:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwql4ll",
              "author": "LoverofCloudyDays",
              "text": "removing all of that",
              "score": 1,
              "created_utc": "2025-12-30 14:51:56",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nvpcsfr",
          "author": "Driftlessfshr",
          "text": "They have this in put in bay, oh. Bet they can give you some tips.",
          "score": 1,
          "created_utc": "2025-12-24 11:48:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvsn0lt",
          "author": "brapstick",
          "text": "Can you drive a fire engine? (That's not a fire truck)\nEdit actually when I was a volunteer, you only needed a valid ID so drive so as long as you're comfortable or know someone who is, you're probably good",
          "score": 1,
          "created_utc": "2025-12-24 23:39:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvttv9l",
              "author": "TheHud85",
              "text": "He’s using it for business use, he’s 99% likely gonna need a CDL.",
              "score": 1,
              "created_utc": "2025-12-25 05:03:48",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nvxp6gb",
                  "author": "LoverofCloudyDays",
                  "text": "correct.",
                  "score": 2,
                  "created_utc": "2025-12-25 22:40:09",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nvx8aw2",
          "author": "ViewAdditional7400",
          "text": "Restaurant owner here, I'll bite because it's a cool idea. Here are the first couple problems I see.\n\n* Logistics - you're going to be limited by venues where a fire truck just isn't able to be positioned in a place that's feasible.\n* Liquor - a high percentage of events will want liquor as well and the packages other providers offer have beer and wine, so it's going to be difficult with pricing. If someone said to me \"oh, we have a fire truck coming with beer and wine, we only need liquor\", I still have to pay a bartender, so the liquor package is priced higher.\n\nI think just those two factors will make marketing and closing deals A Lot harder. And to be honest, it's hard without those factors.",
          "score": 1,
          "created_utc": "2025-12-25 20:56:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvxqo9g",
              "author": "Te_Quiero_Puta",
              "text": "The farmer's market potential is amazing though",
              "score": 2,
              "created_utc": "2025-12-25 22:49:35",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nvoq6xu",
          "author": "HumbleSpend8716",
          "text": "AI SLOP",
          "score": -5,
          "created_utc": "2025-12-24 08:09:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvqm9cn",
          "author": "Fffiction",
          "text": "The emergency services at a party or event is not a look anyone generally wants.\n\nIt's certainly something you could sink a lot of money in to but the one obvious client poses an issue. The kids parties that would think this thing is fun would also have to keep the children away from it as it serves alcohol.",
          "score": 0,
          "created_utc": "2025-12-24 16:33:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvpy8yg",
          "author": "mementosmoritn",
          "text": "If you don't have the money and skills to safely diy, to food grade standards, I'd say it's already a lost cause. That's a huge initial investment to outfit this thing to the minimum standards necessary to pass for food safety. \n\nEdited to remove the portion my stroke wrote.",
          "score": -3,
          "created_utc": "2025-12-24 14:21:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvrl70u",
              "author": "Sikkus",
              "text": "Got an aneurysm reading your comment.",
              "score": 1,
              "created_utc": "2025-12-24 19:44:28",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1pveyil",
      "title": "Anyone regret outsourcing IT instead of keeping it in-house?",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1pveyil/anyone_regret_outsourcing_it_instead_of_keeping/",
      "author": "This_Connected23",
      "created_utc": "2025-12-25 14:53:52",
      "score": 13,
      "num_comments": 29,
      "upvote_ratio": 0.86,
      "text": "We’re a small business and seriously thinking about outsourcing IT. Right now we handle everything ourselves and it’s getting exhausting.\n\nThat said, I keep wondering if anyone actually regrets switching to an MSP. Did it ever feel slower, more expensive, or harder to deal with than just having someone in-house? Curious to hear the good and the bad.\n",
      "is_original_content": false,
      "link_flair_text": "No applicable flair exists for my post",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1pveyil/anyone_regret_outsourcing_it_instead_of_keeping/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "nvvl0ge",
          "author": "Outrageous_Win_8559",
          "text": "Well outsourcing tech is one of the best things as long as you have the right senior resource to manage them.\nIt's not just about tech\nIt can work for\nMarketing \nSales\nFinance \nAnd operations\nBut please keep this in mind. You still have to keep a strong check on the resources you have outsourced your project to.",
          "score": 3,
          "created_utc": "2025-12-25 14:59:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvvl4rq",
              "author": "Outrageous_Win_8559",
              "text": "As for cost, it's cheaper and as for optimization again it depends on the resource that's managing them.",
              "score": 1,
              "created_utc": "2025-12-25 15:00:04",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nvvy7bn",
              "author": "SuspiciousMeat6696",
              "text": "Someone internally still has to manage them.  That is so important.",
              "score": 1,
              "created_utc": "2025-12-25 16:21:19",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nw148gn",
          "author": "DevOpsGuyPosh",
          "text": "We use to outsource all the development for our apps, but we found out that it was easier to keep everything in house. We could control the costs better, see better results in the workers, and everything seemed to flow better. That said, I do own a software development company and we do a lot of tech work so it would be silly for us to outsource anything tech / ops related. Much easier than dealing with some outsourced company. \n\nBut a good option might be staff augmentation. Basically you get a leased dedicated resource that does whatever you tell them. Typically you get someone who is an expert in the area you need, and they basically are an employee to you. Typically cheaper than an MSP and gives you more freedom. If You’d still need some physical presence in the office, then a traditional IT / MSP might be the move. \n\nDo you need someone there physically or can 99% of the issues be handled remotely?",
          "score": 3,
          "created_utc": "2025-12-26 14:52:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvvmr1n",
          "author": "Mommyjobs",
          "text": "I was worried about that too, but honestly no regrets ao far. The first month felt slower beacuse you're not used to opening tickets amd explaining stuff, but after that it was fine.",
          "score": 2,
          "created_utc": "2025-12-25 15:10:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvxnhcs",
              "author": "This_Connected23",
              "text": "Yeah that adjustment period is what I’m worried about.",
              "score": 1,
              "created_utc": "2025-12-25 22:29:23",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nvvpy9z",
          "author": "YormeSachi",
          "text": "We tried to keep IT in-house with one person and it was risky. When they were out, everything stalled. Outsourcing removed that single point of failure.",
          "score": 2,
          "created_utc": "2025-12-25 15:30:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvxnkqu",
              "author": "This_Connected23",
              "text": "That’s a really good point actually.",
              "score": 1,
              "created_utc": "2025-12-25 22:29:58",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nvvxoy6",
          "author": "SuspiciousMeat6696",
          "text": "Be careful.  You can't just throw it over the wall and think it'll be handled / addressed to your expectations.\n\nIt's not a set it and forget it type of process.\n\nMake sure you get SLA's in writing\n\nMake sure there are clearly defined severities.  Not every little issue is a drop everything moment.  The MSP, will be managing issues according to how you define them.\n\nIf you are an owner and used to your IT staff helping you with every little issue, MSP wont be holding your hand (unless you pay them handsomely).\n\nMSP can manage your platform and scale your platform as you scale. \n\nMake sure you periodically audit your MSP especially if you are in a regulated industry.",
          "score": 2,
          "created_utc": "2025-12-25 16:18:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvw2u4h",
          "author": "Whole_Ad_9002",
          "text": "As a solo msp owner I always advise to have someone in the org who understands IT, there is a large disconnect in expectations despite SLA's being in existence and it helps to have conversations with someone who has some technical level understanding. That said scope out your needs well and choose your IT partner carefully as we're not all built equal.",
          "score": 2,
          "created_utc": "2025-12-25 16:49:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvzjj2v",
              "author": "HelpSquadIT",
              "text": "100% agree with this. Having a clear understanding of what your needs/goals are and being able communicate those to an MSP is often the deciding factor WRT having a positive experience working with an MSP.",
              "score": 1,
              "created_utc": "2025-12-26 06:30:11",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nvziuiz",
          "author": "ChestChance6126",
          "text": "I’ve seen it go both ways. The regret usually isn’t “we outsourced,” it’s “we outsourced too early or without clear boundaries.” MSPs work best when the environment is stable, and expectations are explicit. If your setup is messy or constantly changing, ticket-based support can feel slow and surprisingly expensive.\n\nIn-house wins when you need fast context switching and someone who knows the business quirks. Outsourcing wins when you want predictable coverage and fewer interruptions. The middle ground that works well for a lot of small teams is keeping a lightweight internal owner and outsourcing the rest. That way, you keep control without carrying all the load.",
          "score": 2,
          "created_utc": "2025-12-26 06:24:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw2pkr4",
          "author": "Drumroll-PH",
          "text": "I’ve seen both sides. When I helped manage a small business, outsourcing IT was a relief at first, but it got frustrating when urgent issues felt slower and more ticket driven. It works best if you have clear SLAs and one internal person who understands the business and can push back when needed.",
          "score": 2,
          "created_utc": "2025-12-26 20:00:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw57otc",
          "author": "Ok-Wolverine-4223",
          "text": "We had a good Service Desk with about 15 FTEs on it. Outsourced and now they need a lot more to do the same work.  Language barrier is also an issue, but it depends on who is calling the desk.",
          "score": 2,
          "created_utc": "2025-12-27 05:10:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwgn9l3",
          "author": "Slight_Fan2561",
          "text": "Nope. So far it’s working out great. It’s saving us time and money. We’ve been working with contractors via Virtual Coworker. They take instruction well, quickly onboarded onto our team, and have been with us for a while now.",
          "score": 2,
          "created_utc": "2025-12-29 00:48:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvvrwjc",
          "author": "East_Channel_1494",
          "text": "Only regret I’ve seen is choosing the wrong MSP. We switched once because the first one was super reactive and slow. Second time around was way better.",
          "score": 1,
          "created_utc": "2025-12-25 15:43:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvxnnlj",
              "author": "This_Connected23",
              "text": "How did you know the second one was better?",
              "score": 1,
              "created_utc": "2025-12-25 22:30:28",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nvyc9j8",
                  "author": "East_Channel_1494",
                  "text": " They asked better questions upfront and actually documented everything. Felt more organized from day one.",
                  "score": 1,
                  "created_utc": "2025-12-26 01:08:07",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nvvstmv",
          "author": "CompetitivePop-6001",
          "text": "We get services from skytek solutions and haven’t had any regrets YET.. They don’t overcomplicate things and they’ve been around long enough to know what actually works for small businesses. Biggest plus is peace of mind. So far, everything is good..",
          "score": 1,
          "created_utc": "2025-12-25 15:48:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvxns0u",
              "author": "This_Connected23",
              "text": "Peace of mind alone might be worth it honestly. Thanks!!",
              "score": 1,
              "created_utc": "2025-12-25 22:31:15",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nvz7qal",
                  "author": "Familiar_Tip_7336",
                  "text": "I been trying to get into business as I’m in IT",
                  "score": 1,
                  "created_utc": "2025-12-26 04:50:56",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nvwiv7c",
          "author": "BusinessStrategist",
          "text": "Do you have any relationships that you regret?",
          "score": 1,
          "created_utc": "2025-12-25 18:23:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwhvh7x",
          "author": "ConsciousWonder5400",
          "text": "What kind of IT issues are eating most of your time right now? Because some stuff makes total sense to outsource (security, backups, compliance) but if it's mostly quick daily fixes an MSP can feel painfully slow compared to walking over to someone's desk",
          "score": 1,
          "created_utc": "2025-12-29 05:12:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwld98k",
          "author": "Lucky-Requirement818",
          "text": "I just shot you over a PM, we help businesses so they do NOT have to switch to an MSP and just pour money out on useless tech.",
          "score": 1,
          "created_utc": "2025-12-29 19:01:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwm03p3",
          "author": "bawireman",
          "text": "Everyone regrets outsourcing IT. If you don't yet...you will.",
          "score": 1,
          "created_utc": "2025-12-29 20:53:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvx2vde",
          "author": "Choice_Acanthaceae85",
          "text": "Outsourcing IT to the right person is the best thing you can do literally, it just gets off your plate. When you hire someone in house, you have manage that person, train them somewhat, try to fit them culturally, and there are a he'll lot of problems with that. \n\nI know a company who basically gives you hours you need per month like you need 50 hrs per month, you'll buy 50 hrs worth of dev hours from them, and you can utilize those hours. It's a game changer honestly",
          "score": 1,
          "created_utc": "2025-12-25 20:22:15",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pxnds8",
      "title": "Guys... validate my business model please",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1pxnds8/guys_validate_my_business_model_please/",
      "author": "Grozfroz",
      "created_utc": "2025-12-28 09:33:54",
      "score": 11,
      "num_comments": 28,
      "upvote_ratio": 0.92,
      "text": "I’m testing an idea and want honest feedback.\nI noticed something while watching how brands run influencer campaigns — most of the time they pick creators based on followers or vibes, not on whether their audience is actually in “buying mode.”\nSo I built a way to analyze influencer comment sections to find which creators have the highest % of people actively asking things like: “Does this work?” “Where do I buy?” “Is this good for acne?” etc.\nExample:\nTwo sunscreen creators both have 100k followers.\nOne has people saying “love this!”\nThe other has people saying “should I buy this or La Roche?”\nThose are not equal.\nThe idea is to give brands a list of creators whose audiences already want to buy, before they spend ad money.\nWould this actually be useful for a small DTC brand, or am I overthinking it?",
      "is_original_content": false,
      "link_flair_text": "Idea Feedback",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1pxnds8/guys_validate_my_business_model_please/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "nwc9jam",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2025-12-28 09:46:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwc9ova",
              "author": "Grozfroz",
              "text": "Yeah absolutely  thats what the example i mentioned in the post\n\nA Audience say love this and saying where can i buy this or is it actually better then cera ve\n\nThese two are different set of Audience and iam focusing on the other one",
              "score": 1,
              "created_utc": "2025-12-28 09:48:04",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwcnly1",
          "author": "George_Salt",
          "text": "Asking here is not validation.  But you have identified a genuine situation based on a truth that not all comments and not all audiences are equal.\n\nValidation would be turning this observation into an Influencer Score and demonstrating a statistically valid correlation between the IS and Value Add per influencer in real cash terms.  Getting the data for the statistical validation will be your most significant problem.",
          "score": 1,
          "created_utc": "2025-12-28 11:58:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwcqeeg",
          "author": "HBTechnologies",
          "text": "I like it … and I can be your customer",
          "score": 1,
          "created_utc": "2025-12-28 12:22:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwcri8b",
              "author": "Grozfroz",
              "text": "Well thats fantastic,i have dmed you lets talk",
              "score": 1,
              "created_utc": "2025-12-28 12:32:10",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwd0qiq",
          "author": "desultorySolitude",
          "text": "You are scoring the level of engagement. It would be useful where the ad does not have a measurable CTA.",
          "score": 1,
          "created_utc": "2025-12-28 13:39:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwd0zkf",
              "author": "Grozfroz",
              "text": "Thanks for the feedback,yes sort of thats what iam doing but iam not doing for just one post and comment section,i will analyze that influencer's past 10 post and each post's top 10 comments",
              "score": 1,
              "created_utc": "2025-12-28 13:41:31",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwd2j2p",
                  "author": "desultorySolitude",
                  "text": "Building on your idea, it's not just about scoring the quality of engagement, but also tossing in metrics for respondents' quality i.e., a metric on the quality of those who did choose to engage. For example, for an ad about a vacation resort, how many broke students versus moneyed people engaged with the ad by saying I-wanna-vacation-there.",
                  "score": 1,
                  "created_utc": "2025-12-28 13:51:33",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nweivgm",
          "author": "this_is_a_temp_acc_",
          "text": "As one of many features within a larger application, yeah it's all sound.  Your idea is effectively selling valuable data to marketers.",
          "score": 1,
          "created_utc": "2025-12-28 18:26:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwfc7e0",
          "author": "Intrepid_Ant_1264",
          "text": "Only way to validate is to sell it. How many real sales convos have you had?",
          "score": 1,
          "created_utc": "2025-12-28 20:46:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwff68k",
              "author": "Grozfroz",
              "text": "I have prepared a list of 100 brands to test this on\nIn my outreach,i will not spray and pray like\nIam going deep and iam going to offer this for free to see the validation",
              "score": 1,
              "created_utc": "2025-12-28 21:01:06",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwffiul",
                  "author": "Intrepid_Ant_1264",
                  "text": "Makes sense, and it’s the only way to do it. If they say yes, awesome\n\nIf no - take notes\nEnd of story",
                  "score": 1,
                  "created_utc": "2025-12-28 21:02:48",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwfpogj",
          "author": "WorldsGreatestWorst",
          "text": "Qualifying customers has a lot of value. However, you have a couple misconceptions. \n\n>most of the time they pick creators based on followers or vibes\n\nMost big brands have far more sophisticated metrics than \"vibes\". There are a million formulas & approaches used to determine who might be the best influencer for a given product. \n\nThe reason you think it's \"most\" is because the brands you hear the most are mass-market direct to consumer brands like SurfShark or Delete Me that are simply trying to carpet-bomb the market. These are mass market plays, not surgical precision plays. *They* don't need qualitative data. \n\n>So I built a way to analyze influencer comment sections to find which creators have the highest % of people actively asking things like: “Does this work?” “Where do I buy?” “Is this good for acne?”\n\nSo you built an AI agent that reviews comments. How do you validate your predictions? You tell me that the audience of Influencer X is far more likely to be ready to buy my product. How do you ever show it to be true, even in retrospect? \n\nAdditionally, why would an influencer audience's \"readiness to buy\" sunscreen mean they were more likely to buy my new sunglasses or phone accessory or tax service? Readiness to buy is product specific. If Influencer X has ads promoting a sunscreen and your software says, \"Influencer X's audience wants sunscreen!\" then what do I do with that information? They are more ready to buy *because* they have seen the ads of my competitor. It's extremely unlikely that that influencer will be contractually permitted to promote *MY* sunscreen at that point. \n\nLastly, how would this product deal with changes to social media policy or TOS. Twitter used to allow you to harvest all the data associated with public accounts. Now it doesn't. Your crawlers will be flagged quickly as your business scales. This data always has to be up to date—nobody is going to pay for weeks old data.",
          "score": 1,
          "created_utc": "2025-12-28 21:52:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwfrsav",
              "author": "Grozfroz",
              "text": "Appreciate the detailed breakdown. You raise valid points for a Series B SaaS platform targeting Fortune 500s, but that’s not what this is.On 'Sophisticated Metrics': I’m targeting mid-market DTC brands ($5M-$50M), not Nike. In my experience, these teams are lean. \n\nTheir 'sophisticated metric' is often just the Founder or one overworked marketing manager guessing what works. They don't need a million formulas; they need curated, high-intent options.\n\nOn 'Readiness to Buy': High intent on a competitor's post (e.g., asking 'Does this work for acne?') is the strongest buying signal there is. It means they are problem-aware and solution-seeking but undecided. That is exactly where a challenger brand wins.\n\nOn 'Validation': I’m not selling predictive analytics software; I’m selling an outcome. The validation is simple: I send them the influencers, they run the campaign. If ROAS is positive, the model works.\n\nOn APIs/Scale: This is internal infrastructure to power a service business, not a public-facing crawler. \n\nWe aren't scraping the entire web; we are sniping specific niches.You’re looking at this through a Product Manager lens (Scalability/TOS), which is fair. I’m looking at it through a Sales lens (Revenue/Conversion). For now, the latter pays the bills",
              "score": 1,
              "created_utc": "2025-12-28 22:03:12",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwfw9ed",
                  "author": "WorldsGreatestWorst",
                  "text": ">On 'Readiness to Buy': High intent on a competitor's post (e.g., asking 'Does this work for acne?') is the strongest buying signal there is. It means they are problem-aware and solution-seeking but undecided. That is exactly where a challenger brand wins.\n\nIf Influencer X is already talking about Acne Cream A, it does Acne Cream B no good to know that his audience is problem-aware and solution-seeking because that influencer can't **also** sign with their competing acne cream. It's incredibly rare for influencer agreements not to include some minimal level of exclusivity or affiliate commissions. \n\nHow would your product work if the influencer isn't *already* pitching a product? It seems like a Catch 22: it tells you your competitor is *about* to succeed or lets you know the ground isn't fertile. \n\n>On 'Validation': I’m not selling predictive analytics software; I’m selling an outcome. The validation is simple: I send them the influencers, they run the campaign. If ROAS is positive, the model works.\n\nI get pitched on a million products per year. I can tell you that the ones that require me to invest in them to validate the concept make up almost 0% of my marketing stack. I need data and white pages and evidence to justify investment. That will be a big hurdle to get around. \n\nWill you be giving out freebees? \n\n>On APIs/Scale: This is internal infrastructure to power a service business, not a public-facing crawler.\n\nMaybe I'm not following your concept here. I assumed you were an ongoing service. Are you selling software that businesses deploy and use themselves? Otherwise, I'm not following the difference between a public and non-public crawler. They're both still beholden to TOS. Since Meta, TikTok, and every other platform already have official or unofficial Influencer agencies, it seems like they'd want to shut you down. \n\n>You’re looking at this through a Product Manager lens (Scalability/TOS), which is fair. I’m looking at it through a Sales lens (Revenue/Conversion). For now, the latter pays the bills\n\nIf you are at the \"validate my idea\" phase, there are **no** bills being paid, right now. SaaS products are attractive because the logistics scale downward. If you're dealing with ChatGPT tokens and per-business scrapers, your business doesn't scale like an SaaS, it scales like a service. That's certainly not a bad thing, but it's not about project management or conversion, it's about modeling future earnings. \n\nOn a slightly different note, have you considered your software as an attribution toolset for advertisers? Influencer campaigns are notoriously hard to track—I could see there being value in a simple tool that automates the tracking of sentiment on a post-by-post basis to hone messaging?",
                  "score": 1,
                  "created_utc": "2025-12-28 22:25:56",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwfrmq2",
          "author": "NewIndependence3300",
          "text": "The idea is great. I think you need at the beginning to show it correlates with conversions, small DTC brands will care.",
          "score": 1,
          "created_utc": "2025-12-28 22:02:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwfs4bv",
              "author": "Grozfroz",
              "text": "Yeah i built a list of 100 d2c brands(11-200; employees) across 5 niches before new year i will do a Highly targeted outreaching to all to see if they show buying intent",
              "score": 2,
              "created_utc": "2025-12-28 22:04:53",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwipw6a",
          "author": "lonewarrior786",
          "text": "Yeah i liked this idea i would like to try it as i am building my brand",
          "score": 1,
          "created_utc": "2025-12-29 09:37:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwir1qh",
              "author": "Grozfroz",
              "text": "Hey thats great to hear ! Sent you a dm",
              "score": 1,
              "created_utc": "2025-12-29 09:48:00",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwm06xb",
          "author": "FinancialCook603",
          "text": "I like the idea - it's valuable, especially if there's a higher conversion rate, which can validate the idea fast",
          "score": 1,
          "created_utc": "2025-12-29 20:53:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwog76j",
          "author": "Fickle-Chair-4077",
          "text": "Love this idea and would love to learn more about it. Shoot me a dm - I might be able to help with CA!",
          "score": 1,
          "created_utc": "2025-12-30 04:53:08",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pyd0kk",
      "title": "quick feedback request: blunt clarity tool",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1pyd0kk/quick_feedback_request_blunt_clarity_tool/",
      "author": "KowalcDa",
      "created_utc": "2025-12-29 04:50:53",
      "score": 5,
      "num_comments": 1,
      "upvote_ratio": 1.0,
      "text": "I've been working on a small tool l've been using on myself when I spiral or get stuck or anything involving feelings.\n\nBasically, I dump what's going on and it spits back a blunt, no-BS breakdown that cuts through my mental gymnastics and helps me “snap out of it” from any unproductive feelings & spirals. It’s the closest thing to having my good buddy Dan get annoyed and call me out on my bullshit with his tough-love approach.\n\nCurious if this kind of thing would actually be useful to other people, get some honest feedback, and stress-testing it on real situations.",
      "is_original_content": false,
      "link_flair_text": "Idea Feedback",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1pyd0kk/quick_feedback_request_blunt_clarity_tool/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "nwifbc3",
          "author": "ChestChance6126",
          "text": "The idea itself isn’t crazy, but the value will live or die on framing and boundaries. A lot of people want clarity, but they don’t want to feel judged or talked down to when they’re already stressed. I’d be curious how you handle context and tone. Blunt can be helpful, or it can backfire fast. This feels more like a niche tool for people who already like tough feedback, versus a broad audience. If you can show a few concrete before and after examples, that would probably surface whether it actually clicks for others or just works for you.",
          "score": 1,
          "created_utc": "2025-12-29 07:57:31",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pxefwh",
      "title": "Business ideas",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1pxefwh/business_ideas/",
      "author": "VariousMall7147",
      "created_utc": "2025-12-28 01:27:38",
      "score": 4,
      "num_comments": 3,
      "upvote_ratio": 0.84,
      "text": "Hi everyone, looking to start a business in selling items which are beneficial to women (target audience aged 20-30). I have many ideas which solve problems I personally experience myself in many different areas: clothing, beauty and technology but was wondering if anyone has problems they’ve personally faced throughout their lives? Perhaps an issue with a product already out in the market which doesn’t work for them or needs a few things changing, or something they wish was available (for example: more stylish and trendy clothing available for curvy and plus size women). I’m looking to create products that are useful and actually helpful in today’s society for us women. Thank you :)",
      "is_original_content": false,
      "link_flair_text": "What business do I start?",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1pxefwh/business_ideas/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "nwdjm2a",
          "author": "CriticismDense3756",
          "text": "Plus size/curvy but also petite. Cute and fashionable clothes, not frumpy and tent like.",
          "score": 1,
          "created_utc": "2025-12-28 15:32:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwgfrkb",
          "author": "PensionFinancial4866",
          "text": "Have you guys heard of 👉 https://www.encubatorr.com — An AI-powered, all in one startup incubator that helps anyone turn an idea into a real business from scratch, step by step.\n\nIt’s like your AI Co-founder :)",
          "score": 0,
          "created_utc": "2025-12-29 00:09:25",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pzfa1f",
      "title": "Idea for an AI-Powered Unified eCommerce Platform - Feedback Welcome",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1pzfa1f/idea_for_an_aipowered_unified_ecommerce_platform/",
      "author": "Educational_Two7158",
      "created_utc": "2025-12-30 10:59:59",
      "score": 4,
      "num_comments": 3,
      "upvote_ratio": 0.84,
      "text": "Hey r/Business_Ideas,\nI have been thinking about a potential business concept in the eCommerce space and would really appreciate some honest feedback from the community.\n\nThe concept: An all-in-one AI-powered platform targeted at mid-sized online brands B2C, D2C or B2B that combines everything needed to run and scale a store storefront creation, inventory and order management, customer relationship tools, basic enterprise resource planning features, omnichannel selling (web, mobile, social media, marketplaces) and built-in analytics.\n\nIt would be positioned for businesses that have outgrown simpler drag-and-drop solutions but aren't quite ready or can't afford full-scale enterprise systems with massive implementation costs.\n\nStandout elements I'm considering:\n\nHeavy use of AI for personalized product suggestions, smarter search, visual discovery and automated cart recovery to improve conversion rates.\n\nPredictive tools for inventory to help avoid running out of stock or tying up too much cash in excess inventory.\n\nStrong focus on automation and integrations to cut down on manual work across tools.\n\nMain problems it would aim to address: Too many disconnected tools high platform fees eating into margins, loss of control over customer data and operational chaos as sales volume grows (especially in the $100k–$5M revenue range).\n\nA few questions to spark discussion:\n\nDo you think there's genuine demand for a smarter, more integrated option in this middle-market segment?\n\nWhat are the most frustrating scaling pains you have seen or experienced in eCommerce that something like this might miss?\n\nWhich features would be absolute must-haves and which would be nice-to-haves?\n\nAny obvious risks competition, technical challenges, pricing sensitivity, etc.?\n\nI'm looking for straightforward opinions: what works about the idea, what doesn't, potential tweaks or reasons it might struggle.\nThanks in advance for any thoughts!",
      "is_original_content": false,
      "link_flair_text": "Idea Feedback",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1pzfa1f/idea_for_an_aipowered_unified_ecommerce_platform/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "nwq0vnc",
          "author": "Martin-Giorgetti",
          "text": "Let me get straight to the point. Start with something smaller. It will be easier to build, sell, and achieve product-market fit. \n\nFor example, building this platform you mentioned will be expensive to develop, not just in terms of money, but also time. It's better to start with a simple function that any e-commerce user needs. \n\nFor example, everyone wants to sell. To sell, they need better photos or videos, or perhaps better AI optimized descriptions to appear in Chatgpt, etc. Focus on one problem. Sell that solution. Build it. Then you can gradually add other features. \n\nIn the long run, you'll have your full e-commerce platform. Just start small and focused.",
          "score": 3,
          "created_utc": "2025-12-30 12:52:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwqbrx9",
          "author": "emrbyrktr",
          "text": "Alibaba has an AI WhatsApp account. You tell it the product you want, and it finds it for you.",
          "score": 2,
          "created_utc": "2025-12-30 13:59:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwr8ae6",
          "author": "SoftConsideration459",
          "text": "Cool idea. My concern would be selling this to bootstrapped entrepreneurs that primarily run on Excel or Google sheets. It takes a lot of trust to hand the rains of your business over to AI. \n\nAlso the one off situations can get difficult if the AI is not ready for them.",
          "score": 1,
          "created_utc": "2025-12-30 16:44:13",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pysbdp",
      "title": "Bouncy house/party rental",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1pysbdp/bouncy_houseparty_rental/",
      "author": "Popular-Cranberry-86",
      "created_utc": "2025-12-29 17:28:18",
      "score": 3,
      "num_comments": 3,
      "upvote_ratio": 1.0,
      "text": "Does anyone here do bouncy house rental? If so who do you use for insurance? I’m having trouble finding a company",
      "is_original_content": false,
      "link_flair_text": "No applicable flair exists for my post",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1pysbdp/bouncy_houseparty_rental/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "nwlhhg3",
          "author": "trojenhorse",
          "text": "Better list it on AirBnB",
          "score": 1,
          "created_utc": "2025-12-29 19:22:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwsegmq",
          "author": "Littlepastaboy",
          "text": "No one insures that you bounce at your own risk",
          "score": 1,
          "created_utc": "2025-12-30 20:01:06",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pxmvgh",
      "title": "Weekly Free For All Thread - Spam your business - Post your surveys - Tell us about your awesome MLM scheme - [UNMODERATED POST] (except for site rules of course)",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1pxmvgh/weekly_free_for_all_thread_spam_your_business/",
      "author": "AutoModerator",
      "created_utc": "2025-12-28 09:01:00",
      "score": 3,
      "num_comments": 6,
      "upvote_ratio": 1.0,
      "text": "Hey r/Business_Ideas! \n\n**Welcome to Small Business Sundays!** \n\nThis is the ONLY place you can solicit on this subreddit, so feel free to plug your business and services here and get the word out about your offerings! \n\nYou should try to include:\n\n* your industry\n* your experience (or portfolio)\n* the type of customer you're looking for\n* any other relevant info \n\nThe only rules still in force are Reddit's site-wide rules and 'Be Real & Be Nice', otherwise, spam away!",
      "is_original_content": false,
      "link_flair_text": "WEEKLY THREAD",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1pxmvgh/weekly_free_for_all_thread_spam_your_business/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "nwd8rvs",
          "author": "Novel-Notions",
          "text": "We launch brands on TikTok for a flat fee which includes recruiting hundreds of affiliates and managing their content in exchange for samples",
          "score": 1,
          "created_utc": "2025-12-28 14:30:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nweg0s3",
          "author": "BrilliantUnit6628",
          "text": "Unlock passive revenue for your business - DIDSigns is looking to team up with businesses in metro Cleveland OH. area that want an extra income source without the extra work.\n\nWhat we offer:  \n• Digital Sign Hosting: Place a digital sign in a high‑traffic  area of you business  \n• No‑Action Model: Once the sign is live, DIDSigns handles all ad sales, updates, and maintenance.  \n• Passive Income: You earn – no effort from you or your staff.\n\nWhy partner with us?  \n• Instant monthly revenue boost.  \n• Zero tech headaches—our team runs the whole pipeline.  \n• Flexible placement: storefronts, cafés, office lobbies, co‑workspaces, etc.\n\nDM, comment below or leave you business details at  [https://didsigns.com/host-a-sign/](https://didsigns.com/host-a-sign/)\n\nLets chat",
          "score": 1,
          "created_utc": "2025-12-28 18:13:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwlpntl",
          "author": "overdrive_mode",
          "text": "Hello All. I have been looking for support groups for entrepreneurs and while there are a lot of options, I think there are no low commitment/silent support options. There is no option to just have **presence** of people around you (especially online) to eliminate the feeling of loneliness. I often wonder if I'm the only person going through this and its good to read through posts but I have to look through the posts to find specific content. \n\nThere is no replacement for in-person interaction but there are times when we just need a boost, especially when we are trying to focus in that lonely work space at home. Just seeing a page of people's posts would be uplifting in that moment.\n\nMy first attempt at this is a webpage with a simple form (called a **Momentum Card**) and a dashboard in a feed format. Its very basic for now. The form has standard questions that I used to track on Word and then on paper. They are like scorecards but without score. There is an option to keep it private or share it with public. After submission, the page is redirected to the dashboard. There is also a feedback option where you can tell me what you think of it and if you want modifications. \n\nI think community input and feedback is very important and I really like the idea of building this together! I can build it as we go and it could turn into a great support tool. Let me know your thoughts. \n\n[https://jayruslabs.com/pages/momentum-card](https://jayruslabs.com/pages/momentum-card)",
          "score": 1,
          "created_utc": "2025-12-29 20:01:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwmu3t5",
          "author": "theManOfManyTalents",
          "text": "We have all been in that situation where we saw a nice product physically or on social media. Oftentimes, the next step is to go on Google and try looking for the product and how to buy it. Some may take a step further by asking the owner about where they got the item from.\n\nI'm building an AI-powered platform that will provide you with shopping links for all purchasable items in any image you upload.\n\nUnlike Google image search, which provides links to the main item in a picture, Snapcart reads all the items in the picture and gives you links to buy each one of them.\n\n\"\\*\\*\\*\\* AI is an AI-powered web app that turns any image into a shoppable list.\n\nUsers simply:\n\n1. Upload a photo\n2. AI detects all purchasable items 3. Instantly receive links to buy\n\neach item online\n\nFrom inspiration → checkout in seconds.\"\n\nWhat do y'all think about this?",
          "score": 1,
          "created_utc": "2025-12-29 23:24:30",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pwq11r",
      "title": "Exploring an AI-assisted publishing workflow — unsure where the real business value is",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1pwq11r/exploring_an_aiassisted_publishing_workflow/",
      "author": "apeacezalt",
      "created_utc": "2025-12-27 05:38:59",
      "score": 3,
      "num_comments": 1,
      "upvote_ratio": 1.0,
      "text": "I’ve been building and testing a system to handle long-form AI generation (books / chapters), mainly to deal with real constraints like word-count control, coherence across generations, and stitching multiple outputs into one readable piece.\n\nFrom a business point of view, I’m stuck between two directions and would appreciate outside perspective.\n\n**Direction A: Use it internally**\n- Publish small, niche book series on marketplaces (self-help, daily life topics)\n- Focus on quality, structure, and iteration (not mass output)\n- Treat it as a slow content business\n\n**Direction B: Offer the tool/workflow**\n- Position it as a writing aid for people who already want to create books but struggle with structure, energy, or time\n- Emphasize constraints, editing, and human review — not automation or scale\n\nMy concerns:\n- Market saturation and trust around AI-generated content\n- Whether publishing books is defensible long-term vs tooling\n- Whether tools in this space are seen as enabling spam, even if used responsibly\n\nI’m not trying to “flood” anything — the system is very much chapter-by-chapter with manual review — but perception matters.\n\nIf you were evaluating this purely as a business:\n- Which direction seems more defensible?\n- Where do you see actual value being created?\n- What would you immediately poke holes in?\n\nLooking for honest feedback, not validation.",
      "is_original_content": false,
      "link_flair_text": "Idea Feedback",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1pwq11r/exploring_an_aiassisted_publishing_workflow/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "nwbn91f",
          "author": "Gio_13",
          "text": "Idea is cool. Your goal is to find a niche. I’ve heard author dislike AI. I don’t think they would use it. Not sure who else is out there writing books.",
          "score": 2,
          "created_utc": "2025-12-28 06:17:16",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pvexlp",
      "title": "What business problem cost you more time than expected?",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1pvexlp/what_business_problem_cost_you_more_time_than/",
      "author": "Anni_18-03",
      "created_utc": "2025-12-25 14:52:32",
      "score": 3,
      "num_comments": 7,
      "upvote_ratio": 1.0,
      "text": "Some problems don’t hit your wallet they drain your energy. Miscommunication, disputes, misunderstandings… massive time sinks.\nWhich one hit you the hardest?",
      "is_original_content": false,
      "link_flair_text": "Idea Feedback",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1pvexlp/what_business_problem_cost_you_more_time_than/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "nw3ngz7",
          "author": "Drumroll-PH",
          "text": "Miscommunication killed me more than anything. In my 3D printing side business, trying to coordinate custom orders with clients without clear expectations ended up taking hours every week just clarifying details, back n forth messages, and fixing mistakes. After I set clear processes and templates, it freed up so much time.",
          "score": 2,
          "created_utc": "2025-12-26 23:08:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "nw4j6iw",
              "author": "New_Criticism4996",
              "text": "Curious to the process. Did you setup an intake form/questionnaire?",
              "score": 1,
              "created_utc": "2025-12-27 02:23:21",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nvvzwcq",
          "author": "Comprehensive-Pop856",
          "text": "It was not the hardest, but find a good free domain for my website was a big challenge 💀",
          "score": 1,
          "created_utc": "2025-12-25 16:31:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvw1u48",
          "author": "Broad-Disaster-3895",
          "text": "Disputes waste hours. Contractors I know through **USA Business Insurance Services, Inc.** say knowing coverage upfront prevents unnecessary stress.",
          "score": 1,
          "created_utc": "2025-12-25 16:43:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvw3ng4",
          "author": "Endoky",
          "text": "People Management",
          "score": 1,
          "created_utc": "2025-12-25 16:53:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvw8ius",
          "author": "Saiki_kusou01",
          "text": "Even without financial loss, focus and momentum suffer. Awareness of insurance keeps your attention on work, not paperwork.",
          "score": 1,
          "created_utc": "2025-12-25 17:23:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvwdn4f",
          "author": "One_Rush_2845",
          "text": "Talking about risks and insurance with clients builds trust and smooths workflow.",
          "score": 1,
          "created_utc": "2025-12-25 17:53:40",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pv1468",
      "title": "What channel would you focus on if you were starting from zero?",
      "subreddit": "Business_Ideas",
      "url": "https://i.redd.it/th3l1g4ju89g1.gif",
      "author": "mtbenj1",
      "created_utc": "2025-12-25 00:22:50",
      "score": 3,
      "num_comments": 3,
      "upvote_ratio": 1.0,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Marketing / Operational / Financial / Regularotry Advice sought",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1pv1468/what_channel_would_you_focus_on_if_you_were/",
      "domain": "i.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "nw59nhg",
          "author": "itskisunk",
          "text": "A practical path that tends to work for similar tools:\nTalk to 30–50 store owners directly, even for free, to refine pricing, positioning, and core workflow before worrying about scale.\n\nOffer a generous free tier (e.g., limited image credits) so they can test on a few products, like leading tools that give a set number of free photos per month.\n\nFocus on one clear outcome in all messaging: “Turn ugly DIY product shots into studio photos in 10 seconds, from your phone.",
          "score": 1,
          "created_utc": "2025-12-27 05:25:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwabmd5",
          "author": "Time_Breadfruit_9453",
          "text": "Depends what GEO you are targeting. If you have zero marketing skill i will tell you to go into marketplaces that can show your products to its users : Facebook Marketplace, Etsy ...  \nMeanwhile you can begin creating some content (maybe with AI) on socials",
          "score": 1,
          "created_utc": "2025-12-28 01:06:49",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pzbq4w",
      "title": "would this have helped you in school?",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1pzbq4w/would_this_have_helped_you_in_school/",
      "author": "More-Promise6004",
      "created_utc": "2025-12-30 07:23:16",
      "score": 3,
      "num_comments": 0,
      "upvote_ratio": 1.0,
      "text": "I’m exploring an idea for an interactive app for Indian school students focused on real-life skills schools don’t teach well financial literacy, emotional intelligence, communication, decision-making, cyber safety, career awareness, using ai for studies (how to write better prompts)\n\nLearning would be simulation-based\n real-life situations → choices → outcomes \nusing real examples, not lectures.\n\nTo keep it interesting: streaks, progress scores, no exams or ranks.\n\nNeed opinions on:\n\n\t•\tWhat real-life topics should definitely be.     included?\n\t•\tWhat would make this more interesting to keep students hooked \n\n\nOpen to feedback",
      "is_original_content": false,
      "link_flair_text": "Idea Feedback",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1pzbq4w/would_this_have_helped_you_in_school/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": []
    }
  ]
}