{
  "metadata": {
    "last_updated": "2026-02-10 09:20:00",
    "time_filter": "week",
    "subreddit": "Business_Ideas",
    "total_items": 20,
    "total_comments": 80,
    "file_size_bytes": 112635
  },
  "items": [
    {
      "id": "1qylnxn",
      "title": "Our anonymous video chat platform Vooz hit 15k daily users yesterday!",
      "subreddit": "Business_Ideas",
      "url": "https://i.redd.it/i5klh8lga4ig1.jpeg",
      "author": "Electrical-Face-9291",
      "created_utc": "2026-02-07 18:39:21",
      "score": 76,
      "num_comments": 22,
      "upvote_ratio": 0.93,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Review my website, please",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1qylnxn/our_anonymous_video_chat_platform_vooz_hit_15k/",
      "domain": "i.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "o461afk",
          "author": "maopro56",
          "text": "itting 15k without even knowing who’s behind the camera is basically the grown‑up version of walking into the wrong Zoom call and pretending you belong",
          "score": 5,
          "created_utc": "2026-02-07 23:54:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o44hs5j",
          "author": "Fun_Lock2003",
          "text": "How do you guys earn money",
          "score": 4,
          "created_utc": "2026-02-07 18:49:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o45dwrl",
              "author": "Electrical-Face-9291",
              "text": "\n\nWe aren't earning yet yet. We just started monetizing with premium features like gender and location filters etc. We will be earning in a few weeks once more monetization features are released",
              "score": 3,
              "created_utc": "2026-02-07 21:39:13",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o44ly53",
              "author": "wavepointsocial",
              "text": "There’s always money in the banana stand",
              "score": 1,
              "created_utc": "2026-02-07 19:10:23",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o44tl5l",
          "author": "Critical_Nobody_4237",
          "text": "\n\nCongrats on the traffic numbers, that's impressive.\n\nThe real question everyone is thinking: How exactly does your \"strict AI moderation\" handle the Chatroulette/Omegle problem? (i.e., unsolicited nudity). Running real-time computer vision models on daily video chats to detect nudity is incredibly expensive and latency-heavy. \n\nAre you processing every frame or just sampling?",
          "score": 5,
          "created_utc": "2026-02-07 19:49:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o45d8mh",
              "author": "Electrical-Face-9291",
              "text": "\n\nWe have multiple AI models running in the background to detect nudity. If one model detects a hit, the other models confirm it by running checking it in quick succession. It is super detailed and very rarely can someone escape.",
              "score": 1,
              "created_utc": "2026-02-07 21:35:40",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o45k1ih",
                  "author": "hi_im_antman",
                  "text": "Yes, I think he understands that. He's asking about the cost of performance. You would essentially need to run the AI checks continuously (or frequently) on every active live stream. Even with frame sampling, doing it at scale is expensive and “multiple models” just increases the compute bill. \n\nAnd if you aren't doing it regularly, then the claim of being strict on nudity isn't really true. I can't imagine what it would be like if you had over a million users.",
                  "score": 9,
                  "created_utc": "2026-02-07 22:12:20",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o45u4z0",
          "author": "HospitalAny8632",
          "text": "Did you need turn server as fallback?",
          "score": 3,
          "created_utc": "2026-02-07 23:09:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o44gj19",
          "author": "Dear-Aspect-6969",
          "text": "Great achievement,   \nI'd like to know about tech stack and the cloud you are using to manage the infrastructure, and total costs per months from a technical side ofc, if you don't mind",
          "score": 2,
          "created_utc": "2026-02-07 18:43:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o45eviu",
              "author": "Electrical-Face-9291",
              "text": "\n\nTech stack is .net backend, nextjs front end, azure, webrtc\n\nWe aren't using any third party could server for our infra. Video streaming is p2p. Total costs per month is sustainable since we aren't using any third party subscriptions, can't disclose the numbers tho",
              "score": 1,
              "created_utc": "2026-02-07 21:44:27",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o44z2oo",
          "author": "Comfortable_Cap8037",
          "text": "\nWhich tech stack did you use?",
          "score": 2,
          "created_utc": "2026-02-07 20:19:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o45c7ss",
              "author": "Electrical-Face-9291",
              "text": "\n\nTech stack is .net backend, nextjs front end, azure, webrtc",
              "score": 2,
              "created_utc": "2026-02-07 21:30:11",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o44g1d7",
          "author": "Electrical-Face-9291",
          "text": "https://vooz.co \n\nBest anonymous chat site on the internet!",
          "score": 1,
          "created_utc": "2026-02-07 18:41:00",
          "is_submitter": true,
          "replies": [
            {
              "id": "o450twv",
              "author": "definitelynotgayhaha",
              "text": "\n\nWhy name it Vooz? Sounds spooky lol",
              "score": 1,
              "created_utc": "2026-02-07 20:28:39",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o45cuz2",
                  "author": "Electrical-Face-9291",
                  "text": "\n\nIt just came to us lol.. sounded cool and different, nothing else",
                  "score": 1,
                  "created_utc": "2026-02-07 21:33:39",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o44n7nr",
          "author": "MrMooseCreature",
          "text": "Love it",
          "score": 1,
          "created_utc": "2026-02-07 19:16:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o44nc0a",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-07 19:17:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o45ekpl",
              "author": "Electrical-Face-9291",
              "text": "\n\nYeah I am actually anticipating that lol. Dming you. Gotta discuss something",
              "score": 1,
              "created_utc": "2026-02-07 21:42:49",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o44p3rs",
          "author": "Wooden-Ad-9894",
          "text": "Do build an app for it. You can send notifications on users phones everyday which will improve retention and Vooz will always be on the back of their minds. Just a small business tip",
          "score": -2,
          "created_utc": "2026-02-07 19:26:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o45dlo5",
              "author": "word2trio",
              "text": "fuqoff",
              "score": 1,
              "created_utc": "2026-02-07 21:37:36",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o45dt6n",
              "author": "Electrical-Face-9291",
              "text": "\n\nYeah we will build an app once we have some bandwidth. Right now super occupied with creating monetization features",
              "score": -2,
              "created_utc": "2026-02-07 21:38:42",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1quq6nb",
      "title": "How a Window Cleaning Business Made $79K/Month (And Why Your Industry Can Too)",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1quq6nb/how_a_window_cleaning_business_made_79kmonth_and/",
      "author": "4PFmel",
      "created_utc": "2026-02-03 12:05:36",
      "score": 33,
      "num_comments": 2,
      "upvote_ratio": 0.91,
      "text": "So Brandon and Carter got laid off during COVID. Instead of doom-scrolling, they noticed something: service trucks were everywhere, but people hated dealing with them. No-shows, surprise charges, dirty boots through clean houses.\n\nThey spent $153 at Home Depot and started cleaning windows in Austin. Fast forward to 2025: Pink's Window Services is a multi-million dollar franchise network with 236+ units across 29 states.\n\nBut here's what actually matters, they didn't win on the service. They won on the *strategy*.\n\n**The marketing playbook:**\n\n**1. Pick a story first, service second**  \nThey didn't start with \"we clean windows.\" They started with \"bring dignity back to blue-collar work.\" That one sentence became their north star for everything: name, branding, how they hire, how they show up.\n\n**2. Make boring things visually unforgettable**  \nNavy trucks. Crisp uniforms. Pink accents everywhere. It looks like a 1950s gas station mixed with a streetwear brand.\n\n[pink windows services](https://preview.redd.it/s0mvyzg9s9hg1.png?width=1080&format=png&auto=webp&s=05fae98584a485b9207dda61e05bdff940f7a02f)\n\nOther home service companies could do this tomorrow. Most just... don't.\n\n**3. Turn operations into marketing**  \nOn-time arrivals when they say they'll arrive. Online booking instead of phone tag. Handwritten thank-you notes. Free pressure washing on driveways for recurring customers.\n\nWhen your actual service experience is better than 90% of competitors, people talk about it. Their reviews mention the *people* and the *experience* more than the actual clean windows.\n\n**4. Content isn't an afterthought, it's the strategy**  \nThey post VHS-style videos, clips of techs doing kickflips in uniform, \"comp clean of the week\" features of local businesses.\n\nIt reads like a lifestyle brand, not \"commercial window cleaning LLC trying to sell you something.\"\n\n**5. Merch becomes word-of-mouth**  \nThey give genuinely cool gear to staff and top customers. People started buying Pink's hats, jackets, socks, not because they needed them, but because they look good.\n\nThat's free marketing walking around.\n\n**Why this matters:**\n\nYou don't need a new app or a new category/industry. You can take something as unglamorous as window cleaning and, through clear positioning, strong branding, thoughtful operations, and consistent content, build something franchisees actually want to be part of.\n\nThe playbook works for HVAC, plumbing, landscaping, handyman services, pest control—literally anything blue-collar right now.\n\nThe question isn't whether your industry is boring. It's whether you're willing to make it interesting.\n\n*Edit: Lots of people asking how they got franchisees to buy in early. Short answer: proof in the numbers. Their Austin location did $750K-$985K with 30%+ margins. Hard to say no to that. You can find their exact marketing strategy* [here](https://marketingcrafted.com/case-studies/pink-windows)",
      "is_original_content": false,
      "link_flair_text": "Marketing / Operational / Financial / Regularotry Advice sought",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1quq6nb/how_a_window_cleaning_business_made_79kmonth_and/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o3c5xyf",
          "author": "MrMooseCreature",
          "text": "Good on em",
          "score": 2,
          "created_utc": "2026-02-03 13:24:44",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qvmuxc",
      "title": "Career Digital Twin",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1qvmuxc/career_digital_twin/",
      "author": "Broad-Rip-2260",
      "created_utc": "2026-02-04 12:09:06",
      "score": 11,
      "num_comments": 3,
      "upvote_ratio": 0.93,
      "text": "I’m building an app which allows you to create a digital twin of your career / role / responsibilities. I would listen to the internet and picks up signals which might impact one or more of your tasks (e.g. imminent automation) and then gives you advice on where to build skills, diversify, augment etc… thoughts on whether this is a good idea?",
      "is_original_content": false,
      "link_flair_text": "Idea Feedback",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1qvmuxc/career_digital_twin/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": []
    },
    {
      "id": "1qyzwe3",
      "title": "What are some major tasks in small/medium businesses that still require a lot of manual work but should be automated?",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1qyzwe3/what_are_some_major_tasks_in_smallmedium/",
      "author": "Original_Map3501",
      "created_utc": "2026-02-08 04:56:38",
      "score": 11,
      "num_comments": 17,
      "upvote_ratio": 0.83,
      "text": "Hey everyone,  \n  \nI’m trying to understand where small and medium businesses still lose a lot of time on manual work.  \n  \nFrom your experience, what are some repetitive or painful tasks you or your team still do manually that feel like they should already be automated?  \n  \nFor example:  \n  \nData entry and spreadsheet updates  \n  \nLead and customer follow-up tasks  \n  \nReport generation tasks  \n  \nInvoicing and payment processing and reminder creation tasks  \n  \nDocument and email organization tasks  \n  \nTask and deadline and approval tracking tasks  \n  \nI want to investigate which processes waste time and create daily operational difficulties because I have no intention to sell anything.  \n  \nIf you run a business or work closely with one:  \n  \nWhat task do you hate doing manually?  \n  \nWhat do you wish a tool would just “handle in the background”?  \n  \nI want to understand actual problems that people experience in day-to-day life. Thank you for your help.",
      "is_original_content": false,
      "link_flair_text": "Idea Feedback",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1qyzwe3/what_are_some_major_tasks_in_smallmedium/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o47exwb",
          "author": "GotTools",
          "text": "What I have noticed just about everywhere I’ve worked so far is that nothing is optimized in the way of standards and procedures. \n\nIt’s not like there aren’t countless solutions to making those tasks 100x more optimized, but that everyone is too focused on the thing that directly makes them money and not optimizing the process that supports it. You would be surprised how many companies still run of decade old computers. \n\nA lot of companies know their processes are complete crap and need redone, but they do the job for now.\n\nIt’s hard to come up with a solution to a problem in an industry you know nothing about, so get some real world experience in what you are passionate about and start looking for problems that need solutions.",
          "score": 4,
          "created_utc": "2026-02-08 05:17:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o47f8sg",
              "author": "Original_Map3501",
              "text": "So basically they are too lazy to optimize it or they dont wanna get out of the comfort zone and just keep using the old tech and not touch it if tis working?",
              "score": 2,
              "created_utc": "2026-02-08 05:20:14",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o49arpd",
                  "author": "Botboy141",
                  "text": "There are a lot of ways to make money in this world.\n\nA profitable, growing business, doesn't always have to focus on every opportunity for efficiency and optimization.\n\nA lot of the time, a small tweak to their marketing or sales process will yield great short-mid term results, for less effort, than actually addressing inefficient operations.\n\nInefficient operations become more relevant at scale, and is where most business fail.",
                  "score": 4,
                  "created_utc": "2026-02-08 14:39:51",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o47gmn0",
                  "author": "Green-Setting5062",
                  "text": "I know with some apps they charge you by the page for basically smart parsing from ocr scanned documents. I was working on my own receipts and invoice intake system because I think thay would eventually require that i hire someone to do it for me, but I was able to make a python tool that can parse my bank statement and certain invoices. Its just manual trial and error and I use a json as the profile template. My problem is I feel its too jankey to sell but I deal with the jankey stuff because I can spend an hour and get a profile dialed in and save it and it works 90% of the time and im able to get the money info and dates into a database that can export csv or whatever for a book keeper. I developed it because I have adhd and I cant stay organized with paperwork everywhere so its way easier to keep a folder on the PC with each month of records and then get it all into a data base and its all there basically. Ive automated a huge chunk of the repeating tasks basically all I gotta do is take pictures of receipts with a scanner app and then transfer them into the folder when im home. And boom I can process the receipts and bank accounts in under an hour. And hell im usually screwing around on my phone for most of the hour so a normal person it would probably be 30 mins lol 😆",
                  "score": 2,
                  "created_utc": "2026-02-08 05:31:09",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o48zda5",
          "author": "indexintuition",
          "text": "honestly, anything that requires me to remember to follow up later is where things fall apart. emails especially, drafting them, formatting them, then remembering who i sent what to. invoicing too, not the sending part but the reminders and tracking who paid without digging through spreadsheets. i also hate moving the same info between tools because it feels like pure brain drain. i wish more stuff just synced quietly in the background so i could spend my limited time actually working instead of managing the work. as a small business, the mental load is almost worse than the time itself.",
          "score": 3,
          "created_utc": "2026-02-08 13:31:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o494ydk",
              "author": "Original_Map3501",
              "text": "The statement that the mental burden is worse than the actual time struck a chord with me.  \nI'm thinking about this, and I would appreciate your frank opinion. Imagine a tool that tracks invoices and follow-ups in the background without requiring you to check spreadsheets or set reminders. It remembers who sent what, automatically reminds you to pay unpaid invoices, and marks tasks as completed when payment is received.\n\nIt would only interrupt you if something was past due or required attention; otherwise, you would continue working as you currently do.\n\nFor you, would something like that truly lower the mental overhead? If so, what is more important automatic payment detection, follow-up notifications, or avoiding the need to maintain tool synchronization?",
              "score": 1,
              "created_utc": "2026-02-08 14:05:51",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4anhl0",
                  "author": "eldowns",
                  "text": "Almost all invoicing platforms already do this.",
                  "score": 2,
                  "created_utc": "2026-02-08 18:39:43",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o47ek1p",
          "author": "feudalle",
          "text": "So I've been in dev since the 90s. The problem is every small business does it diffently. You need to customize per client or you can try the over saturated SaaS option.",
          "score": 3,
          "created_utc": "2026-02-08 05:14:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o47fbfm",
              "author": "Original_Map3501",
              "text": "What exactly do you mean by \"customize per client\"?",
              "score": 1,
              "created_utc": "2026-02-08 05:20:49",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o47fvks",
                  "author": "feudalle",
                  "text": "So client 1 keeps there spreadsheets in layout x on google sheets. Client 2 uses share point and excel and links it to powerbi. Client 3 has an access database their nephew built in 2006 for them. Client 4 uses salesforce but keep notes of things thfy need to enter in on a txt file on their desktop. No good way of automating that with 1 solution. If your thought is you'll have them all entered it in your way fir uour solution, good luck pushing the boulder up the hill. 30 years of dev experience for small company to multinationals you are fighting human nature.",
                  "score": 3,
                  "created_utc": "2026-02-08 05:25:13",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4d3m0n",
          "author": "Ecaglar",
          "text": "the training/onboarding answer is spot on. every company reinvents that wheel and its always chaos. the follow up problem is also universal - remembering who you sent what to is just broken workflow",
          "score": 3,
          "created_utc": "2026-02-09 02:24:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4dwsnp",
              "author": "Original_Map3501",
              "text": "When onboarding breaks down, what’s the most painful part for you personally creating training material, tracking who’s done what, or constantly following up with people?",
              "score": 1,
              "created_utc": "2026-02-09 05:22:37",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o48xupu",
          "author": "senraku",
          "text": "An auto salt and pepper shaker hopper/quick fill for restaurants",
          "score": 2,
          "created_utc": "2026-02-08 13:21:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o497tl6",
          "author": "Aero002",
          "text": "Training, onboarding, upskilling employees - takes hours and hours. Even with material. ",
          "score": 2,
          "created_utc": "2026-02-08 14:22:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ix2y4",
          "author": "Ecaglar",
          "text": "invoicing and bookkeeping for small businesses is still painful. also scheduling and appointment management for service businesses is a mess. people use like 5 different tools that dont talk to each other",
          "score": 2,
          "created_utc": "2026-02-09 23:52:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o47zkv0",
          "author": "imabetaunit",
          "text": "I’m having trouble identifying what business idea is being shared.",
          "score": 1,
          "created_utc": "2026-02-08 08:20:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4f4t3m",
          "author": "Comfortable_Mark_556",
          "text": "Keep it up! Looking forward to your next publications.",
          "score": 1,
          "created_utc": "2026-02-09 12:04:41",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1quscay",
      "title": "Please help, i am stuck.",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1quscay/please_help_i_am_stuck/",
      "author": "drteeworks",
      "created_utc": "2026-02-03 13:46:40",
      "score": 10,
      "num_comments": 27,
      "upvote_ratio": 0.92,
      "text": "So I just started a business which is a 90 minute one to one Personal or Professional Goals Mapping and Priority Setting Session for aspiring Product Managers and Directors.\n\nThe problem is client acquisition.\n\nWhat I tried so far includes offering 10 slots for free, posting my offer on a couple of subreddits, although my posts got removed and I was banned, and direct messaging people who I felt were a good fit.\n\nWhat happened is that luckily some people saw my posts before they were removed and they contacted me. I also received some replies from people I messaged, which suggests that there is demand.\n\nWhat I cannot do for now is any form of paid advertising due to financial reasons.\n\nWhat I am thinking of trying next is creating my own subreddit where I can share my service.\n\nI have also considered creating content on social media, but I do not want something that would take eight months or a year before I start getting clients. I want an approach that can start producing some results within one or two months, even if small, so I can begin getting in contact with people more quickly. This is one of the main reasons why I initially chose Reddit, because it allows for direct and immediate interaction. I can message people, they can message me, comment, and engage in real time, which makes the process much more dynamic and direct.\n\nWho am I, you might ask. I am a Senior Director and SEO with over five years of experience in the tech industry. I have worked on different projects including apps, websites, machine learning, database management, and AI, delivering technical solutions and products, market studies, and strategies. I have mainly worked with local factories, stores, and large warehouses. I stopped working for a year to study AI algorithms and solutions. \nDuring this time, I discovered that I really enjoy helping others in their journey to become Product Managers, Directors, and leaders, and to achieve their personal and professional goals. I want to do this for a living because I find it deeply fulfilling.\n\nPlease, any recommendation will help, thank you in advance.",
      "is_original_content": false,
      "link_flair_text": "Marketing / Operational / Financial / Regularotry Advice sought",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1quscay/please_help_i_am_stuck/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o3ciera",
          "author": "Wide_Brief3025",
          "text": "Tapping into existing communities where your target audience already hangs out can often lead to faster traction than building your own subreddit from scratch. Using a tool like ParseStream to monitor real time discussions about career transitions or product management might help you spot conversations you can naturally join and offer guidance. This way you stay active without spamming and get in front of people at the exact time they're asking for help.",
          "score": 3,
          "created_utc": "2026-02-03 14:33:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3cj2q6",
              "author": "drteeworks",
              "text": "Thank you so much, i'll try it. Do you suggest offering advice only or pitching?",
              "score": 1,
              "created_utc": "2026-02-03 14:36:46",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3coi0d",
          "author": "kawaiian",
          "text": "What guidance can you offer if you can’t guide yourself here? Gently, it doesn’t sound like you’re successful yet. Can you advise yourself first?\n\nDon’t you have a network built where people could use your services? Your first five clients will come from friends of friends, and after that, you get referrals from folks.",
          "score": 3,
          "created_utc": "2026-02-03 15:04:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3cr2qn",
              "author": "drteeworks",
              "text": "I have expirience in creating tech products but i don't know much about marketing, and that is the reason why i'm here, and i already have my first client from people that i know, but the thing is , just getting referrals from people that you know can only get you to a certains point then it stops, and that why i want to use internet for more visibility.",
              "score": 1,
              "created_utc": "2026-02-03 15:17:16",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3ca8ry",
          "author": "feudalle",
          "text": "A senior director that cant spend anything on advertising?",
          "score": 2,
          "created_utc": "2026-02-03 13:49:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3casgr",
              "author": "drteeworks",
              "text": "I did have a business and i stopped for a year, and spend a lot of money on paying bills, and some equipements for studying. Thank you for your question.",
              "score": 0,
              "created_utc": "2026-02-03 13:52:03",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3cflfy",
          "author": "LifeTelevision1146",
          "text": "DM me your email I'm sharing something valuable and pointing right at your domain. It's a document and can't post it here.",
          "score": 1,
          "created_utc": "2026-02-03 14:18:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3cii96",
              "author": "drteeworks",
              "text": "Your account is privite and i can't dm you, you can dm me so i can send you my email.",
              "score": 1,
              "created_utc": "2026-02-03 14:33:46",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3cjnxo",
                  "author": "LifeTelevision1146",
                  "text": "Sent you a chat request",
                  "score": 1,
                  "created_utc": "2026-02-03 14:39:52",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o3coozs",
                  "author": "kawaiian",
                  "text": "Don’t fall for scams bud",
                  "score": 1,
                  "created_utc": "2026-02-03 15:05:31",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3ky1hw",
          "author": "springcaterpillar",
          "text": "The subreddit idea probably won't work, you'll just get removed for self-promotion like before. What works better: contribute genuinely useful answers in communities where your target audience already asks questions. LinkedIn is actually ideal for the PM/director audience, posting about real decisions you've made, frameworks you've used, lessons learned. The catch with your 1-2 month timeline is that trust-based services need trust first. The people who saw your posts before they got removed and reached out, that's the model working at small scale. The sustainable version: answer questions in PM-focused subreddits without pitching, have a clear profile bio that explains what you do, and let interested people find you. Slower but doesn't get you banned.",
          "score": 1,
          "created_utc": "2026-02-04 19:08:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3p31yc",
              "author": "drteeworks",
              "text": "Thank you so much for taking time and sharing. This definitely helps and gives me what i'll do for now. Wish you the best.",
              "score": 1,
              "created_utc": "2026-02-05 10:52:19",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3ozuj7",
          "author": "superironthorman",
          "text": "This is a piss take, by definition someone with your credentials can't be this useless.",
          "score": 1,
          "created_utc": "2026-02-05 10:22:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3p3ldf",
              "author": "drteeworks",
              "text": "Thank you for taking time and sharing your opinion. Do you have any suggestion for this problem since you are an ex-faang pm? Anything would be appreciated. Wish you the best.",
              "score": 1,
              "created_utc": "2026-02-05 10:57:07",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o4ikf8x",
              "author": "PresentationUpbeat",
              "text": "I said the same thing - I read this and I’m like yeah dude you aren’t ready for your own business if this is where you’re at mentally in your career. Personally you should have a salaried job while doing this, this won’t happen in a month or even 2. The way you’ve written your post is a very immature way to approach what you’re trying to do and using Reddit as an acquisition source is pitiful. You should revisit in a year once you’ve proven your idea actual works, you have a portfolio, and you’ve been at least a SVP/VP level to understand business as a whole.",
              "score": 1,
              "created_utc": "2026-02-09 22:44:36",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3qtabz",
          "author": "Proud_Reality_3817",
          "text": "Hey well, welcome to the exciting and chaotic world of client acquisition and marketing haha !\n\nFirst of all, I'm a bit intrigued on the urgency leading you to want to money so quickly ? Do you have any deadline or particular reasons for it ?\n\nI'd say, from your main 90-minute coaching offer, that your best shot could very well be on LinkedIn, as that is where you could find lots of Active Product Managers and Directors. You could use posts to give tips, exercises and frameworks that could be useful to them and get their attention, and, at the same time, use LinkedIn to connect and reach out directly to Product Managers and Directors, offering a lead magnet or a free audit (that will allow you to then upsell them to your main 90-minute offer). Aiming for 100 personalised reach outs a week would be great, at first just asking them about how their work is going, creating trust, and then when Quarter-Reviews are approaching, shoot your shot and tell them about your offer !\n\nNow, I read through the comment and saw that you were experienced in creating tech product, and not so much in marketing. So, I would add that if you haven't heard of it yet or haven't set it up for your business and offers, I'd highly encourage you to build what's called a Growth Engine (Scorecard + The Actual Engine). This helps you monitor your whole business and user experience, from start to finish, and will help you convert more and keep your clients and prospects in the loop for longer.\n\nIf you want Ryan Deiss has a great template and framework for that. I'm also always glad to be of help so if you need any more details on that or anything marketing just reach out and I'll be there !",
          "score": 1,
          "created_utc": "2026-02-05 16:52:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3siwkx",
              "author": "drteeworks",
              "text": "Thank you so much for taking time and sharing, that is definitely helpful. And yes, linkedin is a better place where a lot of pms and directors exist. I've tried linkedin, and it is slower than reddit for some reason. I got better engagement on here. I already got my first bookings from here, so i guess i'll just continue testing on reddit for now. Thank you, appreciate your help.",
              "score": 2,
              "created_utc": "2026-02-05 21:41:00",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4fq545",
                  "author": "Proud_Reality_3817",
                  "text": "I'm happy that it could help ! I wish you the best with Reddit then, definitely don't hesitate to reach out if you ever need help or ideas on it !",
                  "score": 1,
                  "created_utc": "2026-02-09 14:21:55",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o43v70w",
              "author": "slowburn_otters",
              "text": " Haha, thanks for the warm welcome! The urgency is pretty real since I’m eager to help others and get things rolling financially. I totally agree about LinkedIn; it seems like a goldmine for connecting with Product Managers and Directors. I’ll definitely think about that Growth Engine concept you mentioned—sounds like a good structure to keep everything on track as I build my client base! Appreciate the offer to help!",
              "score": 2,
              "created_utc": "2026-02-07 16:58:11",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4fpx1e",
                  "author": "Proud_Reality_3817",
                  "text": "Sure ! If you want I'll be hosting a weekly group coaching this thursday from 6pm to 9pm and I was thinking of explaining the use and development of Growth Engines in more details, since it seems like it could be useful to many. So yeah if you want to join in and do it together so I can answer any question on the way I'd be happy to send you the link to the discord server ?",
                  "score": 1,
                  "created_utc": "2026-02-09 14:20:39",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3wngy8",
          "author": "Gary-Barber-SCORE",
          "text": "The magic begins before you start the business. It’s called market research. That is where you talk with candidate clients to figure out if there is demand for your service, what form the service should take, and in this process you learn how to make contact with your customers. I always tell would be entrepreneurs, “if you can’t talk with them before you start a business, it will be even harder when you’re trying to sell them something!”\n\nDo you have a repeatable methodology for your service? Goals are pretty hollow without execution. So how do you propose to ensure execution?  Maybe you should use Eventbrite to setup a time to present your methodology, or MeetUp. It’s hard to get traction before you have success stories, and that will take some time to accumulate.",
          "score": 1,
          "created_utc": "2026-02-06 14:27:56",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qxevno",
      "title": "I executed on the idea of \"Zapier for Hackers\"",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1qxevno/i_executed_on_the_idea_of_zapier_for_hackers/",
      "author": "Deep-Bandicoot-7090",
      "created_utc": "2026-02-06 11:14:21",
      "score": 7,
      "num_comments": 1,
      "upvote_ratio": 1.0,
      "text": "I always saw people asking for a way to automate security testing without writing scripts. The idea was simple: \"Make it visual.\"\n\nSo we actually built it.\n\nIt’s called **ShipSec Studio**. It allows you to build security pipelines using a visual node editor. You can use it to automate bug bounties, cloud audits, or just check your home lab.\n\nWe just open-sourced the code today.\n\n**Repo:**[github.com/shipsecai/studio](https://github.com/shipsecai/studio)",
      "is_original_content": false,
      "link_flair_text": "Idea Feedback",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1qxevno/i_executed_on_the_idea_of_zapier_for_hackers/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o48dgnd",
          "author": "raxblackwood",
          "text": "Imma check it out",
          "score": 1,
          "created_utc": "2026-02-08 10:32:24",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qyu20r",
      "title": "Business Idea Feedback - Mens Mentoring Group?",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1qyu20r/business_idea_feedback_mens_mentoring_group/",
      "author": "UnusualAd3207",
      "created_utc": "2026-02-08 00:20:13",
      "score": 7,
      "num_comments": 5,
      "upvote_ratio": 0.78,
      "text": "This might sound harsh but.. I don't think there's a male loneliness epidemic going on right now, I think there's just a male loser epidemic\n\nGuys need to focus on improving themselves and building a lifestyle that attracts what they want\n\nWomen, friends, business opportunities, etc\n\nIn 2023 I sold my tech company for a lot of money, and I invested heavily into self improvement\n\nBecause even though I now had money, I was a loser in basically every other area of life.\n\nI was a shy tech nerd who was super insecure about my looks, had basically zero confidence, zero success with women, out of shape, etc\n\nLearning how to communicate, learning how to be confident in social situations, learning out to dress for my body, have style, how build attraction with women beyond looks, getting in shape, and maximizing my potential as a man has dramatically improved my life.\n\nI find it easy to make friends, business people reach out to me often, women comment on my IG posts and DM me often (something that Iv'e never ever experienced in life)\n\nAll because I improved my lifestyle, I think that's the key, if you do that, everything you want will be attracted to you, you wont have to chase it.\n\nBe an attractor not a fisherman. Stop chasing..\n\nSo Iv'e been thinking about putting together a group mentoring program for men, because I think so many need it so bad\n\nGirls Dm's are filled with out of shape broke dudes who are totally desperate and it's sad.\n\nI'd bring in experts to teach different areas. Like starting / growing a business, dating, communications coaches, social dynamics, looksmaxxing, style consultants, nutrition / diet, fitness, financial literacy / investing, etc.\n\nBasically all the areas in which I think men should be maximizing to get ahead in life\n\nI'd host it in some kind of community app like Discord or Skool, and do weekly group calls\n\nThoughts? Good idea? Bad idea? Something no one would probably care about and I'm one of the rare people that cares so much about improving all those areas? lmk!\n\nThis is just a thought, nothing in motion yet, so not promoting",
      "is_original_content": false,
      "link_flair_text": "Idea Feedback",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1qyu20r/business_idea_feedback_mens_mentoring_group/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o46ah68",
          "author": "Ok_Rock_8421",
          "text": "If discord doesn’t work or you have a problem getting traction start with social media posts and build funnels to the discord server",
          "score": 1,
          "created_utc": "2026-02-08 00:49:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o49bbmn",
          "author": "Good-Work2301",
          "text": "I would host it in Skool. Would attract like minded men.",
          "score": 1,
          "created_utc": "2026-02-08 14:42:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o49o8tj",
          "author": "ChestChance6126",
          "text": "I get the instinct, but the framing matters more than the mechanics here. There is demand for men wanting structure and accountability, but the second it smells like contempt for the audience, conversion and retention drop fast. What tends to work better is positioning around skills and outcomes, social confidence, health, and career leverage, rather than diagnosing people as broken. Also worth pressure testing if this is really a mentoring program or a curriculum plus community, those are very different beasts operationally. I would validate with a small paid cohort and one or two core tracks first, instead of boiling the ocean. The idea itself is not crazy, but the edge is in execution and tone, not the concept.",
          "score": 1,
          "created_utc": "2026-02-08 15:50:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4d3otq",
          "author": "Ecaglar",
          "text": "the framing matters here. \"loser epidemic\" will alienate your exact target audience before you even start. position around skills and outcomes not contempt",
          "score": 1,
          "created_utc": "2026-02-09 02:24:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ix5cm",
          "author": "Ecaglar",
          "text": "the willingness to pay is the hard part here. most guys who want mentoring also dont have money. and the ones with money usually want 1on1 coaching not group stuff",
          "score": 1,
          "created_utc": "2026-02-09 23:53:15",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qwxa0y",
      "title": "Most founders don’t fail because of execution. They fail before they start.",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1qwxa0y/most_founders_dont_fail_because_of_execution_they/",
      "author": "Calm_Parking_8939",
      "created_utc": "2026-02-05 20:53:53",
      "score": 7,
      "num_comments": 8,
      "upvote_ratio": 0.82,
      "text": "When you start a company, nobody really tells you where to begin.  \nYou read advice. You copy templates. You look at competitors.  \nBut most of it assumes you already know what kind of business you want to build.  \n  \nThe hardest part is not writing a business plan.  \nIt’s aligning the business with who you actually are.\n\nIf your plan forces you into a role you don’t believe in, you might survive short term.  \nLong term, burnout does the killing.\n\nHow did you decide what kind of business you were really building?",
      "is_original_content": false,
      "link_flair_text": "Marketing / Operational / Financial / Regularotry Advice sought",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1qwxa0y/most_founders_dont_fail_because_of_execution_they/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o3upn6b",
          "author": "indexintuition",
          "text": "for me, it really started with what felt manageable alongside family life. i knew i wanted something small, something i could test in short bursts while the kids were at school or asleep. i spent a weekend just sketching ideas that didn’t feel overwhelming, then picked one that felt doable rather than “perfect.” over time, i refined it based on what actually worked and what didn’t drain me. it made launching something small feel less scary and more realistic.",
          "score": 2,
          "created_utc": "2026-02-06 05:23:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3xd44y",
          "author": "Money-Cover",
          "text": "I can’t stress this enough: nothing, and I truly mean NOTHING, matters more than a business that aligns with you personally from a skill, personality, and value position.\n\nWhen things get tough, and they will, the drive comes from within when you’re building something you believe in, that aligns with you personally, and that excites you. \n\nObviously there are caveats e.g., I like Pepsi zero, but I’m not going to try and start a company to produce it; I like Porsche cars, I’m not going to start a company to build one. You have to be realistic in goals and expectations, but having something that aligns with you is the greatest tool for surviving and growth.",
          "score": 1,
          "created_utc": "2026-02-06 16:32:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4hpkb2",
          "author": "storysherpa",
          "text": "The value in creating a business plan is the business planning that you do to make it. It’s not in the document that you end up with. You can have an AI generate a business plan for you, but that doesn’t mean you understand what the business is or how to operate it. So planning is a verb… It’s an activity. A “plan“ is a thing that comes out of planning, it’s a noun.\n\nIf you acquire a business plan, but don’t understand the business, how are you going to make decisions about that business when things happen? Because things will happen. And you’ll have to make a decision about what to do. And then deal with the results of that decision. And the one after that… And so on and so on. That’s what it’s actually like to run a business. The business plan doesn’t make the business, the decisions you make along the way makes the business. Or not.",
          "score": 1,
          "created_utc": "2026-02-09 20:10:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3shmy1",
          "author": "radjackmalone",
          "text": "I think people need to totally throw out the generic advice online that includes starting a business plan. Any fool can use chatGPT to write one but not everyone can execute it successfully. So I say skip it.",
          "score": 1,
          "created_utc": "2026-02-05 21:34:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3t1f57",
              "author": "joeasks",
              "text": "I am a believer in building a financial model, unless you've got an extremely passionate why. Business plans can be helpful, especially if you do the work yourself",
              "score": 1,
              "created_utc": "2026-02-05 23:14:50",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o3xkf6b",
              "author": "Delicious-Pin7594",
              "text": "\n\nDo you really think ChatGPT is good for building a business plan?\nFrom my experience, it starts hallucinating pretty fast… and the plan quickly becomes inconsistent.\nFor me, the value of a business plan isn’t the document itself, it’s the reference points it creates. It helps structure your thinking and check whether you’re actually moving on a coherent trajectory.\nWithout that, you’re executing… but without a compass.",
              "score": 1,
              "created_utc": "2026-02-06 17:07:11",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qvxp4p",
      "title": "Tips for New Importers, Finding Reliable Suppliers and Avoiding Scams",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1qvxp4p/tips_for_new_importers_finding_reliable_suppliers/",
      "author": "KhabibNurmagomedov_",
      "created_utc": "2026-02-04 19:08:15",
      "score": 6,
      "num_comments": 4,
      "upvote_ratio": 0.88,
      "text": "Hi everyone, I’m just starting out with importing products and want to make sure I avoid common mistakes. One of my biggest concerns is finding suppliers that are reliable and steering clear of scams. I’ve heard of platforms like Made in China, it’s a platform similar to Alibaba and also a B2B platform but I’m not sure how to properly evaluate a supplier or what warning signs to look for.\n\nIf you have experience with importing, I’d love to hear how you verify suppliers, how you build trust before placing an order, and any tips you have for someone new to this process. Your advice and experiences would be really helpful!",
      "is_original_content": false,
      "link_flair_text": "Marketing / Operational / Financial / Regularotry Advice sought",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1qvxp4p/tips_for_new_importers_finding_reliable_suppliers/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o3kzakq",
          "author": "springcaterpillar",
          "text": "A few things that helped when sourcing: start with small test orders before committing to volume. Request video calls with the factory, legit ones are usually willing. Check how long they've been on the platform and look for reviews from buyers in your region. Ask for references from other customers. Trade Assurance or similar payment protection is worth the fees for first orders. Warning signs: pressure to pay outside the platform, prices way below market, inconsistent communication, and reluctance to show production. Alibaba tends to have more verified suppliers than Made in China in my experience, but either works if you do your due diligence.",
          "score": 1,
          "created_utc": "2026-02-04 19:14:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3nk499",
          "author": "iwonderthesethings",
          "text": "I have been doing this for over 26 years - before the internet even became a thing to source with. So I 'm quite the expert on vetting suppliers and starting a brand with product dev from start to finish. There is so much to know, it's not funny. My own experience cost me tens of thousands - if not hundreds of thousands - of lost dollars, but it was priceless to know. I sold my business a few years ago and while I wait to launch my new offering, I figured I'd launch a web app to help others, which will include suppliers I've personally vetted as well on how to vet new ones yourself, along with other info. I'll be charging from $99 for this app. Would you pay for something like this?",
          "score": 1,
          "created_utc": "2026-02-05 03:20:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3pu16f",
          "author": "ChestChance6126",
          "text": "Don’t rely on marketplace badges alone. Always order a paid sample matching your exact specs and treat the first bulk run as a test, not a profit order. Also, ask for recent production or inventory videos and verify business registration. Most issues aren’t scams, they’re quality drift or miscommunication, which clear written specs and QC checks usually prevent.",
          "score": 1,
          "created_utc": "2026-02-05 13:59:12",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qy4sdt",
      "title": "Do you need an LLC to sell online?",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1qy4sdt/do_you_need_an_llc_to_sell_online/",
      "author": "Vengsta",
      "created_utc": "2026-02-07 04:59:30",
      "score": 6,
      "num_comments": 5,
      "upvote_ratio": 0.88,
      "text": "Hey everyone,  \n  \nSo I’ve been thinking about starting a small online store selling handmade pens. I’ve been doing a ton of research, but I keep going back and forth on whether I need to form an LLC or if I can just start selling as a sole proprietor.  \n  \nHere’s the thing, I’m not planning to quit my day job anytime soon, and I’m starting super small. Like, maybe $500 in sales a month if I’m lucky. But I’ve heard horror stories about people getting sued or having their personal assets at risk because they didn’t have an LLC. On the other hand, I don’t want to overcomplicate things or spend money on legal fees if it’s not necessary right now.  \n  \nMy cousin started selling vintage clothes on Etsy a few years ago and never bothered with an LLC. She was doing pretty well until someone claimed they got a rash from one of her sweaters (turned out they were just allergic to wool, but still). She ended up settling out of court, and it was a huge headache. Now she swears by her LLC, but I’m not sure if her situation applies to me.  \n  \nSo, do I need an LLC from the start, or can I wait until I’m making more money? For those of you who sell online, did you start with an LLC or wait until later? Any advice would be super appreciated.",
      "is_original_content": false,
      "link_flair_text": "Marketing / Operational / Financial / Regularotry Advice sought",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1qy4sdt/do_you_need_an_llc_to_sell_online/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o41h72y",
          "author": "Apprehensive_Yam1771",
          "text": "Hey! you don't need an LLC to start, but it can be beneficial once you have consistent sales or more risk.\n\nI started my own Etsy store a while ago, on the side, and what you can do, is register as a sole proprietor. It's simple, and free, but make sure to report the income on your regular taxes. \n\nThe reason you'd want to open an LLC, is to have limited liability. If someone sues your business, an LLC helps keep your personal assets (like your car, savings, etc.) separate from the business. That’s what your cousin’s situation was really about.\n\nSince it's a small business, and you're selling handmade pens specifically, your risk is relatively low, and I would definitely recommend starting as sole proprietor. If later on you decide to go full in, it might be a good idea to open an LLC once you’re making steady money or scaling up.\n\nPS. If you need help building a website or want marketing/advertising services, feel free to reach out ;)",
          "score": 2,
          "created_utc": "2026-02-07 06:34:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o41ic4e",
              "author": "AaronDoud",
              "text": "To add to this one should always understand two principals when talking about how an LLC/Corp limits liability.\n\nFirst is the idea of piercing the veil which is the legal point that the courts can choose to let a lawsuit of an LLC/Corp go directly after personal assets.  This normally happens when the corp is closely held by one or a small number of owners and said owner(s) are directly involved.\n\nSecond is they can always sue you personally even if you are just an employee. \n\nA lot of advice to small and/or new business way overhype the protection you get from an LLC.   If they sue they will go after your personal assets and nothing will stop that if you are a solo owner working in the business.  Any lawyer worth his salt will at least sue the owner in addition to the business.  \n\nLoads of reasons to have an LLC but the \"limited liability\" part needs to be framed correctly.\n\nMost small and especially new businesses have no reason to be LLCs when they are basically a relatively low paid job for the owner/worker.  \n\nOnce you get bigger, have employees, and/or have tax or other reasons to then get an LLC or other corp.",
              "score": 1,
              "created_utc": "2026-02-07 06:45:14",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o44y5ww",
          "author": "BusinessAnywhereio",
          "text": "You do not need an LLC to sell online. In most states you can start today as a sole proprietor and report the income on your personal taxes.\n\nWhat an LLC does (and doesn’t) do:\n\n* It can help separate business liabilities from your personal assets, if you run it properly.\n* It does not stop someone from suing you. It just changes what’s typically at risk.\n* If you mix funds, skip basic paperwork, or personally cause harm (negligence), the “shield” can be weaker.\n\nFor handmade pens, the bigger early risks are usually practical, not legal structure:\n\n* Sales tax and permits: you may need a sales tax permit and to collect/remit sales tax depending on where you sell and where buyers are.\n* Local business license and a DBA/fictitious name filing if you sell under a shop name.\n* Product liability: consider simple product liability insurance once you’re shipping regularly, especially if you use finishes, adhesives, or include small parts.\n\nA common path (and what we see at BusinessAnywhere) is:  \nStart as a sole proprietor with a separate bank account and clean records, then form an LLC once sales are consistent, you’re taking larger orders, or you’re worried about personal asset exposure.",
          "score": 2,
          "created_utc": "2026-02-07 20:14:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o48za6i",
          "author": "WrestlingDadPA",
          "text": "You don't \"need\" an LLC, you'll most likely never get sued anyway... and a cheap insurance policy protect you there. However, an LLC is a cleaner business entity, and you want to separate your business money (with a checking account and separate taxes) from personal, and an LLC costs $125 and about an hour of your time. No legal fees required, it's honestly super super easy. ChatGPT will walk you right through it, along with the ancillary steps of opening accounts, getting your EIN number, etc. I would never have a sole proprietorship, I have multiple LLC's and S-corps.",
          "score": 2,
          "created_utc": "2026-02-08 13:30:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o426ypg",
          "author": "Firm-Organization374",
          "text": "I would love to design your professional logo.",
          "score": 1,
          "created_utc": "2026-02-07 10:42:23",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qzqadh",
      "title": "Two business ideas I would love feedback on:",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1qzqadh/two_business_ideas_i_would_love_feedback_on/",
      "author": "Apricotsandtoast",
      "created_utc": "2026-02-09 00:59:56",
      "score": 6,
      "num_comments": 9,
      "upvote_ratio": 0.88,
      "text": "1.)  I live in a suburb of Chicago.  Weather is terrible, all our cars look terrible most of the time but I still like to get my car washed regularly.  Other unrelated fact: shopping centers are suffering.  I live near Oak Brook mall and I would LOVE if a car wash service posted up in one of the parking garages.  It feels archaic to have to go to some random car wash and just sit there and wait.  I understand this probably does take place in certain areas of the US but not near me!  I know there are also mobile car washes but not near me...especially in the winter.  I would love to either be home or able to run a few errands such as at a mall while my car was getting washed.  I know at some large corporate buildings they offer this in their parking garages but people are working onsite less so I could see a need for this.  Plus, I would think the shopping malls would cut a deal on the real estate required because it would bring in more traffic.  I would happily go to the mall and walk around (probably end up buying something) if this existed.  Thoughts?\n\n2.)  I think there should be some type of app where people can anonymously upload their budget spreadsheets.  You'd also need to fill in your annual household income.  I think it would be incredibly helpful to look at other people's budgets that have a similar household income as me.  My husband and I argue about what our annual budget should be.  We have SO much in savings (a lot a lot) and he constantly thinks we should be saving more.  I think let's enjoy life a little more.  Quick background, when he grew up his house was foreclosed on so I think he operates from a place of fear and saving brings him SUCH comfort.  So we have done a good job at that for a long time but, at a certain point, at what cost?  I think it would be helpful to compare and understand spending statistics of other similar families.  I also think people that are poor with savings could really learn from how other families do it.  Thoughts?",
      "is_original_content": false,
      "link_flair_text": "Idea Feedback",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1qzqadh/two_business_ideas_i_would_love_feedback_on/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o4ebm7q",
          "author": "BigShinyTrees09",
          "text": "There’s one of these mall car washes where I live - I use it all the time, it’s in a really crappy corner of the parking garage that went unused previously. They have something called a ‘rainy day special’ for when the weather is bad: a deal on both the interior and exterior cleaning. It’s fast, cheap and convenient. \n\nReal world ‘messy’ businesses always do better than apps. But be unique, and don’t stop when it gets hard. Just. Keep. Washing. \n\nA few name ideas:\n\nLot Wash\nPark & Polish\nStall Scrub\nMall Wash Pros\nShop n’ Scrub",
          "score": 2,
          "created_utc": "2026-02-09 07:29:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4d6ex7",
          "author": "theredhype",
          "text": "I haven't seen an app like that. But here are some real world examples published by YNAB budgeting software. You're right. It's very interesting to see different types of people's budgets. \n\nhttps://www.ynab.com/category/real-examples",
          "score": 1,
          "created_utc": "2026-02-09 02:38:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4dbe3w",
              "author": "Apricotsandtoast",
              "text": "Very interesting.  Thanks for the link!",
              "score": 1,
              "created_utc": "2026-02-09 03:04:26",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4e3zuh",
          "author": "vonGlick",
          "text": "1) I know one place in Helsinki, Finland like that. I think it makes a lot of sense.\n\n2) For this one to draw any reasonable conclusions you need huge scale. Even if you take another family in Chicago. Do they have as much saving as you? Are they having same number of kids? Are they similar age? Do they own property? If you take number of parameters you would need to compare you would find out you need hundreds of thousands of people before you get enough similar families to draw meaningful conclusions.",
          "score": 1,
          "created_utc": "2026-02-09 06:20:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ix0l1",
          "author": "Ecaglar",
          "text": "pick one. seriously. two ideas = half the focus on each. which one do you find yourself thinking about more when youre not working?",
          "score": 1,
          "created_utc": "2026-02-09 23:52:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4k2dx6",
              "author": "Apricotsandtoast",
              "text": "I think the car wash would be easier to make successful.  I'm at the very beginning stages...it's really just an idea at this point but I think my next step would be to talk to the shopping center.  To be completely frank, I don't know that much about the car wash business.  I do know of a top quality car wash chain near me that is family owned.  It crossed my mind to talk to them as well but I don't quite know how to do it without them just taking my idea and doing it without me.  ",
              "score": 1,
              "created_utc": "2026-02-10 03:56:16",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4jcag1",
          "author": "gjr23",
          "text": "What sort of capital do you have access to? These seem vastly different from a start up cost standpoint and maybe your decision is already then made?",
          "score": 1,
          "created_utc": "2026-02-10 01:19:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4d3g6e",
          "author": "Ecaglar",
          "text": "the mall car wash idea is solid - you solve the waiting problem AND drive traffic to a dying retail format. malls would probably cut a deal because theyre desperate for foot traffic. the budget app has validation issues tho - people lie about money and the shame factor would kill adoption",
          "score": 0,
          "created_utc": "2026-02-09 02:23:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4dauu3",
              "author": "Apricotsandtoast",
              "text": "But wouldn't the anonymous factor of the budget app eliminate the need/desire to lie and the shame?",
              "score": 1,
              "created_utc": "2026-02-09 03:01:43",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qxw0tr",
      "title": "I built an idea from this subreddit and it got 50 users within a week.",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1qxw0tr/i_built_an_idea_from_this_subreddit_and_it_got_50/",
      "author": "dot90zoom",
      "created_utc": "2026-02-06 22:28:02",
      "score": 6,
      "num_comments": 4,
      "upvote_ratio": 0.67,
      "text": "There are some serious goldmines on this subreddit.\n\nLast week I built an idea that was posted a few times throughout this subreddit, and mainly a mix of ideas, [here](https://www.reddit.com/r/Business_Ideas/comments/1gwipgp/aipowered_microskill_learning/), [here](https://www.reddit.com/r/Business_Ideas/comments/1jrki4k/selling_my_2yo_saas_learningwithai/) and [here](https://www.reddit.com/r/Business_Ideas/comments/1gwipgp/aipowered_microskill_learning/).\n\nThe app is basically \"Duolingo for Anything\".\n\nIt took me \\~4months to build, even with my degree in ML, there were a lot of challenges as I really wanted to ensure that the courses generated were Quality and built around the user's learning habits, the more the user used the app.\n\nEventually if this thing grows, I hope to have a mix of both real generated courses that users can submit, as well as AI courses for more niche topics. I wanted to know if you guys think this would be a good idea, and business model, perhaps teachers getting a commission off courses they submit (and are used).",
      "is_original_content": false,
      "link_flair_text": "Idea Feedback",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1qxw0tr/i_built_an_idea_from_this_subreddit_and_it_got_50/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o4d3s0k",
          "author": "Ecaglar",
          "text": "50 users in a week from an idea you found here is actually a good sign. most people never ship anything. what matters now is whether those 50 are using it consistently or just signed up and bounced",
          "score": 1,
          "created_utc": "2026-02-09 02:25:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o40xckg",
          "author": "Ecaglar",
          "text": "50 users in a week is solid validation. the teacher commission model is interesting but youd need to figure out quality control - ai generated stuff can be hit or miss and if you mix in human courses youll need some way to verify theyre actually good. curious what your retention looks like after week one, thats usually where learning apps struggle",
          "score": 0,
          "created_utc": "2026-02-07 04:00:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3zh852",
          "author": "tatum103",
          "text": "I’m diagnosed with adhd, so I feel like this could help me with my studies. do you mind giving me the name?\n\nalso yes, if there the human submitted courses, they will be more tailored for humans",
          "score": -2,
          "created_utc": "2026-02-06 22:45:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3zi7k2",
              "author": "dot90zoom",
              "text": "[sure, here's the App Store link](http://trycoursify.com)  \n  \nfeel free to give feedback, its still new so tell me any thing wrong\n\nit has a free trial. I will add a freemium model as it grows but currently ai credits are expensive, so I need to stay even ;-;",
              "score": -1,
              "created_utc": "2026-02-06 22:50:39",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qxfhso",
      "title": "21yo Merchant Mariner saving up capital. Want to build a business/invest but I’m at sea 6 months a year. Where should I start?",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1qxfhso/21yo_merchant_mariner_saving_up_capital_want_to/",
      "author": "Fuzzy_Examination_96",
      "created_utc": "2026-02-06 11:48:05",
      "score": 6,
      "num_comments": 5,
      "upvote_ratio": 1.0,
      "text": "Hi Reddit! I’m 21, and I work as a sailor. My job keeps me away at sea for long periods, which gives me two things: a decent salary to invest and a lot of time to think/learn, but zero physical presence on land.\n\nI don’t want to be a sailor forever. I want to build a business that I can eventually scale or manage remotely.\n\nI have no physical access to a shop/office for months.\n\nSaving up a good portion of my income.\n\nI have never run a business before. \n\nWhat kind of business models would you recommend for someone with my lifestyle? Should I focus on high-yield investments, or start building a digital brand/agency while I’m on watch? I’d love to hear some \"out of the box\" ideas",
      "is_original_content": false,
      "link_flair_text": "What business do I start?",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1qxfhso/21yo_merchant_mariner_saving_up_capital_want_to/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o3zb9kr",
          "author": "choclate45",
          "text": "a service based agency model could be your best bet for now. add that to the investments you are already doing and you should be set for when you retire/deboard in the next 5 years.\n\njust play around with your skills and interest when you off watch, groom them to the degree that you confident to render a service and start from there. also, please don't grind too much in your off hours, safety at sea is paramount. ahoy!",
          "score": 1,
          "created_utc": "2026-02-06 22:14:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3zfgu0",
          "author": "Ok_Stay_8530",
          "text": "Do you have any skills / experience that you can productitize for a specific niche?",
          "score": 1,
          "created_utc": "2026-02-06 22:36:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o405icc",
          "author": "Solid_Mongoose_3269",
          "text": "Stay a merchant mariner. My dad was a chief engineer, and barely got his white jumpsuit dirty. Ai isn’t coming after those jobs",
          "score": 1,
          "created_utc": "2026-02-07 01:04:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o40xeob",
          "author": "Ecaglar",
          "text": "your constraint is actually an advantage for certain business models. anything that can run async while youre at sea is perfect. content sites, digital products, or investing in index funds all work. the agency model mentioned by another commenter is tricky because clients usually want fast responses. id lean toward building something with your unique perspective - content about life at sea, or tools for other mariners. you know that world way better than anyone on land",
          "score": 1,
          "created_utc": "2026-02-07 04:00:58",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qwzra3",
      "title": "Would you guys invest in this?",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1qwzra3/would_you_guys_invest_in_this/",
      "author": "Adventurous-Rub-6980",
      "created_utc": "2026-02-05 22:26:13",
      "score": 5,
      "num_comments": 9,
      "upvote_ratio": 0.74,
      "text": "I’m not asking for money or trying to promote anything. I just want honest feedback on a business idea.\n\nI’m considering starting a small business selling rings made from recycled car parts or meteorite materials. I’ve already found manufacturers that can produce these, and the idea is to focus on unique, story-driven pieces made from unconventional materials.\n\nDo you think there’s a market for something like this? I’d appreciate any thoughts on demand, pricing, or potential challenges before I go further with it.",
      "is_original_content": false,
      "link_flair_text": "Idea Feedback",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1qwzra3/would_you_guys_invest_in_this/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o3st4ov",
          "author": "gridsandorchids",
          "text": "There's already tons of businesses that do this.",
          "score": 4,
          "created_utc": "2026-02-05 22:31:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3t12rp",
              "author": "Adventurous-Rub-6980",
              "text": "Like what",
              "score": 0,
              "created_utc": "2026-02-05 23:12:58",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3td4xn",
                  "author": "scooter950",
                  "text": "Download an app called Shop. Its a blueish/purple color. It's legit, a lot of brands/retailers use it. You can search for an item and the results are retailers that sell what you searched.\n\nIt's funny this came across my feed because just last night I was scrolling for a new wedding band and the amount of brands that sell rings are crazy.",
                  "score": 2,
                  "created_utc": "2026-02-06 00:20:54",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o4h1o5t",
                  "author": "gridsandorchids",
                  "text": "Literally google \"material rings\". Tons of em.\n\nwww.thorum.com\nwww.patrickadairdesigns.com\nwww.ritani.com\nwww.stagheaddesigns.com\n\nThere's even one that let's you customize your own designs:\n\nwww.revolutionjewelry.com",
                  "score": 1,
                  "created_utc": "2026-02-09 18:15:03",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3wk67g",
          "author": "ChestChance6126",
          "text": "There’s likely a niche market, but the risk isn’t demand, it’s differentiation and trust. “Unique materials” get attention, but buyers care about craftsmanship, the legitimacy of the materials, and the story being verifiable. Before scaling, I’d test willingness to pay with a few SKUs and real proof points, not just interest.",
          "score": 1,
          "created_utc": "2026-02-06 14:10:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3x0xz5",
          "author": "Extra_Intro_Version",
          "text": "This would make an art fair booth. \n\nWould you understand whether the properties of the materials are suitable to their intended usage?\n\nLike, not all metals are compatible with human skin. Is engine block iron good to be on your finger? Or vehicle frame steel? Or whatever rando metal parts get melted down? How much gold, silver or stainless steel are you expecting to find on a car?\n\nI was at an art fair where a guy was selling really beautiful knives made from steel reclaimed from a well known suspension bridge. Cool concept- but he had no clue whatsoever if that steel was suitable for a functional knife. 0 knowledge of metallurgy- hard pass, bro. \n\nI’ve seen cool art pieces made from multiple coats of built up paint reclaimed from historical-ish factory machinery and walls. Any idea what chemicals are in that paint dating back 100 years? Nope. Hard pass again.",
          "score": 1,
          "created_utc": "2026-02-06 15:35:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o40xgty",
          "author": "Ecaglar",
          "text": "the other commenter is right that theres competition already but that doesnt mean its saturated. the story-driven angle is key - you need to make the sourcing verifiable and interesting. like if you can say \"this ring was made from the engine block of a 1967 mustang that drove 200k miles\" thats way more compelling than just \"recycled car parts\". the meteorite angle is harder to verify and has more trust issues. id start with car parts where you can trace the origin",
          "score": 1,
          "created_utc": "2026-02-07 04:01:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4jtzy8",
          "author": "Perfect-Amount5338",
          "text": "The question here is how much you need to invest - if it’s a couple thousand to do a POC and test the waters, go for it. \n\nEvery business has competition - don’t let people here tell you “plenty of people” do it.",
          "score": 1,
          "created_utc": "2026-02-10 03:03:31",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qx3qrg",
      "title": "Match-3 attack game",
      "subreddit": "Business_Ideas",
      "url": "https://i.redd.it/viwxxtevxrhg1.png",
      "author": "Recent_Jellyfish2190",
      "created_utc": "2026-02-06 01:15:22",
      "score": 5,
      "num_comments": 0,
      "upvote_ratio": 0.86,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "App/Website Idea",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1qx3qrg/match3_attack_game/",
      "domain": "i.redd.it",
      "is_self": false,
      "comments": []
    },
    {
      "id": "1qzwoyz",
      "title": "I’m building a tool to automate employee onboarding & follow-ups would this actually help managers and employees?",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1qzwoyz/im_building_a_tool_to_automate_employee/",
      "author": "Original_Map3501",
      "created_utc": "2026-02-09 06:18:39",
      "score": 5,
      "num_comments": 3,
      "upvote_ratio": 0.78,
      "text": "I’m working on a lightweight tool to improve how onboarding and training actually happen in real teams, and I’d really value honest feedback from managers and employees.\n\nThe problem I keep seeing is not a lack of docs or training content, but the **mental load** around onboarding:\n\n* Managers forgetting who needs what next\n* Employees unsure what to do after the first few days\n* Constant manual follow-ups (“did you read this?”, “did you finish that?”)\n* Progress scattered across docs, Slack, and memory\n\n# The idea:\n\nA system that quietly handles onboarding **in the background**.\n\n* Managers provide their existing content (docs, links, videos)\n* New hires automatically receive steps in the right order\n* The system tracks progress\n* Follow-ups are sent automatically if someone gets stuck\n* Managers are only notified when something actually needs attention\n\nNo heavy dashboards, no daily checking just fewer things to remember.\n\n# I’m trying to validate:\n\n* As a **manager**, would this reduce the mental effort of onboarding?\n* As an **employee**, would this make it clearer what you need to do next?\n* What part of onboarding causes the most frustration today: tracking progress, follow-ups, or clarity?\n\nI am trying to understand if this solves a real problem or if I’m missing something obvious.",
      "is_original_content": false,
      "link_flair_text": "Idea Feedback",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1qzwoyz/im_building_a_tool_to_automate_employee/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o4e7zcm",
          "author": "PPRec",
          "text": "This is a genuine problem. I actually was given a talk from someone because attrition of young people in my industry is an issue as they have been used to a parenting style that lays out the steps they need to take / clears a path for them and they are being managed by managers who are often super busy who assume they can 'work it out' or are too busy to spend time thinking properly about how to manage early stage careers. This is no poke at young people btw it's our challenge to manage better. I guess my feedback is be careful to not build something that feels too impersonal for the new employee though. More of an aid for the manager.",
          "score": 2,
          "created_utc": "2026-02-09 06:55:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ggzvu",
          "author": "restacked_",
          "text": "We built a tool for my employer that does things similar. Lets them design and build workflows with approval processes and such. Multi-tenancy so our different clients could all use it for their onboarding processes. It’s an internal tool, but we built it for very large clients of ours, there is appetite for this king of tool. Good luck!",
          "score": 2,
          "created_utc": "2026-02-09 16:37:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4iwy9j",
          "author": "Ecaglar",
          "text": "onboarding tools are saturated but if you nail a specific niche like healthcare or construction where compliance is a mess it could work. generic hr tools are a tough sell tho",
          "score": 2,
          "created_utc": "2026-02-09 23:52:11",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qv1klq",
      "title": "Lemonade/beverage company opinions needed",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1qv1klq/lemonadebeverage_company_opinions_needed/",
      "author": "itsway2spicy",
      "created_utc": "2026-02-03 19:27:23",
      "score": 4,
      "num_comments": 22,
      "upvote_ratio": 0.7,
      "text": "A pipe dream of mine is starting a beverage company, starting with lemonade. But the name would be “Lemonayy”. The “-ayy” replacing “-ade” because I believe “ayy” is culturally relevant thanks to the internet and pop culture. My friends and I growing up would always say “ayy” to celebrate a success or even just say what’s up to each other. My family would always say “ayy” when we walked in the front door on holidays. I guess it’s slang, but it makes me smile just saying it and perhaps consumers would feel the same. It strikes an emotional chord. \n\nI have the Lemonayy recipe nailed down that focuses on lower sugar and all organic ingredients so the goal is to remain a healthier RTD beverage targeting younger people more present on the internet (which is a lot). I’ve actually went out in public with my Lemonayy stand and had about 50 or so people try it and with good feedback overall on the taste.\n\nLiquid Death has done this with water, so it’s a “similar” approach. Clever marketing, nothing revolutionary other than the name itself.\n\nThe goal is to create a cult following of Lemonayy drinkers lol. I think most beverage companies operate with the same goal for their product.\n\n“Do you drink lemonade?” \n\n“Nah I drink Lemonayy.”\n\nAnd then other flavors could come into the mix like Blueberrayy, Watermelonayy, Raspberrayy, Strawberrayy, etc. Perhaps even an alcoholic product like Champayygne.\n\nThe names are almost so chaotic and goofy it would have to grab attention.\n\nI’m in the infancy stage of making this a real business and I’m obviously biased thinking this could work, but is anyone in here willing to chime in on their thoughts and opinions? I know CPG and consumables like this are saturated and a tough market so if anyone is currently in that industry I’d love your feedback too.",
      "is_original_content": false,
      "link_flair_text": "No applicable flair exists for my post",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1qv1klq/lemonadebeverage_company_opinions_needed/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o3enjmf",
          "author": "Perfect-Hair9708",
          "text": "A lot of beverage companies modernizing “regular” drinks like sodas and all, try to go beyond the organic and low sugar offer. They now tap into proper health benefits by adding prebiotic like olipop or poppi. Maybe you want to think about an ingredient that can bring additional health benefits without it altering the taste (bonus if it improves the taste).\n\nElse I like the Lemonayy vibe",
          "score": 2,
          "created_utc": "2026-02-03 20:34:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3enyjy",
              "author": "itsway2spicy",
              "text": "Ayy I appreciate the feedback. Was thinking about adding more electrolytes than the usual amount that lemons provide.",
              "score": 1,
              "created_utc": "2026-02-03 20:36:47",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3epjll",
                  "author": "Perfect-Hair9708",
                  "text": "That’s what I am talking about. It’s summer, you want to enjoy a sweet drink (maybe a lil alcohol mix ) in the hot summer but don’t want to get dehydrated. Boom! Lemonayy. \n\nYou’re running long distance, need sugar and electrolytes to keep you energized but don’t want to drink the traditional “yuck” taste electrolytes tabs. Boom! you get some Lemonayy to enjoy taste and hydration.",
                  "score": 1,
                  "created_utc": "2026-02-03 20:44:15",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o3fzf02",
                  "author": "TaskLemonade",
                  "text": "I agree with this—I appreciate the Liquid Death comparison but I don’t think it holds up. What makes them unique is the hardcore spin on water. Giving someone who doesn’t drink something to hold onto at parties that blends in and still looks punk. They took a super small niche and blew it up to a name brand. Difficult to do, and it doesn’t sound like something you could compare to. \n\nHowever, comparing your brand to Olipop is perfect. Take after their story. It gives you the competitive edge that helps you stand out from the big names. \n\nAdding electrolytes is the key in my opinion. I can already picture an ad, a play on the traditional vibe of a hardworking man outside in the sun and a woman bringing him a glass of lemonade. But it’s actually Lemonayy, which is better for him because of the added electrolytes. \n\nObviously needs some tweaking but I think you’re onto something there!",
                  "score": 1,
                  "created_utc": "2026-02-04 00:34:30",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4e7p0l",
          "author": "Ok_Sentence_7254",
          "text": "Lemonayy is fun and memorable, and the emotional story behind it is real. The risk is that once you leave friends, pop ups, and early buzz, the joke has to survive a shelf and a price tag. If someone doesn’t immediately get it, you’ve got about two seconds to explain before they move on.\n\nA few honest thoughts from the CPG side:\n\n• Taste and repeat matter way more than cleverness. If people come back for Lemonayy, you’re onto something. One good pop up is validation, not proof yet.  \n• “Lower sugar organic lemonade” is crowded. The differentiation has to be either flavor, vibe, or where it lives culturally. Liquid Death worked because they obsessed over distribution and tone, not just the name.  \n• Flavor extensions are fine, but don’t rush them. One hero SKU that actually moves is better than five clever ones that don’t.  \n• Cult followings are built through consistency and community, not chaos. The name can be playful, but the brand system underneath has to be tight.\n\nIf you want a real next step, don’t think “is this a company.” Think “would strangers buy this twice at a grocery store without me explaining it.”\n\nIf the answer becomes yes, then you’ve got something worth grinding on.",
          "score": 2,
          "created_utc": "2026-02-09 06:53:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4gnn34",
              "author": "itsway2spicy",
              "text": "Well worded feedback, thanks so much. I’ve thought it through and virality could spark 1 time purchases but that’s not really how businesses like this survive.\n\nWhen I was giving out samples I had a few people come back for seconds and say “I would buy this” so I guess that’s a good start, but that was only a handful of customers.",
              "score": 1,
              "created_utc": "2026-02-09 17:08:24",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3eq0bx",
          "author": "Vegetable_Bend_9085",
          "text": "this would be hell but with the right resources and people you will last.",
          "score": 1,
          "created_utc": "2026-02-03 20:46:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3ewqgs",
              "author": "itsway2spicy",
              "text": "I feel that. It’s hard enough building a village, let alone a Roman Empire.",
              "score": 1,
              "created_utc": "2026-02-03 21:17:17",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3exvna",
          "author": "ruibranco",
          "text": "The naming convention is actually smart because it scales across flavors without losing brand identity - Blueberrayy, Watermelonayy all feel like the same family. The fact that you already tested with 50 real people puts you ahead of most idea-stage posts here. The Liquid Death comparison is spot on - they proved that in CPG, the brand IS the product. Nobody buys Liquid Death because the water tastes different.",
          "score": 1,
          "created_utc": "2026-02-03 21:22:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3eyszv",
              "author": "itsway2spicy",
              "text": "My thoughts exactly and thanks for reinforcing them. It’s definitely a grind that will take many years but I’ll take it one dayy at a time.",
              "score": 1,
              "created_utc": "2026-02-03 21:26:51",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3fkc9u",
          "author": "superironthorman",
          "text": "How does it taste?",
          "score": 1,
          "created_utc": "2026-02-03 23:12:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3forjm",
              "author": "itsway2spicy",
              "text": "I like it and I’ve had other people like it. Recipe could use some tweaking though.\n\nI did have a couple kids come back for more when I was giving it out, so that was a good sign.",
              "score": 1,
              "created_utc": "2026-02-03 23:36:10",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3frawh",
          "author": "kawaiian",
          "text": "I think the naming and idea sound like a fun thing you came up with but there isn’t space in the larger market for new small food and beverage at scale. The big guys crush you because they need almost no margin to be successful.\n\nI recommend planning this as a farmer’s market booth",
          "score": 1,
          "created_utc": "2026-02-03 23:50:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3g6gx5",
              "author": "itsway2spicy",
              "text": "I’ve done a lot of research about scaling long term and that’s what I’ve concluded as well. My ideal start would be at farmer’s markets like you mentioned or random locations out in public to catch people off guard and stand out. I like the idea of pitching the product to local sandwich shops or small business restaurants as well to build a reputation, grass roots style.",
              "score": 1,
              "created_utc": "2026-02-04 01:13:31",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3ik1pe",
          "author": "ruibranco",
          "text": "The Liquid Death comparison is spot on - they proved you can win in a saturated market with aggressive branding and meme-worthy packaging. Your \"ayy\" angle actually has potential for social virality which is how LD grew. Focus on being shareable first, beverage second. The 50-person taste test is good validation but now test the brand: post the names on social and see what gets engagement. Distribution is where CPG gets brutal - start hyperlocal (farmers markets, local cafes) and build genuine demand before thinking retail. Also trademark Lemonayy early if you haven't.",
          "score": 1,
          "created_utc": "2026-02-04 11:52:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3jnioo",
              "author": "itsway2spicy",
              "text": "Thanks for the feedback and yeah I was debating on the trademark thing too. My IP attorney told me rough costs are about $2,500 all in costs for 1 single name trademark like this. You know anything about trademark costs and think this is reasonable?\n\nEdit: I do actually own the domains Lemonayy.com and drinklemonayy.com already and have social media accounts setup",
              "score": 1,
              "created_utc": "2026-02-04 15:36:16",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3kxks8",
          "author": "springcaterpillar",
          "text": "The branding angle sounds fun and the taste validation is a good start. Worth knowing early that claims like \"lower sugar\" and \"all organic\" have specific FDA requirements for beverages. \"Lower\" needs a comparison reference point, and organic has its own certification process. Seen founders get tripped up by this stuff after they've already printed labels. There's a tool called Truli that reviews this kind of claim risk if you want to check your copy before going too far.",
          "score": 1,
          "created_utc": "2026-02-04 19:06:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3ld4dh",
              "author": "itsway2spicy",
              "text": "Thanks for the feedback on the technicalities of ingredients. I think it’ll come down to what I finalize the recipe with. I’ll definitely check out Truli!",
              "score": 1,
              "created_utc": "2026-02-04 20:19:54",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qwl9sl",
      "title": "Do you think tokenization tools will become their own business category?",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1qwl9sl/do_you_think_tokenization_tools_will_become_their/",
      "author": "CategoryLong4026",
      "created_utc": "2026-02-05 13:28:13",
      "score": 3,
      "num_comments": 1,
      "upvote_ratio": 0.81,
      "text": "Most people talk about tokenization as a feature, but I’m starting to see more standalone tools built around it.\n\nPlatforms like **VestaScan** suggest there may be room for dedicated businesses focused only on tracking and understanding tokenized assets.\n\nDo you think this becomes a real market, or just a temporary niche?",
      "is_original_content": false,
      "link_flair_text": "Idea Feedback",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1qwl9sl/do_you_think_tokenization_tools_will_become_their/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": []
    },
    {
      "id": "1qz6e95",
      "title": "I live in the heart of India’s cement cluster (Prism, UltraTech, MP Birla) Satna, MP India with a godown and lab contacts. What’s the move?",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1qz6e95/i_live_in_the_heart_of_indias_cement_cluster/",
      "author": "triple_og_way",
      "created_utc": "2026-02-08 11:15:53",
      "score": 3,
      "num_comments": 2,
      "upvote_ratio": 0.71,
      "text": "Hey guys,\n\nI'm from Satna, Madhya Pradesh. If you know the area, you know it's basically the cement capital of the country (Prism, UltraTech, MP Birla, etc. are all right here).\n\nI’ve been looking at getting into the supply side. Coal is the obvious one, but the capital requirement is insane and the \"old money\" has that on lock.\n\nI’ve been looking into Bhusi )AFR)—Rice, Wheat, and Mustard husk. These plants are desperate for green fuel right now to replace coal, and I’ve got a 3,000 sq ft godown in Tikuriya (close proximity from the factories) ready to go.\n\nThe guy who runs the Test House (the one that does the actual quality audits for these plants) is a close contact. He's willing to help me verify quality before anything even hits the plant gate. In this business, if your moisture or ash content is off by 2%, they reject your whole truck. Having \"eyes\" inside the lab is a huge deal.\n\n**What I’m looking for:**\n\n1. Does anyone here move biomass at scale? Is bhusi the right play or should I look at something else (minerals/limestone/logistics)?\n2. Are there any exporters or big sourcing guys who need a boots-on-the-ground partner here? I can handle the physical verification, storage, and local \"fixing.\"\n3. If anyone wants to partner up or has a contract but no local guy they can trust to check the loading, let's talk.\n\nI'm not some agency in Delhi. I'm actually here on the ground. Curious to see what you guys think is the best way to leverage this.",
      "is_original_content": false,
      "link_flair_text": "Business Partner Sought - Business has NOT been established",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1qz6e95/i_live_in_the_heart_of_indias_cement_cluster/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o4988fd",
          "author": "Anoop_sdas",
          "text": "Can I DM?",
          "score": 1,
          "created_utc": "2026-02-08 14:25:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o498a8e",
              "author": "triple_og_way",
              "text": "Sure.",
              "score": 1,
              "created_utc": "2026-02-08 14:25:31",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qz45sh",
      "title": "Weekly Free For All Thread - Spam your business - Post your surveys - Tell us about your awesome MLM scheme - [UNMODERATED POST] (except for site rules of course)",
      "subreddit": "Business_Ideas",
      "url": "https://www.reddit.com/r/Business_Ideas/comments/1qz45sh/weekly_free_for_all_thread_spam_your_business/",
      "author": "AutoModerator",
      "created_utc": "2026-02-08 09:01:01",
      "score": 3,
      "num_comments": 9,
      "upvote_ratio": 1.0,
      "text": "Hey r/Business_Ideas! \n\n**Welcome to Small Business Sundays!** \n\nThis is the ONLY place you can solicit on this subreddit, so feel free to plug your business and services here and get the word out about your offerings! \n\nYou should try to include:\n\n* your industry\n* your experience (or portfolio)\n* the type of customer you're looking for\n* any other relevant info \n\nThe only rules still in force are Reddit's site-wide rules and 'Be Real & Be Nice', otherwise, spam away!",
      "is_original_content": false,
      "link_flair_text": "WEEKLY THREAD",
      "permalink": "https://reddit.com/r/Business_Ideas/comments/1qz45sh/weekly_free_for_all_thread_spam_your_business/",
      "domain": "self.Business_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o48d5jk",
          "author": "ajay9452",
          "text": "i built bulk invoice to excel tool. Here you can dump 1000s of invoices -> get the excel with columns like vendor, date, total, or anything u define.\n\n[validinvo.com](http://validinvo.com)",
          "score": 1,
          "created_utc": "2026-02-08 10:29:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o49twga",
          "author": "SolidHuman9936",
          "text": "My wife has a 1000-day Duolingo streak and still could not write or communicate efficiently - so I built something for her\n\nShe has been learning English and French for years.  \nShe’s consistent. She has a \\~1000-day Duolingo streak. She can communicate. (well she can in English but she is not improving)\n\nBut every time she tried to *write* \\- short messages, emails, journaling - she’d say the same thing:  \n“I know this is wrong, but I don’t know why.”\n\nIf you’re stuck at that annoying intermediate plateau and like writing, I’m very open to feedback (good or bad).\n\n[https://polyglotty.io](https://polyglotty.io/)\n\n[https://apps.apple.com/pl/app/polyglotty-language-learning/id6757529562](https://apps.apple.com/pl/app/polyglotty-language-learning/id6757529562)",
          "score": 1,
          "created_utc": "2026-02-08 16:18:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4jykij",
          "author": "germanheller",
          "text": "PATAPIM - Terminal IDE for developers using AI coding agents\n\nIndustry: Developer tools / SaaS\n\nIf you're a dev shop, freelancer, or solo developer using AI coding tools like Claude Code, Gemini CLI, or Codex, this manages all your AI sessions from one screen. 9 terminals in a grid, color-coded status indicators, voice dictation, remote access from phone.\n\nLooking for: developers and small dev agencies using AI tools for coding\n\nFree tier available. Pro is $7/month or $30 lifetime.\n\nhttps://patapim.ai",
          "score": 1,
          "created_utc": "2026-02-10 03:32:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4k6kn8",
          "author": "Aromatic-Trouble-580",
          "text": "I have just launched Principal Axiom Consultings first product, a focus session targeted at startup founders and small business owners. please feel free to check it out and leave feedback. \n\nLink to product page: https://trylaunch.ai/launch/focus-session",
          "score": 1,
          "created_utc": "2026-02-10 04:24:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4l0ndm",
          "author": "IntroductionLumpy552",
          "text": "Validate any startup instantly with Beatable’s Startup Validation tool – just enter the company name or URL and get a full report: https://beatable.co/startup-validation",
          "score": 1,
          "created_utc": "2026-02-10 08:37:12",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}