{
  "metadata": {
    "last_updated": "2026-01-03 12:29:58",
    "time_filter": "week",
    "subreddit": "CLine",
    "total_items": 7,
    "total_comments": 44,
    "file_size_bytes": 37684
  },
  "items": [
    {
      "id": "1pzia9y",
      "title": "Why should I use cline over Codex, Claude Code or Cursor?",
      "subreddit": "CLine",
      "url": "https://www.reddit.com/r/CLine/comments/1pzia9y/why_should_i_use_cline_over_codex_claude_code_or/",
      "author": "Present-Pea1999",
      "created_utc": "2025-12-30 13:35:39",
      "score": 13,
      "num_comments": 27,
      "upvote_ratio": 0.84,
      "text": "",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/CLine/comments/1pzia9y/why_should_i_use_cline_over_codex_claude_code_or/",
      "domain": "self.CLine",
      "is_self": true,
      "comments": [
        {
          "id": "nwq940s",
          "author": "Tema_Art_7777",
          "text": "You need to see which one has the best workflow. I like Cline because of plan and act mode that lets me use different models. They are there within a few hours of a new model being announced and they have extensive local model usage capability thru ollama, lm studio and others. I.e quite flexible.",
          "score": 9,
          "created_utc": "2025-12-30 13:44:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx30swi",
              "author": "BamaGuy61",
              "text": "I was using Cline but I was running up $500-1000 per month tabs on OpenRouter. I was ok with that for a while because the other tools at the time couldn’t get the job done.  I kept resisting the switch to Claude Code and then Cline hit that wall with something i considered relatively simple.  It could not embed GHL forms into my website and i ran up a $300-400 tab on OpenRouter in about 3 days using every model available to no avail.  So i said to hell with it and went through install process for Claude Code and it literally fixed this embed issue within 10-15 minutes and i was hooked.  However, I’m not using it in stand alone terminals.  I use it inside VScode in a WSL terminal so i can see files and it feels like a better experience to me.  I also run Codex 5.2 via the extension beside it.  Codex is a total bad ass when it comes to code reviews and making enhancement suggestions and i found it to be a bit better at UI design.  My workflow is to take the awesome overly optimistic (lying) summaries from CC and paste them into Codex for verification and enhancement suggestions and then i give that back to CC.  This saves me a boat load of time on testing and it improves the code.  I did try Codex as the primary coder but it failed at that.  Code reviewer and CC lie detector is its strong suit.  I also love spinning up multiple subagents in CC and let it run.  Mind blowing how much it can get done very quickly.  Bottom line is the $200 max plan per month is a bargain vs OpenRouter token usage, especially with the capabilities gap between Cline and CC.",
              "score": 1,
              "created_utc": "2026-01-01 14:34:18",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nx851l2",
                  "author": "Witty-Cod-3029",
                  "text": "Hooked in 15 minutes. I know the feeling. I wasted **FOUR HOURS** on a NocoDB and MinIO server issue. Manus fixed it in **TEN**. The problem? My key was **LOWER CASE**. I literally screamed, **ARE YOU FING KIDDING ME?!** All that work building policies and writing code, just for some **STUPID LOWER CASE KEYS** in a yml file. **Stupid Claude Fail.**",
                  "score": 1,
                  "created_utc": "2026-01-02 09:05:23",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nx80bce",
              "author": "Due_Amphibian1943",
              "text": "Becacause it's freree and just as powerful!",
              "score": 1,
              "created_utc": "2026-01-02 08:20:05",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nwq9czr",
              "author": "Present-Pea1999",
              "text": "codex, claude code and cursor have the same. They also have plan features. So whats the real big thing?",
              "score": 2,
              "created_utc": "2025-12-30 13:45:47",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwr3l7t",
                  "author": "EstablishmentExtra41",
                  "text": "The things I like about Cline:\n\n\n1. Plan / Act mode allows me to interrogate the LLM before it starts updating files.\n\n\n2. Memory bank - so you don’t have to keep explaining your project context or programming guidelines for each new prompt.\n\n\n3. Running cost per task so you know how much you’ve spent on each feature you build. \n\n\n4. Because it’s a VSC extension I can use it with git so I can develop new features in separate branches and rollback if there is a problem. I can also see precisely which files have been changed and if something unexpected changes I can investigate.\n\n\n5. Can use with openrouter so I’m not stuck with one LLM (you can even change which LLM is used for plan vs act)",
                  "score": 6,
                  "created_utc": "2025-12-30 16:22:21",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nwqa1ya",
                  "author": "_Cynikal_",
                  "text": "In cline. You can have OpenAI plan and sonnet act. (As an example)\n\nIn Claude code. It’s both Claude.",
                  "score": 5,
                  "created_utc": "2025-12-30 13:49:49",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwru0at",
          "author": "juiceboxwtf",
          "text": "The open source aspect of Cline is nice, as is the Cline CLI (it’s a nice primitive and scriptable)\n\nThe MCP Marketplace is well done too",
          "score": 3,
          "created_utc": "2025-12-30 18:24:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx84wui",
              "author": "Witty-Cod-3029",
              "text": "What MCP servers are you running. I've got files and browser mcp. I also added nocodb today as well.",
              "score": 1,
              "created_utc": "2026-01-02 09:04:07",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nwu6tv9",
          "author": "AdPristine1358",
          "text": "i like the ability to toggle between plan and act, and the memory bank\n\ni like working in vs code so i can switch between apps as needed and can rollback\n\ni use cline with claude code max subscription",
          "score": 2,
          "created_utc": "2025-12-31 01:32:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwungmi",
          "author": "TaoBeier",
          "text": "To be honest, I think we are all ordinary users, so we don't need to have any psychological burden or obsession when choosing tools.\n\nThere are many tools available now that cover various aspects.\n\nIf you like open source projects and mainly use them in VS Code, then using cline is perfectly fine.\n\nIf you prefer terminal applications, or if your company can reimburse your subscription fees, then using codex/Claude code is fine too.\n\nIf you don't want to launch other tools every time in the terminal, or don't want to install other AI tools on a remote server, you can even have a great experience using Warp.\n\nYou may see a lot of discussions every day, but I think what's really important is that you use it for a week or two, or even a month, to see if it really matches you or if it can bring you value.",
          "score": 2,
          "created_utc": "2025-12-31 03:09:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx858t2",
              "author": "Witty-Cod-3029",
              "text": "I havent heard of wap yet I will have to look that up.",
              "score": 1,
              "created_utc": "2026-01-02 09:07:19",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nwqhx86",
          "author": "JLeonsarmiento",
          "text": "Cline is the best.",
          "score": 3,
          "created_utc": "2025-12-30 14:34:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwsfgda",
          "author": "BitterProfessional7p",
          "text": "Because it's open source, they don't steal your data.\n\n\nAnd it's very good, comparable to the others. ",
          "score": 2,
          "created_utc": "2025-12-30 20:05:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwso664",
          "author": "Purple_Wear_5397",
          "text": "I don’t think there is a real reason.. speaking here a 7-8 months user of cline earlier this year, it was the best for several months. \n\nToday I don’t even have its extension installed..\n\nClaude code is really much much better. And even when I didn’t have Claude code, then I used codex that came free with my chatgpt subscription, for several days. \n\nSorry Cline.. it’s been a really good time..",
          "score": 2,
          "created_utc": "2025-12-30 20:48:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx8m707",
          "author": "Bob5k",
          "text": "you shouldn't unless you have very specific usecases in which you really need IDE for coding / vibecoding and also paying for cursor makes no sense. \n\nalmost all tools allow you to set different models for plan and act modes.",
          "score": 1,
          "created_utc": "2026-01-02 11:43:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwqc000",
          "author": "dreamingwell",
          "text": "Try RooCode too. Much better context management.",
          "score": 2,
          "created_utc": "2025-12-30 14:01:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwrh1mg",
          "author": "stonedoubt",
          "text": "You shouldn’t. Codex with 5.2 is the bees knees. I am super serious… and I haven’t hit a limit yet and I am just on a $20 a month",
          "score": -2,
          "created_utc": "2025-12-30 17:25:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx85hxl",
              "author": "Witty-Cod-3029",
              "text": "Oh yea I forgot all about the local models(from olama or lmstudio) that is good for them privacy type guys with gigantic gpus :-)",
              "score": 1,
              "created_utc": "2026-01-02 09:09:44",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nwqagbb",
          "author": "DataScientia",
          "text": "The context management is not that great in cline. Use cline only \n1.if you have api key from glm models (or any api key of cheap models)\n2. You want to make use of local models(from olama or lmstudio)",
          "score": -1,
          "created_utc": "2025-12-30 13:52:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwr8l9l",
          "author": "Rare-Hotel6267",
          "text": "Not sure you should. \nThe main difference between all of those is the scaffolding and model availability. That's it.\nScaffolding is the important part.",
          "score": 0,
          "created_utc": "2025-12-30 16:45:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx83vig",
          "author": "Witty-Cod-3029",
          "text": "I was initially interested in using Claude Code but was deterred by the complexity of setting up a user-friendly interface on Windows. This led me to discover Cline, an open-source tool that has been a game-changer for my workflow.\n\nCline's primary appeal was its seamless integration into VS Code, which was a significant advantage over paid alternatives like Cursor. The fact that it's free, open-source, and comes with a built-in MCP (Model Context Protocol) server made the decision easy. Its active GitHub repository also inspires confidence.\n\nMy exploration into \"vibe coding\" has given me a newfound appreciation for open-source software, and Cline embodies this perfectly. It has empowered me to not only set up servers with ease but also to understand and contribute to the projects I use. I was able to connect [Z.AI](http://Z.AI) in minutes.\n\nSeveral of Cline's features stand out. The \"plan and execute\" toggle provides excellent control over the AI's process, and the custom rules system is remarkably effective when the AI follows them. I am particularly excited about the upcoming \"hooks\" functionality. For instance, I've configured a rule where, upon completing a task, Cline triggers a simple Python script. This script converts the completion message to audio, so I receive an audible notification instead of having to monitor the screen constantly.\n\nWhile I pay $10 through Cline to use Anthropic's models for their superior planning capabilities, the combination of Cline and [Z.AI](http://Z.AI) is incredibly powerful. With the flexibility of the MCP server, the possibilities seem vast. I'm already looking forward to managing multiple Cline instances using an agent harness with a pre-defined set of rules. **So if any of the developers that work on Cline are watching I just want to say thank you!**",
          "score": 0,
          "created_utc": "2026-01-02 08:54:19",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1px4q70",
      "title": "How can i get multiple cline instances running working on different parts of the same codebase at the same time?",
      "subreddit": "CLine",
      "url": "https://www.reddit.com/r/CLine/comments/1px4q70/how_can_i_get_multiple_cline_instances_running/",
      "author": "throwawaycanc3r",
      "created_utc": "2025-12-27 18:24:29",
      "score": 9,
      "num_comments": 13,
      "upvote_ratio": 0.91,
      "text": "right now, I am doing tasks one at a time. Is there a way to do multiple simultaneously?",
      "is_original_content": false,
      "link_flair_text": "✅ Question: Resolved",
      "permalink": "https://reddit.com/r/CLine/comments/1px4q70/how_can_i_get_multiple_cline_instances_running/",
      "domain": "self.CLine",
      "is_self": true,
      "comments": [
        {
          "id": "nw8prnt",
          "author": "Equinox32",
          "text": "Cline CLI",
          "score": 9,
          "created_utc": "2025-12-27 19:47:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw98i9p",
          "author": "quincycs",
          "text": "Maybe this:   git clone multiple times, then open vscode each of those folders.",
          "score": 2,
          "created_utc": "2025-12-27 21:29:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "nw9px57",
              "author": "False-Ad-1437",
              "text": "Git worktrees were made for this!\n\nhttps://github.com/cline/cline/pull/7053",
              "score": 3,
              "created_utc": "2025-12-27 23:03:35",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nx82ku9",
              "author": "Due_Amphibian1943",
              "text": "🤔",
              "score": 1,
              "created_utc": "2026-01-02 08:41:55",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nwc8uca",
          "author": "Sad-Chemistry5643",
          "text": "Git worktrees 🙂",
          "score": 1,
          "created_utc": "2025-12-28 09:39:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwgo45q",
          "author": "TaoBeier",
          "text": "You can use git worktree feature.\n\nThis feature applies not only to cline, but also to any other tool that needs to work based on a git repo, such as Claude Code or Warp etc.\n\nHere is an open-source project I'm using that adds some shortcuts.\n\nhttps://github.com/coderabbitai/git-worktree-runner\n\nAt the same time, I think it might be more convenient to work with CLI tools, since the vscode extension requires you to reopen the working directory.",
          "score": 1,
          "created_utc": "2025-12-29 00:53:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwjcyz2",
          "author": "fr4iser",
          "text": "With some restrictions possible, run them isolated. U will get problems if the affect files which are connected to them, their cache will not every time be in sync and this can lead to multiple little bugs.",
          "score": 1,
          "created_utc": "2025-12-29 12:53:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwkas8o",
          "author": "sbayit",
          "text": "Compared to the CLI tool Cline, Roo's code and Kilo's code are quite slow.",
          "score": 1,
          "created_utc": "2025-12-29 16:02:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwnyfg2",
          "author": "Glittering_Will_555",
          "text": "cli or git work tree",
          "score": 1,
          "created_utc": "2025-12-30 03:05:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx6yyuj",
          "author": "forkbomb7",
          "text": "Use the Cline CLI, it’s easy to set up and you can have multiple parallel instances",
          "score": 1,
          "created_utc": "2026-01-02 03:32:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw93xdv",
          "author": "Loud-Swim-2932",
          "text": "Maybe virtualisation? Running multiple OS with VS Code - Transfer data by github.",
          "score": 1,
          "created_utc": "2025-12-27 21:04:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw8b30r",
          "author": "awdorrin",
          "text": "Use Roo Code instead of Cline, it supports multiple VSCode instances.",
          "score": -5,
          "created_utc": "2025-12-27 18:31:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "nw8p2pt",
              "author": "throwawaycanc3r",
              "text": "ty",
              "score": 1,
              "created_utc": "2025-12-27 19:43:46",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1pw0bme",
      "title": "gpt for plan and sonnet for act, do you agree?",
      "subreddit": "CLine",
      "url": "https://www.reddit.com/r/CLine/comments/1pw0bme/gpt_for_plan_and_sonnet_for_act_do_you_agree/",
      "author": "wanllow",
      "created_utc": "2025-12-26 09:28:10",
      "score": 6,
      "num_comments": 5,
      "upvote_ratio": 1.0,
      "text": "Hi folks, \n\nI’ve been testing cline a bit and it kinda feels like using a “thinker” model for plan and an “actor” model for act is the best combo (e.g. gpt for planning, sonnet for execution). heavy models in act sometimes get too cautious or start replanning mid-run, while lighter models in plan tend to miss stuff and make shaky task breakdowns. curious if others see the same pattern, and if you had to spend budget, would you put the expensive model in plan or act (and keep the lightweight one for the other)?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/CLine/comments/1pw0bme/gpt_for_plan_and_sonnet_for_act_do_you_agree/",
      "domain": "self.CLine",
      "is_self": true,
      "comments": [
        {
          "id": "nw76cmq",
          "author": "Purple_Wear_5397",
          "text": "Opus for both\nOur opus and haiku 4.5 if you’re short on money",
          "score": 5,
          "created_utc": "2025-12-27 15:03:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwck5wi",
              "author": "DenizOkcu",
              "text": "This. Plus I tell Opus specifically that it should write the plan to markdown files for Haiku 4.5 to act on. It uses different wording and more code examples.\n\nUsing markdown files keeps the context small, which helps with context rott. And I also ask opus for the prompt for haiku how to use the markdown files. You can even check them in for documentation.",
              "score": 1,
              "created_utc": "2025-12-28 11:27:51",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nw0cztk",
          "author": "Dizzybro",
          "text": "Expensive model plans, cheap model acts.",
          "score": 3,
          "created_utc": "2025-12-26 11:28:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw4fxpv",
          "author": "HereForTheFacts12",
          "text": "Personally, I am planning/acting with GLM. Occasionally, I have a plan that is controversial, and I'll get a second opinion on it from GPT-5 or Gemini 3 Pro. Sometimes there is a bug or a failing test and Gemini does the best job of sorting it out. Otherwise, 99% of my response are coming from Z.ai.\n\nMy key frustration at the moment is that Cline CLI doesn't support GLM for BYOK",
          "score": 1,
          "created_utc": "2025-12-27 02:02:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwasnks",
          "author": "newyorkerTechie",
          "text": "I’ll have a separate session where I will use ChatGPT to review plans and do some brainstorming, sometimes Gemini. I like Claude to do my “real” plan as well as act.",
          "score": 1,
          "created_utc": "2025-12-28 02:48:02",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pxoh2d",
      "title": "Cline in PyCharm is 2 versions behind",
      "subreddit": "CLine",
      "url": "https://www.reddit.com/r/CLine/comments/1pxoh2d/cline_in_pycharm_is_2_versions_behind/",
      "author": "muhamedyousof",
      "created_utc": "2025-12-28 10:43:27",
      "score": 4,
      "num_comments": 14,
      "upvote_ratio": 0.7,
      "text": "I noticed that cline is on 3.45.0 on pycharm while it is now 3.46.1 on vscode, is this normal? or i miss something?\n\nI care about this because the new version supports GLM 4.7 and I use pycharm not vscode for real projects ",
      "is_original_content": false,
      "link_flair_text": "✅ Question: Resolved",
      "permalink": "https://reddit.com/r/CLine/comments/1pxoh2d/cline_in_pycharm_is_2_versions_behind/",
      "domain": "self.CLine",
      "is_self": true,
      "comments": [
        {
          "id": "nwcjw35",
          "author": "Sad-Chemistry5643",
          "text": "Sounds weird 🧐 but I assume this is because of the pyCharm",
          "score": 2,
          "created_utc": "2025-12-28 11:25:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwcmiio",
              "author": "muhamedyousof",
              "text": "If you have pycharm, could you please check at your end",
              "score": 1,
              "created_utc": "2025-12-28 11:49:15",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwhk4dj",
          "author": "juanpflores_",
          "text": "The JetBrains releases do take a few extra time to roll out compared to VS Code, it's the nature of the plugin review process. The good news is that the model list updates independently on all platforms, so you should already be able to grab GLM 4.7 from your model list without waiting for the full release on PyCharm.\n\nGive your model list a refresh and it should show up. Let me know if you're not seeing it and we can troubleshoot.",
          "score": 2,
          "created_utc": "2025-12-29 03:59:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwhvqd4",
              "author": "muhamedyousof",
              "text": "I think it's not the case this time, the version 3.46 has adding 4.7 model in its feature list \nIts fine for a couple of days \nThanks",
              "score": 1,
              "created_utc": "2025-12-29 05:14:37",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwktp3v",
                  "author": "juanpflores_",
                  "text": "You should be able to update to 1.1.16 now and get the latest model list.",
                  "score": 1,
                  "created_utc": "2025-12-29 17:32:00",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwk4f88",
          "author": "muhamedyousof",
          "text": "Its now updated",
          "score": 2,
          "created_utc": "2025-12-29 15:31:37",
          "is_submitter": true,
          "replies": [
            {
              "id": "nwktsua",
              "author": "juanpflores_",
              "text": "🙌",
              "score": 2,
              "created_utc": "2025-12-29 17:32:30",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nwcuqz1",
          "author": "Marha01",
          "text": "I have Cline plugin version 1.1.14 in Pycharm.",
          "score": 1,
          "created_utc": "2025-12-28 12:57:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwcxoej",
              "author": "muhamedyousof",
              "text": "Yes, click on the gear icon ⚙️ and check the version you should see 3.45.0 \nCheck it and confirm, if so, it means they didn't update pycharm yet",
              "score": 2,
              "created_utc": "2025-12-28 13:19:04",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwcykjc",
                  "author": "Marha01",
                  "text": "Indeed, I also see version 3.45.0 in there and Pycharm says all my plugins are up to date.",
                  "score": 2,
                  "created_utc": "2025-12-28 13:25:15",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwj3xlw",
          "author": "Marha01",
          "text": "My Cline plugin for PyCharm has just updated to 3.46.1.",
          "score": 1,
          "created_utc": "2025-12-29 11:43:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwj43ge",
              "author": "muhamedyousof",
              "text": "Mine too",
              "score": 2,
              "created_utc": "2025-12-29 11:45:17",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1pulm4r",
      "title": "Free GLM-4.6 model presents price on Cline extension",
      "subreddit": "CLine",
      "url": "https://i.redd.it/v2xsdwfu359g1.png",
      "author": "khatriafaz",
      "created_utc": "2025-12-24 11:49:28",
      "score": 4,
      "num_comments": 1,
      "upvote_ratio": 0.83,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "🐞 Bug: New",
      "permalink": "https://reddit.com/r/CLine/comments/1pulm4r/free_glm46_model_presents_price_on_cline_extension/",
      "domain": "i.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "nvsaiv8",
          "author": "linnth",
          "text": "I am using paid z.ai api key for GLM-4.7 and same experience. There is no extra API cost on z.ai but Cline shows API cost for each task. Shocked me a little bit but eventually I found it kinda useful to know. ",
          "score": 3,
          "created_utc": "2025-12-24 22:15:35",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1q0ou4s",
      "title": "context usage on locally hosted models",
      "subreddit": "CLine",
      "url": "https://www.reddit.com/r/CLine/comments/1q0ou4s/context_usage_on_locally_hosted_models/",
      "author": "nomorebuttsplz",
      "created_utc": "2025-12-31 22:14:19",
      "score": 3,
      "num_comments": 8,
      "upvote_ratio": 0.81,
      "text": "I'm running locally and having an issue where the model spends a lot of time prompt processing rather than holding things in context. This is a core weakness of current local ai machines, but my entire codebase is maybe 20k tokens. I don't understand why it has to keep re-reading the main python file every few turns or every time it wants to edit that file, and what it is doing with its context window if not storing the codebase. Do other agents besides cline do a better job of using prompt caching for local models?\n\nEdit: To summarize. If my codebase is 20k, and cline's system prompt is like 10k, then why is context usage between 50 and 70k most of the time? It's a waste of resources. It should be half that.",
      "is_original_content": false,
      "link_flair_text": "❓ Question: New",
      "permalink": "https://reddit.com/r/CLine/comments/1q0ou4s/context_usage_on_locally_hosted_models/",
      "domain": "self.CLine",
      "is_self": true,
      "comments": [
        {
          "id": "nwzs9gx",
          "author": "muhamedyousof",
          "text": "Which model do you use locally",
          "score": 1,
          "created_utc": "2025-12-31 22:59:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwzu36w",
              "author": "nomorebuttsplz",
              "text": "glm 4.7 and minimax m2.1 currently.",
              "score": 1,
              "created_utc": "2025-12-31 23:11:02",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwzv4uf",
                  "author": "muhamedyousof",
                  "text": "But these models are cloud based not locally",
                  "score": 2,
                  "created_utc": "2025-12-31 23:17:25",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nx5ow4t",
          "author": "Uninterested_Viewer",
          "text": ">rather than holding things in context.\n\nI think you have a fundamental misunderstanding of how context works. LLMs are stateless: they don't have a memory and there is no \"holding things in context\". Each time you send your prompt in cline, you are always sending the FULL context of what has proceeded it including the \"system prompt\", any previous \"chat messages\", and any code that cline decides is needed for the model to best predict the next token.",
          "score": 1,
          "created_utc": "2026-01-01 23:00:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx5r2kp",
              "author": "nomorebuttsplz",
              "text": "cool. Have you heard of prompt prefix caching?",
              "score": 1,
              "created_utc": "2026-01-01 23:12:33",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nxar4bo",
          "author": "Aggressive-Bother470",
          "text": "llama.cpp, presumably? ",
          "score": 1,
          "created_utc": "2026-01-02 18:41:44",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pv0bz0",
      "title": "how do you vibecode without distracted?",
      "subreddit": "CLine",
      "url": "https://www.reddit.com/r/CLine/comments/1pv0bz0/how_do_you_vibecode_without_distracted/",
      "author": "jessehinkle",
      "created_utc": "2025-12-24 23:39:41",
      "score": 3,
      "num_comments": 8,
      "upvote_ratio": 0.64,
      "text": "i love how effective the planinng mode is but hate to wait. every time I found myself doomscrolling and forget what I was doing. is there anyone doing the same things? if so did you find any solution? want to stay productive but i get bored so fast lol",
      "is_original_content": false,
      "link_flair_text": "❓ Question: New",
      "permalink": "https://reddit.com/r/CLine/comments/1pv0bz0/how_do_you_vibecode_without_distracted/",
      "domain": "self.CLine",
      "is_self": true,
      "comments": [
        {
          "id": "nvspv4v",
          "author": "WandyLau",
          "text": "ANything you consider as distraction just remove it.",
          "score": 3,
          "created_utc": "2025-12-24 23:59:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvswxgy",
          "author": "unstoppableobstacle",
          "text": "I started reading code and trying to understand while watching cs50 lectures. On top of windsurfs code maps, it now feels like i know whats happening!!!",
          "score": 3,
          "created_utc": "2025-12-25 00:48:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvvy434",
          "author": "the320x200",
          "text": "As part of your prompt ask it to explain each line of the change, then you can read and learn from that while it is working on the next change.",
          "score": 3,
          "created_utc": "2025-12-25 16:20:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvvha27",
          "author": "KnifeFed",
          "text": "inb4 this turns out to be an ad for Chad IDE.",
          "score": 1,
          "created_utc": "2025-12-25 14:33:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvxlrd0",
          "author": "unstoppableobstacle",
          "text": "Not an ad. Im a blue collar worker whos been dabbling with code for years. Im really slow at picking things up but persistent. I have not given cursor a proper go yet, but the code maps is what sold me, plus i initially paid $10/month for windsurf. \n\nIm just trying to make apps that solve my problems, finances/and inventory for my business.",
          "score": 1,
          "created_utc": "2025-12-25 22:18:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvxu2lp",
          "author": "Bob5k",
          "text": "if you don't need IDE - use CLI agents. for me constant following of what agent does in the given time was distracting and disruptive in general when it comes to overall output.   \nalso use proper tools to plan your work, eg. [clavix.dev](http://clavix.dev) as planning / prd / tasks management tool to ensure that input you give the agent is top level - so the output will be high aswell. And don't overthink.",
          "score": 1,
          "created_utc": "2025-12-25 23:11:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw26tww",
          "author": "Able-Classroom7007",
          "text": "I totally feel you on this. It's way harder to stay in flow state when you have these pause and wait periods.\n\nI typically have 2 meaningful changes in-flight so while one agent is planning or implementing a PR in the background I'm reviewing a plan from another agent. When things are going well there's a back-and-forth rhythm between planning and reviewing and testing code. Two parallel features is the max that's still fun for me\n\nThis is actually basically the same problem manager or tech leads have had forever. You're responsible for a whole team's delivery and all you can do is provide feedback and wait.\n\nAlso I'm waiting for an agent to finish rn lol",
          "score": 1,
          "created_utc": "2025-12-26 18:21:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw4ncj3",
          "author": "HereForTheFacts12",
          "text": "I use the spec-driven approach and work on 2-3 projects \\~ simultaneously. While one is planning/acting, I'm planning or acting on another one; if both are busy, I'm working on a third.\n\nConceptually, seems \\~nuts, but in practice, it's fine.",
          "score": 1,
          "created_utc": "2025-12-27 02:50:13",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}