{
  "metadata": {
    "last_updated": "2026-02-11 03:30:00",
    "time_filter": "week",
    "subreddit": "CyberSecurityAdvice",
    "total_items": 20,
    "total_comments": 112,
    "file_size_bytes": 154885
  },
  "items": [
    {
      "id": "1qxonsr",
      "title": "Future cyber students save yourself",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qxonsr/future_cyber_students_save_yourself/",
      "author": "Key-Choice6421",
      "created_utc": "2026-02-06 17:52:57",
      "score": 118,
      "num_comments": 36,
      "upvote_ratio": 0.93,
      "text": "Cybersecurity sounds like such an amazing career choice on paper but the actual fight you have to go through to break in is insane.\n\nI’m on my 4th year of college and have heard literally every possible thing you could think of and nothing has worked, let alone even breaking into IT in general and this is coming from someone thats tangled around with computers since they were 3 years old now being 21.\n\nI have yet to be able to land an internship or a job being on my final year of schooling and I’ve done everything a student could possibly try to do to break in.\n\nGood ol’ help desk and support roles? - I tried applying for too many roles to count and every response is, “3+ years of experience needed, we only hire students enrolled at our school, we’ll get back to you (never do btw), bachelors needed” or all around just ghosted yet help desk is supposed to be the entry level point to dip your foot in the pool and build your way up right?\n\nProjects - I’ve done countless projects like Layer 2/ Layer 3 Switch configuration, setting up/using SIEMS, Active Directory and active attack simulations, Homelab setups, coding with python, creating a github to list all of my projects with screenshots + steps of how I did all of them, even created youtube videos in tutorials of how to do basic things needed for a cyber student in todays age. \n\nCertifications - I’ve gotten both my Security+ and AZ-900, yes AZ might be an entry-level cert but according to every person in cyber when I first started Security+ was supposed to be the holy grail to get a job in the field now its “not enough”. The $400 certification thats based around cybersecurity isn’t enough to get an entry job in cybersecurity? It makes no sense at all. \n\nNetworking - I’ve grown my LinkedIn for the past 2 years and have achieved getting +500 connections, contacting hiring managers/recruiters, reaching out to people in a position that I admire or even colleagues from school, posting about my projects or accomplishments and still nothing.\n\nAnd yet every day I hear “Don’t give up, once you get that first job you’ll be set after, Cyber isn’t an entry-level field, young people think it’s going to be simple”\n\nI 100% understand that it may not be simple but when students are breaking their necks to do everything possible to get even an internship in a field they signed up to take 4 years of schooling for + outside resources and networking of course I’m going to be upset if I can’t land a job. It’s years of wasted money and time that could’ve went to another field and at least almost guaranteed a career. At this point IT in general is almost on the path of becoming apart of the “useless degrees” category you’re warned about before you go into college. \n\nIts a continuous game of cat and mouse and is exactly why I say, if you’re an upcoming student or a current early student wanting to pursue cybersecurity save yourself while you still can. You’re in for a constant game of depression for years to come unless you get lucky.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qxonsr/future_cyber_students_save_yourself/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o3yr5rk",
          "author": "net_architect",
          "text": "think the most brutal part of cybersecurity isn’t the technical difficulty-it’s the misalignment between education and hiring reality.\nSchools sell cyber as “entry-level”, but the market treats it as a mid-career specialization. That gap is where most students get crushed.\nFrom what you describe, you didn’t “fail”. You did exactly what the system told you to do-projects, certs, homelabs, networking-and still hit a wall. That’s not on you.\nThe uncomfortable truth is that many people who eventually land cyber roles don’t enter through cyber at all. They come from sysadmin, networking, cloud ops, even non-IT roles where they slowly absorb trust and responsibility.\nIt doesn’t mean cybersecurity is useless. It means it’s badly marketed and poorly structured for newcomers.\nWhether you continue or pivot, just know this: your effort wasn’t wasted/but the path almost never looks like the one they advertise.",
          "score": 58,
          "created_utc": "2026-02-06 20:33:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3z8n4b",
              "author": "cyberguy2369",
              "text": "well said, I'm a director and manager of a small cyber security DFIR team, thats part of a bigger cyber group/company. \n\nIn my opinion, university \"cyber\" programs are focusing on the wrong things for entry level people. They are teaching the \"cool\" niche stuff.. but very little of the day to day common cyber aspects.. core networking, securing systems, securing networks.. log analytics. \n\nThats great you spent 3-4 yrs learning how to do malware reverse engineering.. but how many entry level positions are open for malware reverse engineering vs people that have a really strong foundational knowledge in secure programming, secure system building, and networking? These kinds of positions build your core and foundational knowledge you need to really get in the industry and more importantly STAY in the industry.. (not get laid off). This is where most people NEED to start. \n\nI say it in these channels over and over again.. getting a degree in CIS or CS isnt nearly as exciting but gives you all the knowledge you need to move into cyber OR 100 other technology directions.. Youre FAR more marketable in the cyber world and technology world in general with a degree in CIS or CS. You have a broad set of adaptable skills. \n\nOne other thing.. certs are great.. home labs are great.. but they are absolutely NOT the same as real world work experience.. and these days there is little to no excuse not to get some work experience while in school.. walk over to the university IT dept. \"hi am a Cyber/CS/CIS major.. I'm looking for opportunities to work and gain experience, what can I do? \".. do the same thing in your CS/CIS/Cyber dept. \n\nI can teach you the cyber aspect.. I cant, and dont have time to teach you how to work and interact in a real world office/work environment. how to stay on a schedule, multi-task, meet real deadlines with consequences.. take criticism.. present to people, work with others and have to do things you dont like or agree with bc your boss told you to do it. \n\nrealistically you are not going to work remotely straight out of school (you shouldn't, you need to be around other smart people you can learn from.. you cant do that through a zoom meeting)\n\n",
              "score": 17,
              "created_utc": "2026-02-06 22:00:43",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o41cngp",
                  "author": "net_architect",
                  "text": "This is exactly the part most students never get told early enough.\nCyber isn’t a starting point - it’s a concentration layer that sits on top of real operational experience. Universities market the “cool” parts because they sell, not because they hire.\nThe irony is that by skipping fundamentals (systems, networking, ops, logs), people actually delay their cyber careers instead of accelerating them.\nAnd you’re 100% right about work experience vs labs. Labs prove curiosity. Real environments prove trust. Hiring decisions are almost always about the second one.\nAppreciate you sharing this perspective — it’s the kind of comment that should be pinned for every incoming cyber student.",
                  "score": 10,
                  "created_utc": "2026-02-07 05:55:44",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o3yzyd4",
              "author": "the_biometric_kid",
              "text": "Worded perfectly!",
              "score": 3,
              "created_utc": "2026-02-06 21:17:36",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3z204g",
                  "author": "scooter950",
                  "text": "Agreed. \n\nAlso, as someone in cyber for 8 years now, it took me 6 yrs of IT/sys admin to get there.\n\nThe entry to cyber is closer to mid career experience. Think of it like this, at least on the blue team side. How can you translate or audit the security requirements and vulnerability fixes if you don't know the technical processes/configurations.",
                  "score": 7,
                  "created_utc": "2026-02-06 21:27:46",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o43yjfa",
              "author": "mrrandom2010",
              "text": "As someone who has 5+ years of full stack software development with two companies, is it realistic to get some certs, do some projects, and look for a mid level position? Or would it be a complete career restart? \n\nI completed the “Google Cybersecurity Professional” course through Coursera and I’m planning to get my S+ and others later. \n\nAny advice for someone who would be interested in a lateral move?",
              "score": 1,
              "created_utc": "2026-02-07 17:14:40",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4410rm",
                  "author": "net_architect",
                  "text": "Realistically, most people don’t jump straight into a mid-level pure cyber role, but many do land mid-level hybrid roles where security is part of the responsibility - and then converge fully into security from there. Certs help signal intent, but your leverage comes from translating your dev experience into security problems you’ve already solved (or caused 😄). That story matters more than the cert list.",
                  "score": 4,
                  "created_utc": "2026-02-07 17:26:58",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3xyjtl",
          "author": "Redditthr0wway",
          "text": "Im going to be honest, that is the case with the majority of industries today. We are in an employers market, there are more job seekers in the US than there are job openings, and many of those are ghost jobs. No career field is guaranteed and have their own barriers to entry which in some cases can be even worse than cyber. But honestly the biggest thing I am personally seeing in this field is people limiting themselves. I see so many people saying the same 3 roles over and over again. Cyber isn't that limited of a field. There are tons of different niches, industries and more that it belongs in. Some of those roles are also very much in need of knowledgeable people who understand their industry. Look at nuclear, there is a need for people with cyber knowledge there but a lack of people who actually understand that industry. Same with law enforcement, OT security I believe also needs people too. I know just as many people in college who get cyber internships as people who do not, many of these people aren't unicorns either, hell I know people in cyber who snagged interviews and eventually got the internship just because they sent a follow up email. ",
          "score": 20,
          "created_utc": "2026-02-06 18:14:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4as4ph",
              "author": "Anxious_Health1579",
              "text": "I’m saving this comment, not because I’m in cyber security, but because it’s a great change in perspective. I have to remind myself this since I’m trying to break into UX/Product Design but looking to set myself with design strategy and human factors.",
              "score": 2,
              "created_utc": "2026-02-08 19:01:05",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3y3nnc",
          "author": "DJSmithyy",
          "text": "Well I know it sounds like you are based in the US but the UK is similar in the sense of a degree isn’t going to just land a job. I did however get quite lucky that I found an internship doing cyber and now work for said company after my degree currently doing cybersecurity for them. This all stemmed from just putting 100% in when I was an intern to prove myself hence why they kept me on, that said most of my friends I went to university with most if not all I know have jobs in cybersecurity now within 2 years of graduating so don’t see it as a why am I not getting anything you just have to get that golden ticket and if worst comes to worst don’t go straight into cyber start lower and work your way in",
          "score": 6,
          "created_utc": "2026-02-06 18:38:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3xxy8b",
          "author": "Karbonatom",
          "text": "Networking is really important. I was able to break into Cyber from who I knew not what I knew. Its not guaranteed but it can help. Joining your local DEFCON group (DC(areacode)) is one avenue, looking for various conferences or meetings like the FBI's Infosec-conference, They do those local to your state. Also keep an eye out on Discord groups they can have sections that posts jobs etc.",
          "score": 15,
          "created_utc": "2026-02-06 18:11:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o41fq04",
              "author": "After_Sir3979",
              "text": "Does that mean it is still possible to break I to cyber from college.. Of course after searching for half a year ;)? ",
              "score": 3,
              "created_utc": "2026-02-07 06:21:50",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o432c7k",
          "author": "LordNikon2600",
          "text": "I been saying this, but always some gaslighter in here saying otherwise:",
          "score": 3,
          "created_utc": "2026-02-07 14:32:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3y9meg",
          "author": "Sc0nnie",
          "text": "The path to cybersecurity is to already be an experienced network engineer or sysadmin.  The idea of starting in security with no IT experience is wrongheaded.  You cannot do the job without these skills.",
          "score": 8,
          "created_utc": "2026-02-06 19:07:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3zrhce",
              "author": "Pookias",
              "text": "This just isn’t true for everyone. I’m doing pretty well in this field coming from accounting. Then again I work for a pretty great company that actually invests in the resources to train and hire young people at a fortune 100 level of investment. People can learn the technical stuff on the job. It’s the soft/interpersonal skills that the vast majority of IT professionals lack. One of the most skilled people I’ve ever met where I work is really hard to talk to when having him explain something.\n\nIt’s crazy, we have a whole sub team of cyber professionals that had no previous experience, but were ex-police officers so they have great investigative skills. But this subreddit will tell you they aren’t good enough because they didn’t do help desk for 10 years. lol",
              "score": 1,
              "created_utc": "2026-02-06 23:43:11",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o42k5q3",
                  "author": "Sc0nnie",
                  "text": "“People can learn the technical stuff on the job” is exactly what imposters say.  This is not a soft skills job.  Anyone that tells you that soft skills are more important than technical skills for a technical job is engaging in anti intellectualism.\n\nThe fact that you complain about the “most skilled” person on your team is “really hard to talk to when having him explain something” shows us that you both resent each other because you are not equipped for the job and he is being forced to carry you.",
                  "score": 3,
                  "created_utc": "2026-02-07 12:38:34",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3y8tve",
          "author": "Joy2b",
          "text": "Many universities don’t want to have good IT professionals teaching about IT infrastructure in a proper test lab.  \n\nThat’s expensive and sounds too much like a trade school anyway. \n\nThe Deans are trying to cover the mistake now.  Many schools are now rushing to fill in for the missing major by offering “cybersecurity” but without building up to it, they’re failing students. \n\nIf they don’t have the staff and gear to teach a CCNA prep class, they don’t have them to teach to a CCNP or other ethical hacker, or challenging cybersecurity assessments. They might not have a CISSP on staff at all.  Who’s going to develop curriculums that cover cybersecurity standards? \n\nFor years, most of the jobs for network administrators and systems administrators and helpdesks didn’t have a degree requirement because many schools refused to invest in providing the key skills for keeping essential infrastructure running. \n\nThe employment pipelines out of many schools are broken because they haven’t been investing in the staff or the industry connections.",
          "score": 4,
          "created_utc": "2026-02-06 19:03:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3z66uz",
          "author": "Astral-projekt",
          "text": "Start working for yourself. You don’t need anybody else to start working.",
          "score": 2,
          "created_utc": "2026-02-06 21:48:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3zamot",
              "author": "cyberguy2369",
              "text": "expecially in cyber.. starting to work for your self with no experience, no past performance, and no tech social network is nearly impossible. who is going to trust their business, their intellectual property, or anything else to someone that has never done it before. \n\ncyber is the easy part.. the legal aspects, the federal rules and standards, the business side of things.. thats the hard part. ",
              "score": 3,
              "created_utc": "2026-02-06 22:10:47",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3zb4vd",
                  "author": "Astral-projekt",
                  "text": "I meant more like volunteer to do consulting. I agree with the heart of what you’re saying but I’m saying going above and beyond merely applying for jobs with your basic application is going to get you leaps and bounds ahead. I personally started my own business and started freelancing this work before getting hired, so I think everyone’s results might vary, along with an individuals effort, in a very competitive field.",
                  "score": 2,
                  "created_utc": "2026-02-06 22:13:23",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3zdyig",
          "author": "zainzuhair9",
          "text": "This is so true 😢😢",
          "score": 2,
          "created_utc": "2026-02-06 22:28:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o43y9rv",
          "author": "mrrandom2010",
          "text": "As someone who has 5+ years of full stack software development with two companies, is it realistic to get some certs, do some projects, and look for a mid level position? Or would it be a complete career restart? \n\nI completed the “Google Cybersecurity Professional” course through Coursera and I’m planning to get my S+ and others later. \n\nAny advice for someone who would be interested in a lateral move?",
          "score": 1,
          "created_utc": "2026-02-07 17:13:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o44a3h3",
              "author": "cyberguy2369",
              "text": "midlevel position? probably not. you'll have to start at the entry level.. full stack dev is not the same skillset as most cyber jobs. so unless you have some real world experience with networking, windows system admin, linux admin you'll start at the entry level.. even though you have 5+ yrs of experience in full stack development you dont have the skillset required or the foundation required for mid level position. \n\nthis would be a complete restart. ",
              "score": 3,
              "created_utc": "2026-02-07 18:11:51",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4c4396",
          "author": "WannaCryy1",
          "text": "Let me save you from something you will hit as you progress further. \n\nI feel bad for you having to fight to break in, but let me tell you what happens if and when you do. \n\nSo you done all this fighting to break in, and your in, you will quickly find once you land that job. You will begin fighting to do said job, to keep said job, and to justify said jobs pay. \n\nCyber Security is a Cost Center, the work is invisible, if you are doing your job, that means nothing happens. You will constantly be on the chopping block. When money tightens, you are first on the list. \"What do they even do, but cost/spend money, and complain.\" \n\nYour actual job is to spend money, and tell people NO, both being a drain, as well as a Blocker to the money makers. You are not appreciated, you are not needed, you are not critical, you are forcefully annoying. \n\nAll this to say TLDR, you dont just fight to get in, you fight every single day of your career. To try and make people see and understand things they dont want to see and understand. Fighting to get in, is simply the start of what a life in this career is going to look like. So if fighting to break in, is proving too much, I can tell you for a fact, you are not going to enjoy the constant fighting that follows.",
          "score": 1,
          "created_utc": "2026-02-08 23:04:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ym7s9",
          "author": "bloolynxx",
          "text": "What if you just lie about having a bachelor’s? I don’t think they check your diploma anyway.",
          "score": 1,
          "created_utc": "2026-02-06 20:08:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3yphtk",
              "author": "cyberguy2369",
              "text": "There are lots of services now the check for you and provide services that check for businesses we’ve had to start checking because of all the lying. \n\nIt’s a huge liability for a business. If a business is brought into court over some kind of cyber incident or case and they find they have employees that lied and misrepresented themselves on resumes. It opens up a lot of liability basically if a company isn’t smart enough to find employees that lie they aren’t smart enough to protect their data either it looks very bad in court.\n\nIt can cost the company millions if they survive the lawsuit at all",
              "score": 4,
              "created_utc": "2026-02-06 20:25:16",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o40kxen",
          "author": "DrHerbotico",
          "text": "You didn't mention once that you've attempted to get your own clients...",
          "score": 0,
          "created_utc": "2026-02-07 02:40:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o42dcs1",
          "author": "PlasticOpen588",
          "text": "i just submitted my application, bro ",
          "score": 0,
          "created_utc": "2026-02-07 11:42:09",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r0d48a",
      "title": "digital footprint cleaner: my research",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1r0d48a/digital_footprint_cleaner_my_research/",
      "author": "sairas_purnil",
      "created_utc": "2026-02-09 19:02:10",
      "score": 34,
      "num_comments": 23,
      "upvote_ratio": 0.97,
      "text": "hi there! I’ve been trying to clean up my online footprint after discovering that several people-finder and data broker sites were publishing surprisingly detailed profiles about me, including past addresses and even family connections. and honestly, that rabbit hole led me to data removal services, which claim to automate opt-outs from dozens (or hundreds) of these sites instead of doing it manually one by one.\n\nafter realizing how many providers exist, I decided to put together a comparison table for my own research and figured it might be useful to others here as well. The table compares multiple data removal services across things like geographic coverage, number of brokers monitored, recurring removals, transparency, and general usability.\n(comparison block included below)\n\n\nPricing & value\n- OneRep: 5-day trial; $8.33/mo (1) or $15/mo (up to 6). Family = expert + custom removals; Individual = fully automated.\n- DeleteMe (Abine): subscription (mostly annual/multi-year); benchmark ~$129/yr (1); couple/multi-year options.\n- Incogni (Surfshark): standard $7.99/mo (annual); Unlimited $14.99/mo (annual); Family up to 5.\n- Optery: free- paid tiers; e.g. Extended $14.99/mo, Ultimate $24.99/mo; ultimate adds human support + custom removals\n\nCoverage (people-finder  or data broker sites)\n- OneRep: 310+ sites.\n- DeleteMe: claims 976 brokers (published list).\n- Incogni: 420+ sites + (unlimited) 2,000+ for custom removals.\n- Optery: plan-based 640+ (or 400+); plus 1,125+ total via custom requests (ultimate).\n\nOngoing scans & recurring removals\n- OneRep: monthly scans + ongoing removals; new brokers added.\n- deleteMe: ongoing service with recurring opt-outs; quarterly reports.\n- incogni: recurring removals.\n- Optery: monthly automated scans & removals.\n\nReporting & visibility\n- OneRep: monthly email reports.\n- DeleteMe: dashboard + reports; quarterly privacy reports.\n- Incogni: dashboard + regular reports.\n- Optery: progress/risk reporting; some plans include before/after screenshots; quarterly reports\n\nThis started as personal research, so I’m very open to feedback and your experience! If you think I missed any important providers or criteria, feel free to point it out. I’d love to refine this into something genuinely helpful for people trying to choose a service without getting overwhelmed",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1r0d48a/digital_footprint_cleaner_my_research/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o4hdfgu",
          "author": "Sarah_Persy",
          "text": "oh, appreciate that you focused on recurring removals! That’s the part people often ignore, but personally for me it is a deal breaker. One-time cleanup doesn’t solve the long-term problem",
          "score": 10,
          "created_utc": "2026-02-09 19:10:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4i01h0",
              "author": "EndpointWrangler",
              "text": "That's true, you have to be consistent. I like that post as well!",
              "score": 5,
              "created_utc": "2026-02-09 21:01:46",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4hc51t",
          "author": "Karen_Jamesnb",
          "text": "it is actually one of the cleaner comparison posts I’ve seen. most lists online feel biased or half-baked. Having everything side by side really helps",
          "score": 3,
          "created_utc": "2026-02-09 19:03:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4nozek",
          "author": "valcure_richail",
          "text": "really solid breakdown, for sure, but I do have a few moments to notice: actually OneRep is one of the few that makes sense price-wise if you’re trying to protect more than just yourself. their family option is usually one of the better “cost per person” setups, so you actually keep it running long enough for it to matter",
          "score": 3,
          "created_utc": "2026-02-10 18:24:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4nt2eg",
              "author": "sairas_purnil",
              "text": "oh yes, did you have experience with it? I made this just taking info from the internet, but if you used them irl u should share insights!",
              "score": 2,
              "created_utc": "2026-02-10 18:42:35",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4ntqle",
                  "author": "valcure_richail",
                  "text": "yep, i tried a bunch of tools, but from my personal experience onerep is the most balanced. Once you put your info, everything is automated and removed from multiple sites with in few days to weeks.",
                  "score": 1,
                  "created_utc": "2026-02-10 18:45:34",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4hdnim",
          "author": "Jodi_Twombly",
          "text": "did u personally test any of these, or is this based purely on documentation and reviews? Curious how hands-on this was",
          "score": 2,
          "created_utc": "2026-02-09 19:11:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4he596",
              "author": "sairas_purnil",
              "text": "mostly documentation, user reports and trial dashboards where possible. I didn’t fully subscribe to all of them, but I tried to validate claims where I could. happy to update things if something’s inaccurate!",
              "score": 1,
              "created_utc": "2026-02-09 19:13:31",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4hdr7h",
          "author": "Tebina_Alfrea",
          "text": "I’m surprised how big the gap is between services that do recurring removals and those that don’t. that alone narrows the list a lot for me",
          "score": 1,
          "created_utc": "2026-02-09 19:11:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4he6vn",
          "author": "aJumboCashew",
          "text": "Cloaked is a decent service as well.",
          "score": 1,
          "created_utc": "2026-02-09 19:13:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4hg4gi",
          "author": "GeeKaba",
          "text": "Why do you have to do recurring removals ? Do these entities keep data even after you opt out ?",
          "score": 1,
          "created_utc": "2026-02-09 19:23:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ir5ne",
              "author": "reggaegirl420",
              "text": "I think they'll acquire data again or from another source as you continue to use Google, your phone, maps apps, Amazon, etc., which all collect and sell your data constantly. I understand these sites as removing the data brokers already have, but it doesn't block them from acquiring it again. Now THAT is something I'd pay for!",
              "score": 1,
              "created_utc": "2026-02-09 23:20:14",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4lpqcz",
                  "author": "techMari",
                  "text": "This, data brokers keep reacquiring data from new sources. So basically, every time you sign up for something, buy something, update an address, or subscribe to a newsletter, that info can be sold or shared again to data brokers, rebuilding your profile in their databases. That's why Incogni does regular monitoring and not just one-time clears. Full disclosure: I'm on the team at Incogni.",
                  "score": 1,
                  "created_utc": "2026-02-10 12:20:28",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4l4uvz",
          "author": "shangheigh",
          "text": "nice research, very detailed, helps compare services easily, recurring removals and reporting seem most important for real privacy protection, would love updates if you refine table further",
          "score": 1,
          "created_utc": "2026-02-10 09:18:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4l7q2n",
          "author": "FishingSuitable2475",
          "text": "This is a solid breakdown of the \"big four,\" but it highlights a significant gap in the current market: most standard services only hit the top layer of the iceberg. While 400 to 600 brokers sounds comprehensive, it leaves a massive vacuum for the thousands of smaller, deep-web scrapers that actually fuel those \"shadow profiles\" and lead to re-indexing.  \n  \nIf you’re looking for a more aggressive \"deep clean,\" it’s worth checking out CrabClear. It automates removals across 1,500+ data brokers, which is a massive jump from the usual 420 600 sites covered by providers like Incogni or DeleteMe. By hitting the mid-tier and niche aggregators that the bigger services often overlook, you actually stop the cycle of your information trickling back up to the major people-finder sites.",
          "score": 1,
          "created_utc": "2026-02-10 09:46:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4m7q1i",
          "author": "techMari",
          "text": "Great comparison, OP. I'd also like to add to Incogni's pricing and value that there's a new plan for the US customers, called Incogni Protect. It offers 24/7 dark web monitoring, $1M identity theft insurance and credit monitoring in addition to our personal data monitoring and removal from data brokers. The plan is available for an additional cost of 5.76 USD per month for annual plans.\n\nAnother key differentiator for Incogni is that our coverage extends beyond traditional people search sites and marketing data brokers. We also include higher risk data brokers, that are involved in risk mitigation, recruitment and financial information. For full disclosure, I'm on the team at Incogni, hope you find this helpful!",
          "score": 1,
          "created_utc": "2026-02-10 14:09:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4npo5f",
          "author": "Donna_Murrall",
          "text": "did you consider how transparent the reports are? Some dashboards just say “working on it” without specifics. That drives me crazy.",
          "score": 1,
          "created_utc": "2026-02-10 18:27:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4nqrvd",
              "author": "sairas_purnil",
              "text": "yep, reporting quality was part of the evaluation, services that show which brokers were contacted and what status they’re in scored higher for me",
              "score": 1,
              "created_utc": "2026-02-10 18:32:10",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4nrqwx",
                  "author": "Donna_Murrall",
                  "text": "oh, gotcha, thank you! im actually juset skeptical because someties reportin not even close to reality",
                  "score": 1,
                  "created_utc": "2026-02-10 18:36:36",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4o1p8v",
          "author": "ciariopo",
          "text": "Onerep stands out in the table for coverage and automation and it was the reson why I’ve been using it for a while and the recurring removals are what sold me. Manual opt-outs were unsustainable while havinf such took",
          "score": 1,
          "created_utc": "2026-02-10 19:22:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4q36n0",
          "author": "EntireAioli5369",
          "text": "You’re paying for peace of mind more than anything else. Which, I can understand. Just don’t make the mistake of thinking that you can truly get your data off the internet. If someone wants to find you, they will",
          "score": 1,
          "created_utc": "2026-02-11 01:39:34",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qwmzqt",
      "title": "Got a SOC job, overwhelmed and confused about learning. Need help.",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qwmzqt/got_a_soc_job_overwhelmed_and_confused_about/",
      "author": "Appropriate_Try_7040",
      "created_utc": "2026-02-05 14:39:33",
      "score": 18,
      "num_comments": 10,
      "upvote_ratio": 0.86,
      "text": "Hello everyone. I've got a SOC analyst job and I don't have SOC experience beforehand. \n\nI'm in Week 1 of my job and I am feeling very overwhelmed. There are so many different tools that my org uses (Splunk, Defender, etc) to solve the alerts. I know it's just Week 1 but honestly I'm feeling anxious and confused about how do I exactly start learning? I have my senior ready to help but they are not the one for spoon feeding. \nHow to do you learn triaging the alerts? Whenever I see an alert my mind just goes blank not knowing where to start. There's so much information coming from different tools and I don't know where to look at.\n\nTo those who've had such experience in their earlier days, please shed some light on how to navigate this phase. ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qwmzqt/got_a_soc_job_overwhelmed_and_confused_about/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o3qdlk4",
          "author": "Ok-Success-7067",
          "text": "Understand Splunk first. You need to learn how to find logs in the SIEM. If you read the Defender log, it usually tells you what it is seeing. Look in the logs for the computer name and user name that is detected, and look an hour around the time of the detection. 90% of the time if you focus on one hour around the detection you will have a good idea of what happened.",
          "score": 16,
          "created_utc": "2026-02-05 15:39:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3qg80b",
              "author": "Appropriate_Try_7040",
              "text": "Thank you! I'd start with that then",
              "score": 1,
              "created_utc": "2026-02-05 15:51:57",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3qu3kt",
          "author": "NeverBeASlave24601",
          "text": "Start learning Splunk in depth, start here - https://www.splunk.com/en_us/training/course-catalog.html?sort=Newest&filters=filterGroup1FreeCourses\n\nLearn defender - https://learn.microsoft.com/en-us/training/courses/sc-200t00\n\nStart aiming towards some certs, Splunk core certified user then splunk power user and also work towards Microsoft SC200.\n\nAnd if you don’t have it already you should start working towards comptia Security+\n\nDon’t be afraid to ask questions.",
          "score": 7,
          "created_utc": "2026-02-05 16:55:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3q6h4g",
          "author": "yoursweetbippyy",
          "text": "Not in SOC, but in an MSP where we do monitoring. \n\nDo you have co workers other than your boss? I ask my coworkers any question I can't figure out on my own/ Google/ check on ai agents. \n\nGood luck! Don't overthink too much and just try your best",
          "score": 6,
          "created_utc": "2026-02-05 15:05:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3q97kt",
              "author": "Appropriate_Try_7040",
              "text": "I have one who's very knowledgeable about this but he doesn't directly work with my and my boss. Not that my boss isn't approachable, but I don't want to make him think like I'm a complete noob.",
              "score": 1,
              "created_utc": "2026-02-05 15:18:51",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3qgc0u",
                  "author": "yoursweetbippyy",
                  "text": "It's your first week. Depends on the boss, but you should definitely try to ask questions. Otherwise you could get reprimanded for not asking, taking too long on a task etc. \n\nI would ask someone for help and if you can't figure it out then go to your boss. Tell them that you are stuck on something and need a refresher.",
                  "score": 2,
                  "created_utc": "2026-02-05 15:52:27",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3v509k",
          "author": "AddendumWorking9756",
          "text": "The blank mind thing when you see an alert is totally normal in week one. You're trying to process way too much at once.\n\nHere's what helped when we were training analysts at our company. Break down every alert into a simple workflow: who or what triggered it, when did it happen, what asset is affected, and is this normal for that asset. Even if you don't know the answer to all of those, that gives you a starting point for asking your senior.\n\nFor Splunk specifically, start with just learning how to pivot. If you see a source IP in an alert, learn how to search for all activity from that IP around the same timeframe. Same with usernames and hostnames. Don't worry about complex queries yet, just get comfortable navigating.\n\nThe overwhelm usually comes from trying to learn the tools AND the investigation process at the same time. Focus on the investigation logic first since that transfers across any tool. When we built CCDL1 at CyberDefenders, that's exactly what SOC managers from Mandiant and PwC kept emphasizing. The actual triage and escalation workflow is what trips up new analysts, not the tools.\n\nGive yourself a few weeks. Week one is supposed to feel chaotic.",
          "score": 5,
          "created_utc": "2026-02-06 07:31:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3qa5r0",
          "author": "[deleted]",
          "text": "[deleted]",
          "score": 1,
          "created_utc": "2026-02-05 15:23:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3qago3",
              "author": "Appropriate_Try_7040",
              "text": "I didn't quite understand this logic. Good pay",
              "score": 1,
              "created_utc": "2026-02-05 15:24:59",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4lem19",
          "author": "Murky-Ad6718",
          "text": "Hi all, I work as a fraud specialist for JP MORGAN CHASE. I want to up-skill myself with cybersecurity and move up the ladder. However, I do not have a degree. I got the job because of my past experience. I don’t want to be stuck doing the same thing for 8-12LPA/$10-$12k a year. I am unsure about what to do to get a high paying and a decent job something I can enjoy working as. Do I need to get a degree or should I invest in courses. If courses then what are the courses I should pursue. Please guide. I am an absolute beginner in this",
          "score": 1,
          "created_utc": "2026-02-10 10:50:49",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r0655k",
      "title": "How can I get into CyberSecurity?",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1r0655k/how_can_i_get_into_cybersecurity/",
      "author": "brpmaker",
      "created_utc": "2026-02-09 14:49:04",
      "score": 18,
      "num_comments": 24,
      "upvote_ratio": 0.88,
      "text": "I'm currently in college taking my first year. im majoring in computer science but I would like to become a chief security officer of a cybersecurity firm or eventually start my own. what are some ways I could get hands on with cyber security and learn the basics of coding? Im not looking to get a job in the field rn as i understand itll take me a while, I just want to brush up my skills and learn new things so when its time I am ready",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1r0655k/how_can_i_get_into_cybersecurity/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o4fzr59",
          "author": "cyberguy2369",
          "text": "walk over to your universities it dept \"hi, I'm a cs student, I am looking for opportunities to work and get experience\" then walk over to the cs dept. \"hi, I'm a cs student, I'm looking for opportunities to work and get experience\"\n\nyou wont start in \"cyber\" but you will start seeing how real networks and tech work in a real world environment. over time you can move into more cyber related roles. \n\noutside of that join any club or organization in the CS dept, business school, and the university where you can network, meet people and gain experience. \n\nlook in your community for \"tech meetup\" or \"cyber meetup\" show up.. get involved.. meet people. \n\ndont just do the classwork.. expand on it.. use your resources.. (professors, labs, and other university resources)",
          "score": 10,
          "created_utc": "2026-02-09 15:13:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4h8ky2",
              "author": "Nessuwu",
              "text": "What if I'm in a different state than the university I went to, will local universities take kindly to this?",
              "score": 1,
              "created_utc": "2026-02-09 18:47:14",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4hcnfa",
                  "author": "cyberguy2369",
                  "text": "people move around and go to out of state schools all the time. that doesnt matter.. what matters is the effort you put in. applying on linkedin blindly is not a good use of your time. \n\nI say this a lot in this channel, but it's worth repeating:  \nLet’s take a step back and think about cybersecurity and the companies in this space.  \nCybersecurity is one of the hottest career fields right now. Everyone wants in, mostly because they’ve heard that’s where the money and opportunity are. So here’s the question: if you’re a strong, well-run cybersecurity company that treats its employees well, offers real training and growth, and has plenty of work, do you really need to advertise on LinkedIn to find talent?  \nChances are, no. That kind of company probably already has:\n\n* A stack of resumes in HR’s inbox\n* Former employees trying to return\n* Current employees referring friends who are eager to join\n\nNow let’s look at the jobs you *do* see on LinkedIn and similar sites. They tend to fall into a few categories:\n\n* **Ghost jobs** – posted to give the illusion of growth to shareholders, with no real intent to hire\n* **Resume collectors** – companies stockpiling applicants “just in case,” or monitoring industry trends\n* **Clueless postings** – they don’t know what they want or need\n* **Terrible offers** – the job is posted because no one wants it due to bad pay, bad culture, or bad leadership\n\n",
                  "score": 1,
                  "created_utc": "2026-02-09 19:06:22",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4g0o3o",
          "author": "PortAuthority69G",
          "text": "As a freshman, something you might hear over and over again is, \"Do internships!\" and \"Your network is your net worth!\" That advice is correct.",
          "score": 3,
          "created_utc": "2026-02-09 15:18:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ijjso",
          "author": "hollaSEGAatchaboi",
          "text": "Job fairs through your department. It may seem like a shot in the dark, but it isn't. You'd flip if I told you what department I was in, but I got a decade-long career out of it and competitive pay I took along with me to a second career.",
          "score": 3,
          "created_utc": "2026-02-09 22:40:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4fv35o",
          "author": "AutoModerator",
          "text": "Hello,\n\nYour submission was automatically removed because your Reddit account does not meet our minimum karma or account age requirements. These measures help maintain the quality of posts on r/cybersecurity and prevent spam.\n\nRequirements:\n- Minimum of 20 comment karma OR 20 link karma\n- Account age of at least 10 days\n- Combined karma of at least 40\n\nTo build your karma, participate in discussions across Reddit and contribute thoughtful content in subreddits that welcome new users.\n\nIf you believe this was a mistake or have any questions, please message the mod team.\n\nThank you.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CyberSecurityAdvice) if you have any questions or concerns.*",
          "score": 2,
          "created_utc": "2026-02-09 14:49:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4g33mc",
          "author": "Acceptable_Simple877",
          "text": "IT internships",
          "score": 2,
          "created_utc": "2026-02-09 15:30:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4goyae",
              "author": "brpmaker",
              "text": "do you know where i could look for any ?",
              "score": 1,
              "created_utc": "2026-02-09 17:14:40",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4htipl",
                  "author": "Acceptable_Simple877",
                  "text": "LinkedIn",
                  "score": 1,
                  "created_utc": "2026-02-09 20:29:51",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4glfoc",
          "author": "Joy2b",
          "text": "Building tools useful in cybersecurity work is a good free time step for a coder.  Take a look at some of the classics like the sysinternals tools and kali linux, see where there’s room for you to make them more fun or functional.  Look for your local hacker space or Linux user groups and conferences. You want to be able to learn  and teach common security concepts before year 4.  \n\nTo stay motivated to learn outside of class, start a habit of chasing a certification or two a year. Start shopping with ISC2, Comptia, Cisco, Linux, Microsoft, Google. \n\nYou’ll be surprised how often a bigger picture view helps you understand full stack programming, and how that feeds back into understanding the networks.  \n\nDo you have pet projects, repairing old computers or whatever?",
          "score": 2,
          "created_utc": "2026-02-09 16:57:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4gov0e",
              "author": "brpmaker",
              "text": "thank you for the advice ill definitely look into it, ive heard of kali linux but i didnt really know what it was, and no ive never had a project to work on or anything of that nature, whats a early project you recommend i could do to get a head start?",
              "score": 1,
              "created_utc": "2026-02-09 17:14:14",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4h36iw",
                  "author": "Joy2b",
                  "text": "Oh wow, you’re new, let’s get you launched. \n\nOpen up YouTube, start a new profile for studying, and seed it by enrolling in Messer’s A+ class, and doing searches like this weekly, Kali Linux, raspberry pi projects, Krebs, security news. \n\nMesser is very easy listening. He’s going to make sure you have enough of a vocabulary and broad understanding to be able to keep up in technology conversations.  Hopefully half the course is a refresher. \n\nAfter Messer you deserve some spice, so look up Tarah Wheeler, Deviant pentesting, hacking competitions.  \n\nAbsolutely do not skip over suggestions of tutorials from command line cat girls, they are often absolute ninjas with OPSEC.",
                  "score": 3,
                  "created_utc": "2026-02-09 18:22:03",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4iefo5",
          "author": "Adventurous_Pen_7892",
          "text": "Ask around local Middle/Elementary schools and see if their IT Department can provide Internships or even jobs while going to college.",
          "score": 2,
          "created_utc": "2026-02-09 22:13:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4l66uh",
          "author": "TheOGCyber",
          "text": "You need to learn IT fundamentals first.  Hardware/software, operating systems, networking, virtualization, cloud computing, programming/scripting, IoT, ICS/OT, and AI.\n\nYou must have a strong knowledge of IT fundamentals if you want to work in cybersecurity.",
          "score": 2,
          "created_utc": "2026-02-10 09:31:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4m2r3h",
              "author": "brpmaker",
              "text": "any videos or websites you recommend i go through to learn? and are there any hands on tools for me to use that youd recommend?",
              "score": 1,
              "created_utc": "2026-02-10 13:42:13",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4m8hf3",
                  "author": "OverZiHD",
                  "text": "try hack me pre security and cyber security 101 paths",
                  "score": 2,
                  "created_utc": "2026-02-10 14:13:25",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4grrst",
          "author": "Surfnazi77",
          "text": "How do you feel about joining the military after graduation?",
          "score": 1,
          "created_utc": "2026-02-09 17:28:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4jx975",
              "author": "brpmaker",
              "text": "with the way the government is rn i doubt anything would attract me to work a gov position",
              "score": 2,
              "created_utc": "2026-02-10 03:23:41",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qvypkr",
      "title": "Huge spam of \"attempted logins\" from Zendesk addresses",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qvypkr/huge_spam_of_attempted_logins_from_zendesk/",
      "author": "nkarl7",
      "created_utc": "2026-02-04 19:44:51",
      "score": 14,
      "num_comments": 6,
      "upvote_ratio": 0.95,
      "text": "As per title, I've been receiving tens of (what I believe to be) phishing attempts from services using Zendesk emails, such as Codecademy, Dropbox, Medium and others.\n\nThey're all in the form of either:\n\n* An account already exists for <x> using this email address. To access it, you can sign in or reset your password.\n* Welcome to <x>. Complete your sign-up to activate and access your account.\n\nMail headers and links seem legit at first glance, so beware.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qvypkr/huge_spam_of_attempted_logins_from_zendesk/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o3l9n8b",
          "author": "jackun",
          "text": "At least Gmail spam filter started to work now",
          "score": 1,
          "created_utc": "2026-02-04 20:02:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3m4fml",
              "author": "nkarl7",
              "text": "Yeah, I've noticed that as well  \nUnfortunately a lot of them are still going through",
              "score": 1,
              "created_utc": "2026-02-04 22:31:26",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3ld9gv",
          "author": "Exagone313",
          "text": "I'm affected by this too, on my Git email that is generally used by spammers.",
          "score": 1,
          "created_utc": "2026-02-04 20:20:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3m3n04",
          "author": "nkarl7",
          "text": "As an additional detail, the spammers seem to always append an alias to your address.  \ne.g.: \"yourmailhere+somecharacters\"",
          "score": 1,
          "created_utc": "2026-02-04 22:27:25",
          "is_submitter": true,
          "replies": [
            {
              "id": "o3m68x5",
              "author": "kttmt",
              "text": "I got something like myname+epstein@gmail.com :/",
              "score": 1,
              "created_utc": "2026-02-04 22:40:39",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qwie2f",
      "title": "Considering Getting into cybersecurity with absolutely no experience other than I can use a computer decently well",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qwie2f/considering_getting_into_cybersecurity_with/",
      "author": "Old-Investment-8337",
      "created_utc": "2026-02-05 11:03:59",
      "score": 14,
      "num_comments": 12,
      "upvote_ratio": 0.85,
      "text": "Can anyone get me started on where to start learning? Id like to eventually get into digital forensics but thats pretty far off. So yeah like anyone got any community hubs like discord, or websites.\n\nAnd any videos where I can start learning the basics, and a place where I can do assignments for hands on experience.\n\nThanks!",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qwie2f/considering_getting_into_cybersecurity_with/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o3p6uve",
          "author": "Aware-Platypus-2559",
          "text": "honestly you are going to hear this a lot but cyber is rarely an entry level role. you cannot really secure a network if you do not understand how the traffic actually moves or how the underlying OS handles files. most of the guys i know who are actually good at forensics spent years grinding in helpdesk and sysadmin roles first. you have to break things and fix them a thousand times to understand the logic before you can figure out how someone else broke in. start with the boring foundational stuff like Network+ because if you skip the basics you will just be memorizing tools without knowing how to use them.",
          "score": 14,
          "created_utc": "2026-02-05 11:25:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3p71qb",
              "author": "Old-Investment-8337",
              "text": "Great advice thank you",
              "score": 1,
              "created_utc": "2026-02-05 11:27:09",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3pi2ed",
          "author": "StatusFoundation5472",
          "text": "I am going to tell you a really interesting site that aspired cyber security and ethical hackers use to hone their skills. it's called hack the box.\n\nhttps://www.hackthebox.com/\n\nI used it to sharpen my skills. It is excellent or at least it was when I used it. Check it out!",
          "score": 4,
          "created_utc": "2026-02-05 12:48:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3q0rqh",
          "author": "AJLindner",
          "text": "Make an account on TryHackMe and start going through their free roadmaps and learning paths.  \n[https://tryhackme.com/](https://tryhackme.com/)\n\nAlso take a look at OverTheWire, the Bandit wargame is meant for beginners:  \n[https://overthewire.org/wargames/bandit/](https://overthewire.org/wargames/bandit/)\n\nAlso PicoCTF is beginner friendly:  \n[https://picoctf.org/](https://picoctf.org/)\n\nAll of these are hands on. Go broad at first and find what really gets you excited, then you can dive deeper. But like u/Aware-Platypus-2559 said, cybersec is not an entry level role in most cases, and the typical path includes cutting your teeth in helpdesk/IT/sysadmin roles before moving into a proper cybersec position.",
          "score": 3,
          "created_utc": "2026-02-05 14:35:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3q4xq2",
          "author": "AAA_battery",
          "text": "Security isnt entry level you will need a solid mastery of IT fundamentals first. See if you can build yourself a virtual machine home lab. you will learn alot",
          "score": 3,
          "created_utc": "2026-02-05 14:57:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3sfclx",
          "author": "Extra-Affect-5226",
          "text": "Everyone starts with no experience, so you’re in a good spot. Start by learning the basics like networking, operating systems, and security fundamentals.\n\nTryHackMe and Hack The Box are great for beginner hands-on labs, and YouTube channels like Professor Messer are excellent for learning the basics.\n\nYou can also check out SecPro Academy, they have beginner-friendly training and hands-on guidance to help you get started in cybersecurity.\n\nJust stay consistent and keep practicing.",
          "score": 3,
          "created_utc": "2026-02-05 21:23:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3y7jkt",
          "author": "Ok_Wishbone3535",
          "text": "The first question I have to ask is why?  Why are you thinking of joining this field?  If it's for job security and high pay... that ship has sailed for a lot of the jobs considered cyber.  They've gone to India.  Also cyber isn't entry.  We tend to want people with IT Experience.  The market is flooded with CompTIA sec+ holders with zero experience.  Holders went from 500,000 in 2019 to 1,000,000+ due to the hype train.",
          "score": 2,
          "created_utc": "2026-02-06 18:57:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3smli8",
          "author": "wizarddos",
          "text": "How about TryHackMe? A nice place to start with many labs, including ones on digital forensics  \n[https://tryhackme.com/](https://tryhackme.com/)",
          "score": 1,
          "created_utc": "2026-02-05 21:58:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3uewq0",
          "author": "No_Battle_3866",
          "text": "google cybercert and tryhackme",
          "score": 1,
          "created_utc": "2026-02-06 04:07:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3vndyg",
          "author": "e38nN13PXb14Rz",
          "text": "Good thing is you have an idea of what you want to specialize in. Getting a solid understanding of networking, experience with various OS are fundamental to success. \nTake a forensic course as you must understand the law, for example chain of custody. \nForensics tools are expensive and open sources versions are very few. This one offers free version and tutorials. https://www.autopsy.com. \n\n##Cybersecurity career mentor.",
          "score": 1,
          "created_utc": "2026-02-06 10:25:41",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qvo8wp",
      "title": "Any advice for a fresher in cybersecurity?",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qvo8wp/any_advice_for_a_fresher_in_cybersecurity/",
      "author": "Necessary-Tip-2734",
      "created_utc": "2026-02-04 13:14:46",
      "score": 14,
      "num_comments": 23,
      "upvote_ratio": 0.89,
      "text": "I am currently a first year student doing a BE in cybersecurity. I was thinking of going for masters. I know it's still too early for me to be asking this but what kind of projects or certificates should I be working towards to get a job after college?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qvo8wp/any_advice_for_a_fresher_in_cybersecurity/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o3j4sim",
          "author": "cyberguy2369",
          "text": "get a job in tech.. today.. real world in person job experience trumps anything you can do at home (certs, homelab, etc)\n\nwalk over to the IT dept of your university \"hi I'm a cyber security student looking for a experience and a job, what kind of opportunities are available on campus? \"\n\nthen walk over to the cyber security dept on campus \"hi I'm a cyber security student looking for a experience and a job, what kind of opportunities are available on campus? \"",
          "score": 12,
          "created_utc": "2026-02-04 14:02:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3kqnkt",
              "author": "CreaTeBear",
              "text": "Please do this if you’re in college! I have an info sec job now because I worked for my colleges IT department part time for 2 years. Nobody ever thinks about doing this because they’re chasing internships elsewhere. I’m sure they have something open for student workers at almost any college",
              "score": 3,
              "created_utc": "2026-02-04 18:35:34",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3plcan",
                  "author": "Dr3xii",
                  "text": "would you recommend an in internship or working for your school ?",
                  "score": 1,
                  "created_utc": "2026-02-05 13:09:15",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3jbrby",
          "author": "S4LTYSgt",
          "text": "Dont get a masters until you are Mid-year. \nWait like 5-10 years after you have solid experience. \n\nCerts are not something you should worry about right now. Focus on your studies. Build core IT Skills. Learn from your classes. \n\nAsk chatgpt “what kind of projects can I work on while. College student, here are the resources I have available, here is my budget(if you have any budget) or for free.” \n\nDont those labs towards your junior year. You still need to build skills. Heck you might end up like cloud or something else. Just focus on school for now. No need to rush, IT is a long term career",
          "score": 4,
          "created_utc": "2026-02-04 14:38:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3n5x1p",
              "author": "its_all_bueno_here",
              "text": "I second waiting on certs for now. Especially since the cost of a certification may be covered by your employer. Focus on projects and document your leanings in a blog",
              "score": 1,
              "created_utc": "2026-02-05 01:58:47",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o3pm7ka",
              "author": "Dr3xii",
              "text": "Id acc disagree, wouldnt it make sense to get certs and do labs so you can land an entry level like a SOC? I mean getting a masters with 0 hands on experience would be questionable",
              "score": 1,
              "created_utc": "2026-02-05 13:14:31",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3qg4wt",
                  "author": "S4LTYSgt",
                  "text": "Not now. He is a first year college student. Sec+ and Blue Team 1 maybe his senior year. But cyber isnt entry level anyways. Most SOC positions require some IT/Tech experience. But the labs and stuff he can do like sophmore junior year to help land internships. Its too early to do certs and all of that",
                  "score": 1,
                  "created_utc": "2026-02-05 15:51:30",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3iyq3s",
          "author": "Sivyre",
          "text": "It’s not so much the certs that will get you a job per se, it’s more so the networks you establish through available resources during your program that speak volumes. Make use of the schools partnerships to establish internships and coops when the time comes to help get you foot in the door to get experience which is of so much more value than a cert.\n\nIn the meantime read and study the A+, Sec+ and Network+ (can skip the ones you know or skim through) but don’t yet challenge the exams. The content is freely available on YouTube and elsewhere on the internet but they will set the tone and contain the foundations of what someone in cybersecurity would need to know.\n\nDon’t worry about projects unless you have an idea and a deep desire but I would hope your institution has a capstone to do before graduation and that will be your project.\n\nYou’re in your first year so I always advise to not worry about these things until it is clear that this is what you want. I don’t know the statistics but from personal experience in that first year I watched probably close to 40% of my classmates drop out or switch later and they too were all concerned for the certs and future prospects until it dawned on them that CS wasn’t for them.",
          "score": 4,
          "created_utc": "2026-02-04 13:28:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3jlco0",
          "author": "Various_Afternoon_56",
          "text": "Get some project going, and some intern first. As for the cert. Cissp is a good one that most go for.",
          "score": 2,
          "created_utc": "2026-02-04 15:26:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3lmlok",
              "author": "CausesChaos",
              "text": "Yeah it's not a beginner cert though",
              "score": 1,
              "created_utc": "2026-02-04 21:05:06",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3k3yqg",
          "author": "jirajockey",
          "text": "I always tell noobs to the industry to get an entry level in SOC/NOC, hosting, networking etc.  \nAs for certs that interest me in a candidate, Network +, Linux + and Security + in that order.  \nI'm on a hiring freeze right now, my team of security analysts (remeadiation/networking/firewall) L2-L4s, are a \"feed\" to the Research, SOC and NOC teams. I \"feed\" from the L1 Hosting account managers.  \nAnd I love to see a healthy github of associated projects or involvment in others.",
          "score": 2,
          "created_utc": "2026-02-04 16:51:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3oz0xv",
              "author": "Necessary-Tip-2734",
              "text": "My parents have been telling me to do an internship in the second year itself. But I don't know much yet. Could you please tell me what they will look at while hiring as I don't think I can build any projects or stuff right now. I have thought to do the google cybersecurity cert from coursera tho",
              "score": 2,
              "created_utc": "2026-02-05 10:15:16",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3pqdpl",
                  "author": "jirajockey",
                  "text": "If the school can get you a meaningful internship that's great, I know UNB (local uni) has such programs, but our company has never offered such places, UNB are always asking me. I know some smaller local security companies do offer internships, beauceron, bulletproof and the local power company which look \"meaningful\".  \nWe try to get the kids involved in our local BSides, a good way to meet other employers. Google cybersecurity sounds like a good addition.  \nProjects can be simple bash/python scripts, for example one of my hires made a short course on how to set up spf, dkim and dmark, not exactly unique content, but I liked the attention to detail and the presentation, not really related to the role.",
                  "score": 1,
                  "created_utc": "2026-02-05 13:38:43",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3kms15",
          "author": "Affectionate-Cod8134",
          "text": "Do a master degree \nDo at least one valuable certification (pls not comptia sec+)\nBuild things\nHost a blog\nDo CTFs\nMake writups\nDo bug bounty\nRoses are red\nViolets are blue\nCybersecurity market is saturated\nYou will struggle too",
          "score": 2,
          "created_utc": "2026-02-04 18:18:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3pmubq",
              "author": "Dr3xii",
              "text": "why not sec+???",
              "score": 2,
              "created_utc": "2026-02-05 13:18:16",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3y2mza",
                  "author": "Key-Choice6421",
                  "text": "It used to be the main certification to get to land a job in cyber but now all of the people in cyber with actual jobs look down at the newer people coming in and tell them it’s useless even though its the same thing that got them their job in the first place. On top of that there’s way more competition now.",
                  "score": 1,
                  "created_utc": "2026-02-06 18:33:57",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3j79xb",
          "author": "arihoenig",
          "text": "It's never too soon to be doing projects. You should have been doing projects since middle school, ideally. If you had been doing that, then certifications would be unnecessary.",
          "score": 3,
          "created_utc": "2026-02-04 14:15:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3lbnuf",
          "author": "Kilow102938",
          "text": "Good luck \n\nBeen trying for a bit after working as a network admin, knocking out network plus, associates in networking and bachelor in security, CEH, 1 year help desk,  4 years information security specialist is cryptography for card payment systems and then now 6 years with information security analyst 2 for reviews APIs before going into production. \n\nNETWORK!!! Attend what you can and meet people. \n\nLife is about who ya know not what you know.\\\nIdc who argues that I know some stupid people in positions they don't belong in because they know someone.",
          "score": 1,
          "created_utc": "2026-02-04 20:12:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3op5cp",
          "author": "Ordinary-Ad-3670",
          "text": "sec+ is needed for a lot of roles and a good place to start, get it like a year before you graduate  \nbachelors is all you need to get working and the experience will do you better than a masters\n\nbecome friends with your teachers, the good ones, trust\n\nadvice; winners stop posting, take all the doomscrolling with a grain of salt, there is work, finish your degree and learn as much as you can. the highly motivated individuals will be in your university's clubs and soc programs. join them and compete/learn with them.",
          "score": 1,
          "created_utc": "2026-02-05 08:39:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4dm2uf",
          "author": "bluecrystal11",
          "text": "It’s great you’re thinking early. Focus on strong fundamentals (networking, OS, basic security concepts), try small hands-on projects like labs or CTFs, and learn tools as you go. Certificates can help later, but practical skills and consistency matter more at this stage.",
          "score": 1,
          "created_utc": "2026-02-09 04:07:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4lcpkj",
          "author": "AddendumWorking9756",
          "text": "It's actually not too early at all, this is the right time to start building.\n\n  \nFor certs, Security+ is the standard baseline that gets you past HR filters but honestly everyone has it. What separates people in interviews is being able to show you can actually do stuff, not just pass exams. So focus on building a portfolio of practical work alongside your coursework.\n\n  \nProjects that actually matter for getting hired: set up a home lab with something like Security Onion or Wazuh, practice analyzing real malware samples and pcaps, write up your findings like you would in an actual incident report. Those writeups become your portfolio.\n\n  \nFor hands-on practice, CyberDefenders has free labs you can start with right now that give you real investigation scenarios to work through. Good way to build skills and have something concrete to show employers. If you decide SOC is your path later, they also have CCDL1 which is specifically for entry-level SOC analysts and the exam is entirely hands-on.\n\n  \nOne more thing since you mentioned masters, honestly in this field experience and practical skills matter way more than another degree. A masters can help for specific roles later but don't prioritize it over getting real experience.",
          "score": 1,
          "created_utc": "2026-02-10 10:33:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3luxri",
          "author": "Individual-Meet-6271",
          "text": "Its not early to ask for this. I would say you should get a ”hiring signal” certificate like Security+/ CySa or whatever suits your path best. \n\nAnd then you should back it up with hands on homelabs that you similulate in your OWN enviroment, not online labs.\n\nWith this method, you balance both looking attractive for a hiring manager whilst also getting the knowledge and experience",
          "score": 0,
          "created_utc": "2026-02-04 21:44:51",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qwdrr6",
      "title": "Torn between upgrading to either a MacBook Pro M4 or M5, or a Windows Laptop with either an equivalent Snapdragon, AMD or Intel chip?",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qwdrr6/torn_between_upgrading_to_either_a_macbook_pro_m4/",
      "author": "Al_Muhareb2401",
      "created_utc": "2026-02-05 06:24:08",
      "score": 11,
      "num_comments": 17,
      "upvote_ratio": 1.0,
      "text": "I've been using Gaming laptops for over 5 years now and as a student in Univeristy its very difficult to carry around due to the weight of both the laptop and the charger, its very slow even with the charger constantly plugged in and without it its practically a potato, it has a very tiny battery life barely lasting under an hour, it tends to overheat as well. Clearly I would wnat to upgrade.\n\nFor context I am doing a degree Majoring in Cybersecurity and Criminology.   \n  \nI've always leaned towards a Macbook with either an M4 or M5 chip for performance, lightweight, UI, etc. but since theres a common problem with running Cybersecurity tools I've always gone for Windows.\n\nHowever, now I am thinking of building a NAS Home Server (for many different reasons), which would might be able to host and run thigns that are incompatiable with Mac such as VMs as well as Cybersecurity Tools. But as I spoke to a salesman about upgrading to a Mac Pro with either an M4 or M5 Chip, he told me that going with a Windows laptop with either a Snapdragon or AMD chip would be a better choice (It might also make using Cyberseurity tools easier to use since I'm not 100% sure how exactly I would be able to access it from the NAS and if its practical enough to benefit from).\n\n  \nSo now im torn between going for a Macbook Pro with an M4 or M5 chip then running tools and programs incompatiable with MacOS on the NAS\n\nOR\n\nUpgrading to a Windows Snapdragon or AMD equivalent. I will be setting up an NAS eitherway.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qwdrr6/torn_between_upgrading_to_either_a_macbook_pro_m4/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o3p03dr",
          "author": "Severe_Stranger_5050",
          "text": "Get the mac  \nVirtualize whatever you might need from windows and Linux",
          "score": 3,
          "created_utc": "2026-02-05 10:25:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3p5w86",
              "author": "Al_Muhareb2401",
              "text": "Would there be any limits by trying to run either a Windows or Linux VM such as cybersecurity tools and programs that wont work or anything like that?\n\nand does the M4 or M5 chip make a difference?",
              "score": 1,
              "created_utc": "2026-02-05 11:17:18",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3p70xs",
                  "author": "Severe_Stranger_5050",
                  "text": "M5 chips are faster in every single way.\n\nBut No there isn't any real limits.   \nI hardly ever touch windows on my mac  \n  \nOn the daily, which is mostly just writing up reports, data analysis, preparing training and other boring GCR-bullshit, my mac is the perfect machine.  \nSilent, fast and long-lived.   \n  \nAnd for pentesting or forensics i just use virtualbox images of Kali Linux.  \nNot only does it make my system seperated from potential harmful software, it also makes it easier to do documentation, because 1 VM-image is only used for 1 assignment. \n\nIt's basically the hanna montana of setups.  \n\"She's got the beeeeeest of both worlds \"",
                  "score": 2,
                  "created_utc": "2026-02-05 11:26:57",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3olkrb",
          "author": "Better-Problem-8716",
          "text": "I run both windows and linux on my mac in vms, i havent had any issues. Snapdragon cpus arent compatible with some software ... mostly games, so careful about that. I dont own one to confirm, just what a sales rep told me .",
          "score": 2,
          "created_utc": "2026-02-05 08:05:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3pamm7",
          "author": "NotANetgearN150",
          "text": "I have an M1 Air 8GB model I still use and it’s running great.  I was extremely surprised how well Windows ARM on parallel desktops is able to just run x64 stuff without any tinkering at all.\n\nA Windows laptop no matter what specs or care that goes into it, I have to cross my fingers and hope it ages well.  A MacBook you know for fact WILL last.",
          "score": 2,
          "created_utc": "2026-02-05 11:55:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3pcnqv",
              "author": "Al_Muhareb2401",
              "text": "Yea thats the reason why I was leaning towards getting a Mac since the experience isnt like any other laptop. The only restraint I really have is the compatiability aspect with running Cybersecurity tools and otherwise.",
              "score": 1,
              "created_utc": "2026-02-05 12:11:03",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3pd2jt",
                  "author": "NotANetgearN150",
                  "text": "What do you plan on running specifically?  I’d be hard pressed to believe there wouldn’t be a macOS equivalent native/ported tool or that you couldn’t run it on Windows/Linux ARM.",
                  "score": 1,
                  "created_utc": "2026-02-05 12:14:02",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o41ggsd",
          "author": "satisfaction-or-else",
          "text": "I know multiple pentesters who use a Mac M3 or older as a daily driver provided to them by their company. As was already mentioned, VMs are the way. Kali in a VM on a Mac will be sufficient.",
          "score": 2,
          "created_utc": "2026-02-07 06:28:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3oesl5",
          "author": "Honest_Park_1126",
          "text": "Same doubt fellow security enthusiast,  i don't want to lose the freedom and versatility of windows but at the same time would love the reliability, efficiency of mac lol😅",
          "score": 1,
          "created_utc": "2026-02-05 07:03:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o477tis",
          "author": "BaconBitwiseOp",
          "text": "The sales guy has no idea what he’s talking about. Get the Mac. You’re going to want to get comfortable with *remoting* into virtual machines anyway. You’ll be able to configure your NAS to work with MacOS easily.",
          "score": 1,
          "created_utc": "2026-02-08 04:24:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4eynbu",
              "author": "Al_Muhareb2401",
              "text": "Ok good to know thanks",
              "score": 1,
              "created_utc": "2026-02-09 11:12:55",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r04aby",
      "title": "I need interview questions for all this topic can you guys help me",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1r04aby/i_need_interview_questions_for_all_this_topic_can/",
      "author": "Funny-Process-6027",
      "created_utc": "2026-02-09 13:32:00",
      "score": 9,
      "num_comments": 3,
      "upvote_ratio": 0.92,
      "text": "Security Operations Analyst (2 Years Experience) –\r\nInterview Preparation Topics\n\r\nCore Security Fundamentals\n\r\n1 CIA Triad and practical application\r\n2 Common attack vectors (phishing, malware, ransomware, brute force, web attacks)\r\n3 Network protocols: TCP/IP, DNS, HTTP/HTTPS, SMTP\r\n4 Ports and services mapping\r\n5 Authentication vs Authorization\r\n6 Encryption vs Hashing\r\n7 Zero Trust and MFA concepts\n\r\nSOC Operations & Incident Response\n\r\n1 Incident Response lifecycle\r\n2 Alert triage methodology\r\n3 Severity classification\r\n4 False positive vs true positive handling\r\n5 Escalation workflows\r\n6 Playbooks and runbooks\r\n7 MITRE ATT&CK; framework basics\r\n8 Indicators of Compromise (IOCs)\n\r\nSIEM & Log Analysis\n\r\n1 SIEM architecture and use cases\r\n2 Correlation rules\r\n3 Log sources (Windows, Linux, Firewall, Proxy, Cloud)\r\n4 Basic query writing (Splunk / Sentinel / QRadar style)\r\n5 Dashboards and alert tuning\r\n6 Use case creation basics\n\r\nEndpoint & Network Security\n\r\n1 EDR/XDR concepts\r\n2 Malware behavior basics\r\n3 Endpoint investigation steps\r\n4 Network traffic analysis basics\r\n5 IDS vs IPS\r\n6 Firewall rule logic\n\r\nThreat Detection & Hunting\n\r\n1 Threat intelligence sources\r\n2 IOC vs IOA\n3 Basic threat hunting workflow\r\n4 Behavioral detection concepts\r\n5 Anomaly detection basics\n\r\nCloud Security Basics\n\r\n1 Azure/AWS logging sources\r\n2 Cloud identity risks\r\n3 Conditional access alerts\r\n4 Cloud SIEM integration\n\r\nVulnerability Management\n\r\n1 CVSS scoring\r\n2 Vulnerability scan workflow\r\n3 Nessus/Qualys report reading\r\n4 Patch prioritization\n\r\nOperating System Skills\n\r\n1 Windows Event IDs (login, process, account changes)\r\n2 PowerShell basics\r\n3 Linux commands (grep, netstat, ps, top, chmod)\r\n4 Process and service investigation\n\r\nInvestigation Scenarios to Practice\n\r\n1 Suspicious login alerts\r\n2 Phishing email investigation\r\n3 Malware detection case\r\n4 Data exfiltration indicators\r\n5 Privilege escalation alerts\n\r\nBehavioral & Communication\n\r\n1 Incident documentation\r\n2 Shift handover reporting\r\n3 Stakeholder communication\r\n4 Handling high alert volume\r\n5 Decision making under pressure",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1r04aby/i_need_interview_questions_for_all_this_topic_can/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o4g0oh0",
          "author": "darksearchii",
          "text": "Shove it into an LLM, this is what they do well.",
          "score": 1,
          "created_utc": "2026-02-09 15:18:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4g0t0j",
              "author": "Funny-Process-6027",
              "text": "Hm hm",
              "score": 1,
              "created_utc": "2026-02-09 15:18:56",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4g9ofj",
          "author": "Instict_ai",
          "text": "There's a platform you can use to download pre generated interview questions which will be role and company specific as opposed to using random LLMs - the platform is [instict.ai](http://instict.ai) you can also practice interview questions and get instant feedback on where to improve ",
          "score": 1,
          "created_utc": "2026-02-09 16:02:09",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r13pg4",
      "title": "How does a CS degree play into a career in Cybersecurity",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1r13pg4/how_does_a_cs_degree_play_into_a_career_in/",
      "author": "Dazzling_Noise1",
      "created_utc": "2026-02-10 15:25:38",
      "score": 9,
      "num_comments": 10,
      "upvote_ratio": 0.92,
      "text": "I am in college now getting a Computer Science degree, but I personally feel and was told by others that this career is heavily oversaturated. Now I'm halfway through a degree and I'm wondering how or if I can switch more to a Cybersecurity focused degree/career. I was told to disregard the degree and focus only on certs, but I don't know how accurate that is.\n\n  \nI'd imagine these skills are translatable, but I haven't heard any success stories.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1r13pg4/how_does_a_cs_degree_play_into_a_career_in/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o4nvaik",
          "author": "RoamingThomist",
          "text": "I'd recommend you stay in the general Computer Science track rather than specialising in cyber security at undergraduate level. Whilst there are good programs out there, most are pretty lacklustre. The real thing you should be doing is looking at summer placements and internships with companies you'd be interested in working for; that will help you stand out.\n\nA degree without those placements will mean you'd be competing with people that may have a few years in a related role looking to get into SOC, dev work, etc. Which will count against you.\n\nEdit: also, the skills are pretty transferable if you're looking at the engineering and automation side. There is a certain truth to the idea that the market is saturated for both CompSci and Cyber, but it's also a little overblown. If you're trying to get in with absolutely no experience, of course it's going to be hard. And a lot of the oversaturation is the people that did a stupid bootcamp over covid working their way through the system and being found incompetent.",
          "score": 4,
          "created_utc": "2026-02-10 18:52:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4o0xkt",
              "author": "Dazzling_Noise1",
              "text": "I see what you're saying, I'm not considering the switch for a monetary reason as both the fields each earn around the same when you are starting out. I am just worried about the fact that I can't compete as how my resume is now in CS and I was told that getting a job in Cybersecurity is almost as easy as getting a job at McDonald's.",
              "score": 0,
              "created_utc": "2026-02-10 19:18:25",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4o9mme",
                  "author": "scooter950",
                  "text": "In my experience which is 14 years IT, last 8 in Blue Team Cyber, CySA, CASP, CISSP (among others) and a bachelor's in Cyber. Getting a job is not that easy.\n\nAs a federal employee, I've applied to around 40 jobs over the long shutdown. Most of the replies were a thank you for applying, some were just a NO, and the rest ghosted. \n\nAlso given the current market... Simply put, I think there is a disconnect.\n\nAgain, my experience. Could be my resume not liked by their AI. Who knows??",
                  "score": 3,
                  "created_utc": "2026-02-10 19:58:55",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o4o1uez",
                  "author": "CyberVoyagerUK_",
                  "text": "There's few places worth their salt that hire in cyber security without any actual IT experience anyway. Do a few years in IT, get a good grounding and experience in actual real world tech, then move into cyber",
                  "score": 1,
                  "created_utc": "2026-02-10 19:22:41",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4prpkf",
          "author": "dahra8888",
          "text": "Computer Science is generally considered a stronger degree than Cybersecurity even for Cybersecurity roles.\n\nCyber degrees have don't have a good reputation in the actual field as many schools have irrelevant curriculum and just use them as cash cows. Plus CompSci gives you a huge range of early career possibilities: Dev, IT, Cyber, etc.",
          "score": 3,
          "created_utc": "2026-02-11 00:31:26",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qy1vmm",
      "title": "Potential cybersecurity engineering intern interview soon, how to not bomb the interview?",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qy1vmm/potential_cybersecurity_engineering_intern/",
      "author": "DeadLead300",
      "created_utc": "2026-02-07 02:39:08",
      "score": 7,
      "num_comments": 10,
      "upvote_ratio": 1.0,
      "text": "I have a referral from someone high up in a company for an open cybersecurity engineering internship this summer, I'm a college sophomore with no actual experience in the real world and not much to show project wise, I am wrapping up my ISC2 certification, how do I not bomb the interview? What kind of questions will I be asked? How can I talk around my lack of experience?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qy1vmm/potential_cybersecurity_engineering_intern/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o42tnoq",
          "author": "Altruistic-Sign5061",
          "text": "Mention:\n- courses you’ve taken (@college or online),\n- industries you follow (if you don’t have a LinkedIn.com profile, create one and choose to follow AI-tech companies of interest to you),\n- READ up on private companies / U.S. government in the cybersecurity “space”…\nGo into the meeting w/a positive attitude, high interest level, motivation to listen/learn, and a “will do” (= can do”) attitude — your enthusiasm will be noticed.\nBest of luck to you!",
          "score": 3,
          "created_utc": "2026-02-07 13:41:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o440dni",
              "author": "koojlauj11",
              "text": "Agreed, you should also ask the higher up for info about the role and company if they have some background. That’s if you have a good relationship. Showing that you’re staying updated on cyber security news and what they’re interested in. Having a set of good questions in preparation for the role. \n\nCheck on Glassdoor for info about the company and see what type of questions they ask if there are any. Look up the different type of interview questions and the psychology behind those questions. You want to understand this for all future interviews.\n\nFind someone who will do an interview with you in person. Practice interviewing in front of a mirror and record yourself. Play it back to see what verbal and nonverbal cues you can improve on.\n\nGo into speaking mode on ChatGPT, tell it to look up info about the company and similar role and tell it to do a mock interview and give you suggestions afterwards on how to improve. Keep doing this. Better if you find someone in a similar position or higher up role and request to do a mock interview with them. \n\nHere is a helpful resource as well a roadmap. \nhttps://roadmap.sh/cyber-security\nhttps://github.com/brootware/awesome-cyber-security-university\nhttps://youtu.be/p2268VGQc9E?si=W1KYFpAXRsKj2bED",
              "score": 1,
              "created_utc": "2026-02-07 17:23:48",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o40soh4",
          "author": "SavannahPharaoh",
          "text": "Focus on zero-trust. Say that because you’re new, you will especially adhere to zero-trust unless directed otherwise by your leadership.",
          "score": 1,
          "created_utc": "2026-02-07 03:29:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o42tszq",
              "author": "Altruistic-Sign5061",
              "text": "wtf r u talking about?",
              "score": 1,
              "created_utc": "2026-02-07 13:42:43",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o45c0qi",
                  "author": "SavannahPharaoh",
                  "text": "Do you not know what zero trust is?",
                  "score": 1,
                  "created_utc": "2026-02-07 21:29:08",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o48ccn3",
          "author": "dennisthetennis404",
          "text": "That's always so stressfull! Focus on showing you understand security fundamentals and explain your thought process when answering scenarios rather than trying to know everything. I don't know if you know what STAR technique is, but it always helps with answering hard questions, check it out!",
          "score": 1,
          "created_utc": "2026-02-08 10:21:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o49kg41",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-08 15:31:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o49kg6o",
              "author": "AutoModerator",
              "text": "Hello,\n\nYour comment was automatically removed because your Reddit account has significantly negative comment karma. We use this threshold to reduce disruptive behavior and maintain quality discussion in r/cybersecurity.\n\nIf you believe this was a mistake or would like to appeal, feel free to message the mod team.\n\nThank you.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CyberSecurityAdvice) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-08 15:31:40",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qxgh0i",
      "title": "W2 stolen",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qxgh0i/w2_stolen/",
      "author": "Available-Form6282",
      "created_utc": "2026-02-06 12:37:16",
      "score": 6,
      "num_comments": 5,
      "upvote_ratio": 1.0,
      "text": "Hi guys, hopefully this isn’t the wrong sub for this (delete if it is) but I found out yesterday someone in my company fell for a phishing scam and leaked everyone’s w2 forms. My company advised we make an IP PIN with the IRS and put credit freezes out with 3 companies (experian, I forgot the other two). I also filed my taxes last night after this happened. This is my first time dealing with potential stolen identity and that kind of threat. Is there anything else I should be doing to protect myself? The company said ALL personal info might be at risk (SSN, birthday, phone numbers, addresses, bank account numbers, credit cards, etc.) I just thought this sub might know. Thank you! ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qxgh0i/w2_stolen/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o3w85eo",
          "author": "jirajockey",
          "text": "Sorry to hear about this, data breaches suck, especially when it's due to a phishing. Your company gave solid starting advice with the IP PIN, and credit freezes. Just to fill in the blanks, the other two credit bureaus are Equifax and TransUnion, make sure you've frozen with all three to block new accounts from being opened in your name.Since all your personal info (SSN, DOB, addresses, bank details, etc.) could be out there, here's some specific, actionable steps to layer on top of what you've done. These are based on standard guidance from places like the FTC and credit agencies to minimize identity theft risks:\n\n1. Place a fraud alert on your credit reports: This is free and tells creditors to verify your identity before opening new accounts. Contact one bureau (e.g., Experian), and they'll notify the others. It lasts 1 year initially, or 7 years if you're already a victim of ID theft. Do this alongside the freezes for extra protection.\n2. Pull and monitor your credit reports: You're entitled to free weekly reports from AnnualCreditReport.com. Check for unfamiliar accounts, inquiries, or errors. Set up alerts with the bureaus for any changes.\n3. Change passwords and enable 2FA: Update passwords on all accounts, especially financial ones—use a password manager like Bitwarden (free) to generate strong, unique ones. Turn on two-factor authentication (2FA) everywhere possible to add a second layer against unauthorized access.\n4. Monitor your accounts closely: Review bank, credit card, and other statements daily/weekly for suspicious transactions. Set up transaction alerts via your bank's app. If bank details were exposed, consider closing and reopening accounts, but talk to your bank first.\n5. Watch for tax issues: You filed early, which is smart, it blocks scammers from filing a fake return. Keep an eye on mail from the IRS for any notices about duplicate filings or issues. If something pops up, respond quickly.\n6. Be extra vigilant against follow-up scams: With your phone/email exposed, expect more phishing attempts pretending to be from your company, IRS, or banks. Don't click links or share info—verify directly via official channels.\n7. Consider free credit monitoring if offered: Your company might provide this (many do after breaches). If not, services like Credit Karma or the bureaus' free tools can help track things. Paid identity theft protection (e.g., LifeLock) is an option for more comprehensive monitoring, but you can DIY a lot of it.\n\n IdentityTheft\\[.\\]gov for a personalized recovery plan, they have checklists based on what data was leaked.On the training side, since this started with a phishing scam, your company should absolutely roll out phishing awareness training to prevent repeats. It's not about blaming the person who fell for it—phishing is getting sneakier with AI-generated stuff—but educating everyone. Suggest they look into free resources like:\n\n* CISA's (Cybersecurity and Infrastructure Security Agency) free training materials and tabletop exercises for small teams.\n* KnowBe4's free Phishing Security Test to gauge how vulnerable employees are, plus their awareness training modules.\n* Terranova Security's free phishing kit with videos, infographics, and tips on spotting scams.\n* Wizer's free security awareness videos (1-minute bites) and phishing sims.\n\nFor yourself, take a quick free course like Amazon's 15-minute cybersecurity basics to sharpen your own skills. If the company doesn't act, maybe gently push HR—better training could save everyone from this headache again.Hang in there; acting fast like you did minimizes the damage.",
          "score": 4,
          "created_utc": "2026-02-06 13:03:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4hskzd",
          "author": "Boring_Radio_8400",
          "text": "Ask HR about signing everyone up in the company for one of those credit monitoring services at their expense. \n\nLegal will also have to be looped in. \n\nThis really sucks. Please be diligent and make sure your company stands up and does the right thing for everyone affected.",
          "score": 1,
          "created_utc": "2026-02-09 20:25:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4i55ei",
              "author": "Available-Form6282",
              "text": "Unfortunately we don’t currently have HR because HR was the one who leaked it 😭 we have interim people though. I’m not sure how to ask since I’m the lowest level employee and I live in a state that doesn’t value worker’s rights at all, although I suppose it doesn’t hurt to ask. \n\nAs far as legal goes, do you mean on their end or mine?",
              "score": 1,
              "created_utc": "2026-02-09 21:26:59",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4lz6tr",
                  "author": "Boring_Radio_8400",
                  "text": "Which state? There are online resources for all 50.\n\nYour company's legal department. You've been \"injured\" in a legal sense, and now you must be made whole (again, in legal terms).",
                  "score": 1,
                  "created_utc": "2026-02-10 13:21:59",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qyycyf",
      "title": "Possibility of a RAT malware or just a simple browser hijacker",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qyycyf/possibility_of_a_rat_malware_or_just_a_simple/",
      "author": "chupitrupi125",
      "created_utc": "2026-02-08 03:38:55",
      "score": 6,
      "num_comments": 8,
      "upvote_ratio": 1.0,
      "text": "Hello, cyber knights\n\nSo, I have this nagging feeling that I fucked up. I recently video sexted with my SO through discord (things got hot before my brain could think properly) which isn't inherently worrisome, but after all was set and done, we remembered that yesterday my SO had told me that the search engine on the laptop's Google Chrome had changed from Google to Yahoo, apparently my SO forgot to run an antivirus scan after that. Which brings me to my question, \n\nWhat is the likelihood the laptop is infected, and might it just be a simple browser hijack, or could it be a full RAT malware that screenshoted our video call? \n\nI'm in the process of explaining to my SO how to run the virus scan. The laptop hasn't had any programs or extensions installed recently, the only app I can think about is Stremio with Torrentio and some subtitle addons, and that was installed about 6 months ago. Also, the camera on the laptop is normally covered with tape (other that today for a few hours) where we were on a call for about 3 hours before the fun started. I'm really nervous and need to know what could be done in this case. Any help, suggestions, or advice is greatly appreciated.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qyycyf/possibility_of_a_rat_malware_or_just_a_simple/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o48qbnl",
          "author": "eric16lee",
          "text": "Odds are she installed something that promises Yahoo so it changed her default search engine in Chrome. This happens sometimes and is not an indication of malware. \n\nI don't know those 2 sites you mentioned, but they sound like you you may download crackes/pirated/free software z games or mods. If that is true, you should change that behavior immediately. There are no safe places for piracy anymore. You will learn the real meaning of browser hijack if you guys keep doing that.",
          "score": 5,
          "created_utc": "2026-02-08 12:27:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4jg21d",
              "author": "chupitrupi125",
              "text": "Thanks man. We ran a few scans and everything was clean, so I will assume that it was just some update or whatever that changed the browser, but we definitely learned something haha.",
              "score": 1,
              "created_utc": "2026-02-10 01:41:55",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o47curo",
          "author": "GamerZ_Sensei",
          "text": "Whats an SO?",
          "score": 1,
          "created_utc": "2026-02-08 05:01:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o47czkg",
              "author": "DrHerbotico",
              "text": "Sign on. Less secure than SSO",
              "score": 1,
              "created_utc": "2026-02-08 05:02:38",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o4ahozl",
              "author": "nastyws",
              "text": "Significant Other?",
              "score": 1,
              "created_utc": "2026-02-08 18:13:23",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o4db0c6",
              "author": "chupitrupi125",
              "text": "Secure Operator, used for some DNS proxies",
              "score": 1,
              "created_utc": "2026-02-09 03:02:29",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4db7o7",
                  "author": "chupitrupi125",
                  "text": "I don't know what I just wrote, I wanted to sound technically versed",
                  "score": 1,
                  "created_utc": "2026-02-09 03:03:31",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o47bxwu",
          "author": "DrHerbotico",
          "text": "Think about it in a positive way: your yams are immortal now!\n\nLess fun way to think about it:\n- nobody could imagine we'd be able to manage and interact with so much data 10 years ago\n- data organization is accelerating, not just increasing linear\n- LLM/VR\n\n= Creepy people may someday be able to put on goggles and live a personalized version of that call every day until their cum buckets runneth over",
          "score": 0,
          "created_utc": "2026-02-08 04:54:46",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qxha0j",
      "title": "I'm making a C2 Server in Rust as a final year project. Am I making a mistake? (CS major)",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qxha0j/im_making_a_c2_server_in_rust_as_a_final_year/",
      "author": "rbx_64",
      "created_utc": "2026-02-06 13:13:42",
      "score": 5,
      "num_comments": 3,
      "upvote_ratio": 0.78,
      "text": "Title. It's about the only thing I could come up with after pondering for WEEKS. Does this make a good final year CS project?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qxha0j/im_making_a_c2_server_in_rust_as_a_final_year/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o3wb6oj",
          "author": "Sivyre",
          "text": "This would be a question for your professor. Reddit isn’t grading your final project, so you need to ask for their feedback. Only then will you know if it’s something to proceed forward with or if you’re back to the drawing board.\n\nWe don’t know the scope.",
          "score": 4,
          "created_utc": "2026-02-06 13:21:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3xfi4h",
          "author": "avbrodie",
          "text": "No your not making a mistake, you’ll be able to crank it out in no time using AI and have time left over to shag your girlfriend",
          "score": 2,
          "created_utc": "2026-02-06 16:44:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3yj01w",
          "author": "Sqooky",
          "text": "I don't think I'd make the C2 server itself in Rust, I'd probably go for something like Python, and have the agent be built in rust. Mainly for modularity purposes, going to be far easier to make changes to.",
          "score": 1,
          "created_utc": "2026-02-06 19:53:00",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qzh2oe",
      "title": "Not sure if this the correct place to ask this.",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qzh2oe/not_sure_if_this_the_correct_place_to_ask_this/",
      "author": "bangboobie",
      "created_utc": "2026-02-08 18:45:24",
      "score": 5,
      "num_comments": 18,
      "upvote_ratio": 0.86,
      "text": "Assume that ISP is unavailable in the following case. Let's say that I go to a website in a browser session where I am not logged-in anywhere and I go to a website which doesn't require logging-in or just allows you to post \"anonymously\", so I post something and the big-brother doesn't like what I have posted.\n\nSo, big-brother subpoenas that website, get's the IP + Timestamp + User Agent String + whatever else they get. And then could that IP + Timestamp can later be sent to Google/Apple (assume that I am using an Android/iPhone) and can big brother ask these companies \"Hey you know a guy with this IP at this timestamp) and they start scanning push notification tokens, background processes, update checks, email checks? And open sockets or whatever and tell them the account information of my Apple ID/ Google Account?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qzh2oe/not_sure_if_this_the_correct_place_to_ask_this/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o4as9qt",
          "author": "kinopiokun",
          "text": "You should absolutely assume everything can be traced back to you, especially if your only obfuscation is “gee I hope the ISP is out of the picture”",
          "score": 2,
          "created_utc": "2026-02-08 19:01:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4aty96",
              "author": "bangboobie",
              "text": "I mean of course, I am just asking this out of curiosity and also the admissibility of this kind of evidence in court, for all heaven knows, governments have radars that could detect keystrokes on a computer which doesn't even have the capability or modems to connect to the network.",
              "score": 1,
              "created_utc": "2026-02-08 19:09:51",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4aup5f",
                  "author": "kinopiokun",
                  "text": "Then you should ask lawyers, not engineers ;)",
                  "score": 2,
                  "created_utc": "2026-02-08 19:13:30",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4iiyse",
          "author": "Left-Equivalent2694",
          "text": "Better question, what did you do?",
          "score": 1,
          "created_utc": "2026-02-09 22:37:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4oho13",
              "author": "bangboobie",
              "text": "Nothing really, just heard about it from someone and my instant thought was that if that is happening then VPNs on our phones are useless.",
              "score": 1,
              "created_utc": "2026-02-10 20:36:40",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4kmmm9",
          "author": "404mesh",
          "text": "It gets even deeper than this. Every website you visit, the server can collect a fingerprint. Law enforcement and large corporations are known to 1) have access to this data as it is on public serves, and 2) are sometimes explicitly collecting this data via external scripts. \n\nThat fingerprint is very unique to you and contains amongst a plethora of other things, your IP and whatnot. This is no good and not very many things protect from this. Even a VPN does not alter your devices fingerprint. Checkout fingerprint.com and try with/without a VPN or incognito. \n\nIt’s bad. Real bad.",
          "score": 1,
          "created_utc": "2026-02-10 06:27:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4kmope",
              "author": "404mesh",
              "text": "Some code as resistance type stuff:\n\nhttps://github.com/un-nf/404",
              "score": 1,
              "created_utc": "2026-02-10 06:27:50",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o4oi01u",
              "author": "bangboobie",
              "text": "I am surprised why most people not talk about this perhaps because they've settled for TOR Browser, but I have to admit that using TOR Browser is a bit frustrating due to speed constraints. But yes I went to a website called device info or something and it was quite something when I saw it lay it out my entire fingerprint, I am sure that something could be done about this but government likely don't want that.",
              "score": 1,
              "created_utc": "2026-02-10 20:38:14",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4omogx",
                  "author": "404mesh",
                  "text": "Yes, there are advanced tooling options with TLS terminating proxies like HAproxy and burpsuite, but the setup is long and profiling is limited to what the user understands. Oftentimes, these proxies carry headers and other things that identify themselves as such. These tools are not sufficient for fingerprint evasion. Neither are VPNs or any other existing tool.\n\nEven beyond JS, HTTPS headers, and TLS fingerprinting, a server can identify you from network level telemetry like the options within your IP/TCP packets. ToS, Max Segment Size, window size/scale, TTL, and more are used to build a fingerprint of your device. This is often how servers can detect containerized apps and processes.",
                  "score": 1,
                  "created_utc": "2026-02-10 21:00:04",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4pqr76",
          "author": "GaeRattlesnake",
          "text": "If all else fails, I hope you used the Trevor Moore technique.",
          "score": 1,
          "created_utc": "2026-02-11 00:26:00",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qyoanu",
      "title": "Career switch from SAP Security to IAM or AppSec",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qyoanu/career_switch_from_sap_security_to_iam_or_appsec/",
      "author": "LoOkkAttMe",
      "created_utc": "2026-02-07 20:21:52",
      "score": 5,
      "num_comments": 0,
      "upvote_ratio": 1.0,
      "text": "I'm currently thinking my way out of the SAP ecosystem, I have more than 10+ years of experience mainly users management and authorizations, SoD..\n\nI've done PWPA (TCM web pt cert), I completed the web pt path in HTB (without going for the exam), I have solid knowledge of web applications, protocols and tools (like Burp), web vulnerabilities (SQLi, SSRF, CSRF, XXS and many more).\n\nI've also done B.Sc. in computer science, understanding code (to review it and write ofc)\n\nI wanted to ask your advice:\n\n1 - Can I somehow translate my years of exprience and knowledge to enter the AppSec role? How? what am I missing? what roadmap would you suggest (studying or job before entering the AppSec)\n\n2 - And if not (whihc is most likley lol) What should I study to get closer to AppSec and get the first job? Any idea for side projects? any ideas for certs? any idea for roadmap? books?\n\n3 - Should I aim more for IAM engineering (or other IAM related title)? which might be more close to my expreience?\n\nShould I study Entra or Okta? Should I study cloud (Azure or AWS)? or something else?\n\n4 - What other roles in Cybersecurity are more close for my exprience?\n\nI'm really open-minded and can find intrest in almost any role, so open for suggestions and advices\n\n5 - Lastly, I thought about doing CISSP (most for the challange, and I have 10+ years in 2 of 8 domains) what you think about it?\n\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qyoanu/career_switch_from_sap_security_to_iam_or_appsec/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": []
    },
    {
      "id": "1qyh31n",
      "title": "I've been hacked and I've tried everything I can, someone help me!!",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qyh31n/ive_been_hacked_and_ive_tried_everything_i_can/",
      "author": "Due_Builder9420",
      "created_utc": "2026-02-07 15:45:12",
      "score": 5,
      "num_comments": 4,
      "upvote_ratio": 0.78,
      "text": "I activated two-step verification, formatted my laptop from a USB drive, formatted my cell phone, used antivirus on both my PC and cell phone, disabled security codes, checked devices. I used a VPN and nothing!!\n\nThe hacker continues to mess with me, accessing Roblox and creating games threatening me. He even created a Crunchyroll account in my name with the following episode:\n\n\"My Hero Academia\n\nE13 - In Each of Our Hearts\n\n\"As the battle at USJ calms down, Izuku and All Might consider the repercussions. Meanwhile, the villains return to their base and begin to plot \\*\\*their next plans\\*\\*\"\n\n\\*\\*PLEASE, SOMEONE HELP ME!!\\*\\*\n\nI'm thinking of deleting my account but I'm afraid he still has access. It seems that Google only permanently deletes the account after 6 months from the request.\n\nIt seems I fell for a phishing scam.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qyh31n/ive_been_hacked_and_ive_tried_everything_i_can/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o44db9u",
          "author": "eric16lee",
          "text": "Multiple account compromises typically boil down to one of these root causes. \n\n1. Password Reuse - using the same password everywhere without having 2FA. \n2. Infostealers - downloading cracked/pirated software, games/cheats/mods, torrents, free movies, etc. almost always steals your session cookies which allows a bad actor to access your accounts without needing your password or 2FA. Doesn't matter if you trust the site or have used it in the past. In 2026, there are no longer any \"trusted\" sites for piracy.\n2a. Fake Captcha - copying and pasting code that you don't understand into the Windows run command either uploads your session cookies directly or downloads an info stealer that does that automatically.\n\nRemediation for all of these is largely the same. \n\nFrom a clean device, NOT your PC:\n\n1. Change ALL of your passwords to something unique and randomly generated. \n2. Choose the option to log out of all active sessions or devices. \n3. Enable 2FA on all of your accounts \n\nIf you are guilty of 2 or 2a continue below:\n\n4. Nuke your PC from orbit\n- back up only important files, not games or applications \n- format your hard drive \n- reinstall Windows from a USB drive (do not use the Reset Windows option from the settings menu)\n\nThis may seem like overkill, but if you want assurance that you have remediated the problem, this is the way to go. \n\nUnfortunately, the only people that can help you are the support teams for those services. Most free services only offer automated account recovery. If that process doesn't get the accounts back, nobody here can help you. \n\nEVERYONE that contacts you via DM offering to help or to hack the accounts back is just an account recovery scammer looking to take advantage of your situation and steal money from you.",
          "score": 4,
          "created_utc": "2026-02-07 18:27:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o43o7w8",
          "author": "LondonCollector",
          "text": "Assuming they have access to your emails have you ended all active sessions?  \n\nDo that then reissue your MFA token",
          "score": 2,
          "created_utc": "2026-02-07 16:24:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o44xjbr",
          "author": "yaahboyy",
          "text": "login on new device, new wifi, end every active session on every compromised platform, completely reset the passwords, reset MFA, revoke all authorized apps and websites as those could carry tokens that arent auto refreshed when you revoke ur sessions. deleting isnt neccessary, there are ways to get him out but it depends on how much they know about u/and how much they want to fuck with you lol. \n\nlastly, be smarter.",
          "score": 2,
          "created_utc": "2026-02-07 20:10:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o44xtth",
          "author": "yaahboyy",
          "text": "mfa is very helpful but ive seen people get hit with mfa token stealer phishing so while mfa is a WHOLLY NECCESARRY step, its no longer viewed as impenetrable like it used to be",
          "score": 1,
          "created_utc": "2026-02-07 20:12:24",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qwz6el",
      "title": "How are you enforcing api security policies across hundreds of microservices without losing your mind",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qwz6el/how_are_you_enforcing_api_security_policies/",
      "author": "Relative-Coach-501",
      "created_utc": "2026-02-05 22:03:44",
      "score": 4,
      "num_comments": 10,
      "upvote_ratio": 0.71,
      "text": "We have about 200 microservices and every team does auth differently, some use oauth2, some still have basic auth somewhere, and one team built custom jwt validation that nobody else understands and security audits are a nightmare because there's no central view of what's actually exposed.\n\nCompliance keeps asking for reports on which apis have what security controls and i have to manually check repos and hope the docs are updated, spoiler they never are. rate limiting is all over the place, some services have it some don't, and when we get hit with traffic spikes it's anyone's guess what's gonna break first. Tried writing scripts to scan everything but they break every time someone changes their implementation. spent two months building a dashboard that was outdated the day we launched it because teams keep shipping changes without updating anything centrally.\n\nHow do other security teams handle api governance at scale? there has to be a better way than what we're doing, right?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qwz6el/how_are_you_enforcing_api_security_policies/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o44h94p",
          "author": "Almasdefr",
          "text": "I am not a dev, but PO/PM, sorry if my point of view makes no sense to you.\nBut why don't you start with enforcing automated API documentation first with Swagger, then all auth methods should be described there. Then you have a clear picture and can make the right decisions.",
          "score": 2,
          "created_utc": "2026-02-07 18:46:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3t9vto",
          "author": "ericbythebay",
          "text": "You adopt a zero trust model and stop letting teams roll their own auth.  You force them to build their services on secure standards built by the platform engineering teams.",
          "score": 1,
          "created_utc": "2026-02-06 00:02:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o431a2g",
              "author": "sedated_badger",
              "text": "Yep sso helps.",
              "score": 1,
              "created_utc": "2026-02-07 14:26:09",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3taezh",
          "author": "National_Ice8868",
          "text": "Implement an API marketplace requiring teams to add their APIs there and have standards in place for them to follow for their APIs, if possible have security oversight to review their APIs",
          "score": 1,
          "created_utc": "2026-02-06 00:05:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ushf1",
          "author": "Middle-Cup-2534",
          "text": "we use service mesh with istio for this, policies are enforced at the mesh layer so apps can't bypass them even if they want to",
          "score": 1,
          "created_utc": "2026-02-06 05:45:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3v09t9",
              "author": "Relative-Coach-501",
              "text": "we looked at that but our platform team said the overhead was too high for our use case",
              "score": 1,
              "created_utc": "2026-02-06 06:49:47",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3v0dq0",
          "author": "Agreeable_Panic_690",
          "text": "policy enforcement at the gateway not at the service level is the key, we use kong for external traffic and tried apigee for internal stuff but it got expensive fast, so we switched to gravitee last quarter and it auto discovers services plus enforces policies consistently, way less manual work than our old setup",
          "score": 1,
          "created_utc": "2026-02-06 06:50:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3zy0uq",
          "author": "MountainDadwBeard",
          "text": "I think the better orgs require registries and authorizations to operate. \n\nI'm the safety, so I conduct engineering risk assessments where we review the documents, then apply the threat model and conduct interviews where we ask followup questions on the API controls. When they don't know, I defer them to AppSec because risk doesn't solution. Then I ask AppSec their thoughts on the solutions I hope they suggest to the stakeholder. \n\nWriteup my final report and let the business owners sign off on the garbage they created.",
          "score": 1,
          "created_utc": "2026-02-07 00:20:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o41ru6x",
          "author": "davuart",
          "text": "You’re not wrong, what you’re describing is pretty much the inevitable outcome of how APIs evolved.\n\nAPIs were originally a contract. A deliberate boundary. One way in, one way out, clear assumptions about auth, shape, rate limits and ownership. They were slow to change and boring by design, which was the point.\n\nThen microservices happened.\n\nNow APIs are generated everywhere, by everyone, in different stacks, with different auth schemes, different gateways, different deployment patterns, and very little incentive for teams to align unless something breaks. Security ends up being bolted on per service instead of designed into the system. Governance becomes archaeology.\n\nWe hit exactly this problem in our own consultancy work, especially in regulated and ops-heavy environments. Multiple teams, hundreds of services, audits asking simple questions like “what is exposed?” and nobody having a straight answer.\n\nOur response wasn’t to add another security layer or scanner. We stepped back and asked a more uncomfortable question:\n\nWhat if the problem isn’t enforcement, but the way APIs are created in the first place?\n\n\n\nThat’s where we re-imagined APIs.\n\nInstead of teams hand-rolling APIs in different frameworks and hoping they remember to apply auth, rate limiting, scopes, documentation, and logging consistently, we flipped the model:\n\nAPIs are generated from a single, structured definition\n\nSecurity is declarative, not implemented per service\n\nAuth, RBAC, rate limits and exposure rules are defined once and applied uniformly\n\nThe API surface is knowable at any point in time because it is derived, not inferred\n\n\nIn practice this means:\n\nNo custom JWT logic hidden in random repos\n\nNo “this service forgot rate limiting”\n\nNo guessing which endpoints exist for audit or compliance\n\nNo dashboards that rot the moment someone ships a change\n\n\nTeams still move fast, but they move inside guardrails. Security stops being a negotiation with every squad and becomes part of the assembly line.\n\nThe biggest shift for us was realising that scanning, scripts and dashboards all fail for the same reason: they’re trying to observe a system that was never designed to be observable or governable at scale.\n\nReimagining API creation itself turned out to be the only way we found to make security, compliance and sanity coexist.\n\nHappy to share more detail if useful, but the short version is: you can’t realistically govern hundreds of bespoke APIs after the fact. You have to make it impossible to create insecure ones in the first place.",
          "score": 1,
          "created_utc": "2026-02-07 08:13:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o43o0e5",
          "author": "Diligent_Mountain363",
          "text": "Step 1 is usually not bot posting GPT slop across various other subs. ",
          "score": 1,
          "created_utc": "2026-02-07 16:22:57",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r0rg8f",
      "title": "Friend Got Hacked. Any tips?",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1r0rg8f/friend_got_hacked_any_tips/",
      "author": "Cosette_Aurora",
      "created_utc": "2026-02-10 04:46:19",
      "score": 4,
      "num_comments": 8,
      "upvote_ratio": 0.84,
      "text": "My friend recently got hacked due to a hacker getting into her friend’s account and sending her a link. She trusted it was her friend and downloaded the software. She’s resetting her computer but the hacker has all passwords that were on it. They also emailed her and threatened to kidnap her child. Is there anything that can be done to legally handle it or is it just reporting them and hoping something is done? I’m a little worried for her safety as the hacker could have gotten sensitive personal information. Any help is really appreciated, thank you.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1r0rg8f/friend_got_hacked_any_tips/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o4ldb81",
          "author": "Tade365",
          "text": "Reset passwords from a different device, enable 2fa if you havent already, clean reinstall windows (not reset, grab a usb with a windows installer, only back up absolutely necessary files yada yada) and as to \"handling it\" reporting the friend will not do anything directly except prevent more spread, just block and move on, also probably dont allow the friend internet access if she clicks random links... Just a thought",
          "score": 3,
          "created_utc": "2026-02-10 10:39:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4m613g",
          "author": "eric16lee",
          "text": "From a clean device, NOT your PC:\n\n1. Change ALL of your passwords to something unique and randomly generated. Use a password manager like BitWarden or 1Password to help with this. \n2. Choose the option to log out of all active sessions or devices. \n3. Enable 2FA on all of your accounts \n\nIf you are guilty of 2 or 2a continue below:\n\n4. Nuke your PC from orbit\n- back up only important files, not games or applications \n- format your hard drive \n- reinstall Windows from a USB drive (do not use the Reset Windows option from the settings menu)\n\nThis may seem like overkill, but if you want assurance that you have remediated the problem, this is the way to go. \n\nUnfortunately, the only people that can help you are the support teams for those services. Most free services only offer automated account recovery. If that process doesn't get the accounts back, nobody here can help you. \n\nEVERYONE that contacts you via DM offering to help or to hack the accounts back is just an account recovery scammer looking to take advantage of your situation and steal money from you. \n\nGoing forward, your friend need to follow this rule: NEVER click on links or attachments unless you were expecting them from a trusted source. Both of these conditions need to be true before you click. In your friend's case, the link came from a trusted source, but they were not expecting it.  I won't even click a link from a family member unless I have a heads up and some context of what they are sending. :)",
          "score": 2,
          "created_utc": "2026-02-10 14:00:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4m8zvl",
          "author": "jirajockey",
          "text": "report here [https://www.ic3.gov/](https://www.ic3.gov/)  \nLikely the hacker is not even in the country, as it includes a threat of kidnapping, FBI might be interested.",
          "score": 2,
          "created_utc": "2026-02-10 14:16:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4k9pfg",
          "author": "AutoModerator",
          "text": "Hello,\n\nYour submission was automatically removed because your Reddit account does not meet our minimum karma or account age requirements. These measures help maintain the quality of posts on r/cybersecurity and prevent spam.\n\nRequirements:\n- Minimum of 20 comment karma OR 20 link karma\n- Account age of at least 10 days\n- Combined karma of at least 40\n\nTo build your karma, participate in discussions across Reddit and contribute thoughtful content in subreddits that welcome new users.\n\nIf you believe this was a mistake or have any questions, please message the mod team.\n\nThank you.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CyberSecurityAdvice) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-10 04:46:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4m07fk",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-10 13:27:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4m07ho",
              "author": "AutoModerator",
              "text": "Hello,\n\nYour comment was automatically removed because your Reddit account has significantly negative comment karma. We use this threshold to reduce disruptive behavior and maintain quality discussion in r/cybersecurity.\n\nIf you believe this was a mistake or would like to appeal, feel free to message the mod team.\n\nThank you.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CyberSecurityAdvice) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-10 13:27:52",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4majmc",
          "author": "rico_king",
          "text": "If you feel there is a threat to someone’s safety, you can report locally or call 911. But reporting to the FBI using their website.\n\nHere is a great resource to help you as well: https://hacked.com/report-hacker/?gad_source=1&gad_campaignid=22874441442&gbraid=0AAAAAC2W-sA-o_FUI8W-pu6YaA73gTfe7&gclid=Cj0KCQiAy6vMBhDCARIsAK8rOgkMnVHBQzI1-jPcEyoAip4XPAsIVBCF8guFpoDNPPPLg56rJNtM8ToaAqkwEALw_wcB",
          "score": 1,
          "created_utc": "2026-02-10 14:24:31",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qwnp4l",
      "title": "Looking to move more into IT security from a networking-heavy role – tips?",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qwnp4l/looking_to_move_more_into_it_security_from_a/",
      "author": "junt4o",
      "created_utc": "2026-02-05 15:06:50",
      "score": 3,
      "num_comments": 2,
      "upvote_ratio": 1.0,
      "text": "Looking to move more into IT security from a networking-heavy role – tips?\n\nI’m looking for some guidance on how to steer my career more toward IT security, ideally without completely leaving networking, since I actually enjoy it.\n\nMy background: I have a Master’s degree in networking with IT security and a CCNP in Routing, Switching and Security. I currently work in a production/industrial environment, mainly with networking (WAN, LAN, wireless, 4G/5G, etc.).   \n  \nI have hands-on experience with firewalls, mainly Palo Alto and Fortigate, and a solid understanding of protocols and overall network security. In my day-to-day I implement firewalls to segment networks, use unrouted VLANs for sites that can’t afford dedicated hardware, and apply ACLs where needed. I’ve also implemented NAC solutions, including 802.1X with Cisco and ClearPass.\n\nI’m not starting from zero in security, but my current role is still very network-focused, and I’d like to move into a more security-centric position (network security engineering, blue team, SOC, security architecture, or even OT/ICS security given my industrial background).   \n  \nI’m more interested in “physical” or infrastructure-focused security like firewalls, network segmentation and NAC than in Azure, Active Directory or identity-focused/cloud admin work.\n\nFor those of you working in security, how does a typical day look for you (especially in roles like network security engineer, SOC analyst, security engineer, security architect, or OT/ICS security)? Is there a recommended path for someone with a strong networking and firewall background who wants to go deeper into security?\n\nAre there any specific certs, skills or focus areas you’d recommend as next steps (for example security-focused certs, SIEM/log analysis, IDS/IPS, or OT/ICS security)? Given that I enjoy networking and already work with firewalls, VLANs, ACLs and NAC, what roles do you think would be the most natural next step for me?\n\nAny tips, suggestions or personal experiences about moving from networking to security would be really appreciated—especially what helped you stand out and what you wish you had focused on earlier.\n\nThanks!",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qwnp4l/looking_to_move_more_into_it_security_from_a/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o3qdr1g",
          "author": "JustAnEngineer2025",
          "text": "You are and have been doing more to secure your environment that a lot of card-carrying members do. Great demonstration of what can and should be done by IT without needing to be part of a \"cybersecurity\" team.\n\nI'd bop you over the head if in person for you even considering to drop down to a SOC role. Feel free to bop yourself over head each time that thought enters your head.\n\nAn employer would be foolish to not leverage your skills to improve the overall security of their environment. It would be a waste to take a \"cybersecurity\" job just to be relegated to babysitting AV or VM capabilities (demonstration purposes only). So do not expect to get away from networking.\n\nLook at jobs where your skills are part of the job requirements. This should provide a smooth transition and not require a decrease in income. Easier to teach you how to do X processes and use A/B/C tools than to teach someone skilled in those areas how networking works as well as how to secure the network.\n\nFor OT, understand that the focus will still more than likely be on the network (location dependent). Understand that safety and availability are paramount.",
          "score": 2,
          "created_utc": "2026-02-05 15:40:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o44llut",
          "author": "Ok_Wishbone3535",
          "text": "Network Engineers are the only guys I know personally who haven't been laid off.   I know a TON of cyber folks (myself included) who have been laid off and are still job hunting.  I don't know a sing network guy laid off... honestly I'd stay network.  just advance in networking or network security.  Cyber is kinda cooked.  ",
          "score": 1,
          "created_utc": "2026-02-07 19:08:41",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}