{
  "metadata": {
    "last_updated": "2026-02-27 16:59:57",
    "time_filter": "week",
    "subreddit": "CyberSecurityAdvice",
    "total_items": 19,
    "total_comments": 128,
    "file_size_bytes": 148602
  },
  "items": [
    {
      "id": "1rdnpjf",
      "title": "How do services like OneRep actually operate in the long run?",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1rdnpjf/how_do_services_like_onerep_actually_operate_in/",
      "author": "lilly_hawat",
      "created_utc": "2026-02-24 18:07:34",
      "score": 39,
      "num_comments": 17,
      "upvote_ratio": 1.0,
      "text": "I’ve been seeing OneRep recommended more and more lately as a solution for dealing with data broker and people‑search sites, so I finally took some time to dig deeper into what these services actually do and whether they’re worth it. I get the general concept: instead of personally tracking down every random site that has scraped your info and going through dozens of different opt‑out pages, you hand the job over to a service that automates the removal requests and keeps monitoring for new listings. On paper, that sounds great, especially if your name shows up all over the place or you just don’t have the time or patience to keep doing it manually.\n\nAt the same time, I’m still pretty conflicted. Part of me really likes the idea of having something in the background constantly checking for new data broker listings and sending removal requests without me needing to think about it. But another part of me feels uneasy about giving yet another company access to my personal details in order to “protect” my privacy. There’s also the question of how much they can realistically remove, how quickly, and whether everything just pops back up again later.\n\nSo for anyone who has actually used OneRep or a similar privacy/removal service for a while, I’d love to hear how it felt in practice. Did it make a noticeable difference to how often you find your info on people‑search sites? Did it feel like a meaningful long‑term privacy improvement, or more like paying a subscription for convenience—something you could more or less replicate on your own if you were disciplined enough to stick with manual opt‑outs and periodic checks?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1rdnpjf/how_do_services_like_onerep_actually_operate_in/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o7boyn1",
          "author": "JenniferP_Huff",
          "text": "Think of them as a privacy middleman: you give them your details, they look you up on data brokers and fire off takedown requests so you don’t have to fill out 200+ forms yourself",
          "score": 1,
          "created_utc": "2026-02-25 13:43:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7bpbck",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-25 13:45:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7bpbes",
              "author": "AutoModerator",
              "text": "Hello,\n\nYour comment was automatically removed because your Reddit account has significantly negative comment karma. We use this threshold to reduce disruptive behavior and maintain quality discussion in r/cybersecurity.\n\nIf you believe this was a mistake or would like to appeal, feel free to message the mod team.\n\nThank you.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CyberSecurityAdvice) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-25 13:45:04",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7bpnn3",
          "author": "Audey_Lusifar",
          "text": "every service has limits, but Onerep has been legit for me, they show each broker, status of the removal, and you can actually verify listings disappearing instead of just getting a vague ‘score.’",
          "score": 1,
          "created_utc": "2026-02-25 13:46:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7d9ayk",
          "author": "Seloney_Amanda",
          "text": "Onerep specifically says they scan a couple hundred people‑search sites, send opt‑outs where they find a match, and then keep checking monthly to see if you got re‑listed",
          "score": 1,
          "created_utc": "2026-02-25 18:11:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7dg2rd",
          "author": "Emmal_House",
          "text": "i actually recommend OneRep if you’re not the diy type. It’s not magic, but it does the boring part of privacy work (forms, follow‑ups, rescans) consistently in the background",
          "score": 1,
          "created_utc": "2026-02-25 18:41:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7di5v2",
          "author": "Nolan_Graks",
          "text": "For non‑technical folks or people with safety concerns (stalking, doxxing), I’d absolutely recommend Onerep or a similar service as an ongoing layer of protection",
          "score": 1,
          "created_utc": "2026-02-25 18:50:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7jwrnq",
          "author": "Soloery_Gato",
          "text": "Over time, the effectiveness depends on how often they re‑scan and how aggressive they are with stubborn brokers. Some sites ignore or delay opt‑outs no matter who asks",
          "score": 1,
          "created_utc": "2026-02-26 17:53:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7jx2ad",
          "author": "Seloney_Amanda",
          "text": "don’t expect them to touch credit bureaus, marketing partners you explicitly agreed to, or government records online. Those are outside the typical scope.",
          "score": 1,
          "created_utc": "2026-02-26 17:54:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o76hmos",
          "author": "angel_yunha",
          "text": "honestly this is exactly why I’ve been hesitant to sign up any service. The idea is great, but trusting a “privacy” company with even more of my data feels like a weird tradeoff though to be fair, onerep at least is SOC 2 Type II compliant, which is more than most tools can say",
          "score": 1,
          "created_utc": "2026-02-24 18:20:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o76jbns",
              "author": "angel_karlotain",
              "text": "it is true, but certification looks solid. \npesonaly for me red flag is data reselling, just removing is more understandable for me",
              "score": 1,
              "created_utc": "2026-02-24 18:28:03",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o7cgeyj",
              "author": "ResidentPicture6072",
              "text": "Pretty sure all the major data removals are SOC2 Type II compliant",
              "score": 1,
              "created_utc": "2026-02-25 16:00:09",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7dd3br",
                  "author": "Mathio_Albero",
                  "text": "the main value for me is automation. Onerep handles dozens of brokers I didn’t even know existed, and I don’t have to babysit every site’s opt‑out form",
                  "score": 1,
                  "created_utc": "2026-02-25 18:28:21",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7a4ukn",
          "author": "techMari",
          "text": "Services like Incogni remove your data by collecting just enough information to find you on data broker websites and make deletion requests for you. If you've tried opting out on your own, you've likely seen that you need to provide all that personal information when submitting opt-out requests.  \nTo check whether a data removal service is trustworthy, look for independent third-party audits, credentials, or expert reviews. For example, Incogni's processes are independently audited and verified by Deloitte. But, in the end, you should research on your own before you decide. Full disclosure: I'm on the team at Incogni.",
          "score": 1,
          "created_utc": "2026-02-25 06:06:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7at8zl",
              "author": "FishingSuitable2475",
              "text": "great advice! incogni is good but only covers like 420 data brokers whereas crabclear does 1500+",
              "score": 0,
              "created_utc": "2026-02-25 09:46:53",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7bo5f1",
                  "author": "lilly_hawat",
                  "text": "interesting, i saw ur comment and started to look deeper to ikt as well. one thing worth adding is that services like OneRep take a more targeted approach that can be better for many users: they focus on the most dangerous, public‑facing people‑search sites (the ones that show up in Google and get used for doxxing), rather than casting a super‑wide net over a lot of back‑end brokers that never exposed your info publicly in the first place.\nthey also try to avoid spreading even more of your real contact info around by building removal requests primarily from what’s already visible on those profiles, instead of relying as heavily on fresh personal data. That can be a big deal if your main concern is minimizing new data sharing while actually reducing real‑world exposure.",
                  "score": 20,
                  "created_utc": "2026-02-25 13:38:35",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1rcfy1u",
      "title": "What actually happens inside a Security Operations Center (SOC) in 2026?",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1rcfy1u/what_actually_happens_inside_a_security/",
      "author": "Educational_Two7158",
      "created_utc": "2026-02-23 12:19:08",
      "score": 18,
      "num_comments": 14,
      "upvote_ratio": 0.88,
      "text": "Hey everyone,\nWith cyber threats getting faster and more automated a lot of people throw around Security Operating Center but not everyone knows what one really does day-to-day.\nIn simple terms, a Security Operations Center (SOC) is the team + tools that watch an organization’s environment 24/7 to spot, understand and stop attacks before (or while) they cause damage.\n\nTypical things happening inside:\n\nReal-time monitoring of logs, endpoints, networks, cloud, email, etc.\nAlert triage (sorting thousands of alerts down to real threats)\nThreat hunting (actively looking for hidden attackers)\nIncident response (containing & remediating when something bad is confirmed)\nUsing SIEM, EDR, SOAR, threat intel feeds, and increasingly AI/ML for detection\nReporting & compliance hand-off (for audits, executives, legal)\n\nIt’s basically the “security nerve center” reactive on alerts and proactive on hunting.\n\nWhat surprised you most about how a SOC actually runs?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1rcfy1u/what_actually_happens_inside_a_security/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o6yfare",
          "author": "Green_Employ4091",
          "text": "1. With all the advanced threat detection in our tool sets, most activity is still just a user with an old cached password or an admin doing stuff they are supposed to do.\n2. Most advanced threat detections (ML, UEBA, Ai, etc) are False Positives.\n3. Most of the useful detections are still written by hand in their respective query languages (KQL, SPL, etc).\n4. Most SOC analysts are so alert fatigued they couldn’t tell you what they worked on that day.\n5. Of ALL the cool new cyber platforms and tools, excel is still the most used.",
          "score": 7,
          "created_utc": "2026-02-23 14:27:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6yscsr",
              "author": "recovering-pentester",
              "text": "Wow this is pretty eye-opening.",
              "score": 2,
              "created_utc": "2026-02-23 15:34:27",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o73csmz",
                  "author": "Educational_Two7158",
                  "text": "Thanks",
                  "score": 1,
                  "created_utc": "2026-02-24 06:21:22",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            },
            {
              "id": "o73ckge",
              "author": "Educational_Two7158",
              "text": "Thanks for the insightful breakdown you nailed it! Siloed tools create alert noise true maturity comes from smart correlation across the stack.\n\nThat's why we offer 24/7 SOC-as-a-Service: fully integrated stack, expert analysts handling correlation, enrichment, hunting & response so you get high-fidelity alerts & fast action without the in-house pain.\n\nDM if you're facing similar challenges!",
              "score": 1,
              "created_utc": "2026-02-24 06:19:27",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o7bjrgb",
              "author": "Isha2012",
              "text": "oh damn...\n\n",
              "score": 1,
              "created_utc": "2026-02-25 13:13:26",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o6ztm74",
              "author": "Ed_with_Seceon",
              "text": "The things you're calling out here are indicative of a set of tools and solutions in the company's cybersecurity stack that not properly integrated together. Proper integration across a cybersecurity stack can be difficult, to say the least. Understand that \"advanced threat detections\" within a siloed solution area are often not \"false positives\" but rather events that happened that are termed to be an \"alert\" - that event happened but it's just not necessarily a threat or something a practitioner cares about. The detections that are written by hand are often correlating between these siloed solution areas bringing higher fidelity to those alerts. In other words, three or four alerts together make a positive/positive but any one of them by themselves is just an event. Creating these types of correlated alerts can be difficult with a set of siloed tools that are generating AI/ML detections that don't have the details within those findings that enable effective correlations and conditional alerts. I would also call out that Deep Learning is often overlooked to broaden the scope of detection beyond structured data and LLMs. It is a heavy lift to get those advanced threat detection mechanisms working together to best understand their context across the various solution areas. A mature SOC has solved these issues. What you're describing here is a SOC that has all the pieces of the puzzle but haven't put them together to see the complete picture.",
              "score": 0,
              "created_utc": "2026-02-23 18:27:49",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o703pgz",
                  "author": "Green_Employ4091",
                  "text": "Thanks, I read all that",
                  "score": 2,
                  "created_utc": "2026-02-23 19:13:33",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o6zm551",
              "author": "MonkeyBrains09",
              "text": "This and how much people will blindly trust strangers on forums such as stack exchange/Reddit etc on solution for their issues",
              "score": -2,
              "created_utc": "2026-02-23 17:53:37",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o731glt",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-24 04:52:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o731gn8",
              "author": "AutoModerator",
              "text": "Hello,\n\nYour comment was automatically removed because your Reddit account has significantly negative comment karma. We use this threshold to reduce disruptive behavior and maintain quality discussion in r/cybersecurity.\n\nIf you believe this was a mistake or would like to appeal, feel free to message the mod team.\n\nThank you.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CyberSecurityAdvice) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-24 04:52:43",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o731hpr",
                  "author": "sneakpeekbot",
                  "text": "Here's a sneak peek of /r/cybersecurity using the [top posts](https://np.reddit.com/r/cybersecurity/top/?sort=top&t=year) of the year!\n\n\\#1: [Recreating uncensored Epstein PDFs from leaked raw base64-encoded data](https://neosmart.net/blog/recreating-epstein-pdfs-from-raw-encoded-attachments/) | [357 comments](https://np.reddit.com/r/cybersecurity/comments/1qwnszr/recreating_uncensored_epstein_pdfs_from_leaked/)  \n\\#2: [“…analysts at the agency were verbally informed that they were not to follow or report on Russian threats” | Cybersecurity and Infrastructure Security Agency (Cisa) sets out new priorities](https://www.theguardian.com/us-news/2025/feb/28/trump-russia-hacking-cyber-security) | [416 comments](https://np.reddit.com/r/cybersecurity/comments/1j0hf8g/analysts_at_the_agency_were_verbally_informed/)  \n\\#3: [Trump’s Defense Secretary Hegseth Orders Cyber Command to ‘Stand Down’ on All Russia Operations](https://gizmodo.com/trumps-defense-secretary-hegseth-orders-cyber-command-to-stand-down-on-all-russia-operations-2000570343) | [394 comments](https://np.reddit.com/r/cybersecurity/comments/1j1xs54/trumps_defense_secretary_hegseth_orders_cyber/)\n\n----\n^^I'm ^^a ^^bot, ^^beep ^^boop ^^| ^^Downvote ^^to ^^remove ^^| ^^[Contact](https://www.reddit.com/message/compose/?to=sneakpeekbot) ^^| ^^[Info](https://np.reddit.com/r/sneakpeekbot/) ^^| ^^[Opt-out](https://np.reddit.com/r/sneakpeekbot/comments/o8wk1r/blacklist_ix/) ^^| ^^[GitHub](https://github.com/ghnr/sneakpeekbot)",
                  "score": 1,
                  "created_utc": "2026-02-24 04:52:56",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7on47p",
          "author": "No_Aside4829",
          "text": "It’s not just reacting to alerts. Analysts spend time on alert triage, proactive threat hunting (TH), and improving detections. Even with AI/ML helping to reduce false positives and speed up analysis, human judgment is still critical. A SOC is really a mix of smart automation and sharp analytical thinking working together 24/7.",
          "score": 1,
          "created_utc": "2026-02-27 11:30:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7nemyx",
          "author": "ComprehensiveBig2424",
          "text": "A lot of people think a SOC is just a room full of screens reacting to alerts 😄 but in reality it’s much more structured and proactive.\n\nFrom what we see with Airtel Secure iSOC, a modern SOC in 2026 runs 24×7 monitoring across endpoints, cloud, network, email - everything. It’s not just watching logs, it’s correlating events using SIEM, SOAR, UEBA and threat intel to figure out what actually matters. Thousands of daily events get filtered down to real risks.\n\nThere’s also a strong proactive layer now. AI/ML is used to spot unusual behavior early, teams actively hunt for hidden threats, and automated containment can isolate devices before damage spreads. On top of that, there’s compliance reporting (HIPAA, GDPR, PCI-DSS, etc.) and clear executive summaries.\n\nWhat surprises most people? It’s less about “fighting hackers live” and more about disciplined monitoring, fast response playbooks, and constant tuning to stay ahead of evolving threats.",
          "score": 0,
          "created_utc": "2026-02-27 05:03:06",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rdorus",
      "title": "Which certificate path should i choose ?",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1rdorus/which_certificate_path_should_i_choose/",
      "author": "Sudden-Bandicoot345",
      "created_utc": "2026-02-24 18:45:26",
      "score": 17,
      "num_comments": 13,
      "upvote_ratio": 1.0,
      "text": "Hi, i was studying cybersecurity but i feel that i 'm a bit lost, i studied basics long time ago like Networking (CCNA) and applied some network security labs, programming (py, java, html, css,mysql, php, bash), reconnaissance & info gathering, some web basics like DOM and web Vuonerablities like SQLi and did almost all Their portswigger labs and some other things. I was thinking about considering cert after cert ( not buying them for now ) and study their content like those listed in the image, \n\nmy question is should i continue in web security and go for bug bounty to affoard their certs exams and at the same while study for a specific cert path like ejptv2 or choosing one thing to do beside my college study ? and sorry for the verbosity.\n\nTarget: penetration testing and bug bounty for now ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1rdorus/which_certificate_path_should_i_choose/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o7bqhl4",
          "author": "Extra-Affect-5226",
          "text": "You already have a solid foundation, especially with CCNA basics, PortSwigger labs, and multiple programming languages, so you’re not as lost as you think. Since your target is penetration testing and bug bounty, I’d suggest going deeper into web security first and building real-world skill through platforms like Hack The Box and real bug bounty programs while studying for something practical like eJPT or PNPT before jumping into more advanced certs. Focus on mastering one lane instead of chasing multiple certificates at once, and let certs validate skills you already built. If you want a clearer, step-by-step penetration testing roadmap without second guessing your path, SecPro Academy structures it in a way that aligns well with both bug bounty and red team goals.",
          "score": 1,
          "created_utc": "2026-02-25 13:51:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ejntz",
          "author": "jdmansec",
          "text": "Unless you’re already successful at bug bounty, I’d get a part-time job, earn the money, quit the job, and buy PNPT. The cert will validate your technical skills for your resume post college.",
          "score": 1,
          "created_utc": "2026-02-25 21:45:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7l5ynp",
          "author": "panitechacademy2017",
          "text": "You’ve already done a lot of basics — networking, programming, reconnaissance, web vulnerabilities, PortSwigger labs. That’s a strong foundation. At this point, it’s more effective to pick one main path instead of jumping cert-to-cert without finishing anything. Trying to juggle bug bounty + multiple certs at once can slow you down.",
          "score": 1,
          "created_utc": "2026-02-26 21:25:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o782uhf",
          "author": "majesticbeast67",
          "text": "Man how do you have the money for certs lol",
          "score": 1,
          "created_utc": "2026-02-24 22:45:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o783df1",
              "author": "Sudden-Bandicoot345",
              "text": "Don't have bro 😂, i want to do bug bounty to get some money for them😂",
              "score": 2,
              "created_utc": "2026-02-24 22:48:12",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7a5pek",
                  "author": "c4tchmeifuc4n",
                  "text": "Nice.",
                  "score": 1,
                  "created_utc": "2026-02-25 06:13:17",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7c5os0",
                  "author": "Confident-Estate-538",
                  "text": "I mean atleast they are worth the investment, you can ask for moneyto your parents.",
                  "score": 1,
                  "created_utc": "2026-02-25 15:10:09",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o78vsvj",
          "author": "Jobioluwaa",
          "text": "😁",
          "score": 0,
          "created_utc": "2026-02-25 01:22:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o76rqc1",
          "author": "Radiant-Forever-6806",
          "text": "Don’t go ccna. Networking is useless now don’t listen to these boomers saying it’s useful. Web security over saturated your not getting money from bug bounties. T shirt if you lucky. Go for some practical security ones. Hands on.",
          "score": -5,
          "created_utc": "2026-02-24 19:05:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o779xfq",
              "author": "_worldly_dolphin_",
              "text": "Wdym practical security?",
              "score": 2,
              "created_utc": "2026-02-24 20:29:16",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o77rvzx",
              "author": "Sudden-Bandicoot345",
              "text": "I took ccna already so no problem",
              "score": 2,
              "created_utc": "2026-02-24 21:52:06",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o78etuq",
                  "author": "the_Safi30",
                  "text": "Ccna doubled my salary last month in a new position so take that w a grain of salt",
                  "score": 4,
                  "created_utc": "2026-02-24 23:49:35",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1ra32sl",
      "title": "WGU vs Purdue Global for Cybersecurity, Which is more respected and actually prepares you for real-world roles?",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1ra32sl/wgu_vs_purdue_global_for_cybersecurity_which_is/",
      "author": "chhlit",
      "created_utc": "2026-02-20 18:19:52",
      "score": 11,
      "num_comments": 32,
      "upvote_ratio": 0.82,
      "text": "Hey everyone,\n\nI am trying to decide between WGU (Cybersecurity/Cloud path) and Purdue University Global (Cybersecurity/Cloud path).\n\n**My main concerns are:**\n\n\\- Which degree is considered more legitimate/respected by employers?\n\n\\- Which program actually teaches practical, job-ready cybersecurity skills?\n\n\\- Which one better prepares you for real-world roles vs just checking a degree box?\n\n**Background:**\n\n\\- Associate’s degree in System & Network Administration\n\n\\- A+, Security+\n\n\\- 2+ years IT support experience\n\n\\- Goal: Move into Cybersecurity / possibly Cloud security later",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1ra32sl/wgu_vs_purdue_global_for_cybersecurity_which_is/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o6h1zlm",
          "author": "cyberguy2369",
          "text": "On its own neither will get you where you need to be to be marketable. You need a job while you’re in school in tech. You need real world practical knowledge AND experience while in school.",
          "score": 10,
          "created_utc": "2026-02-20 19:07:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6i9vs4",
              "author": "chhlit",
              "text": "Okay, I will keep that in mind, as for experience I do have some experience, currently work as Technical Support Specialist II. Besides that I don’t have any other experience in Cybersecurity. Besides that I already have associates degree, as full time employee I can’t attend classes in person so Purdue and WGU were top choice because it seems they’re cheap, flexible with time, give some credits for my certs and accept some credits from my associates degree. Not sure which route to take",
              "score": 1,
              "created_utc": "2026-02-20 22:45:41",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6oz7jl",
                  "author": "cyberguy2369",
                  "text": "cheap and flexible doesnt always mean \"good\" or the right thing..   \ndo your research.. look in the WGU groups at all the people that got a degree from there and cant find a job or didnt give them the upward mobility they assumed it would. \n\nyou do have a job in tech, so thats good. \n\nI'll throw out an alternative you probably wont like.. but long term would probably be better. \n\nif you are in an area with a brick and mortar university.. thats the answer.. but not going to school there.. working there.. most universities, if you work there for a year, you get free tuition after a year. \n\nSo you work there, get real world tech experience and after a year you get free tuition for 2-3 classes a semester while you work. In most situations you can take 1-2 classes during the day (during work hours) and 1 at night. to further your education. \n\nthis way you get the best of both worlds.. you also get to network and all the resources a brick and mortar university provides.   \n\\- networking/recruiting events  \n\\- research opportunities   \n\\- you're getting work experience  \n\\- professors that know people. ",
                  "score": 2,
                  "created_utc": "2026-02-22 00:40:35",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6gtha0",
          "author": "robocop_py",
          "text": "Purdue",
          "score": 5,
          "created_utc": "2026-02-20 18:28:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6gxdbc",
          "author": "beastofbarks",
          "text": "Purdue but it has the stink of Kaplan on it",
          "score": 4,
          "created_utc": "2026-02-20 18:46:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6j35to",
          "author": "fujigfxshooter",
          "text": "Honestly Purdue Global is absolutely trash. I’m a 20+ year Cyber Security Professional and I’ve never encountered such poor academics. It’s entirely plagued with AI both in the student and the professor pool. “Teachers” inject their personal beliefs into lecture materials that are incredibly politically biased. The material is hardly challenging and is a massive disappointment for the cost per credit hour.",
          "score": 3,
          "created_utc": "2026-02-21 01:36:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6iev8s",
          "author": "Dear-Response-7218",
          "text": "Neither, much better off doing a BSCS.",
          "score": 3,
          "created_utc": "2026-02-20 23:12:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6gv21h",
          "author": "7r3370pS3C",
          "text": "I second Purdue. both of us already working in information. Security roles are pretty familiar with what it takes at WGU and I don’t think it’s a lot honestly.\n\nPart of that may just be based on personal bias, as the grads that I have on my team are low-level technical at best.",
          "score": 4,
          "created_utc": "2026-02-20 18:35:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6hw7w4",
              "author": "ItsAlways_DNS",
              "text": "The majority of us don’t care about where your degree comes from. A fuck ton of people at Lockheed have degrees from WGU.\n\nFor the most part we are not hiring anyone who doesn’t have experience. Degree or not.",
              "score": 5,
              "created_utc": "2026-02-20 21:35:11",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6hxyyp",
          "author": "Professional-Set2901",
          "text": "People saying Purdue, why?",
          "score": 2,
          "created_utc": "2026-02-20 21:43:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6ir8r4",
              "author": "-hacks4pancakes-",
              "text": "Because WGU candidates are a hot mess these days.",
              "score": 2,
              "created_utc": "2026-02-21 00:24:16",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6jzufp",
                  "author": "DarwinRewardGiver",
                  "text": "I could say that about the majority of new grad candidates I interview that have 0 experience in the field if I’m being honest.   WGU is for (or should be for) people already in the field who just need to check a box.  \n\nEdit: I should preference this with the fact that I am in the US*. My company rarely hires juniors and we value experience over anything for our OT roles.",
                  "score": 2,
                  "created_utc": "2026-02-21 05:17:10",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6hz4gw",
          "author": "beren0073",
          "text": "Can you pursue a BSCS instead of Cyber? That, experience, and a few relevant certs might do more for your transition than a Cyber BS.",
          "score": 2,
          "created_utc": "2026-02-20 21:49:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6irbln",
              "author": "-hacks4pancakes-",
              "text": "This. Far more value!!",
              "score": 2,
              "created_utc": "2026-02-21 00:24:44",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o6i7pbm",
              "author": "chhlit",
              "text": "I am just looking to expand more in what I already got, going for BSCS seems more cost more time (3+ years). ( I didn’t do any research on this but) Last I heard current market for CS majors isn’t that good.",
              "score": 1,
              "created_utc": "2026-02-20 22:34:07",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6ljr65",
          "author": "LordNikon2600",
          "text": "This degree is useless, get a computer science degree if you want real respect or have some self respect",
          "score": 2,
          "created_utc": "2026-02-21 13:36:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6oxas3",
          "author": "Nawlejj",
          "text": "Getting a B.S in IT (or similar) is in itself a checkbox. Experience > Degrees is the rule, certifications can often be worth more then a degree (usually for specialized cyber skills like OSCP, or a vendor cert like CrowdStrike Falcon Admin, Azure Security, etc).\nPurdue Global sounds better then WGU, which has the reputation of being a pay-for-degree online school. Purdue Global is the same, it just doesn’t have that reputation yet. Both will provide the exact same quality of education.\n\nIf you need the checkbox, get the cheaper degree. If they’re the same price, go with Purdue Global. \n\nIf you want to get hired into a Cloud Security Role, you need to start studying and getting the AWS professional certifications. You will not get hired without at least one (especially with your YOE).",
          "score": 2,
          "created_utc": "2026-02-22 00:29:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6pfq9y",
          "author": "bustereyes",
          "text": "Both are useless - experience gets you jobs not university especially in IT",
          "score": 2,
          "created_utc": "2026-02-22 02:26:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6pickp",
              "author": "contreras_agust",
              "text": "I did both, worked and went to university. Experience got me the interview and the degree got me the better salary.\n\nEveryone always says education isn’t worth it, but it pays dividends over the long-term. I can’t say it it’ll get you the job but once you get interviews, it’ll help secure your salary a lot better.",
              "score": 2,
              "created_utc": "2026-02-22 02:43:25",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6pl8cq",
                  "author": "bustereyes",
                  "text": "Wait so you could demand more money based on degree ?",
                  "score": 2,
                  "created_utc": "2026-02-22 03:02:32",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6reg13",
          "author": "FakeitTillYou_Makeit",
          "text": "WGU is going to be harder because you have to pass certifications to graduate. \n\nPurdue is going to cost a lot more and you will have to lie about your school on your resume and leave out the “global” part to get anywhere. \n\nOption3 - accelerate at WGU to finish quickly then go to a brick and mortar school for an MS to add some credibility.",
          "score": 2,
          "created_utc": "2026-02-22 12:23:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6i1kk4",
          "author": "External-Safe5180",
          "text": "Purdue global is not Purdue. Just saying. If you’re looking for “prestige” neither would show up.",
          "score": 2,
          "created_utc": "2026-02-20 22:02:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6j3adh",
              "author": "fujigfxshooter",
              "text": "This is correct. Purdue Global is just “Kaplan University” rebranded.",
              "score": 2,
              "created_utc": "2026-02-21 01:37:17",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o6ie0v7",
              "author": "chhlit",
              "text": "I understood Purdue Global isn’t Purdue University, I just want to know what’s the difference in their curriculum/teaching for cyber security, is it legit, are they practical, do they teach/ help you prep for real world roles, not looking for “prestige” are they legitimate/ respected? I am full time employee I can’t attend classes in person so Purdue and WGU were top choice because it seems they’re cheap, flexible with time, give some credits for my certs and accept some credits from my associates degree. Not sure which route to take",
              "score": 1,
              "created_utc": "2026-02-20 23:08:15",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o6jg2g0",
              "author": "madmaniak70",
              "text": "Actually Purdue University Global IS a part of Purdue University.  Purdue bought Kaplan to get their online education moving with the existing infrastructure from Kaplan.",
              "score": 1,
              "created_utc": "2026-02-21 02:57:38",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6ji39a",
                  "author": "External-Safe5180",
                  "text": "Diploma won’t say “Purdue” though. But “Purdue Global” instead so everyone knows it’s Kaplan.\n\nAdmissions are also different. Nobody dumb enough to believe they’re the same.",
                  "score": 2,
                  "created_utc": "2026-02-21 03:10:41",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6iyuez",
          "author": "TheOGCyber",
          "text": "A Bachelor's degree has less value than someone with two solid years of IT experience.",
          "score": 2,
          "created_utc": "2026-02-21 01:09:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6h01n4",
          "author": "herovals",
          "text": "Purdue WGU is worthless",
          "score": 1,
          "created_utc": "2026-02-20 18:58:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6hnnvj",
              "author": "BootyBandity2",
              "text": "Cap",
              "score": 0,
              "created_utc": "2026-02-20 20:52:48",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6h2mx8",
          "author": "TerrificVixen5693",
          "text": "Purdue will have more prestige, WGU will have the ability to accelerate rapidly.\n\nI did my second masters from WGU and still had a blast learning.",
          "score": 1,
          "created_utc": "2026-02-20 19:10:37",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rcd19d",
      "title": "Cybersecurity or AI?",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1rcd19d/cybersecurity_or_ai/",
      "author": "LostInPixels0_0",
      "created_utc": "2026-02-23 09:33:30",
      "score": 11,
      "num_comments": 31,
      "upvote_ratio": 0.74,
      "text": "Cybersecurity or AI?\n\nI'm confused to choose between Cybersecurity and AI as career! \nPlease give me a good advice 😭",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1rcd19d/cybersecurity_or_ai/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o6xcxe0",
          "author": "Sea_Depth_3021",
          "text": "Cybersecurity with AI focus. It’s only going to get harder and harder to defend against AI and people using it for attacks. Understanding how AI works and putting systems in place to stop it.",
          "score": 19,
          "created_utc": "2026-02-23 09:42:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6xd1uf",
              "author": "LostInPixels0_0",
              "text": "What do you think how much it will take? I'm a beginner..... Soooo beginner:')",
              "score": 0,
              "created_utc": "2026-02-23 09:43:54",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6xha8l",
                  "author": "Sea_Depth_3021",
                  "text": "Unfortunately I’m a beginner as well. It’s going to take years of learning and persistence, it’s not an easy field to get into. I started with basic computer science, I’m now working through googles cybersecurity course and starting school next month. Certs will be helpful to get a job but it’s such a wide range of jobs within the field. I’d do some research and see what fits your skill set and what interests you because it’s going to be forever evolving so you need to be willing to constantly learn and evolve. Good luck on your journey!",
                  "score": 1,
                  "created_utc": "2026-02-23 10:24:20",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6yag8v",
          "author": "kafeldafunk",
          "text": "Construction",
          "score": 5,
          "created_utc": "2026-02-23 14:00:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o74hiov",
              "author": "Disastrous-Classic66",
              "text": "Probably isnt hard to find a job in construction tbh",
              "score": 1,
              "created_utc": "2026-02-24 12:22:13",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6xiht7",
          "author": "S4LTYSgt",
          "text": "AI with cybersecurity focus.",
          "score": 2,
          "created_utc": "2026-02-23 10:35:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6y6zrd",
              "author": "The-Snarky-One",
              "text": "This is the way to go. Training and education around AI will be much more applicable to a number of different fields and will allow you to pivot easier. Programming, databases, data analysis, decision making, and so much more which will be taught in AI education as part of computer science or computer engineering. Focusing on a cybersecurity degree or training will pigeon hole you in an industry where it’s already difficult to get a job. Getting education in CS/CE for AI development doesn’t limit you, it opens more opportunities.",
              "score": 1,
              "created_utc": "2026-02-23 13:40:57",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6yfkle",
                  "author": "S4LTYSgt",
                  "text": "Absolutely, AI is the feature. Understand AI and its applicability, function, engineering, integration and if you want to specialize in cyber focus",
                  "score": 1,
                  "created_utc": "2026-02-23 14:29:03",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7298gu",
                  "author": "VenomVoidz",
                  "text": "I think that’s more true for people starting from scratch. Cyber with experience and clearance actually opens a lot of doors.. it’s not really a narrow path.",
                  "score": 1,
                  "created_utc": "2026-02-24 01:56:22",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6y9epc",
          "author": "shangheigh",
          "text": "AI but in context of cybersecurity. I feel this is a growing industry and we gonna need tools and solns to fight off attacks like prompt injection, agent poisoning, reasoning poisoning etc ",
          "score": 2,
          "created_utc": "2026-02-23 13:54:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o75a5nq",
          "author": "Ed_with_Seceon",
          "text": "AI is extremely broad. As others have mentioned here, AI in cybersecurity is a strong combination. Understand that working with AI necessitates understanding the subject matter AI is being applied to in order to ensure the AI results are accurate, whether that's cybersecurity or anything else. AI providers have designed their engines to make the end user happy and will sometimes to do some dubious things in order to garner a positive impression from the end user. This is why a firm understanding of the subject matter AI is being applied to is critical. On a side note, working with AI will also involve management skills, managing multiple AI Agents is a lot like managing people and coordinating separation of duties across AI Agents that are built for specialized tasks. So, dive into AI, learn all you can about it and apply it to subject matter that you like, that you can't get enough of, then it's fun and engaging. That's when you'll be a force to be reconned with.",
          "score": 2,
          "created_utc": "2026-02-24 15:03:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7645p1",
          "author": "reddituserask",
          "text": "You really have to think through your questions harder. Respectfully, this is a bad question and it is poorly asked. You didn’t even provide any of your background or context, how do you expect good relevant advice?",
          "score": 2,
          "created_utc": "2026-02-24 17:20:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6xldnj",
          "author": "Gumi_Kitteh",
          "text": "When you do cybersec, you will end up meeting AI-related cyber risk... So if your asking about choosing some kind of bachelor degree, research more to see if you can pick a specialization route that goes to AI route so you can tip toe over to AI while remaining in cyber",
          "score": 1,
          "created_utc": "2026-02-23 11:02:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ymfdf",
          "author": "SigCy8763",
          "text": "I think it's not either or....AI is slowly (not even that slowly) entering into every industry. Cyber is one of them. Learning cyber is good, AI cyber is even better, but to just learn AI doesn't really mean anything",
          "score": 1,
          "created_utc": "2026-02-23 15:05:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ynp61",
          "author": "AdvancingCyber",
          "text": "AI and Machine Learning are parts of cybersecurity. You won’t be able to avoid them. Securing AI will be the biggest challenge of the next 20 years, along with quantum. So there’s no avoiding it. They are fully integrated.",
          "score": 1,
          "created_utc": "2026-02-23 15:11:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o72fnce",
          "author": "BeginnerPornographer",
          "text": "“AI” as a career? \n\nDo you mean ML? Robotics? What?",
          "score": 1,
          "created_utc": "2026-02-24 02:33:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7389mu",
              "author": "LostInPixels0_0",
              "text": "Even I don't know :)",
              "score": 1,
              "created_utc": "2026-02-24 05:44:24",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o73cn97",
                  "author": "BeginnerPornographer",
                  "text": "I would start there, then. You don't know what you actually want, so I'd try to figure that out first.",
                  "score": 1,
                  "created_utc": "2026-02-24 06:20:06",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o730sln",
          "author": "SageDesk",
          "text": "I chose AI mixed with cyber",
          "score": 1,
          "created_utc": "2026-02-24 04:47:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o772q67",
          "author": "Pretty-Mirror-5876",
          "text": "You’re not really choosing between “AI or cybersecurity.” You’re choosing what problems you want to solve.\n\nAI (especially ML) relies heavily on math and model building. Cybersecurity relies more on risk, systems, and defense in real-world environments.\n\nAlso, they’re not opposites. Security + AI knowledge is only getting more valuable. Pick the one you’re genuinely interested in learning deeply.",
          "score": 1,
          "created_utc": "2026-02-24 19:55:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ajtj5",
          "author": "AverageCincinnatiGuy",
          "text": "Both are dead-end, unstable, low-pay, high-stress careers. Abort and abandon ship.\n\nWe'll always \"need\" tech people such as for Cybersecurity and AI, but that won't stop companies from stupidly replacing irreplaceable people with AI over the next few decades (often at irreparable harm to the company and sometimes even the company going bankrupt.)\n\nChoose a career that's stable and relatively safe from AI such as manufacturing.",
          "score": 1,
          "created_utc": "2026-02-25 08:17:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7b6l4z",
              "author": "thelemethric",
              "text": "Thank you for gatekeeping our field",
              "score": 1,
              "created_utc": "2026-02-25 11:43:48",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7gznw0",
                  "author": "AverageCincinnatiGuy",
                  "text": "You're welcome, sir",
                  "score": 1,
                  "created_utc": "2026-02-26 06:24:55",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7brbba",
          "author": "notxcor",
          "text": "Hb combining both?",
          "score": 1,
          "created_utc": "2026-02-25 13:55:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7gnjr2",
          "author": "SafetyLadyTracey",
          "text": "I chose both! I am an instructor and keynote speaker about generative AI cybersecurity for end-users. \n\n\nI teach safe usage regarding data protection.\n\n\nI demonstrate how cybercriminals use AI to scam and defraud with deepfakes, phishing emails, social engineering, AI slop, voice impersonations, and more. \n\n\nI teach how to spot and stop these mostly preventable crimes. ",
          "score": 1,
          "created_utc": "2026-02-26 04:52:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7hgjoo",
              "author": "anthonyDavidson31",
              "text": "Hey, do you use practical exercises in your talks? \n\n\nI'm helping with hands-on interactive exercises on AI cybersecurity: https://www.reddit.com/r/Malware/comments/1qrdjny/free_handson_exercise_to_understand_the_prompt/\n\n\nIt looks like there's plenty of ways for us to collaborate if you want to enhance your trainings with practical tasks for your listeners or give them some homework ",
              "score": 1,
              "created_utc": "2026-02-26 08:58:27",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1rel4w9",
      "title": "Phone number lookup tool",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1rel4w9/phone_number_lookup_tool/",
      "author": "Seloney_Amanda",
      "created_utc": "2026-02-25 18:17:40",
      "score": 11,
      "num_comments": 9,
      "upvote_ratio": 0.93,
      "text": "Anyone else get calls from random numbers that hang up after one ring? I used a phone number lookup and kinda freaked out.\nBeen getting these calls for the past week. Random numbers with different area codes. Phone rings once, maybe twice, then they hang up. Happens like 3-4 times a day.\nI don't usually answer unknown numbers but this felt coordinated so I got curious. Looked up five of the numbers.\nThey're all VoIP numbers registered to the same telecom provider. None of them are in my state (area codes are all over the place). And several are flagged as scam numbers by other users.\nApparently this is a thing called a \"one ring scam.\" They want you to call back, which connects you to a premium rate number that charges you insane fees per minute. Some people reported bills over $100 from a single callback.\nI've blocked them all now but new ones keep calling.\nHas anyone dealt with this? Is there a way to block all VoIP calls or something? Getting really tired of this.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1rel4w9/phone_number_lookup_tool/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o7dc4od",
          "author": "Mathio_Albero",
          "text": "yeah this is super common unfortunately. the one-ring scam has been around for years but it's gotten worse lately. your carrier might have a spam blocker app- check if yours does. verizon has one, so does tmobile i guess. i use a combination of my phone's built-in spam filter + looking up suspicious numbers before deciding what to do. findsio or similar sites can tell you if it's a known scam number",
          "score": 2,
          "created_utc": "2026-02-25 18:24:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7l1lff",
              "author": "ZeldaRudd",
              "text": "True. However, ive used the CatfishNumr recently and its showing very good accurate information with linked profiles.",
              "score": 1,
              "created_utc": "2026-02-26 21:04:59",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7dcrqz",
          "author": "Pippa_Natyy",
          "text": "bro the coordinated part is what gets me. like it's not even random anymore they clearly have lists. i got hit with the same thing last month, different area codes back to back for like two weeks straight then suddenly stopped. no idea why it stopped but i was going insane. just don't call back literally ever, doesn't matter how sketchy the missed call looks",
          "score": 2,
          "created_utc": "2026-02-25 18:26:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ikekq",
          "author": "Sad_Finance_901",
          "text": "from what I've read, the best thing is not to call back",
          "score": 1,
          "created_utc": "2026-02-26 14:02:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7jrftb",
          "author": "Emmal_House",
          "text": "ur carrier's spam filter is genuinely underrated for this. i turned on t-mobile's scam shield thing and the calls dropped like 80%. still get some through but nowhere near the volume i used to. worth checking whatever your carrier offers before doing anything manual",
          "score": 1,
          "created_utc": "2026-02-26 17:28:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7jrygx",
          "author": "amanda_charley",
          "text": "ngl i answered one of these once out of pure spite. dead silence for like 4 seconds then a dial tone. felt weirdly victorious that i didn't call back lmao. block and move on honestly there's no winning her",
          "score": 1,
          "created_utc": "2026-02-26 17:30:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7kye9l",
          "author": "shangheigh",
          "text": "Did you say $100 per minute? Thats pure malice on the part of telecom provider ",
          "score": 1,
          "created_utc": "2026-02-26 20:49:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7mffnn",
          "author": "Otis-166",
          "text": "iPhone and I’m sure android too has a feature that just ignores unknown numbers. If you get a lot of those for work or something then an app that marks them is also a good way to go. I still get lots of crap voicemail, but if they don’t leave one that sounds like that specific scam goes away completely.",
          "score": 1,
          "created_utc": "2026-02-27 01:26:52",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rbsoo6",
      "title": "Is penetration testing over ?",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1rbsoo6/is_penetration_testing_over/",
      "author": "Sudden-Bandicoot345",
      "created_utc": "2026-02-22 18:01:41",
      "score": 9,
      "num_comments": 18,
      "upvote_ratio": 0.63,
      "text": "When i scroll in linkedin, sometimes i see posts talking about that bug bounty and pentesting is not  good as before due to automation and senior bug hunters creates tools that exploits many vulnerablities, on the other hand i see people still getting bugs that are just needs some thinking like business logics. sorry for verbosity, but i do not really know if i should continue in this path or i am just overthinking it, or give it a try and get my hands in something like RE and malware anlysis/dev, i really like the name and i actually want to try but i am scarred of time, i want to try foresnics, RE and others but i fear of loosing time just because i want to try everything, any advice ?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1rbsoo6/is_penetration_testing_over/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o6tc0cd",
          "author": "achraf_sec_brief",
          "text": "Automation kills the script-kiddie layer, not the craft. Scanners find known CVEs, they can’t chain logic flaws, abuse broken auth flows, or understand what “critical” means in a specific business context. Senior hunters aren’t being replaced, they’re being filtered in. The noise is gone, the ceiling is higher. If you’re scared of RE and malware analysis, good, that discomfort is exactly where growth is. Pick a lane, go deep for 6 months, and stop letting LinkedIn dictate your career path.",
          "score": 18,
          "created_utc": "2026-02-22 18:23:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6urwjp",
              "author": "Equivalent_Agency_77",
              "text": "Thank you for this perspective",
              "score": 2,
              "created_utc": "2026-02-22 22:41:36",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o6tcw6y",
              "author": "Sudden-Bandicoot345",
              "text": "Do you recommend continue in PT or RE/Malware analysis ?",
              "score": 1,
              "created_utc": "2026-02-22 18:27:07",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6tpd5a",
                  "author": "achraf_sec_brief",
                  "text": "Depends on what drives you, not what LinkedIn says is trending.\nPT has a bigger market, more jobs, easier entry. If you need stability, stay there. You’re already thinking like a hunter (business logic, auth flows), that’s rare. Don’t abandon it.\nRE/Malware is a passion field. Smaller market, steeper curve, lower early pay. But if you’re genuinely curious about how things break at a low level, not just that they break, it compounds hard over time. The people who do it for money usually quit. The ones who do it because they can’t stop thinking about it become irreplaceable.\nMy honest take: keep PT as your income engine, start RE on the side. Reverse one malware sample a week. No course, just a sample and a debugger. In 6 months you’ll know if it’s actually for you, or if you were just attracted to the aesthetic.\nTwo skills that overlap is a moat. One you half-learned out of FOMO is a waste.",
                  "score": 2,
                  "created_utc": "2026-02-22 19:25:33",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o6ume6t",
              "author": "Scar3cr0w_",
              "text": "After that incredibly clear, well thought out response… OP says “wHiCh OnE mEaN i GeT gOoD”",
              "score": 1,
              "created_utc": "2026-02-22 22:12:21",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o6vynqv",
              "author": "UnrealHallucinator",
              "text": "Is this written by ai lol",
              "score": 1,
              "created_utc": "2026-02-23 02:50:55",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6x9lmm",
                  "author": "achraf_sec_brief",
                  "text": "No, but I’ll take ‘robotic clarity’ as a compliment 😂",
                  "score": 2,
                  "created_utc": "2026-02-23 09:09:22",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6tn373",
          "author": "byronicbluez",
          "text": "At the highest level the Mandiant and Blackhill level companies will always have a spot as paying for their services is a write off.\n\nInternal and lower level pentest have always been over saturated and oftentimes unneeded. Not a great value over having a vulnerability team just do a tenable scan.",
          "score": 3,
          "created_utc": "2026-02-22 19:14:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6taysy",
          "author": "Impossible_Ad_3146",
          "text": "Keep penetrating, back and forth then up and down",
          "score": 2,
          "created_utc": "2026-02-22 18:18:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6tczc3",
              "author": "Sudden-Bandicoot345",
              "text": "I think i will continue, yeah",
              "score": 1,
              "created_utc": "2026-02-22 18:27:31",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6u0ibf",
          "author": "Turbulent_Might8961",
          "text": "Nah, still plenty of work.",
          "score": 1,
          "created_utc": "2026-02-22 20:21:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6vsyyb",
          "author": "Fsalzman",
          "text": "yes they all got penetrated and probed without pay",
          "score": 1,
          "created_utc": "2026-02-23 02:16:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6wlrhv",
          "author": "PizzaUltra",
          "text": "I have a few clients strongly considering sizing down their bug bounty programme, due to AI. \n\nThe amount of reports has increased 5x to 10x, but it’s almost all AI slop. 2 years ago, the reports were easily classified as LLM trash by quickly glancing at them, these days they actually look convincing. They’re obviously still utterly useless and garbage, but they _look_ just fine.",
          "score": 1,
          "created_utc": "2026-02-23 05:31:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o79rrzx",
          "author": "Impressive-Fondant52",
          "text": "just like anything else with AI you need to use it to get better and understand more. human led pentesting will not go away.",
          "score": 1,
          "created_utc": "2026-02-25 04:30:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6tubvh",
          "author": "Successful-Escape-74",
          "text": "GRC is more relevant so you can prevent vulnerabilities that pen testing would discover. [https://public.cyber.mil](https://public.cyber.mil) ",
          "score": 0,
          "created_utc": "2026-02-22 19:50:25",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1re46ky",
      "title": "Hey guys I’m a college student need some help",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1re46ky/hey_guys_im_a_college_student_need_some_help/",
      "author": "Green-Solution-6368",
      "created_utc": "2026-02-25 05:09:38",
      "score": 8,
      "num_comments": 7,
      "upvote_ratio": 1.0,
      "text": "I’m a 2nd year college student doing BTech CSE and I have an option to choose a track next year and I’m going for cyber security.  I checked all the YouTube as well as-the roadmaps but every person says to different things. Would love for some advice on where to start from scratch and I would love to learn as much as I can . Thanks guys have a great day!",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1re46ky/hey_guys_im_a_college_student_need_some_help/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o7d5cwu",
          "author": "cyberguy2369",
          "text": "get a job in tech .. not when you graduate.. but now.. walk over to your schools it dept \"hi, I'm a btech major looking for opportunities to work and gain experience\"\n\nwith some of your free time try to get your sec+ and network+ certs",
          "score": 2,
          "created_utc": "2026-02-25 17:53:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ahf7r",
          "author": "CyberHacker_ray",
          "text": "Since you’re starting from scratch, focus on building a strong foundation first: computer networks, OS concepts, basic programming (Python is great), and Linux fundamentals. Once comfortable, explore cybersecurity basics like web security, networking attacks, and hands-on labs using platforms like TryHackMe or Hack The Box. Keep it structured: theory > labs > small projects > certifications (like CEH or EC-Council) as you grow.",
          "score": 1,
          "created_utc": "2026-02-25 07:55:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7boj3d",
              "author": "Green-Solution-6368",
              "text": "Hey man really appreciate you taking the time to reply. Is there some platform or books I should go with? Cuz it’s really confusing which ones to choose from.",
              "score": 2,
              "created_utc": "2026-02-25 13:40:43",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7brgcs",
          "author": "Extra-Affect-5226",
          "text": "It’s completely normal to feel overwhelmed because everyone shares a different roadmap, but the foundation is almost always the same. Start with networking fundamentals, Linux, and basic security concepts like how attacks happen and how systems are defended. Then build hands-on skills through labs and small projects instead of just watching YouTube. Once you’re comfortable, you can explore areas like ethical hacking, SOC, or cloud security to see what fits you best. If you want a structured path that removes the confusion and shows you exactly what to learn step by step, SecPro Academy is worth checking out since it’s beginner-friendly and focused on practical skills.\n\n",
          "score": 1,
          "created_utc": "2026-02-25 13:56:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7clhjq",
              "author": "Green-Solution-6368",
              "text": "Heyy is there like a particular YouTube playlist or some books that I should go with? Like There’s so many options man I started networking on a course it was one given by my college but I still got so confused and I appreciate you helping me out man",
              "score": 1,
              "created_utc": "2026-02-25 16:23:16",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7fdz5y",
                  "author": "-hacks4pancakes-",
                  "text": "Trust zero influencers or bootcamps on the internet. The market is crashed and they’re a pyramid scheme. Go find the dry ass free university or community college training courses on general IT admin and networking. Learn to administer servers and troubleshoot computers and networks. Practice it at home or as a volunteer. If you don’t this first with the academics and certs to back it up, you have a bats chance in hell right now.",
                  "score": 1,
                  "created_utc": "2026-02-26 00:22:41",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7gkcy6",
          "author": "SecTechPlus",
          "text": "Read my reply at https://www.reddit.com/r/CyberSecurityAdvice/s/FesMyYMpUi for a list of free training resources that should help you. It's sorted starting with foundational topics and continues to general security then more specifics.",
          "score": 1,
          "created_utc": "2026-02-26 04:30:20",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rbsf7n",
      "title": "Advice for cybersecurity jobs in military",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1rbsf7n/advice_for_cybersecurity_jobs_in_military/",
      "author": "Put_Empty-",
      "created_utc": "2026-02-22 17:52:06",
      "score": 8,
      "num_comments": 11,
      "upvote_ratio": 0.91,
      "text": "Been thinking about enlisting in AF, Army, or navy but don’t know which. Ideally AF for quality of life but I know the army will sometimes guarantee an mos before you sign. Will all 3 branches pay for certifications? What’s the best for actual experience after the schooling? Also im assuming going in the navy I wouldn’t have to be on a boat (I don’t want to be on a boat). Just asking for those of you that went this route",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1rbsf7n/advice_for_cybersecurity_jobs_in_military/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o7bwofi",
          "author": "kyotaka-Ryomai",
          "text": "Go army or airforce (better to go airforce) \nBut just know they will train you and yes get you the certs but once you start the actually job it’s mostly contracted out to civilians from major companies so your scope of actual work and experience will be limited \nGreat to use as a stepping stone but not for real career development",
          "score": 3,
          "created_utc": "2026-02-25 14:24:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7hzy4v",
              "author": "BanhPC",
              "text": "OP could have experience already and may just want to bridge and scale up his market worth. After all, I am considering the same having 7 years of experience in various cyber domains. Although, being a veteran myself I would most definitely choose Air Force. Why? Better quality of life lol. However, my plan isn't to go active again but Air Reserve or Air National Guard component for obvious reasons.",
              "score": 2,
              "created_utc": "2026-02-26 11:54:16",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o7ip0oy",
              "author": "lFallenOn3l",
              "text": "If becoming a cyber expert is the goal, army and navy are much better options",
              "score": 1,
              "created_utc": "2026-02-26 14:27:01",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7ey0t7",
          "author": "byronicbluez",
          "text": "Everything is a crapshot.\n\nHere's the thing about the military. You are a Soldier/AirMan/Sailor first.\n\nDream scenario? You get slotted in a NSA location. Tons of training, certs out the wazoo, and generally left alone to just do whatever your NSA shop wants you to do.\n\nWorst case scenario but happens more often than you think: They train you and get you a few certs here or there. They then put you into the Orderly room to do stupid paperwork. You spend your entire time at that duty station being a glorified secretary.\n\nThere are certain programs that if you test into they will send you to additional schooling. ION training being one such program. Then you are pretty much guranteed to do hacking stuff and avoid most of the fuckery going on. But I do know operators that still had to do Staff Duty.",
          "score": 2,
          "created_utc": "2026-02-25 22:55:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7hxx0m",
          "author": "CRam768",
          "text": "If you join the Army as a 17C you will get training and you will get experience as an incident analyst. You can always drop a warrant packet after you pin SGT and get 3 NCOERs. Warrants get certs for sure. 17C don’t get certs in AIT but get a ton of hands on experience. The AF has been redesigning its cyber jobs and I’ve only worked with a red team that actually knew what they were doing. The army’s cyber teams actually do their job in both cyber protection teams via various threat hunt type missions that are actual threat hunts. Red teams do actual red team work. I can’t speak at all for the Navy. \n\nThe army has changed when it comes to that mentality of Soldier first. That typically comes from middle management leaders who don’t know the technical niche of what those Soldiers do. As long as you are in a cyber protection bde you WILL do cyber protection jobs. Upside you wont do vulns scans such as acas and trellex for IA reporting. You will do assessments looking for anomalies in SEIM logging especially when nothing alerts. You will help organizations set  up alerts based on known ATPs. You will help provide data that will brief organizations leadership on how to close gaps in current security posture to close gaps. \n\nI’ve seen some AF teams do the same but more from the army than any other service. Good luck what ever path you chose.",
          "score": 2,
          "created_utc": "2026-02-26 11:38:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6t55op",
          "author": "AutoModerator",
          "text": "Hello,\n\nYour submission was automatically removed because your Reddit account does not meet our minimum karma or account age requirements. These measures help maintain the quality of posts on r/cybersecurity and prevent spam.\n\nRequirements:\n- Minimum of 20 comment karma OR 20 link karma\n- Account age of at least 10 days\n- Combined karma of at least 40\n\nTo build your karma, participate in discussions across Reddit and contribute thoughtful content in subreddits that welcome new users.\n\nIf you believe this was a mistake or have any questions, please message the mod team.\n\nThank you.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CyberSecurityAdvice) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-22 17:52:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7i3pjo",
          "author": "idksomet",
          "text": "Very brief info but Navy , CWT. Contract is 6 years due to training. The chances of going on a ship as one is very low, they’re usually stationed on shore. There’s a mega thread someone wrote about the rate and their experience. Keep in mind, you’ll have to qualify for Top Secret security clearance, and there are some disqualifications, such as drug usage outside MJ, foreign contacts , bankruptcy, collections etc.",
          "score": 1,
          "created_utc": "2026-02-26 12:21:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ir231",
          "author": "cybersecguy9000",
          "text": "In general, expect to join and possibly not even do what you enlisted to do, or do something kinda like what you enlisted to do but not really. It happens. In the navy, it's almost certain you will be on a ship at some point in your career. AF is probably your best bet, someone else mentioned that lots of this work is indeed contracted out (I worked on an army base as a contractor, none of my co-workers were military except some O3 who oversaw the program). You may work on extremely legacy systems as well which is unlikely to mirror private sector environments. \n\nThat being said. join the AF, get guaranteed a-school for cyber (preferably with a short or no wait between boot camp and a school) and join up. Do it for a few years and see what the world looks like then. Cybersecurity/IT in general is a terrible market, but the military is basically guaranteed job if you are eligible.",
          "score": 1,
          "created_utc": "2026-02-26 14:37:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7l2qom",
              "author": "LeadingPattern232",
              "text": "Most military cyber (not IT) works for NSA or the various cyber commands so that’s why you didn’t encounter any. \n\nIf you want cyber make sure you secure Army 17C, AF 1N4 or Navy CWT. They’ll all pay for your certs. Army has their own training but Navy, AF, Marines, CG and Space force initial training is JCAC in Pensacola. Getting one of these jobs will set you up for greatness if you put in the work and not just do the bare minimum. \n\nFor Navy cyber, you have a slim chances of going on a ship so if you don’t wanna be on the boat then choose AF or Army.",
              "score": 1,
              "created_utc": "2026-02-26 21:10:22",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7kdcym",
          "author": "TwoRevolutionary7196",
          "text": "Got a buddy in the navy doing IT admin stuff \n\nUpside they pay for training downside hes on a boat with no wifi sometimes for months.",
          "score": 1,
          "created_utc": "2026-02-26 19:09:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7m88wk",
          "author": "why_is_DNS_the_issue",
          "text": "Navy pays for certifications via NAVY COOL. I would imagine the other branches do the same. Also, with navy, if you get stationed on a small boy, you gain a lot of experience (because you’re subject to both the radio and ADP side). I did 8 years in the navy, only got A+, a shit ton of experience working helpdesk, networking, sysadmin etc and got an IT manager position. Honestly if I could go back, I would have told myself to hunker down on  certifications but still no regrets. Also I’m testing for CCNA tomorrow :)",
          "score": 1,
          "created_utc": "2026-02-27 00:45:31",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rdjv8r",
      "title": "face seek is a massive gap in personal opsec that nobody is talkin about",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1rdjv8r/face_seek_is_a_massive_gap_in_personal_opsec_that/",
      "author": "AnshuSees",
      "created_utc": "2026-02-24 15:51:08",
      "score": 6,
      "num_comments": 4,
      "upvote_ratio": 0.69,
      "text": "I focus a lot on digital hygiene but i realized i totally ignored my biometric trail. i ran a face seek search on myself today and it bridged the gap between my anonymous handles and my real identity in seconds.\n\nit found a photo of me from a public tech talk years ago that was linked to my full name. if u are tryin to stay private online u need to realize that ur face is a permanent index. i am recommendin everyone to audit their face search results because names can be hidden but ur face is everywhere. how are u guys protectin against this?\"",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1rdjv8r/face_seek_is_a_massive_gap_in_personal_opsec_that/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o787o9p",
          "author": "achraf_sec_brief",
          "text": "So you're telling me I spent 10 years using fake names, encrypted everything, refused to make a LinkedIn, and my FACE just said nah bro I got this and doxxed me anyway. The call was coming from inside the head the whole time. Honestly at this point I'm growing a beard every 6 months and shaving it off just to keep the algorithm guessing 😂",
          "score": 1,
          "created_utc": "2026-02-24 23:10:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o79yz1y",
          "author": "Charming-Active1",
          "text": "Is Face Seek a thing? I’ve never heard of it.",
          "score": 1,
          "created_utc": "2026-02-25 05:21:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7o57z5",
          "author": "Calm-Gap9862",
          "text": "Is that this? [https://www.faceseek.online](https://www.faceseek.online)",
          "score": 1,
          "created_utc": "2026-02-27 08:46:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o79i6fr",
          "author": "Objective_Proof_8944",
          "text": "Don’t post your face or your voice! In the era of AI no smart individual in cybersecurity would do so. Additionally, nor should anyone with any role that has access to any secure data. \n\nIt’s really not that important to be seen. \n\nGiven the lax restrictions on employees around this we are sure to see an increase of cybercrimes.",
          "score": 0,
          "created_utc": "2026-02-25 03:29:46",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rdr01f",
      "title": "What are some things I should  know to start getting into cybersecurity?",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1rdr01f/what_are_some_things_i_should_know_to_start/",
      "author": "Aggravating_End4002",
      "created_utc": "2026-02-24 20:04:06",
      "score": 5,
      "num_comments": 13,
      "upvote_ratio": 0.78,
      "text": "I don't know where  to start in cybersecurity, I would like it if you guys can pinpoint me to the right direction of what I should learn, and what I should study since this is a career I want  to do.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1rdr01f/what_are_some_things_i_should_know_to_start/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o7bpiwj",
          "author": "Extra-Affect-5226",
          "text": "If you’re just getting started in cybersecurity, focus first on the fundamentals: basic networking (how IP addresses, DNS, and firewalls work), operating systems like Windows and Linux, and core security concepts such as threats, vulnerabilities, and risk. From there, explore areas like ethical hacking, SOC analysis, or cloud security to see what interests you most. Hands-on practice through labs and entry-level certifications can really help build confidence. If you want a structured path that breaks everything down step by step, you might want to check out SecPro Academy. They make it beginner-friendly and practical.",
          "score": 3,
          "created_utc": "2026-02-25 13:46:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7e9ur0",
          "author": "majesticbeast67",
          "text": "You won’t get a job",
          "score": 3,
          "created_utc": "2026-02-25 20:59:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ea052",
          "author": "raifeller1984",
          "text": "you shouldn’t go into it without prior IT experience",
          "score": 3,
          "created_utc": "2026-02-25 21:00:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7bi9za",
          "author": "Disastrous-Classic66",
          "text": "Learn how to write an extremely good resume. Know how to network really good. It is not easy to find cyber work.",
          "score": 2,
          "created_utc": "2026-02-25 13:04:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7fgv41",
          "author": "Nawlejj",
          "text": "Cybersecurity is a specialized field of Information Technology, it’s not its own field and thus you can’t start right into cyber. You should be aiming to “start” in IT, not cyber.",
          "score": 2,
          "created_utc": "2026-02-26 00:38:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o774juj",
          "author": "AutoModerator",
          "text": "Hello,\n\nYour submission was automatically removed because your Reddit account does not meet our minimum karma or account age requirements. These measures help maintain the quality of posts on r/cybersecurity and prevent spam.\n\nRequirements:\n- Minimum of 20 comment karma OR 20 link karma\n- Account age of at least 10 days\n- Combined karma of at least 40\n\nTo build your karma, participate in discussions across Reddit and contribute thoughtful content in subreddits that welcome new users.\n\nIf you believe this was a mistake or have any questions, please message the mod team.\n\nThank you.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CyberSecurityAdvice) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-24 20:04:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ey51b",
          "author": "shangheigh",
          "text": "Its tough out  here,, you have to learn and be the best to be competitive. One growing field within cybersec is ai security. Maybe grow there and you'll place yourself strategically",
          "score": 1,
          "created_utc": "2026-02-25 22:56:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7f5y7f",
          "author": "TheOGCyber",
          "text": "The first thing you need to learn is that jobs are ultra-competitive because we're oversaturated with candidates applying for jobs.  You have to outshine the crowd if you want to get in.",
          "score": 1,
          "created_utc": "2026-02-25 23:38:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7hxv0v",
          "author": "LanternInTheDarkness",
          "text": "Everyone is doing it, make sure you stand out and aren’t average.",
          "score": 1,
          "created_utc": "2026-02-26 11:38:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ibhnq",
          "author": "CrypticChan3",
          "text": "A degree and certifications will get you nowhere. If you don’t already know someone in the field of IT or cyber that can hook you up with a job, do not bother",
          "score": 1,
          "created_utc": "2026-02-26 13:12:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ihovn",
          "author": "NeckFar6706",
          "text": "that you shoulda got in it 5 years ago",
          "score": 1,
          "created_utc": "2026-02-26 13:47:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7k6o9i",
          "author": "Evaderofdoom",
          "text": "security is not entry-level. If you have no IT experience give yourself many years before you'll be competitive for a security job.",
          "score": 1,
          "created_utc": "2026-02-26 18:38:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7kahbk",
          "author": "offsecthro",
          "text": "It's never ending. This isn't a field where you can learn how to do a specific job, and then do that same thing for the rest of your career. If you get into a technical area, you will always be reading new books, training different skills, and studying for certs, mostly on your own time. If you don't really love it and aren't driven by your own curiosity, save yourself the pain and do something else.",
          "score": 1,
          "created_utc": "2026-02-26 18:55:34",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rcpf7g",
      "title": "I built a tool that finds hidden pages on your website",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1rcpf7g/i_built_a_tool_that_finds_hidden_pages_on_your/",
      "author": "fiercemonkey202",
      "created_utc": "2026-02-23 18:25:27",
      "score": 4,
      "num_comments": 9,
      "upvote_ratio": 0.7,
      "text": "I was surprised there wasn't a single-feature tool like this where you could type in your website and get an output of it's hidden pages. So I built it! Would love your guys feedback, you can check it out at [hiddenpages.io](https://hiddenpages.io)",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1rcpf7g/i_built_a_tool_that_finds_hidden_pages_on_your/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o70wapx",
          "author": "Substantial-Walk-554",
          "text": "So basically gobuster,dirbuster or ffuff....?",
          "score": 7,
          "created_utc": "2026-02-23 21:31:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6zvwwy",
          "author": "Remote-Land-7478",
          "text": "I am new to cybersecurity, sorry if this is a stupid question, but doesnt gobuster do the same thing?",
          "score": 2,
          "created_utc": "2026-02-23 18:38:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o700aqp",
              "author": "apathyxlust",
              "text": "Yeah there's tons of web crawlers out there which can do the same thing. They largely fall into 2 methods, recursive (just scan the html response for links, add them to a list) or brute force (guess the link, usually with a premade common directory list).\n\n\nGenerally they're command line because too many requests from a single source can easily be blocked by the domain leading to the scan failing.",
              "score": 2,
              "created_utc": "2026-02-23 18:57:50",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o6zwr05",
              "author": "fiercemonkey202",
              "text": "I'm honestly not sure. I looked up gobuster and it looks like a command line tool (which is cool). I guess the difference is that this is browser based and easily used by pretty much anyone.",
              "score": 1,
              "created_utc": "2026-02-23 18:41:58",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6zxrv2",
                  "author": "Remote-Land-7478",
                  "text": "Just gave it a try now, Id reccomend adding a loading bar or something like that, its sort of annoying not knowing how long of a scan is left. Gobuster has a very good loading bar, Id reccomend checking it out for inspiration, other then that the site is great!",
                  "score": 1,
                  "created_utc": "2026-02-23 18:46:35",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o717ey0",
          "author": "CortexVortex1",
          "text": "Interesting, am curious how does this work?",
          "score": 1,
          "created_utc": "2026-02-23 22:25:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o73sf9p",
          "author": "cant_pass_CAPTCHA",
          "text": "Idea: put some hidden pages on your site so when someone lands there, if they scan your site, you can show it working. Getting robots.txt wasn't exactly mind blowing to see",
          "score": 1,
          "created_utc": "2026-02-24 08:43:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7arqe7",
          "author": "Infamous_Gear3578",
          "text": "Bravo ta gérée.",
          "score": 1,
          "created_utc": "2026-02-25 09:32:38",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1red73k",
      "title": "Is it bad to move all my OTP to OnePassword?",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1red73k/is_it_bad_to_move_all_my_otp_to_onepassword/",
      "author": "Murky_Language_3684",
      "created_utc": "2026-02-25 13:27:55",
      "score": 4,
      "num_comments": 5,
      "upvote_ratio": 0.84,
      "text": "Today I have 1Password and 2FAS for Android.\n\nI keep all my OTPs on my phone (backed up to GDrive) because I heard it's safer to not have all the eggs in one basket.\n\nBut lately I put a couple in 1P and even set up device auth for some sites and the convenience is super nice.\n\nI'm on the verge of just getting off 2FAS and putting it all in 1P. Im sick of fumbling for my phone constantly.\n\nAny super compelling reason to convince me not to do this?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1red73k/is_it_bad_to_move_all_my_otp_to_onepassword/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o7bnfv4",
          "author": "SageDesk",
          "text": "Genuinely the only real argument against it is if someone gets into 1Password, they get everything at once. Passwords and codes gone together.\n\nThat's it. That's the whole case.\n\nFor most people the risk is pretty theoretical. You're still doing way more than the average person. Do what you'll actually stick to.",
          "score": 3,
          "created_utc": "2026-02-25 13:34:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7bsiqz",
          "author": "DeathTropper69",
          "text": "1Password is one of the best password managers out there. I would get yourself setup with an account, move all your credentials there with their corresponding OTP codes, passkeys, etc, and then secure your account with a device bound passkey, hardware auth key, or OTP code from  a provider like Google Authenticator or Duo Mobile. As long as you have a secure master password and are careful with it, you will never have an issue.",
          "score": 3,
          "created_utc": "2026-02-25 14:02:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7l6ir1",
          "author": "panitechacademy2017",
          "text": "I’ve done the same thing, and it’s super handy. But security-wise, putting all your OTPs in one place is a single point of failure. Easiest compromise? Keep most in 1Password for convenience, but leave a few critical ones in another authenticator app as a backup.",
          "score": 1,
          "created_utc": "2026-02-26 21:28:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7lwt8b",
          "author": "josh109",
          "text": "its good to do this",
          "score": 1,
          "created_utc": "2026-02-26 23:42:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7mj0yi",
          "author": "cracc_babyy",
          "text": "No, it’s the responsible thing to do really",
          "score": 1,
          "created_utc": "2026-02-27 01:47:45",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rbijek",
      "title": "Should i go to uni or learn CS at home",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1rbijek/should_i_go_to_uni_or_learn_cs_at_home/",
      "author": "glokk29",
      "created_utc": "2026-02-22 10:29:59",
      "score": 4,
      "num_comments": 6,
      "upvote_ratio": 1.0,
      "text": "I think i would waste my time going to uni because my uni is like shit and i've heard that CS i skill based and will i get a job like this and what will be the complete roadmap?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1rbijek/should_i_go_to_uni_or_learn_cs_at_home/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o7ckfht",
          "author": "cyberguy2369",
          "text": "\\- what does \"because my uni is like shit \" mean?   \n\\- \" CS i skill based\"  \nsoftware development is somewhat skill based.. BUT you dont work in a silo alone.. you will work as part of a team (probably not a remote team) .. \n\ncomputer science is probably 10% of what you need to learn as you grow. if you go to an in person university.. and actually take advantage of the resources and opportunities at the university you'll learn ALOT.. and experience a lot..   \n\\- learn how to show up on time, deliver projects on time  \n\\- work with others, work with people not like you, that dont talk or work like you do.   \n\\- deal with difficult people, people you dont understand and some you dont even like in person.   \n\\- do things you dont think are relevant and useful.. this sounds stupid.. but its probably 60% of any job.   \n\\- taking criticism from people you like.. and many you dont like or respect but have to listen to anyway  \n\\- learn to talk to people and interact in person in a professional way.   \n\\- learn to write/type and express yourself via email, written reports, and other means of communication  \n\\- learn to fail.. and fail alot.. and keep going. \n\nas for CS and coding.. yeah you can learn it from some YouTube videos in your moms basement.. or you can learn it from a professor in a classroom full of other people with really interesting ideas and approaches you wont see or hear listening to a YouTube video. \n\nI've been in the industry 25yrs.. I'm a director and hiring manager at this point. When I hire someone, I'm not just hiring them to code or do \"cs things\" I'm hiring them to progress through the company and grow with the company.. that requires a 4 yr degree. CS is easy to teach. the being a human, learning to adapt and deal with people is not something I want to teach. (I shouldn't have to)\n\nin person universities offer research assistantships, you can work at the IT department on campus, and there are tons of clubs and organizations to get exposure and experience. you cant and wont get that anywhere else. You interested in AI, well the university has a AI cluster with 2terabytes of vram. you wont find that or have that opportunity anywhere else. robotics, there is a club for that, and 10 professors doing research. data visualization, yeah its there too. the opportunities are there.. even at a \"shit university\" but you have to look for them. \n\nyou also have to think about your competition. when I post for a new job, I get 300+ applications for one position. how do you compare? how would someone compare that has \"self taught\" on their resume to people with degrees and experience? why would someone in my position pick you over someone with a 4 yr degree and all the same skills you have? what skills would you have they wouldn't? \n\nuniversity is far far more about you growing as a human, opening your mind to all different kinds of people and opportunities, and learning to take advantage of the world around you.. instead of saying \"my university is shit, I can learn this on my own\" \n\nthats the kinda things you need to think about. ",
          "score": 3,
          "created_utc": "2026-02-25 16:18:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7h69fv",
              "author": "glokk29",
              "text": "\\- what does \"because my uni is like shit \" mean?\n\nmy university isnt good and i've talked with my seniors and they say that you have to learn it yourself so if i go to uni then i dont have enough time to learn at home\n\n\\- \" CS i skill based\"\n\ncybersecurity is skill based thats what i meant\n\nwhat if i improve my skills so good that i beat someone who has a degree\n\nwhat im trying is learn at home then do internship and then 1 or 2 year of helpdesk then apply for a job.",
              "score": 1,
              "created_utc": "2026-02-26 07:21:47",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7j1rff",
                  "author": "cyberguy2369",
                  "text": "I went through a mid tier university 25 yrs ago. the entire time I thought my university was \"shit\" too. went to class did the work.. didnt think I was really learning much from class, took a ton of classes I thought were a waste of time and money. I didnt feel like the CS program was up to date, we never talked about the internet, GUI's .. or all the things I thought were relevant. \n\n25 yrs later, looking back:  \n\\- I learned an absolute TON .. and I learned all the things I needed to learn :  \n\\* I learned a really really strong foundation in programming AND problem solving. I learned how to break big problems into small problems and take them iteratively.   \n\\* I learned to debug and problem solve.. if things didnt work I learned how to sort out why and debug them.   \n\\* I learned to teach myself and learn on my own.. HUGE skill in the industry  \n\\* I learned about a ton of different kinds of people and cultures by being stuck in classes and labs with people completely different than me. (just like in the workforce)  \n\\* I learned to deal with good people and bad people (good employees/professors and terrible ones)  \n\\* I learned to get the tasks done even if I didnt agree with it or understand.. (only to find out many of the useless tasks and assignments turned out to be things I really needed to learn and use)  \n\\* I learned to balance and regulate life, work, school.. my mental and physical health  \n\\* I got on some amazing research projects and play with super computers, GPU's and be around (and learn from some truly brilliant people) .. not just professors but classmates too\n\n<this is the \"back in my day\" section>  \n\\- we didnt have google, stack exchange, reddit or many online resources, no chatGPT or Claude.  \n\\- we had books, and a lab where everyone got together and worked through assignments and projects together. we learned together. THOSE SKILLS are as important as anything you learn in a book. If you needed an example or had a problem that wasnt outlined in the book.. you had to try different things until you found a way to make it work. \n\n  \nyou cant learn cyber without a solid foundation in tech.. you cant understand networking and cyber attacks if you've never worked in a business network.. its really hard to learn forensics if you've never worked in a business environment with the windows registry, group policies, servers, etc. \n\neveryone wants to get to work, make 6 figures, and work remote.. but without a solid foundation (education + experience) you're setting yourself up for failure.. without those things you'll be the first laid off.. then you'll be back in the application pool with more people with an education and experience.. \n\nslow down.. do things right.. be patient.. LEARN the right way.. take advantage of the opportunities right in front of you. \n\n\"what if i improve my skills so good that i beat someone who has a degree\"  \n\\- you're asking \"what if I'm the exception to the standard way of doing things\" .. how many people are the exception vs the standard normal people.. ? you're assuming you're going to leap ahead of the formally educated people by sitting at home watching YouTube videos and learning on your own.. while some of the people in school are taking classes by day, working, and learning more on their own. \n\ndo you want to risk your career and forward progression on betting on being the exception when you have the opportunity to be trained and learn in person? ",
                  "score": 2,
                  "created_utc": "2026-02-26 15:30:08",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6r1ydx",
          "author": "AutoModerator",
          "text": "Hello,\n\nYour submission was automatically removed because your Reddit account does not meet our minimum karma or account age requirements. These measures help maintain the quality of posts on r/cybersecurity and prevent spam.\n\nRequirements:\n- Minimum of 20 comment karma OR 20 link karma\n- Account age of at least 10 days\n- Combined karma of at least 40\n\nTo build your karma, participate in discussions across Reddit and contribute thoughtful content in subreddits that welcome new users.\n\nIf you believe this was a mistake or have any questions, please message the mod team.\n\nThank you.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CyberSecurityAdvice) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-22 10:29:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7knggt",
          "author": "pentesticals",
          "text": "Go to uni, yes you can learn the same skills anywhere but uni teaches you how to be a better learner. And then everyone has a degree these days so unless your an absolute rockstar why would a company hire you over someone with the same skills and a degree.",
          "score": 1,
          "created_utc": "2026-02-26 19:57:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7mz1mz",
          "author": "i_69_hot_milfs",
          "text": "Go to uni if u have to ask this. If you didn’t need to you would already be learning and not asking on Reddit.\nTrust me there’s nothing like 100k of debt to motivate you.",
          "score": 1,
          "created_utc": "2026-02-27 03:21:11",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rg3z15",
      "title": "What makes cybersecurity unautomatable?",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1rg3z15/what_makes_cybersecurity_unautomatable/",
      "author": "someone_3lse_",
      "created_utc": "2026-02-27 11:15:15",
      "score": 4,
      "num_comments": 28,
      "upvote_ratio": 0.7,
      "text": "I posted this on r/cybersecurity but it got autoremoved. Genuine question since I don't know anything about cybersecurity. It looks like software engineering is becoming more and more a job for AI. At the same time, I keep reading that security jobs can't be done by AI. What makes the field so fundamentally different from other software jobs and in turn harder to automate? Is it because of the required mental processes, or some kind of human input that AI can't deliver because of constraints?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1rg3z15/what_makes_cybersecurity_unautomatable/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o7onfva",
          "author": "realvanbrook",
          "text": "Cybersecurity is a field of jobs not one job. What job do you mean exactly?",
          "score": 11,
          "created_utc": "2026-02-27 11:33:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7oyyvu",
              "author": "MiKeMcDnet",
              "text": "Microsoft has the best AI, or so they say... They can't even properly decide what a malicious email is.  Some of us are here to change the AI's diaper when it shits the bed.",
              "score": 3,
              "created_utc": "2026-02-27 12:56:33",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o7oo1xg",
              "author": "someone_3lse_",
              "text": "As I said I know basically nothing about the field",
              "score": 1,
              "created_utc": "2026-02-27 11:38:24",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7oprst",
                  "author": "ninhaomah",
                  "text": "So perhaps you can start by finding out about it ?\n\nGoogle / ChatGPT / Gemini etc",
                  "score": 5,
                  "created_utc": "2026-02-27 11:51:36",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7psont",
                  "author": "clusterofwasps",
                  "text": "It’s a lot to know. Some subfields you can look into include network security, web application exploitation, malware analysis, IoT hacking, all sorts of stuff. Social engineering, open source intelligence (OSINT), that’s hot business. Program deconstruction/binary analysis.",
                  "score": 2,
                  "created_utc": "2026-02-27 15:36:29",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7pvb7o",
                  "author": "TheDuneedon",
                  "text": "Well you're wrong about it being unautomatable. Any team worth anything has automation to make things manageable. You just can't automate everything, and there are things that require human decition/analysis. Automation should remove stuff that doesn't (ideally), and find the stuff that's important, maintain things, etc..",
                  "score": 1,
                  "created_utc": "2026-02-27 15:49:06",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7oqjtk",
          "author": "NeverBeASlave24601",
          "text": "Parts of it are automatable. We do our best to automate things that we can. \n\nHowever, at the current level of AI full automation isn’t possible. Cyber Security needs a level problem solving and critical thinking that LLMs aren’t capable of. \n\nCan AI match patterns? Yes. Can it fully understand context, and adversarial intent in the way a human analyst with a decade of experience can? No.",
          "score": 7,
          "created_utc": "2026-02-27 11:57:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7otiz2",
              "author": "someone_3lse_",
              "text": "So are you saying that it's inherently more creative than software engineering?",
              "score": 1,
              "created_utc": "2026-02-27 12:19:01",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7pclvy",
                  "author": "Bizarro_Zod",
                  "text": "Software engineers are probably more creative because they are literally creating things out of nothing. Cyber Security has to deal with malicious actors either exploiting flawed systems/processes or engineering advanced methods of tricking systems into believing that their system is legitimate, if I were to simplify it down for the sake of conversation.\n\nTake the phishing email for example, if you are able to spoof an email in a way that the scanners do not pick up on an issue with it, but it very obviously leads to an incorrect address, AI on its own has limited ways to know that FranksHackingSite’s webpage that is designed to harvest your credentials is any more or less legitimate than FranksRedHot’s webpage that is designed to gather your info for marketing purposes. Both will want a username, password, and identifying information, and that can look pretty similar to AI, especially if it has limited ability to investigate the external webpages.\n\nA lot of malicious content is new and unknown, and without someone telling AI that it’s got a bad reputation there’s not a great way to handle that unknown content. Without having a zero trust policy (which is extremely restrictive for businesses to operate under, to the point where it will restrict revenue in certain ways) it’s easy to end up trusting too much to the point of being ineffective. Humans can investigate on a case by case basis the legitimacy of this content, or any possible anomalies that may pop up. There are also several times certain sites that you may deem an exception to the rule because that site is vital to the business, and your higher-ups are willing to accept whatever risk they may have.\n\nNot to mention insider threats, zero days, compromised credentials, malicious prompt injection, ect ect..\n\nI’m sure I’m missing a lot, but hope this rambling helps shed at least a little light from my POV.",
                  "score": 3,
                  "created_utc": "2026-02-27 14:15:14",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7p4nai",
                  "author": "NeverBeASlave24601",
                  "text": "No but maybe more analytical. LLMs which is what we’re dealing with here, let’s not confuse these with real Intelligence, are for languages. Coding is all language based so it makes sense that it is suited to these tasks. But LLMs don’t actually think.",
                  "score": 2,
                  "created_utc": "2026-02-27 13:30:56",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o7px96d",
              "author": "MartyRudioLLC",
              "text": "I agree, security isn't fully immune to automation as the repetitive parts will keep getting automated. AI becomes another tool in the stack rather than replacing humans responsible for defending the system. ",
              "score": 1,
              "created_utc": "2026-02-27 15:58:23",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7orn17",
          "author": "Jaideco",
          "text": "Well, one reason is that adversarial activity isn’t purely about brute force, it’s naturally chaotic.  Trying new approaches to see whether it achieves an objective.  Defensive measures can be aided by AI that learns to spot patterns of malicious behaviour, but when the attackers deliberately change their tactics to avoid detection, the AI might simply not be left with enough information to determine whether something is a threat or just novel behaviour.",
          "score": 3,
          "created_utc": "2026-02-27 12:05:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7otood",
              "author": "someone_3lse_",
              "text": "This makes sense, though I imagine that an AI system could flag novel behaviour and notify a tech-savvy business person",
              "score": 1,
              "created_utc": "2026-02-27 12:20:10",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7oytp3",
                  "author": "Jaideco",
                  "text": "It could. AI certainly can and will replace the common triage scenarios but there will still need to be a human in the loop for sophisticated attack scenarios for the foreseeable future because the attackers will be shaping their tactics explicitly to look benign to AI.",
                  "score": 1,
                  "created_utc": "2026-02-27 12:55:37",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7p30d8",
          "author": "FakeitTillYou_Makeit",
          "text": "Well I think network security is safe. So far it is hot garbage at troubleshooting a network.",
          "score": 2,
          "created_utc": "2026-02-27 13:21:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7pn9w8",
          "author": "ProverbialFlatulence",
          "text": "I’ll give a couple examples. \n\nPentests are largely scripted now. It’s crawling through systems looking for attack vectors to exploit and report on. I worked for a large company with subsidiaries. Even with manual review our external pentesters attributed findings to the wrong brand. Some of that is nuance we didn’t explain, and some of it is due to our needing to mature our CMDB. I’d say roughly 10-15% of findings for my brand ended up being reassigned to another brand because of this miss in automation. \n\nAnother example is in remediation efforts. We have all kinds of tools that automate things like vulnerability reporting, reclassification based on exploitability, and showing overall blast radius. With all of that, none of those tools can automatically remediate for us. Sure, they’re *capable*, but we have things like dependencies and cost considerations that prevent us from using those feature to their full potential. We keep a team of engineers staffed for this reason.",
          "score": 2,
          "created_utc": "2026-02-27 15:10:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7omkel",
          "author": "myeasyking",
          "text": "Good question. \n\nI'd like to know too.",
          "score": 1,
          "created_utc": "2026-02-27 11:26:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7otztr",
          "author": "Nawlejj",
          "text": "I’d say the biggest issue is that vendor platforms can’t natively talk with other vendor software/platforms. I.e, a vast majority of troubleshooting is trying to integrate two unique platforms / softwares. You have to know the engineering behind each one. AI works best when it’s only running in the context of one platform or one set of data. You use VMware but run a Windows VM that runs Exchange server. 3 separate pieces that do one function, an AI just can’t figure out yet.",
          "score": 1,
          "created_utc": "2026-02-27 12:22:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ozgi6",
          "author": "Balidant",
          "text": "I don't see AI replace software engineering. Programming? Maybe, but as of now the engineering part is to complex for LLMs.\n\nSame applies to security. Complex tasks, some may be automated but not the bigger picture. Additional, many incidents are caused by human mistakes. No AI can prevant that.\n\nAlso, humens are intelligent and make mistakes. Why would we think that an artificial intelligence makes no mistakes?",
          "score": 1,
          "created_utc": "2026-02-27 12:59:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7p10er",
              "author": "someone_3lse_",
              "text": "As of now is key here. Even if it won't, to my knowledge most people with the software engineer title are web developers and a lot of developers would want to become engineers. \n\nAn agent system doesn't get tired and doesn't get bored from testing. Regarding how many mistakes such a system will make in the future, nobody can know.",
              "score": 1,
              "created_utc": "2026-02-27 13:09:31",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7p5u01",
                  "author": "Balidant",
                  "text": "Not sure why web dev should be different here. Software engineering as a discipline is the same, independent from the programming language.\n\nYou're right, they may not get tired. But there are other constraints. LLM companies acquired basically all memory and hard drives for the next 1-2 years. That will have consequences for every other industry. It may not be LLMs being tired but deciding if the benefit is worth the cost.  And of course nobody can say what it look like in 5, 10 or 50 years. Maybe things get better. Maybe not. We will see.",
                  "score": 1,
                  "created_utc": "2026-02-27 13:37:39",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7prab6",
          "author": "clusterofwasps",
          "text": "Adversarial hacking is all about taking advantage of thoughtlessness, and using rules and order against itself. Automation is rules and order, so it’s inherently fertile for abuse. Security is about granular decisions, and to be truly effective, you’d need to consider so many conditions and changing circumstances that the effort to automate it would negate the desire to do so. Even what parts can be automated are mostly decided beforehand (like firewall rules or user permissions) or the user decides after being alerted (like allowing a file to install or a script to run). Automation is effective for information gathering like scans and backups, or for user awareness like warnings, but as far as automating security _processes_ like allowing or denying specific traffic, access, or usage outside of predefined rules… there’s never going to be a magic solution like that. But let’s fire everyone at CISA, hire the cheapest solo grunt to manage corporations using PII like it’s chewing gum, and put some AI bots in charge of infrastructure 👍 why not",
          "score": 1,
          "created_utc": "2026-02-27 15:29:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7q0n4t",
          "author": "Bob1915111",
          "text": "I used to work in a SOC as a SOAR engineer, what I did was basically automating anything that was even remotely automatable, and we automated a lot. What couldn't be fully automated was still partially automated. It was fun, kinda miss it. Vendors started integrating AI into SOARs at about the same time as I changed fields.",
          "score": 1,
          "created_utc": "2026-02-27 16:14:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7q0uea",
          "author": "SadInitiative3297",
          "text": "I'd say like everything. You can automate some parts but at some moment you need some human brain to take decisions.",
          "score": 1,
          "created_utc": "2026-02-27 16:15:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7q1cub",
          "author": "Thoughtulism",
          "text": "Cybersecurity is a broad field that combines multiple different disciplines including programming, systems integration, procurement, assessments, reporting, remediation, networking, systems administration, training, engagement, policy development, risk management, security incident response, etc\n\nIt's one of the most broad feels out there as it has its toes and almost everything.\n\nWhen we talk about automation we need to be talking about very specific things.",
          "score": 1,
          "created_utc": "2026-02-27 16:17:50",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rbn8by",
      "title": "Splunk Tutorials?",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1rbn8by/splunk_tutorials/",
      "author": "BadDentalWork",
      "created_utc": "2026-02-22 14:28:59",
      "score": 3,
      "num_comments": 2,
      "upvote_ratio": 0.81,
      "text": "Hey there! \n\nI have an interview coming up with an org that uses Splunk. My current org uses another, albeit similar, but I was hoping to brush up so I could speak intelligently about it and ease the learning curve if I actually get an offer. \n\nI’ve been YouTubing it, and I’m tempted just to spin up a VM and download the enterprise edition and do the free trial just to click around. \n\nAny ither links or pointers would be appreciated. ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1rbn8by/splunk_tutorials/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o6ryjps",
          "author": "River-ban",
          "text": "Check out Splunk Lantern and the Splunk Education portal.\n\nYou should also look for Boss of the SOC (BOTS) datasets they provide real-world scenarios that you can practice searching against.",
          "score": 3,
          "created_utc": "2026-02-22 14:32:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6rztei",
              "author": "BadDentalWork",
              "text": "Love it! Thank you",
              "score": 1,
              "created_utc": "2026-02-22 14:39:14",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1rekjea",
      "title": "Microsoft Edge Image Collections",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1rekjea/microsoft_edge_image_collections/",
      "author": "SadCommunication24",
      "created_utc": "2026-02-25 17:57:33",
      "score": 3,
      "num_comments": 0,
      "upvote_ratio": 1.0,
      "text": "Does saving an image on Microsoft edge store it on the device? If the image contained malicious code would saving the image within the browser put the device at risk?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1rekjea/microsoft_edge_image_collections/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": []
    },
    {
      "id": "1rfp2qn",
      "title": "Device for Cybersecurity student",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1rfp2qn/device_for_cybersecurity_student/",
      "author": "Background_Menu_7225",
      "created_utc": "2026-02-26 22:46:21",
      "score": 3,
      "num_comments": 11,
      "upvote_ratio": 0.8,
      "text": "Hello :))\n\nI  just started my Cybersecurity degree,\n\ncurrently using my old n cheap Lenovo Ideapad 3\n\nit got some issues with the display, keyboard and the battery\n\nso i was wondering if it’s a good idea to get a \n\nM2 Macbook Air (16GB RAM) ?\n\nWhat are your thoughts?\n\nTYI !!!",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1rfp2qn/device_for_cybersecurity_student/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o7lngvq",
          "author": "Classic-Tap-5668",
          "text": "No.\n\nGet a thinkpad and install linux on it",
          "score": 5,
          "created_utc": "2026-02-26 22:51:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7lpjgp",
              "author": "Background_Menu_7225",
              "text": "Thanks for your comment!\nbtw if you were to choose between a thinkpad and a gaming laptop like some Asus Tuf or something ..?",
              "score": 1,
              "created_utc": "2026-02-26 23:02:46",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7lqlde",
                  "author": "LosAnimalos",
                  "text": "If you are serious about your studies prioritize CPU and RAM for using VM’s most efficiently. Gaming laptops tend to weigh their focus on the GPU.",
                  "score": 4,
                  "created_utc": "2026-02-26 23:08:27",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7m57gc",
                  "author": "Classic-Tap-5668",
                  "text": "Ooooh for gaming.\n\nDepends on how much you want to prioritize gaming over cyber\n\nMore ram = better for cyber (vms, processes n shi)\n32 best 16 is enough\nMore cpu cores also = better\nGpu doesnt really matter unless youre brute forcing",
                  "score": 1,
                  "created_utc": "2026-02-27 00:28:57",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7m4rph",
          "author": "goldfish_glug_glug",
          "text": "Macs typically are typically hard to work with in college as a lot of software that you're required to use is exclusive to windows/linux. I have the Lenovo Thinkbook 7, works great with linux and looks better than the Thinkpads, and is very light. \n\nI'd get at least 32 GB ram if you can fit it into your budget. 16 is enough for one or two VMs, but you'll want wiggle room especially as you progress. For a CPU, most modern ones will do fine, biggest thing to look at is the amount of cores, it'll help for compile time and allocating cores for VMs.",
          "score": 1,
          "created_utc": "2026-02-27 00:26:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7mha36",
              "author": "AmountExotic2870",
              "text": "exclusive for linux… wont run on mac….\n\nsay that again… 3 times… slowly.",
              "score": 1,
              "created_utc": "2026-02-27 01:37:37",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7mhfqh",
                  "author": "goldfish_glug_glug",
                  "text": "LMAO im cooked",
                  "score": 1,
                  "created_utc": "2026-02-27 01:38:32",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7ml7bm",
          "author": "Standard-Proposal908",
          "text": "Just get a mini PC that you can carry it around I know my suggestion is expensive but if you build a pc without GPU you can focus on part like high end CPU and RAM. Keep in my if you not care to carry extra weight yeah I think build a pc is a good option. I also a cybersecurity student and have a mini pc, I carry around my pc seen 2021 until now plus I got max out my RAM to 96GB :D",
          "score": 1,
          "created_utc": "2026-02-27 02:00:21",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rfxein",
      "title": "Where to go next, Student",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1rfxein/where_to_go_next_student/",
      "author": "olimpiathe505",
      "created_utc": "2026-02-27 04:55:57",
      "score": 2,
      "num_comments": 12,
      "upvote_ratio": 0.57,
      "text": "Cybersecurity Student last year looking for the next step in certs and projects while I finish college. 4 years prior service.\n\nMy classes are good but they leave a lot of free time to be looking for more to learn. I have a good understanding of all Cybersecurity I have a year of consistent work on projects all added together without breaks, I currently have Trifecta, CySA+, and a few other less important certs. I attend Emerging Tech conferences and community CTFs.\n\nI’m looking for certifications that if you were hiring someone you’d say “oh yeah I want that guy on my team”\n\nProjects that give me an expert level understanding in General IT, Cyber or Cloud. Again I need it to give\n\n“oh yeah I want that guy on my team”\n\nI have imposter syndrome and I know it won’t go away but I want to manage it a little better with looking good on paper.\n\nEDIT: I am not looking for Job Hunting, Networking, or Life advice. I’m looking for Project and Certification recommendations from experience",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1rfxein/where_to_go_next_student/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o7njz02",
          "author": "cyberguy2369",
          "text": "\"hey leave a lot of free time to be looking for more to learn\"  \n\\- why not get a job in IT? walk over to the IT dept on campus \"hi, I'm a cyber student looking for opportunities to gain experience and work\"",
          "score": 2,
          "created_utc": "2026-02-27 05:42:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7nkxxz",
              "author": "olimpiathe505",
              "text": "I’m looking for an idea of next steps in certifications and projects. Not job hunting advice",
              "score": -2,
              "created_utc": "2026-02-27 05:50:09",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7p0ad0",
                  "author": "cyberguy2369",
                  "text": "\"I have imposter syndrome and I know it won’t go away but I want to manage it a little better with looking good on paper.  \n\\- the way to get over \"imposter syndrome\" is doing.. and having a manger or boss tell you \"you can do this\" or \"you're doing great\" \n\nEDIT: I am not looking for Job Hunting, Networking, or Life advice. I’m looking for Project and Certification recommendations from experience\"  \n\\- well.. that attitude isnt the right attitude to have.. and the thing about reddit is.. you post a question and you get answers.. not the answers you want to hear.. but sometimes the ones you need to hear from industry veterans.. :-)\n\n\n\ngetting a \"gold star\" from getting a cert from your bedroom.. or working on a home project in a perfect lab environment is not the same as working on an old network full of broken and vulnerable systems and making it work.. its not the same as learning from senior experienced people in the industry. \n\nif anxiety and fear is this much of an issue it need to be addressed before you try to get out in the real world and job market. \n\nthe idea or mentality of \"I'll be okay once I get a few more certs.. or do a few more projects..\" it never works.. you're just kicking the can down the road. \n\nin the current job market:  \n\\- 1000's of people have a bunch of certs and no job experience.. how do you stand out.. ?   \n\\- certs only show you can sit in a room memorize terms, take multiple choice exams.. thats not the skillset jobs are looking for.   \n\\- I've been in the industry 25 yrs, I'm a director at this point. Your view point is what is holding you back, not your skillset. part of life at the age you are is getting uncomfortable and learning how to work, and \"fail\" (aka not do things right.. take the criticism, pick yourself back up professionally and get back to work) you dont learn that from a cert or home project.   \n\\- you need to show you can show up to work on time, work with others in a professional environment, and solve problems without multiple choices. \n\nDont wait until after you graduate or you'll be like 90% of the young people in this group saying they cant get past the interview process. \n\nfind a job in IT, through your university, or an IT contractor in your area. They wont throw you in the deep end.. a good one will train you and help you get the confidence you need... and it could lead to a real full time job. \n\nget to work.. do the projects they ask you to do.. if you have some things to work through like anxiety, depression, etc. get the help you need. its common and very addressable. ",
                  "score": 1,
                  "created_utc": "2026-02-27 13:04:57",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7neouy",
          "author": "Cypher_Blue",
          "text": "Bad news, brother- there are no certifications that are going to make me or anyone else say \"yeah we want that guy on the team.\"\n\nCertifications are primarily good for getting past HR filters- they are never going to get you a job.\n\nThe cyber market is a flaming pile of dog crap right now, especially at the junior level. But even without that, cyber security is almost never an entry-level position- what employers want to see is a strong technical skill set backed up by some amount of actual IT industry experience. So you should expect to grab a job in a networking role or at a helpdesk or other basic IT role before you slide into security.\n\nOne possible exception to this is if you can snag an internship and go to events and conferences or whatever to put a face with your resume- that kind of networking is worth a thousand basic certs.",
          "score": 2,
          "created_utc": "2026-02-27 05:03:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7ngaa0",
              "author": "olimpiathe505",
              "text": "Thank you. I understand the basic concepts of HR and Job Markets. I’m not worried about getting a Cybersecurity job or any IT job currently. I have a very good Network of people and well trained technical skills.\n\nI need ideas for Advanced Certifications and advanced Projects",
              "score": -2,
              "created_utc": "2026-02-27 05:15:00",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7nh010",
                  "author": "Cypher_Blue",
                  "text": "You said:\n\n> I’m looking for certifications that if you were hiring someone you’d say “oh yeah I want that guy on my team”\n\nAnd I'm telling you that this is not a thing. There are literally zero certs or projects that you're going to complete while you're in college that are going to make you a \"wow\" candidate to an employer. \n\nYou can check out the [cyber certification roadmap](https://pauljerimy.com/security-certification-roadmap/) to see a HUGE list of certs, but there is not a single cert on that list that's going to put you at the front of an employment line.\n\nAnd an \"advanced\" certification is not really applicable to you because you're still in school and have no experience. You're at the \"basic\" certification level right now.",
                  "score": 1,
                  "created_utc": "2026-02-27 05:20:13",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7nvw8f",
          "author": "cankennykencan",
          "text": "Alot of advance certs which you've said your looking for require experience.",
          "score": 1,
          "created_utc": "2026-02-27 07:21:17",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}