{
  "metadata": {
    "last_updated": "2026-01-30 16:57:45",
    "time_filter": "week",
    "subreddit": "CyberSecurityAdvice",
    "total_items": 20,
    "total_comments": 147,
    "file_size_bytes": 161359
  },
  "items": [
    {
      "id": "1qof5b4",
      "title": "Bachelors or masters in cybersecurity?",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qof5b4/bachelors_or_masters_in_cybersecurity/",
      "author": "TraditionalCry640",
      "created_utc": "2026-01-27 14:21:10",
      "score": 42,
      "num_comments": 94,
      "upvote_ratio": 0.88,
      "text": "Hello, yall. I’m currently in college for a bachelors in cybersecurity but everyone on Reddit just complains about how hard it is to break into cyber and you need 3-7 years of experience in tech and blah blah blah. So now I’m doubting my degree a little. I still want a degree but I’m worried about my future yk? So I’m wondering does getting a masters make a huge difference for job prospects or not really? Would it be worth my time to get a master?\n\nEdit/update: thank you everyone for the response. Common consensus seems to be I don’t need a masters and should focus on experience. Which I’m trying. I have my A+, about to test for my net+, and then on to sec+,ccna, and maybe some other small certs as I keep looking for any entry tech job. I might get a masters later on but that would be deep into my career perhaps. Any other thoughts please feel free to comment",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qof5b4/bachelors_or_masters_in_cybersecurity/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o20sqyl",
          "author": "cyberguy2369",
          "text": "a few questions: (a lot of questions.. and a place to start)  \n\\- where are you? (what country or region)  \n\\- are you a citizen of that country (it can drastically change what kind of jobs are open to you)  \n\\- is this an online only university program or in person?  \n\\- what are you doing outside of the assignments in terms of tech or cyber ?  \n\\- do you have a job? is it in tech?  \n\\- are you involved in the school at all? do you know your classmates? upperclassmen (who will find jobs before you),  \n\\- do you know your professors? do your professors know you?  \n\\- are you involved in any clubs or organizations?  \n\\- have you reached out to your university/dept career services representative? who hires from your school? are they hiring? what are they looking for? the students that got the jobs with these companies, what skills did they have? do you have those skills? what skills are these companies that recruit from your university looking for?  \n\\- have you looked at job postings for entry level positions in your area? (not just linkedin postings, many of those are fake), not just google, crowdstrike, etc..  what skills are those companies looking for? do you have those skills and the requirements they are looking for? how do you get those skills?",
          "score": 6,
          "created_utc": "2026-01-27 14:34:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o20th9a",
              "author": "TraditionalCry640",
              "text": "USA. Yes I’m a citizen. Online with WGU. Currently not doing much outside of school. Was thinking about making a homelab and maybe trying for some job shadows. I have a job. Not in tech. Not really a lot of options around. Even for entry level. So that’s an issue. I’m not really involved with the school bc it’s online so no to your last three points",
              "score": 4,
              "created_utc": "2026-01-27 14:38:09",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o210nh1",
                  "author": "cyberguy2369",
                  "text": "I manage and direct a cyber team of about 10 people, and we’re part of a larger group of roughly 50. I do occasionally hire college graduates, though I’m not hiring right now.\n\nIf you put yourself in my position and you have one opening to fill, that person has to walk in ready to work on day one. They’re joining an overworked team and need to contribute quickly.\n\nNow imagine a candidate who says:  \n“I’m online with WGU. I’m not doing much outside of school. I’ve thought about building a homelab and maybe trying to job shadow. I have a job, but it’s not in tech. There aren’t many local options, even entry-level. I’m not really involved with the school since it’s online.”\n\nWould you hire that person?\n\nThat candidate wouldn’t be competing against one or two people. They’d be competing against dozens, sometimes hundreds, of applicants. Many of them already have hands-on IT experience, internships, student jobs, help desk work, or lab work they can clearly explain and defend in an interview.\n\nSo what can you do to improve your chances of getting noticed?\n\nThere is no place in this country that doesn’t have some kind of IT or tech work happening. Small businesses, local governments, hospitals, schools, manufacturers, even farms need IT support. You have to go find those opportunities.\n\nThis is one of the biggest weaknesses of fully online programs. They don’t naturally provide the resources, exposure, and networking that in-person universities do. That doesn’t mean it’s hopeless, but it does mean the burden is on you to work harder to stand out.\n\n“Thinking about doing a homelab” isn’t enough. You need real-world, in-person experience. You need to show that you can show up on time, work with other people face-to-face, take direction, accept criticism, and function in real operational environments. That’s what hiring managers are looking for, especially when the team is already stretched thin.",
                  "score": 13,
                  "created_utc": "2026-01-27 15:12:51",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o24vdex",
                  "author": "NeonSahara",
                  "text": "Yeah honestly the degrees won’t matter unless you get experience. I started at Best Buy! Now I’m with a company who’s going to help pay for my WGU degrees. I was going to get a BS and MS in Cybersecurity but decided to do Cloud and Network Engineering - AWS for my BS and then Cybersecurity for my MS.",
                  "score": 1,
                  "created_utc": "2026-01-28 01:51:48",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o21jhjx",
          "author": "aarontminded",
          "text": "Would you rather be working help desk with a bachelors or a masters?",
          "score": 5,
          "created_utc": "2026-01-27 16:36:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o219alv",
          "author": "Beneficial_Cry_9152",
          "text": "Not sure if it’s an option but military is a very common route. As a bonus many companies have veterans programs. The advantage is your expenses are paid and not only do you get trained in offensive or defensive security, you get real world on the job training.",
          "score": 2,
          "created_utc": "2026-01-27 15:52:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o233iko",
              "author": "TraditionalCry640",
              "text": "I’ve thought about it. But I do have a lot of health issues that would make that hard. I am a certified personal trainer and workout a lot and I’m fit but overall health is poor. Like my heart and lungs. But still on option I suppose",
              "score": 1,
              "created_utc": "2026-01-27 20:40:07",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o24v3qc",
          "author": "Objective_Lake151",
          "text": "Save your money and go to trade school.  Cyber is dead for the simple reason that when a breach happens, no one and I mean NO ONE gets called out on it.  There are zero financial repercussions from not properly securing data/network/cloud/devices/etc.",
          "score": 2,
          "created_utc": "2026-01-28 01:50:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o20v1eg",
          "author": "Cool-Ad5807",
          "text": "Ingénieur de plus de 10 ans d'expérience dans la cyber.  \nFaits un master.",
          "score": 1,
          "created_utc": "2026-01-27 14:45:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o20zhx7",
          "author": "JustAnEngineer2025",
          "text": "Not likely.\n\nFor example, in the USA \\~100K Bachelor's and \\~50K Master's degrees are awarded in related fields every single year. \n\nYou can do your own research on popular certifications and niche skill sets (e.g., red team) and look at those numbers.\n\nI urge you to look at job postings and see what employers are asking for when it comes to education, experience, and certifications. That should guide you more than what some anonymous individuals in the internet provide.",
          "score": 1,
          "created_utc": "2026-01-27 15:07:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o210382",
              "author": "TraditionalCry640",
              "text": "Fair enough. And yeah I’ve been looking at the few listings around (not entry level but still what’s around) and have been screenshotting what they are looking for so I can start doing some more certs in the mean time based of that",
              "score": 2,
              "created_utc": "2026-01-27 15:10:12",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o21alnv",
                  "author": "JustAnEngineer2025",
                  "text": "Excellent.",
                  "score": 1,
                  "created_utc": "2026-01-27 15:57:39",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o213u1r",
          "author": "[deleted]",
          "text": "[deleted]",
          "score": 1,
          "created_utc": "2026-01-27 15:27:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2143pr",
              "author": "TraditionalCry640",
              "text": "Damn. Good for you lol nice to hear stuff like that and not just people saying they have 10 years of experience but can’t get a job lol",
              "score": 1,
              "created_utc": "2026-01-27 15:28:47",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o218wkf",
          "author": "ChemistBrief716",
          "text": "I would just go for bachelor's and try to land a help desk gig while you're in college. A lot of campuses have part time help desk positions.",
          "score": 1,
          "created_utc": "2026-01-27 15:50:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2194w7",
              "author": "TraditionalCry640",
              "text": "Kinda what I’m trying to do. My college is online tho. But Ive been looking for any entry level job. I’m eager to learn but there’s just not a lot of tech jobs around",
              "score": 1,
              "created_utc": "2026-01-27 15:51:20",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o21due8",
                  "author": "ChemistBrief716",
                  "text": "Ya it took me about 2 years to find mine and three CompTIA certifications. If you have the spare time i highly suggest getting the A+ and Net+. If you stick to it you'll land a job eventually but I definitely know my certs helped me get my job. I really think a bachelors and help desk experience will look good on your resume.",
                  "score": 1,
                  "created_utc": "2026-01-27 16:11:48",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o21lt4n",
          "author": "Rolex_throwaway",
          "text": "No, a masters won’t make a big difference. A masters is useful if you are trying to get into cybersecurity from another field.",
          "score": 1,
          "created_utc": "2026-01-27 16:46:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o21uq20",
          "author": "Yuuku_S13",
          "text": "The most important thing is to get experience!. If you want to be in cyber, try to focus on getting a role in the networking space. Nobody really starts off in cyber (there are a few) but most I know start off as admins of sorts, learn how to defend and expand their abilities and migrate to cyber.",
          "score": 1,
          "created_utc": "2026-01-27 17:24:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o21xk7s",
          "author": "Wooden-Doubt6949",
          "text": "Work, work, work = do projects and post about it, apply for internships and holiday jobs in cybersecurity. If you have the opportunity to get a master as well, take the chance and pick an interesting (infrastructure) topic that survives time. Might not look important now and there are many influencers telling young people to skip learning time. But at the point you are 40+ it pays off.",
          "score": 1,
          "created_utc": "2026-01-27 17:37:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o21ylov",
              "author": "TraditionalCry640",
              "text": "Yeah. I thought about making a home lab and then making a website about it. Kinda like my own little blog. I’ve seen some other people do that and that sounds like a good idea to me. But I’m kinda on the fence about a masters. It might just depend what job I’m working when I graduate. That might decide if I should get a masters or not.",
              "score": 1,
              "created_utc": "2026-01-27 17:41:45",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o21zdp2",
                  "author": "Wooden-Doubt6949",
                  "text": "Would keep it lean and post here or on Linkedin - as it is career-related for you. Also, you make your career decisions. The company might not exist anymore when you want to make the next big step.",
                  "score": 1,
                  "created_utc": "2026-01-27 17:45:09",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2258ci",
          "author": "No-Main3801",
          "text": "You need to get helpdesk experience and work your way up you won’t get into cybersecurity with just a degree",
          "score": 1,
          "created_utc": "2026-01-27 18:10:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o258ne6",
              "author": "Skyhigh95",
              "text": "And then the masters will make sense",
              "score": 1,
              "created_utc": "2026-01-28 03:01:24",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o225b9s",
          "author": "DJSmithyy",
          "text": "I mean never hurts to do a masters but like best thing to do I found was internships to get some experience that’ll help land a job or at least that’s what I found I graduated university and I currently am working in the SOC Team at my company and I never did a masters. So I’d say if you can’t find anything when you graduate go do it but if you can find a job that’ll push you straight into it then go for that",
          "score": 1,
          "created_utc": "2026-01-27 18:10:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o225w2j",
              "author": "TraditionalCry640",
              "text": "Yeah that’s kinda what I’m thinking. If I have no experience by the time I graduate I might as well do my masters and keep trying for experience in the mean time lol hopefully that’s not the case and I can land an entry level job soon",
              "score": 1,
              "created_utc": "2026-01-27 18:12:54",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o22fsk1",
                  "author": "DJSmithyy",
                  "text": "Yeah hope you find something, I applied for so many internships before I landed mine but I wouldn't shy away from just general IT stuff when looking as well cause any experience is better than no experience.",
                  "score": 1,
                  "created_utc": "2026-01-27 18:54:35",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o227q1w",
          "author": "TheOGCyber",
          "text": "A Masters would be a waste of money until you have several years of experience.\n\nExperience >>>>>>>>>>>> Certifications >>>>>>>>>>>>>> Degrees",
          "score": 1,
          "created_utc": "2026-01-27 18:20:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o228pri",
              "author": "TraditionalCry640",
              "text": "Fair enough. Seems to be the common consensus that a masters isn’t needed and I should focus on experience. Which I’m trying. Trust me, I’ve been looking everywhere for a job but no luck so far.",
              "score": 1,
              "created_utc": "2026-01-27 18:24:47",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o22jg1z",
          "author": "Slow_Neighborhood94",
          "text": "Ok, there are some common complaints about degrees that are understandable but largely come down to misunderstandings, in my opinion. Particularly in IT, a degree is not needed in order to break in. And often, in the first few years, someone who skipped college and went straight into IT will earn more than someone who went the degree route first. But this compensation gaps tends to flip after a few years for a couple reasons that I don't think get talked about much.\n\nWhile you don't need a degree to break into IT, a degree definitely cuts down on the experience requirement when you apply for roles (not in the first couple years, but once you're established it definitely makes a difference). This is less pronounced for purely technical roles, but as you progress your career and consider promotion opportunities you'll really start to notice it.\n\nSo this really breaks down into 2 different considerations: 1) Are you comfortable continuing school? 2) Do you know for sure that want to focus on security policy/compliance and/or want to work your way towards CISO type leadership roles?\n\n1) School isn't for everyone. The system is just not ideal for certain personality types. But don't jump to conclusions just because school is annoying. Are you able to focus in classrooms, get your homework done, and write term papers? Are consistently passing your classes without much difficulty? If the answers are yes, then you should probably go down the college route. But if you do have trouble staying focused in a classroom or completing your coursework, then you may want to consider going directly into IT.\n\n2) Question 2 is specifically to figure out if you should pursue a Masters degree right away. In most cases, a Masters degree will not give you a significant leg up when breaking into IT or IT Security. But down the line, if you are considering management or executive positions, a Masters degree will become a requirement. If you know now (or before you complete your Bachelors) that you really want to focus on GRC, compliance auditing, or policy writing, then in those cases a Masters can also be beneficial.\n\nIn most cases I would say don't sign up for a Master program right from highschool, unless it condenses a both a Bachelors and Masters degree into a shortened timeframe. You can always sign up for a Masters program while finishing a Bachelors degree or go back to school mid career for a Masters, but a lot of people start to feel burnout by the end of their Bachelors program.  \n  \nThere's also the financial piece to consider, but I'm of the opinion that either type of degree in a STEM field will pay for itself down the line.",
          "score": 1,
          "created_utc": "2026-01-27 19:10:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o22qxz0",
              "author": "TraditionalCry640",
              "text": "Thanks for the insight. I’m definitely academically inclined so learning all this hasn’t been too bad so far. But personally, I am a hands on learner. Literally any tech job would help me immensely. I do agree a masters probably isn’t the move rn but might be helpful later. But in that case I’ll go back and get it. I imagine the rest of my life I will be working while studying new stuff anyways. Tech is always evolving and I’d need to stay on top of stuff anyways yk?",
              "score": 1,
              "created_utc": "2026-01-27 19:43:27",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o24rio4",
          "author": "nkwemohb",
          "text": "bro thinks he's gonna find a job either way😭",
          "score": 1,
          "created_utc": "2026-01-28 01:31:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o25sqw9",
          "author": "beastofbarks",
          "text": "Tbh we dont hire cyber grads. We hire compsci/EE. Literally zero people in infosec at my company have cyber degrees except for one guy that got a MS after being hired.",
          "score": 1,
          "created_utc": "2026-01-28 05:00:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o269ucq",
          "author": "Humble_Wash5649",
          "text": "._. In my opinion after speaking to professors and industry professionals. Never get a cybersecurity masters degree. For research, most professors have no clue what you should know unless you have a lot of research experience since every school has different coursework. For industry, unless you want to be a manager or do legal work for compliance then it might be helpful but for technical work, you’re better off getting a computer science masters.",
          "score": 1,
          "created_utc": "2026-01-28 07:09:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o26sw9s",
          "author": "IMissMyKittyStill",
          "text": "Bachelors in comp sci would be the best choice.",
          "score": 1,
          "created_utc": "2026-01-28 10:01:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o26tzuu",
          "author": "Malhodauh",
          "text": "I would recommand following online practice courses such as TryHackMe. The invesment is defenitively worth it as it allow you to follow your own learning path while practicing.\n\nCreating a home-lab to run some test is great to learn by yourself and also a strong point to mention as experience in a job interview.",
          "score": 1,
          "created_utc": "2026-01-28 10:11:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o27jzhz",
          "author": "Kind_Entry9361",
          "text": "It depends on your level of knowledge. Degrees mean nothing if you do not have some level of intelligence. I have students who used AI for their homework. Now they are in school debt without any knowledge to show for it. On the other side, I have students that actually read, study, use office hours, and participate in ctf constantly. The latter will find a job. The former will not make it past the tech screen. A degree is just a piece of paper. Some companies will hire you without a degree. Information Security degrees are a pretty recent development. To enhance your education, skills, or degree, I recommend the following certifications (cissp, ccsp, oscp, security+). These will open more doors than others",
          "score": 1,
          "created_utc": "2026-01-28 13:22:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o29mx0p",
          "author": "EuphoricEgg63063",
          "text": "Personally wouldnt get a Masters. Sec+ is bare minimum and will most likely be needed to even get an entry level position. I would only get CCNA if you plan on going the networking route. But if you do decide to go that route then that is just the entry level cert and you will need another for sure. \n\nGet some kind of Tech job, doesnt matter what it is. Even part time. You just need a resume builder. I actually worked for a company named Fast-teks in college. Im not sure if they are even around anymore. It was basically Geek Squad going to peoples houses to fix things. Usually, adding RAM, clearing viruses, fixing connections, wifi, etc. That job didnt require any kind of experience.",
          "score": 1,
          "created_utc": "2026-01-28 19:03:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2alz3f",
          "author": "ITguyBass",
          "text": "Yeah, as you said on your edit, you are on the right path, experience and real experience weigh a lot more on your career, this is how this area works. A master's degree would just hold you down(for this area), keep doing what you said you are doing, and all will work out. You are already focusing on Net+ and CCNA and this is the right path for sure, a solid understanding of network is essential.\n\nthe",
          "score": 1,
          "created_utc": "2026-01-28 21:38:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o20t1ui",
          "author": "username320char",
          "text": "Do you have any tech experience? Service desk, sys admin, networking? \n\n\nYou say blah blah blah, but the blah blah blah is what will get your foot into the door. \nI wouldn't recommend a masters in the job climate.",
          "score": 0,
          "created_utc": "2026-01-27 14:36:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o20tu77",
              "author": "TraditionalCry640",
              "text": "No experience yet. I’m trying to find an entry level job but I’m kinda in the middle of nowhere so there’s not a lot of options around. And the jobs I do find tend to be for senior positions. And yeah ik you need the blah blah blah. Everyone on Reddit is just so negative about it lol",
              "score": 1,
              "created_utc": "2026-01-27 14:39:56",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2121p8",
                  "author": "Sivyre",
                  "text": "Here was my experience and it was not fun and I do not recommend what happened to me to anyone else.\n\nI graduated from uni not long ago earning my accreditation. Upon graduation I went off to go do my student co-op as a solutions architect from which my program was secure software engineering.\n\nI was hired on a short term contract that lead to full time employment as a security architect - yes I’m well aware that this went far beyond against the grain and while some would say that I am lucky I ask myself all the time… was I though? When contracted I was asked to fix the organizations 4 year failed threat modelling process because I had vast knowledge for AppSec, DevSecOps and SSDLC as a result of my program. I did that, I turned around the culture and educated them and wrote literally a field manual for how to do threat modelling efficiently and effectively. I did this while apart of the security architecture team as a solutions architect and one senior sec arch was blown away and asked where the heck did I learn this stuff because he’s never seen anything like it. This is what led me to immediately be hired full time as one of them.\n\nNow comes the problems I faced. I knew software, I knew the methodologies, I knew the frameworks, I knew the tools, I knew how to code with security as the forefront. I however did not know networks, and I did not know the systems and how all those things come together. This aspect that I did not know is what is most important in cybersecurity. Now I told my director that they can find better talent than what I had to offer when they offered me full time - it did not feel good to me but my director reaffirmed that I would learn these things with time but my value was more so the development side of the house because not 1 member of the team knew it like I knew it and this is what they wanted. So I accepted.\n\nFor easily 1 year after being hired I suffered extreme anxiety, and extreme imposter syndrome and it took a long time to feel like I belonged amongst these seniors in the space. I always felt stupid and always felt I needed to leave. I couldn’t speak on the technical level the others of my team spoke on and I struggled to even sit and listen during conversations because I could not keep up.\n\nIt was terrible but my director was always ready to keep me grounded and calm my nerves.\n\nNow while my team and my director were as patient as they were and that I so desperately needed, I fathom it would be difficult for others finding themselves in a similar position would too have a team ready to support a very jr member of the team that the jr requires in order to succeed with time. Especially that by all accounts, I should never have been hired as a security architect, it was by far too senior of a role for a fresh graduate. I still cannot comprehend why take the chance on me from the directors pov.\n\nSo it is possible to expedite one’s way into cybersecurity but it will yield consequences and in my case it was my mental health for the longest time.",
                  "score": 1,
                  "created_utc": "2026-01-27 15:19:19",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o226dnf",
                  "author": "willi1221",
                  "text": "Everyone on Reddit is negative about everything lol",
                  "score": 1,
                  "created_utc": "2026-01-27 18:15:00",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o20zr8a",
                  "author": "kinopiokun",
                  "text": "Honesty that doesn’t jive with your desired reality isn’t negativity ;)",
                  "score": -1,
                  "created_utc": "2026-01-27 15:08:36",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o20so1w",
          "author": "Longjumping-Donut655",
          "text": "Masters is always the answer",
          "score": -2,
          "created_utc": "2026-01-27 14:34:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o20un84",
              "author": "Proper-You-1262",
              "text": "No, it's not. Hiring managers do not care about a masters in security. I interviewed someone with a masters in security, but they never even used a VPN yet...",
              "score": 5,
              "created_utc": "2026-01-27 14:43:54",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o20vjuv",
                  "author": "TraditionalCry640",
                  "text": "Yeah you get that problem of being “overqualified” but lacking the hands on experience. I have no problem working an entry level job to get that experience but my options are limited where I’m at. I’m not near a techy area or even a populated area",
                  "score": 1,
                  "created_utc": "2026-01-27 14:48:19",
                  "is_submitter": true,
                  "replies": []
                },
                {
                  "id": "o20vylc",
                  "author": "Longjumping-Donut655",
                  "text": "Ok well did a bachelors or masters help more to get him into the interview pool in the first place?\n\nAnyway, That’s not all there is to an education. It’s also the access to internships, networking/industry connections of your school. So you can build up work experience while you get your education.",
                  "score": 1,
                  "created_utc": "2026-01-27 14:50:19",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o213dss",
                  "author": "jmp_rsp",
                  "text": "I am sorry, in what world using a vpn is a qualification for working in cyber?",
                  "score": -3,
                  "created_utc": "2026-01-27 15:25:29",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qptmyj",
      "title": "How can I stand out in cybersecurity",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qptmyj/how_can_i_stand_out_in_cybersecurity/",
      "author": "Intelligent-Pop-970",
      "created_utc": "2026-01-29 00:47:22",
      "score": 21,
      "num_comments": 16,
      "upvote_ratio": 0.93,
      "text": "",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qptmyj/how_can_i_stand_out_in_cybersecurity/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o2bryq3",
          "author": "Background-Slip8205",
          "text": "Have 10+ years experience with at least a fundamental understanding of each major component of the IT infrastructure and how they tie into each other.  Windows, Linux, Hypervisors, storage arrays, backup appliances, network devices, firewalls, AD, middleware, devops, auditing, logging, reporting, ticketing systems, ect.  \n\nOtherwise you make bad decisions because you don't understand how your changes impact the environment and how everything works together in harmony.\n\ntl;dr  Get experience.",
          "score": 21,
          "created_utc": "2026-01-29 01:06:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2c1c7p",
          "author": "arihoenig",
          "text": "Host North Korean laptops in your home. You'll get a lot of attention.",
          "score": 13,
          "created_utc": "2026-01-29 01:58:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2dxych",
              "author": "PismoSkydiver",
              "text": "You’re right, OP wants to stand out from the rest of the crowd. It doesn’t get any better than having the direct in-person attention of several 3-letter agencies. Ha!",
              "score": 2,
              "created_utc": "2026-01-29 10:22:50",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o2l1n1g",
              "author": "moobybooby",
              "text": "Take my god damn upvote.",
              "score": 2,
              "created_utc": "2026-01-30 11:19:22",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2cca2b",
          "author": "carax01",
          "text": "Obtain the uncensored Epstein files and publish them. ",
          "score": 6,
          "created_utc": "2026-01-29 02:57:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2dy1d3",
              "author": "PismoSkydiver",
              "text": "🤣",
              "score": 1,
              "created_utc": "2026-01-29 10:23:35",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2c82l8",
          "author": "regisdesmeules",
          "text": "Build specialized cyber training programs and become a trainer in specific areas of cybersecurity. It’s an excellent way to demonstrate to the market, companies, and individuals your mastery of one or a few cybersecurity domains. I built my first cybersecurity consulting company this way.",
          "score": 6,
          "created_utc": "2026-01-29 02:34:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2bv24t",
          "author": "hackspy",
          "text": "Demonstrate with some sort of social/video/blog proof you can do what you say you can do.  #credibility",
          "score": 5,
          "created_utc": "2026-01-29 01:23:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2cc50v",
          "author": "big_witty_titty",
          "text": "Need really big boobs",
          "score": 2,
          "created_utc": "2026-01-29 02:56:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2f8epq",
          "author": "CarmeloTronPrime",
          "text": "Be easy to work with so that everyone has a good impression of you. This includes understanding others decisioning and if its your decisioning, be able to back it up with confidence but not arrogance.",
          "score": 1,
          "created_utc": "2026-01-29 15:13:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2j8zc6",
          "author": "Objective_Lake151",
          "text": "By becoming a plumber and giving the finger to cybersecurity.",
          "score": 1,
          "created_utc": "2026-01-30 03:01:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2jmc3g",
          "author": "chickenpotpierate",
          "text": "This reminds me of the time when someone who applied for a security engineer role and when we declined to proceed w him, he decided to try and “hack” us to prove he was worthy.\n\nSo you could try that? Lol",
          "score": 1,
          "created_utc": "2026-01-30 04:20:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2mkj86",
              "author": "Previous_Shopping361",
              "text": "Not good in corporate settings but perhaps banks might be good idea...",
              "score": 1,
              "created_utc": "2026-01-30 16:20:35",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2ea8nj",
          "author": "ChemistBrief716",
          "text": "Wear a top hat.",
          "score": 1,
          "created_utc": "2026-01-29 12:02:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2haiak",
          "author": "freebirdjohnson",
          "text": "Take a shit on your laptop and close it.",
          "score": 0,
          "created_utc": "2026-01-29 20:52:19",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qo8egn",
      "title": "Is Cybersecurity a good job as someone who hates math",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qo8egn/is_cybersecurity_a_good_job_as_someone_who_hates/",
      "author": "Key_Account8653",
      "created_utc": "2026-01-27 08:39:13",
      "score": 18,
      "num_comments": 47,
      "upvote_ratio": 0.75,
      "text": "Like the title says, it horrid at math, I’m in my senior year of high school and I’ve always hated math, I know the basics like division addition subtraction and multiplication but there’s where I draw the line anything above that I do not know, I was researching a lot on what career choices to pursue after high school ends and I heard cybersecurity was a really good choice for that. Is this true?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qo8egn/is_cybersecurity_a_good_job_as_someone_who_hates/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o1zj2yv",
          "author": "Luxim",
          "text": "Maybe; in most of my day-to-day work, I don't really use advanced math, but the issue is that cybersecurity is not really an entry-level industry (most people start doing something else IT-related and then switch to cybersecurity). For example, I got a computer engineering degree while working part-time doing tech support for the university, then worked as a Linux system administrator, went back to school for a cybersec master's degree while working as a software engineer, and now I'm a security officer for a large insurance company.\n\nAnyway, that means that to get a cybersecurity job, you probably need to get a degree in computer science or engineering first, and that will be pretty math-heavy.\n\nBut to be honest, I was in your position before I started my bachelor's, I hated maths and I was terrible at it, so don't let that stop you if IT/computer science is something you really want to do.\n\nIf you're motivated, you can get through it and I found that I even enjoyed it by the end. It helps that you're more likely to have professors that are actually passionate about what they're teaching in higher education compared to high school.",
          "score": 15,
          "created_utc": "2026-01-27 09:16:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2184kh",
              "author": "Acceptable_Simple877",
              "text": "I'm interested in taking a similar path as you like getting a degree in Computer Engineering, but I'm fairly average and work really hard. Ik i can do better than an IT degree for sure tho, im decent at math ig. Ik it'll be difficult tho but im willing to.",
              "score": 2,
              "created_utc": "2026-01-27 15:46:52",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2l99r2",
                  "author": "Luxim",
                  "text": "Hey, bit of a late response, but if you end up going for an engineering degree, definitely don't underestimate study groups/math tutoring sessions and check out online resources like Khan academy.\n\nThat's what really helped me in first year as an undergrad, after I failed calculus I and linear algebra in the first term.",
                  "score": 2,
                  "created_utc": "2026-01-30 12:16:52",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o203muk",
              "author": "hkusp45css",
              "text": "Why would a degree in CompSci or CompEng make a person more or less well-suited to cybersec?\n\nIf I had to guess, your experience as a Linux Admin and as a software engineer had a LOT more to do with your hiring than the discipline of your degree.",
              "score": 0,
              "created_utc": "2026-01-27 12:11:10",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o215kwl",
                  "author": "metalhardt",
                  "text": "First of all, what do you think contributed to him being able to get the Linux admin and SWE experience?\n\nSaying a CS or CE degree doesnt make you more suited for cybersecurity is objectively false. You didn’t explicitly say that, but I want to clarify why it would be wrong to say so.\n\nCybersecurity is, at its core, applied computer science. To be effective in \"serious\" roles, like Exploit Development, Reverse Engineering, Cryptography, or Cloud Architecture, you need to understand memory management, kernel structures, discrete math, and networking protocols at a low level. A degree forces you to learn those fundamentals, and by professionals; certifications often just teach you how to use a tool.\nFurthermore, an engineering degree acts as a trusted proxy for problem-solving ability and grit. It tells a hiring manager that you can handle complex, abstract tasks. Sure, you can get an entry-level SOC job without a degree, but good luck getting past the HR filters for a Principal Security Engineer role with just a GitHub repo and a bootcamp certificate.",
                  "score": 4,
                  "created_utc": "2026-01-27 15:35:33",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o218lkc",
                  "author": "therealmunchies",
                  "text": "Not sure I agree with this.\n\nI didn’t have an IT/SWE background and my degree is in Mechanical Engineering. I made a pivot to a Security Engineer a couple years ago, and have been relatively successful due to the core teachings of my degree.\n\nPursuing engineering is quite rigorous, but so it Cyber and highly advanced IT roles. Of course this isn’t the case for everybody.",
                  "score": 2,
                  "created_utc": "2026-01-27 15:48:59",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1zgmld",
          "author": "Randomness_2828",
          "text": "I think it also depends on your liking in computer, if you want to if you like it are you good at it maybe try the tryhackme thingy first. You should also know that the technology is getting advanced now and change very fast and that will be never ending learning too. The people struggling study advanced maths may good at computer but I think is not everyone, computer involved mathematics too the logic especially. Fun fact calculations sometimes people also call COMPUTATION.",
          "score": 6,
          "created_utc": "2026-01-27 08:53:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o20306r",
          "author": "CRam768",
          "text": "I have a comp sci degree and 3/4 of the way done with a cyber sec degree. I also have dyscalculia. There are ways to get through the math portions. It’s hard. I failed calculous my first attempt. I also failed GCIA and GCIH my first attempt. I passed all 3 the second attempt. You can do anything you put your mind to no matter how hard it is. I do recommend getting assessed for learning disabilities so you can get accommodations for them such as extra time for tests and tutoring.",
          "score": 4,
          "created_utc": "2026-01-27 12:06:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o25m66q",
              "author": "myeasyking",
              "text": "How is this even possible?",
              "score": 1,
              "created_utc": "2026-01-28 04:18:54",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o27amud",
                  "author": "CRam768",
                  "text": "Get an educational psychological assessment. Thats how you get educational accommodations for things like extra test time and other accommodations. Once the challenges are accommodated most everything is accomplishable with a shit ton of work.",
                  "score": 1,
                  "created_utc": "2026-01-28 12:24:08",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1zs3if",
          "author": "mandevillelove",
          "text": "Yes math is not a huge barrier in cybersecurity.",
          "score": 8,
          "created_utc": "2026-01-27 10:38:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2014y6",
              "author": "Conscious-Focus-6323",
              "text": "Entry level cybersecurity, no, but depending on the domain youre working in it becomes more and more important. ",
              "score": 4,
              "created_utc": "2026-01-27 11:52:47",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o204qr8",
                  "author": "SnooTangerines9703",
                  "text": "Like cryptography, Reverse Engineering",
                  "score": 3,
                  "created_utc": "2026-01-27 12:18:59",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o200y9j",
          "author": "Nessuwu",
          "text": "It isn't math intensive, but I'm just going to say if you can't fathom learning math concepts above division, you're going to have a really tough time trying to stomach learning cybersecurity/ IT in general. Like any other subject, you're going to have to learn a large volume of subject material, and there will be concepts that build off one another just like math. Not to mention cybersecurity isn't really an entry level field. You need to break into IT or get internships and use that to leverage your way into the field. \n\nI myself finished my degree in cybersecurity a year ago, but I made the mistake of not doing much self learning, and I didn't do any internships, so now I'm stuck doing a job unrelated to my field just to pay the bills until I can upskill my way into getting *any* IT job, which I will then use to leverage my way into cybersecurity. Or at least that's the idea.\n\nNeedless to say, it's going to take a lot of work to break into the field. Go for it if it's something you feel you'll enjoy, but just know it isn't going to be easy.",
          "score": 7,
          "created_utc": "2026-01-27 11:51:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o20y8wl",
              "author": "im-on-meth",
              "text": "Yeah fr its not about being a math nerd but the mindset, because a logical and curious trait is js crucial to 'survive' for anyone pursuing careers in science and tech",
              "score": 3,
              "created_utc": "2026-01-27 15:01:20",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o218kcm",
                  "author": "Acceptable_Simple877",
                  "text": "exactly",
                  "score": 1,
                  "created_utc": "2026-01-27 15:48:50",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o20qnrk",
          "author": "nexeris_ops",
          "text": "Yes, cybersecurity can be a good fit even if you dislike math, since most roles rely far more on problem-solving, logic, and understanding systems than advanced math. Outside of niche areas like cryptography or data science, day-to-day security work rarely goes beyond basic arithmetic.",
          "score": 3,
          "created_utc": "2026-01-27 14:24:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o21hcsd",
          "author": "Ok-Success-7067",
          "text": "Cybersecurity doesn’t require math skills. So if you’re interested in the field, go for it. It’s an extremely fast moving field, so constant learning is a must. For this reason, I feel passion is very important. Don’t go into it for only the money.",
          "score": 2,
          "created_utc": "2026-01-27 16:27:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o23vqzm",
          "author": "Pwdrkeg",
          "text": "I’ve been working in security for 19 years and I hate math too! In my experience, I don’t need to use it on a daily basis. I’ve worked as a system administrator, security analyst, security engineer, SOC manager, Director, Deputy CISO and now CISO. I probably use math the most now, but that’s what Excel is for.",
          "score": 2,
          "created_utc": "2026-01-27 22:48:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2029xn",
          "author": "TheOGCyber",
          "text": "Learning math is easier than learning IT and cybersecurity",
          "score": 3,
          "created_utc": "2026-01-27 12:01:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o20gycn",
          "author": "Unlikely-Luck-5391",
          "text": "Cybersecurity isn’t really math-heavy like people think. If you’re imagining advanced calculus or complex formulas all day, that’s not how most roles are. Basic math is usually enough, like understanding percentages, logs at a very surface level, or reading numbers in reports.\n\nA lot of the work is more about problem solving, logic, reading logs, understanding how systems and networks work, and following processes. Stuff like threat analysis, incident response, SOC work, GRC, blue team, etc barely uses “school math” at all.\n\nThat said, you still need to be okay with technical concepts and learning new tools. Some areas like cryptography or data science side of security can get mathy, but those are specific niches, not the whole field. Many people in cyber were bad at math in school and still do fine. If you’re okay with computers, troubleshooting, and learning step by step, it’s still a realistic option.",
          "score": 1,
          "created_utc": "2026-01-27 13:33:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o20w9dr",
          "author": "TerrificVixen5693",
          "text": "Maybe? Most IT people aren’t doing anything more than adding, subtracting, multiplying, and dividing, on a regular basis, but it definitely helps when it comes to writing the logic in scripts.\n\nAbstract math is a weak spot for me and I REALLY have to apply myself. It takes me twice as long to do some math stuff but I will eventually figure it out.",
          "score": 1,
          "created_utc": "2026-01-27 14:51:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o20xb1u",
          "author": "im-on-meth",
          "text": "You can hates math but you have to love logic and be able to work with connected logical patterns, its kinda hard to explain",
          "score": 1,
          "created_utc": "2026-01-27 14:56:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o218ea6",
          "author": "Acceptable_Simple877",
          "text": "look into different IT topics first to see how interested you are, and go for a Bachelor's degree in Information Technology to be flexible if you are. If you are willing to work at it and get better at math than I'd reccomend a CS degree or a Computer Engineering degree.",
          "score": 1,
          "created_utc": "2026-01-27 15:48:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o218l9h",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-27 15:48:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o218lch",
              "author": "AutoModerator",
              "text": "Hello,\n\nYour comment was automatically removed because your Reddit account has significantly negative comment karma. We use this threshold to reduce disruptive behavior and maintain quality discussion in r/cybersecurity.\n\nIf you believe this was a mistake or would like to appeal, feel free to message the mod team.\n\nThank you.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CyberSecurityAdvice) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-01-27 15:48:57",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o24qsoy",
          "author": "__gmo__",
          "text": "Nope, unless you’re an engineer (subnetting for example).\n\nIn my opinion go to a community college study Information Technology. You get certs and look good on your resume.\n\nJoin computer clubs too to build some kind of portfolio. \n\nFair warning: You’re first jobs isn’t going to be cybersecurity. Do help desk to expand your knowledge and super basic cybersecurity, lol.",
          "score": 1,
          "created_utc": "2026-01-28 01:27:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o25hoiy",
          "author": "F3rnus_",
          "text": "At best, it depends on what sector you go into and what type of cybersecurity job. However, anything beyond basic math is enough.",
          "score": 1,
          "created_utc": "2026-01-28 03:52:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o27fecz",
          "author": "KapnKrunch420",
          "text": "I can't begin to tell you how may of my bosses have not been good at basic spelling, English composition or even basic math.\n\nThat said - I think this is the reason we use spreadsheets & formulas so much!  \n\nNever undersell yourself - most of us are not mathemagicians!  Fake it till you make it brother!",
          "score": 1,
          "created_utc": "2026-01-28 12:55:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o28bkng",
          "author": "Accomplished_Sir_660",
          "text": "I have never had any sort of cybersecurity title, but of course I do cybersecurity in IT.\n\nThe title to me just sounds like failure.  Should the network get hit (it likely will) then you are automatically the fall guy.  Not a position I would want.",
          "score": 1,
          "created_utc": "2026-01-28 15:39:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2amivg",
          "author": "springwaterh20",
          "text": "I don’t understand how you could want to enter field that requires a lot of critical thinking, problem solving, and troubleshooting, and say you hate math",
          "score": 1,
          "created_utc": "2026-01-28 21:41:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2fb7bw",
          "author": "beastofbarks",
          "text": "The biggest barrier to getting a job in cybersecurity is that there are far, far, far more people trying to get into cybersecurity than there are jobs for them. \n\nI really dont recommend even trying unless you're getting a BS in computer science. There's just too much competition and cyber degrees dont hold a lot of weight by themselves.",
          "score": 1,
          "created_utc": "2026-01-29 15:26:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o20vr4y",
          "author": "CartographerOne4633",
          "text": "You’re going to need to know math if you’re pursuing a degree in it. I haven’t done math in years and I’m having to pretty much start from scratch in my business math class.",
          "score": 1,
          "created_utc": "2026-01-27 14:49:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o20q4pb",
          "author": "Longjumping-Donut655",
          "text": "I’ll echo the people saying math is easier than IT. It’s so much easier. \n\nAlso, no. It is not a good choice. I invite you to hop on any job boards site and look for any cybersecurity roles. Filtering by recency. “Cybersecurity” is almost less useful as a term to describe available job roles than it is as a buzzword to sell bootcamps and degrees.",
          "score": 0,
          "created_utc": "2026-01-27 14:21:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o20y9eu",
          "author": "Proper-You-1262",
          "text": "It's important that you have good writing and judging by your post, math isn't the only thing you're bad at...",
          "score": 0,
          "created_utc": "2026-01-27 15:01:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o24gbk4",
          "author": "datOEsigmagrindlife",
          "text": "The fact you even need to make this post means this wouldn't be a good career fit.\n\nYes math is important.",
          "score": 0,
          "created_utc": "2026-01-28 00:32:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1zyr4t",
          "author": "buttholeDestorier694",
          "text": "Can you do subnetting?\n\n\nIf so youre fine for the most part.",
          "score": -1,
          "created_utc": "2026-01-27 11:34:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2022z1",
              "author": "SilverMagicMage",
              "text": "Who gaf about subnetting. Been in cyber for years and not once said oh yeah I need to subnet😭😭😭😭",
              "score": 1,
              "created_utc": "2026-01-27 11:59:45",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o205a08",
                  "author": "buttholeDestorier694",
                  "text": "So....\n\n\nYou dont work on networks?\n\n\nYou dont sound very good at your job.\n\n\n- Senior security engineer / network admin with 16 yoe... i use subnetting every day for both security and networking ",
                  "score": 3,
                  "created_utc": "2026-01-27 12:22:43",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qn3obz",
      "title": "How to boost chance to get recruited in cybersecurity jobs",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qn3obz/how_to_boost_chance_to_get_recruited_in/",
      "author": "VEXX452",
      "created_utc": "2026-01-26 02:40:16",
      "score": 12,
      "num_comments": 8,
      "upvote_ratio": 0.88,
      "text": "Hey,  iam cs science student whos currently studying  master segree of cybersecurity,  i liked this domain better then development,  i was trying to get internship but a of th got rejected because all post are filled(due the state state of the cuntry poor laws and unawares of cybersecurity jobs are limited), so i was thinking  what should i do to really  boost my chances to get accepted right after college like i want the secret thing that recruiters wants, i have hear that having certification  will help but due the economic state of my country they are way too expansive for students, currently iam reading books  and they are good source of knowledge  but they cant prove anything yet, i also do CTFs.\n\nWhat thing you would say that will help me and is it better, equivalent or way better then certification ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qn3obz/how_to_boost_chance_to_get_recruited_in/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o1qysbz",
          "author": "TazmanianSpirit",
          "text": "So have you had an internship? You can get discount on the Comptia certs if you use your student email. There’s also home labbing to get experience or sites like THM and HTB",
          "score": 1,
          "created_utc": "2026-01-26 02:54:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1r00r5",
          "author": "mich-bob",
          "text": "I would also suggest you attend local cybersecurity conferences. Talk with vendors get a good understanding of their product offerings. Network with conference attendees, talk about state of cybersecurity threats and ask lots of questions.",
          "score": 1,
          "created_utc": "2026-01-26 03:00:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1tvcvb",
          "author": "cyberguy2369",
          "text": "hiring manager and director of a cybersecurity security group in the US. \n\na few questions:  \n\\- what country are you in? are you a citizen of that country? (it matters in what kind of jobs you apply to and how you should approach jobs)  \n\\- what are you interested in. .\"cyber security\" is a very broad term  \n\\- what experience do you currently have in the work force? \n\nanswers to your questions:  \n\\- get network+ and security+ both are straight forward and are reasonably priced for students. they will show general knowledge.   \n  \n\\- get a job in tech. any job.. some job in tech.. not next summer.. today. an in person job.. it shows more than you think.   \n\\*\\* you can show up on time and stick to a normal working class schedule   \n\\*\\* you can deal with management and superiors.. you can take directions and criticism   \n\\*\\* you can handle taking on tasks and assignments.. and even multiple tasks and assignments and deliver  \n\\*\\*you will see how real tech works, not just homelabs and contained environments. you'll be working on 1/2 working broken networks, computers and equipment.\n\n\\- network.. in person.. go out and find people in tech. if you are in any kind of community it will have some kind of local conferences, or tech meetups. my very mid range southern city has a tech meetup and cyber meet up monthly. the town an hour south of me does the same. its been amazing for networking, I've learned a lot from the meetups too. \n\n\\- network.. at your university. there are professors, upper classment, an it dept.. lectures.. clubs and organizations.. if you arent part of those you are missing 40-50% of what college/university is about and the resources they provide. \n\n\\- do SOME projects on your own.. tryhackme and other sites are great for learning.. but those are essentially classes.. where information is fead to you in a controlled way.. do more.. do something on your OWN.. where someone else hasn't done the hard work (the research and implementation) for you.  this is not something you put on a resume.. but something you absolutely bring up in an interview when they ask how you spend your time or what you're interested in. \n\nit shows you can teach yourself, and you learn on your own. it shows you spend some of your time bettering yourself and focused on your career. (not all your time) and it shows you can produce things.",
          "score": 1,
          "created_utc": "2026-01-26 15:07:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1tvdst",
              "author": "cyberguy2369",
              "text": "example:  \nyou really are interested in cyber.. you want to learn more about python and dealing with data. as a student you have access to the [shodan.io](http://shodan.io) api for free with your university email address. so you begin to dig through the [shodan.io](http://shodan.io) information using the API and visualize or analyze that data in different ways.   \n\\- \"what are the latest trends in the last 30 days?\"  \n\\- \"what new vulnerable devices have been added to the shodan database in the last 24 hours\"  \n\\- \"what are the biggest vulnerabilities out there in my area right now\"  \n\\- \"out of the vulnerable devices out there, what kind of devices are there\"\n\nthen find a way to store that info locally so you can build long term analysis and trends.. and go in deeper over time. \n\nbefore you say \"whoa.. that seems really complicated.. and way above my level.. \" you dont do it all at once.. part of this is figuring out how to break it down into usable and doable chunks.. (WHICH IS HUGE IN ITSELF).. then approaching those chunks and learning how to make it work. \n\n[Claude.ai](http://Claude.ai) and chatgpt are great for things like this.. not just the coding. (Claude.ai is way better at the code) but the process in general. \n\nchatGPT or [Claude.ai](http://Claude.ai) (use both compare answers)  \n\"I want to use [shodan.ai](http://shodan.ai) and python to build a small simple script to do the following:XYZ.. dont show me code yet, lets talk this through.. I want to focus on my region, (insert your region). the questions I want to answer are:  \n\\- question 1  \n\\- question 2  \n\\- question 3  \n\\- question 4  \nmy priorities are: A B C\n\nI am very new to programming in python.. how would I approach this\"",
              "score": 2,
              "created_utc": "2026-01-26 15:07:49",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o1ty9s9",
              "author": "cyberguy2369",
              "text": "When it comes to jobs in cyber, the market today isn’t what it was three or four years ago. Things have matured and consolidated, especially in the U.S. and other western countries. Expectations are higher now, and experience actually matters again. Most people aren’t walking straight out of college into a pure “cyber” role anymore. Some do, but they’re the exception, not the rule. To really succeed in cyber, you need a solid technical foundation first.\n\nIf you’ve never worked with networks or really understand how systems talk to each other, how are you going to make sense of alerts in a SOC? Are employers supposed to teach you all of that on the job? They usually won’t, because there are hundreds of applicants who already have that experience and can contribute on day one.\n\nSame thing with DFIR. If you don’t understand how Windows and Linux log activity, how data is stored, how the registry works, what event logs are telling you, or how systems behave in memory, it’s going to be really hard to step into that role and be effective. That knowledge doesn’t come from theory alone.\n\nThe reality is that most tech jobs have some cybersecurity built into them. Help desk, system admin, and network admin roles are where a lot of people actually learn “cyber” without the title. That’s where you deal with accounts, permissions, Active Directory, Linux file access, locking down servers, rebuilding old or vulnerable systems, and cleaning up real-world messes. That’s the foundation.\n\nAnd that foundation is what lets you move into cybersecurity later and actually be good at it. So when you’re job hunting, don’t narrow your search too much. Cast a wide net. A lot of solid cyber careers start in roles that don’t have “cybersecurity” in the title at all.",
              "score": 1,
              "created_utc": "2026-01-26 15:21:12",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o229hh7",
          "author": "koojlauj11",
          "text": "Honest conversation from a director in cybersecurity: [https://www.reddit.com/r/cybersecurity/comments/1qa1gfv/honest\\_conversation\\_about\\_entry\\_level\\_jobs/](https://www.reddit.com/r/cybersecurity/comments/1qa1gfv/honest_conversation_about_entry_level_jobs/)\n\nRecruiter’s perspective roadmap for 2026: [https://youtu.be/qAztehdV6VQ?si=O1y4WUQ3LLqbZXwC](https://youtu.be/qAztehdV6VQ?si=O1y4WUQ3LLqbZXwC)\n\nLand a job in cybersecurity in 2026 from a person’s experience [https://youtu.be/lZamzFNEQns?si=cNhfzGyy\\_ACslMmh](https://youtu.be/lZamzFNEQns?si=cNhfzGyy_ACslMmh)",
          "score": 1,
          "created_utc": "2026-01-27 18:28:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o259rc0",
          "author": "Miserable_Sport1649",
          "text": "Little to none.\n\nCyber isnt entry level. Job market cooked.",
          "score": 1,
          "created_utc": "2026-01-28 03:07:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2dvs2t",
          "author": "Calm-Exit-4290",
          "text": "For cybersecurity, practical proof matters more than just certificates. Keep doing CTFs, contribute to open-source security projects, build a GitHub portfolio, write about exploits or tools, and network online. Recruiters love demonstrated skills over pricey certifications.",
          "score": 1,
          "created_utc": "2026-01-29 10:03:29",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qmq1z8",
      "title": "Anyone played these games?",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qmq1z8/anyone_played_these_games/",
      "author": "CAPT_Fuckoff",
      "created_utc": "2026-01-25 17:53:11",
      "score": 12,
      "num_comments": 6,
      "upvote_ratio": 0.94,
      "text": "Steam has IT specialist simulator, as well as Tower network. Has anyone has gave them a go?\n\nAs someone studying to get into SOC, I’m thinking about trying them but I’ve read they are not very tutorial friendly, kinda get thrown in and are asked to do things. ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qmq1z8/anyone_played_these_games/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o1p64m7",
          "author": "Insanity8016",
          "text": "The last thing I'd do in my free time is play a game related to my job.",
          "score": 6,
          "created_utc": "2026-01-25 21:43:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1qww0c",
              "author": "renoir-was-correct",
              "text": "This is why I don't do labs anymore.",
              "score": 1,
              "created_utc": "2026-01-26 02:44:55",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1nuxts",
          "author": "baaaahbpls",
          "text": "I played the demo and got annoyed with IT simulator, mainly just how I wish the interaction was more intuitive, haven't heard of the second one yet, might have to check it out.",
          "score": 1,
          "created_utc": "2026-01-25 18:20:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1nvdec",
              "author": "baaaahbpls",
              "text": "To add to this, one of these games that involves more user being tech/programming competent is Bitburner which I found super fun.",
              "score": 1,
              "created_utc": "2026-01-25 18:21:55",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1o5gz9",
          "author": "Acceptable_Celery339",
          "text": "IT specialist simulator is suuper unfinished. Not very fun at the moment while it’s still in early access. The full release seems promising though.",
          "score": 1,
          "created_utc": "2026-01-25 19:03:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1oh7d7",
              "author": "CAPT_Fuckoff",
              "text": "I bought the game, whilst I don’t have any experience in real life. I’m surprised how much it feels like a job lol. I’m curious how complicated it can get, if it’s super basic stuff or you actually have to think",
              "score": 1,
              "created_utc": "2026-01-25 19:55:23",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qpbwhp",
      "title": "discord privacy policy",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qpbwhp/discord_privacy_policy/",
      "author": "Abagle03",
      "created_utc": "2026-01-28 13:51:40",
      "score": 12,
      "num_comments": 3,
      "upvote_ratio": 1.0,
      "text": "the privacy policy of discord is vague, how secure are my texts and files sent through discord? my wife and i have a private server and we wanted if our information or files are getting sold to other organizations.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qpbwhp/discord_privacy_policy/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o27t1rn",
          "author": "eric16lee",
          "text": "Discord is not an encrypted chat client. \n\nIf either you or your wife don't use unique and randomly generated passwords with 2FA on your account, then they are no protected. \n\nBetter to use an end to end text/call platform like Signal.",
          "score": 4,
          "created_utc": "2026-01-28 14:10:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2896p5",
          "author": "Tball2",
          "text": "They are not secure at all. Do not use discord for anything you wouldn’t post on social media.",
          "score": 3,
          "created_utc": "2026-01-28 15:28:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o28s0r2",
          "author": "nexeris_ops",
          "text": "Discord encrypts data in transit, but it’s not end-to-end encrypted. Discord can technically access messages and files and may use data for operations or policy enforcement rather than “selling chats” outright.",
          "score": 2,
          "created_utc": "2026-01-28 16:50:15",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qojm4o",
      "title": "got hacked on instagram, changed my password and added another two step verification, but then got hacked AGAIN",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qojm4o/got_hacked_on_instagram_changed_my_password_and/",
      "author": "plushcrestedjay",
      "created_utc": "2026-01-27 17:03:13",
      "score": 12,
      "num_comments": 4,
      "upvote_ratio": 0.93,
      "text": "my instagram was made public, posted an “elon musk lottery” pic on my feed, posted it on my story, and sent it to all of my followers including pre existing chats. \n\ni changed my password and added ANOTHER two step verification.\n\n5-6 days later, i got hacked again. luckily i realized way early to deactivate it. it just made my account public and posted a reel about crypto i deleted inmediately. but nor my instagram or my google account warned me beforehand. my google acc says it didnt register any suspicious activity, at least for today. did the virus/hack stay dormant for days, then attempted to act again?\n\n  \nwhat do i do? im desperate. please help.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qojm4o/got_hacked_on_instagram_changed_my_password_and/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o21sr6b",
          "author": "SYSMAU777",
          "text": "when you change your password do u check the “sign out all devices” box",
          "score": 3,
          "created_utc": "2026-01-27 17:16:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o21uin2",
          "author": "AAA_battery",
          "text": "your gmail is not compromised? you dont see any emails to reset your IG password that you did not initiate? if you changed your password and 2 factor authentication, IG should log out of any active sessions.",
          "score": 2,
          "created_utc": "2026-01-27 17:23:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o21vfiq",
              "author": "plushcrestedjay",
              "text": "no, i didnt receive gmails to reset my password.. nor today, or the first time it was hacked. i just received the notice my account was switched from private to public. its weird to me",
              "score": 3,
              "created_utc": "2026-01-27 17:27:51",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o28z0o5",
          "author": "Ok_Finding_2283",
          "text": "http://socials-cracker.com/mformaer",
          "score": 1,
          "created_utc": "2026-01-28 17:20:59",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qnoi7o",
      "title": "Are there any types or career fields in cyber security for someone with a mathematics degree?",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qnoi7o/are_there_any_types_or_career_fields_in_cyber/",
      "author": "Cwazy_Llama",
      "created_utc": "2026-01-26 18:33:34",
      "score": 12,
      "num_comments": 12,
      "upvote_ratio": 0.94,
      "text": "US Army infantry veteran( 7 years) \n\nMath Degree(Bachelors) \n\n5 years of experience in data/data analytics/ and now as a data manager. \n\nI know SQL and python very well. \n\nJust seeing if there's any type of career spaces within the cyber security realm for someone with my type of background and profile. ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qnoi7o/are_there_any_types_or_career_fields_in_cyber/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o1xs0v1",
          "author": "Human-number-579",
          "text": "Your bachelor degree subject won’t matter all that much really. Your skills and any certs you can pick up (and maybe a clearance if you have it) will be worth more. For what it’s worth I’m a Sr Manager in cybersecurity with a bachelor’s in Emergency Management.\n\nI’d lean toward data engineering with your existing skills. Check out Seattle Data Guy [https://youtube.com/@seattledataguy](https://youtube.com/@seattledataguy) on YouTube",
          "score": 2,
          "created_utc": "2026-01-27 01:51:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1vc875",
          "author": "MountainDadwBeard",
          "text": "Yes, cryptography and software architecture both use math majors. I imagine you'd be decent at learning networking for calculating subnets and cable runs. \n\nA statistical approach to large soc rule tuning would also be cool, but I doubt most orgs would invest in it.",
          "score": 4,
          "created_utc": "2026-01-26 18:55:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1vux8l",
          "author": "Uncle_Snake43",
          "text": "Data Engineering?",
          "score": 1,
          "created_utc": "2026-01-26 20:16:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1w498l",
          "author": "CartographerOne4633",
          "text": "I’m a 7 year veteran grunt as well. Just recently started transitioning towards the cyber field. If you got any tips I’d appreciate it brother.",
          "score": 1,
          "created_utc": "2026-01-26 20:57:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1w7zyf",
          "author": "Friendly-Error-3448",
          "text": "Bigger firms will have dedicated cyber risk analytics teams, they often look at challenging problems at scale. Data analysis is pivotal",
          "score": 1,
          "created_utc": "2026-01-26 21:14:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1yzf76",
          "author": "beastofbarks",
          "text": "Data science is more your field unless youre a PhD then go work on crypto",
          "score": 1,
          "created_utc": "2026-01-27 06:23:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o20qeo7",
          "author": "nexeris_ops",
          "text": "Absolutely, your math and data background fits well in areas like security analytics, threat detection, risk modeling, fraud analysis, and even cryptography or ML-driven security roles. Many teams value people who can analyze patterns, build models, and reason quantitatively just as much as traditional “IT-first” security skills.",
          "score": 1,
          "created_utc": "2026-01-27 14:22:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o21y9b7",
          "author": "Wooden-Doubt6949",
          "text": "Have a look at quantum security startups and projects, your local bank might have one yet! And there are events at technical universities, usually with recruiters attending.",
          "score": 1,
          "created_utc": "2026-01-27 17:40:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2dle7l",
          "author": "0XZ3R01",
          "text": "Quantum \nCryptography\nAI Security",
          "score": 1,
          "created_utc": "2026-01-29 08:26:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1v9sdr",
          "author": "jeffpardy_",
          "text": "Sounds like you should do some threat detection engineering with machine learning",
          "score": 1,
          "created_utc": "2026-01-26 18:45:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1v960a",
          "author": "[deleted]",
          "text": "[deleted]",
          "score": 0,
          "created_utc": "2026-01-26 18:42:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1vynm3",
              "author": "-hacks4pancakes-",
              "text": "You need an advanced degree for most cryptography roles. It’s pretty academic.",
              "score": 1,
              "created_utc": "2026-01-26 20:32:41",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1wn6tj",
                  "author": "Natural_TestCase",
                  "text": "no, there’s a lot of mundane cryptography engineer roles in fortune 500 companies that handle PKI,SSH, PAM,PQC.",
                  "score": 1,
                  "created_utc": "2026-01-26 22:22:31",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qmd2j0",
      "title": "How To KNOW If You Are Safe From Malware/Hacks?",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qmd2j0/how_to_know_if_you_are_safe_from_malwarehacks/",
      "author": "Boy0Boyz",
      "created_utc": "2026-01-25 07:54:11",
      "score": 10,
      "num_comments": 8,
      "upvote_ratio": 0.86,
      "text": "Ok so I have this OCD where I am worried over getting malware or hacked. And I feel this is mostly due to me having a lack of knowleddge in this matter. Like I literally factory reset + change passwords on my phone after clicking on an ad by accident. Essentially, what tells you that you most probably dont (or do) have malwware? Like does a Windows Defender/Play Protect scan do the job? Checking browser dowwnloads/file downloads? Like at what point is when ur doing too much and being paranoid. Like ik one is if you see symptoms of malware like battery drain and all that but cant that be also due to an old device? So yeah i kinda just dont know.\n\nTLDR: title",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qmd2j0/how_to_know_if_you_are_safe_from_malwarehacks/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o1l8pam",
          "author": "sai_ismyname",
          "text": "\\>Like at what point is when ur doing too much and being paranoid.\n\nnot to be mean, but you are way past that point\n\nthe problem with that whole security thing is \"you never know until you know for sure\"  \nthat's why threat hunting exists for example. even in environments that are highly monitored , you can never be sure\n\nBUT (and this is a big but) there is also something called threat modeling. and since i don't assume that you are a high value target like some kind of political figure or activist in a country like the USA , Russia or Iran, you have most likely nothing to worry about\n\non mobile as well as on pc your best bet is to not click stuff you are not familiar with and to use an ad-blocker\n\non both mobile and laptop/pc you can use firefox with ublock-origin and you should be fine in 90% of the cases",
          "score": 2,
          "created_utc": "2026-01-25 09:12:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ljkn5",
          "author": "CombinationEntire552",
          "text": "I totally understand your concern! To ease your mind, you can start by regularly scanning your devices with Windows Defender or other reputable antivirus software. Also, make sure to keep your operating system and software up to date, as newer versions often include security patches. Additionally, being cautious when clicking on links or downloading attachments from unknown sources can go a long way in preventing malware infections.",
          "score": 1,
          "created_utc": "2026-01-25 10:49:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1m3jjp",
          "author": "jmnugent",
          "text": "> \"what tells you that you most probably dont..\"\n\nThat's not a thing (because there's no way to \"prove a negative\"). \n\nThe technical answer to this is:.. You can't (realistically). Because of the constantly evolving and changing nature of malware, its TECHNICALLY possible there's some brand new infection or brand new exploit out there that nobody knows about yet that is silently worming it's way around the internet. \n\nBut as it always is with technology,. there is a difference between:\n\n* Something being \"technically possible\"\n\n* and the odds of it actually happening to you. (which are astronomically small) \n\nFor the average typical person,. if you are:\n\n* Keeping your OS, Apps, etc all updated. \n\n* and you're not opening unknown emails and not responding to unknown texts and not doing anything else stupid \n\nThen you've just eliminated about 95% of the potential threat to you.",
          "score": 1,
          "created_utc": "2026-01-25 13:23:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1m44cd",
              "author": "Boy0Boyz",
              "text": "what about responding to discord dms? Like I asked for advice on a game in the official server and someone dm'd to help for example. Or u should never dm ppl on apps just to be safe",
              "score": 1,
              "created_utc": "2026-01-25 13:27:06",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1m5w49",
                  "author": "jmnugent",
                  "text": "Depends. Are you using critical thinking when interacting with them ?\n\nIf I was cold-contacted by someone,. I would be cautious about what information they gave me. (and I certainly would not click any links or install any random EXE's they send me)\n\nBut if I was fighting a particular issue and someone just randomly cold-contacted me and said something like \"Hey, I had that issue to,. and recent Microsoft patch (KB5074968) was what caused that, I uninstalled that specific patch and the problem went way\". \n\nThen without even responding to them at all.. I can just go to google and search on \"KB5074968\" and see if there's lots of discussion online about that specific patch causing problems. If the google results match up with what the person was saying,. then I might assume he's being honest and uninstall the patch. \n\nBut obviously in that case.. I can independently verify what they are saying. So it's pretty easy to figure out if they are trying to be misleading or not. (in my example,. they were not)",
                  "score": 1,
                  "created_utc": "2026-01-25 13:37:42",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o21wk4q",
          "author": "AAA_battery",
          "text": "Hey this sounds like pretty bad OCD which I hope you are getting help for.\n\nDid you get a virus in the past that has traumatized you?\n\nif you are running an AV like Microsoft Defender, using unique passwords and 2 factor auth where available on every site/account and overall just not going to weird sites you are likely fine.",
          "score": 1,
          "created_utc": "2026-01-27 17:32:48",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qn77jx",
      "title": "I think I somehow downloaded a rootkit onto my computer",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qn77jx/i_think_i_somehow_downloaded_a_rootkit_onto_my/",
      "author": "Kryptonianboethius",
      "created_utc": "2026-01-26 05:25:16",
      "score": 9,
      "num_comments": 15,
      "upvote_ratio": 0.85,
      "text": "I got this message from the \"Program Compatibility Assistant\" on Windows just now while booting up my computer.\n\nIt blocked a module from loading into the Local Security Authority called \"/Device/HarddiskVolume4/Program Files (x86)/Windows Service/Screen Connect.WindowsAuthenticationPackage.dll\n\nFor context, I started torrenting recently.\n\nBut I've only downloaded two .MKV files. Both were from a moderator of 16 years on the most recommended site for torrents. I double checked that they were just MKV files and there was nothing else hidden. I also checked all the comments on the torrent, of which there were many, and there were no red flags.\n\nAt all other times, I've been using NordVPN on a kill switch, with the vpn interface linked to the torrent client as an added kill switch. \n\nI also did a test with downloading Ubuntu, but I deleted that file (if I somehow downloaded a fake Ubuntu file)\n\nI did everything right, I'm so confused. Please don't reply to this post if you just want to criticize me for using torrents. I've done my research on it.\n\nI just want to know what my next steps are and how I insure that I'm safe from this. Honestly a little bit panicky at the moment.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qn77jx/i_think_i_somehow_downloaded_a_rootkit_onto_my/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o1sv84q",
          "author": "eric16lee",
          "text": "No criticism here mate. Just facts. \n\nIn 2926, there are no longer any safe piracy sites. Torrents included. \n\nThe advice I give everyone that does this is to change all of your passwords from a different device and then format your hard drive and reinstall Windows from a USB drive. \n\nThat's the only way to be sure your accounts remain in your possession and you pc is safe.",
          "score": 4,
          "created_utc": "2026-01-26 11:34:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1thd42",
              "author": "Classic_Mammoth_9379",
              "text": "> In 2926, there are no longer any safe piracy sites. Torrents included\n\nDon’t suppose you can look in your historical records for the Feb 2026 lottery results and DM them to me could you?",
              "score": 4,
              "created_utc": "2026-01-26 13:57:44",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1vlzz5",
                  "author": "eric16lee",
                  "text": "Time to start proofreading my responses. \n\nPowerball number is 12.  🙂",
                  "score": 2,
                  "created_utc": "2026-01-26 19:37:14",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1s666q",
          "author": "closeenoughbutmehh",
          "text": "ScreenConnect is a remote desktop solution, which apparently ships its own version of the Windows authentication package. There can be several reasons for this on a technical level, so this is not necessarily a problem.\n\nIf you don't know what ScreenConnect is / haven't ever used it, you might be compromised, but I doubt that's going to be from the torrenting - mkv files are multimedia content only, and I am not aware of any major security flaws with them assuming you're using a player worth its salt like VLC. \n\nLooking into the last modification date of the files in question might help figuring out a timeframe; meantime, a quick malwarebytes scan might be in order, most infections nowadays come from people opening mail attachments or downloading shady things and running them.",
          "score": 3,
          "created_utc": "2026-01-26 07:52:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1to2i4",
              "author": "RoamingThomist",
              "text": "AVs are unfortunately pretty bad at RATs: most of them are legitimate RMM tools that have been reconfigured by a threat actor to connect to their infra, so come up as clean or PUP by most traditional AVs.\n\nWhat makes me suspicious of that dll is that it's not in the right place: screen connect installs to a specific Screen Connect directory. Windows Service is not a default directory for it, and is not a default directory in Windows. So it's a custom installation location, which is strange enough that I'd want to look again at it.",
              "score": 2,
              "created_utc": "2026-01-26 14:32:12",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1wylc4",
                  "author": "closeenoughbutmehh",
                  "text": "Agreed with the non-standard path. However as far as I'm concerned the first thing that comes to my mind is, I know I hardly ever use the default directory nomenclature for anything, and making an assumption otherwise is already one too many because I can't prove it. \n\nAlso, I find that asking about knowledge of a tool's name or function to a user is a better starting point than asking them about their nomenclature habits / whether they always just click ok, oftentimes because many don't even know what I'm talking about. \n\nThat said, and given my last point, you might want to consider easing off the acronyms if you want non-IT people to understand half the things you're saying",
                  "score": 1,
                  "created_utc": "2026-01-26 23:17:54",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o1ub8zh",
              "author": "Kryptonianboethius",
              "text": "It had been downloaded in August, and as far as I know, I didn't have any reason to download a remote access software...\n\nI just went and deleted all the files and emptied my recycle bin. I used the command panel to search for \"screen\" and \"connect\", and then did a ton of malwarebytes scans for rootkits. Even after restarts nothing is showing up, so I think I'm okay now? I hope lol?",
              "score": 1,
              "created_utc": "2026-01-26 16:17:51",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1x0rp0",
                  "author": "closeenoughbutmehh",
                  "text": "Based off u/RoamingThomist's comment, which makes a lot of sense, you might want to consider backing up your important data and reinstalling your operating system. \n\nShort of a thorough scrub with tools like HijackMe and network behavior monitoring, you'll have a hard time making sure everything runs as it should, and - no offense - your question and the way it's written suggest to me that you might not have the level of savvyness necessary to undertake that process without help.\n\nIn which case, better safe than sorry; it's a bit of a pain but at the end of the day the protection of your data is more important than a few hours of your time in pretty much any instance.\n\nBy the way, obligatory reminder that less than 2 copies of your data is equivalent to it not existing at all, minus one incident. Backup your important data in 3 different places: usual copy, plus first backup copy in a different physical medium, plus second backup copy in a different physical _location_.",
                  "score": 2,
                  "created_utc": "2026-01-26 23:28:59",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1tn5tn",
          "author": "RoamingThomist",
          "text": "You need to provide us some more information if you want us to help you triage. As there is nothing here that helps me confirm whether or not you're infected.\n\nA rootkit from a torrent would be interesting; piracy would usually carry the risk of either a RAT or an infostealer (it's almost always Lumma). The filename there is making me think it's ConnectWise ScreenConnect, which is an RMM tool that some threat actors use as a RAT. But that's not the normal installation directory that I've seen in the wild, which makes me suspicious.\n\nI'd do this in powershell, but that's just because I'm used to working from a terminal. Don't have my triage scripts to hand, so this will seem a little janky.\n\nGo into powershell, and do \"gci \"C:/Program Files (x86)/Windows Service/\" -Force -Rec\"; that will show you everything under that Windows Service directory and all its subdirectories. Let me know what is in there, it'll help me smell if anything is weird about it.\n\nDownload autoruns from sysinternals; look through all the tabs, do you notice anything that smells weird? Even a rootkit has to autoload at some point, they generally aren't that sneaky to hide from an autoruns check (especially the kind of rootkits you'd encounter through piracy)",
          "score": 1,
          "created_utc": "2026-01-26 14:27:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1uaqom",
              "author": "Kryptonianboethius",
              "text": "I honestly just went to the file location and deleted all of the ScreenConnect files. Apparently they had been downloaded in August and I was just now getting a warning that they had tried to activate.\n\nSo far, after quite a few restarts and a ton of Malwarebytes rootkit scans, nothing has shown up, so I think I'm safe now? I also went to the command panel and just did file searches for \"screen\" and \"connect\"",
              "score": 1,
              "created_utc": "2026-01-26 16:15:41",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1tu0yk",
          "author": "Odd_Breadfruit763",
          "text": "Ive been a pirate since birth basically, ive had a few malwares/trojans and stuff when i was younger. (Honestly most hasnt even been through torrenting, and none of them has been through downloading movies ive seen tries though, only games or pokemon emulators, fk theres a lot of shit in the emulators)\n\nThe MKV files are probably not the issue, either they use another fileextension IME and try to trick u into opening it that way (ISO is popular, same with exe )or they package the file in another folder, for example \"subtitles\" or \"sample\" folder. ONLY download what you need, for example the english subtitle and MKV file in my case. if u let ur torrent software load u can uncheck all unwanted files.\n\nAlways check what you torrent if you are going to torrent. Best is to not torrent and get things legally, i aint got the cash for that. 2nd best is to do it on a separate machine segregated, i have one of those setup (RPI5), but i still download some movies on my \"main\" device",
          "score": 1,
          "created_utc": "2026-01-26 15:01:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1v963c",
          "author": "MountainDadwBeard",
          "text": "No you did not do \"everything right\".\n\nNuke the whole thing. \n\nStop using torrents or find a VM with hardened file sharing and networking configurations.",
          "score": 1,
          "created_utc": "2026-01-26 18:42:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1vgzo4",
              "author": "Kryptonianboethius",
              "text": "Turns out it's completely unrelated to the torrents and it's something that got onto my computer almost half a year before I started torrenting.\n\nBut yeah, I'm just nuking the whole thing, reinstalling windows from an external drive.",
              "score": 1,
              "created_utc": "2026-01-26 19:15:40",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1w1gqc",
          "author": "Main_Secretary_8827",
          "text": "Rootkits are very rare, you probably did not get one",
          "score": 1,
          "created_utc": "2026-01-26 20:45:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1rpnbu",
          "author": "Kryptonianboethius",
          "text": "Okay so I did some digging and the files it is alerting me about are files I've had since August 2025\n\nSo, either I am unbelievably fucked, or this is completely fine.\n\nGonna leave the post up just in case, and because I would like to know what one does in this situation.",
          "score": 1,
          "created_utc": "2026-01-26 05:40:24",
          "is_submitter": true,
          "replies": []
        }
      ]
    },
    {
      "id": "1qldidc",
      "title": "I wanna pursue cyber security...... how should i start?? (its my first time posting here i hope it is the place)",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qldidc/i_wanna_pursue_cyber_security_how_should_i_start/",
      "author": "Ill-Jacket-1106",
      "created_utc": "2026-01-24 04:41:25",
      "score": 8,
      "num_comments": 21,
      "upvote_ratio": 0.69,
      "text": "I am 15, and ya..... as the title says...... please suggest me.....",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qldidc/i_wanna_pursue_cyber_security_how_should_i_start/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o1djv6t",
          "author": "Gen4GlockAndSwitch",
          "text": "Tryhackme or Hackthebox",
          "score": 5,
          "created_utc": "2026-01-24 05:08:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1m9buy",
              "author": "Big_Substance_417",
              "text": "Try hack me is the best way to start.",
              "score": 3,
              "created_utc": "2026-01-25 13:57:37",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1m9ul4",
                  "author": "Gen4GlockAndSwitch",
                  "text": "This a fact. You ain’t lie at all",
                  "score": 2,
                  "created_utc": "2026-01-25 14:00:36",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o272trw",
              "author": "Super_Maybe_4848",
              "text": "Hah well said",
              "score": 1,
              "created_utc": "2026-01-28 11:26:44",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1difc5",
          "author": "Pitiful-Excitement47",
          "text": "Go to school or boot camp or self study certs.",
          "score": 3,
          "created_utc": "2026-01-24 04:58:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1j0ot7",
              "author": "LowGun03",
              "text": "Got my BSc in cyber sec, about as much experience as a fresh grad can get and i’ve not had even an interview in about 7 months of actively seeming a job, imo school is the worst path as someone with 3 years experience will smash you out the water if you have 3 years of education and the degree",
              "score": 1,
              "created_utc": "2026-01-25 00:26:00",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1j28f3",
                  "author": "Pitiful-Excitement47",
                  "text": "He is asking how to get a start. So I gave him multiple pathways. Not everyone learns the same and will excell in the same pathways. \n\nSomeone who has to ask obviously lacks any foundation, as even a simple Google would answer his questions. College might be best for him. \n\nExperience always beats degrees/certs. You are likely only applying for the higher level positions or have something seriously wrong with your resume.",
                  "score": 1,
                  "created_utc": "2026-01-25 00:33:58",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1dkz7m",
          "author": "SatisfactionMuted103",
          "text": "Download the ISO 270001 PDF and learn all the terms.",
          "score": 3,
          "created_utc": "2026-01-24 05:16:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1di3v4",
          "author": "CartographerOne4633",
          "text": "Hit search and read the threads. Reading is fundamental in this field.",
          "score": 1,
          "created_utc": "2026-01-24 04:56:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1dmcuh",
          "author": "Highfivesghost",
          "text": "WGU has cybersecurity degrees for cheap",
          "score": 1,
          "created_utc": "2026-01-24 05:26:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1do7uk",
          "author": "Fresh_Heron_3707",
          "text": "Cyber security is not an introductory discipline. Until you’ve dealt with tech before that’s where you need to start. You need to understand natural failure states before malicious failure states.",
          "score": 1,
          "created_utc": "2026-01-24 05:40:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1duyiv",
          "author": "Glass-Pound-9591",
          "text": "I wish you Good luck man. Just good luck.",
          "score": 1,
          "created_utc": "2026-01-24 06:34:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1duyu4",
          "author": "IsDa44",
          "text": "Roadmap.sh has a good roadmap. I also have one incase u want to check it out, isdadev.at",
          "score": 1,
          "created_utc": "2026-01-24 06:34:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1eck46",
          "author": "themagicalfire",
          "text": "First, learn Saltzer and Schroeder’s design principles.",
          "score": 1,
          "created_utc": "2026-01-24 09:11:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ef1lj",
          "author": "lifeisamz",
          "text": "Read the RFC document.",
          "score": 1,
          "created_utc": "2026-01-24 09:34:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1eipi9",
          "author": "Educational-Chef103",
          "text": "If you decided to start cyber sec, learn network essentials bro. Trust me. But know that happiness doesn't exist for you afterward. Good lucks.",
          "score": 1,
          "created_utc": "2026-01-24 10:08:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1eyz1n",
          "author": "ParticularAnt5424",
          "text": "If you have a choice between a cyber major or computer science - the latter is way more helpful.\n\n\n\n\nCybersecurity is very broad and I doubt you know exactly what you want or will do. CS is the fundamentals of cybersecurity. You should understand how computers works, how to program, networking, how https works, how to troubleshoot a printer lol, etc. \n\n\n\n\nAt this age I would also recommend doing CTFs - they are super fun to play with instated of the boring \"read this text for nothing\", CTFs give you a goal and by doing it you will remember it while having fun. Very cool free is https://overthewire.org/wargames/, but you can also try HackTheBox and TryHackMe.\n\n\n\n\nThat's about it. Remember to have fun whatever you decide to do ",
          "score": 1,
          "created_utc": "2026-01-24 12:29:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ixivr",
          "author": "DirtComprehensive520",
          "text": "Get a bachelors degree in computer science and consider the military.  In either order.",
          "score": 1,
          "created_utc": "2026-01-25 00:09:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1kprya",
          "author": "Confident_Natural_87",
          "text": "I would recommend starting with the Google IT Support Professional certification.  Then move to the Comptia A+ core 1 and 2.  Just study for them if the test is too expensive.  Move onto Network +.  Hopefully you local library system (in Texas anyone can get a HPL card) and get access to LinkedIn Learning and Udemy Business for free.\n\nAgain just study Network +.  If you have the money take the exam.  Still you can skip the exams and study for the CCNA.  That will cover all the Network basics.  Then maybe study.  \n\nLook at the local CC as well.  You could possibly dual credit some courses.  Finally go to partners.wgu.edu.  Go to partners.wgu.edu.  Click your state and see if the school is listed.  If it is see what degree you can get that transfers into the WGU degree.  CCNA gives you 11 credits towards the Cybersecurity and the BSIT.  Personally I would recommend the BSIT as you can transfer in more.  As you get the higher Comptia certs you can get your MSCIA at WGU.",
          "score": 1,
          "created_utc": "2026-01-25 06:31:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1nuqta",
          "author": "GhostlyBoi33",
          "text": "TCM-Security is also good! HTB is pretty good too",
          "score": 1,
          "created_utc": "2026-01-25 18:19:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1qajvv",
          "author": "Background-Slip8205",
          "text": "You don't.  You think you do because you have no clue what cybersecurity really is, but you hear it's cool like the movies, you get to play with advanced gadgets, and it pays a ton of money.\n\nThe reality is, the pay sucks for 80% of people compared to other specialties, you're basically blindly reading through log files / text files all day, or running mundane pointless reports and audits.   \n\nCyberSecurity requires 5-10 years minimum experience in a ton of different IT areas to be truly good and excel, and colleges are handing out degrees like popcorn.\n\nSo if you try to pursue cyber instead of a regular more balanced IT degree, you're going to struggle to find a job for months at a time.  Once you do get a job you're going to be miserable and hate it, and you're going to be making $20 an hour for the first few years with small pay raises and a low chance of moving up and advancing your career.  \n\nStick with general IT or CS.  Learn Linux, learn AD, networking, understand in general how databases work, and go into IT with an open mind.   Think of it like getting icecream.  If you've never had any flavor ice cream before, why would you fixate on only trying vanilla, when there's 80 different flavors you should give a chance to?",
          "score": 1,
          "created_utc": "2026-01-26 00:51:32",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qnd4b1",
      "title": "Made an account on a potential (quite likely) scam site",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qnd4b1/made_an_account_on_a_potential_quite_likely_scam/",
      "author": "OverFace9316",
      "created_utc": "2026-01-26 11:05:04",
      "score": 8,
      "num_comments": 5,
      "upvote_ratio": 0.8,
      "text": "Hi,\n\nI've recently made an account on a site where \"Kai Cenat\" claims to give out 2500 dollars.\n\nI used my gmail name and a random password, and claimed the \"bonus\". I didn't do anything else.\n\nNoteworthy is I didn't get any mail in my inbox, nor did I verify anything. Basically just signed up with the promo code. That's it.\n\nAt first it was just curiosity and for the laughs as I know it's fake, but now I regret putting myself in this position.\n\nI can't delete the account; the site is called zyxwin.\n\nCan they somehow still do something with only my gmail adress and nothing more?\n\nI'm actually freaking out rn.\n\nAny help is much appreciated!",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qnd4b1/made_an_account_on_a_potential_quite_likely_scam/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o1su5y5",
          "author": "EnvironmentSquare778",
          "text": "Assume the password u used for that site is pwnd",
          "score": 2,
          "created_utc": "2026-01-26 11:25:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1sxf3m",
              "author": "OverFace9316",
              "text": "Hopefully the only thing that's screwed!",
              "score": 1,
              "created_utc": "2026-01-26 11:51:53",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1supj2",
          "author": "eric16lee",
          "text": "As long as you used a unique password to register for this site, you should be ok. If you udes the same password you use in other places, you need to immediately change that password everywhere else you use it. \n\nExpect an increase in spam andogin attempts to your email since you gave that to them. Make sure you have a unique password and 2FA set up on your email.",
          "score": 2,
          "created_utc": "2026-01-26 11:30:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1sxcdg",
              "author": "OverFace9316",
              "text": "Okay used a random password, thanks for the quickly reply puts my mind at ease\n\nAnd I'll set up that 2FA immediately",
              "score": 2,
              "created_utc": "2026-01-26 11:51:18",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1w5slg",
          "author": "Friendly-Error-3448",
          "text": "They can't 'hack' you with just a Gmail address, but it may make it more likely you'll receive spam or malicious (e.g. phishing emails). Fortunately, modern email solutions like Gmail have a host of counter-measures that could block a lot of things before they arrive, however it's always best to stay vigilant!",
          "score": 1,
          "created_utc": "2026-01-26 21:04:29",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qo361w",
      "title": "Need advice from the pros",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qo361w/need_advice_from_the_pros/",
      "author": "Acousthiq",
      "created_utc": "2026-01-27 03:59:07",
      "score": 6,
      "num_comments": 2,
      "upvote_ratio": 1.0,
      "text": "Hi everyone,\nI’m organizing a CTF for my college and would love some advice.\nI’m aiming for a beginner to intermediate level CTF with a mix of challenges like rev engineering, web exploit, steganography, etc. Nothing too fancy, but not too easy either.\n\nI’d love suggestions on:\n• Good ideas for beginner-friendly yet interesting challenges\n• How/where to host the CTF (could ctfd work?)\n• Any common mistakes to avoid.\n\nIf you have sample challenge ideas, resources, or past experiences to share, that would be super helpful. ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qo361w/need_advice_from_the_pros/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o1yhrbx",
          "author": "SilverMagicMage",
          "text": "Make a 67 themed ctf. That sounds awesome",
          "score": 1,
          "created_utc": "2026-01-27 04:18:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1yhukp",
              "author": "Acousthiq",
              "text": "😭😭",
              "score": 1,
              "created_utc": "2026-01-27 04:18:38",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qq9qmm",
      "title": "Worth to study a one year master in cybersec and how is the car industry when it comes to cybersec jobs?",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qq9qmm/worth_to_study_a_one_year_master_in_cybersec_and/",
      "author": "s9000aero",
      "created_utc": "2026-01-29 14:17:23",
      "score": 6,
      "num_comments": 18,
      "upvote_ratio": 0.8,
      "text": "Hi, since I graduated 2.5 years ago with a informatics degree from a university I have been looking for a job. But it's basically impossible to find a job or even try to start a career within informatics. So I have been considering to get a master in cybersecurity to widen my opportunities.\n\nSo is a one year master in cybersecurity enough to land a job or will I just end up without a job?\n\nHow is the opportunities when it comes to the car industry and cybersecurity jobs?\n\nAlso if anyone have any tips on how to get into the car industry within cybersecurity would I appreciate it.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qq9qmm/worth_to_study_a_one_year_master_in_cybersec_and/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o2f03e9",
          "author": "TheOGCyber",
          "text": "A Masters in cybersecurity with no experience will result in a huge student loan debt and no job.\n\nEveryone starts at the bottom.  A help desk job or desktop support.  Get your A+, Network+, and Security+ certifications and get that entry-level job.  Get some experience.  Then, work towards cybersecurity.",
          "score": 6,
          "created_utc": "2026-01-29 14:33:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2f1ihv",
              "author": "s9000aero",
              "text": ">A Masters in cybersecurity with no experience will result in a huge student loan debt and no job.\n\nHere is university free so loan part will be small.\n\n>Everyone starts at the bottom. A help desk job or desktop support. Get your A+, Network+, and Security+ certifications and get that entry-level job. Get some experience. Then, work towards cybersecurity.\n\nI understand that I will end up in a entry-level job so then it's maybe better to skip the masters then I guess.",
              "score": 3,
              "created_utc": "2026-01-29 14:40:22",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o2f3zxk",
              "author": "Sea_Neighborhood6143",
              "text": "Perfect advice.",
              "score": 1,
              "created_utc": "2026-01-29 14:52:33",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o2f74ay",
              "author": "maxz2040",
              "text": "This is fantastic advice and exactly what I mentor people to do",
              "score": 1,
              "created_utc": "2026-01-29 15:07:25",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2fdoiw",
                  "author": "beastofbarks",
                  "text": "The big problem is everyone recommends that so everyone does it and now those jobs are turbo flooded. You have to have a BS in comp science, a half dozen certs, and a collection of lucky rabbit feet to even think about applying to helpdesk now. Everything above helpdesk is flooded too so no one leaves helpdesk anymore.",
                  "score": 1,
                  "created_utc": "2026-01-29 15:37:26",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2f6n5u",
          "author": "JustAnEngineer2025",
          "text": "The best method to determine the viability of cybersecurity jobs in the automotive industry is to go to their web sites and look at their job posting (usually under a \"Careers\" tab). You may see jobs for both traditional IT (AKA Corporate) but also on OT (manufacturing).\n\nu/TheOGCyber is spot on about unnecessarily taking on additional debt for little to no material gain in getting a first job.",
          "score": 2,
          "created_utc": "2026-01-29 15:05:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2f7189",
          "author": "maxz2040",
          "text": "No job. Don't study at uni",
          "score": 1,
          "created_utc": "2026-01-29 15:07:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2fbxme",
          "author": "beastofbarks",
          "text": "I think informatics probably has better job prospects than cybersecurity honestly.",
          "score": 1,
          "created_utc": "2026-01-29 15:29:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2fcv0o",
              "author": "s9000aero",
              "text": "Ohh intresting so it's maybe better to just continue to try to get a job within informatics then and skip cybersecurity?",
              "score": 1,
              "created_utc": "2026-01-29 15:33:45",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2fdcdi",
                  "author": "beastofbarks",
                  "text": "I dunno but this land is a graveyard for unemployed cybersecurity students so ...",
                  "score": 1,
                  "created_utc": "2026-01-29 15:35:55",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2in1bx",
          "author": "S4LTYSgt",
          "text": "Dont do masters without experience. It makes no sense. You dont have any cybersecurity experience so no reason why you would get a job in cybersecurity. Get some IT experience for 5 years and then worry about cybersecurity. You might end up liking cloud or network engineering or infrastructure.",
          "score": 1,
          "created_utc": "2026-01-30 00:59:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2l8dfx",
          "author": "maxz2040",
          "text": "To get into the field I did 6 months internship. Recent grads I'm interviewing can't even stick out for 2 days",
          "score": 1,
          "created_utc": "2026-01-30 12:10:33",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qoagxr",
      "title": "Is Malwarebytes/Window Defender Scan Enough For Malware",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qoagxr/is_malwarebyteswindow_defender_scan_enough_for/",
      "author": "Boy0Boyz",
      "created_utc": "2026-01-27 10:41:51",
      "score": 5,
      "num_comments": 3,
      "upvote_ratio": 0.78,
      "text": "Assuming your a average person, if you scanned your windows laptop with Windows Defender Quick Scan or Malwarebytes Free Trial and they show its safe, can you assume that most probably your device is safe if no malware signs are present? I know anything is possible but probability wise, is it all good? Thx in advance.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qoagxr/is_malwarebyteswindow_defender_scan_enough_for/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o1zw73k",
          "author": "jootmon",
          "text": "Use the full scan with Microsoft Defender or MSERT.\n\nhttps://learn.microsoft.com/en-us/defender-endpoint/safety-scanner-download",
          "score": 1,
          "created_utc": "2026-01-27 11:13:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o21nha1",
          "author": "IlIIIllIIIIllIIIII",
          "text": "Hello ,\nFirst : no you never can be sure :’( \nSome malware take a long time before them signature are detected \nSome malware called rootkit (not only)  can evade detection by hiding where defender can’t found them. \n\nIf you thought your are infected , sometime it can be nice to re image your device \n\nBut defender full scan is a good starting point and most of the threat will be detected. \n\nGood luck",
          "score": 1,
          "created_utc": "2026-01-27 16:53:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2731j7",
          "author": "Turbulent_Might8961",
          "text": "Usually, yeah.",
          "score": 1,
          "created_utc": "2026-01-28 11:28:27",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qkz30s",
      "title": "Best VPN? Looking for Recommendations",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qkz30s/best_vpn_looking_for_recommendations/",
      "author": "ChickenEggMedium",
      "created_utc": "2026-01-23 18:41:15",
      "score": 4,
      "num_comments": 20,
      "upvote_ratio": 1.0,
      "text": "Hey people, I’m about to commit to a VPN, and I want to make sure I choose the right one. Free VPNs don’t work anymore, so that’s not an option. I’m looking for something that reliably works, offers fast speeds without buffering, has unlimited data, and follows a strict no-logs policy. I keep seeing the same big providers everywhere like MillionVPN, Mullvad, and others. Are these actually solid choices? I’d really appreciate hearing real recommendations.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qkz30s/best_vpn_looking_for_recommendations/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o1b0wf8",
          "author": "PizzaUltra",
          "text": "Why do you think you need a VPN? What do you think you need it for? What would be your main use cases?",
          "score": 1,
          "created_utc": "2026-01-23 20:44:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1bma30",
              "author": "talex625",
              "text": "If you go to work and you don’t want your employer to see your web activity’s or am I wrong?",
              "score": 0,
              "created_utc": "2026-01-23 22:25:16",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1e29uq",
                  "author": "ChickenEggMedium",
                  "text": "This one too",
                  "score": 1,
                  "created_utc": "2026-01-24 07:38:05",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1bhd11",
          "author": "LRaccoon",
          "text": "What's your threat model? Use cases?",
          "score": 1,
          "created_utc": "2026-01-23 22:01:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1biv8g",
          "author": "DarthShitpost",
          "text": "I use Mullvad and Proton and both have been solid so far.",
          "score": 1,
          "created_utc": "2026-01-23 22:08:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1c7yw9",
          "author": "Medium-Potential-348",
          "text": "Proton / iVPN / Mullvad\n\nProton has the best free VPN.",
          "score": 1,
          "created_utc": "2026-01-24 00:19:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1df7i8",
          "author": "mandevillelove",
          "text": "for reliable fast, no logs VPN use - Nord VPN, express VPN, or Mullvad are solid picks that actually work well.",
          "score": 1,
          "created_utc": "2026-01-24 04:36:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1j1uqf",
              "author": "gloves085",
              "text": "NordVPN? The VPN that got compromised and tried to hide it?",
              "score": 2,
              "created_utc": "2026-01-25 00:32:01",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1j298f",
                  "author": "gloves085",
                  "text": "First very basic account of what happened, there was much better reporting at the time...  \n[What's the truth about the NordVPN breach? Here's what we now know | TechRadar](https://www.techradar.com/news/whats-the-truth-about-the-nordvpn-breach-heres-what-we-now-know)",
                  "score": 1,
                  "created_utc": "2026-01-25 00:34:05",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1e1gye",
          "author": "Zealousideal_Leg5615",
          "text": "I’ve been on expressvpn for a while,  the speeds stay good and it doesn’t mess with my stuff.",
          "score": 1,
          "created_utc": "2026-01-24 07:30:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1gw1az",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-24 18:21:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1gw1dq",
              "author": "AutoModerator",
              "text": "Hello,\n\nYour comment was automatically removed because your Reddit account has significantly negative comment karma. We use this threshold to reduce disruptive behavior and maintain quality discussion in r/cybersecurity.\n\nIf you believe this was a mistake or would like to appeal, feel free to message the mod team.\n\nThank you.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CyberSecurityAdvice) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-01-24 18:21:43",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1h397o",
          "author": "VoiceHoliday7192",
          "text": "You can use a wireguard VPN with residential IPs. It has low latency, strong encryption, high speeds and a simple config that you can apply it on the official client. The price of the VPN it's starting at $4/mo. Here it's the VPN [anonymous-proxies VPN](https://www.anonymous-proxies.net/products/wireguard-vpn/).",
          "score": 1,
          "created_utc": "2026-01-24 18:52:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1o9nnx",
          "author": "namebrained",
          "text": "I used to swear by Proton until I saw a thread on Twitter detailing how they complied with law enforcement in 2021. Now Mullvad seems like the best choice just on the basic of how it’s engineered alone, no accounts or IP identifiers etc.",
          "score": 1,
          "created_utc": "2026-01-25 19:21:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1r96u6",
          "author": "Flaissen",
          "text": "I am using Million VPN and works perfectly.",
          "score": 1,
          "created_utc": "2026-01-26 03:52:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1yvpoy",
          "author": "txvu",
          "text": "Proton VPN is the best imo. They're based in Switzerland, so the privacy law is pretty strong. If you use my promo link https://pr.tn/ref/8EBA683R, you'll get 2 free weeks and $20. Full disclosure, I get $20 too.",
          "score": 1,
          "created_utc": "2026-01-27 05:54:14",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qorm1f",
      "title": "Have I fully deleted a ScreenConnect rootkit?",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qorm1f/have_i_fully_deleted_a_screenconnect_rootkit/",
      "author": "Kryptonianboethius",
      "created_utc": "2026-01-27 21:42:20",
      "score": 3,
      "num_comments": 12,
      "upvote_ratio": 0.72,
      "text": "Hello!  \nI recently booted up my laptop and was alerted that Windows Local Security Authority had stopped a ScreenConnect file from loading. It was located in C:/Program Files (x86)/Windows Service/. As far as I know, “Windows Service” is not a default Windows folder, and if I had downloaded ScreenConnect, I would have had no reason to place it there or name it that way.\n\nThe download date was from June. I haven’t had any security issues since then, so I assume this was the first time it tried to run during a restart.\n\nI didn’t have much of importance on my laptop—only a few files I wanted to keep and might revisit. I reset the laptop and reinstalled Windows 11 using a cloud install. But is that enough? I’ve read that rootkits like this can reinstall themselves even after a Windows reinstall.\n\nI’m a total novice when it comes to cybersecurity, and I’ve been extremely anxious about this over the past couple of days. I’ve been checking my laptop after every restart, and no ScreenConnect/ConnectWise files have appeared again, but I just want to be extra sure. Otherwise, I’ll be agonizing over this until I eventually replace the laptop.\n\nI also uninstalled my Remote Desktop Connection app. I know that’s probably unrelated—it was mostly for peace of mind.\n\nEdit: I also updated my BIOS/UEFI\n\nThank you! Any advice here would be massively appreciated",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qorm1f/have_i_fully_deleted_a_screenconnect_rootkit/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o23q21k",
          "author": "Alert_Guarantee_4673",
          "text": "It depends on how badly you want to keep the device, if you really wanna keep the laptop, what you should do is completely reformat the drive by doing something like installing Linux to override your windows, then reinstalling windows afterwards. However you could be around 80% confident that it'll remove the virus because reformating the drive will delete even the windows kernal and everything. Otherwise, if you are ok with it, the only way to fully know that the root kit is gone is by destroying the device entirely. If the malware infects on the hardware or BIOS level, destruction is the only option as the malware will persist through OS installs. However, if it's kernal level or below like most malware is, then reinstallation after reformating will work. \n\nAlthough these are the nuclear option, if you want a way that may work without reinstalling windows, Id say take a look at the Tron script, it's comprehensive enough to remove most malware from my experience",
          "score": 1,
          "created_utc": "2026-01-27 22:21:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o23wbar",
              "author": "Kryptonianboethius",
              "text": "I did a manual update on my BIOS/UEFI through my laptop provider's website, so I think I'm cleared on that level now?\n\nWhat I've read is the problem with the rootkit I have is that it's technically not malware. ScreenConnect is a legitimate service, it's just not very secure and can be accessed. I don't know if it would actually come up on any malware scans...",
              "score": 2,
              "created_utc": "2026-01-27 22:51:32",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o23zz3m",
                  "author": "Alert_Guarantee_4673",
                  "text": "Ah if it's a legitimate service then it's easier to get rid of, take a look in task manager, if it's running, kill it then delete the files as administrator. You'll have to dig in the windows registry for complete deletion but I can't help you there as I run Linux. \n\nFrom a quick search, it looks to be a remote desktop application intended for help desk use but is commonly used by scammers, you can attempt removal from the above method but honestly, resetting windows will do the trick better and you can be sure that theres no compromise that way",
                  "score": 2,
                  "created_utc": "2026-01-27 23:09:42",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o240a0r",
                  "author": "MerpoB",
                  "text": "Some major malware can install minor malware like screenconnect. If you didn't install it, something did.",
                  "score": 2,
                  "created_utc": "2026-01-27 23:11:13",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o27p1fb",
          "author": "Accomplished_Sir_660",
          "text": "Let me guess you got your computer from work?  Screenconnect is commonly used by MSP to manage devices.  It hard to remove as it will reinstall itself, but you can go into services.msc and disable the service so it can't start anymore.",
          "score": 1,
          "created_utc": "2026-01-28 13:49:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o28ay97",
              "author": "Kryptonianboethius",
              "text": "No, it's my computer I bought for myself.\n\nI never installed ScreenConnect, and it had been filed in a fake Windows directory on my computer. Plus it had tried to activate on it's own when I booted up my computer.",
              "score": 1,
              "created_utc": "2026-01-28 15:36:23",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o28brid",
                  "author": "Accomplished_Sir_660",
                  "text": "Then I would say you have been hacked.  I'd change your passwords ASAP.",
                  "score": 1,
                  "created_utc": "2026-01-28 15:40:01",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o27zy8c",
          "author": "[deleted]",
          "text": "[deleted]",
          "score": 1,
          "created_utc": "2026-01-28 14:45:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o28brzj",
              "author": "Kryptonianboethius",
              "text": "It's not my work computer. I never installed ScreenConnect and it had been filed in a fake Windows folder.",
              "score": 1,
              "created_utc": "2026-01-28 15:40:04",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2hlibx",
          "author": "alexynior",
          "text": "What I always do in these cases is format the entire disk during the process so that no trace is left behind. With that and the BIOS update you did, I would be completely at ease if I were you.",
          "score": 1,
          "created_utc": "2026-01-29 21:44:43",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qnueyt",
      "title": "Final year project suggestions",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qnueyt/final_year_project_suggestions/",
      "author": "AnonyMooseLulz",
      "created_utc": "2026-01-26 21:58:43",
      "score": 3,
      "num_comments": 0,
      "upvote_ratio": 1.0,
      "text": "So, I have to make this final year project for the last year of my cyber security degree, at first I was very motivated to make something new something unique for my FYP and decided to make an AI based NIDS system, that will comprise of 4 AI algorithms, 2 supervised, decision tree and random forest, and 2 unsupervised, isolation forest and autoencoders.\nFor the first part of the FYP I had to make the supervised part for which I took NIDS dataset from university of queens website and trained the models on the 2 algorithms.\nNow me having no idea or knowledge about AI somehow managed to make the thing an make it look like it was working which it is to some extent, it is basically 2 pkl files which predict the whether the packet is an attack packet or benign.\nWhich I think was not the right way to it, and could have been done in a way that the model still keeps on learning on the new packets it was receiving after it was trained on the initial dataset.\nNow I have to work on the unsupervised part of the project and the whole IDS, and again I know I will have to watch 100s and 100s of tutorial read 100s of theories on it and somehow I will manage to make it work in the end but I don't really want to do it like that again because it was such a hassle.\nSo I wanted to know if there is like a similar open source project, similar to the one described above, which I can tweak and reshape into what I have to present, or if there is any tutorial(s) that I can watch and work along to make the project.\nOr any other help or suggestion anyone can give me on how I should make this project would be very helpful and appreciate.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qnueyt/final_year_project_suggestions/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": []
    },
    {
      "id": "1qpse3f",
      "title": "Internship Decision",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qpse3f/internship_decision/",
      "author": "Dramatic-Craft8999",
      "created_utc": "2026-01-28 23:56:06",
      "score": 3,
      "num_comments": 4,
      "upvote_ratio": 0.81,
      "text": "I’m a college student trying to decide between two internship paths and would appreciate some outside perspective.\n\nI recently received an offer through a federal civilian internship program. The role is officially an IT student trainee position, based on system administration and general IT work in a secure government environment. It is in person, tied to a military base, and includes a security clearance path. Long-term, it can potentially lead to a full-time federal role, but the work itself is more IT-focused rather than a dedicated cybersecurity position.\n\nAt the same time, I’ve been offered a private-sector internship that is explicitly a cybersecurity internship. The work would involve hands-on security tasks and tools, and the role aligns directly with information security. I previously completed an IT internship, so this private-sector role feels like a more direct continuation into cyber.\n\nMy main dilemma is choosing between:\n\n\t•\tA cybersecurity-specific internship with more direct hands-on security experience\n\n\t•\tA federal IT role with clearance, stability, and long-term government/defense career leverage, but less guaranteed cyber depth\n\nI’m interested in cybersecurity long-term, but I’m also trying to think strategically about career leverage, not just job titles. I already have general IT experience, which is why I’m torn.\n\nFor people who’ve been in similar situations or have experience in government vs private-sector cyber, how would you weigh this decision early in your career?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qpse3f/internship_decision/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o2bihgj",
          "author": "koojlauj11",
          "text": "I don't belong to the group you're asking answers for but have an idea where you can also look. I have a niece who was interested in cybersecurity and gave her the same advice. From what I've seen, they often mention how students have very little experience in actual \"cyber security\". You should look on LinkedIn at other students who have had internships at those same places possibly and ask if they have some time (give exact time like 10 min or something) to ask about their internship there and their experience. Ask who they worked with and so on.\n\nYou could also research others who were in the \"goal\" roles of said positions, if they're available to view on social and see how long they've been there.\n\nYou should always go for experience for the role you want. While there, use that as an opportunity to build really good relationships and ask them about their career path. In general, since cybersecurity is more specialized and since, its competitive to even get a job to get that experience, it's going to be the better route.\n\nHowever, even after learning all the info you get...learn to trust your gut instinct. The more you get in tune with this and if you actually measure what does it means to have a \"gut feeling\" and when, you will familiarize yourself in choosing the right path, no matter where you go. So, trust your gut.",
          "score": 1,
          "created_utc": "2026-01-29 00:16:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2dr805",
          "author": "mandevillelove",
          "text": "If cyber is the goal, take the cyber role; the federal one is better for clearance and stability.",
          "score": 1,
          "created_utc": "2026-01-29 09:21:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2gufry",
          "author": "PismoSkydiver",
          "text": "IMHO, you should aim for the federal IT role that requires a security clearance, especially if it’s TS//SCI. That’ll generally make you far more marketable and open the doors to many more roles out there. That’s how it worked for my career path. Take this with a grain of salt because I’m not IT/cybersecurity.",
          "score": 1,
          "created_utc": "2026-01-29 19:35:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2lbfp8",
          "author": "joshisold",
          "text": "Personal opinion would be get the clearance.  There is a whole world of opportunity available to you in govtech that is essentially walled off to those without a clearance, and since it isn’t something you can get on your own (sponsorship is required), you are adding yourself to a short list of candidates for future opportunities.\n\nAnd here’s part two of why I would do it…you can always determine you don’t like the government sector and bolt for the civilian world.  No harm, no foul besides a missed cyber-specific internship.  You can hate the bureaucracy of being a government civilian and still utilize the clearance as a contractor where there is much less red tape, or once you are “in” you can look for lateral transfers into cyber.  \n\nAnd anecdotally…I know quite a few people who were great IT professionals who jumped at their first chance for a cybersecurity role and found out the hard way that the vast majority of cyber roles are not hands-on keyboard operators who are spending more time in Microsoft Excel than they are tools of the trade…and once they had that realization, they resigned their positions and moved back into the administration/engineering side of the house.\n\nBest of luck no matter what you choose.",
          "score": 1,
          "created_utc": "2026-01-30 12:31:31",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qr0mjj",
      "title": "I might have malware",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qr0mjj/i_might_have_malware/",
      "author": "Sufficient_Bill_3888",
      "created_utc": "2026-01-30 09:14:59",
      "score": 3,
      "num_comments": 4,
      "upvote_ratio": 1.0,
      "text": "I accidentally clicked an ad that brought me to a site called \"endowmentoverhangutmost\" I clicked off before it even loaded but after looking up what it was it said that it's a website that could make you dowload malware by just clicking the adds so now I'm scared. I ran a scan with Avast Antivirus Mobile (all this happened with my phone) and it said everything was fine and didn't mention anything about malware but I'm still scared. Am I truly fine or is my phone infected? Is there a way to know for sure?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qr0mjj/i_might_have_malware/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o2lltgn",
          "author": "eric16lee",
          "text": "You haven't given a whole lot of information such as the type of phone you have so I can only give you a generic response. \n\nUnless you download it an app from outside your phone makers official app store and side-loaded it onto your phone while bypassing all of the security warnings your phone would show you, then you don't likely have anything on your phone to worry about. \n\nAs long as your phone is somewhat modern and still receives updates it is extremely difficult to get any type of malware on it. Even on a PC it is extremely difficult to get malware on your device simply by clicking a link. Modern devices are highly resistant to drive by malware like this.",
          "score": 1,
          "created_utc": "2026-01-30 13:33:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2m5c51",
              "author": "Sufficient_Bill_3888",
              "text": "I have a POCO M6 powered by Xiaomi, I bought the phone 2 years ago, the only thing I did was click the link and then leave the website",
              "score": 2,
              "created_utc": "2026-01-30 15:11:44",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2m8pv6",
                  "author": "eric16lee",
                  "text": "Doesn't sound like you have anything to worry about.",
                  "score": 1,
                  "created_utc": "2026-01-30 15:27:24",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o2maekv",
                  "author": "Redditthr0wway",
                  "text": "Sounds like you are fine, also not all malware is built the same. Often its written for specific systems like windows or apple. You can always install anti-virus though if you are super worried.",
                  "score": 1,
                  "created_utc": "2026-01-30 15:35:05",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}