{
  "metadata": {
    "last_updated": "2026-01-24 02:29:56",
    "time_filter": "week",
    "subreddit": "CyberSecurityAdvice",
    "total_items": 11,
    "total_comments": 86,
    "file_size_bytes": 91485
  },
  "items": [
    {
      "id": "1qkrxgt",
      "title": "If cybersecurity is not an entry level job then HOW AM I SUPPOSED TO GET IN???",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qkrxgt/if_cybersecurity_is_not_an_entry_level_job_then/",
      "author": "Capable_Mixture_3205",
      "created_utc": "2026-01-23 14:15:25",
      "score": 50,
      "num_comments": 133,
      "upvote_ratio": 0.75,
      "text": "will graduate in 5 years. how to get into cybersecurity?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qkrxgt/if_cybersecurity_is_not_an_entry_level_job_then/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o18q7hx",
          "author": "MyWifesBoyfriend_",
          "text": "With experience. It has never been an entry level field and hard to break through even before the market got rough for everything else.",
          "score": 45,
          "created_utc": "2026-01-23 14:20:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1ani3s",
              "author": "Old-Ad-3268",
              "text": "And to elaborate, experience working on networking or applications or just about any other IT function",
              "score": 1,
              "created_utc": "2026-01-23 19:41:12",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o1c9y4n",
              "author": "VE3VVS",
              "text": "definitely experience I had put in almost 30year in IT before I became indoctrinated into the world cybersecurity, so patience grasshopper, somethings only time will yield. ;-)",
              "score": 1,
              "created_utc": "2026-01-24 00:30:20",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o1anf3a",
              "author": "HereSo-IDontGetFined",
              "text": "If it's not an entry level field, then how did the first employees in the field get in? \n\nExactly. It's not entry level because there's gatekeepers and b******* bureaucracy.",
              "score": -9,
              "created_utc": "2026-01-23 19:40:49",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1athae",
                  "author": "eNomineZerum",
                  "text": "The first cybersecurity practitioners were damn good experts in their respective fields. They weren't fresh college grads who have never supported any devices beyond their grandparents desktop. \n\nNowadays you have fresh grads who have never even had an internship claiming they are too good for help desk.",
                  "score": 4,
                  "created_utc": "2026-01-23 20:09:08",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1axyvy",
                  "author": "mrbiggbrain",
                  "text": ">If it's not an entry level field, then how did the first employees in the field get in?\n\nReal, not bullshit answer. \n\nThey where already in it. Like just about every IT specialty at one point it was a small enough domain that it wasn't a specialty. If the sum of the security field is logging onto a unix box and configuring a firewall, then unix admins just configure the firewall. \n\nAs the domain got more and more advanced the required skills got wider and wider. At a non-exact point it became difficult to possess both the skillset needed to be an expert in cyber security and another domain. \n\nPeople don't get into specialties, they become someone who works in specialties as they learn and specialize. \n\nIt's similar to executives, very few people start off as executives. They gain knowledge in a domain that leads to gaining skills relevant to executives, Eventually their skillset matches to expectations and they move across the line to a title more aligned with \"Executive.\"",
                  "score": 2,
                  "created_utc": "2026-01-23 20:30:24",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1btg01",
                  "author": "Turdulator",
                  "text": "“If being a CTO isn’t an entry level job, how did the first CTO get that job?”",
                  "score": 2,
                  "created_utc": "2026-01-23 23:01:43",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1apv27",
                  "author": "nimajnebsiem",
                  "text": "If that's the sum of your logic and comprehension skills, that's the reason why you can't get a job in the field.",
                  "score": 4,
                  "created_utc": "2026-01-23 19:52:10",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1bt2tr",
                  "author": "Turdulator",
                  "text": "The very first cybersec professionals were the top level sysadmins at companies who’s leadership said “oh shit, we need someone to focus on security now, you’re our smartest guy, we’re making this your problem now”",
                  "score": 1,
                  "created_utc": "2026-01-23 22:59:48",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1cskck",
                  "author": "Blitzjuggernaut",
                  "text": "No, the real issue is because to be decent at cybersecurity you need a really good understanding of the fundamentals. You need to be proficient in Networking, operating systems, hardware and understand how things work before jumping in, in addition to the different cyber security fundamentals. There's just so much to understand that's not just labeled \"cyber security\" that's why it's not entry level. People should really research before just picking something.",
                  "score": 1,
                  "created_utc": "2026-01-24 02:16:56",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o18qg8s",
              "author": "Capable_Mixture_3205",
              "text": "how can I get experience if I can't get a job?",
              "score": -18,
              "created_utc": "2026-01-23 14:22:09",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o18qsni",
                  "author": "Getshrektnerd",
                  "text": "Help Desk",
                  "score": 22,
                  "created_utc": "2026-01-23 14:23:54",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1938l7",
                  "author": "No-Tea-5700",
                  "text": "Well that’s the thing some people win and some people lose, not everyone wins a cyber six figure job",
                  "score": 2,
                  "created_utc": "2026-01-23 15:25:24",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o19azx7",
                  "author": "iwillnotbeknown",
                  "text": "Learn servers, active directory, networking, web apps.\n\nSecurity is about protecting them assets and make sure the configurations are good and healthy, if you don't know about any of them how are you going to protect them",
                  "score": 2,
                  "created_utc": "2026-01-23 16:00:36",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1abxi7",
                  "author": "buttholeDestorier694",
                  "text": "You start at help desk, then move to sys/network admin.\n\n\nVery few individuals will move directly into cyber security. \n\n\nAbout 5-10 years ago if you had a degree you could've done this, but nowadays. It aint happening.",
                  "score": 2,
                  "created_utc": "2026-01-23 18:47:33",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o19yy0z",
                  "author": "S4LTYSgt",
                  "text": "I mean you cant get any job in IT? Because the market is bad. You dont have to do Help Desk. I started off as a Network Engineer. I did do 3 internships in college that helped me skip the whole Help Desk/IT specialist. You can become a Jr SOC Analyst. There are some company that hire entry level. But lets say there are only 10,000 entry SOC roles and 100,000 applicants. Guess what, unless you are the lucky 10,000 to get the soc role, you will have to work in other IT positions unless you want to be unemployed. And if you arent getting any IT roles after one year, the industry is already saturated. Just switch to another industry. We have too many people now.",
                  "score": 1,
                  "created_utc": "2026-01-23 17:49:41",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1bqudw",
                  "author": "Turdulator",
                  "text": "Helpdesk then sysadmin then security… would you hire a carpenter who’s never been inside a house? A mechanic who’s never driven a car? A plumber who’s never shit in a toilet?",
                  "score": 1,
                  "created_utc": "2026-01-23 22:48:15",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o18qy5t",
          "author": "[deleted]",
          "text": "[deleted]",
          "score": 22,
          "created_utc": "2026-01-23 14:24:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1caejv",
              "author": "Pookias",
              "text": "I got into cybersecurity through a unique program for people graduating high school. Entry level opportunities do exist but they're few and far between.",
              "score": 1,
              "created_utc": "2026-01-24 00:32:47",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o18rgn8",
              "author": "Capable_Mixture_3205",
              "text": "can you give me more info about your personal projects?",
              "score": -1,
              "created_utc": "2026-01-23 14:27:18",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o18zfzf",
                  "author": "hkusp45css",
                  "text": "I love it when a professional says the equivalent of \"I got lottery ticket lucky to get in like I did, 15 years ago\" and INVARIABLY the next response is going to be some form of \"tell me how to do it like you did\"\n\nLike, they just did. They said it was dumb luck. So much so that they've never met another person that lucky.",
                  "score": 4,
                  "created_utc": "2026-01-23 15:07:18",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o18r05r",
          "author": "Cottrell217",
          "text": "You start at a lower level role like Helpdesk and work your way up. As others have said, security has never been an entry level role. You can’t protect systems and networks if you don’t know how they work. You learn a lot of that through help desk",
          "score": 19,
          "created_utc": "2026-01-23 14:24:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o19ej9z",
              "author": "dokkanic",
              "text": "do not ever start at helpdesk - it analyst or it administration. help desk / call center is a trap.",
              "score": -4,
              "created_utc": "2026-01-23 16:16:27",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1bz5h5",
                  "author": "Luxim",
                  "text": "Helpdesk/first line support in a corporate environment is very different from call centre work.",
                  "score": 2,
                  "created_utc": "2026-01-23 23:32:02",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o1am60u",
              "author": "HereSo-IDontGetFined",
              "text": "That's b*******. What is the point of going to college to learn? If that's the case you should be able to skip college and go straight to the employer since you're going to get your education through them anyways. \n\nThe \"that's the way it is\" boomer mindset is exhausting and a retardant to progress.",
              "score": -1,
              "created_utc": "2026-01-23 19:34:55",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1bblvw",
                  "author": "Incid3nt",
                  "text": "That's on the college and not on the community at large.  And you can skip college and go straight into it, its just tough.  It's kind of like college teaches you all about the ins and outs of locks, how to pick them, etc. But to step in this role you need to learn how to run an entire compound, do security checks, know the processes and routines within it.\n\nThey shouldn't be churning out these cybersecurity degrees like they are, for sure.",
                  "score": 1,
                  "created_utc": "2026-01-23 21:34:34",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1bv39m",
                  "author": "Turdulator",
                  "text": "lol, I’ve been doing IT for 20 years with a BFA in studio art.     The degree is so your resume doesn’t get thrown away immediately.    There are many companies that won’t hire anyone without a degree for any position, the purpose of the degree is so you can get those jobs.",
                  "score": 1,
                  "created_utc": "2026-01-23 23:10:26",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1cf90j",
                  "author": "-hacks4pancakes-",
                  "text": "We generally aren't the ones who overyhyped 23952803592385 open jobs in cybersecurity without any specifics about what actual niches or seniority they existed in. This same crap happened to web dev and software engineering. The mad rush for the field, huge overselling by schools, influencers, and bootcamps, Then there were way too many juniors for available junior jobs, add in outsourcing and offshoring, and as a result:  \n  \n\\- overall salaries dropped drastically  \n\\- job requirements went up continually to filter out candidates  \n\\- people who used to get in on self study and passion (rightly) no longer stood much of a chance.\n\nThe bottom line is the cybersecurity degree programs already skip a lot of important computer foundations to fit a ton of hacking material into 4 years, and there are just too many graduates who also have help desk experience or a previous career in IT to not filter on that. Its in the hundreds; just impossible numbers. It sucks.",
                  "score": 1,
                  "created_utc": "2026-01-24 00:59:16",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o1a2u5d",
              "author": "Diligent_Mountain363",
              "text": "This is bad advice, OP. Reimaging laptops and resetting passwords is not a springboard to a cyber security career lmao. It isn't 2004 anymore.",
              "score": -6,
              "created_utc": "2026-01-23 18:07:08",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1afxcl",
                  "author": "Cottrell217",
                  "text": "That’s still experience. OP doesn’t have to *only* do those things. They can take on more responsibilities outside of that or do projects on the side to learn about different things. But you can’t sit here and tell someone who doesn’t have any experience that they can just jump into a higher role and completely skip the basics. Too many people have heard “just get your security+ and you can work from home making 6 figures with no experience” and tried to jump into cyber with absolutely zero clue about any fundamental concept in IT. I’m not saying they need to stay in Helpdesk forever, because yes it sucks, but it’s a good place to start with absolutely no experience. You can go in many different ways from Helpdesk.",
                  "score": 2,
                  "created_utc": "2026-01-23 19:05:35",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1bvhlc",
                  "author": "Turdulator",
                  "text": "Nah, that’s entry level Helpdesk at a large company…. But entry level Helpdesk at a smaller company lets you get involved in so much more than that mindless repetitive stuff.",
                  "score": 1,
                  "created_utc": "2026-01-23 23:12:33",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1bzu9u",
                  "author": "Luxim",
                  "text": "Doesn't have to be full-time or even tech support at all, the important bit is gaining some IT experience.\n\nI personally did part-time tech support while getting an engineering bachelor, then Linux system administrator, then went back to school for a cybersec master's while working as a software engineer, IT consulting for a year, and now finally working as a cybersecurity officer.",
                  "score": 1,
                  "created_utc": "2026-01-23 23:35:43",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o18toru",
          "author": "RainbowSovietPagan",
          "text": "I think the expectation is that the entry level position is working at a help desk at a cybersecurity company. Either that or just apply to work for the government.",
          "score": 8,
          "created_utc": "2026-01-23 14:38:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o18stdf",
          "author": "xb8xb8xb8",
          "text": "you pivot to cybersec from development/sysadmin and similar roles",
          "score": 6,
          "created_utc": "2026-01-23 14:34:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1b1d4l",
              "author": "No-Main3801",
              "text": "And you get to sys admin by being on helpdesk first everyone wants fast results without gaining foundational experience you want to protect a companies computers but don’t wanna get the experience to fix and learn how said computers work is crazy !",
              "score": 3,
              "created_utc": "2026-01-23 20:46:27",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1aezwy",
          "author": "loozingmind",
          "text": "If you don't have a military background with cyber experience... you have to start at help desk. Just the way it is. I wanted to get into cybersecurity too. But I gave up on that dream. Read the comptia road map. It will direct you on what you need to get the proper certs. You can't just get comptia security+ and land a cybersecurity job. Gotta work your way up.",
          "score": 3,
          "created_utc": "2026-01-23 19:01:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o191bg9",
          "author": "100HB",
          "text": "For most junior level infosec roles I have worked to fill I usually selected people who have experience in areas such as help desk, system admin and/or network admin. \n\nIf it is a GRC type role I might hire someone who has done some type of data analysis type work",
          "score": 2,
          "created_utc": "2026-01-23 15:16:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o193mqn",
          "author": "Primary_Excuse_7183",
          "text": "Experience in one of the fields of things you’re securing. \n\nNetworking > securing networks\n\nSoftware > securing software\n\nI always explain it as the best way to manipulate and exploit a system is to have a really good understanding of said system. You know the nooks, crannies, and places where people can and do cut corners. \n\nReal world example: You work at a big corporate facility and you know they prop the back door which exposes the risk of someone slipping in that shouldn’t. You likely wouldn’t know that if you didn’t work there and see it everyday.(experience)",
          "score": 2,
          "created_utc": "2026-01-23 15:27:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o19efkk",
          "author": "dokkanic",
          "text": "Get into IT administration if you can't get a jr security analyst job. Do NOT go call center or tech support.  Look for SOC jobs or jr sec risk analyst jobs as a starting point. If not, IT analyst or administration jobs are the way to go. learn the tech and project management.",
          "score": 2,
          "created_utc": "2026-01-23 16:15:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1b19mh",
          "author": "gingers0u1",
          "text": "It started with engineers, developers, sys admins etc just taking on security related jobs. Late 90 early 2000 there wasn't cybersecurity as a job specialty. It was just who had experience in the system and can fix or solve the issue.\nAs for experience, if I need a security person to secure my OT system, why would I not want someone who knows PLC or industrial systems? If you're pentesting that system and you just randomly start throwing commands and tools you can cause serious, multimillion dollar problems or worse. This is why many say it isn't a entry level. It's can I trust you with that risk.",
          "score": 2,
          "created_utc": "2026-01-23 20:46:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1b27n0",
          "author": "MoonElfAL",
          "text": "You have maybe four years of internship opportunities so utilize it. You need to apply for internships nationwide and even reach out to your school about 'work abroad' where you get to go to Germany or another country and work for a company for a semester. \n\nGet a part-time job at your schools IT help desk and by the time you graduate you will have also 5 years of help desk experience just leave off on the resume that it was part-time.",
          "score": 2,
          "created_utc": "2026-01-23 20:50:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1c5wud",
          "author": "Background-Slip8205",
          "text": "You spend 10 years learning AD, Windows, Linux, cisco switches/routers, firewalls, storage appliances, backup appliances, SQL, Oracle, Ansible, HyperV, ESXi, middleware, ticketing systems, monitoring and reporting tools, mainframe computing (if you're in the financial industry) ect, and how they all tie in and interact with each other. \n\nOnce you understand infrastructure as a whole and all the components that it makes up, then you're ready to be a competent security analyst.   Before that, you're just an idiot making bad decisions which causes either outages or pain and suffering for employees.",
          "score": 2,
          "created_utc": "2026-01-24 00:08:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1c7g64",
          "author": "Hospital-Sudden",
          "text": "This is the answer: You need to work doing support for 40-55k for 2-4 years, then sysadmin work for 65-80k for 3-5 years. You will need to study cybersecurity after work. Then you can start applying for entry level jobs in cybersecurity.",
          "score": 2,
          "created_utc": "2026-01-24 00:16:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o18u62e",
          "author": "cyberguy2369",
          "text": "\\- get a 4 yr degree in computer science, computer information systems, or cyber  \n\\- while you're in school (in person school) walk over to the IT dept of the university \"hi, I'm a cs student, what kind of opportunities are available? id really like to work and get some experience\"  \n\\- go to every lecture, meetup on campus involving tech. network with the speakers and other people there.   \n\\- get involved in the club's and organizations on campus that can also help you learn more, do more, and meet more people  \n\\- learn to balance life (school work, life, your mental and physical health)  \n\\- learn to be human.. talk (and get along) with all kinds of people in different kinds of situations  \n\\- learn to read a room and be humble.",
          "score": 4,
          "created_utc": "2026-01-23 14:41:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1amcw6",
              "author": "SKY-911-",
              "text": "My current path right now",
              "score": 1,
              "created_utc": "2026-01-23 19:35:50",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o18qgpk",
          "author": "NeverBeASlave24601",
          "text": "Try and get a part time job in helpdesk now. Their are graduate Cyber Security roles out there but the can be really competitive and you will need to have some experience and a few certs such as security+ to get a look in.",
          "score": 4,
          "created_utc": "2026-01-23 14:22:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o19qodr",
              "author": "capt3in",
              "text": "security + for graduate roles? 😭",
              "score": 1,
              "created_utc": "2026-01-23 17:11:08",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1aun04",
                  "author": "NeverBeASlave24601",
                  "text": "It would help you stand out. Thing about graduate jobs is that everyone applying has a degree, so may as well have something on top of that 😂\n\nAlso, if your already doing a cyber security degree it shouldn’t be too much of a push to get Security+",
                  "score": 1,
                  "created_utc": "2026-01-23 20:14:38",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1al7cz",
          "author": "HereSo-IDontGetFined",
          "text": "The truth is there's a lot of gatekeepers and greedy shortsighted corporations/business that don't want to invest in the young workforce no less pay them.\n\nThese industries have become more and more about nepotism and networking rather than building people up and giving those who check the boxes reasonable opportunity. \n\nI'm sure you'll find someone in the comments that will say something along the lines that's just the way it is, But no that's a b*******, It's the way they have made it Because they value short-term profits over longevity.\n\nHopefully in the future there will be laws enacted that will severely penalize nepotism and gatekeeping, and make it mandatory that entry level positions are available and make it illegal to require any experience for entry-level positions. And companies that do so should be fined 6 or 7 figures figures. Without such regulations potential employees have to go through the exhaustive humiliation ritual we call a job search. \n\nThere should only be an competency assessment in line to what is expected for entry level position.\n\nLooking through the comments all I see is essentially the paragraph version of, \"Wait your turn, be bullshitted, And then we'll let you in\". Bureaucracy and politics is so expensive to the GDP. 🤦🏽‍♂️",
          "score": 2,
          "created_utc": "2026-01-23 19:30:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1b0i8u",
              "author": "Guilty_Conflict6055",
              "text": "Oh buddy, if you think the legal system is gonna fix it, you’ll be waiting a long time. The best thing anyone can do for their career living in the US is move to Europe. Thats a half joke, but we live in a time where there is no middle class, no looking out for the working man, no “hard work pays off”. The rich control nearly all sectors of the job market, and the rich don’t like to share.",
              "score": 2,
              "created_utc": "2026-01-23 20:42:24",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1920y0",
          "author": "StatusFoundation5472",
          "text": "Well you know cybersecurity its such a wide field. IT cybersecurity, app cybersecurity, the list goes on. Check out [hackthebox.com](http://hackthebox.com) this is excellent preparatory ground and it will allow you to explore and gain experience in things in order to find out what you want to do. If you start doing impressive things people will notice at some point",
          "score": 1,
          "created_utc": "2026-01-23 15:19:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ahtqk",
          "author": "Nervous_Screen_8466",
          "text": "Masters degree worked.  \n\nThere are entry level certs. \n\nIt does help to know how shit works before breaking it for fun. ",
          "score": 1,
          "created_utc": "2026-01-23 19:14:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ar2y2",
          "author": "RefrigeratorOne8227",
          "text": "Some programs that I am aware of offer internships that can help you get the experience.  University of Michigan, Michigan State, and Augusta University have good internship programs.",
          "score": 1,
          "created_utc": "2026-01-23 19:57:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1asxlq",
          "author": "eNomineZerum",
          "text": "You gain experience along the way and realize that you can't secure that which you don't understand. You have 5 years before you graduate so here is what you do. \n\nYou work at your college help desk doing anything IT and tech related you can. Security workers deal with tickets and clients all the time so learn those skills now. \n\nWhile you are in college do your best to always learn and grow and jump on any opportunity you have. \n\nTake summer jobs doing any IT work possible such as working help desk or in turning for companies. \n\nBuild strong connections that will enable you to have a security job lined up more easily.",
          "score": 1,
          "created_utc": "2026-01-23 20:06:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1atkyk",
          "author": "sporkl_l",
          "text": "Lie on your resume.",
          "score": 1,
          "created_utc": "2026-01-23 20:09:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1azn13",
          "author": "mrbiggbrain",
          "text": "Step 1: Become a CybcerSecurity Specialist. \n\nStep 0: Learn about CyberSecurity. \n\nStep -1: Have a job where you can learn about CybcerSecurity\n\nStep -2: Become more senior in general IT\n\nStep -3: Get an IT Job, Probably Helpdesk\n\nStep -4: Get a Job that feeds well into IT (Retail, Customer Service, Call Centers, Hospitality)\n\nStep -5: Develop Soft Skills that lead to feeder jobs. \n\nStep -6: Interact with People, Develop relationships, read about communication, write, join clubs.",
          "score": 1,
          "created_utc": "2026-01-23 20:38:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1b0t4g",
          "author": "No-Main3801",
          "text": " Start at the help desk and work your way up",
          "score": 1,
          "created_utc": "2026-01-23 20:43:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1b49zk",
          "author": "Nonaveragemonkey",
          "text": "Starting in IT first.",
          "score": 1,
          "created_utc": "2026-01-23 21:00:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1bbj4l",
          "author": "jmp_rsp",
          "text": "Keep working on it. Keep doing certs. Keep working on your own side projects. \n\nMaking the breakthrough is not easy.",
          "score": 1,
          "created_utc": "2026-01-23 21:34:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1cf4b5",
          "author": "Tiny-Purple-9884",
          "text": "Join a club that does cybersecurity competitions like CCDC, Hivestorm and CPTC or make one and do CCDC, Hivestorm ETC (Alot of these competitions are free!). After that just network in your community and try to get an internship that way.",
          "score": 1,
          "created_utc": "2026-01-24 00:58:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1cmhw3",
          "author": "drakhan2002",
          "text": "Work your way into IT... in 3 to 5 years, make the jump to cyber",
          "score": 1,
          "created_utc": "2026-01-24 01:41:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ctfgv",
          "author": "koojlauj11",
          "text": "IT in general is pretty competitive. Try getting an internship early on and keep shooting for them at companies you would like to work for. Create a LinkedIn and find mentors early, build connections and network with professionals. Build connections with your college friends, you never know who they'll be and who they'll know.\n\nHere is a roadmap to kind of have an outlook. Also, has resources.\n\n[https://roadmap.sh/cyber-security](https://roadmap.sh/cyber-security)\n\nFollow those in the community who are in it to get updates and continual learning. I follow these two.\n\n[https://www.instagram.com/cybersecuritygirl/](https://www.instagram.com/cybersecuritygirl/)\n\n[https://www.instagram.com/cyberjasbytes/](https://www.instagram.com/cyberjasbytes/)\n\nJoin tech organizations.",
          "score": 1,
          "created_utc": "2026-01-24 02:21:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o18us6o",
          "author": "Previous_Shopping361",
          "text": "Build experience and do relevant stuff it's not an entry level thing as dressed up by most folks..",
          "score": 0,
          "created_utc": "2026-01-23 14:44:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o193sa0",
          "author": "TheOGCyber",
          "text": "Cybersecurity requires 3-5 years of general IT/networking experience before they'll even look at your resume.",
          "score": 0,
          "created_utc": "2026-01-23 15:27:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o19tc2d",
          "author": "Character_Choice5728",
          "text": "there are some opportunities for internship!",
          "score": 0,
          "created_utc": "2026-01-23 17:23:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o19tf7j",
              "author": "Character_Choice5728",
              "text": "[https://bah.wd1.myworkdayjobs.com/en-US/bah\\_jobs/job/McLean-VA/University--2026-Summer-Games-Cybersecurity-Intern\\_R0225360](https://bah.wd1.myworkdayjobs.com/en-US/bah_jobs/job/McLean-VA/University--2026-Summer-Games-Cybersecurity-Intern_R0225360) !!",
              "score": 1,
              "created_utc": "2026-01-23 17:24:18",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o19tiub",
              "author": "Character_Choice5728",
              "text": "and even more",
              "score": 1,
              "created_utc": "2026-01-23 17:24:47",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o19xk2w",
          "author": "Ok-Success-7067",
          "text": "The best way is to get an internship with a company and hope they want to hire you after the internship is over.\n\nOtherwise, you need a good reference from someone that already works there, who can recommend you to the hiring manager.",
          "score": 0,
          "created_utc": "2026-01-23 17:43:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1a16em",
          "author": "Digimon54321",
          "text": "Cyber Security is not entry level at all, whoever told you that has scammed you. You need to know the basics of computers, OSs, how they operate, then networking, how everything communicates, then you learn how to break those things and make them interact incorrectly, and in your favor. \nI started in help desk for 2.5 years, then went into sys admin for 3 years and as a 2 man IT team got to learn the cyber security portion of things and am studying it nearly full time while here as a sys admin.",
          "score": 0,
          "created_utc": "2026-01-23 17:59:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1b1i5l",
              "author": "MoonElfAL",
              "text": "I agree if you want a technical cybersecurity role, but I have seen people during my internship working in cybersecurity who got in with all types of degrees. The people who did more of the technical cybersecurity work did what you did with help desk.",
              "score": 1,
              "created_utc": "2026-01-23 20:47:07",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1a3744",
          "author": "Sqooky",
          "text": "IT/System Administration/Helpdesk -> NOC/Networking  -> SOC/Cybersecurity is the general recommended flow.\n\nThere are definitely strides you can make in between, like AD Admin -> Identity Security, Networking -> Firewall Admin, or IT consultant -> Security Architect, or QA Tester -> Pentester. There's a lot of roles that share a lot of the same responsibilities, just with more security oriented titles.\n\nThis is because there are a lot of people out there who think they know more than they do and have yet to get humbled. These often being the people who go from 0 experience in IT at all to pentest. There's a **lot** to learn about working in business that no one tells you in degree or certification programs. During my 5 years in enterprise, I learned pretty much nothing technical, but I learned a lot about playing the political game.",
          "score": 0,
          "created_utc": "2026-01-23 18:08:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1a9f1v",
          "author": "Evening-Advance-7832",
          "text": "With AI now doing all the coding and can handle tasks it's harder  SMH",
          "score": 0,
          "created_utc": "2026-01-23 18:36:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1950u4",
          "author": "reneg30",
          "text": "You need to start at helpdesk, then sysadmin/network admin",
          "score": -1,
          "created_utc": "2026-01-23 15:33:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1957xp",
          "author": "BankingAnon",
          "text": "Go IT first",
          "score": -1,
          "created_utc": "2026-01-23 15:34:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o19xok6",
          "author": "S4LTYSgt",
          "text": "Like I did… I was a Network Engineer for 3 years. Did everything from installing routers, switches, firewalls, AP/wireless around college campuses to network expansions to working for F5 where I learned load balancing and deep packet analysis. \n\nThen I become a Sys Admin (4 years), I learned infrastructure migrations, cloud migrations and hybrid sys admin (on-prem, AWS cloud). Then I became a Security Engineer where I implemented cybersecurity solutions on the infrastructure and cloud, automation and systems hardening techniques on linux/windows machines, azure and aws. \n\nNow im transitioning into GRC as a L2 Lead. Point is I was able to do Security Engineering at the same company I was a sys admin because I was good at my job and took initiative by owning my system, taking interest and implementing security and eventually filled a role that was vacant by doing a lateral shift in responsibility . Security Engineer didnt exist for us. But I was able to train a Jr to take my role and I essentially created a role for my self lol. Pretty awesome. \n\nLearn the basics. How can you secure something you dont have experience building, breaking and maintaining?",
          "score": -1,
          "created_utc": "2026-01-23 17:43:56",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qhuu4u",
      "title": "Tiktok and Oracle",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qhuu4u/tiktok_and_oracle/",
      "author": "Donxki",
      "created_utc": "2026-01-20 07:41:15",
      "score": 16,
      "num_comments": 23,
      "upvote_ratio": 0.94,
      "text": "I'm not even sure if this the right place to post about this but on Jan 22nd, Tiktok is gonna give partial ownership to Oracle.\n\n Meaning for American users, oracle will have access to their data to feed into whatever ai machine or whatever they do with the data.\n\n I kinda find it a bit concerning, since Oracle has worked with this administration and they are very open to basically spying on you. \n\nIs this an actual concern and should I delete my tiktok account? Is the data that Oracle will have access to like i dont know concerning in any way? ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qhuu4u/tiktok_and_oracle/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o0mvzwx",
          "author": "Medium-Potential-348",
          "text": "I deleted my account when the announcement was made to try and save myself while I still can. Idk if they will have my data as I deleted my whole account, but they at least won’t have anything up-to-date and current if they do, which is better than nothing.\n\n(Initial announcement was like 3-4 months ago, 2nd announcement was like 1-2 months ago, and then this announcement which is pretty much the official Oracle is moving into the data now announcement)",
          "score": 7,
          "created_utc": "2026-01-20 08:41:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0n6my1",
          "author": "zpollack34",
          "text": "Oracle has essentially been an arm of the CIA since before its inception as oracle. But interesting you were ok with the spyware when “China” owned it.\n\nWith any social media, assume your data is compromised by the state. Then proceed how you feel comfortable. If you don’t care, cool keep using it how you’d like. If you do care, you probably should clean up even more of your internet footprint.",
          "score": 5,
          "created_utc": "2026-01-20 10:21:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0nmkey",
          "author": "LordNikon2600",
          "text": "Oracle has a partnership with Palantir.. so guess what comes next.",
          "score": 5,
          "created_utc": "2026-01-20 12:30:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1a0mp2",
              "author": "snoopfrogg42069",
              "text": "Broo whaaat what is happening 🫠",
              "score": 1,
              "created_utc": "2026-01-23 17:57:16",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0owqvt",
          "author": "fedput",
          "text": "I would be more comfortable with the Chinese government owning my data than Larry Ellison.",
          "score": 5,
          "created_utc": "2026-01-20 16:34:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0pguwy",
              "author": "Medium-Potential-348",
              "text": "Literally.",
              "score": 1,
              "created_utc": "2026-01-20 18:07:11",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0q9o6o",
                  "author": "fedput",
                  "text": "I do not know any acronym for \"China\", but there is a well known one for Oracle",
                  "score": 2,
                  "created_utc": "2026-01-20 20:18:38",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0n89id",
          "author": "nico851",
          "text": "You're fine with China spying on you, but have issues if it's oracle? Weird....",
          "score": 4,
          "created_utc": "2026-01-20 10:36:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0nmq9f",
              "author": "LordNikon2600",
              "text": "China won't fly across the world to arrest me for calling their president Pooh... the USA does and will if you speak negatively about their leader.",
              "score": 4,
              "created_utc": "2026-01-20 12:32:04",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0ot13v",
                  "author": "Dave5876",
                  "text": "Chinese \"police stations\" operate in North America",
                  "score": 0,
                  "created_utc": "2026-01-20 16:17:12",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o0nvt1i",
              "author": "Miserable-Yak-5564",
              "text": "This kind of thinking is why America deserves exactly whatever it gets. This china bullshit is old and antiquated. Multiple American companies are publicly telling you they want a surveillance state while actively pursuing the intellectual properties that allow them to… but china. Just blatant stupidity.",
              "score": 1,
              "created_utc": "2026-01-20 13:29:20",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0ny0cr",
                  "author": "nico851",
                  "text": "I don't care either way and never used TikTok because it's cancer.\n\nThey take your data, no matter who the owner is. I find it weird that people now want to delete TikTok, as it's ownership changed.",
                  "score": 2,
                  "created_utc": "2026-01-20 13:41:49",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0ok6gk",
          "author": "Highfivesghost",
          "text": "Aren’t there restrictions on what they can do with the data. It’s not like they can just do whatever with it",
          "score": 1,
          "created_utc": "2026-01-20 15:36:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0pgtfy",
              "author": "Medium-Potential-348",
              "text": "That’s a good one bro 😂😂😂😂😂😂",
              "score": 2,
              "created_utc": "2026-01-20 18:06:59",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0tz1ck",
          "author": "_Adagio_B",
          "text": "last day on TIkTok :/",
          "score": 1,
          "created_utc": "2026-01-21 10:29:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0umk7q",
          "author": "Tall-Pianist-935",
          "text": "Gotta fund those campaigns.",
          "score": 1,
          "created_utc": "2026-01-21 13:22:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0vn3ao",
          "author": "Tall-Pianist-935",
          "text": "Delete the account if you were posting",
          "score": 1,
          "created_utc": "2026-01-21 16:23:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0vnbs7",
          "author": "Standard_Mirror_7326",
          "text": "What is the consensus?  Do I go in there and manually delete all my thousands of comments (2 clicks one at a time) and then deactive/delete my account?  Is it even worth it? too late?",
          "score": 1,
          "created_utc": "2026-01-21 16:24:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o10tums",
          "author": "Old_Cheesecake_2229",
          "text": "see, i’d keep an eye on permissions and maybe try a security tool like LayerX Security, since these can block data leaks when using apps like tiktok, don’t forget to review your settings often",
          "score": 1,
          "created_utc": "2026-01-22 10:18:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1a0vm1",
          "author": "brightlightabove10",
          "text": "I just got the request for acceptance of the new terms and conditions and instead of accepting, said my final goodbyes and deleted the app. 😢 the era has ended",
          "score": 1,
          "created_utc": "2026-01-23 17:58:22",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qffngu",
      "title": "Minor in cybersecurity or a masters when I graduate?",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qffngu/minor_in_cybersecurity_or_a_masters_when_i/",
      "author": "ActualRevolution3732",
      "created_utc": "2026-01-17 15:11:47",
      "score": 11,
      "num_comments": 11,
      "upvote_ratio": 0.87,
      "text": "I am a computer science major and I would like to follow a cybersecurity path. My college is not very well known so I was thinking to finish my major and apply to a good masters in cybersecurity when I graduate. Or is it better to extend my graduation for 1 more year and do a minor in cybersecurity? \n\nMy college also offers an it, cybersecurity major, I could change it. ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qffngu/minor_in_cybersecurity_or_a_masters_when_i/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o04d35z",
          "author": "TheOGCyber",
          "text": "It's better to get a job and get some experience.\n\nExperience >>>>>>>>>>>>>>>>>>>>>>>>>>> Degrees",
          "score": 11,
          "created_utc": "2026-01-17 15:42:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0c2o93",
              "author": "Hot-Wave-8059",
              "text": "10+ years in the biz, and I can attest this statement!",
              "score": 1,
              "created_utc": "2026-01-18 18:40:39",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o05ias7",
          "author": "dahra8888",
          "text": "A minor won't have any impact and a CompSci BS is generally stronger than a Cybersec BS.\n\nA Masters degree without experience often ends in the catch-22 of being over educated for entry-level help desk but no real-world experience to get into a cyber role.\n\nI'd recommend trying to get an internship even if it delays your graduation. That will set you up for post-grad success much more than any other option. If that doesn't pan out, just keep your current degree and try to find entry-level IT or Dev work.",
          "score": 3,
          "created_utc": "2026-01-17 18:55:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0abb7w",
          "author": "angela_liesel12",
          "text": "If you’re a CS major aiming for cybersecurity, I’d prioritize getting real security experience over chasing “more school” as a default.\n\n\n\nGeneral rule:\n\n\n\nMinor in cyber = nice, but usually not what gets you hired.\n\n\n\nMaster’s = worth it only if (a) you can get it funded/cheap, (b) you want a niche (security research/ML, cryptography, policy, etc.), or (c) you’re missing internship options and need time to build a portfolio + recruit again.\n\n\n\nWhat I’d do in your shoes:\n\n\n\n1) Try to land a security internship / co-op first.\n\nThat + CS degree beats CS + cyber minor with no experience almost every time.\n\n\n\n2) Pick a direction + build proof. (One track is enough)\n\n\n\nBlue team: homelab + SIEM (Splunk/Elastic), detection writeups, incident reports\n\n\n\nAppSec: OWASP Top 10, bug bounties, secure code projects, SAST/DAST tooling\n\n\n\nCloud security: AWS/Azure basics + IAM labs + Terraform + writeups\n\n\n\n3) Add 1–2 “signal boosters” instead of a whole degree:\n\nSecurity+ (entry), CCNA (networking), AZ-900/AWS CCP (cloud basics), eJPT/PNPT (hands-on) — pick what matches your track.\n\n\n\nSo: minor or master’s?\n\n\n\nIf delaying graduation 1 year is mainly for a minor, I’d probably not do it—use that year to intern + build.\n\n\n\nIf you can get a good master’s funded and use it to secure internships + specialize, then yes, master’s can be worth it.",
          "score": 3,
          "created_utc": "2026-01-18 13:22:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o07x1l4",
          "author": "Background-Slip8205",
          "text": "There's literally no reason to get a masters in IT, especially if your B.S. is in it.  Cyber is a bit of a waste too, because it's a 5-10+ year experience (as a sysadmin, not helpdesk) position.  \n\nIf you enjoy it, go for it, but it's not going to help you in any way, anything you learn will be outdated and useless knowledge.  Anything you do remember that's helpful is common sense that you would already know or learn simply by working in the industry.  \n\nDo not change your major.  You'd only be setting yourself up for failure instead of success.  Security is about being a jack of all trades, have knowledge in a broad scope of areas.  You don't learn that siloing your college education.",
          "score": 1,
          "created_utc": "2026-01-18 02:18:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o07xtn9",
          "author": "SirKnightGentleman",
          "text": "I am doing my Master's in Cyber, and to be honest, I think cyber should not be a Master's. If I could choose again, I would do a minor; one year is enough to fill you with some basics. I would also recommend getting a job while doing it. It's tough, but like most people said here, the experience is much more valuable, and you learn much more.",
          "score": 1,
          "created_utc": "2026-01-18 02:22:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o08lu6d",
          "author": "datOEsigmagrindlife",
          "text": "Get a master's later on in your career.\n\nI actually think it's detrimental to have it before you're working in the field as the jobs you're qualified for will make the assumption you're overqualified and you'll leave as soon as something better comes along.\n\nA CompSci BSc is completely fine as a new graduate trying to enter the field, no job expects you to have a master's.\n\nAnd honestly a master's in cyber doesn't carry a lot of weight or credibility in the field.\n\nI'm in my 40s and just completed my master's, only now I feel that it adds a bit more value to my profile along with experience.",
          "score": 1,
          "created_utc": "2026-01-18 04:43:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o09er1k",
          "author": "Successful-Escape-74",
          "text": "Join U.S. Army as a signal officer and that will get you the experience and clearance you need to work in the field.",
          "score": 1,
          "created_utc": "2026-01-18 08:42:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0adamt",
          "author": "Tall-Pianist-935",
          "text": "Get the masters from the better program",
          "score": 1,
          "created_utc": "2026-01-18 13:34:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0fagls",
          "author": "Primary_Excuse_7183",
          "text": "Get a job gain some experience then go back and get the masters(ideally get your company to pay for it). i give that advice to any college student i talk to. You’re substantially more valuable that way.",
          "score": 1,
          "created_utc": "2026-01-19 04:53:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0kcfu0",
          "author": "Far_Television9131",
          "text": "You are much better off getting a Cyber certification than spending anymore time getting a masters or minor. Only masters program I think is really beneficial for a Cyber career would be an MBA if you are going after a CIO/CISO role down the road. Otherwise, get certed.",
          "score": 1,
          "created_utc": "2026-01-19 22:58:28",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qjinbp",
      "title": "Looking for jobs",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qjinbp/looking_for_jobs/",
      "author": "ANOSYNN",
      "created_utc": "2026-01-22 02:48:58",
      "score": 10,
      "num_comments": 16,
      "upvote_ratio": 0.82,
      "text": "I just graduated with a bachelors degree in cybersecurity at UTSA and I have no idea what jobs I should be looking for and how hard it will be to find a job with no experience. All I have is the degree. I’m working on some certifications already but I’d like to find some sort of job in tech to get some experience going. Any advice on getting my first job as soon as possible with no experience on my resume?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qjinbp/looking_for_jobs/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o0z9v87",
          "author": "RiskVector",
          "text": "Your best bet right now is to find a helpdesk job. Yes its going to suck and its not rewarding but you have no experience. It is a starting point. Majority of us started at helpdesk. That doesn't mean you cant or shouldn't apply for jobs that interest you but keep in mind how many people are applying for the same position who do have experience.\n\nIf you haven't done so already start a home lab. Get on YT, find some channels you like and follow along. Keep notes of everything you do. When you are doing a lab or doing something keep this in the back of your mind:\n\"If I land a technical interview, would I be able to do this?\"\n\nIts a process! You will get there!",
          "score": 5,
          "created_utc": "2026-01-22 03:00:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0zay8g",
              "author": "ANOSYNN",
              "text": "Do you know how fast I could find a help desk job? I keep seeing posts of people saying they can’t even get hired at help desk. Also what job posting platforms do you recommend? Thanks for replying!",
              "score": 1,
              "created_utc": "2026-01-22 03:06:32",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o124kmg",
                  "author": "RiskVector",
                  "text": "Yeah agreed! All of them! How fast can you land a helpdesk job? That depends on you really. Are you applying to one or two jobs a day or are you sending out 15, 20, 25 applications? You may think that 25 is a lot, but its not especially with LinkedIn has \"Easy Apply\" or what ever it is. \n\nif you get hit up by recruiters for entry level positions, stay away from them! You shouldn't need a recruiting service to land a helpdesk job, or a entry level soc job. They are generally bad, no benefits, no pto or very limited, no 401k.. etc.. stay away from recruiters! \n\nIf you are browsing LinkedIn and you see a job you like and are interested, re-write your resume specific to that job, write up a cover letter, and then go to the companies website and apply directly on the site.",
                  "score": 2,
                  "created_utc": "2026-01-22 15:14:23",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o125azx",
                  "author": "Slight_Manufacturer6",
                  "text": "All, but I have had the best luck with Indeed.",
                  "score": 1,
                  "created_utc": "2026-01-22 15:17:53",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o13subm",
                  "author": "ITguyBass",
                  "text": "The market is terrible for everyone, but for some companies is best to hire someone with less experience, because they will stay longer. If they hire someone overqualified, the person most certainly will move to a better position as soon as possible. Just separate some time daily to study and apply, like 3 hours each or as you feel more comfortable, because this is kinda your profession now. If you want to improve your chances, you can start studying the Comptia A+ and security+  certifications.",
                  "score": 1,
                  "created_utc": "2026-01-22 19:45:57",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o0zcflx",
                  "author": "SavannahPharaoh",
                  "text": "All of them lol. Keep in mind that many help desk jobs are remote so apply anywhere and everywhere.",
                  "score": 1,
                  "created_utc": "2026-01-22 03:15:09",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o11k4rs",
          "author": "Unlikely-Luck-5391",
          "text": "Don’t expect a pure “cybersecurity” role right away. Most people start in help desk, IT support, SOC tier 1, NOC, or junior sysadmin roles and move into security later.\n\nApply now while doing certs. Build small labs (AD, basic networking, logs, TryHackMe/HTB) and list those as experience. Tailor your resume and don’t wait for everything to be perfect. It’s hard, but doable.",
          "score": 3,
          "created_utc": "2026-01-22 13:29:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o119z7c",
          "author": "mandevillelove",
          "text": "target entry- level IT/SOC roles, showcase labs and apply broadly while finishing certs.",
          "score": 1,
          "created_utc": "2026-01-22 12:27:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o12017i",
          "author": "cyberguy2369",
          "text": "a few questions:  \n\\- I'm guessing you did the UTSA online program? that would give you a lot of free time, were you working at all during the program? what kind of work was it?   \n\\- what kind of jobs are you applying to? how are you finding those jobs to apply to? (just linkedin? )  \n\\- I'm assuming you're in the US, are you a citizen of the us? (it matters in the kinds of jobs you should be applying to)  \n\\- are you networking (in person) at all?",
          "score": 1,
          "created_utc": "2026-01-22 14:52:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o125nsq",
          "author": "Slight_Manufacturer6",
          "text": "Start by getting some experience. Ideally you should have gotten an intern while you were still in school, but since that opportunity has passed you can still volunteer your IT services at places like charitable organizations… like churches for example are always needing help.",
          "score": 1,
          "created_utc": "2026-01-22 15:19:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o12mn2x",
          "author": "nexeris_ops",
          "text": "Apply broadly to entry-level roles like IT support, SOC analyst, junior GRC, or NOC positions while finishing a cert like Security+, and focus your resume on labs, school projects, and hands-on work rather than “no experience.” Your first job doesn’t have to be pure cybersecurity, it just needs to get you close to systems, users, and security workflows.",
          "score": 1,
          "created_utc": "2026-01-22 16:37:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1383nx",
          "author": "Business-Progress-39",
          "text": "Customer service",
          "score": 1,
          "created_utc": "2026-01-22 18:13:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o13rswy",
          "author": "ITguyBass",
          "text": "In my experience, most of the Security team started as an entry-level support role, like helpdesk, deskside support, NOC or anything related to network. It is pretty rare to beggin straight on a security role, because you need to build some experience, and most of the managers don't think the graduation experience is enough. I don't know what you studied in depth, and I can't say it is not possible, but usually people start in those positions.\n\nSo maybe it's worth looking for those roles, and while you look, having some certifications will be a differentiator for yourself over the other candidates but in the end, the experience will come in handy more than you think. If you are able to work in a medium-big company you can steadly grown there, like it was for me, but also a small business will allow you to grow in a different way, like you will mostly have a lot of experience in many areas, you will have to be technical support, sysadmin, Network guy, the \"security guy\" and etc, but it comes with a lot of experience in many areas.\n\nIn the end, try to start somewhere, once you are working, it will be easier to find for best positions as you grow.",
          "score": 1,
          "created_utc": "2026-01-22 19:41:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0zhof3",
          "author": "Chow_UwU",
          "text": "Wow, I actually just applied for UTSA's cybersecurity masters program... I'm intrigued to hear about a new grad from there having troubles looking for a job. Honestly, why not just get your masters degree - seriously asking.",
          "score": 1,
          "created_utc": "2026-01-22 03:46:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1055b9",
          "author": "S4LTYSgt",
          "text": "Harsh reality. For every 100 applications you do, 1 employer will review your application and of that 1 employer its basically a gamble whether you will get an interview or not. My advice. Apply to 1000 roles. Start from local zip code, then branch out to all over the state, then branch out all over the country.",
          "score": 0,
          "created_utc": "2026-01-22 06:33:14",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qhmfhy",
      "title": "Someone is using my email to create lots of support tickets",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qhmfhy/someone_is_using_my_email_to_create_lots_of/",
      "author": "Upstairs_Ad_8580",
      "created_utc": "2026-01-20 00:51:11",
      "score": 4,
      "num_comments": 6,
      "upvote_ratio": 0.83,
      "text": "Someone is seemingsly using my email to spam create support tickets with legitimate companies. With content like \"LEGAL NOTICE FROM State Of Louisiana FOR Sega Sammy 79154037\" or \"39595895 FREE DISCORD NITRO!!!!\". With nordvpn, wattpad, zendesk, datadog, capcom, some kind of certification from the LA government.\n\nI have verified that these email originate from the legit domains that should be secure.\n\nI am 99% sure that they are just entering my email and don't actually have access to my account. There are also no emails being sent from my account. Any way to stop this? It's annoying to get my inbox filled with automatic replies.\n\nNote: it seems like MOST support tickets are created for organizations that use zendesk, given the apex domain and subdomains, but kahoot is also just in there from their apex domain.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qhmfhy/someone_is_using_my_email_to_create_lots_of/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o0mbpdq",
          "author": "BluetieInc",
          "text": "Unfortunately this sounds like a mail bomb attack.  Someone inundates your inbox with garbage so you are too busy trying to manage the garbage that you don’t see that they have accessed your financial accounts and started siphoning money away.  I’ve seen this far too many times.  Change your email password. Notify any financial institutions that are linked to your affected email. Check for mail forwarding or rules you didn’t create.  Depending on your email provider, force logout of all sessions and enable MFA.  This has potential to be very serious so do not delay.",
          "score": 5,
          "created_utc": "2026-01-20 05:46:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0lirgz",
          "author": "Dismal_Structure_514",
          "text": "\nThis is most likely email address abuse rather than an actual account compromise. Someone is entering your email into public support/contact forms (especially Zendesk-based ones), which triggers automatic acknowledgement emails from legitimate domains. Since no emails are being sent from your account and there are no login alerts, your email itself isn’t breached. Unfortunately there’s no universal way to stop people from typing your address into forms, but you can mitigate it by setting up inbox filters for common Zendesk headers or sender patterns, replying “wrong email / unsubscribe” on tickets (many systems stop notifications after that), and reporting the issue to Zendesk abuse/support so they can suppress it on their end. Annoying, but generally harmless unless you start seeing actual login attempts or password reset emails.",
          "score": 2,
          "created_utc": "2026-01-20 02:47:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0p868a",
          "author": "nexeris_ops",
          "text": "This is almost certainly support form abuse, not an account breach. Someone is just entering your email into public ticket forms (Zendesk especially).\n\nThere’s no universal fix, but you can auto-filter/label support confirmations, ask repeat companies to block your email from ticket creation, and use email aliases or plus-addressing going forward. Annoying, but low risk if no outbound emails or resets are happening.",
          "score": 1,
          "created_utc": "2026-01-20 17:27:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0pzw43",
          "author": "Avehdreader",
          "text": "What a pain. This may be even more of one but have you thought about deleting that account entirely? Yes, you would need to update with legitimate businesses etc but I did that a couple of years ago when I got rid of Comcast (although not for the same reasons) I sorted my messages by sender and went through my password manager logins to see what companies and individuals I would need to update once I set up a new one, but since I’ve done that I haven’t had any problems.",
          "score": 1,
          "created_utc": "2026-01-20 19:33:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0uu3fx",
          "author": "Accomplished_Sir_660",
          "text": "If those emails are in your sent items folder (or have been deleted from) then you have much larger issues on your hand.  Follow BluetieInc advice ASAP.",
          "score": 1,
          "created_utc": "2026-01-21 14:04:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o10vgun",
          "author": "LingonberryHour6055",
          "text": "well, seen this pattern rear up a lot with open support forms especially with platforms running zendesk or similar the core issue is anyone can punch in your email and you get all the noise it helps to create mail filters fast but for web side headaches i would suggest trying a browser extension like LayerX Security since it can help block shady or repetitive web actions that lead to these ticket floods for what it’s worth you could also reach out to zendesk support with a sample and see if they’ll suppress your email but don’t hold your breath inbox rules usually work best for the short term if you see anything more personal than ticket spam then reevaluate",
          "score": 1,
          "created_utc": "2026-01-22 10:32:44",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qhgt5p",
      "title": "apt install opsec",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qhgt5p/apt_install_opsec/",
      "author": "shesleli2313",
      "created_utc": "2026-01-19 21:08:15",
      "score": 4,
      "num_comments": 3,
      "upvote_ratio": 0.7,
      "text": "how did y'all learn opsec? in general",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qhgt5p/apt_install_opsec/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o0ncten",
          "author": "Immediate-Hour-6848",
          "text": "privacyguides, techlore, etc all have great resources to learn how to effectively threat model and then the specific changes you need to make based on said threat model\n\nthe foundational part of opsec is the threat modeling part, and knowing what tools, resources, etc to use and what changes to make based on your threat model\n\n[https://www.youtube.com/watch?v=2qxVpCfgnaE&list=PL3KeV6Ui\\_4CayDGHw64OFXEPHgXLkrtJO](https://www.youtube.com/watch?v=2qxVpCfgnaE&list=PL3KeV6Ui_4CayDGHw64OFXEPHgXLkrtJO) \\- this is a great free guide as well",
          "score": 1,
          "created_utc": "2026-01-20 11:16:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ptvdx",
          "author": "TraceHuntLabs",
          "text": "Hi there, if you are looking for opsec resources specific for ethical hacking / red teaming, we are providing labs that point out mistakes in order to learn and improve opsec during your assessments. Check it out at [tracehunt.com](http://tracehunt.com)",
          "score": 1,
          "created_utc": "2026-01-20 19:05:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o10rlw4",
          "author": "Confident-Quail-946",
          "text": "well, i watched youtube and tested things, maybe try layerx security or others for browser safety, easy to use and helps with those weird links you get sometimes",
          "score": 1,
          "created_utc": "2026-01-22 09:57:40",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qjw7b8",
      "title": "Looking for Udemy course or youtube tutorial recommendations that match my exact pentesting lab setup",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qjw7b8/looking_for_udemy_course_or_youtube_tutorial/",
      "author": "Anonymous36513",
      "created_utc": "2026-01-22 14:38:21",
      "score": 4,
      "num_comments": 1,
      "upvote_ratio": 0.83,
      "text": "Does anyone know a course that uses a similar setup (Kali + Hyper‑V + vulnerable VMs(I have a ubuntu and 3 windows VMs) + Metasploit/Nessus/Nmap(zenmap)) etc?\nI want something that mirrors the environment I’m already using so I can practice more effectively. I have the Cybersecurity course this semester but I am not understanding anything from teacher's lectures.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qjw7b8/looking_for_udemy_course_or_youtube_tutorial/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o122f81",
          "author": "Separate_Marzipan976",
          "text": "you can get everything on youtube   \nstep 1 - ask chatgpt list  \nstep 2 - ask each topics on youtube",
          "score": 1,
          "created_utc": "2026-01-22 15:04:01",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qfcbf8",
      "title": "Should i explore cyber security rn or wait till time?",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qfcbf8/should_i_explore_cyber_security_rn_or_wait_till/",
      "author": "anonymous_redditer07",
      "created_utc": "2026-01-17 12:45:07",
      "score": 3,
      "num_comments": 1,
      "upvote_ratio": 0.67,
      "text": "My college has a cyber security workshop starting tomorrow. I had initially planned on exploring this field before joining my bachelors, but got caught up due to some problems and got overwhelmed with all the assignments and report. Idk if i should start exploring from next semester or just join the workshop tomorrow because I don't know much about this field also I might know nothing.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qfcbf8/should_i_explore_cyber_security_rn_or_wait_till/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o03m0se",
          "author": "aakashra0",
          "text": "Yes, join & explore it.\nIt,s a wide field explore & learn as per your interest, skip the assignments & reports for now.",
          "score": 1,
          "created_utc": "2026-01-17 13:16:22",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qhcdeg",
      "title": "Old unused instagram account, can’t get in and keep getting password reset emails.",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qhcdeg/old_unused_instagram_account_cant_get_in_and_keep/",
      "author": "Asleep_Algae2827",
      "created_utc": "2026-01-19 18:30:23",
      "score": 3,
      "num_comments": 2,
      "upvote_ratio": 1.0,
      "text": "So I must have opened an instagram account I never used about 10 years ago, because the profile exists with my name on it and I am now getting about 20 emails a day to reset my password from people trying to access it. I currently have a different instagram account with the same email I am getting password reset emails to for the other account. The old account has no posts, no profile pic and 1 friend. However, I have tried to add that account, tried to reset my password with texts/emails/codes and nothing works. It will send me a code to enter it and after I enter it nothing happens, same with all the other methods. And to clarify, I am doing this in the app and not from the password reset emails. Why can't I get into this old account, am I doomed to just get password reset emails from hackers all day every day?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qhcdeg/old_unused_instagram_account_cant_get_in_and_keep/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o0j2fjn",
          "author": "eric16lee",
          "text": "This is a question better suited for an Instagram sub rather than cybersecurity. It likely means your email address and password combo were leaked in a data breach. Bad actors use that info to try to gain access to hundreds of accounts.\n\nMake sure you are using unique and randomly generated passwords for every site with 2FA on everything.\n\nRemember, only Instagram support can help you. EVERY person that contacts you here via DM offering to help or hack the account back is just an account recovery scammer looking to profit off of your situation.",
          "score": 1,
          "created_utc": "2026-01-19 19:17:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0oc5j7",
              "author": "AltruisticThought927",
              "text": "The current widespread trend is breaking into accounts that have had data breached to grab more data about the user that is fed into the buyable databases used for surveillance. \n\nVery profitable.",
              "score": 1,
              "created_utc": "2026-01-20 14:56:31",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qkdetf",
      "title": "Unknown email appeared in autofill",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qkdetf/unknown_email_appeared_in_autofill/",
      "author": "RingAdmirable4757",
      "created_utc": "2026-01-23 01:40:45",
      "score": 3,
      "num_comments": 8,
      "upvote_ratio": 0.81,
      "text": "As the title mentioned, when I was trving to sign in YouTube in my phone browser, not the app), my auto fill emails came up, but as shown in the image the first option in the list isnt an email that I recognise or have typed in before. Does anvone know what might've happened and what should I do? \n\nI have a password and never let anyone sign in anything before btw.\n\nIs this a potential breach risk in my device? ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qkdetf/unknown_email_appeared_in_autofill/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o165o5h",
          "author": "MerpoB",
          "text": "Image?",
          "score": 1,
          "created_utc": "2026-01-23 03:04:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1663bf",
              "author": "RingAdmirable4757",
              "text": "I couldn't seem to insert any image when creating this post",
              "score": 1,
              "created_utc": "2026-01-23 03:06:50",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o17y785",
          "author": "nakfil",
          "text": "You may have been logged into your browser profile on another device that someone else has access to. Log out all other sessions to be safe and change your password and make sure you are using 2FA.",
          "score": 1,
          "created_utc": "2026-01-23 11:27:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o18zofd",
              "author": "saltyachillea",
              "text": "I believe there re limitation to this? You need to ensure any recovery keys, and passkeys are reset all on previous devices. I would go into your google account and really spend some time on 3rd party access apps/services, and other devices, etc. You can also request copies of your own personal account information (very detailed), get this to look into. I’m not an IT professional, but know someone who has ongoing issues with their ex doing this. Also, what phone are you using? I’m going to assume this is android with edge on it?",
              "score": 1,
              "created_utc": "2026-01-23 15:08:26",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o19x1q5",
                  "author": "nakfil",
                  "text": "Yep, also good advice. Check all recovery information as well in the Google account.",
                  "score": 1,
                  "created_utc": "2026-01-23 17:41:03",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1cmstw",
                  "author": "RingAdmirable4757",
                  "text": "Im using a Samsung on Samsung internet browser",
                  "score": 1,
                  "created_utc": "2026-01-24 01:43:22",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qiyp8g",
      "title": "What’s the safest way to pay with PayPal on Android Samsung without exposing my real debit card details?",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qiyp8g/whats_the_safest_way_to_pay_with_paypal_on/",
      "author": "DowntownTrack2518",
      "created_utc": "2026-01-21 14:03:16",
      "score": 3,
      "num_comments": 3,
      "upvote_ratio": 0.81,
      "text": "I have a Samsung Android phone and I must pay using PayPal.\n\nI want to minimizing risk and not having to manually enter or expose my full debit card details if possible.\n\nAre there any safer alternatives?\n\nWhat’s the safest setup in this case, and what risks should I be aware of? ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qiyp8g/whats_the_safest_way_to_pay_with_paypal_on/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o0uum5g",
          "author": "mandevillelove",
          "text": "Link a virtual card or prepaid card to Paypal and enable 2FA - never share your real debit details directly.",
          "score": 2,
          "created_utc": "2026-01-21 14:07:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1a4lr3",
              "author": "DowntownTrack2518",
              "text": "Thanks! What if I link my bank account instead? Is it safe?",
              "score": 1,
              "created_utc": "2026-01-23 18:15:01",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o13d6yb",
          "author": "ITguyBass",
          "text": "The safest way to pay with PayPal on a Samsung Android phone is to use PayPal’s app with a virtual or tokenized payment method, so your real debit card is never shared with the merchant. Ideally, link a virtual card (PayPal Key if available, or a bank-issued virtual debit card) to your PayPal wallet and pay only through the official PayPal checkout. Merchants see only a PayPal token, not your card details, and you’re covered by PayPal’s fraud protection, at least for what they say. Enable 2FA, use biometric phone lock, and avoid entering card details directly on merchant sites to minimize risk.",
          "score": 1,
          "created_utc": "2026-01-22 18:35:48",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}