{
  "metadata": {
    "last_updated": "2026-02-13 09:09:58",
    "time_filter": "week",
    "subreddit": "CyberSecurityAdvice",
    "total_items": 20,
    "total_comments": 105,
    "file_size_bytes": 151294
  },
  "items": [
    {
      "id": "1qxonsr",
      "title": "Future cyber students save yourself",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qxonsr/future_cyber_students_save_yourself/",
      "author": "Key-Choice6421",
      "created_utc": "2026-02-06 17:52:57",
      "score": 118,
      "num_comments": 36,
      "upvote_ratio": 0.93,
      "text": "Cybersecurity sounds like such an amazing career choice on paper but the actual fight you have to go through to break in is insane.\n\nI’m on my 4th year of college and have heard literally every possible thing you could think of and nothing has worked, let alone even breaking into IT in general and this is coming from someone thats tangled around with computers since they were 3 years old now being 21.\n\nI have yet to be able to land an internship or a job being on my final year of schooling and I’ve done everything a student could possibly try to do to break in.\n\nGood ol’ help desk and support roles? - I tried applying for too many roles to count and every response is, “3+ years of experience needed, we only hire students enrolled at our school, we’ll get back to you (never do btw), bachelors needed” or all around just ghosted yet help desk is supposed to be the entry level point to dip your foot in the pool and build your way up right?\n\nProjects - I’ve done countless projects like Layer 2/ Layer 3 Switch configuration, setting up/using SIEMS, Active Directory and active attack simulations, Homelab setups, coding with python, creating a github to list all of my projects with screenshots + steps of how I did all of them, even created youtube videos in tutorials of how to do basic things needed for a cyber student in todays age. \n\nCertifications - I’ve gotten both my Security+ and AZ-900, yes AZ might be an entry-level cert but according to every person in cyber when I first started Security+ was supposed to be the holy grail to get a job in the field now its “not enough”. The $400 certification thats based around cybersecurity isn’t enough to get an entry job in cybersecurity? It makes no sense at all. \n\nNetworking - I’ve grown my LinkedIn for the past 2 years and have achieved getting +500 connections, contacting hiring managers/recruiters, reaching out to people in a position that I admire or even colleagues from school, posting about my projects or accomplishments and still nothing.\n\nAnd yet every day I hear “Don’t give up, once you get that first job you’ll be set after, Cyber isn’t an entry-level field, young people think it’s going to be simple”\n\nI 100% understand that it may not be simple but when students are breaking their necks to do everything possible to get even an internship in a field they signed up to take 4 years of schooling for + outside resources and networking of course I’m going to be upset if I can’t land a job. It’s years of wasted money and time that could’ve went to another field and at least almost guaranteed a career. At this point IT in general is almost on the path of becoming apart of the “useless degrees” category you’re warned about before you go into college. \n\nIts a continuous game of cat and mouse and is exactly why I say, if you’re an upcoming student or a current early student wanting to pursue cybersecurity save yourself while you still can. You’re in for a constant game of depression for years to come unless you get lucky.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qxonsr/future_cyber_students_save_yourself/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o3yr5rk",
          "author": "net_architect",
          "text": "think the most brutal part of cybersecurity isn’t the technical difficulty-it’s the misalignment between education and hiring reality.\nSchools sell cyber as “entry-level”, but the market treats it as a mid-career specialization. That gap is where most students get crushed.\nFrom what you describe, you didn’t “fail”. You did exactly what the system told you to do-projects, certs, homelabs, networking-and still hit a wall. That’s not on you.\nThe uncomfortable truth is that many people who eventually land cyber roles don’t enter through cyber at all. They come from sysadmin, networking, cloud ops, even non-IT roles where they slowly absorb trust and responsibility.\nIt doesn’t mean cybersecurity is useless. It means it’s badly marketed and poorly structured for newcomers.\nWhether you continue or pivot, just know this: your effort wasn’t wasted/but the path almost never looks like the one they advertise.",
          "score": 58,
          "created_utc": "2026-02-06 20:33:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3z8n4b",
              "author": "cyberguy2369",
              "text": "well said, I'm a director and manager of a small cyber security DFIR team, thats part of a bigger cyber group/company. \n\nIn my opinion, university \"cyber\" programs are focusing on the wrong things for entry level people. They are teaching the \"cool\" niche stuff.. but very little of the day to day common cyber aspects.. core networking, securing systems, securing networks.. log analytics. \n\nThats great you spent 3-4 yrs learning how to do malware reverse engineering.. but how many entry level positions are open for malware reverse engineering vs people that have a really strong foundational knowledge in secure programming, secure system building, and networking? These kinds of positions build your core and foundational knowledge you need to really get in the industry and more importantly STAY in the industry.. (not get laid off). This is where most people NEED to start. \n\nI say it in these channels over and over again.. getting a degree in CIS or CS isnt nearly as exciting but gives you all the knowledge you need to move into cyber OR 100 other technology directions.. Youre FAR more marketable in the cyber world and technology world in general with a degree in CIS or CS. You have a broad set of adaptable skills. \n\nOne other thing.. certs are great.. home labs are great.. but they are absolutely NOT the same as real world work experience.. and these days there is little to no excuse not to get some work experience while in school.. walk over to the university IT dept. \"hi am a Cyber/CS/CIS major.. I'm looking for opportunities to work and gain experience, what can I do? \".. do the same thing in your CS/CIS/Cyber dept. \n\nI can teach you the cyber aspect.. I cant, and dont have time to teach you how to work and interact in a real world office/work environment. how to stay on a schedule, multi-task, meet real deadlines with consequences.. take criticism.. present to people, work with others and have to do things you dont like or agree with bc your boss told you to do it. \n\nrealistically you are not going to work remotely straight out of school (you shouldn't, you need to be around other smart people you can learn from.. you cant do that through a zoom meeting)\n\n",
              "score": 17,
              "created_utc": "2026-02-06 22:00:43",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o41cngp",
                  "author": "net_architect",
                  "text": "This is exactly the part most students never get told early enough.\nCyber isn’t a starting point - it’s a concentration layer that sits on top of real operational experience. Universities market the “cool” parts because they sell, not because they hire.\nThe irony is that by skipping fundamentals (systems, networking, ops, logs), people actually delay their cyber careers instead of accelerating them.\nAnd you’re 100% right about work experience vs labs. Labs prove curiosity. Real environments prove trust. Hiring decisions are almost always about the second one.\nAppreciate you sharing this perspective — it’s the kind of comment that should be pinned for every incoming cyber student.",
                  "score": 10,
                  "created_utc": "2026-02-07 05:55:44",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o3yzyd4",
              "author": "the_biometric_kid",
              "text": "Worded perfectly!",
              "score": 3,
              "created_utc": "2026-02-06 21:17:36",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3z204g",
                  "author": "scooter950",
                  "text": "Agreed. \n\nAlso, as someone in cyber for 8 years now, it took me 6 yrs of IT/sys admin to get there.\n\nThe entry to cyber is closer to mid career experience. Think of it like this, at least on the blue team side. How can you translate or audit the security requirements and vulnerability fixes if you don't know the technical processes/configurations.",
                  "score": 7,
                  "created_utc": "2026-02-06 21:27:46",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o43yjfa",
              "author": "mrrandom2010",
              "text": "As someone who has 5+ years of full stack software development with two companies, is it realistic to get some certs, do some projects, and look for a mid level position? Or would it be a complete career restart? \n\nI completed the “Google Cybersecurity Professional” course through Coursera and I’m planning to get my S+ and others later. \n\nAny advice for someone who would be interested in a lateral move?",
              "score": 1,
              "created_utc": "2026-02-07 17:14:40",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4410rm",
                  "author": "net_architect",
                  "text": "Realistically, most people don’t jump straight into a mid-level pure cyber role, but many do land mid-level hybrid roles where security is part of the responsibility - and then converge fully into security from there. Certs help signal intent, but your leverage comes from translating your dev experience into security problems you’ve already solved (or caused 😄). That story matters more than the cert list.",
                  "score": 4,
                  "created_utc": "2026-02-07 17:26:58",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3xyjtl",
          "author": "Redditthr0wway",
          "text": "Im going to be honest, that is the case with the majority of industries today. We are in an employers market, there are more job seekers in the US than there are job openings, and many of those are ghost jobs. No career field is guaranteed and have their own barriers to entry which in some cases can be even worse than cyber. But honestly the biggest thing I am personally seeing in this field is people limiting themselves. I see so many people saying the same 3 roles over and over again. Cyber isn't that limited of a field. There are tons of different niches, industries and more that it belongs in. Some of those roles are also very much in need of knowledgeable people who understand their industry. Look at nuclear, there is a need for people with cyber knowledge there but a lack of people who actually understand that industry. Same with law enforcement, OT security I believe also needs people too. I know just as many people in college who get cyber internships as people who do not, many of these people aren't unicorns either, hell I know people in cyber who snagged interviews and eventually got the internship just because they sent a follow up email. ",
          "score": 20,
          "created_utc": "2026-02-06 18:14:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4as4ph",
              "author": "Anxious_Health1579",
              "text": "I’m saving this comment, not because I’m in cyber security, but because it’s a great change in perspective. I have to remind myself this since I’m trying to break into UX/Product Design but looking to set myself with design strategy and human factors.",
              "score": 2,
              "created_utc": "2026-02-08 19:01:05",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3y3nnc",
          "author": "DJSmithyy",
          "text": "Well I know it sounds like you are based in the US but the UK is similar in the sense of a degree isn’t going to just land a job. I did however get quite lucky that I found an internship doing cyber and now work for said company after my degree currently doing cybersecurity for them. This all stemmed from just putting 100% in when I was an intern to prove myself hence why they kept me on, that said most of my friends I went to university with most if not all I know have jobs in cybersecurity now within 2 years of graduating so don’t see it as a why am I not getting anything you just have to get that golden ticket and if worst comes to worst don’t go straight into cyber start lower and work your way in",
          "score": 6,
          "created_utc": "2026-02-06 18:38:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3xxy8b",
          "author": "Karbonatom",
          "text": "Networking is really important. I was able to break into Cyber from who I knew not what I knew. Its not guaranteed but it can help. Joining your local DEFCON group (DC(areacode)) is one avenue, looking for various conferences or meetings like the FBI's Infosec-conference, They do those local to your state. Also keep an eye out on Discord groups they can have sections that posts jobs etc.",
          "score": 15,
          "created_utc": "2026-02-06 18:11:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o41fq04",
              "author": "After_Sir3979",
              "text": "Does that mean it is still possible to break I to cyber from college.. Of course after searching for half a year ;)? ",
              "score": 3,
              "created_utc": "2026-02-07 06:21:50",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o432c7k",
          "author": "LordNikon2600",
          "text": "I been saying this, but always some gaslighter in here saying otherwise:",
          "score": 3,
          "created_utc": "2026-02-07 14:32:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3y9meg",
          "author": "Sc0nnie",
          "text": "The path to cybersecurity is to already be an experienced network engineer or sysadmin.  The idea of starting in security with no IT experience is wrongheaded.  You cannot do the job without these skills.",
          "score": 8,
          "created_utc": "2026-02-06 19:07:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3zrhce",
              "author": "Pookias",
              "text": "This just isn’t true for everyone. I’m doing pretty well in this field coming from accounting. Then again I work for a pretty great company that actually invests in the resources to train and hire young people at a fortune 100 level of investment. People can learn the technical stuff on the job. It’s the soft/interpersonal skills that the vast majority of IT professionals lack. One of the most skilled people I’ve ever met where I work is really hard to talk to when having him explain something.\n\nIt’s crazy, we have a whole sub team of cyber professionals that had no previous experience, but were ex-police officers so they have great investigative skills. But this subreddit will tell you they aren’t good enough because they didn’t do help desk for 10 years. lol",
              "score": 1,
              "created_utc": "2026-02-06 23:43:11",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o42k5q3",
                  "author": "Sc0nnie",
                  "text": "“People can learn the technical stuff on the job” is exactly what imposters say.  This is not a soft skills job.  Anyone that tells you that soft skills are more important than technical skills for a technical job is engaging in anti intellectualism.\n\nThe fact that you complain about the “most skilled” person on your team is “really hard to talk to when having him explain something” shows us that you both resent each other because you are not equipped for the job and he is being forced to carry you.",
                  "score": 3,
                  "created_utc": "2026-02-07 12:38:34",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3y8tve",
          "author": "Joy2b",
          "text": "Many universities don’t want to have good IT professionals teaching about IT infrastructure in a proper test lab.  \n\nThat’s expensive and sounds too much like a trade school anyway. \n\nThe Deans are trying to cover the mistake now.  Many schools are now rushing to fill in for the missing major by offering “cybersecurity” but without building up to it, they’re failing students. \n\nIf they don’t have the staff and gear to teach a CCNA prep class, they don’t have them to teach to a CCNP or other ethical hacker, or challenging cybersecurity assessments. They might not have a CISSP on staff at all.  Who’s going to develop curriculums that cover cybersecurity standards? \n\nFor years, most of the jobs for network administrators and systems administrators and helpdesks didn’t have a degree requirement because many schools refused to invest in providing the key skills for keeping essential infrastructure running. \n\nThe employment pipelines out of many schools are broken because they haven’t been investing in the staff or the industry connections.",
          "score": 4,
          "created_utc": "2026-02-06 19:03:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3z66uz",
          "author": "Astral-projekt",
          "text": "Start working for yourself. You don’t need anybody else to start working.",
          "score": 2,
          "created_utc": "2026-02-06 21:48:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3zamot",
              "author": "cyberguy2369",
              "text": "expecially in cyber.. starting to work for your self with no experience, no past performance, and no tech social network is nearly impossible. who is going to trust their business, their intellectual property, or anything else to someone that has never done it before. \n\ncyber is the easy part.. the legal aspects, the federal rules and standards, the business side of things.. thats the hard part. ",
              "score": 3,
              "created_utc": "2026-02-06 22:10:47",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3zb4vd",
                  "author": "Astral-projekt",
                  "text": "I meant more like volunteer to do consulting. I agree with the heart of what you’re saying but I’m saying going above and beyond merely applying for jobs with your basic application is going to get you leaps and bounds ahead. I personally started my own business and started freelancing this work before getting hired, so I think everyone’s results might vary, along with an individuals effort, in a very competitive field.",
                  "score": 2,
                  "created_utc": "2026-02-06 22:13:23",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3zdyig",
          "author": "zainzuhair9",
          "text": "This is so true 😢😢",
          "score": 2,
          "created_utc": "2026-02-06 22:28:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o43y9rv",
          "author": "mrrandom2010",
          "text": "As someone who has 5+ years of full stack software development with two companies, is it realistic to get some certs, do some projects, and look for a mid level position? Or would it be a complete career restart? \n\nI completed the “Google Cybersecurity Professional” course through Coursera and I’m planning to get my S+ and others later. \n\nAny advice for someone who would be interested in a lateral move?",
          "score": 1,
          "created_utc": "2026-02-07 17:13:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o44a3h3",
              "author": "cyberguy2369",
              "text": "midlevel position? probably not. you'll have to start at the entry level.. full stack dev is not the same skillset as most cyber jobs. so unless you have some real world experience with networking, windows system admin, linux admin you'll start at the entry level.. even though you have 5+ yrs of experience in full stack development you dont have the skillset required or the foundation required for mid level position. \n\nthis would be a complete restart. ",
              "score": 3,
              "created_utc": "2026-02-07 18:11:51",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4c4396",
          "author": "WannaCryy1",
          "text": "Let me save you from something you will hit as you progress further. \n\nI feel bad for you having to fight to break in, but let me tell you what happens if and when you do. \n\nSo you done all this fighting to break in, and your in, you will quickly find once you land that job. You will begin fighting to do said job, to keep said job, and to justify said jobs pay. \n\nCyber Security is a Cost Center, the work is invisible, if you are doing your job, that means nothing happens. You will constantly be on the chopping block. When money tightens, you are first on the list. \"What do they even do, but cost/spend money, and complain.\" \n\nYour actual job is to spend money, and tell people NO, both being a drain, as well as a Blocker to the money makers. You are not appreciated, you are not needed, you are not critical, you are forcefully annoying. \n\nAll this to say TLDR, you dont just fight to get in, you fight every single day of your career. To try and make people see and understand things they dont want to see and understand. Fighting to get in, is simply the start of what a life in this career is going to look like. So if fighting to break in, is proving too much, I can tell you for a fact, you are not going to enjoy the constant fighting that follows.",
          "score": 1,
          "created_utc": "2026-02-08 23:04:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ym7s9",
          "author": "bloolynxx",
          "text": "What if you just lie about having a bachelor’s? I don’t think they check your diploma anyway.",
          "score": 1,
          "created_utc": "2026-02-06 20:08:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3yphtk",
              "author": "cyberguy2369",
              "text": "There are lots of services now the check for you and provide services that check for businesses we’ve had to start checking because of all the lying. \n\nIt’s a huge liability for a business. If a business is brought into court over some kind of cyber incident or case and they find they have employees that lied and misrepresented themselves on resumes. It opens up a lot of liability basically if a company isn’t smart enough to find employees that lie they aren’t smart enough to protect their data either it looks very bad in court.\n\nIt can cost the company millions if they survive the lawsuit at all",
              "score": 4,
              "created_utc": "2026-02-06 20:25:16",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o40kxen",
          "author": "DrHerbotico",
          "text": "You didn't mention once that you've attempted to get your own clients...",
          "score": 0,
          "created_utc": "2026-02-07 02:40:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o42dcs1",
          "author": "PlasticOpen588",
          "text": "i just submitted my application, bro ",
          "score": 0,
          "created_utc": "2026-02-07 11:42:09",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r0d48a",
      "title": "digital footprint cleaner: my research",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1r0d48a/digital_footprint_cleaner_my_research/",
      "author": "sairas_purnil",
      "created_utc": "2026-02-09 19:02:10",
      "score": 37,
      "num_comments": 24,
      "upvote_ratio": 1.0,
      "text": "hi there! I’ve been trying to clean up my online footprint after discovering that several people-finder and data broker sites were publishing surprisingly detailed profiles about me, including past addresses and even family connections. and honestly, that rabbit hole led me to data removal services, which claim to automate opt-outs from dozens (or hundreds) of these sites instead of doing it manually one by one.\n\nafter realizing how many providers exist, I decided to put together a comparison table for my own research and figured it might be useful to others here as well. The table compares multiple data removal services across things like geographic coverage, number of brokers monitored, recurring removals, transparency, and general usability.\n(comparison block included below)\n\n\nPricing & value\n- OneRep: 5-day trial; $8.33/mo (1) or $15/mo (up to 6). Family = expert + custom removals; Individual = fully automated.\n- DeleteMe (Abine): subscription (mostly annual/multi-year); benchmark ~$129/yr (1); couple/multi-year options.\n- Incogni (Surfshark): standard $7.99/mo (annual); Unlimited $14.99/mo (annual); Family up to 5.\n- Optery: free- paid tiers; e.g. Extended $14.99/mo, Ultimate $24.99/mo; ultimate adds human support + custom removals\n\nCoverage (people-finder  or data broker sites)\n- OneRep: 310+ sites.\n- DeleteMe: claims 976 brokers (published list).\n- Incogni: 420+ sites + (unlimited) 2,000+ for custom removals.\n- Optery: plan-based 640+ (or 400+); plus 1,125+ total via custom requests (ultimate).\n\nOngoing scans & recurring removals\n- OneRep: monthly scans + ongoing removals; new brokers added.\n- deleteMe: ongoing service with recurring opt-outs; quarterly reports.\n- incogni: recurring removals.\n- Optery: monthly automated scans & removals.\n\nReporting & visibility\n- OneRep: monthly email reports.\n- DeleteMe: dashboard + reports; quarterly privacy reports.\n- Incogni: dashboard + regular reports.\n- Optery: progress/risk reporting; some plans include before/after screenshots; quarterly reports\n\nThis started as personal research, so I’m very open to feedback and your experience! If you think I missed any important providers or criteria, feel free to point it out. I’d love to refine this into something genuinely helpful for people trying to choose a service without getting overwhelmed",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1r0d48a/digital_footprint_cleaner_my_research/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o4hdfgu",
          "author": "Sarah_Persy",
          "text": "oh, appreciate that you focused on recurring removals! That’s the part people often ignore, but personally for me it is a deal breaker. One-time cleanup doesn’t solve the long-term problem",
          "score": 11,
          "created_utc": "2026-02-09 19:10:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4i01h0",
              "author": "EndpointWrangler",
              "text": "That's true, you have to be consistent. I like that post as well!",
              "score": 6,
              "created_utc": "2026-02-09 21:01:46",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4hc51t",
          "author": "Karen_Jamesnb",
          "text": "it is actually one of the cleaner comparison posts I’ve seen. most lists online feel biased or half-baked. Having everything side by side really helps",
          "score": 5,
          "created_utc": "2026-02-09 19:03:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4hdnim",
          "author": "Jodi_Twombly",
          "text": "did u personally test any of these, or is this based purely on documentation and reviews? Curious how hands-on this was",
          "score": 2,
          "created_utc": "2026-02-09 19:11:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4he596",
              "author": "sairas_purnil",
              "text": "mostly documentation, user reports and trial dashboards where possible. I didn’t fully subscribe to all of them, but I tried to validate claims where I could. happy to update things if something’s inaccurate!",
              "score": 1,
              "created_utc": "2026-02-09 19:13:31",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4nozek",
          "author": "valcure_richail",
          "text": "really solid breakdown, for sure, but I do have a few moments to notice: actually OneRep is one of the few that makes sense price-wise if you’re trying to protect more than just yourself. their family option is usually one of the better “cost per person” setups, so you actually keep it running long enough for it to matter",
          "score": 2,
          "created_utc": "2026-02-10 18:24:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4nt2eg",
              "author": "sairas_purnil",
              "text": "oh yes, did you have experience with it? I made this just taking info from the internet, but if you used them irl u should share insights!",
              "score": 2,
              "created_utc": "2026-02-10 18:42:35",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4ntqle",
                  "author": "valcure_richail",
                  "text": "yep, i tried a bunch of tools, but from my personal experience onerep is the most balanced. Once you put your info, everything is automated and removed from multiple sites with in few days to weeks.",
                  "score": 1,
                  "created_utc": "2026-02-10 18:45:34",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4hdr7h",
          "author": "Tebina_Alfrea",
          "text": "I’m surprised how big the gap is between services that do recurring removals and those that don’t. that alone narrows the list a lot for me",
          "score": 1,
          "created_utc": "2026-02-09 19:11:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4he6vn",
          "author": "aJumboCashew",
          "text": "Cloaked is a decent service as well.",
          "score": 1,
          "created_utc": "2026-02-09 19:13:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4hg4gi",
          "author": "GeeKaba",
          "text": "Why do you have to do recurring removals ? Do these entities keep data even after you opt out ?",
          "score": 1,
          "created_utc": "2026-02-09 19:23:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ir5ne",
              "author": "reggaegirl420",
              "text": "I think they'll acquire data again or from another source as you continue to use Google, your phone, maps apps, Amazon, etc., which all collect and sell your data constantly. I understand these sites as removing the data brokers already have, but it doesn't block them from acquiring it again. Now THAT is something I'd pay for!",
              "score": 1,
              "created_utc": "2026-02-09 23:20:14",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4lpqcz",
                  "author": "techMari",
                  "text": "This, data brokers keep reacquiring data from new sources. So basically, every time you sign up for something, buy something, update an address, or subscribe to a newsletter, that info can be sold or shared again to data brokers, rebuilding your profile in their databases. That's why Incogni does regular monitoring and not just one-time clears. Full disclosure: I'm on the team at Incogni.",
                  "score": 1,
                  "created_utc": "2026-02-10 12:20:28",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4l4uvz",
          "author": "shangheigh",
          "text": "nice research, very detailed, helps compare services easily, recurring removals and reporting seem most important for real privacy protection, would love updates if you refine table further",
          "score": 1,
          "created_utc": "2026-02-10 09:18:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4l7q2n",
          "author": "FishingSuitable2475",
          "text": "This is a solid breakdown of the \"big four,\" but it highlights a significant gap in the current market: most standard services only hit the top layer of the iceberg. While 400 to 600 brokers sounds comprehensive, it leaves a massive vacuum for the thousands of smaller, deep-web scrapers that actually fuel those \"shadow profiles\" and lead to re-indexing.  \n  \nIf you’re looking for a more aggressive \"deep clean,\" it’s worth checking out CrabClear. It automates removals across 1,500+ data brokers, which is a massive jump from the usual 420 600 sites covered by providers like Incogni or DeleteMe. By hitting the mid-tier and niche aggregators that the bigger services often overlook, you actually stop the cycle of your information trickling back up to the major people-finder sites.",
          "score": 1,
          "created_utc": "2026-02-10 09:46:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4m7q1i",
          "author": "techMari",
          "text": "Great comparison, OP. I'd also like to add to Incogni's pricing and value that there's a new plan for the US customers, called Incogni Protect. It offers 24/7 dark web monitoring, $1M identity theft insurance and credit monitoring in addition to our personal data monitoring and removal from data brokers. The plan is available for an additional cost of 5.76 USD per month for annual plans.\n\nAnother key differentiator for Incogni is that our coverage extends beyond traditional people search sites and marketing data brokers. We also include higher risk data brokers, that are involved in risk mitigation, recruitment and financial information. For full disclosure, I'm on the team at Incogni, hope you find this helpful!",
          "score": 1,
          "created_utc": "2026-02-10 14:09:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4npo5f",
          "author": "Donna_Murrall",
          "text": "did you consider how transparent the reports are? Some dashboards just say “working on it” without specifics. That drives me crazy.",
          "score": 1,
          "created_utc": "2026-02-10 18:27:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4nqrvd",
              "author": "sairas_purnil",
              "text": "yep, reporting quality was part of the evaluation, services that show which brokers were contacted and what status they’re in scored higher for me",
              "score": 1,
              "created_utc": "2026-02-10 18:32:10",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4nrqwx",
                  "author": "Donna_Murrall",
                  "text": "oh, gotcha, thank you! im actually juset skeptical because someties reportin not even close to reality",
                  "score": 1,
                  "created_utc": "2026-02-10 18:36:36",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4o1p8v",
          "author": "ciariopo",
          "text": "Onerep stands out in the table for coverage and automation and it was the reson why I’ve been using it for a while and the recurring removals are what sold me. Manual opt-outs were unsustainable while havinf such took",
          "score": 1,
          "created_utc": "2026-02-10 19:22:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4q36n0",
          "author": "EntireAioli5369",
          "text": "You’re paying for peace of mind more than anything else. Which, I can understand. Just don’t make the mistake of thinking that you can truly get your data off the internet. If someone wants to find you, they will",
          "score": 1,
          "created_utc": "2026-02-11 01:39:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4v8e5s",
          "author": "Dr_Hanz_",
          "text": "I used Optery then switched to delete me. After I stopped paying for Optery they kept sending me emails saying my data was on these sites sign back up for easy removal. I went to a few of the sites typed in the information they said was leaked and I did not see anything. \nMaybe there is data stored on some backend Optery has access too but I am not sure if they were just trying to scare me into paying them again. \n\nI am very happy with Delete Me but in the back of my mind I think all of these services are pretty much ideal targets since they hold everyone’s sensitive data. So it’s very good that you are researching them thoroughly.",
          "score": 1,
          "created_utc": "2026-02-11 20:59:20",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r0dv6p",
      "title": "Dealing with iGaming fraud prevention topics on my new work and getting crazy.",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1r0dv6p/dealing_with_igaming_fraud_prevention_topics_on/",
      "author": "Gullible-Lychee1706",
      "created_utc": "2026-02-09 19:28:27",
      "score": 32,
      "num_comments": 2,
      "upvote_ratio": 1.0,
      "text": "I am 23 years old, have been working as a DevOps since I was 19. I'm deeply involved in corporate security stuff, but usually it was for entertainment companies or online learning platforms. Now my friend invited me to take on a new job in a new niche (iGaming), and I agreed... =(  \n  \nSo now messing up with gambling product and trying to get serious about igaming fraud prevention but nothing helps. I just don't understand where to look and where to find proper solutions. Like, I've never had anything to do with this before, and the devil made me agree to go work at this place (the funniest thing is that the income isn't much more than at my old job, so yes, I'm a loser, lol).\n\nI’m trying to understand how fraud prevention software in this niche works, but the internet seems completely empty. In any case, I'll most likely leave team in the near future, but I am obliged to at least set up some kind of real-time fraud monitoring for them, otherwise it would be unprofessional and unfair on my part.\n\nIf you’ve implemented something and it actually reduced fraud, what solutions worked?   \n  \npls **no companies names** as I don't want to turn this post into one big ad!!!",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1r0dv6p/dealing_with_igaming_fraud_prevention_topics_on/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o4hh98v",
          "author": "AutoModerator",
          "text": "Hello,\n\nYour submission was automatically removed because your Reddit account does not meet our minimum karma or account age requirements. These measures help maintain the quality of posts on r/cybersecurity and prevent spam.\n\nRequirements:\n- Minimum of 20 comment karma OR 20 link karma\n- Account age of at least 10 days\n- Combined karma of at least 40\n\nTo build your karma, participate in discussions across Reddit and contribute thoughtful content in subreddits that welcome new users.\n\nIf you believe this was a mistake or have any questions, please message the mod team.\n\nThank you.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CyberSecurityAdvice) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-09 19:28:27",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r0655k",
      "title": "How can I get into CyberSecurity?",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1r0655k/how_can_i_get_into_cybersecurity/",
      "author": "brpmaker",
      "created_utc": "2026-02-09 14:49:04",
      "score": 20,
      "num_comments": 26,
      "upvote_ratio": 0.89,
      "text": "I'm currently in college taking my first year. im majoring in computer science but I would like to become a chief security officer of a cybersecurity firm or eventually start my own. what are some ways I could get hands on with cyber security and learn the basics of coding? Im not looking to get a job in the field rn as i understand itll take me a while, I just want to brush up my skills and learn new things so when its time I am ready",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1r0655k/how_can_i_get_into_cybersecurity/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o4fzr59",
          "author": "cyberguy2369",
          "text": "walk over to your universities it dept \"hi, I'm a cs student, I am looking for opportunities to work and get experience\" then walk over to the cs dept. \"hi, I'm a cs student, I'm looking for opportunities to work and get experience\"\n\nyou wont start in \"cyber\" but you will start seeing how real networks and tech work in a real world environment. over time you can move into more cyber related roles. \n\noutside of that join any club or organization in the CS dept, business school, and the university where you can network, meet people and gain experience. \n\nlook in your community for \"tech meetup\" or \"cyber meetup\" show up.. get involved.. meet people. \n\ndont just do the classwork.. expand on it.. use your resources.. (professors, labs, and other university resources)",
          "score": 12,
          "created_utc": "2026-02-09 15:13:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4h8ky2",
              "author": "Nessuwu",
              "text": "What if I'm in a different state than the university I went to, will local universities take kindly to this?",
              "score": 1,
              "created_utc": "2026-02-09 18:47:14",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4hcnfa",
                  "author": "cyberguy2369",
                  "text": "people move around and go to out of state schools all the time. that doesnt matter.. what matters is the effort you put in. applying on linkedin blindly is not a good use of your time. \n\nI say this a lot in this channel, but it's worth repeating:  \nLet’s take a step back and think about cybersecurity and the companies in this space.  \nCybersecurity is one of the hottest career fields right now. Everyone wants in, mostly because they’ve heard that’s where the money and opportunity are. So here’s the question: if you’re a strong, well-run cybersecurity company that treats its employees well, offers real training and growth, and has plenty of work, do you really need to advertise on LinkedIn to find talent?  \nChances are, no. That kind of company probably already has:\n\n* A stack of resumes in HR’s inbox\n* Former employees trying to return\n* Current employees referring friends who are eager to join\n\nNow let’s look at the jobs you *do* see on LinkedIn and similar sites. They tend to fall into a few categories:\n\n* **Ghost jobs** – posted to give the illusion of growth to shareholders, with no real intent to hire\n* **Resume collectors** – companies stockpiling applicants “just in case,” or monitoring industry trends\n* **Clueless postings** – they don’t know what they want or need\n* **Terrible offers** – the job is posted because no one wants it due to bad pay, bad culture, or bad leadership\n\n",
                  "score": 1,
                  "created_utc": "2026-02-09 19:06:22",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4g0o3o",
          "author": "PortAuthority69G",
          "text": "As a freshman, something you might hear over and over again is, \"Do internships!\" and \"Your network is your net worth!\" That advice is correct.",
          "score": 3,
          "created_utc": "2026-02-09 15:18:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ijjso",
          "author": "hollaSEGAatchaboi",
          "text": "Job fairs through your department. It may seem like a shot in the dark, but it isn't. You'd flip if I told you what department I was in, but I got a decade-long career out of it and competitive pay I took along with me to a second career.",
          "score": 3,
          "created_utc": "2026-02-09 22:40:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4fv35o",
          "author": "AutoModerator",
          "text": "Hello,\n\nYour submission was automatically removed because your Reddit account does not meet our minimum karma or account age requirements. These measures help maintain the quality of posts on r/cybersecurity and prevent spam.\n\nRequirements:\n- Minimum of 20 comment karma OR 20 link karma\n- Account age of at least 10 days\n- Combined karma of at least 40\n\nTo build your karma, participate in discussions across Reddit and contribute thoughtful content in subreddits that welcome new users.\n\nIf you believe this was a mistake or have any questions, please message the mod team.\n\nThank you.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CyberSecurityAdvice) if you have any questions or concerns.*",
          "score": 2,
          "created_utc": "2026-02-09 14:49:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4g33mc",
          "author": "Acceptable_Simple877",
          "text": "IT internships",
          "score": 2,
          "created_utc": "2026-02-09 15:30:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4goyae",
              "author": "brpmaker",
              "text": "do you know where i could look for any ?",
              "score": 1,
              "created_utc": "2026-02-09 17:14:40",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4htipl",
                  "author": "Acceptable_Simple877",
                  "text": "LinkedIn",
                  "score": 1,
                  "created_utc": "2026-02-09 20:29:51",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4glfoc",
          "author": "Joy2b",
          "text": "Building tools useful in cybersecurity work is a good free time step for a coder.  Take a look at some of the classics like the sysinternals tools and kali linux, see where there’s room for you to make them more fun or functional.  Look for your local hacker space or Linux user groups and conferences. You want to be able to learn  and teach common security concepts before year 4.  \n\nTo stay motivated to learn outside of class, start a habit of chasing a certification or two a year. Start shopping with ISC2, Comptia, Cisco, Linux, Microsoft, Google. \n\nYou’ll be surprised how often a bigger picture view helps you understand full stack programming, and how that feeds back into understanding the networks.  \n\nDo you have pet projects, repairing old computers or whatever?",
          "score": 2,
          "created_utc": "2026-02-09 16:57:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4gov0e",
              "author": "brpmaker",
              "text": "thank you for the advice ill definitely look into it, ive heard of kali linux but i didnt really know what it was, and no ive never had a project to work on or anything of that nature, whats a early project you recommend i could do to get a head start?",
              "score": 1,
              "created_utc": "2026-02-09 17:14:14",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4h36iw",
                  "author": "Joy2b",
                  "text": "Oh wow, you’re new, let’s get you launched. \n\nOpen up YouTube, start a new profile for studying, and seed it by enrolling in Messer’s A+ class, and doing searches like this weekly, Kali Linux, raspberry pi projects, Krebs, security news. \n\nMesser is very easy listening. He’s going to make sure you have enough of a vocabulary and broad understanding to be able to keep up in technology conversations.  Hopefully half the course is a refresher. \n\nAfter Messer you deserve some spice, so look up Tarah Wheeler, Deviant pentesting, hacking competitions.  \n\nAbsolutely do not skip over suggestions of tutorials from command line cat girls, they are often absolute ninjas with OPSEC.",
                  "score": 3,
                  "created_utc": "2026-02-09 18:22:03",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4iefo5",
          "author": "Adventurous_Pen_7892",
          "text": "Ask around local Middle/Elementary schools and see if their IT Department can provide Internships or even jobs while going to college.",
          "score": 2,
          "created_utc": "2026-02-09 22:13:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4l66uh",
          "author": "TheOGCyber",
          "text": "You need to learn IT fundamentals first.  Hardware/software, operating systems, networking, virtualization, cloud computing, programming/scripting, IoT, ICS/OT, and AI.\n\nYou must have a strong knowledge of IT fundamentals if you want to work in cybersecurity.",
          "score": 2,
          "created_utc": "2026-02-10 09:31:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4m2r3h",
              "author": "brpmaker",
              "text": "any videos or websites you recommend i go through to learn? and are there any hands on tools for me to use that youd recommend?",
              "score": 1,
              "created_utc": "2026-02-10 13:42:13",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4m8hf3",
                  "author": "OverZiHD",
                  "text": "try hack me pre security and cyber security 101 paths",
                  "score": 2,
                  "created_utc": "2026-02-10 14:13:25",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o53gt4j",
                  "author": "TheOGCyber",
                  "text": "Look at CIsco's CCNA certification.  There are no shortcuts or videos to learning new skills.",
                  "score": 1,
                  "created_utc": "2026-02-13 02:34:29",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4grrst",
          "author": "Surfnazi77",
          "text": "How do you feel about joining the military after graduation?",
          "score": 1,
          "created_utc": "2026-02-09 17:28:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4jx975",
              "author": "brpmaker",
              "text": "with the way the government is rn i doubt anything would attract me to work a gov position",
              "score": 2,
              "created_utc": "2026-02-10 03:23:41",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4r2uad",
          "author": "cyber_pulse2928",
          "text": "Start by learning networking, Linux, and basic scripting like Python, then practice hands-on with platforms such as TryHackMe or Hack The Box and build your own home lab using Kali Linux. Follow a structured beginner path through cybersecurity courses and certifications from EC-Council to understand real-world security concepts. Consistent practice during college will put you far ahead when you’re ready to enter the field.",
          "score": 1,
          "created_utc": "2026-02-11 05:34:47",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r13pg4",
      "title": "How does a CS degree play into a career in Cybersecurity",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1r13pg4/how_does_a_cs_degree_play_into_a_career_in/",
      "author": "Dazzling_Noise1",
      "created_utc": "2026-02-10 15:25:38",
      "score": 18,
      "num_comments": 16,
      "upvote_ratio": 0.95,
      "text": "I am in college now getting a Computer Science degree, but I personally feel and was told by others that this career is heavily oversaturated. Now I'm halfway through a degree and I'm wondering how or if I can switch more to a Cybersecurity focused degree/career. I was told to disregard the degree and focus only on certs, but I don't know how accurate that is.\n\n  \nI'd imagine these skills are translatable, but I haven't heard any success stories.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1r13pg4/how_does_a_cs_degree_play_into_a_career_in/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o4nvaik",
          "author": "RoamingThomist",
          "text": "I'd recommend you stay in the general Computer Science track rather than specialising in cyber security at undergraduate level. Whilst there are good programs out there, most are pretty lacklustre. The real thing you should be doing is looking at summer placements and internships with companies you'd be interested in working for; that will help you stand out.\n\nA degree without those placements will mean you'd be competing with people that may have a few years in a related role looking to get into SOC, dev work, etc. Which will count against you.\n\nEdit: also, the skills are pretty transferable if you're looking at the engineering and automation side. There is a certain truth to the idea that the market is saturated for both CompSci and Cyber, but it's also a little overblown. If you're trying to get in with absolutely no experience, of course it's going to be hard. And a lot of the oversaturation is the people that did a stupid bootcamp over covid working their way through the system and being found incompetent.",
          "score": 4,
          "created_utc": "2026-02-10 18:52:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4o0xkt",
              "author": "Dazzling_Noise1",
              "text": "I see what you're saying, I'm not considering the switch for a monetary reason as both the fields each earn around the same when you are starting out. I am just worried about the fact that I can't compete as how my resume is now in CS and I was told that getting a job in Cybersecurity is almost as easy as getting a job at McDonald's.",
              "score": 0,
              "created_utc": "2026-02-10 19:18:25",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4o9mme",
                  "author": "scooter950",
                  "text": "In my experience which is 14 years IT, last 8 in Blue Team Cyber, CySA, CASP, CISSP (among others) and a bachelor's in Cyber. Getting a job is not that easy.\n\nAs a federal employee, I've applied to around 40 jobs over the long shutdown. Most of the replies were a thank you for applying, some were just a NO, and the rest ghosted. \n\nAlso given the current market... Simply put, I think there is a disconnect.\n\nAgain, my experience. Could be my resume not liked by their AI. Who knows??",
                  "score": 3,
                  "created_utc": "2026-02-10 19:58:55",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o4o1uez",
                  "author": "CyberVoyagerUK_",
                  "text": "There's few places worth their salt that hire in cyber security without any actual IT experience anyway. Do a few years in IT, get a good grounding and experience in actual real world tech, then move into cyber",
                  "score": 1,
                  "created_utc": "2026-02-10 19:22:41",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4prpkf",
          "author": "dahra8888",
          "text": "Computer Science is generally considered a stronger degree than Cybersecurity even for Cybersecurity roles.\n\nCyber degrees have don't have a good reputation in the actual field as many schools have irrelevant curriculum and just use them as cash cows. Plus CompSci gives you a huge range of early career possibilities: Dev, IT, Cyber, etc.",
          "score": 5,
          "created_utc": "2026-02-11 00:31:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4u6j3i",
              "author": "Dazzling_Noise1",
              "text": "Oh?! That's the first time I've heard that lol. I'm going to be honest, I'm not really believing that 100%, but it's not the first time I saw someone comment that on this post. Really surprising I've never heard that before making this post though.",
              "score": 1,
              "created_utc": "2026-02-11 17:59:51",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4qnwr0",
          "author": "The-Snarky-One",
          "text": "I’ve been in IT since the mid-1990s and held many roles over the years ranging from help desk to infosec operations to desktop support to IT contractor and more. Currently a T3 Sysadmin.\n\nGet the CS degree.\n\nThe CS degree will teach you programming, some data analysis, some database interactions, some statistics, and more. Those are all skills that you can use in many career fields/paths. Deciding to step away from that and focus on a niche will only hurt you in the long run.\n\nCerts are okay, but they aren’t going to get you a job. They might help you land an interview, but a degree will too (and in many cases, more often). Experience will get you a job and you’ll need to build that over time. Focus on internships and projects that can showcase your skills. Spend the next couple of years getting your degree… things may change by the time you graduate and you won’t have pigeonholed yourself.",
          "score": 2,
          "created_utc": "2026-02-11 03:46:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4qp33u",
          "author": "Redelfen",
          "text": "You dont usually join a specialty like cyber, dev, cloud, etc straight off the bat.\n\nAt the entry level, it is all more or less the same Tier 1 / Help desk \n\nIf you are worried about the job market and getting employed after graduation,  \nthe single best thing you can do now while you have time is networking.\n\nThis is just my opinion from personal experience.  \nCerts and degree are cool and all but nowadays everyone has them.  \nBut having things like working experience from(doing intern) or knowing a buddy who already works somewhere is really the only way to make you stand out than the other 2k+ applicants for the same entry level role.\n\n  \nIf I were you and I had some time before graduating, I would make it my #1 priority to either gain experience through intern/job AND start making connections with people in the industry that can help you get hired.\n\n  \n",
          "score": 2,
          "created_utc": "2026-02-11 03:54:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4qpmek",
          "author": "texcleveland",
          "text": "I have a CS degree and that’s opened doors because I learned the fundamentals of how computer systems work logically “under the hood” (go EE if you want to be real hardcore). Certs just train you in button pushing. Which can be useful, but when you understand the fundamentals, the button pushing is secondary. I have exactly one certification from twenty years ago.",
          "score": 1,
          "created_utc": "2026-02-11 03:58:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4u0sbw",
          "author": "throwaway73327",
          "text": "If you think CS is oversaturated, shifting to an insanely oversaturated field like Cyber is the worst move you could make. ",
          "score": 1,
          "created_utc": "2026-02-11 17:33:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4wqja2",
          "author": "BankingAnon",
          "text": "Many of my peers and acquaintances in the cybersecurity space, don’t even have degrees in cyber or CS. You’d be surprised how irrelevant these degrees are to the actual field. \n\nCS in general is hella over saturated, but Cyber degrees strike me more of a cash grab. The only benefit is places like WGU where you can get multiple certificates through vouchers for some of their courses. But also, some certs are just noise.",
          "score": 1,
          "created_utc": "2026-02-12 01:52:21",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r04aby",
      "title": "I need interview questions for all this topic can you guys help me",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1r04aby/i_need_interview_questions_for_all_this_topic_can/",
      "author": "Funny-Process-6027",
      "created_utc": "2026-02-09 13:32:00",
      "score": 12,
      "num_comments": 4,
      "upvote_ratio": 1.0,
      "text": "Security Operations Analyst (2 Years Experience) –\r\nInterview Preparation Topics\n\r\nCore Security Fundamentals\n\r\n1 CIA Triad and practical application\r\n2 Common attack vectors (phishing, malware, ransomware, brute force, web attacks)\r\n3 Network protocols: TCP/IP, DNS, HTTP/HTTPS, SMTP\r\n4 Ports and services mapping\r\n5 Authentication vs Authorization\r\n6 Encryption vs Hashing\r\n7 Zero Trust and MFA concepts\n\r\nSOC Operations & Incident Response\n\r\n1 Incident Response lifecycle\r\n2 Alert triage methodology\r\n3 Severity classification\r\n4 False positive vs true positive handling\r\n5 Escalation workflows\r\n6 Playbooks and runbooks\r\n7 MITRE ATT&CK; framework basics\r\n8 Indicators of Compromise (IOCs)\n\r\nSIEM & Log Analysis\n\r\n1 SIEM architecture and use cases\r\n2 Correlation rules\r\n3 Log sources (Windows, Linux, Firewall, Proxy, Cloud)\r\n4 Basic query writing (Splunk / Sentinel / QRadar style)\r\n5 Dashboards and alert tuning\r\n6 Use case creation basics\n\r\nEndpoint & Network Security\n\r\n1 EDR/XDR concepts\r\n2 Malware behavior basics\r\n3 Endpoint investigation steps\r\n4 Network traffic analysis basics\r\n5 IDS vs IPS\r\n6 Firewall rule logic\n\r\nThreat Detection & Hunting\n\r\n1 Threat intelligence sources\r\n2 IOC vs IOA\n3 Basic threat hunting workflow\r\n4 Behavioral detection concepts\r\n5 Anomaly detection basics\n\r\nCloud Security Basics\n\r\n1 Azure/AWS logging sources\r\n2 Cloud identity risks\r\n3 Conditional access alerts\r\n4 Cloud SIEM integration\n\r\nVulnerability Management\n\r\n1 CVSS scoring\r\n2 Vulnerability scan workflow\r\n3 Nessus/Qualys report reading\r\n4 Patch prioritization\n\r\nOperating System Skills\n\r\n1 Windows Event IDs (login, process, account changes)\r\n2 PowerShell basics\r\n3 Linux commands (grep, netstat, ps, top, chmod)\r\n4 Process and service investigation\n\r\nInvestigation Scenarios to Practice\n\r\n1 Suspicious login alerts\r\n2 Phishing email investigation\r\n3 Malware detection case\r\n4 Data exfiltration indicators\r\n5 Privilege escalation alerts\n\r\nBehavioral & Communication\n\r\n1 Incident documentation\r\n2 Shift handover reporting\r\n3 Stakeholder communication\r\n4 Handling high alert volume\r\n5 Decision making under pressure",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1r04aby/i_need_interview_questions_for_all_this_topic_can/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o4g0oh0",
          "author": "darksearchii",
          "text": "Shove it into an LLM, this is what they do well.",
          "score": 1,
          "created_utc": "2026-02-09 15:18:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4g0t0j",
              "author": "Funny-Process-6027",
              "text": "Hm hm",
              "score": 1,
              "created_utc": "2026-02-09 15:18:56",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4g9ofj",
          "author": "Instict_ai",
          "text": "There's a platform you can use to download pre generated interview questions which will be role and company specific as opposed to using random LLMs - the platform is [instict.ai](http://instict.ai) you can also practice interview questions and get instant feedback on where to improve ",
          "score": 1,
          "created_utc": "2026-02-09 16:02:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4vxlfa",
          "author": "interview_ally",
          "text": "it is not as simple as one thinks.  You need to know the company name so one can research their tech stack, industry, recent security incidents and what their SOC actually does day to day.  Plus the job description.  ",
          "score": 1,
          "created_utc": "2026-02-11 23:03:48",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r2bta7",
      "title": "How is life as a cyber security engineer?",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1r2bta7/how_is_life_as_a_cyber_security_engineer/",
      "author": "Budget-Length2666",
      "created_utc": "2026-02-11 22:29:31",
      "score": 11,
      "num_comments": 16,
      "upvote_ratio": 0.84,
      "text": "I am a senior software engineer at big tech and I am seeing the AI inflection point right in front of my eyes and I am sure the software job industry will shrink enormously over the coming years and I am thinking of a plan b. I used to be interested in ethical hacking years ago and would like to know what it is actually like to work in the field. \n\nDo you like your job? How safe from AI is it?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1r2bta7/how_is_life_as_a_cyber_security_engineer/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o4xg3md",
          "author": "Subnetwork",
          "text": "This side of the house isn’t any safer tbh.",
          "score": 8,
          "created_utc": "2026-02-12 04:34:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4x8i67",
          "author": "jeffpardy_",
          "text": "I specialize in cloud security and architecture security. Recently moved to an AI security role. From what ive seen so far, nobody has this AI stuff figured out yet. All the AI-SPM, AI supply chain security tools, AI adversarial testing tools all suck and they are just all start ups trying to throw their hat in the ring for money. So that part is bad but other than that learning a lot and having fun",
          "score": 6,
          "created_utc": "2026-02-12 03:42:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4vs36f",
          "author": "Pjxr",
          "text": "Life is good mostly all jobs have complaints I have learned. Being able to communicate effectively and having great colleagues makes it go away. \n\nNothings safe from AI, but you can continue to learn and understand fundamentals you can always dive deep into any technology as there is (unlimited)\n\nDepending on your environment you will have a huge range of things and being aware of what's going on I find most helpful",
          "score": 2,
          "created_utc": "2026-02-11 22:35:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4vtj0x",
              "author": "Budget-Length2666",
              "text": "AI is pretty certain to eat up most of traditional SWE jobs as it is just text generation and through linting, and testing you can put the LLMs into a loop until it gets something working.\n\nHow is AI impacting cyber security? I was hoping that you would still need someone working on server racks, configuring networks and owning the security. I also thought that in cyber security, attackers and defenders both benefit from LLMs, such that it is equal playing field?",
              "score": 0,
              "created_utc": "2026-02-11 22:42:39",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4xqsjy",
                  "author": "Appropriate_Try_7040",
                  "text": "AI impacts entry level SOC work",
                  "score": 0,
                  "created_utc": "2026-02-12 05:58:50",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4xe86b",
          "author": "ShadesBlack",
          "text": "[Here is a recent article from someone who routinely tests AI models](https://shumer.dev/something-big-is-happening).\n\nFrom my perspective, Cybersecurity falls into the realm of \"needs someone to accept legal responsibility and has regulatory hurdles.\" It's at the very least enough to buy time if there are big shifts coming as the author claims. AI has a lot of unsolved (and maybe unsolvable) problems in the realm of security, as things like prompt injection don't seem likely to go away anytime soon.\n\nHowever, it's all relative to what CEOs and corporations decide to prioritize. Cybersecurity is *already* not a very viable path at the entry level for the most part, so your relevant skillset will need to shine on your resumé. I can't imagine that an incoming wave of AI capable of washing away >50% of entry-level white-collar job helps that prospect much at all.",
          "score": 1,
          "created_utc": "2026-02-12 04:21:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4xg4zc",
              "author": "Subnetwork",
              "text": "You’re only going to need 1-2 not a large team …",
              "score": 1,
              "created_utc": "2026-02-12 04:35:10",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4zlfw2",
          "author": "Natural_TestCase",
          "text": "Cybersecurity is a cost-center. That’s offset if you work in an industry with federal / audit requirements.  Software engineers typically make a bit more as they are working on products that generates revenue. If you think software engineering is going to shrink - won’t cyber as well?",
          "score": 1,
          "created_utc": "2026-02-12 14:47:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4yb8dt",
          "author": "coozkomeitokita",
          "text": "Growing and in-demand for sure. Expect a raise or be headhunted.",
          "score": 1,
          "created_utc": "2026-02-12 09:10:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4yjbny",
              "author": "captainrussia21",
              "text": "You forgot to add /s at the end of your post…",
              "score": 5,
              "created_utc": "2026-02-12 10:29:50",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4ykbme",
                  "author": "coozkomeitokita",
                  "text": "Oops.",
                  "score": 0,
                  "created_utc": "2026-02-12 10:39:18",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4ybdxb",
          "author": "coozkomeitokita",
          "text": "Growing and in-demand for sure. OSINTing and White Hat Penetration Testers are going to be super hot in-demand. Even at the simple Kali Linux CL TooI level.",
          "score": 1,
          "created_utc": "2026-02-12 09:12:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4yjdce",
              "author": "captainrussia21",
              "text": "LoL",
              "score": 2,
              "created_utc": "2026-02-12 10:30:15",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r1zyih",
      "title": "6 months later… for those who moved from VPN to ZTNA, was it worth it?",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1r1zyih/6_months_later_for_those_who_moved_from_vpn_to/",
      "author": "LethalAstronomer",
      "created_utc": "2026-02-11 15:12:46",
      "score": 10,
      "num_comments": 10,
      "upvote_ratio": 1.0,
      "text": "About six months ago, I posted here, frustrated with OpenVPN at our startup. Slow, annoying to manage, and too much implicit trust once someone connects. I was looking into ZTNA and zero-trust models because I was tired of “connect to VPN and see half the network.”\n\nFast forward, and I am still evaluating options, but now I am looking beyond the theory and trying to understand long-term reality.\n\nFor those of you who actually replaced VPN with ZTNA, did it hold up once things got messy?\n\nRemote developers. BYOD. Contractors. Random legacy tools that assume flat network access. The stuff vendors do not put in the demo.\n\nDid policy management stay sane over time?\n\nDid device posture checks become constant exception handling?\n\nDid users feel a real improvement or just a different kind of friction?\n\nAnd be honest. Did VPN actually go away, or is it still there for edge cases you could not solve cleanly?\n\nI am trying to avoid trading one operational headache for another. Marketing makes this sound simple. Production environments are not.\n\nWould really value input from anyone who has been running ZTNA in a live environment for a while, especially in smaller teams without a massive security department.\n\nWhat surprised you most after rollout?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1r1zyih/6_months_later_for_those_who_moved_from_vpn_to/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o4waj1o",
          "author": "ISCSI_Purveyor",
          "text": "Interested in the experiences as well. My small organization is currently toying with ZTNA and while it looks amazing on paper, I share all of original questions and concerns.",
          "score": 3,
          "created_utc": "2026-02-12 00:16:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4wki7t",
          "author": "ChartingCyber",
          "text": "I do cyber consulting, but this is not a sales pitch. I am in various phases of POC/selection/implementation/refinement with a number of clients, including those whose cyber programs we manage.\n\nPros:\n\n* Way faster connectivity for remote users to on-prem service access based on the product we/they chose in a couple clients. An executive was across an ocean and had faster connectivity than he used to have at his house in the US. File shares, ERP, databases, everything is faster.  User experience is generally positive, even with the hiccups.\n* Much more fine grained access to resources. One example: RDP was required for a subset of users due to some niche compute requirements. Now that is much more controlled.\n* We are 4 (?) months into one I'll reference. VPN is still available for the IT team, but all users in all sub-companies are migrated to the platform. There were hiccups, but was surprisingly smooth. Most hiccups were related to \"Oh I didn't know so-and-so used resource XYZ and we just blocked their access to it\". \n* Amazing shadow IT detection. You'd be surprised what people use their work computers/accounts for if you have never been able to filter or sanction specific applications.\n* We didn't buy a static IP. Instead, we created an Azure compute instance as a connected tunnel and route all URLs requiring static IP for origin to that. It works well, but only do that if you are willing to add that slight overhead, as it would be much easier to just have it in the platform. We only needed that because some SaaS subscriptions require it for org access.\n\nCons: \n\n* Management absolutely requires more effort. If your implementation partner (if there is one) isn't handing over documentation on WHY they implemented a certain way and where you should go/make changes in the future efficiently, it will eventually turn into spaghetti (like most tools though). This wasn't a deal breaker (obv), but is a consideration for a small team like you said.\n* Captive portal detection: it might be limited to one product or configuration (as you said, complex product that continually needs refinement) but for the life of me some airlines just will not let the agent detect it is captive with some vendors. It results in a \"travel\" AD/Entra group and some device setting rules that allow people to turn off the agent when they are traveling. Not ideal, but working through it. Probably platform specific, but I promise it's not an obvious dumb config mistake (\"oh just turn on that widget!\").\n* We have a pain point managing local breakout/device profiles on some platforms. Admin interface is a compromise between features and overhead to manage it. \n* The right vendor absolutely depends on a couple factors, and it is easy to choose the wrong one. If you have server initiated traffic (Microsoft SCCM, some RMMs, etc) that is a limitation in the space. Others are AMAZING and present this super-duper-awesome DLP capability, but remember that additional capability usually means additional management overhead. If you don't tag data today?\n\nIn closing: users, execs, and IT personnel like it compared to the VPN. We would do it again (and continue to recommend) for most use cases. Spend the time on a POC/POV with all the features you are looking to license to validate your use cases. Where I see most difficulty is not the tool limitations (although that still is there) but in your implementation/architecture choice. Sales people are used to matching need key words -> SKUs. They are NOT good at knowing you are looking for the \"good enough\" version of what you are trying to do. ",
          "score": 2,
          "created_utc": "2026-02-12 01:15:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4z6epj",
              "author": "ChartingCyber",
              "text": "And of course, the morning after I post this I wake up to an email saying file shares for remote users at one business unit in Europe is suuuuuuper slow. So add a con: very chatty things like SMB may have difficulty, but tbh I am sure we will troubleshoot this and find it isn't purely an issue with the ZTNA platform. Otherwise it would have been apparent for ALL users over the last few months.\n\nIn the SMB space where you have much more simple environments, or you can change subnets easily, you may have less problems. Some of my clients are growing through acquisition so while the initial integration is easy, the refinement over time is still a challenge, like if there are overlapping subnets for private resources between companies. But that is also just a challenge of integrating two companies together.",
              "score": 1,
              "created_utc": "2026-02-12 13:25:16",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4xs2ux",
          "author": "pete84",
          "text": "Long story short, if you are a startup, just use vpn until you have to use ztna. \n\nMost access controls in cloud can be done by IAM access permissions  rather than network. \n\nUnless you have a need for packet level inspection, it’s overkill. Everyone will feel spied on.  You will need a network team just to manage it effectively. \n\nIf you do decide on a ztna, make sure the architecture is distributed cloud, to handle decryption at scale,  and that it meets your requirements.",
          "score": 1,
          "created_utc": "2026-02-12 06:09:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o54mya4",
              "author": "Redshift_Sun",
              "text": "Eh I say implement ZTNA while your environment is simple and manageable. Scaling it is easy. Implementing later is a pain especially if your organization doesn’t document a damn thing",
              "score": 1,
              "created_utc": "2026-02-13 07:49:11",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4xxibu",
          "author": "CausesChaos",
          "text": "I'm in the middle of building Cisco ZTNA for my business. 8,000 staff, On prem, Azure and AWS, approx 210 applications/internal APIs that the business use.\n\nI have a few members of IT and Security operating on ZTNA and it's going swimmingly so far.",
          "score": 1,
          "created_utc": "2026-02-12 06:58:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o50c1xh",
              "author": "methods2121",
              "text": "LOL, Cisco , ZTNA and \"going swimmingly\" in the same sentence.   ",
              "score": 1,
              "created_utc": "2026-02-12 16:54:05",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4zhn04",
          "author": "Pure_Fox9415",
          "text": "“connect to VPN and see half the network.” is not a feature or problem of OpenVPN, you just didn\\`t setup network segmentation, did you?   \nI did not yet implement ZTNA, leaning towards it, but looking at it\\`s conceptions and realizations, I think that we need additional security guy or outsourcing team just to manage it. There is much more management and policy adjusting, than with traditional network and security settings.",
          "score": 1,
          "created_utc": "2026-02-12 14:27:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o51a0fy",
          "author": "Gesha24",
          "text": "Went with Cloudfrale WARP because company is sometimes very cheap.\n\nThe support is terrible, the ui is meh, it is nearly impossible to escalate any problems to anywhere. But - once you figure it out (by yourself usually) - it does work and it does work quite well. Though to be honest, especially for the small environment, there isn't really much practical difference between ZTNA and always-on VPN with split tunnel.",
          "score": 1,
          "created_utc": "2026-02-12 19:33:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o533eu2",
          "author": "PositiveHousing4260",
          "text": "A VPN is \"easier\". With that being said if the issue is improper network segmentation today, you are going to feel a lot of pain implementing Ztna. Ztna is to a concept that is implemented differently depending on the vendor. It's a lot of work but the question is, do you really need it? Fixing your existing VPN is much easier, especially if it is network segmentation. Long term you will probably need ztna but if it's not a requirement yet, I would slow roll it out to end users while keeping the VPN in place. Good luck. ",
          "score": 1,
          "created_utc": "2026-02-13 01:12:15",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r2njce",
      "title": "Roadmap to become a security engineer?",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1r2njce/roadmap_to_become_a_security_engineer/",
      "author": "Reasonable-Company20",
      "created_utc": "2026-02-12 07:53:54",
      "score": 9,
      "num_comments": 7,
      "upvote_ratio": 0.85,
      "text": "I'm a first year CS student with 2 software engineering internships at start ups. I want to know what the road map is to become a security engineer.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1r2njce/roadmap_to_become_a_security_engineer/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o4y65d1",
          "author": "youngm71",
          "text": "My roadmap was Network Ops > Network Engineering > Security Operations > Security Engineering > Security Architecture / Solution Architecture",
          "score": 3,
          "created_utc": "2026-02-12 08:20:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4y6fv2",
              "author": "Reasonable-Company20",
              "text": "So would you recommend I go for any of these works for internships?",
              "score": 2,
              "created_utc": "2026-02-12 08:23:29",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4ycc4m",
                  "author": "youngm71",
                  "text": "If you are keen on Software Engineering, go for it then pivot into Security Engineering in the Penetration Tester domain. Very good money in that area for skilled pen testers.",
                  "score": 1,
                  "created_utc": "2026-02-12 09:21:55",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4ydzcj",
          "author": "Luxim",
          "text": "I did: Comp Eng. bachelor while working part-time doing tech support for the university > Linux system administrator and DBA > Cybersecurity master's while working part-time as a software engineer > Junior security consultant > Operational security engineer at a big banking firm.\n\nIn general, you should keep in mind that most cybersecurity jobs require at least 4-5 years of experience in a related field, so it's quite common for people to get a CS or engineering degree, work in that field for a few years, then either go for an advanced degree or take cybersec certifications to land a cybersec job.",
          "score": 2,
          "created_utc": "2026-02-12 09:38:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4y75zu",
          "author": "cppnewb",
          "text": "Depends on the type of SecEng you want to be. If AppSec, spend 3-5 years working as a SWE first.",
          "score": 1,
          "created_utc": "2026-02-12 08:30:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o517ms0",
          "author": "Extra-Affect-5226",
          "text": "Hey! With your CS background and internships, you’re already on a great path. To become a security engineer, focus on learning networking, OS security, web security, and hands-on practice with labs or CTFs. SecPro Academy is a great way to get real-world, practical cybersecurity experience and fast-track your skills. You can check them out if you're interested.\n\n",
          "score": 1,
          "created_utc": "2026-02-12 19:22:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o54pvcd",
          "author": "lucina_scott",
          "text": "You’re already ahead with 2 SWE internships. Roadmap is basically:\n\n1) Strong fundamentals: Networking, OS, Linux, system design  \n2) Security basics: Web security, auth, crypto, common vulns (OWASP Top 10)  \n3) Hands-on: CTFs, labs, secure coding, break your own apps  \n4) Proof: Security projects, writeups, maybe bug bounties  \n5) Optional: Security+ / eJPT later\n\nSecurity engineers are basically strong software engineers who also think like attackers.",
          "score": 1,
          "created_utc": "2026-02-13 08:16:06",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qy1vmm",
      "title": "Potential cybersecurity engineering intern interview soon, how to not bomb the interview?",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qy1vmm/potential_cybersecurity_engineering_intern/",
      "author": "DeadLead300",
      "created_utc": "2026-02-07 02:39:08",
      "score": 7,
      "num_comments": 10,
      "upvote_ratio": 1.0,
      "text": "I have a referral from someone high up in a company for an open cybersecurity engineering internship this summer, I'm a college sophomore with no actual experience in the real world and not much to show project wise, I am wrapping up my ISC2 certification, how do I not bomb the interview? What kind of questions will I be asked? How can I talk around my lack of experience?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qy1vmm/potential_cybersecurity_engineering_intern/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o42tnoq",
          "author": "Altruistic-Sign5061",
          "text": "Mention:\n- courses you’ve taken (@college or online),\n- industries you follow (if you don’t have a LinkedIn.com profile, create one and choose to follow AI-tech companies of interest to you),\n- READ up on private companies / U.S. government in the cybersecurity “space”…\nGo into the meeting w/a positive attitude, high interest level, motivation to listen/learn, and a “will do” (= can do”) attitude — your enthusiasm will be noticed.\nBest of luck to you!",
          "score": 3,
          "created_utc": "2026-02-07 13:41:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o440dni",
              "author": "koojlauj11",
              "text": "Agreed, you should also ask the higher up for info about the role and company if they have some background. That’s if you have a good relationship. Showing that you’re staying updated on cyber security news and what they’re interested in. Having a set of good questions in preparation for the role. \n\nCheck on Glassdoor for info about the company and see what type of questions they ask if there are any. Look up the different type of interview questions and the psychology behind those questions. You want to understand this for all future interviews.\n\nFind someone who will do an interview with you in person. Practice interviewing in front of a mirror and record yourself. Play it back to see what verbal and nonverbal cues you can improve on.\n\nGo into speaking mode on ChatGPT, tell it to look up info about the company and similar role and tell it to do a mock interview and give you suggestions afterwards on how to improve. Keep doing this. Better if you find someone in a similar position or higher up role and request to do a mock interview with them. \n\nHere is a helpful resource as well a roadmap. \nhttps://roadmap.sh/cyber-security\nhttps://github.com/brootware/awesome-cyber-security-university\nhttps://youtu.be/p2268VGQc9E?si=W1KYFpAXRsKj2bED",
              "score": 1,
              "created_utc": "2026-02-07 17:23:48",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o40soh4",
          "author": "SavannahPharaoh",
          "text": "Focus on zero-trust. Say that because you’re new, you will especially adhere to zero-trust unless directed otherwise by your leadership.",
          "score": 1,
          "created_utc": "2026-02-07 03:29:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o42tszq",
              "author": "Altruistic-Sign5061",
              "text": "wtf r u talking about?",
              "score": 1,
              "created_utc": "2026-02-07 13:42:43",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o45c0qi",
                  "author": "SavannahPharaoh",
                  "text": "Do you not know what zero trust is?",
                  "score": 1,
                  "created_utc": "2026-02-07 21:29:08",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o48ccn3",
          "author": "dennisthetennis404",
          "text": "That's always so stressfull! Focus on showing you understand security fundamentals and explain your thought process when answering scenarios rather than trying to know everything. I don't know if you know what STAR technique is, but it always helps with answering hard questions, check it out!",
          "score": 1,
          "created_utc": "2026-02-08 10:21:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o49kg41",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-08 15:31:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o49kg6o",
              "author": "AutoModerator",
              "text": "Hello,\n\nYour comment was automatically removed because your Reddit account has significantly negative comment karma. We use this threshold to reduce disruptive behavior and maintain quality discussion in r/cybersecurity.\n\nIf you believe this was a mistake or would like to appeal, feel free to message the mod team.\n\nThank you.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CyberSecurityAdvice) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-08 15:31:40",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qxha0j",
      "title": "I'm making a C2 Server in Rust as a final year project. Am I making a mistake? (CS major)",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qxha0j/im_making_a_c2_server_in_rust_as_a_final_year/",
      "author": "rbx_64",
      "created_utc": "2026-02-06 13:13:42",
      "score": 7,
      "num_comments": 3,
      "upvote_ratio": 0.89,
      "text": "Title. It's about the only thing I could come up with after pondering for WEEKS. Does this make a good final year CS project?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qxha0j/im_making_a_c2_server_in_rust_as_a_final_year/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o3wb6oj",
          "author": "Sivyre",
          "text": "This would be a question for your professor. Reddit isn’t grading your final project, so you need to ask for their feedback. Only then will you know if it’s something to proceed forward with or if you’re back to the drawing board.\n\nWe don’t know the scope.",
          "score": 3,
          "created_utc": "2026-02-06 13:21:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3xfi4h",
          "author": "avbrodie",
          "text": "No your not making a mistake, you’ll be able to crank it out in no time using AI and have time left over to shag your girlfriend",
          "score": 2,
          "created_utc": "2026-02-06 16:44:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3yj01w",
          "author": "Sqooky",
          "text": "I don't think I'd make the C2 server itself in Rust, I'd probably go for something like Python, and have the agent be built in rust. Mainly for modularity purposes, going to be far easier to make changes to.",
          "score": 1,
          "created_utc": "2026-02-06 19:53:00",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r1u2mg",
      "title": "Need advice",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1r1u2mg/need_advice/",
      "author": "No-East-9272",
      "created_utc": "2026-02-11 10:41:30",
      "score": 7,
      "num_comments": 3,
      "upvote_ratio": 0.82,
      "text": "I completed my B. Tech in Computer Science with a specialisation in Cybersecurity in September, and since then, I’ve been actively applying for jobs. However, I’m finding that most cybersecurity roles require experience, and there seem to be very few opportunities for freshers. I’m feeling a bit stuck and unsure about my next move. Should I focus on certifications to improve my chances? If so, which certifications are actually worth pursuing for someone at an entry level? I’m interested in areas like blue teaming, monitoring, and vulnerability management, but I’m open to suggestions. I’d really appreciate guidance from people already working in the field.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1r1u2mg/need_advice/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o4u28tb",
          "author": "dudethadude",
          "text": "The chances of you moving directly into a cybersecurity role are kinda slim. Most of the time you start in help desk for a decent sized MSP and start learning how companies use computers, software, and networks to accomplish their task. Once you learn the industry standard for software/setups etc. then you will see how bad actors exploit them. Active Directory, Office 365, Azure are all common systems used by companies to function. Learning how these systems are administrated and then eventually how they are exploited is your “phase 2” stage. Eventually you will start helping out with security related tickets and hopefully move into a security only role.\n\nThis is gonna be hard to hear, but colleges have been selling lies since cybersecurity became the next big thing. They make it seem like all you need is a degree with homelab experience and your set. This is simply not true. Companies are not going to hire you into a cybersecurity role with little or no hands on IT experience. They want experience supporting businesses with their IT infrastructure because that’s how you actually learn the trade. Cybersecurity will always be something you grow into from a standard tech. You simply must have the hands on experience that comes from doing standard business support. \n\nIn short, college isn’t helping you skip the line. Start off in a help desk role and grown into a cybersecurity SME.\n\n\nI have no degrees, only 1 cert (CompTIA SecurityX) and I have been promoted to a security only role. I have been in IT since 2021 working on a help desk. I gradually become more and more security focused and was then labeled as a subject matter expert for Cybersecurity related tickets.",
          "score": 2,
          "created_utc": "2026-02-11 17:40:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4tiwx1",
          "author": "[deleted]",
          "text": "[deleted]",
          "score": 1,
          "created_utc": "2026-02-11 16:09:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4tnej2",
              "author": "No-East-9272",
              "text": "Thankyou for the advice I have  done all the tryhackme rooms( free tiew) and practicing home laps logging and detection",
              "score": 1,
              "created_utc": "2026-02-11 16:30:28",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r1qtcu",
      "title": "Help?",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1r1qtcu/help/",
      "author": "EstrangedDemon",
      "created_utc": "2026-02-11 07:21:30",
      "score": 7,
      "num_comments": 17,
      "upvote_ratio": 1.0,
      "text": "Ok so I’m a college student and I’m about 80% finish with my BAS in cyber security. The issue is during my time taking classes I haven’t found anything interesting about it. And it doesn’t seem as if it’s something I want to do. Should I finish it out and get the degree since I’m near completion or should I transition to a different major? Is the degree transferable to other careers? ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1r1qtcu/help/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o4tk7or",
          "author": "Ok_Wishbone3535",
          "text": "Not to be rude, but why did you choose the major initially?\n\n",
          "score": 1,
          "created_utc": "2026-02-11 16:15:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4tkg7w",
              "author": "EstrangedDemon",
              "text": "I like computers and technology. It’s just certain aspects I find pretty boring lol.",
              "score": 1,
              "created_utc": "2026-02-11 16:16:43",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4tm9zc",
                  "author": "Ok_Wishbone3535",
                  "text": "Not sure if it's possible but I'd look into networking instead of cyber.  I don't know any network guys who are laid off.  I know plenty cyber who are laid off.  Myself included, since March.  The market is simply cooked for anyone jr to mid level.  Seniors have the best chance.",
                  "score": 2,
                  "created_utc": "2026-02-11 16:25:13",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4tn1gw",
          "author": "rico_king",
          "text": "I started with a general studies bachelor degree in business. I then worked in IT and then cybersecurity. The degree just shows that you know how to learn and you proved it with the degree. Cybersecurity is very broad however and I am not sure what classes are boring. However maybe you are looking in the wrong place for options within the field. What made you want to do it ?? Maybe go back to that decision. Really what will count is how you choose a specialty within the field.",
          "score": 1,
          "created_utc": "2026-02-11 16:28:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4tnd92",
          "author": "JustAnEngineer2025",
          "text": "Finish the degree.\n\nHere is a little secret: You will never find a job that will interest you 100% of the time throughout your entire 40-50+ year career.",
          "score": 1,
          "created_utc": "2026-02-11 16:30:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4uu9hw",
              "author": "akayleireign",
              "text": "This. Don't waste money. Finish the degree and you can pivot/try things. It's just an HR box and isn't going to limit you to only cyber security. You could go do something entirely unrelated or get your masters in something else. Your job just has to be doable. Careers are to fund what you do the other 72 hours of your week (assuming 40hrs of work and 8 of sleep). Make your PERSONAL life interesting.",
              "score": 1,
              "created_utc": "2026-02-11 19:50:49",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4yae9w",
                  "author": "EstrangedDemon",
                  "text": "It was free & I don’t think I’ll find any job 100% interesting but I’m just not finding any thing remotely intriguing during my course work I’m kinda just going alone and passing the classes. I just figured I might want to stop before it’s too late and I have to restart and try something different. But Im just going to see it out seeing I’m this close and maybe I’ll find something in it before the finish line.",
                  "score": 1,
                  "created_utc": "2026-02-12 09:02:40",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4uzdvc",
          "author": "cyberguy2369",
          "text": "get a degree and get a job while youre in school to see what its really like. build some real world experience in the tech industry while you're in school so you see what its really like. what you're learning in class vs the real world can be very different. \n\nfinish your degree",
          "score": 1,
          "created_utc": "2026-02-11 20:15:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4yahu9",
              "author": "EstrangedDemon",
              "text": "Hard to do in my area. Tech jobs are far and few. Plus the ones that are around are extremely competitive to get in even on the entry level.",
              "score": 1,
              "created_utc": "2026-02-12 09:03:40",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4vjpw3",
          "author": "Extra-Affect-5226",
          "text": "Since you’re already 80% through your BAS in cybersecurity, you’re in a position where finishing could make sense, even if your interest has waned. A completed degree gives you flexibility, as many of the skills you’ve learned, like networking, risk assessment, systems knowledge, and basic IT, are transferable to roles in IT management, project management, or general tech support. Even if you don’t go deep into security, having the degree can open doors in tech-adjacent fields and make your résumé more competitive.\n\nIf you’re truly not interested in cybersecurity, you could start exploring minors, certifications, or courses in areas that excite you, like IT, cloud, data analysis, or project management, while finishing the degree. That way, you get the credential without closing other doors.\n\nFor advice on bridging your degree to practical skills and career-ready experience, check out SecPro Academy.",
          "score": 1,
          "created_utc": "2026-02-11 21:53:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o53wyuf",
          "author": "KiloEko",
          "text": "So you like tech? The security skills you are learning are valuable in any tech field. Finish it. I just started my cyber operations masters.",
          "score": 1,
          "created_utc": "2026-02-13 04:19:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4th0u2",
          "author": "joshisold",
          "text": "Any degree is better than no degree…it’s an HR block that will be filled.\n\nIf it’s not something you want to do, that’s fine. As for transferable, again, any degree is better than no degree.  Do you not want to be in the IT or security space at all?  Transferability will matter towards what you want to do…it may not help you chasing a career as an archaeologist, but certainly could in a variety of careers…you could pair it with a teaching credential and become a teacher or use it for something tangentially related.",
          "score": 0,
          "created_utc": "2026-02-11 16:00:46",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qzh2oe",
      "title": "Not sure if this the correct place to ask this.",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qzh2oe/not_sure_if_this_the_correct_place_to_ask_this/",
      "author": "bangboobie",
      "created_utc": "2026-02-08 18:45:24",
      "score": 6,
      "num_comments": 18,
      "upvote_ratio": 0.87,
      "text": "Assume that ISP is unavailable in the following case. Let's say that I go to a website in a browser session where I am not logged-in anywhere and I go to a website which doesn't require logging-in or just allows you to post \"anonymously\", so I post something and the big-brother doesn't like what I have posted.\n\nSo, big-brother subpoenas that website, get's the IP + Timestamp + User Agent String + whatever else they get. And then could that IP + Timestamp can later be sent to Google/Apple (assume that I am using an Android/iPhone) and can big brother ask these companies \"Hey you know a guy with this IP at this timestamp) and they start scanning push notification tokens, background processes, update checks, email checks? And open sockets or whatever and tell them the account information of my Apple ID/ Google Account?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qzh2oe/not_sure_if_this_the_correct_place_to_ask_this/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o4as9qt",
          "author": "kinopiokun",
          "text": "You should absolutely assume everything can be traced back to you, especially if your only obfuscation is “gee I hope the ISP is out of the picture”",
          "score": 2,
          "created_utc": "2026-02-08 19:01:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4aty96",
              "author": "bangboobie",
              "text": "I mean of course, I am just asking this out of curiosity and also the admissibility of this kind of evidence in court, for all heaven knows, governments have radars that could detect keystrokes on a computer which doesn't even have the capability or modems to connect to the network.",
              "score": 1,
              "created_utc": "2026-02-08 19:09:51",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4aup5f",
                  "author": "kinopiokun",
                  "text": "Then you should ask lawyers, not engineers ;)",
                  "score": 2,
                  "created_utc": "2026-02-08 19:13:30",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4iiyse",
          "author": "Left-Equivalent2694",
          "text": "Better question, what did you do?",
          "score": 1,
          "created_utc": "2026-02-09 22:37:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4oho13",
              "author": "bangboobie",
              "text": "Nothing really, just heard about it from someone and my instant thought was that if that is happening then VPNs on our phones are useless.",
              "score": 1,
              "created_utc": "2026-02-10 20:36:40",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4kmmm9",
          "author": "404mesh",
          "text": "It gets even deeper than this. Every website you visit, the server can collect a fingerprint. Law enforcement and large corporations are known to 1) have access to this data as it is on public serves, and 2) are sometimes explicitly collecting this data via external scripts. \n\nThat fingerprint is very unique to you and contains amongst a plethora of other things, your IP and whatnot. This is no good and not very many things protect from this. Even a VPN does not alter your devices fingerprint. Checkout fingerprint.com and try with/without a VPN or incognito. \n\nIt’s bad. Real bad.",
          "score": 1,
          "created_utc": "2026-02-10 06:27:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4kmope",
              "author": "404mesh",
              "text": "Some code as resistance type stuff:\n\nhttps://github.com/un-nf/404",
              "score": 1,
              "created_utc": "2026-02-10 06:27:50",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o4oi01u",
              "author": "bangboobie",
              "text": "I am surprised why most people not talk about this perhaps because they've settled for TOR Browser, but I have to admit that using TOR Browser is a bit frustrating due to speed constraints. But yes I went to a website called device info or something and it was quite something when I saw it lay it out my entire fingerprint, I am sure that something could be done about this but government likely don't want that.",
              "score": 1,
              "created_utc": "2026-02-10 20:38:14",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4omogx",
                  "author": "404mesh",
                  "text": "Yes, there are advanced tooling options with TLS terminating proxies like HAproxy and burpsuite, but the setup is long and profiling is limited to what the user understands. Oftentimes, these proxies carry headers and other things that identify themselves as such. These tools are not sufficient for fingerprint evasion. Neither are VPNs or any other existing tool.\n\nEven beyond JS, HTTPS headers, and TLS fingerprinting, a server can identify you from network level telemetry like the options within your IP/TCP packets. ToS, Max Segment Size, window size/scale, TTL, and more are used to build a fingerprint of your device. This is often how servers can detect containerized apps and processes.",
                  "score": 1,
                  "created_utc": "2026-02-10 21:00:04",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4pqr76",
          "author": "GaeRattlesnake",
          "text": "If all else fails, I hope you used the Trevor Moore technique.",
          "score": 1,
          "created_utc": "2026-02-11 00:26:00",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qyycyf",
      "title": "Possibility of a RAT malware or just a simple browser hijacker",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qyycyf/possibility_of_a_rat_malware_or_just_a_simple/",
      "author": "chupitrupi125",
      "created_utc": "2026-02-08 03:38:55",
      "score": 6,
      "num_comments": 8,
      "upvote_ratio": 0.88,
      "text": "Hello, cyber knights\n\nSo, I have this nagging feeling that I fucked up. I recently video sexted with my SO through discord (things got hot before my brain could think properly) which isn't inherently worrisome, but after all was set and done, we remembered that yesterday my SO had told me that the search engine on the laptop's Google Chrome had changed from Google to Yahoo, apparently my SO forgot to run an antivirus scan after that. Which brings me to my question, \n\nWhat is the likelihood the laptop is infected, and might it just be a simple browser hijack, or could it be a full RAT malware that screenshoted our video call? \n\nI'm in the process of explaining to my SO how to run the virus scan. The laptop hasn't had any programs or extensions installed recently, the only app I can think about is Stremio with Torrentio and some subtitle addons, and that was installed about 6 months ago. Also, the camera on the laptop is normally covered with tape (other that today for a few hours) where we were on a call for about 3 hours before the fun started. I'm really nervous and need to know what could be done in this case. Any help, suggestions, or advice is greatly appreciated.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qyycyf/possibility_of_a_rat_malware_or_just_a_simple/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o48qbnl",
          "author": "eric16lee",
          "text": "Odds are she installed something that promises Yahoo so it changed her default search engine in Chrome. This happens sometimes and is not an indication of malware. \n\nI don't know those 2 sites you mentioned, but they sound like you you may download crackes/pirated/free software z games or mods. If that is true, you should change that behavior immediately. There are no safe places for piracy anymore. You will learn the real meaning of browser hijack if you guys keep doing that.",
          "score": 6,
          "created_utc": "2026-02-08 12:27:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4jg21d",
              "author": "chupitrupi125",
              "text": "Thanks man. We ran a few scans and everything was clean, so I will assume that it was just some update or whatever that changed the browser, but we definitely learned something haha.",
              "score": 1,
              "created_utc": "2026-02-10 01:41:55",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o47curo",
          "author": "GamerZ_Sensei",
          "text": "Whats an SO?",
          "score": 1,
          "created_utc": "2026-02-08 05:01:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o47czkg",
              "author": "DrHerbotico",
              "text": "Sign on. Less secure than SSO",
              "score": 1,
              "created_utc": "2026-02-08 05:02:38",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o4ahozl",
              "author": "nastyws",
              "text": "Significant Other?",
              "score": 1,
              "created_utc": "2026-02-08 18:13:23",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o4db0c6",
              "author": "chupitrupi125",
              "text": "Secure Operator, used for some DNS proxies",
              "score": 1,
              "created_utc": "2026-02-09 03:02:29",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4db7o7",
                  "author": "chupitrupi125",
                  "text": "I don't know what I just wrote, I wanted to sound technically versed",
                  "score": 1,
                  "created_utc": "2026-02-09 03:03:31",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o47bxwu",
          "author": "DrHerbotico",
          "text": "Think about it in a positive way: your yams are immortal now!\n\nLess fun way to think about it:\n- nobody could imagine we'd be able to manage and interact with so much data 10 years ago\n- data organization is accelerating, not just increasing linear\n- LLM/VR\n\n= Creepy people may someday be able to put on goggles and live a personalized version of that call every day until their cum buckets runneth over",
          "score": 0,
          "created_utc": "2026-02-08 04:54:46",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r293aa",
      "title": "X data removal",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1r293aa/x_data_removal/",
      "author": "Dr_Hanz_",
      "created_utc": "2026-02-11 20:46:13",
      "score": 6,
      "num_comments": 12,
      "upvote_ratio": 1.0,
      "text": "I deleted my Twitter account when it became X but I just saw all my data was leaked in a recent breach. \n\nTheir contact and report page is a useless loop and there seems to be no way to actually submit a report requesting data removal unless I am law enforcement. \n\nHas anyone found a way to do this or do I need to buy a cop some donuts to get my data removed? ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1r293aa/x_data_removal/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o4va7kj",
          "author": "Cypher_Blue",
          "text": "Where do you live?\n\nThere are a bunch of places where you don't have the right to force them to remove data.",
          "score": 2,
          "created_utc": "2026-02-11 21:08:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4vgxsp",
              "author": "Dr_Hanz_",
              "text": "USA",
              "score": 1,
              "created_utc": "2026-02-11 21:40:14",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4vhxpv",
                  "author": "Cypher_Blue",
                  "text": "Generally the only place in the US where they're legally required to remove your stuff is California, AFAIK.",
                  "score": 1,
                  "created_utc": "2026-02-11 21:44:57",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o4vh4wf",
              "author": "Dr_Hanz_",
              "text": "If I have to move to remove my data I will loll..",
              "score": 1,
              "created_utc": "2026-02-11 21:41:10",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4wwv4j",
                  "author": "MonkeyBrains09",
                  "text": "You cannot at this point because you deleted your account.",
                  "score": 1,
                  "created_utc": "2026-02-12 02:30:11",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4w1qrr",
          "author": "Turbulent_Might8961",
          "text": "Ugh, that sucks. Good luck!",
          "score": 1,
          "created_utc": "2026-02-11 23:26:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4y43gy",
          "author": "Practical_Ride_8344",
          "text": "Also ...in the terms and conditions your post may have constituted a contract that removes your ownership and rights. Just 🤔",
          "score": 1,
          "created_utc": "2026-02-12 08:00:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4yuyjv",
              "author": "digitalfauxbia",
              "text": "And by posting about it here, their internal polices require them to retain it for at least the next 15 years.",
              "score": 1,
              "created_utc": "2026-02-12 12:09:04",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o50xyq2",
                  "author": "Dr_Hanz_",
                  "text": "And by that post getting 1k+ views my first born child is now sentenced to a life mining silica for Grok",
                  "score": 1,
                  "created_utc": "2026-02-12 18:36:41",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qxgh0i",
      "title": "W2 stolen",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qxgh0i/w2_stolen/",
      "author": "Available-Form6282",
      "created_utc": "2026-02-06 12:37:16",
      "score": 5,
      "num_comments": 5,
      "upvote_ratio": 0.86,
      "text": "Hi guys, hopefully this isn’t the wrong sub for this (delete if it is) but I found out yesterday someone in my company fell for a phishing scam and leaked everyone’s w2 forms. My company advised we make an IP PIN with the IRS and put credit freezes out with 3 companies (experian, I forgot the other two). I also filed my taxes last night after this happened. This is my first time dealing with potential stolen identity and that kind of threat. Is there anything else I should be doing to protect myself? The company said ALL personal info might be at risk (SSN, birthday, phone numbers, addresses, bank account numbers, credit cards, etc.) I just thought this sub might know. Thank you! ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qxgh0i/w2_stolen/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o3w85eo",
          "author": "jirajockey",
          "text": "Sorry to hear about this, data breaches suck, especially when it's due to a phishing. Your company gave solid starting advice with the IP PIN, and credit freezes. Just to fill in the blanks, the other two credit bureaus are Equifax and TransUnion, make sure you've frozen with all three to block new accounts from being opened in your name.Since all your personal info (SSN, DOB, addresses, bank details, etc.) could be out there, here's some specific, actionable steps to layer on top of what you've done. These are based on standard guidance from places like the FTC and credit agencies to minimize identity theft risks:\n\n1. Place a fraud alert on your credit reports: This is free and tells creditors to verify your identity before opening new accounts. Contact one bureau (e.g., Experian), and they'll notify the others. It lasts 1 year initially, or 7 years if you're already a victim of ID theft. Do this alongside the freezes for extra protection.\n2. Pull and monitor your credit reports: You're entitled to free weekly reports from AnnualCreditReport.com. Check for unfamiliar accounts, inquiries, or errors. Set up alerts with the bureaus for any changes.\n3. Change passwords and enable 2FA: Update passwords on all accounts, especially financial ones—use a password manager like Bitwarden (free) to generate strong, unique ones. Turn on two-factor authentication (2FA) everywhere possible to add a second layer against unauthorized access.\n4. Monitor your accounts closely: Review bank, credit card, and other statements daily/weekly for suspicious transactions. Set up transaction alerts via your bank's app. If bank details were exposed, consider closing and reopening accounts, but talk to your bank first.\n5. Watch for tax issues: You filed early, which is smart, it blocks scammers from filing a fake return. Keep an eye on mail from the IRS for any notices about duplicate filings or issues. If something pops up, respond quickly.\n6. Be extra vigilant against follow-up scams: With your phone/email exposed, expect more phishing attempts pretending to be from your company, IRS, or banks. Don't click links or share info—verify directly via official channels.\n7. Consider free credit monitoring if offered: Your company might provide this (many do after breaches). If not, services like Credit Karma or the bureaus' free tools can help track things. Paid identity theft protection (e.g., LifeLock) is an option for more comprehensive monitoring, but you can DIY a lot of it.\n\n IdentityTheft\\[.\\]gov for a personalized recovery plan, they have checklists based on what data was leaked.On the training side, since this started with a phishing scam, your company should absolutely roll out phishing awareness training to prevent repeats. It's not about blaming the person who fell for it—phishing is getting sneakier with AI-generated stuff—but educating everyone. Suggest they look into free resources like:\n\n* CISA's (Cybersecurity and Infrastructure Security Agency) free training materials and tabletop exercises for small teams.\n* KnowBe4's free Phishing Security Test to gauge how vulnerable employees are, plus their awareness training modules.\n* Terranova Security's free phishing kit with videos, infographics, and tips on spotting scams.\n* Wizer's free security awareness videos (1-minute bites) and phishing sims.\n\nFor yourself, take a quick free course like Amazon's 15-minute cybersecurity basics to sharpen your own skills. If the company doesn't act, maybe gently push HR—better training could save everyone from this headache again.Hang in there; acting fast like you did minimizes the damage.",
          "score": 4,
          "created_utc": "2026-02-06 13:03:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4hskzd",
          "author": "Boring_Radio_8400",
          "text": "Ask HR about signing everyone up in the company for one of those credit monitoring services at their expense. \n\nLegal will also have to be looped in. \n\nThis really sucks. Please be diligent and make sure your company stands up and does the right thing for everyone affected.",
          "score": 1,
          "created_utc": "2026-02-09 20:25:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4i55ei",
              "author": "Available-Form6282",
              "text": "Unfortunately we don’t currently have HR because HR was the one who leaked it 😭 we have interim people though. I’m not sure how to ask since I’m the lowest level employee and I live in a state that doesn’t value worker’s rights at all, although I suppose it doesn’t hurt to ask. \n\nAs far as legal goes, do you mean on their end or mine?",
              "score": 1,
              "created_utc": "2026-02-09 21:26:59",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4lz6tr",
                  "author": "Boring_Radio_8400",
                  "text": "Which state? There are online resources for all 50.\n\nYour company's legal department. You've been \"injured\" in a legal sense, and now you must be made whole (again, in legal terms).",
                  "score": 1,
                  "created_utc": "2026-02-10 13:21:59",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1r2fckk",
      "title": "IT Support to Cybersecurity",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1r2fckk/it_support_to_cybersecurity/",
      "author": "PerverseGameHen",
      "created_utc": "2026-02-12 00:56:04",
      "score": 5,
      "num_comments": 4,
      "upvote_ratio": 0.73,
      "text": "Hi everyone, hoping to get some honest advice from people already working in cybersecurity.\n\nMy IT background (4 years) has been heavily user-facing and centered around end user support, i'm sick and tired of helping people restart their computer and unplug and plug in their monitors. I handle laptop troubleshooting, device deployments, incident tickets, onboarding/offboarding. Worked with Microsoft 365, SCCM, and have some exposure to Active Directory, Networking and audio-visual systems.\n\nI’ve also worked in environments that use security tools like endpoint protection and data loss prevention, but my involvement has mainly been from the client. As in on user's laptops itself.\n\nI’m based in Singapore and have completed a Bachelor’s in Computer Science. I also hold a Diploma in Network Defense and Forensic Countermeasure and AWS Certified Cloud Practitioner certificate.\n\nMy goal is pretty straightforward — I want to move out of IT end user support and get my foot in the door in cybersecurity at ANY level. \n\nA few things I’d really like clarity on:\n\n1) Certificates - I know this question has been asked to death in this subreddit but seriously, what should I target first?\n\n2) Experience - I understand that 'Home Labs' are one way for someone with no experience to get the relevant experience, what would you suggest I should focus on learning and creating as a base project first.\n\n3) Skill - What skill is a must have in this field? I'm thinking I should break it down and start studying each one to an extensive amount. I have a lot of technical knowledge but not an expert in any specific part of IT other than end user troubleshooting.\n\n3) Pivot - If you made the breakthrough to cybersecurity from any helpdesk related field, how did you do it and what was your personal experience?\n\nI’m motivated and fully prepared to put in the work — just want to make sure I’m focusing my effort in the right areas instead of spinning my wheels.\n\nWould really appreciate any kind of guidance.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1r2fckk/it_support_to_cybersecurity/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o4xucv1",
          "author": "Which-Breadfruit7229",
          "text": "You already have 4 years worth of IT support experience, along with 2 years of Active Directory, M365, and SCCM experience as foundational experience in Cyber Security.  Cyber is not entry-level but rather it is mid-IT, which means you have already positioned yourself in Mid-IT.\n\nCertifications\n\nYou should not collect random any list of certifications just for the sake of obtaining them. You should choose to follow a specific pathway prior to gaining any certifications.\n\nHR-Friendly Certification: CEH (EC-Council)\n\nCloud Certification Route: AWS Cloud Security (later), Azure Cloud Security Fundamentals\n\nYou want to be focused on paving the way for yourself with direction rather than stacking certificates.\n\nHome Lab\n\nKali is not enough.\n\nBuild Labs:\n\nSmall Active Directory Lab; Active Directory Domain Controller and 1 to 2 computers.\n\nSimulate attack scenarios: password spraying, misconfigurations\n\nInstall SIEM Solutions; Wazuh or Splunk Free Trials\n\nCreate 2-3 detection rules\n\nDocument your labs and builds on GitHub.\n\nThat alone will set you apart from others\n\nApplicable Skills\n\nNetworking, with the ability to articulate and explain in depth.\n\nLog Analysis\n\nBasic Scripting Knowledge.\n\nAuthentication Protocols (Kerberos / OAuth Basics).\n\nBest Pivot Strategy\n\nKeep your internal transfers in front of managers vs apply cold to postings so you have probable influence.\n\nYou should volunteer to assist with patching, alerts, and vulnerability scans in order to build a relationship with the security team.\n\nYou do not have to be a master at everything. You only need to be a productive contributor in a specific knowledge area.",
          "score": 2,
          "created_utc": "2026-02-12 06:30:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4xoow2",
          "author": "Responsible_Bag_2917",
          "text": "Look into the Cyber Range by Josh Madakor. Also check out his youtube channel for free cybersecurity labs and info on how to break in.\n\nAs far as certs in your case i’d do something like Google Cybersecurity Certificate —> Security+ —> CySA+ —> AZ-900 —> CISSP",
          "score": 1,
          "created_utc": "2026-02-12 05:41:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4zk5t4",
              "author": "kuniggety",
              "text": "I would recommend a similar path as this. \n\nIt also ultimately depends what direction they want to go in cybersecurity since it's a big field. Offensive Security, HtB, and CyberDefenders are great resources depending on if they want to go the blue or red routes.",
              "score": 2,
              "created_utc": "2026-02-12 14:40:41",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o54s37m",
          "author": "hawey222",
          "text": "Also in a similar situation. 2 1/2 years in end user support. Have A+, Net+, Sec+, and ITIL Foundation. Currently in college for cyber and information assurance. Even Jr. SOC analyst positions want 2+ years of cyber experience ",
          "score": 1,
          "created_utc": "2026-02-13 08:36:57",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r0rg8f",
      "title": "Friend Got Hacked. Any tips?",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1r0rg8f/friend_got_hacked_any_tips/",
      "author": "Cosette_Aurora",
      "created_utc": "2026-02-10 04:46:19",
      "score": 4,
      "num_comments": 8,
      "upvote_ratio": 0.84,
      "text": "My friend recently got hacked due to a hacker getting into her friend’s account and sending her a link. She trusted it was her friend and downloaded the software. She’s resetting her computer but the hacker has all passwords that were on it. They also emailed her and threatened to kidnap her child. Is there anything that can be done to legally handle it or is it just reporting them and hoping something is done? I’m a little worried for her safety as the hacker could have gotten sensitive personal information. Any help is really appreciated, thank you.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1r0rg8f/friend_got_hacked_any_tips/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o4ldb81",
          "author": "Tade365",
          "text": "Reset passwords from a different device, enable 2fa if you havent already, clean reinstall windows (not reset, grab a usb with a windows installer, only back up absolutely necessary files yada yada) and as to \"handling it\" reporting the friend will not do anything directly except prevent more spread, just block and move on, also probably dont allow the friend internet access if she clicks random links... Just a thought",
          "score": 4,
          "created_utc": "2026-02-10 10:39:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4m613g",
          "author": "eric16lee",
          "text": "From a clean device, NOT your PC:\n\n1. Change ALL of your passwords to something unique and randomly generated. Use a password manager like BitWarden or 1Password to help with this. \n2. Choose the option to log out of all active sessions or devices. \n3. Enable 2FA on all of your accounts \n\nIf you are guilty of 2 or 2a continue below:\n\n4. Nuke your PC from orbit\n- back up only important files, not games or applications \n- format your hard drive \n- reinstall Windows from a USB drive (do not use the Reset Windows option from the settings menu)\n\nThis may seem like overkill, but if you want assurance that you have remediated the problem, this is the way to go. \n\nUnfortunately, the only people that can help you are the support teams for those services. Most free services only offer automated account recovery. If that process doesn't get the accounts back, nobody here can help you. \n\nEVERYONE that contacts you via DM offering to help or to hack the accounts back is just an account recovery scammer looking to take advantage of your situation and steal money from you. \n\nGoing forward, your friend need to follow this rule: NEVER click on links or attachments unless you were expecting them from a trusted source. Both of these conditions need to be true before you click. In your friend's case, the link came from a trusted source, but they were not expecting it.  I won't even click a link from a family member unless I have a heads up and some context of what they are sending. :)",
          "score": 3,
          "created_utc": "2026-02-10 14:00:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4m8zvl",
          "author": "jirajockey",
          "text": "report here [https://www.ic3.gov/](https://www.ic3.gov/)  \nLikely the hacker is not even in the country, as it includes a threat of kidnapping, FBI might be interested.",
          "score": 2,
          "created_utc": "2026-02-10 14:16:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4k9pfg",
          "author": "AutoModerator",
          "text": "Hello,\n\nYour submission was automatically removed because your Reddit account does not meet our minimum karma or account age requirements. These measures help maintain the quality of posts on r/cybersecurity and prevent spam.\n\nRequirements:\n- Minimum of 20 comment karma OR 20 link karma\n- Account age of at least 10 days\n- Combined karma of at least 40\n\nTo build your karma, participate in discussions across Reddit and contribute thoughtful content in subreddits that welcome new users.\n\nIf you believe this was a mistake or have any questions, please message the mod team.\n\nThank you.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CyberSecurityAdvice) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-10 04:46:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4m07fk",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-10 13:27:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4m07ho",
              "author": "AutoModerator",
              "text": "Hello,\n\nYour comment was automatically removed because your Reddit account has significantly negative comment karma. We use this threshold to reduce disruptive behavior and maintain quality discussion in r/cybersecurity.\n\nIf you believe this was a mistake or would like to appeal, feel free to message the mod team.\n\nThank you.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CyberSecurityAdvice) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-10 13:27:52",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4majmc",
          "author": "rico_king",
          "text": "If you feel there is a threat to someone’s safety, you can report locally or call 911. But reporting to the FBI using their website.\n\nHere is a great resource to help you as well: https://hacked.com/report-hacker/?gad_source=1&gad_campaignid=22874441442&gbraid=0AAAAAC2W-sA-o_FUI8W-pu6YaA73gTfe7&gclid=Cj0KCQiAy6vMBhDCARIsAK8rOgkMnVHBQzI1-jPcEyoAip4XPAsIVBCF8guFpoDNPPPLg56rJNtM8ToaAqkwEALw_wcB",
          "score": 1,
          "created_utc": "2026-02-10 14:24:31",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qyoanu",
      "title": "Career switch from SAP Security to IAM or AppSec",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qyoanu/career_switch_from_sap_security_to_iam_or_appsec/",
      "author": "LoOkkAttMe",
      "created_utc": "2026-02-07 20:21:52",
      "score": 4,
      "num_comments": 0,
      "upvote_ratio": 1.0,
      "text": "I'm currently thinking my way out of the SAP ecosystem, I have more than 10+ years of experience mainly users management and authorizations, SoD..\n\nI've done PWPA (TCM web pt cert), I completed the web pt path in HTB (without going for the exam), I have solid knowledge of web applications, protocols and tools (like Burp), web vulnerabilities (SQLi, SSRF, CSRF, XXS and many more).\n\nI've also done B.Sc. in computer science, understanding code (to review it and write ofc)\n\nI wanted to ask your advice:\n\n1 - Can I somehow translate my years of exprience and knowledge to enter the AppSec role? How? what am I missing? what roadmap would you suggest (studying or job before entering the AppSec)\n\n2 - And if not (whihc is most likley lol) What should I study to get closer to AppSec and get the first job? Any idea for side projects? any ideas for certs? any idea for roadmap? books?\n\n3 - Should I aim more for IAM engineering (or other IAM related title)? which might be more close to my expreience?\n\nShould I study Entra or Okta? Should I study cloud (Azure or AWS)? or something else?\n\n4 - What other roles in Cybersecurity are more close for my exprience?\n\nI'm really open-minded and can find intrest in almost any role, so open for suggestions and advices\n\n5 - Lastly, I thought about doing CISSP (most for the challange, and I have 10+ years in 2 of 8 domains) what you think about it?\n\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qyoanu/career_switch_from_sap_security_to_iam_or_appsec/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": []
    }
  ]
}