{
  "metadata": {
    "last_updated": "2026-01-27 02:39:57",
    "time_filter": "week",
    "subreddit": "CyberSecurityAdvice",
    "total_items": 14,
    "total_comments": 164,
    "file_size_bytes": 183914
  },
  "items": [
    {
      "id": "1qkrxgt",
      "title": "If cybersecurity is not an entry level job then HOW AM I SUPPOSED TO GET IN???",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qkrxgt/if_cybersecurity_is_not_an_entry_level_job_then/",
      "author": "Capable_Mixture_3205",
      "created_utc": "2026-01-23 14:15:25",
      "score": 144,
      "num_comments": 223,
      "upvote_ratio": 0.85,
      "text": "will graduate in 5 years. how to get into cybersecurity?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qkrxgt/if_cybersecurity_is_not_an_entry_level_job_then/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o18r05r",
          "author": "Cottrell217",
          "text": "You start at a lower level role like Helpdesk and work your way up. As others have said, security has never been an entry level role. You can’t protect systems and networks if you don’t know how they work. You learn a lot of that through help desk",
          "score": 62,
          "created_utc": "2026-01-23 14:24:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1el48l",
              "author": "CombinationEntire552",
              "text": "I completely agree with you, starting from a lower-level role like Helpdesk is a great way to gain experience and work your way up. Additionally, having a strong foundation in IT and networking is crucial for a career in cybersecurity. I'd recommend exploring online courses or certifications that focus on these areas to get started.",
              "score": 1,
              "created_utc": "2026-01-24 10:30:41",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o1ge6kw",
              "author": "stravar",
              "text": "I think it's really hard to even get a helpdesk role these days",
              "score": 1,
              "created_utc": "2026-01-24 17:03:47",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o1am60u",
              "author": "HereSo-IDontGetFined",
              "text": "That's b*******. What is the point of going to college to learn? If that's the case you should be able to skip college and go straight to the employer since you're going to get your education through them anyways. \n\nThe \"that's the way it is\" boomer mindset is exhausting and a retardant to progress.",
              "score": -3,
              "created_utc": "2026-01-23 19:34:55",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1bblvw",
                  "author": "Incid3nt",
                  "text": "That's on the college and not on the community at large.  And you can skip college and go straight into it, its just tough.  It's kind of like college teaches you all about the ins and outs of locks, how to pick them, etc. But to step in this role you need to learn how to run an entire compound, do security checks, know the processes and routines within it.\n\nThey shouldn't be churning out these cybersecurity degrees like they are, for sure.",
                  "score": 10,
                  "created_utc": "2026-01-23 21:34:34",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1cf90j",
                  "author": "-hacks4pancakes-",
                  "text": "We generally aren't the ones who overyhyped 23952803592385 open jobs in cybersecurity without any specifics about what actual niches or seniority they existed in. This same crap happened to web dev and software engineering. The mad rush for the field, huge overselling by schools, influencers, and bootcamps, Then there were way too many juniors for available junior jobs, add in outsourcing and offshoring, and as a result:  \n  \n\\- overall salaries dropped drastically  \n\\- job requirements went up continually to filter out candidates  \n\\- people who used to get in on self study and passion (rightly) no longer stood much of a chance.\n\nThe bottom line is the cybersecurity degree programs already skip a lot of important computer foundations to fit a ton of hacking material into 4 years, and there are just too many graduates who also have help desk experience or a previous career in IT to not filter on that. Its in the hundreds; just impossible numbers. It sucks.",
                  "score": 10,
                  "created_utc": "2026-01-24 00:59:16",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1cvjmr",
                  "author": "BraveUnderstanding15",
                  "text": "I skipped college and I’m a principal security engineer in my 30s. Not everyone needs college if you can figure it out on your own. Most people can’t though, and that’s why they goto college.",
                  "score": 7,
                  "created_utc": "2026-01-24 02:34:15",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1bv39m",
                  "author": "Turdulator",
                  "text": "lol, I’ve been doing IT for 20 years with a BFA in studio art.     The degree is so your resume doesn’t get thrown away immediately.    There are many companies that won’t hire anyone without a degree for any position, the purpose of the degree is so you can get those jobs.",
                  "score": 8,
                  "created_utc": "2026-01-23 23:10:26",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1d1a5p",
                  "author": "cheetah1cj",
                  "text": ">boomer mindset \n\nBoomer mindset while suggesting that college is needed is hilarious to me. Most of my coworkers and friends in IT did not go to college or still needed an internship or entry level job to get into IT.\n\nCollege teaches you a lot of technical stuff, but it really doesn't show the real-world aspect. Our teammates that didn't work in HelpDesk or another IT field before getting to Security Analyst struggle to know what a legitimate issue is and what'sa false positive; and they often rely on our Sysadmin team to explain it and explain why it's not a risk.\n\nPersonally, I think telling everyone they need college is BS, but I get that there are IT jobs out there that need it, such as developers, cybersecurity, etc. But they also still need the real world experience.\n\nIt's the same for someone getting a business degree and expecting to just immediately be hired as a manager with no experience. While it's possible and it does happen, not as often and it shouldn't. Managers with no experience are some of the worst, most out of touch managers. CIO's with no IT experience are terrible at their job. It is a different skillset than a sysadmin, but the experience makes a big difference.",
                  "score": 4,
                  "created_utc": "2026-01-24 03:07:56",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1dsupa",
                  "author": "hitman133295",
                  "text": "College can’t keep up with real life technology. In cybersecurity there’s new vulnerabilities every day. You need lots of experience to quickly prevent it",
                  "score": 4,
                  "created_utc": "2026-01-24 06:16:43",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1gsjpk",
                  "author": "Christiansal",
                  "text": "I’ll save you the long explanation that I’m sure everyone’s already provided you kid. Get a job in IT first.",
                  "score": 4,
                  "created_utc": "2026-01-24 18:06:54",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1jdn6o",
                  "author": "sa1nt1775",
                  "text": "The problem is right out of college, you're competing with a lot of other people who already have certifications, degrees, AND experience. The reason people suggest helpdesk and other entry level IT positions first is hiring straight into a Cybersecurity role out of college with no experience is rare. I'm sure there are some opportunities there, but a lot of them at least require an internship.\n\nThe people making these comments aren't making the rules or even doing the hiring in most cases. I'm not sure if uou have checked out the job market lately, but even experienced roles are getting hundreds or thousands of applications. What sets a fresh college graduate apart from another college graduate with no experience for an entry-level Cyber role?",
                  "score": 2,
                  "created_utc": "2026-01-25 01:36:16",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1jge0u",
                  "author": "dudethadude",
                  "text": "You’ve been sold a lie. You don’t have to go college to learn. That’s what colleges will tell you so you give them money. You start in help desk roles and gain knowledge while working with clients and co workers. \n\nYou then start assisting with cybersecurity related tickets and eventually handle them yourselves. I have been in IT for five years and this is exactly what I did. I have recently been promoted to a security only position.\n\nColleges are selling lies to gullible kids and parents. “Mom and Dad say I need to go to college so I can get a job” is something I keep hearing.\n\nEVERYONE HAS DEGREES NOW!\n\nIt’s not like it was back in their (parents) day where a degree set you apart. Cybersecurity requires hands on, real world work to become proficient. College lectures and school projects are enough to build you from scratch and fill it knowledge gaps, but not enough to land you a job.\n\nI am 25 years old btw.",
                  "score": 2,
                  "created_utc": "2026-01-25 01:51:19",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1r2iig",
                  "author": "Euphorinaut",
                  "text": "\"if that's the case you should be able to skip college and go straight to the employer since you're going to get your education through them anyways.\"\n\nYeah that's what I did.",
                  "score": 2,
                  "created_utc": "2026-01-26 03:14:08",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1hs1or",
                  "author": "Safe-Resolution1629",
                  "text": "100%",
                  "score": 1,
                  "created_utc": "2026-01-24 20:44:58",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1n99dz",
                  "author": "entropyweasel",
                  "text": "That is exactly what you should do. \n\nNone of those tailor made cyber degrees are anything but a money grab.",
                  "score": 1,
                  "created_utc": "2026-01-25 16:48:38",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1q03n6",
                  "author": "Bmack67",
                  "text": "1- college is the least valuable it’s ever been\n\n2- i skipped college and went right to IT help desk and eventually specialized in security.\n\nI’ve seen it fairly consistently in the workplace that people who come right from a cybersecurity program are much less suited to work in security than those who have generalized IT experience.",
                  "score": 1,
                  "created_utc": "2026-01-26 00:00:39",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1s5dzy",
                  "author": "Conscious_Ad_9684",
                  "text": "\\*you should be able to skip college and go straight to the employer since you're going to get your education through them anyways\\*\n\n  \nDing Ding Ding!\n\nThis has been the case for like 20 years now. I've had quite a few friends pass A+ cert in High School, get a job as help desk during summer, then after graduation get started working, bypassing college all together.  One guy I knew did both community college courses in the evenings while doing help desk work during the summer.\n\nCollege is not necessary.",
                  "score": 1,
                  "created_utc": "2026-01-26 07:45:21",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1sw7ay",
                  "author": "Specialist_Crazy8136",
                  "text": "College is theory - not practice.",
                  "score": 1,
                  "created_utc": "2026-01-26 11:42:26",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1x3tkp",
                  "author": "datOEsigmagrindlife",
                  "text": "If you don't like the process, you can go scrub toilets as I have thousands of qualified candidates who are infinitely better than new graduates lined up for jobs.\n\nI'll personally never give another cybersecurity new graduate another chance until they've got some experience.\n\nEvery last one has been useless.",
                  "score": 1,
                  "created_utc": "2026-01-26 23:44:48",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1i2fog",
                  "author": "hotelshowers",
                  "text": "Please grow up and stop censoring a bad word on Reddit. Keep that shit on TikTok",
                  "score": 1,
                  "created_utc": "2026-01-24 21:34:10",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1j3nih",
                  "author": "MerpoB",
                  "text": "I took an anatomy class. That means I'm pre-med and can do open heart surgery right? I mean, residency is going to teach me everything so why take college?",
                  "score": 0,
                  "created_utc": "2026-01-25 00:41:18",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1kft03",
                  "author": "EggsEggsEggsTentacio",
                  "text": "What are you gonna do about it",
                  "score": 0,
                  "created_utc": "2026-01-25 05:19:56",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o19ej9z",
              "author": "dokkanic",
              "text": "do not ever start at helpdesk - it analyst or it administration. help desk / call center is a trap.",
              "score": -6,
              "created_utc": "2026-01-23 16:16:27",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1bz5h5",
                  "author": "Luxim",
                  "text": "Helpdesk/first line support in a corporate environment is very different from call centre work.",
                  "score": 6,
                  "created_utc": "2026-01-23 23:32:02",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o1cvm82",
              "author": "Internet-of-cruft",
              "text": "As an example of this, here's what I did.\n\n\n----\n\n\nI did software for a while (like ~7 years), then switched to network engineer - route/switch/network security then got involved in a lot of non-network stuff (traditional data center, cloud), and security adjacent stuff because \"you do firewall stuff\".\n\n\nIt was a gradual process over many years of gaining experience on infrastructure until it shifted to outright security focus.\n\n\nI now do *a lot* (if not all) of my company's Cybersecurity implementation because I took on the small bits and built up the knowledge over many years.\n\n\nThis is now 10 years at my current job.\n\n\nI'm working with a guy who did IT related work for about 6 years before he got hired as the \"Cybersecurity engineer\" - he did a whole lot of training and he has a ton of people that have actual experience that he can learn from, as well as being forced to learn it as a job duty.\n\n\nThat is not typical, and he got super lucky with landing into the role. He's got a good future ahead of him, but he realizes that he lacks understanding of the actual infrastructure because that was never a focus for him even in his \"IT only days\".",
              "score": 0,
              "created_utc": "2026-01-24 02:34:41",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o1a2u5d",
              "author": "Diligent_Mountain363",
              "text": "This is bad advice, OP. Reimaging laptops and resetting passwords is not a springboard to a cyber security career lmao. It isn't 2004 anymore.",
              "score": -6,
              "created_utc": "2026-01-23 18:07:08",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1afxcl",
                  "author": "Cottrell217",
                  "text": "That’s still experience. OP doesn’t have to *only* do those things. They can take on more responsibilities outside of that or do projects on the side to learn about different things. But you can’t sit here and tell someone who doesn’t have any experience that they can just jump into a higher role and completely skip the basics. Too many people have heard “just get your security+ and you can work from home making 6 figures with no experience” and tried to jump into cyber with absolutely zero clue about any fundamental concept in IT. I’m not saying they need to stay in Helpdesk forever, because yes it sucks, but it’s a good place to start with absolutely no experience. You can go in many different ways from Helpdesk.",
                  "score": 2,
                  "created_utc": "2026-01-23 19:05:35",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1bvhlc",
                  "author": "Turdulator",
                  "text": "Nah, that’s entry level Helpdesk at a large company…. But entry level Helpdesk at a smaller company lets you get involved in so much more than that mindless repetitive stuff.",
                  "score": 1,
                  "created_utc": "2026-01-23 23:12:33",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1bzu9u",
                  "author": "Luxim",
                  "text": "Doesn't have to be full-time or even tech support at all, the important bit is gaining some IT experience.\n\nI personally did part-time tech support while getting an engineering bachelor, then Linux system administrator, then went back to school for a cybersec master's while working as a software engineer, IT consulting for a year, and now finally working as a cybersecurity officer.",
                  "score": 1,
                  "created_utc": "2026-01-23 23:35:43",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o18q7hx",
          "author": "[deleted]",
          "text": "[deleted]",
          "score": 48,
          "created_utc": "2026-01-23 14:20:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1ani3s",
              "author": "Old-Ad-3268",
              "text": "And to elaborate, experience working on networking or applications or just about any other IT function",
              "score": 1,
              "created_utc": "2026-01-23 19:41:12",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o1c9y4n",
              "author": "VE3VVS",
              "text": "definitely experience I had put in almost 30year in IT before I became indoctrinated into the world cybersecurity, so patience grasshopper, somethings only time will yield. ;-)",
              "score": 1,
              "created_utc": "2026-01-24 00:30:20",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o1anf3a",
              "author": "HereSo-IDontGetFined",
              "text": "If it's not an entry level field, then how did the first employees in the field get in? \n\nExactly. It's not entry level because there's gatekeepers and b******* bureaucracy.",
              "score": -6,
              "created_utc": "2026-01-23 19:40:49",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1athae",
                  "author": "eNomineZerum",
                  "text": "The first cybersecurity practitioners were damn good experts in their respective fields. They weren't fresh college grads who have never supported any devices beyond their grandparents desktop. \n\nNowadays you have fresh grads who have never even had an internship claiming they are too good for help desk.",
                  "score": 6,
                  "created_utc": "2026-01-23 20:09:08",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1axyvy",
                  "author": "mrbiggbrain",
                  "text": ">If it's not an entry level field, then how did the first employees in the field get in?\n\nReal, not bullshit answer. \n\nThey where already in it. Like just about every IT specialty at one point it was a small enough domain that it wasn't a specialty. If the sum of the security field is logging onto a unix box and configuring a firewall, then unix admins just configure the firewall. \n\nAs the domain got more and more advanced the required skills got wider and wider. At a non-exact point it became difficult to possess both the skillset needed to be an expert in cyber security and another domain. \n\nPeople don't get into specialties, they become someone who works in specialties as they learn and specialize. \n\nIt's similar to executives, very few people start off as executives. They gain knowledge in a domain that leads to gaining skills relevant to executives, Eventually their skillset matches to expectations and they move across the line to a title more aligned with \"Executive.\"",
                  "score": 3,
                  "created_utc": "2026-01-23 20:30:24",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1bt2tr",
                  "author": "Turdulator",
                  "text": "The very first cybersec professionals were the top level sysadmins at companies who’s leadership said “oh shit, we need someone to focus on security now, you’re our smartest guy, we’re making this your problem now”",
                  "score": 3,
                  "created_utc": "2026-01-23 22:59:48",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1btg01",
                  "author": "Turdulator",
                  "text": "“If being a CTO isn’t an entry level job, how did the first CTO get that job?”",
                  "score": 3,
                  "created_utc": "2026-01-23 23:01:43",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1apv27",
                  "author": "nimajnebsiem",
                  "text": "If that's the sum of your logic and comprehension skills, that's the reason why you can't get a job in the field.",
                  "score": 6,
                  "created_utc": "2026-01-23 19:52:10",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1cskck",
                  "author": "Blitzjuggernaut",
                  "text": "No, the real issue is because to be decent at cybersecurity you need a really good understanding of the fundamentals. You need to be proficient in Networking, operating systems, hardware and understand how things work before jumping in, in addition to the different cyber security fundamentals. There's just so much to understand that's not just labeled \"cyber security\" that's why it's not entry level. People should really research before just picking something.",
                  "score": 2,
                  "created_utc": "2026-01-24 02:16:56",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o18qg8s",
              "author": "Capable_Mixture_3205",
              "text": "how can I get experience if I can't get a job?",
              "score": -19,
              "created_utc": "2026-01-23 14:22:09",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o18qsni",
                  "author": "Getshrektnerd",
                  "text": "Help Desk",
                  "score": 23,
                  "created_utc": "2026-01-23 14:23:54",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1938l7",
                  "author": "No-Tea-5700",
                  "text": "Well that’s the thing some people win and some people lose, not everyone wins a cyber six figure job",
                  "score": 2,
                  "created_utc": "2026-01-23 15:25:24",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o19azx7",
                  "author": "iwillnotbeknown",
                  "text": "Learn servers, active directory, networking, web apps.\n\nSecurity is about protecting them assets and make sure the configurations are good and healthy, if you don't know about any of them how are you going to protect them",
                  "score": 2,
                  "created_utc": "2026-01-23 16:00:36",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1abxi7",
                  "author": "buttholeDestorier694",
                  "text": "You start at help desk, then move to sys/network admin.\n\n\nVery few individuals will move directly into cyber security. \n\n\nAbout 5-10 years ago if you had a degree you could've done this, but nowadays. It aint happening.",
                  "score": 2,
                  "created_utc": "2026-01-23 18:47:33",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o19yy0z",
                  "author": "S4LTYSgt",
                  "text": "I mean you cant get any job in IT? Because the market is bad. You dont have to do Help Desk. I started off as a Network Engineer. I did do 3 internships in college that helped me skip the whole Help Desk/IT specialist. You can become a Jr SOC Analyst. There are some company that hire entry level. But lets say there are only 10,000 entry SOC roles and 100,000 applicants. Guess what, unless you are the lucky 10,000 to get the soc role, you will have to work in other IT positions unless you want to be unemployed. And if you arent getting any IT roles after one year, the industry is already saturated. Just switch to another industry. We have too many people now.",
                  "score": 1,
                  "created_utc": "2026-01-23 17:49:41",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1bqudw",
                  "author": "Turdulator",
                  "text": "Helpdesk then sysadmin then security… would you hire a carpenter who’s never been inside a house? A mechanic who’s never driven a car? A plumber who’s never shit in a toilet?",
                  "score": 1,
                  "created_utc": "2026-01-23 22:48:15",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o18qy5t",
          "author": "[deleted]",
          "text": "[deleted]",
          "score": 21,
          "created_utc": "2026-01-23 14:24:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1caejv",
              "author": "Pookias",
              "text": "I got into cybersecurity through a unique program for people graduating high school. Entry level opportunities do exist but they're few and far between.",
              "score": 1,
              "created_utc": "2026-01-24 00:32:47",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o18rgn8",
              "author": "Capable_Mixture_3205",
              "text": "can you give me more info about your personal projects?",
              "score": -1,
              "created_utc": "2026-01-23 14:27:18",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o18zfzf",
                  "author": "hkusp45css",
                  "text": "I love it when a professional says the equivalent of \"I got lottery ticket lucky to get in like I did, 15 years ago\" and INVARIABLY the next response is going to be some form of \"tell me how to do it like you did\"\n\nLike, they just did. They said it was dumb luck. So much so that they've never met another person that lucky.",
                  "score": 3,
                  "created_utc": "2026-01-23 15:07:18",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o18stdf",
          "author": "xb8xb8xb8",
          "text": "you pivot to cybersec from development/sysadmin and similar roles",
          "score": 15,
          "created_utc": "2026-01-23 14:34:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1b1d4l",
              "author": "No-Main3801",
              "text": "And you get to sys admin by being on helpdesk first everyone wants fast results without gaining foundational experience you want to protect a companies computers but don’t wanna get the experience to fix and learn how said computers work is crazy !",
              "score": 9,
              "created_utc": "2026-01-23 20:46:27",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1cw9t0",
                  "author": "BraveUnderstanding15",
                  "text": "Yes. I don’t know where the entitlement came from in these newer folks studying security, but it has never been an entry-level career. I’ve made posts explaining this on LinkedIn and the amount on people who are trying to go straight from a non-technical job to security is insane, and most of them just get angry at the fact that they need to work their way up to security, and try to argue or explain why they’re the exception. Sorry, if you were the exception, you’d have a job in security instead of whining.",
                  "score": 3,
                  "created_utc": "2026-01-24 02:38:28",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o18toru",
          "author": "RainbowSovietPagan",
          "text": "I think the expectation is that the entry level position is working at a help desk at a cybersecurity company. Either that or just apply to work for the government.",
          "score": 10,
          "created_utc": "2026-01-23 14:38:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1p4lwh",
              "author": "HelpDesktoSOC",
              "text": "Yep! And so much is how you **phrase** what you're doing when you start interviewing for cyber roles.\n\n  \nGood resources that helped me make the jump:\n\n* Reading NIST Cyber Guidance to get the lingo\n* CISSP terminology / glossaries\n* Guides that helped me say the right things, e.g. [The Help Desk to SOC Guide](https://www.amazon.co.uk/dp/B0GHZVTR8H/ref=sr_1_1?crid=5GMFBKIGCLQ5&dib=eyJ2IjoiMSJ9.tAOBKBqZmJIU0qN_5at4Lw.c-ufexP0y63N9TtLwT4DQGgw9fBkbYgvUtKiXZ_aeRM&dib_tag=se&keywords=help+desk+to+soc%3A+your+guide+to+getting+hired%3A+applying+the+shadow+analyst+method&qid=1769106959&sprefix=%2Caps%2C141&sr=8-1)",
              "score": 1,
              "created_utc": "2026-01-25 21:37:16",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o1vvz29",
              "author": "JuicyLucyLoony",
              "text": "I came here to say this - go government, you'll get miles ahead by going military for cybersecurity IF that's what you want to do. Pay will suck for a while though.",
              "score": 1,
              "created_utc": "2026-01-26 20:20:49",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1aezwy",
          "author": "loozingmind",
          "text": "If you don't have a military background with cyber experience... you have to start at help desk. Just the way it is. I wanted to get into cybersecurity too. But I gave up on that dream. Read the comptia road map. It will direct you on what you need to get the proper certs. You can't just get comptia security+ and land a cybersecurity job. Gotta work your way up.",
          "score": 6,
          "created_utc": "2026-01-23 19:01:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1ijvgr",
              "author": "arinamarcella",
              "text": "Sometimes you get a military background and doing help desk for the military 😂",
              "score": 2,
              "created_utc": "2026-01-24 22:58:39",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1km8i7",
                  "author": "Shaackle",
                  "text": "2 of the <10 people on our team started in military IT.",
                  "score": 1,
                  "created_utc": "2026-01-25 06:04:16",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o1uuczq",
              "author": "Girlycatshop",
              "text": "I never did help desk and got a job in cyber right out of college. Just depends I guess",
              "score": 1,
              "created_utc": "2026-01-26 17:39:46",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o19efkk",
          "author": "dokkanic",
          "text": "Get into IT administration if you can't get a jr security analyst job. Do NOT go call center or tech support.  Look for SOC jobs or jr sec risk analyst jobs as a starting point. If not, IT analyst or administration jobs are the way to go. learn the tech and project management.",
          "score": 3,
          "created_utc": "2026-01-23 16:15:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1gk282",
              "author": "Distinct_Resource429",
              "text": "How would you suggest breaking into IT administration without prior admin experience?\n\nMost roles I’m seeing are tech support or help desk, and those have been tough to land despite my degree and student assistant background. I’m debating a short-term Geek Squad–type role just to stay active. I don't want to do call center or tech support but only they are hiring",
              "score": 1,
              "created_utc": "2026-01-24 17:29:59",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1n59b0",
                  "author": "dokkanic",
                  "text": "There are Junior IT Administrator roles available at some companies and it's a mix of tech support and administrative tasks.  It's probably the best role to go into with 0 experience and can't land a security oriented role.  Itll help you learn IT architecture and how decisions are made.  \n\nSupport is OK to learn the technology, but it does depend on the context of support. Internal support/helpdesk on a small team is CAN get you the same experience, just make sure management is cool with you being there as a 'fly on the wall' when they are making decisions on upgrades, infrastructure changes, and implementation of new technologies.  \n\nI did tech support for a long time - all internal.  It helped me get an understanding of technology and how it's used but that's about it.  I'm in cyber now and administration and architecture are kind of weak points.  Some of it is common sense, stuff I learned in college, on the job, and from certifications - but because I never administered it I have to learn how to assess whether something is actually a high priority vs low priority risk.",
                  "score": 2,
                  "created_utc": "2026-01-25 16:31:15",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o1la3ru",
              "author": "Haley_Bo_Baley",
              "text": "I agree on the call center but disagree on tech support for one reason: it depends on the type of tech support. Some tech support are engineers while others mainly answer questions and do basic troubleshooting. You'll want to know the difference.",
              "score": 1,
              "created_utc": "2026-01-25 09:24:43",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1c5wud",
          "author": "Background-Slip8205",
          "text": "You spend 10 years learning AD, Windows, Linux, cisco switches/routers, firewalls, storage appliances, backup appliances, SQL, Oracle, Ansible, HyperV, ESXi, middleware, ticketing systems, monitoring and reporting tools, mainframe computing (if you're in the financial industry) ect, and how they all tie in and interact with each other. \n\nOnce you understand infrastructure as a whole and all the components that it makes up, then you're ready to be a competent security analyst.   Before that, you're just an idiot making bad decisions which causes either outages or pain and suffering for employees.",
          "score": 3,
          "created_utc": "2026-01-24 00:08:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1efyfd",
              "author": "PsychologicalRun6394",
              "text": "How many of those 10 years are spent on focused study in those topics?",
              "score": 1,
              "created_utc": "2026-01-24 09:42:58",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1hvqmd",
                  "author": "Background-Slip8205",
                  "text": "You don't have to study anything really, you just have to ask questions at work and get exposed to those areas by getting taking initiative to get involved in projects.",
                  "score": 1,
                  "created_utc": "2026-01-24 21:02:32",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o1myr7u",
              "author": "No_Battle_3866",
              "text": "Bro said 10 years",
              "score": 1,
              "created_utc": "2026-01-25 16:03:21",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1c7g64",
          "author": "Hospital-Sudden",
          "text": "This is the answer: You need to work doing support for 40-55k for 2-4 years, then sysadmin work for 65-80k for 3-5 years. You will need to study cybersecurity after work. Then you can start applying for entry level jobs in cybersecurity.",
          "score": 4,
          "created_utc": "2026-01-24 00:16:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1eg7pq",
              "author": "PsychologicalRun6394",
              "text": "2-4 years of unlivable wages. After 9 years you make as much as a warehouse manager that I know. Make it make sense",
              "score": 2,
              "created_utc": "2026-01-24 09:45:26",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o18u62e",
          "author": "cyberguy2369",
          "text": "\\- get a 4 yr degree in computer science, computer information systems, or cyber  \n\\- while you're in school (in person school) walk over to the IT dept of the university \"hi, I'm a cs student, what kind of opportunities are available? id really like to work and get some experience\"  \n\\- go to every lecture, meetup on campus involving tech. network with the speakers and other people there.   \n\\- get involved in the club's and organizations on campus that can also help you learn more, do more, and meet more people  \n\\- learn to balance life (school work, life, your mental and physical health)  \n\\- learn to be human.. talk (and get along) with all kinds of people in different kinds of situations  \n\\- learn to read a room and be humble.",
          "score": 6,
          "created_utc": "2026-01-23 14:41:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1amcw6",
              "author": "SKY-911-",
              "text": "My current path right now",
              "score": 1,
              "created_utc": "2026-01-23 19:35:50",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o1eggri",
              "author": "PsychologicalRun6394",
              "text": "Yeah this is the equivalent of “March down there and hand your resume to the hiring manager” advice. Good luck with that",
              "score": 1,
              "created_utc": "2026-01-24 09:47:49",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1ezg48",
                  "author": "cyberguy2369",
                  "text": "university environments are a little different. \"pounding the pavement\" for graduates isnt the best approach.. but on a college campus (I've been on many) it can work.. if done the right way. networking matters.. being involved, getting to know the professors and showing up to lectures and classes matters too.",
                  "score": 1,
                  "created_utc": "2026-01-24 12:33:07",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o1v3bo3",
              "author": "Direct-Expert-4824",
              "text": ">computer science, computer information systems\n\nThose two degrees are so wildly different, that lumping them together makes no sense.",
              "score": 1,
              "created_utc": "2026-01-26 18:18:28",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1v60b6",
                  "author": "cyberguy2369",
                  "text": "yes, they are wildly different.. you have two routes or two options.. both are broad degrees.. I'm not lumping them together. \n\n\" get a 4 yr degree in computer science, computer information systems, or cyber\" (there is an \"OR\" in my statement)\n\nCS is more core programming/software developement, deep foundational even some computing theory.. focusing on data and software development.. - route 1  \n  \nCIS is a broad degree involving lots of different things other than programming. it is wildly different at each university.. it can focus on data analytics, networking, databases/data storage, servers, web services, cloud..etc.. basically most programs are the more business or operations side of technology.  - route 2\n\nboth CAN provide a very good foundation for cyber .. IF you apply yourself and take use of the resources your university provides.. AND you get some outside real world experience.. \n\nwith either route you can end up with a solid foundation that can lead to very good cyber jobs.",
                  "score": 1,
                  "created_utc": "2026-01-26 18:29:38",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o191bg9",
          "author": "100HB",
          "text": "For most junior level infosec roles I have worked to fill I usually selected people who have experience in areas such as help desk, system admin and/or network admin. \n\nIf it is a GRC type role I might hire someone who has done some type of data analysis type work",
          "score": 2,
          "created_utc": "2026-01-23 15:16:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o193mqn",
          "author": "Primary_Excuse_7183",
          "text": "Experience in one of the fields of things you’re securing. \n\nNetworking > securing networks\n\nSoftware > securing software\n\nI always explain it as the best way to manipulate and exploit a system is to have a really good understanding of said system. You know the nooks, crannies, and places where people can and do cut corners. \n\nReal world example: You work at a big corporate facility and you know they prop the back door which exposes the risk of someone slipping in that shouldn’t. You likely wouldn’t know that if you didn’t work there and see it everyday.(experience)",
          "score": 2,
          "created_utc": "2026-01-23 15:27:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1b19mh",
          "author": "gingers0u1",
          "text": "It started with engineers, developers, sys admins etc just taking on security related jobs. Late 90 early 2000 there wasn't cybersecurity as a job specialty. It was just who had experience in the system and can fix or solve the issue.\nAs for experience, if I need a security person to secure my OT system, why would I not want someone who knows PLC or industrial systems? If you're pentesting that system and you just randomly start throwing commands and tools you can cause serious, multimillion dollar problems or worse. This is why many say it isn't a entry level. It's can I trust you with that risk.",
          "score": 2,
          "created_utc": "2026-01-23 20:46:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1b27n0",
          "author": "MoonElfAL",
          "text": "You have maybe four years of internship opportunities so utilize it. You need to apply for internships nationwide and even reach out to your school about 'work abroad' where you get to go to Germany or another country and work for a company for a semester. \n\nGet a part-time job at your schools IT help desk and by the time you graduate you will have also 5 years of help desk experience just leave off on the resume that it was part-time.",
          "score": 2,
          "created_utc": "2026-01-23 20:50:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1efd2o",
              "author": "PsychologicalRun6394",
              "text": "Yeah, fyi in this day and age all of your suggestions are equivalent to scratching a lottery ticket",
              "score": 0,
              "created_utc": "2026-01-24 09:37:31",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o18qgpk",
          "author": "NeverBeASlave24601",
          "text": "Try and get a part time job in helpdesk now. Their are graduate Cyber Security roles out there but the can be really competitive and you will need to have some experience and a few certs such as security+ to get a look in.",
          "score": 3,
          "created_utc": "2026-01-23 14:22:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o19qodr",
              "author": "capt3in",
              "text": "security + for graduate roles? 😭",
              "score": 0,
              "created_utc": "2026-01-23 17:11:08",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1aun04",
                  "author": "NeverBeASlave24601",
                  "text": "It would help you stand out. Thing about graduate jobs is that everyone applying has a degree, so may as well have something on top of that 😂\n\nAlso, if your already doing a cyber security degree it shouldn’t be too much of a push to get Security+",
                  "score": 1,
                  "created_utc": "2026-01-23 20:14:38",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1920y0",
          "author": "StatusFoundation5472",
          "text": "Well you know cybersecurity its such a wide field. IT cybersecurity, app cybersecurity, the list goes on. Check out [hackthebox.com](http://hackthebox.com) this is excellent preparatory ground and it will allow you to explore and gain experience in things in order to find out what you want to do. If you start doing impressive things people will notice at some point",
          "score": 1,
          "created_utc": "2026-01-23 15:19:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ahtqk",
          "author": "Nervous_Screen_8466",
          "text": "Masters degree worked.  \n\nThere are entry level certs. \n\nIt does help to know how shit works before breaking it for fun. ",
          "score": 1,
          "created_utc": "2026-01-23 19:14:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ar2y2",
          "author": "RefrigeratorOne8227",
          "text": "Some programs that I am aware of offer internships that can help you get the experience.  University of Michigan, Michigan State, and Augusta University have good internship programs.",
          "score": 1,
          "created_utc": "2026-01-23 19:57:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1asxlq",
          "author": "eNomineZerum",
          "text": "You gain experience along the way and realize that you can't secure that which you don't understand. You have 5 years before you graduate so here is what you do. \n\nYou work at your college help desk doing anything IT and tech related you can. Security workers deal with tickets and clients all the time so learn those skills now. \n\nWhile you are in college do your best to always learn and grow and jump on any opportunity you have. \n\nTake summer jobs doing any IT work possible such as working help desk or in turning for companies. \n\nBuild strong connections that will enable you to have a security job lined up more easily.",
          "score": 1,
          "created_utc": "2026-01-23 20:06:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1atkyk",
          "author": "sporkl_l",
          "text": "Lie on your resume.",
          "score": 1,
          "created_utc": "2026-01-23 20:09:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1azn13",
          "author": "mrbiggbrain",
          "text": "Step 1: Become a CybcerSecurity Specialist. \n\nStep 0: Learn about CyberSecurity. \n\nStep -1: Have a job where you can learn about CybcerSecurity\n\nStep -2: Become more senior in general IT\n\nStep -3: Get an IT Job, Probably Helpdesk\n\nStep -4: Get a Job that feeds well into IT (Retail, Customer Service, Call Centers, Hospitality)\n\nStep -5: Develop Soft Skills that lead to feeder jobs. \n\nStep -6: Interact with People, Develop relationships, read about communication, write, join clubs.",
          "score": 1,
          "created_utc": "2026-01-23 20:38:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1b0t4g",
          "author": "No-Main3801",
          "text": " Start at the help desk and work your way up",
          "score": 1,
          "created_utc": "2026-01-23 20:43:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1b49zk",
          "author": "Nonaveragemonkey",
          "text": "Starting in IT first.",
          "score": 1,
          "created_utc": "2026-01-23 21:00:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1bbj4l",
          "author": "jmp_rsp",
          "text": "Keep working on it. Keep doing certs. Keep working on your own side projects. \n\nMaking the breakthrough is not easy.",
          "score": 1,
          "created_utc": "2026-01-23 21:34:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1cf4b5",
          "author": "Tiny-Purple-9884",
          "text": "Join a club that does cybersecurity competitions like CCDC, Hivestorm and CPTC or make one and do CCDC, Hivestorm ETC (Alot of these competitions are free!). After that just network in your community and try to get an internship that way.",
          "score": 1,
          "created_utc": "2026-01-24 00:58:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1cmhw3",
          "author": "drakhan2002",
          "text": "Work your way into IT... in 3 to 5 years, make the jump to cyber",
          "score": 1,
          "created_utc": "2026-01-24 01:41:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ctfgv",
          "author": "koojlauj11",
          "text": "IT in general is pretty competitive. Try getting an internship early on and keep shooting for them at companies you would like to work for. Create a LinkedIn and find mentors early, build connections and network with professionals. Build connections with your college friends, you never know who they'll be and who they'll know.\n\nHere is a roadmap to kind of have an outlook. Also, has resources.\n\n[https://roadmap.sh/cyber-security](https://roadmap.sh/cyber-security)\n\nFollow those in the community who are in it to get updates and continual learning. I follow these two.\n\n[https://www.instagram.com/cybersecuritygirl/](https://www.instagram.com/cybersecuritygirl/)\n\n[https://www.instagram.com/cyberjasbytes/](https://www.instagram.com/cyberjasbytes/)\n\nJoin tech organizations.",
          "score": 1,
          "created_utc": "2026-01-24 02:21:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1cv6eo",
          "author": "BraveUnderstanding15",
          "text": "Work in IT before going into security. Your production experience needs to be at an advanced level in either systems administration or network administration before touching a system in security. It’s what 99% of security workers have done up to now.",
          "score": 1,
          "created_utc": "2026-01-24 02:32:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1cvz5c",
          "author": "DeezeNUTS007",
          "text": "Internship",
          "score": 1,
          "created_utc": "2026-01-24 02:36:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1d08tw",
          "author": "cheetah1cj",
          "text": "Start with HelpDesk. You can look for some entry-level internships, my company has hired a security intern and then offered full-time. But, in my experience, without HelpDesk and/or Sysadmin experience, Security Analysts have a much harder time identifying false positives or interpreting what the alert/warning is about. \n\nAnother great option is starting at an MSP, which will give you a crash course in a lot of different aspects of IT, but not everyone will like it and some people will be turned off from IT after that.",
          "score": 1,
          "created_utc": "2026-01-24 03:01:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1d2z1n",
          "author": "maxou2727",
          "text": "Well you just have to do well in the next 5 years ",
          "score": 1,
          "created_utc": "2026-01-24 03:18:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1dewsh",
          "author": "hso1217",
          "text": "Do IT first.",
          "score": 1,
          "created_utc": "2026-01-24 04:34:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1dgkfh",
          "author": "dinidusam",
          "text": "Internships. I know a friend who got a cyber internship and knows jack. Also know another who was some web dev at lockheed and now is doing like cyber shit for the US government. If you go to a college with a decent network at least and put yourself in cybersecruity spaces you'll probably get something. At least in my college I know a couple of cyber folks who are doing fine, though we boast a (even if not prestigious) huge, loyal network.\n\n\n\n\nI'm not the best of advice btw since im not chber and am a junior, but just my two cents. Maybe others can expand on this comment.",
          "score": 1,
          "created_utc": "2026-01-24 04:45:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ekmxx",
          "author": "Unlikely-Luck-5391",
          "text": "Since you’ve got \\~5 years, this is the realistic path that actually works:\n\n* Year 1–2: get *any* IT exposure. Campus IT help desk, MSP part-time, internships. Doesn’t matter if it’s basic, you’re learning how systems actually break.\n* Certs to stack early: ITF+ or A+, then Network+. These aren’t sexy but they unlock internships.\n* Year 2–3: pivot toward sysadmin, cloud, networking, or IAM-adjacent internships. That’s already “security adjacent” even if the title isn’t.\n* Certs here: Security+, maybe AWS/Azure fundamentals. Now your resume stops getting auto-rejected.\n* Year 3–5: target SOC intern, junior risk analyst, cloud support, IAM analyst roles. Do labs, home projects, writeups. This is where security becomes real.\n* Certs to promote later: CySA+, SSCP, cloud security specialty (not all at once).\n\nPeople get stuck because they wait until graduation to “start cybersecurity”. Don’t. You bake security into every IT role you touch.\n\nCyber isn’t entry level, but the path into it absolutely is if you start early and label your experience right.",
          "score": 1,
          "created_utc": "2026-01-24 10:26:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1el27n",
          "author": "CombinationEntire552",
          "text": "I totally understand your concern. Getting into cybersecurity can be challenging, but there are ways to increase your chances. Consider taking online courses or certifications like CompTIA Security+ or CISSP to gain foundational knowledge. Additionally, look for internships or volunteer opportunities to gain practical experience. You can also join online communities like this one to network with professionals and stay updated on industry trends.",
          "score": 1,
          "created_utc": "2026-01-24 10:30:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1erw97",
          "author": "FrequentNet5347",
          "text": "Look up internships for cybersecurity, there are quite a few out there",
          "score": 1,
          "created_utc": "2026-01-24 11:31:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1f6adn",
          "author": "FinancialMoney6969",
          "text": "That’s the real question… you don’t",
          "score": 1,
          "created_utc": "2026-01-24 13:20:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1fkgb1",
          "author": "Proper-You-1262",
          "text": "You just have to be smarter than the other people who you're competing against. Judging from the quality of your post, you'll probably have difficulty with that...",
          "score": 1,
          "created_utc": "2026-01-24 14:43:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1fpqw4",
              "author": "RyRy646",
              "text": "😂😂",
              "score": 1,
              "created_utc": "2026-01-24 15:10:46",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1gammn",
          "author": "alanshore222",
          "text": "You're bitching now? Wait until you actually get in.\n\nCybersecurity has basically been the catch all for everything helpdesk and networking doesn't want to do on the backend side along side of the needle in a haystack alerts that hit and you're forced to search through fishing.\n\n1. You're always chasing the next certification and it never ends.  \n2. Helpdesk is equally fucked but its almost always different, its a constant never ending cycle of users/cybersecurity woes/botched windows updates and 7 different security tools melting the thermal paste right out of the CPU.  I've been in for 15 years and I can count 2 people in that time that have shifted to Cyber.  You use helpdesk to get a degree in computer science then internally transfer. \n\nMost of those i've met and stayed up with are miserable.",
          "score": 1,
          "created_utc": "2026-01-24 16:48:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1gcdn2",
          "author": "CharmingPanda007",
          "text": "Don't get cyber security courses, get a good mentor who will help you in networking and getting referrals",
          "score": 1,
          "created_utc": "2026-01-24 16:55:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1gldwr",
          "author": "Major-Gas-2229",
          "text": "compete",
          "score": 1,
          "created_utc": "2026-01-24 17:35:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1gq2wx",
          "author": "AccurateExam3155",
          "text": "Start at IT and work up that way",
          "score": 1,
          "created_utc": "2026-01-24 17:56:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1hk3f5",
          "author": "HeyGreggg",
          "text": "Start practicing your social engineering now.",
          "score": 1,
          "created_utc": "2026-01-24 20:07:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1hl3hv",
          "author": "Ok-Structure5637",
          "text": "I dont get the help desk route at all - how on earth does this \"prepare\" you for a cyber role? Im an IT support spec and do a myriad of things; helpdesk, actual IT, networking, hard and software configurations, and (for some reason) accounting for some clients (helped recover over 700k for one of them). I feel like it's has prepared me for nothing in cyber, unless Im missing something...",
          "score": 1,
          "created_utc": "2026-01-24 20:11:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1hqn5t",
          "author": "krankykitteh",
          "text": "Learn about how things work before you try to secure them",
          "score": 1,
          "created_utc": "2026-01-24 20:38:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1hviql",
          "author": "Inappropriate_Swim",
          "text": "Start at a lower level job. You can't start a cyber job , especially on the technical side if you can't point out the major difference between 172.16.30.5 and 204.223.89.231. if you had to look it up you failed and are not ready.\n\n\nWhat's the CIA triad? If you had to look it up you failed.\n\nWant to have a debate on if backups are a function of cyber security. If you have no opinion or cannot form an opinion without research you failed.\n\nCan you right now log into ad create a user, add them to a security group, then know how to properly apply that group to a folder?\n\nIf none of this is second nature where you look at someone asking you this as if they are stupid because it is such a simple question, you are in no way qualified. \n\nThis isn't to be an ass or anything, but people think they are going to be cyber security experts out of college and they don't know shit about the basics of how things work.",
          "score": 1,
          "created_utc": "2026-01-24 21:01:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1lb244",
              "author": "Haley_Bo_Baley",
              "text": "I'm going to say all these questions this person asked are \n\nA. Easy as fuck\nAnd B. What most students learn their first year as a Cybersecurity student at a university.\n\nIf this is all it took to be a Cybersecurity professional every Cybersecurity graduate would be one.",
              "score": 1,
              "created_utc": "2026-01-25 09:33:17",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1m4x4z",
                  "author": "Inappropriate_Swim",
                  "text": "They were meant to be easy I asked them because you would be surprised how many people I have worked with that who not be able to answer them.",
                  "score": 1,
                  "created_utc": "2026-01-25 13:31:58",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1i2qe0",
          "author": "Keen_007",
          "text": "If you’re in school you MUST get an internship. It’s not an actual requirement but necessary can’t lie",
          "score": 1,
          "created_utc": "2026-01-24 21:35:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ibnvd",
          "author": "JustPutItInRice",
          "text": "You don’t initially because it’s um not entry level? Get experience",
          "score": 1,
          "created_utc": "2026-01-24 22:17:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ig8kv",
          "author": "quacks4hacks",
          "text": "You cut your teeth in another part of IT like programming, help desk or systens architecture, or you enter laterally via project management, audit etc.",
          "score": 1,
          "created_utc": "2026-01-24 22:40:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1j1xe8",
          "author": "Late-Software-2559",
          "text": "Don’t think in job. Think in career and profile. What is it about your overall career and profile that gets you through. I work in compliance, got hit up for a lead position because they liked my resume, on the call said I didn’t qualify because I didn’t have a degree. No big deal already have a decent gig and working on my degree now and will qualify down the line. You’ll be fine too just work up to a system admin job in the meantime.",
          "score": 1,
          "created_utc": "2026-01-25 00:32:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1j4dnf",
          "author": "cstephns1",
          "text": "You do grunt work first. Ie the help desk entry level jobs",
          "score": 1,
          "created_utc": "2026-01-25 00:45:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1jd5zn",
          "author": "NeonSahara",
          "text": "IT obviously. If you don’t understand the system, how are you supposed to secure it? Lmao",
          "score": 1,
          "created_utc": "2026-01-25 01:33:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1khhek",
          "author": "Rude_Tart_2573",
          "text": "Get certifications from Comp Tia, then work for companies like spectrum internet to learn networking, security is inherently involved in that so pivot to higher positions from there.",
          "score": 1,
          "created_utc": "2026-01-25 05:31:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1l3f3v",
          "author": "crypto3ye",
          "text": "It is not an entry level job.",
          "score": 1,
          "created_utc": "2026-01-25 08:26:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1l69ee",
          "author": "limeandchile",
          "text": "Join the Army as a 17C MOS, (or Air/Space Force if you wanna live a kush life). Easiest, safest gig, free cyber certs, free security clearance, career experience on your resume. Can do part time or full time. Then you finish your service and you’re set up with Vet benefits/status.\nAll my 17C buddies that got out of the service now have high paying jobs just from their cybersecurity experience in. \n\n\nhttps://www.goarmy.com/careers-and-jobs/signal-intelligence/locations-stats-frequencies/17c-cyber-operations-specialist",
          "score": 1,
          "created_utc": "2026-01-25 08:50:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1l9j92",
          "author": "Haley_Bo_Baley",
          "text": "Internships, part-time helpdesk to systems engineer, junior engineer. There's different places to start. \n\nLet me tell you something that will help you out, and let you know the road is not impossible although it may be long and hard to take the first step: \nThe amount of idiots who \"worked their way up\" to cybersecurity and lack any actual critical thinking or cybersecurity knowledge is ridiculous. It might not be the majority, but I have met way too many that it makes me worried for the future of the field. I have met way too many who knows how something works, and can configure security configurations. But actually working with budgets? Writing comprehensive risk and vulnerability assessments? Communicating complex technical terms to non-technical people? Investigating data breaches or security incidents? Way too many of them fall short. They will literally parrot terms without knowing how they actually apply and go through the motions, but that's it. If brain dead mouth breathers can do it, anyone can. \n\nBut, if you want to be great, here is my advice: Don't just know what you are doing, know WHY you are doing it. Knowing how something works is important, yes, but taking it that step further will help you in the long run. Also, personal projects. They help you learn and can look good on resumes. Always ask questions if you have them. Network, network, network. And I mean people. Reach out to people in the industry for knowledge and advice. And (super important) DEVELOP PEOPLE SKILLS. If you are still in school or just starting out, these are things you can do.",
          "score": 1,
          "created_utc": "2026-01-25 09:19:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1lqcey",
          "author": "RIPJFS",
          "text": "Graduate from college in five years?\n\nDrop out. Skip the debt and the degree. It's literally useless in this market. Spend way less and get some Comptia certs is what I'm being told.",
          "score": 1,
          "created_utc": "2026-01-25 11:47:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1m9igt",
          "author": "Cool-Ad5807",
          "text": "Commence par trouver un stage quand ce sera exigé et tu verras.",
          "score": 1,
          "created_utc": "2026-01-25 13:58:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1md58l",
          "author": "eviljim113ftw",
          "text": "Get an internship.  Look for a company that prefers molding young engineers instead of older folks who don’t like change.\n\nAlso, cybersecurity seems to be very popular so it’s so much harder to get into.  Find a backup career and then transition.\n\nMost people in our risk management team were network engineers and some are skilled only on the process-level and not at the technical level.",
          "score": 1,
          "created_utc": "2026-01-25 14:18:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1mqx3d",
          "author": "Doctorphate",
          "text": "You work in IT.. how do you secure something you don’t understand?",
          "score": 1,
          "created_utc": "2026-01-25 15:28:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1p4s3o",
          "author": "HelpDesktoSOC",
          "text": "My 2 cents, so much is how you **phrase** what you're doing when you start interviewing for cyber roles. If you sound like you're a Security person Security people will hire you!\n\n  \nGood resources that helped me make the jump:\n\n* Reading NIST Cyber Guidance to get the lingo\n* CISSP terminology / glossaries\n* Guides that helped me say the right things, e.g. [The Help Desk to SOC Guide](https://www.amazon.co.uk/dp/B0GHZVTR8H/ref=sr_1_1?crid=5GMFBKIGCLQ5&dib=eyJ2IjoiMSJ9.tAOBKBqZmJIU0qN_5at4Lw.c-ufexP0y63N9TtLwT4DQGgw9fBkbYgvUtKiXZ_aeRM&dib_tag=se&keywords=help+desk+to+soc%3A+your+guide+to+getting+hired%3A+applying+the+shadow+analyst+method&qid=1769106959&sprefix=%2Caps%2C141&sr=8-1)",
          "score": 1,
          "created_utc": "2026-01-25 21:38:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1q4k4d",
          "author": "2byt3s",
          "text": "Get security related certs, learn networking, learn python and another programming language and start in a SOC.  First year will be on graveyard shift.  Stay diligent and move to another team or day shift after the first year.  Take a course online in threat hunting for downtime in the over night hours.  Dont get lazy.",
          "score": 1,
          "created_utc": "2026-01-26 00:22:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1qt8kl",
          "author": "Altechy",
          "text": "Just like any Cyber professional do... start with foundations, be the best, move to Networking, move to OS's then you'll get the picture when you are ready to secure what you have learned!",
          "score": 1,
          "created_utc": "2026-01-26 02:26:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1rebhr",
          "author": "erroneousbit",
          "text": "We hired our intern straight into the pentest team. Graduated from Perdue with honors and hella smart and damn good tester.  It’s one of those rare things but it does happen.  Try to find a level 1 SOC position.  May have to pay your dues by working nights.  I started my IT career working in a NOC 3rd shift for 3 years. Good luck my friend!",
          "score": 1,
          "created_utc": "2026-01-26 04:24:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ssvyj",
          "author": "Smarmy82",
          "text": "Look for junior level SOC or NOC positions or cyber internships. \n\n\nI lucked into a job as a general admin, then rode the help desk for a while, then software dev support, then worked in a data center before I got my first \"security\" title. Took the better part of a decade. That job ended up being awful but opened doors to where I am now in vulnerability management mixed with a touch of threat intel.",
          "score": 1,
          "created_utc": "2026-01-26 11:15:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1u3uax",
          "author": "Intelligent_Fan_1394",
          "text": "I began my journey in Help Desk > System Administrator > Cyber Sec Analyst. \n \nI have my Master in Cybersecurity and it didn’t matter. It is about experience. College is to weed out those who do not have the work ethic to complete timely tasks. College degrees show your employer you can complete a series of tasks over X amount of years proving you should be reliable and competent. Though I will argue I have met some with college education and question their ability to do things, lol. \n\nDon’t fret you will get there but I’d strongly recommend you start at the bottom so you understand how systems work. I couldn’t tell you how many investigations I’ve worked where my experience as a Help Desk or Sys Admin has helped me so much understand the alert. \n\nYou will get there in due time just stay persistent 🙂",
          "score": 1,
          "created_utc": "2026-01-26 15:45:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1uariq",
          "author": "Medium-Tradition6079",
          "text": "Honestly, cybersecurity *can* be entry level — it’s just not “entry level with zero IT experience.” Most people start in something close to it (help desk, IT support, sysadmin intern, networking) and then slide into security once they’ve got the basics.\n\nAnd since you’re graduating in like 5 years, you’re actually in a great spot. If I were you, I’d do two things:\n\n* Get comfortable with the boring fundamentals (networking, Windows/Linux, DNS, how logins/auth actually work).\n* Get *any* real experience early (campus IT job, part-time help desk, internship, even helping a small org set stuff up). That “I’ve touched real systems” thing matters way more than people think.\n\nAlso: projects beat vibes. Build a tiny home lab, break it a little, then fix it. Even something simple like “I set up Windows + Linux, turned on logging, and learned how to spot weird logins” is already more convincing than “I want to work in cybersecurity.”\n\nEntry-level security roles do exist, they’re just usually called stuff like SOC analyst L1 / security analyst intern / GRC intern — and they’ll expect you to not panic when someone says “DNS” or “AD.”\n\nWhat are you studying? CS? IT? And do you want the “blue team” side (defense, detection) or more like hacking/appsec?",
          "score": 1,
          "created_utc": "2026-01-26 16:15:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1vq4o5",
          "author": "Ordinary-Ad-3670",
          "text": "you graduate in 5 years, talk to your school about internships",
          "score": 1,
          "created_utc": "2026-01-26 19:55:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1al7cz",
          "author": "HereSo-IDontGetFined",
          "text": "The truth is there's a lot of gatekeepers and greedy shortsighted corporations/business that don't want to invest in the young workforce no less pay them.\n\nThese industries have become more and more about nepotism and networking rather than building people up and giving those who check the boxes reasonable opportunity. \n\nI'm sure you'll find someone in the comments that will say something along the lines that's just the way it is, But no that's a b*******, It's the way they have made it Because they value short-term profits over longevity.\n\nHopefully in the future there will be laws enacted that will severely penalize nepotism and gatekeeping, and make it mandatory that entry level positions are available and make it illegal to require any experience for entry-level positions. And companies that do so should be fined 6 or 7 figures figures. Without such regulations potential employees have to go through the exhaustive humiliation ritual we call a job search. \n\nThere should only be an competency assessment in line to what is expected for entry level position.\n\nLooking through the comments all I see is essentially the paragraph version of, \"Wait your turn, be bullshitted, And then we'll let you in\". Bureaucracy and politics is so expensive to the GDP. 🤦🏽‍♂️",
          "score": 1,
          "created_utc": "2026-01-23 19:30:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1b0i8u",
              "author": "Guilty_Conflict6055",
              "text": "Oh buddy, if you think the legal system is gonna fix it, you’ll be waiting a long time. The best thing anyone can do for their career living in the US is move to Europe. Thats a half joke, but we live in a time where there is no middle class, no looking out for the working man, no “hard work pays off”. The rich control nearly all sectors of the job market, and the rich don’t like to share.",
              "score": 3,
              "created_utc": "2026-01-23 20:42:24",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o18us6o",
          "author": "Previous_Shopping361",
          "text": "Build experience and do relevant stuff it's not an entry level thing as dressed up by most folks..",
          "score": 0,
          "created_utc": "2026-01-23 14:44:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o193sa0",
          "author": "TheOGCyber",
          "text": "Cybersecurity requires 3-5 years of general IT/networking experience before they'll even look at your resume.",
          "score": 0,
          "created_utc": "2026-01-23 15:27:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o19tc2d",
          "author": "Character_Choice5728",
          "text": "there are some opportunities for internship!",
          "score": 0,
          "created_utc": "2026-01-23 17:23:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o19tf7j",
              "author": "Character_Choice5728",
              "text": "[https://bah.wd1.myworkdayjobs.com/en-US/bah\\_jobs/job/McLean-VA/University--2026-Summer-Games-Cybersecurity-Intern\\_R0225360](https://bah.wd1.myworkdayjobs.com/en-US/bah_jobs/job/McLean-VA/University--2026-Summer-Games-Cybersecurity-Intern_R0225360) !!",
              "score": 1,
              "created_utc": "2026-01-23 17:24:18",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o19tiub",
              "author": "Character_Choice5728",
              "text": "and even more",
              "score": 1,
              "created_utc": "2026-01-23 17:24:47",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o19xk2w",
          "author": "Ok-Success-7067",
          "text": "The best way is to get an internship with a company and hope they want to hire you after the internship is over.\n\nOtherwise, you need a good reference from someone that already works there, who can recommend you to the hiring manager.",
          "score": 0,
          "created_utc": "2026-01-23 17:43:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1a16em",
          "author": "Digimon54321",
          "text": "Cyber Security is not entry level at all, whoever told you that has scammed you. You need to know the basics of computers, OSs, how they operate, then networking, how everything communicates, then you learn how to break those things and make them interact incorrectly, and in your favor. \nI started in help desk for 2.5 years, then went into sys admin for 3 years and as a 2 man IT team got to learn the cyber security portion of things and am studying it nearly full time while here as a sys admin.",
          "score": 0,
          "created_utc": "2026-01-23 17:59:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1b1i5l",
              "author": "MoonElfAL",
              "text": "I agree if you want a technical cybersecurity role, but I have seen people during my internship working in cybersecurity who got in with all types of degrees. The people who did more of the technical cybersecurity work did what you did with help desk.",
              "score": 1,
              "created_utc": "2026-01-23 20:47:07",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1a3744",
          "author": "Sqooky",
          "text": "IT/System Administration/Helpdesk -> NOC/Networking  -> SOC/Cybersecurity is the general recommended flow.\n\nThere are definitely strides you can make in between, like AD Admin -> Identity Security, Networking -> Firewall Admin, or IT consultant -> Security Architect, or QA Tester -> Pentester. There's a lot of roles that share a lot of the same responsibilities, just with more security oriented titles.\n\nThis is because there are a lot of people out there who think they know more than they do and have yet to get humbled. These often being the people who go from 0 experience in IT at all to pentest. There's a **lot** to learn about working in business that no one tells you in degree or certification programs. During my 5 years in enterprise, I learned pretty much nothing technical, but I learned a lot about playing the political game.",
          "score": 0,
          "created_utc": "2026-01-23 18:08:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1a9f1v",
          "author": "Evening-Advance-7832",
          "text": "With AI now doing all the coding and can handle tasks it's harder  SMH",
          "score": 0,
          "created_utc": "2026-01-23 18:36:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1950u4",
          "author": "reneg30",
          "text": "You need to start at helpdesk, then sysadmin/network admin",
          "score": -1,
          "created_utc": "2026-01-23 15:33:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1957xp",
          "author": "BankingAnon",
          "text": "Go IT first",
          "score": -1,
          "created_utc": "2026-01-23 15:34:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o19xok6",
          "author": "S4LTYSgt",
          "text": "Like I did… I was a Network Engineer for 3 years. Did everything from installing routers, switches, firewalls, AP/wireless around college campuses to network expansions to working for F5 where I learned load balancing and deep packet analysis. \n\nThen I become a Sys Admin (4 years), I learned infrastructure migrations, cloud migrations and hybrid sys admin (on-prem, AWS cloud). Then I became a Security Engineer where I implemented cybersecurity solutions on the infrastructure and cloud, automation and systems hardening techniques on linux/windows machines, azure and aws. \n\nNow im transitioning into GRC as a L2 Lead. Point is I was able to do Security Engineering at the same company I was a sys admin because I was good at my job and took initiative by owning my system, taking interest and implementing security and eventually filled a role that was vacant by doing a lateral shift in responsibility . Security Engineer didnt exist for us. But I was able to train a Jr to take my role and I essentially created a role for my self lol. Pretty awesome. \n\nLearn the basics. How can you secure something you dont have experience building, breaking and maintaining?",
          "score": -1,
          "created_utc": "2026-01-23 17:43:56",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qhuu4u",
      "title": "Tiktok and Oracle",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qhuu4u/tiktok_and_oracle/",
      "author": "Donxki",
      "created_utc": "2026-01-20 07:41:15",
      "score": 20,
      "num_comments": 32,
      "upvote_ratio": 0.95,
      "text": "I'm not even sure if this the right place to post about this but on Jan 22nd, Tiktok is gonna give partial ownership to Oracle.\n\n Meaning for American users, oracle will have access to their data to feed into whatever ai machine or whatever they do with the data.\n\n I kinda find it a bit concerning, since Oracle has worked with this administration and they are very open to basically spying on you. \n\nIs this an actual concern and should I delete my tiktok account? Is the data that Oracle will have access to like i dont know concerning in any way? ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qhuu4u/tiktok_and_oracle/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o0mvzwx",
          "author": "Medium-Potential-348",
          "text": "I deleted my account when the announcement was made to try and save myself while I still can. Idk if they will have my data as I deleted my whole account, but they at least won’t have anything up-to-date and current if they do, which is better than nothing.\n\n(Initial announcement was like 3-4 months ago, 2nd announcement was like 1-2 months ago, and then this announcement which is pretty much the official Oracle is moving into the data now announcement)",
          "score": 7,
          "created_utc": "2026-01-20 08:41:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0n6my1",
          "author": "zpollack34",
          "text": "Oracle has essentially been an arm of the CIA since before its inception as oracle. But interesting you were ok with the spyware when “China” owned it.\n\nWith any social media, assume your data is compromised by the state. Then proceed how you feel comfortable. If you don’t care, cool keep using it how you’d like. If you do care, you probably should clean up even more of your internet footprint.",
          "score": 6,
          "created_utc": "2026-01-20 10:21:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1ppk33",
              "author": "Equivalent_Collar885",
              "text": "I hope I don’t sound like an idiot, but what do you mean by Oracle being an arm of the CIA? Anywhere specific I can look into that? (Or is this just common knowledge and I’m lightyears behind.)",
              "score": 1,
              "created_utc": "2026-01-25 23:10:09",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1pwlrs",
                  "author": "zpollack34",
                  "text": "You should google something like “Larry Ellison and oracle CIA ties”. There’s more than I could put into a comment. But the gist is that oracle started as a cia funded project to build a relational database where the agency was the first customer.  Ellison has worked with the agency and foreign intelligence agencies many more times since then.",
                  "score": 1,
                  "created_utc": "2026-01-25 23:43:55",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0nmkey",
          "author": "LordNikon2600",
          "text": "Oracle has a partnership with Palantir.. so guess what comes next.",
          "score": 6,
          "created_utc": "2026-01-20 12:30:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1a0mp2",
              "author": "snoopfrogg42069",
              "text": "Broo whaaat what is happening 🫠",
              "score": 1,
              "created_utc": "2026-01-23 17:57:16",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0owqvt",
          "author": "fedput",
          "text": "I would be more comfortable with the Chinese government owning my data than Larry Ellison.",
          "score": 4,
          "created_utc": "2026-01-20 16:34:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0pguwy",
              "author": "Medium-Potential-348",
              "text": "Literally.",
              "score": 1,
              "created_utc": "2026-01-20 18:07:11",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0q9o6o",
                  "author": "fedput",
                  "text": "I do not know any acronym for \"China\", but there is a well known one for Oracle",
                  "score": 2,
                  "created_utc": "2026-01-20 20:18:38",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0n89id",
          "author": "nico851",
          "text": "You're fine with China spying on you, but have issues if it's oracle? Weird....",
          "score": 5,
          "created_utc": "2026-01-20 10:36:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0nmq9f",
              "author": "LordNikon2600",
              "text": "China won't fly across the world to arrest me for calling their president Pooh... the USA does and will if you speak negatively about their leader.",
              "score": 4,
              "created_utc": "2026-01-20 12:32:04",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0ot13v",
                  "author": "Dave5876",
                  "text": "Chinese \"police stations\" operate in North America",
                  "score": 0,
                  "created_utc": "2026-01-20 16:17:12",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o1tm1et",
              "author": "According-Fox173",
              "text": "there was a whole thing when trump tried to shut down tik tok the first time, everyone was online saying we don’t care if china has our data. we care about corrupt american companies taking our data though oracle and using id for our government to spy and arrest people. we do not trust our government, we trust chinas more isn’t that crazy? also idf uses oracle so they can get fucked.",
              "score": 1,
              "created_utc": "2026-01-26 14:21:55",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o0nvt1i",
              "author": "Miserable-Yak-5564",
              "text": "This kind of thinking is why America deserves exactly whatever it gets. This china bullshit is old and antiquated. Multiple American companies are publicly telling you they want a surveillance state while actively pursuing the intellectual properties that allow them to… but china. Just blatant stupidity.",
              "score": 1,
              "created_utc": "2026-01-20 13:29:20",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0ny0cr",
                  "author": "nico851",
                  "text": "I don't care either way and never used TikTok because it's cancer.\n\nThey take your data, no matter who the owner is. I find it weird that people now want to delete TikTok, as it's ownership changed.",
                  "score": 2,
                  "created_utc": "2026-01-20 13:41:49",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o1e96wy",
              "author": "pineapplesgreen",
              "text": "China won't arrest me for criticizing Israel and its genocide on Gaza.",
              "score": 0,
              "created_utc": "2026-01-24 08:40:42",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0ok6gk",
          "author": "Highfivesghost",
          "text": "Aren’t there restrictions on what they can do with the data. It’s not like they can just do whatever with it",
          "score": 1,
          "created_utc": "2026-01-20 15:36:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0pgtfy",
              "author": "Medium-Potential-348",
              "text": "That’s a good one bro 😂😂😂😂😂😂",
              "score": 2,
              "created_utc": "2026-01-20 18:06:59",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0tz1ck",
          "author": "_Adagio_B",
          "text": "last day on TIkTok :/",
          "score": 1,
          "created_utc": "2026-01-21 10:29:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0umk7q",
          "author": "Tall-Pianist-935",
          "text": "Gotta fund those campaigns.",
          "score": 1,
          "created_utc": "2026-01-21 13:22:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0vn3ao",
          "author": "Tall-Pianist-935",
          "text": "Delete the account if you were posting",
          "score": 1,
          "created_utc": "2026-01-21 16:23:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0vnbs7",
          "author": "Standard_Mirror_7326",
          "text": "What is the consensus?  Do I go in there and manually delete all my thousands of comments (2 clicks one at a time) and then deactive/delete my account?  Is it even worth it? too late?",
          "score": 1,
          "created_utc": "2026-01-21 16:24:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1e9jqk",
              "author": "pineapplesgreen",
              "text": "idk, but I saw someone here say to send this email to [privacy@tiktok.com](mailto:privacy@tiktok.com) \\- obv change the state law I have there for your own's state's law.  \nSubject Line: Formal Request for Deletion of Personal Data Pursuant to the **Texas Data Privacy and Security Act (TDPSA)**\n\nHello,\n\nI have deleted my TikTok account.\n\nPursuant to the Texas Data Privacy and Security Act (TDPSA), I am formally requesting the deletion of all personal data associated with my account and identity, including but not limited to:\n\n• account data  \n\n• comment history  \n\n• messages  \n\n• device identifiers  \n\n• inferred data  \n\n• backup copies  \n\n• aggregated or derived data where legally permitted  \n\nI also request that my personal data not be sold, shared, or processed for targeted advertising.\n\nPlease confirm in writing once deletion has been completed.\n\nThank you.",
              "score": 1,
              "created_utc": "2026-01-24 08:43:56",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o10tums",
          "author": "Old_Cheesecake_2229",
          "text": "see, i’d keep an eye on permissions and maybe try a security tool like LayerX Security, since these can block data leaks when using apps like tiktok, don’t forget to review your settings often",
          "score": 1,
          "created_utc": "2026-01-22 10:18:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1a0vm1",
          "author": "brightlightabove10",
          "text": "I just got the request for acceptance of the new terms and conditions and instead of accepting, said my final goodbyes and deleted the app. 😢 the era has ended",
          "score": 1,
          "created_utc": "2026-01-23 17:58:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1km0fz",
          "author": "ComposerStandard6428",
          "text": "What exactly are they collecting as far as data and as far as spying what are they able to see?",
          "score": 1,
          "created_utc": "2026-01-25 06:02:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1mqncz",
          "author": "Current_Error_7965",
          "text": "they ruined it 100%, i cant find any of the videos i like anymore and its all random stuff they literally screwed over the the entire platform and turned it into facebook",
          "score": 1,
          "created_utc": "2026-01-25 15:26:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1mqphk",
              "author": "Current_Error_7965",
              "text": "(context is the search engine)",
              "score": 1,
              "created_utc": "2026-01-25 15:27:06",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1pttrb",
          "author": "Past_Major_165",
          "text": "Anyone else having issues logging in or posting since the announcement. I most definitely am having issues.",
          "score": 1,
          "created_utc": "2026-01-25 23:30:18",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qmq1z8",
      "title": "Anyone played these games?",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qmq1z8/anyone_played_these_games/",
      "author": "CAPT_Fuckoff",
      "created_utc": "2026-01-25 17:53:11",
      "score": 12,
      "num_comments": 6,
      "upvote_ratio": 0.94,
      "text": "Steam has IT specialist simulator, as well as Tower network. Has anyone has gave them a go?\n\nAs someone studying to get into SOC, I’m thinking about trying them but I’ve read they are not very tutorial friendly, kinda get thrown in and are asked to do things. ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qmq1z8/anyone_played_these_games/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o1p64m7",
          "author": "Insanity8016",
          "text": "The last thing I'd do in my free time is play a game related to my job.",
          "score": 6,
          "created_utc": "2026-01-25 21:43:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1qww0c",
              "author": "renoir-was-correct",
              "text": "This is why I don't do labs anymore.",
              "score": 1,
              "created_utc": "2026-01-26 02:44:55",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1nuxts",
          "author": "baaaahbpls",
          "text": "I played the demo and got annoyed with IT simulator, mainly just how I wish the interaction was more intuitive, haven't heard of the second one yet, might have to check it out.",
          "score": 1,
          "created_utc": "2026-01-25 18:20:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1nvdec",
              "author": "baaaahbpls",
              "text": "To add to this, one of these games that involves more user being tech/programming competent is Bitburner which I found super fun.",
              "score": 1,
              "created_utc": "2026-01-25 18:21:55",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1o5gz9",
          "author": "Acceptable_Celery339",
          "text": "IT specialist simulator is suuper unfinished. Not very fun at the moment while it’s still in early access. The full release seems promising though.",
          "score": 1,
          "created_utc": "2026-01-25 19:03:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1oh7d7",
              "author": "CAPT_Fuckoff",
              "text": "I bought the game, whilst I don’t have any experience in real life. I’m surprised how much it feels like a job lol. I’m curious how complicated it can get, if it’s super basic stuff or you actually have to think",
              "score": 1,
              "created_utc": "2026-01-25 19:55:23",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qjinbp",
      "title": "Looking for jobs",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qjinbp/looking_for_jobs/",
      "author": "ANOSYNN",
      "created_utc": "2026-01-22 02:48:58",
      "score": 11,
      "num_comments": 19,
      "upvote_ratio": 0.8,
      "text": "I just graduated with a bachelors degree in cybersecurity at UTSA and I have no idea what jobs I should be looking for and how hard it will be to find a job with no experience. All I have is the degree. I’m working on some certifications already but I’d like to find some sort of job in tech to get some experience going. Any advice on getting my first job as soon as possible with no experience on my resume?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qjinbp/looking_for_jobs/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o0z9v87",
          "author": "RiskVector",
          "text": "Your best bet right now is to find a helpdesk job. Yes its going to suck and its not rewarding but you have no experience. It is a starting point. Majority of us started at helpdesk. That doesn't mean you cant or shouldn't apply for jobs that interest you but keep in mind how many people are applying for the same position who do have experience.\n\nIf you haven't done so already start a home lab. Get on YT, find some channels you like and follow along. Keep notes of everything you do. When you are doing a lab or doing something keep this in the back of your mind:\n\"If I land a technical interview, would I be able to do this?\"\n\nIts a process! You will get there!",
          "score": 6,
          "created_utc": "2026-01-22 03:00:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0zay8g",
              "author": "ANOSYNN",
              "text": "Do you know how fast I could find a help desk job? I keep seeing posts of people saying they can’t even get hired at help desk. Also what job posting platforms do you recommend? Thanks for replying!",
              "score": 1,
              "created_utc": "2026-01-22 03:06:32",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o124kmg",
                  "author": "RiskVector",
                  "text": "Yeah agreed! All of them! How fast can you land a helpdesk job? That depends on you really. Are you applying to one or two jobs a day or are you sending out 15, 20, 25 applications? You may think that 25 is a lot, but its not especially with LinkedIn has \"Easy Apply\" or what ever it is. \n\nif you get hit up by recruiters for entry level positions, stay away from them! You shouldn't need a recruiting service to land a helpdesk job, or a entry level soc job. They are generally bad, no benefits, no pto or very limited, no 401k.. etc.. stay away from recruiters! \n\nIf you are browsing LinkedIn and you see a job you like and are interested, re-write your resume specific to that job, write up a cover letter, and then go to the companies website and apply directly on the site.",
                  "score": 2,
                  "created_utc": "2026-01-22 15:14:23",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o125azx",
                  "author": "Slight_Manufacturer6",
                  "text": "All, but I have had the best luck with Indeed.",
                  "score": 1,
                  "created_utc": "2026-01-22 15:17:53",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o13subm",
                  "author": "ITguyBass",
                  "text": "The market is terrible for everyone, but for some companies is best to hire someone with less experience, because they will stay longer. If they hire someone overqualified, the person most certainly will move to a better position as soon as possible. Just separate some time daily to study and apply, like 3 hours each or as you feel more comfortable, because this is kinda your profession now. If you want to improve your chances, you can start studying the Comptia A+ and security+  certifications.",
                  "score": 1,
                  "created_utc": "2026-01-22 19:45:57",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o0zcflx",
                  "author": "SavannahPharaoh",
                  "text": "All of them lol. Keep in mind that many help desk jobs are remote so apply anywhere and everywhere.",
                  "score": 1,
                  "created_utc": "2026-01-22 03:15:09",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o1ekzuo",
              "author": "CombinationEntire552",
              "text": "Finding a helpdesk job can be a great starting point, and it's true that many people in the field started out in similar roles. However, it's also important to consider other entry-level positions, such as junior security analyst or IT specialist. These roles may offer more opportunities for growth and development in the field of cybersecurity.",
              "score": 1,
              "created_utc": "2026-01-24 10:29:34",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1fq7fb",
                  "author": "RiskVector",
                  "text": "I agree with some of that statement. \n\nI don't agree with \"IT specialist\". That is literally a helpdesk job. The helpdesk guys were idiots and couldn't figure out the issue, so they passed it up to the \"IT Specialist\" team, and depending on who you ask in this filed, it's the same thing, just a fancier way of saying 'helpdesk'\n\nAnd yes there are better roles out there for entry level. The market right now is shit though and over saturated. OP has ZERO experience. He is applying to jobs with at least 100 other applicants who do have experience so helpdesk is the best bet right now. I'm not saying he shouldn't apply for other jobs or positions that interest him. Who know he might get lucky!",
                  "score": 1,
                  "created_utc": "2026-01-24 15:13:06",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o11k4rs",
          "author": "Unlikely-Luck-5391",
          "text": "Don’t expect a pure “cybersecurity” role right away. Most people start in help desk, IT support, SOC tier 1, NOC, or junior sysadmin roles and move into security later.\n\nApply now while doing certs. Build small labs (AD, basic networking, logs, TryHackMe/HTB) and list those as experience. Tailor your resume and don’t wait for everything to be perfect. It’s hard, but doable.",
          "score": 5,
          "created_utc": "2026-01-22 13:29:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o119z7c",
          "author": "mandevillelove",
          "text": "target entry- level IT/SOC roles, showcase labs and apply broadly while finishing certs.",
          "score": 1,
          "created_utc": "2026-01-22 12:27:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o12017i",
          "author": "cyberguy2369",
          "text": "a few questions:  \n\\- I'm guessing you did the UTSA online program? that would give you a lot of free time, were you working at all during the program? what kind of work was it?   \n\\- what kind of jobs are you applying to? how are you finding those jobs to apply to? (just linkedin? )  \n\\- I'm assuming you're in the US, are you a citizen of the us? (it matters in the kinds of jobs you should be applying to)  \n\\- are you networking (in person) at all?",
          "score": 1,
          "created_utc": "2026-01-22 14:52:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o125nsq",
          "author": "Slight_Manufacturer6",
          "text": "Start by getting some experience. Ideally you should have gotten an intern while you were still in school, but since that opportunity has passed you can still volunteer your IT services at places like charitable organizations… like churches for example are always needing help.",
          "score": 1,
          "created_utc": "2026-01-22 15:19:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o12mn2x",
          "author": "nexeris_ops",
          "text": "Apply broadly to entry-level roles like IT support, SOC analyst, junior GRC, or NOC positions while finishing a cert like Security+, and focus your resume on labs, school projects, and hands-on work rather than “no experience.” Your first job doesn’t have to be pure cybersecurity, it just needs to get you close to systems, users, and security workflows.",
          "score": 1,
          "created_utc": "2026-01-22 16:37:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1383nx",
          "author": "Business-Progress-39",
          "text": "Customer service",
          "score": 1,
          "created_utc": "2026-01-22 18:13:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o13rswy",
          "author": "ITguyBass",
          "text": "In my experience, most of the Security team started as an entry-level support role, like helpdesk, deskside support, NOC or anything related to network. It is pretty rare to beggin straight on a security role, because you need to build some experience, and most of the managers don't think the graduation experience is enough. I don't know what you studied in depth, and I can't say it is not possible, but usually people start in those positions.\n\nSo maybe it's worth looking for those roles, and while you look, having some certifications will be a differentiator for yourself over the other candidates but in the end, the experience will come in handy more than you think. If you are able to work in a medium-big company you can steadly grown there, like it was for me, but also a small business will allow you to grow in a different way, like you will mostly have a lot of experience in many areas, you will have to be technical support, sysadmin, Network guy, the \"security guy\" and etc, but it comes with a lot of experience in many areas.\n\nIn the end, try to start somewhere, once you are working, it will be easier to find for best positions as you grow.",
          "score": 1,
          "created_utc": "2026-01-22 19:41:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1kjsun",
          "author": "Rude_Tart_2573",
          "text": "We’re in opposite positions. I have 5 years of SOLID experience and no degree/certs. I need the certs and you need the experience lol.",
          "score": 1,
          "created_utc": "2026-01-25 05:46:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0zhof3",
          "author": "Chow_UwU",
          "text": "Wow, I actually just applied for UTSA's cybersecurity masters program... I'm intrigued to hear about a new grad from there having troubles looking for a job. Honestly, why not just get your masters degree - seriously asking.",
          "score": 1,
          "created_utc": "2026-01-22 03:46:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1055b9",
          "author": "S4LTYSgt",
          "text": "Harsh reality. For every 100 applications you do, 1 employer will review your application and of that 1 employer its basically a gamble whether you will get an interview or not. My advice. Apply to 1000 roles. Start from local zip code, then branch out to all over the state, then branch out all over the country.",
          "score": 0,
          "created_utc": "2026-01-22 06:33:14",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qldidc",
      "title": "I wanna pursue cyber security...... how should i start?? (its my first time posting here i hope it is the place)",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qldidc/i_wanna_pursue_cyber_security_how_should_i_start/",
      "author": "Ill-Jacket-1106",
      "created_utc": "2026-01-24 04:41:25",
      "score": 8,
      "num_comments": 20,
      "upvote_ratio": 0.7,
      "text": "I am 15, and ya..... as the title says...... please suggest me.....",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qldidc/i_wanna_pursue_cyber_security_how_should_i_start/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o1difc5",
          "author": "Pitiful-Excitement47",
          "text": "Go to school or boot camp or self study certs.",
          "score": 3,
          "created_utc": "2026-01-24 04:58:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1j0ot7",
              "author": "LowGun03",
              "text": "Got my BSc in cyber sec, about as much experience as a fresh grad can get and i’ve not had even an interview in about 7 months of actively seeming a job, imo school is the worst path as someone with 3 years experience will smash you out the water if you have 3 years of education and the degree",
              "score": 1,
              "created_utc": "2026-01-25 00:26:00",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1j28f3",
                  "author": "Pitiful-Excitement47",
                  "text": "He is asking how to get a start. So I gave him multiple pathways. Not everyone learns the same and will excell in the same pathways. \n\nSomeone who has to ask obviously lacks any foundation, as even a simple Google would answer his questions. College might be best for him. \n\nExperience always beats degrees/certs. You are likely only applying for the higher level positions or have something seriously wrong with your resume.",
                  "score": 1,
                  "created_utc": "2026-01-25 00:33:58",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1djv6t",
          "author": "Gen4GlockAndSwitch",
          "text": "Tryhackme or Hackthebox",
          "score": 3,
          "created_utc": "2026-01-24 05:08:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1m9buy",
              "author": "Big_Substance_417",
              "text": "Try hack me is the best way to start.",
              "score": 2,
              "created_utc": "2026-01-25 13:57:37",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1m9ul4",
                  "author": "Gen4GlockAndSwitch",
                  "text": "This a fact. You ain’t lie at all",
                  "score": 1,
                  "created_utc": "2026-01-25 14:00:36",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1dkz7m",
          "author": "SatisfactionMuted103",
          "text": "Download the ISO 270001 PDF and learn all the terms.",
          "score": 2,
          "created_utc": "2026-01-24 05:16:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1di3v4",
          "author": "CartographerOne4633",
          "text": "Hit search and read the threads. Reading is fundamental in this field.",
          "score": 1,
          "created_utc": "2026-01-24 04:56:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1dmcuh",
          "author": "Highfivesghost",
          "text": "WGU has cybersecurity degrees for cheap",
          "score": 1,
          "created_utc": "2026-01-24 05:26:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1do7uk",
          "author": "Fresh_Heron_3707",
          "text": "Cyber security is not an introductory discipline. Until you’ve dealt with tech before that’s where you need to start. You need to understand natural failure states before malicious failure states.",
          "score": 1,
          "created_utc": "2026-01-24 05:40:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1duyiv",
          "author": "Glass-Pound-9591",
          "text": "I wish you Good luck man. Just good luck.",
          "score": 1,
          "created_utc": "2026-01-24 06:34:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1duyu4",
          "author": "IsDa44",
          "text": "Roadmap.sh has a good roadmap. I also have one incase u want to check it out, isdadev.at",
          "score": 1,
          "created_utc": "2026-01-24 06:34:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1eck46",
          "author": "themagicalfire",
          "text": "First, learn Saltzer and Schroeder’s design principles.",
          "score": 1,
          "created_utc": "2026-01-24 09:11:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ef1lj",
          "author": "lifeisamz",
          "text": "Read the RFC document.",
          "score": 1,
          "created_utc": "2026-01-24 09:34:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1eipi9",
          "author": "Educational-Chef103",
          "text": "If you decided to start cyber sec, learn network essentials bro. Trust me. But know that happiness doesn't exist for you afterward. Good lucks.",
          "score": 1,
          "created_utc": "2026-01-24 10:08:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1eyz1n",
          "author": "ParticularAnt5424",
          "text": "If you have a choice between a cyber major or computer science - the latter is way more helpful.\n\n\n\n\nCybersecurity is very broad and I doubt you know exactly what you want or will do. CS is the fundamentals of cybersecurity. You should understand how computers works, how to program, networking, how https works, how to troubleshoot a printer lol, etc. \n\n\n\n\nAt this age I would also recommend doing CTFs - they are super fun to play with instated of the boring \"read this text for nothing\", CTFs give you a goal and by doing it you will remember it while having fun. Very cool free is https://overthewire.org/wargames/, but you can also try HackTheBox and TryHackMe.\n\n\n\n\nThat's about it. Remember to have fun whatever you decide to do ",
          "score": 1,
          "created_utc": "2026-01-24 12:29:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ixivr",
          "author": "DirtComprehensive520",
          "text": "Get a bachelors degree in computer science and consider the military.  In either order.",
          "score": 1,
          "created_utc": "2026-01-25 00:09:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1kprya",
          "author": "Confident_Natural_87",
          "text": "I would recommend starting with the Google IT Support Professional certification.  Then move to the Comptia A+ core 1 and 2.  Just study for them if the test is too expensive.  Move onto Network +.  Hopefully you local library system (in Texas anyone can get a HPL card) and get access to LinkedIn Learning and Udemy Business for free.\n\nAgain just study Network +.  If you have the money take the exam.  Still you can skip the exams and study for the CCNA.  That will cover all the Network basics.  Then maybe study.  \n\nLook at the local CC as well.  You could possibly dual credit some courses.  Finally go to partners.wgu.edu.  Go to partners.wgu.edu.  Click your state and see if the school is listed.  If it is see what degree you can get that transfers into the WGU degree.  CCNA gives you 11 credits towards the Cybersecurity and the BSIT.  Personally I would recommend the BSIT as you can transfer in more.  As you get the higher Comptia certs you can get your MSCIA at WGU.",
          "score": 1,
          "created_utc": "2026-01-25 06:31:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1nuqta",
          "author": "GhostlyBoi33",
          "text": "TCM-Security is also good! HTB is pretty good too",
          "score": 1,
          "created_utc": "2026-01-25 18:19:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1qajvv",
          "author": "Background-Slip8205",
          "text": "You don't.  You think you do because you have no clue what cybersecurity really is, but you hear it's cool like the movies, you get to play with advanced gadgets, and it pays a ton of money.\n\nThe reality is, the pay sucks for 80% of people compared to other specialties, you're basically blindly reading through log files / text files all day, or running mundane pointless reports and audits.   \n\nCyberSecurity requires 5-10 years minimum experience in a ton of different IT areas to be truly good and excel, and colleges are handing out degrees like popcorn.\n\nSo if you try to pursue cyber instead of a regular more balanced IT degree, you're going to struggle to find a job for months at a time.  Once you do get a job you're going to be miserable and hate it, and you're going to be making $20 an hour for the first few years with small pay raises and a low chance of moving up and advancing your career.  \n\nStick with general IT or CS.  Learn Linux, learn AD, networking, understand in general how databases work, and go into IT with an open mind.   Think of it like getting icecream.  If you've never had any flavor ice cream before, why would you fixate on only trying vanilla, when there's 80 different flavors you should give a chance to?",
          "score": 1,
          "created_utc": "2026-01-26 00:51:32",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qnd4b1",
      "title": "Made an account on a potential (quite likely) scam site",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qnd4b1/made_an_account_on_a_potential_quite_likely_scam/",
      "author": "OverFace9316",
      "created_utc": "2026-01-26 11:05:04",
      "score": 8,
      "num_comments": 5,
      "upvote_ratio": 0.84,
      "text": "Hi,\n\nI've recently made an account on a site where \"Kai Cenat\" claims to give out 2500 dollars.\n\nI used my gmail name and a random password, and claimed the \"bonus\". I didn't do anything else.\n\nNoteworthy is I didn't get any mail in my inbox, nor did I verify anything. Basically just signed up with the promo code. That's it.\n\nAt first it was just curiosity and for the laughs as I know it's fake, but now I regret putting myself in this position.\n\nI can't delete the account; the site is called zyxwin.\n\nCan they somehow still do something with only my gmail adress and nothing more?\n\nI'm actually freaking out rn.\n\nAny help is much appreciated!",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qnd4b1/made_an_account_on_a_potential_quite_likely_scam/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o1su5y5",
          "author": "EnvironmentSquare778",
          "text": "Assume the password u used for that site is pwnd",
          "score": 2,
          "created_utc": "2026-01-26 11:25:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1sxf3m",
              "author": "OverFace9316",
              "text": "Hopefully the only thing that's screwed!",
              "score": 1,
              "created_utc": "2026-01-26 11:51:53",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1supj2",
          "author": "eric16lee",
          "text": "As long as you used a unique password to register for this site, you should be ok. If you udes the same password you use in other places, you need to immediately change that password everywhere else you use it. \n\nExpect an increase in spam andogin attempts to your email since you gave that to them. Make sure you have a unique password and 2FA set up on your email.",
          "score": 2,
          "created_utc": "2026-01-26 11:30:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1sxcdg",
              "author": "OverFace9316",
              "text": "Okay used a random password, thanks for the quickly reply puts my mind at ease\n\nAnd I'll set up that 2FA immediately",
              "score": 2,
              "created_utc": "2026-01-26 11:51:18",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1w5slg",
          "author": "Friendly-Error-3448",
          "text": "They can't 'hack' you with just a Gmail address, but it may make it more likely you'll receive spam or malicious (e.g. phishing emails). Fortunately, modern email solutions like Gmail have a host of counter-measures that could block a lot of things before they arrive, however it's always best to stay vigilant!",
          "score": 1,
          "created_utc": "2026-01-26 21:04:29",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qn77jx",
      "title": "I think I somehow downloaded a rootkit onto my computer",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qn77jx/i_think_i_somehow_downloaded_a_rootkit_onto_my/",
      "author": "Kryptonianboethius",
      "created_utc": "2026-01-26 05:25:16",
      "score": 8,
      "num_comments": 15,
      "upvote_ratio": 0.79,
      "text": "I got this message from the \"Program Compatibility Assistant\" on Windows just now while booting up my computer.\n\nIt blocked a module from loading into the Local Security Authority called \"/Device/HarddiskVolume4/Program Files (x86)/Windows Service/Screen Connect.WindowsAuthenticationPackage.dll\n\nFor context, I started torrenting recently.\n\nBut I've only downloaded two .MKV files. Both were from a moderator of 16 years on the most recommended site for torrents. I double checked that they were just MKV files and there was nothing else hidden. I also checked all the comments on the torrent, of which there were many, and there were no red flags.\n\nAt all other times, I've been using NordVPN on a kill switch, with the vpn interface linked to the torrent client as an added kill switch. \n\nI also did a test with downloading Ubuntu, but I deleted that file (if I somehow downloaded a fake Ubuntu file)\n\nI did everything right, I'm so confused. Please don't reply to this post if you just want to criticize me for using torrents. I've done my research on it.\n\nI just want to know what my next steps are and how I insure that I'm safe from this. Honestly a little bit panicky at the moment.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qn77jx/i_think_i_somehow_downloaded_a_rootkit_onto_my/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o1sv84q",
          "author": "eric16lee",
          "text": "No criticism here mate. Just facts. \n\nIn 2926, there are no longer any safe piracy sites. Torrents included. \n\nThe advice I give everyone that does this is to change all of your passwords from a different device and then format your hard drive and reinstall Windows from a USB drive. \n\nThat's the only way to be sure your accounts remain in your possession and you pc is safe.",
          "score": 3,
          "created_utc": "2026-01-26 11:34:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1thd42",
              "author": "Classic_Mammoth_9379",
              "text": "> In 2926, there are no longer any safe piracy sites. Torrents included\n\nDon’t suppose you can look in your historical records for the Feb 2026 lottery results and DM them to me could you?",
              "score": 3,
              "created_utc": "2026-01-26 13:57:44",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1vlzz5",
                  "author": "eric16lee",
                  "text": "Time to start proofreading my responses. \n\nPowerball number is 12.  🙂",
                  "score": 1,
                  "created_utc": "2026-01-26 19:37:14",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1s666q",
          "author": "closeenoughbutmehh",
          "text": "ScreenConnect is a remote desktop solution, which apparently ships its own version of the Windows authentication package. There can be several reasons for this on a technical level, so this is not necessarily a problem.\n\nIf you don't know what ScreenConnect is / haven't ever used it, you might be compromised, but I doubt that's going to be from the torrenting - mkv files are multimedia content only, and I am not aware of any major security flaws with them assuming you're using a player worth its salt like VLC. \n\nLooking into the last modification date of the files in question might help figuring out a timeframe; meantime, a quick malwarebytes scan might be in order, most infections nowadays come from people opening mail attachments or downloading shady things and running them.",
          "score": 2,
          "created_utc": "2026-01-26 07:52:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1to2i4",
              "author": "RoamingThomist",
              "text": "AVs are unfortunately pretty bad at RATs: most of them are legitimate RMM tools that have been reconfigured by a threat actor to connect to their infra, so come up as clean or PUP by most traditional AVs.\n\nWhat makes me suspicious of that dll is that it's not in the right place: screen connect installs to a specific Screen Connect directory. Windows Service is not a default directory for it, and is not a default directory in Windows. So it's a custom installation location, which is strange enough that I'd want to look again at it.",
              "score": 1,
              "created_utc": "2026-01-26 14:32:12",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1wylc4",
                  "author": "closeenoughbutmehh",
                  "text": "Agreed with the non-standard path. However as far as I'm concerned the first thing that comes to my mind is, I know I hardly ever use the default directory nomenclature for anything, and making an assumption otherwise is already one too many because I can't prove it. \n\nAlso, I find that asking about knowledge of a tool's name or function to a user is a better starting point than asking them about their nomenclature habits / whether they always just click ok, oftentimes because many don't even know what I'm talking about. \n\nThat said, and given my last point, you might want to consider easing off the acronyms if you want non-IT people to understand half the things you're saying",
                  "score": 1,
                  "created_utc": "2026-01-26 23:17:54",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o1ub8zh",
              "author": "Kryptonianboethius",
              "text": "It had been downloaded in August, and as far as I know, I didn't have any reason to download a remote access software...\n\nI just went and deleted all the files and emptied my recycle bin. I used the command panel to search for \"screen\" and \"connect\", and then did a ton of malwarebytes scans for rootkits. Even after restarts nothing is showing up, so I think I'm okay now? I hope lol?",
              "score": 1,
              "created_utc": "2026-01-26 16:17:51",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1x0rp0",
                  "author": "closeenoughbutmehh",
                  "text": "Based off u/RoamingThomist's comment, which makes a lot of sense, you might want to consider backing up your important data and reinstalling your operating system. \n\nShort of a thorough scrub with tools like HijackMe and network behavior monitoring, you'll have a hard time making sure everything runs as it should, and - no offense - your question and the way it's written suggest to me that you might not have the level of savvyness necessary to undertake that process without help.\n\nIn which case, better safe than sorry; it's a bit of a pain but at the end of the day the protection of your data is more important than a few hours of your time in pretty much any instance.\n\nBy the way, obligatory reminder that less than 2 copies of your data is equivalent to it not existing at all, minus one incident. Backup your important data in 3 different places: usual copy, plus first backup copy in a different physical medium, plus second backup copy in a different physical _location_.",
                  "score": 1,
                  "created_utc": "2026-01-26 23:28:59",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1tn5tn",
          "author": "RoamingThomist",
          "text": "You need to provide us some more information if you want us to help you triage. As there is nothing here that helps me confirm whether or not you're infected.\n\nA rootkit from a torrent would be interesting; piracy would usually carry the risk of either a RAT or an infostealer (it's almost always Lumma). The filename there is making me think it's ConnectWise ScreenConnect, which is an RMM tool that some threat actors use as a RAT. But that's not the normal installation directory that I've seen in the wild, which makes me suspicious.\n\nI'd do this in powershell, but that's just because I'm used to working from a terminal. Don't have my triage scripts to hand, so this will seem a little janky.\n\nGo into powershell, and do \"gci \"C:/Program Files (x86)/Windows Service/\" -Force -Rec\"; that will show you everything under that Windows Service directory and all its subdirectories. Let me know what is in there, it'll help me smell if anything is weird about it.\n\nDownload autoruns from sysinternals; look through all the tabs, do you notice anything that smells weird? Even a rootkit has to autoload at some point, they generally aren't that sneaky to hide from an autoruns check (especially the kind of rootkits you'd encounter through piracy)",
          "score": 1,
          "created_utc": "2026-01-26 14:27:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1uaqom",
              "author": "Kryptonianboethius",
              "text": "I honestly just went to the file location and deleted all of the ScreenConnect files. Apparently they had been downloaded in August and I was just now getting a warning that they had tried to activate.\n\nSo far, after quite a few restarts and a ton of Malwarebytes rootkit scans, nothing has shown up, so I think I'm safe now? I also went to the command panel and just did file searches for \"screen\" and \"connect\"",
              "score": 1,
              "created_utc": "2026-01-26 16:15:41",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1tu0yk",
          "author": "Odd_Breadfruit763",
          "text": "Ive been a pirate since birth basically, ive had a few malwares/trojans and stuff when i was younger. (Honestly most hasnt even been through torrenting, and none of them has been through downloading movies ive seen tries though, only games or pokemon emulators, fk theres a lot of shit in the emulators)\n\nThe MKV files are probably not the issue, either they use another fileextension IME and try to trick u into opening it that way (ISO is popular, same with exe )or they package the file in another folder, for example \"subtitles\" or \"sample\" folder. ONLY download what you need, for example the english subtitle and MKV file in my case. if u let ur torrent software load u can uncheck all unwanted files.\n\nAlways check what you torrent if you are going to torrent. Best is to not torrent and get things legally, i aint got the cash for that. 2nd best is to do it on a separate machine segregated, i have one of those setup (RPI5), but i still download some movies on my \"main\" device",
          "score": 1,
          "created_utc": "2026-01-26 15:01:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1v963c",
          "author": "MountainDadwBeard",
          "text": "No you did not do \"everything right\".\n\nNuke the whole thing. \n\nStop using torrents or find a VM with hardened file sharing and networking configurations.",
          "score": 1,
          "created_utc": "2026-01-26 18:42:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1vgzo4",
              "author": "Kryptonianboethius",
              "text": "Turns out it's completely unrelated to the torrents and it's something that got onto my computer almost half a year before I started torrenting.\n\nBut yeah, I'm just nuking the whole thing, reinstalling windows from an external drive.",
              "score": 1,
              "created_utc": "2026-01-26 19:15:40",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1w1gqc",
          "author": "Main_Secretary_8827",
          "text": "Rootkits are very rare, you probably did not get one",
          "score": 1,
          "created_utc": "2026-01-26 20:45:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1rpnbu",
          "author": "Kryptonianboethius",
          "text": "Okay so I did some digging and the files it is alerting me about are files I've had since August 2025\n\nSo, either I am unbelievably fucked, or this is completely fine.\n\nGonna leave the post up just in case, and because I would like to know what one does in this situation.",
          "score": 1,
          "created_utc": "2026-01-26 05:40:24",
          "is_submitter": true,
          "replies": []
        }
      ]
    },
    {
      "id": "1qmd2j0",
      "title": "How To KNOW If You Are Safe From Malware/Hacks?",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qmd2j0/how_to_know_if_you_are_safe_from_malwarehacks/",
      "author": "Boy0Boyz",
      "created_utc": "2026-01-25 07:54:11",
      "score": 7,
      "num_comments": 8,
      "upvote_ratio": 0.74,
      "text": "Ok so I have this OCD where I am worried over getting malware or hacked. And I feel this is mostly due to me having a lack of knowleddge in this matter. Like I literally factory reset + change passwords on my phone after clicking on an ad by accident. Essentially, what tells you that you most probably dont (or do) have malwware? Like does a Windows Defender/Play Protect scan do the job? Checking browser dowwnloads/file downloads? Like at what point is when ur doing too much and being paranoid. Like ik one is if you see symptoms of malware like battery drain and all that but cant that be also due to an old device? So yeah i kinda just dont know.\n\nTLDR: title",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qmd2j0/how_to_know_if_you_are_safe_from_malwarehacks/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o1l8pam",
          "author": "sai_ismyname",
          "text": "\\>Like at what point is when ur doing too much and being paranoid.\n\nnot to be mean, but you are way past that point\n\nthe problem with that whole security thing is \"you never know until you know for sure\"  \nthat's why threat hunting exists for example. even in environments that are highly monitored , you can never be sure\n\nBUT (and this is a big but) there is also something called threat modeling. and since i don't assume that you are a high value target like some kind of political figure or activist in a country like the USA , Russia or Iran, you have most likely nothing to worry about\n\non mobile as well as on pc your best bet is to not click stuff you are not familiar with and to use an ad-blocker\n\non both mobile and laptop/pc you can use firefox with ublock-origin and you should be fine in 90% of the cases",
          "score": 2,
          "created_utc": "2026-01-25 09:12:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ljkn5",
          "author": "CombinationEntire552",
          "text": "I totally understand your concern! To ease your mind, you can start by regularly scanning your devices with Windows Defender or other reputable antivirus software. Also, make sure to keep your operating system and software up to date, as newer versions often include security patches. Additionally, being cautious when clicking on links or downloading attachments from unknown sources can go a long way in preventing malware infections.",
          "score": 1,
          "created_utc": "2026-01-25 10:49:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1m0jkt",
          "author": "ParticularAnt5424",
          "text": "That's the fun part - you don't!",
          "score": 1,
          "created_utc": "2026-01-25 13:04:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1m3jjp",
          "author": "jmnugent",
          "text": "> \"what tells you that you most probably dont..\"\n\nThat's not a thing (because there's no way to \"prove a negative\"). \n\nThe technical answer to this is:.. You can't (realistically). Because of the constantly evolving and changing nature of malware, its TECHNICALLY possible there's some brand new infection or brand new exploit out there that nobody knows about yet that is silently worming it's way around the internet. \n\nBut as it always is with technology,. there is a difference between:\n\n* Something being \"technically possible\"\n\n* and the odds of it actually happening to you. (which are astronomically small) \n\nFor the average typical person,. if you are:\n\n* Keeping your OS, Apps, etc all updated. \n\n* and you're not opening unknown emails and not responding to unknown texts and not doing anything else stupid \n\nThen you've just eliminated about 95% of the potential threat to you.",
          "score": 1,
          "created_utc": "2026-01-25 13:23:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1m44cd",
              "author": "Boy0Boyz",
              "text": "what about responding to discord dms? Like I asked for advice on a game in the official server and someone dm'd to help for example. Or u should never dm ppl on apps just to be safe",
              "score": 1,
              "created_utc": "2026-01-25 13:27:06",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1m5w49",
                  "author": "jmnugent",
                  "text": "Depends. Are you using critical thinking when interacting with them ?\n\nIf I was cold-contacted by someone,. I would be cautious about what information they gave me. (and I certainly would not click any links or install any random EXE's they send me)\n\nBut if I was fighting a particular issue and someone just randomly cold-contacted me and said something like \"Hey, I had that issue to,. and recent Microsoft patch (KB5074968) was what caused that, I uninstalled that specific patch and the problem went way\". \n\nThen without even responding to them at all.. I can just go to google and search on \"KB5074968\" and see if there's lots of discussion online about that specific patch causing problems. If the google results match up with what the person was saying,. then I might assume he's being honest and uninstall the patch. \n\nBut obviously in that case.. I can independently verify what they are saying. So it's pretty easy to figure out if they are trying to be misleading or not. (in my example,. they were not)",
                  "score": 1,
                  "created_utc": "2026-01-25 13:37:42",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qnoi7o",
      "title": "Are there any types or career fields in cyber security for someone with a mathematics degree?",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qnoi7o/are_there_any_types_or_career_fields_in_cyber/",
      "author": "Cwazy_Llama",
      "created_utc": "2026-01-26 18:33:34",
      "score": 7,
      "num_comments": 8,
      "upvote_ratio": 0.83,
      "text": "US Army infantry veteran( 7 years) \n\nMath Degree(Bachelors) \n\n5 years of experience in data/data analytics/ and now as a data manager. \n\nI know SQL and python very well. \n\nJust seeing if there's any type of career spaces within the cyber security realm for someone with my type of background and profile. ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qnoi7o/are_there_any_types_or_career_fields_in_cyber/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o1vc875",
          "author": "MountainDadwBeard",
          "text": "Yes, cryptography and software architecture both use math majors. I imagine you'd be decent at learning networking for calculating subnets and cable runs. \n\nA statistical approach to large soc rule tuning would also be cool, but I doubt most orgs would invest in it.",
          "score": 4,
          "created_utc": "2026-01-26 18:55:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1vux8l",
          "author": "Uncle_Snake43",
          "text": "Data Engineering?",
          "score": 1,
          "created_utc": "2026-01-26 20:16:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1w498l",
          "author": "CartographerOne4633",
          "text": "I’m a 7 year veteran grunt as well. Just recently started transitioning towards the cyber field. If you got any tips I’d appreciate it brother.",
          "score": 1,
          "created_utc": "2026-01-26 20:57:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1w7zyf",
          "author": "Friendly-Error-3448",
          "text": "Bigger firms will have dedicated cyber risk analytics teams, they often look at challenging problems at scale. Data analysis is pivotal",
          "score": 1,
          "created_utc": "2026-01-26 21:14:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1xs0v1",
          "author": "Human-number-579",
          "text": "Your bachelor degree subject won’t matter all that much really. Your skills and any certs you can pick up (and maybe a clearance if you have it) will be worth more. For what it’s worth I’m a Sr Manager in cybersecurity with a bachelor’s in Emergency Management.\n\nI’d lean toward data engineering with your existing skills. Check out Seattle Data Guy [https://youtube.com/@seattledataguy](https://youtube.com/@seattledataguy) on YouTube",
          "score": 1,
          "created_utc": "2026-01-27 01:51:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1v9sdr",
          "author": "jeffpardy_",
          "text": "Sounds like you should do some threat detection engineering with machine learning",
          "score": 1,
          "created_utc": "2026-01-26 18:45:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1v960a",
          "author": "[deleted]",
          "text": "[deleted]",
          "score": 0,
          "created_utc": "2026-01-26 18:42:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1vynm3",
              "author": "-hacks4pancakes-",
              "text": "You need an advanced degree for most cryptography roles. It’s pretty academic.",
              "score": 1,
              "created_utc": "2026-01-26 20:32:41",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1wn6tj",
                  "author": "Natural_TestCase",
                  "text": "no, there’s a lot of mundane cryptography engineer roles in fortune 500 companies that handle PKI,SSH, PAM,PQC.",
                  "score": 1,
                  "created_utc": "2026-01-26 22:22:31",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qkdetf",
      "title": "Unknown email appeared in autofill",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qkdetf/unknown_email_appeared_in_autofill/",
      "author": "RingAdmirable4757",
      "created_utc": "2026-01-23 01:40:45",
      "score": 5,
      "num_comments": 12,
      "upvote_ratio": 0.86,
      "text": "As the title mentioned, when I was trving to sign in YouTube in my phone browser, not the app), my auto fill emails came up, but as shown in the image the first option in the list isnt an email that I recognise or have typed in before. Does anvone know what might've happened and what should I do? \n\nI have a password and never let anyone sign in anything before btw.\n\nIs this a potential breach risk in my device? ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qkdetf/unknown_email_appeared_in_autofill/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o165o5h",
          "author": "MerpoB",
          "text": "Image?",
          "score": 1,
          "created_utc": "2026-01-23 03:04:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1663bf",
              "author": "RingAdmirable4757",
              "text": "I couldn't seem to insert any image when creating this post",
              "score": 1,
              "created_utc": "2026-01-23 03:06:50",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o17y785",
          "author": "nakfil",
          "text": "You may have been logged into your browser profile on another device that someone else has access to. Log out all other sessions to be safe and change your password and make sure you are using 2FA.",
          "score": 1,
          "created_utc": "2026-01-23 11:27:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o18zofd",
              "author": "saltyachillea",
              "text": "I believe there re limitation to this? You need to ensure any recovery keys, and passkeys are reset all on previous devices. I would go into your google account and really spend some time on 3rd party access apps/services, and other devices, etc. You can also request copies of your own personal account information (very detailed), get this to look into. I’m not an IT professional, but know someone who has ongoing issues with their ex doing this. Also, what phone are you using? I’m going to assume this is android with edge on it?",
              "score": 1,
              "created_utc": "2026-01-23 15:08:26",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o19x1q5",
                  "author": "nakfil",
                  "text": "Yep, also good advice. Check all recovery information as well in the Google account.",
                  "score": 2,
                  "created_utc": "2026-01-23 17:41:03",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1cmstw",
                  "author": "RingAdmirable4757",
                  "text": "Im using a Samsung on Samsung internet browser",
                  "score": 1,
                  "created_utc": "2026-01-24 01:43:22",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1haodg",
          "author": "Mobile_Syllabub_8446",
          "text": "Is the device second hand ?",
          "score": 1,
          "created_utc": "2026-01-24 19:24:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1l35wk",
              "author": "RingAdmirable4757",
              "text": "Nope, its brand new",
              "score": 1,
              "created_utc": "2026-01-25 08:23:54",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1lbnyd",
                  "author": "Mobile_Syllabub_8446",
                  "text": "Mmm I've had it before and just figured it was a returned device or similar.\n\nIt shouldn't happen even then but weirdly does and nobody seems to talk about it which is kind of weird.",
                  "score": 1,
                  "created_utc": "2026-01-25 09:38:44",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qn3obz",
      "title": "How to boost chance to get recruited in cybersecurity jobs",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qn3obz/how_to_boost_chance_to_get_recruited_in/",
      "author": "VEXX452",
      "created_utc": "2026-01-26 02:40:16",
      "score": 5,
      "num_comments": 5,
      "upvote_ratio": 0.86,
      "text": "Hey,  iam cs science student whos currently studying  master segree of cybersecurity,  i liked this domain better then development,  i was trying to get internship but a of th got rejected because all post are filled(due the state state of the cuntry poor laws and unawares of cybersecurity jobs are limited), so i was thinking  what should i do to really  boost my chances to get accepted right after college like i want the secret thing that recruiters wants, i have hear that having certification  will help but due the economic state of my country they are way too expansive for students, currently iam reading books  and they are good source of knowledge  but they cant prove anything yet, i also do CTFs.\n\nWhat thing you would say that will help me and is it better, equivalent or way better then certification ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qn3obz/how_to_boost_chance_to_get_recruited_in/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o1qysbz",
          "author": "TazmanianSpirit",
          "text": "So have you had an internship? You can get discount on the Comptia certs if you use your student email. There’s also home labbing to get experience or sites like THM and HTB",
          "score": 1,
          "created_utc": "2026-01-26 02:54:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1r00r5",
          "author": "mich-bob",
          "text": "I would also suggest you attend local cybersecurity conferences. Talk with vendors get a good understanding of their product offerings. Network with conference attendees, talk about state of cybersecurity threats and ask lots of questions.",
          "score": 1,
          "created_utc": "2026-01-26 03:00:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1tvcvb",
          "author": "cyberguy2369",
          "text": "hiring manager and director of a cybersecurity security group in the US. \n\na few questions:  \n\\- what country are you in? are you a citizen of that country? (it matters in what kind of jobs you apply to and how you should approach jobs)  \n\\- what are you interested in. .\"cyber security\" is a very broad term  \n\\- what experience do you currently have in the work force? \n\nanswers to your questions:  \n\\- get network+ and security+ both are straight forward and are reasonably priced for students. they will show general knowledge.   \n  \n\\- get a job in tech. any job.. some job in tech.. not next summer.. today. an in person job.. it shows more than you think.   \n\\*\\* you can show up on time and stick to a normal working class schedule   \n\\*\\* you can deal with management and superiors.. you can take directions and criticism   \n\\*\\* you can handle taking on tasks and assignments.. and even multiple tasks and assignments and deliver  \n\\*\\*you will see how real tech works, not just homelabs and contained environments. you'll be working on 1/2 working broken networks, computers and equipment.\n\n\\- network.. in person.. go out and find people in tech. if you are in any kind of community it will have some kind of local conferences, or tech meetups. my very mid range southern city has a tech meetup and cyber meet up monthly. the town an hour south of me does the same. its been amazing for networking, I've learned a lot from the meetups too. \n\n\\- network.. at your university. there are professors, upper classment, an it dept.. lectures.. clubs and organizations.. if you arent part of those you are missing 40-50% of what college/university is about and the resources they provide. \n\n\\- do SOME projects on your own.. tryhackme and other sites are great for learning.. but those are essentially classes.. where information is fead to you in a controlled way.. do more.. do something on your OWN.. where someone else hasn't done the hard work (the research and implementation) for you.  this is not something you put on a resume.. but something you absolutely bring up in an interview when they ask how you spend your time or what you're interested in. \n\nit shows you can teach yourself, and you learn on your own. it shows you spend some of your time bettering yourself and focused on your career. (not all your time) and it shows you can produce things.",
          "score": 1,
          "created_utc": "2026-01-26 15:07:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1tvdst",
              "author": "cyberguy2369",
              "text": "example:  \nyou really are interested in cyber.. you want to learn more about python and dealing with data. as a student you have access to the [shodan.io](http://shodan.io) api for free with your university email address. so you begin to dig through the [shodan.io](http://shodan.io) information using the API and visualize or analyze that data in different ways.   \n\\- \"what are the latest trends in the last 30 days?\"  \n\\- \"what new vulnerable devices have been added to the shodan database in the last 24 hours\"  \n\\- \"what are the biggest vulnerabilities out there in my area right now\"  \n\\- \"out of the vulnerable devices out there, what kind of devices are there\"\n\nthen find a way to store that info locally so you can build long term analysis and trends.. and go in deeper over time. \n\nbefore you say \"whoa.. that seems really complicated.. and way above my level.. \" you dont do it all at once.. part of this is figuring out how to break it down into usable and doable chunks.. (WHICH IS HUGE IN ITSELF).. then approaching those chunks and learning how to make it work. \n\n[Claude.ai](http://Claude.ai) and chatgpt are great for things like this.. not just the coding. (Claude.ai is way better at the code) but the process in general. \n\nchatGPT or [Claude.ai](http://Claude.ai) (use both compare answers)  \n\"I want to use [shodan.ai](http://shodan.ai) and python to build a small simple script to do the following:XYZ.. dont show me code yet, lets talk this through.. I want to focus on my region, (insert your region). the questions I want to answer are:  \n\\- question 1  \n\\- question 2  \n\\- question 3  \n\\- question 4  \nmy priorities are: A B C\n\nI am very new to programming in python.. how would I approach this\"",
              "score": 1,
              "created_utc": "2026-01-26 15:07:49",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o1ty9s9",
              "author": "cyberguy2369",
              "text": "When it comes to jobs in cyber, the market today isn’t what it was three or four years ago. Things have matured and consolidated, especially in the U.S. and other western countries. Expectations are higher now, and experience actually matters again. Most people aren’t walking straight out of college into a pure “cyber” role anymore. Some do, but they’re the exception, not the rule. To really succeed in cyber, you need a solid technical foundation first.\n\nIf you’ve never worked with networks or really understand how systems talk to each other, how are you going to make sense of alerts in a SOC? Are employers supposed to teach you all of that on the job? They usually won’t, because there are hundreds of applicants who already have that experience and can contribute on day one.\n\nSame thing with DFIR. If you don’t understand how Windows and Linux log activity, how data is stored, how the registry works, what event logs are telling you, or how systems behave in memory, it’s going to be really hard to step into that role and be effective. That knowledge doesn’t come from theory alone.\n\nThe reality is that most tech jobs have some cybersecurity built into them. Help desk, system admin, and network admin roles are where a lot of people actually learn “cyber” without the title. That’s where you deal with accounts, permissions, Active Directory, Linux file access, locking down servers, rebuilding old or vulnerable systems, and cleaning up real-world messes. That’s the foundation.\n\nAnd that foundation is what lets you move into cybersecurity later and actually be good at it. So when you’re job hunting, don’t narrow your search too much. Cast a wide net. A lot of solid cyber careers start in roles that don’t have “cybersecurity” in the title at all.",
              "score": 1,
              "created_utc": "2026-01-26 15:21:12",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qjw7b8",
      "title": "Looking for Udemy course or youtube tutorial recommendations that match my exact pentesting lab setup",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qjw7b8/looking_for_udemy_course_or_youtube_tutorial/",
      "author": "Anonymous36513",
      "created_utc": "2026-01-22 14:38:21",
      "score": 4,
      "num_comments": 1,
      "upvote_ratio": 0.83,
      "text": "Does anyone know a course that uses a similar setup (Kali + Hyper‑V + vulnerable VMs(I have a ubuntu and 3 windows VMs) + Metasploit/Nessus/Nmap(zenmap)) etc?\nI want something that mirrors the environment I’m already using so I can practice more effectively. I have the Cybersecurity course this semester but I am not understanding anything from teacher's lectures.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qjw7b8/looking_for_udemy_course_or_youtube_tutorial/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o122f81",
          "author": "Separate_Marzipan976",
          "text": "you can get everything on youtube   \nstep 1 - ask chatgpt list  \nstep 2 - ask each topics on youtube",
          "score": 1,
          "created_utc": "2026-01-22 15:04:01",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qkz30s",
      "title": "Best VPN? Looking for Recommendations",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qkz30s/best_vpn_looking_for_recommendations/",
      "author": "ChickenEggMedium",
      "created_utc": "2026-01-23 18:41:15",
      "score": 4,
      "num_comments": 19,
      "upvote_ratio": 1.0,
      "text": "Hey people, I’m about to commit to a VPN, and I want to make sure I choose the right one. Free VPNs don’t work anymore, so that’s not an option. I’m looking for something that reliably works, offers fast speeds without buffering, has unlimited data, and follows a strict no-logs policy. I keep seeing the same big providers everywhere like MillionVPN, Mullvad, and others. Are these actually solid choices? I’d really appreciate hearing real recommendations.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qkz30s/best_vpn_looking_for_recommendations/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o1b0wf8",
          "author": "PizzaUltra",
          "text": "Why do you think you need a VPN? What do you think you need it for? What would be your main use cases?",
          "score": 1,
          "created_utc": "2026-01-23 20:44:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1bma30",
              "author": "talex625",
              "text": "If you go to work and you don’t want your employer to see your web activity’s or am I wrong?",
              "score": 0,
              "created_utc": "2026-01-23 22:25:16",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1e29uq",
                  "author": "ChickenEggMedium",
                  "text": "This one too",
                  "score": 1,
                  "created_utc": "2026-01-24 07:38:05",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1bhd11",
          "author": "LRaccoon",
          "text": "What's your threat model? Use cases?",
          "score": 1,
          "created_utc": "2026-01-23 22:01:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1biv8g",
          "author": "DarthShitpost",
          "text": "I use Mullvad and Proton and both have been solid so far.",
          "score": 1,
          "created_utc": "2026-01-23 22:08:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1c7yw9",
          "author": "Medium-Potential-348",
          "text": "Proton / iVPN / Mullvad\n\nProton has the best free VPN.",
          "score": 1,
          "created_utc": "2026-01-24 00:19:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1df7i8",
          "author": "mandevillelove",
          "text": "for reliable fast, no logs VPN use - Nord VPN, express VPN, or Mullvad are solid picks that actually work well.",
          "score": 1,
          "created_utc": "2026-01-24 04:36:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1j1uqf",
              "author": "gloves085",
              "text": "NordVPN? The VPN that got compromised and tried to hide it?",
              "score": 2,
              "created_utc": "2026-01-25 00:32:01",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1j298f",
                  "author": "gloves085",
                  "text": "First very basic account of what happened, there was much better reporting at the time...  \n[What's the truth about the NordVPN breach? Here's what we now know | TechRadar](https://www.techradar.com/news/whats-the-truth-about-the-nordvpn-breach-heres-what-we-now-know)",
                  "score": 1,
                  "created_utc": "2026-01-25 00:34:05",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1e1gye",
          "author": "Zealousideal_Leg5615",
          "text": "I’ve been on expressvpn for a while,  the speeds stay good and it doesn’t mess with my stuff.",
          "score": 1,
          "created_utc": "2026-01-24 07:30:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1gw1az",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-24 18:21:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1gw1dq",
              "author": "AutoModerator",
              "text": "Hello,\n\nYour comment was automatically removed because your Reddit account has significantly negative comment karma. We use this threshold to reduce disruptive behavior and maintain quality discussion in r/cybersecurity.\n\nIf you believe this was a mistake or would like to appeal, feel free to message the mod team.\n\nThank you.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CyberSecurityAdvice) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-01-24 18:21:43",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1h397o",
          "author": "VoiceHoliday7192",
          "text": "You can use a wireguard VPN with residential IPs. It has low latency, strong encryption, high speeds and a simple config that you can apply it on the official client. The price of the VPN it's starting at $4/mo. Here it's the VPN [anonymous-proxies VPN](https://www.anonymous-proxies.net/products/wireguard-vpn/).",
          "score": 1,
          "created_utc": "2026-01-24 18:52:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1o9nnx",
          "author": "namebrained",
          "text": "I used to swear by Proton until I saw a thread on Twitter detailing how they complied with law enforcement in 2021. Now Mullvad seems like the best choice just on the basic of how it’s engineered alone, no accounts or IP identifiers etc.",
          "score": 1,
          "created_utc": "2026-01-25 19:21:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1r96u6",
          "author": "Flaissen",
          "text": "I am using Million VPN and works perfectly.",
          "score": 1,
          "created_utc": "2026-01-26 03:52:50",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qiyp8g",
      "title": "What’s the safest way to pay with PayPal on Android Samsung without exposing my real debit card details?",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1qiyp8g/whats_the_safest_way_to_pay_with_paypal_on/",
      "author": "DowntownTrack2518",
      "created_utc": "2026-01-21 14:03:16",
      "score": 3,
      "num_comments": 3,
      "upvote_ratio": 0.81,
      "text": "I have a Samsung Android phone and I must pay using PayPal.\n\nI want to minimizing risk and not having to manually enter or expose my full debit card details if possible.\n\nAre there any safer alternatives?\n\nWhat’s the safest setup in this case, and what risks should I be aware of? ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1qiyp8g/whats_the_safest_way_to_pay_with_paypal_on/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "o0uum5g",
          "author": "mandevillelove",
          "text": "Link a virtual card or prepaid card to Paypal and enable 2FA - never share your real debit details directly.",
          "score": 2,
          "created_utc": "2026-01-21 14:07:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1a4lr3",
              "author": "DowntownTrack2518",
              "text": "Thanks! What if I link my bank account instead? Is it safe?",
              "score": 1,
              "created_utc": "2026-01-23 18:15:01",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o13d6yb",
          "author": "ITguyBass",
          "text": "The safest way to pay with PayPal on a Samsung Android phone is to use PayPal’s app with a virtual or tokenized payment method, so your real debit card is never shared with the merchant. Ideally, link a virtual card (PayPal Key if available, or a bank-issued virtual debit card) to your PayPal wallet and pay only through the official PayPal checkout. Merchants see only a PayPal token, not your card details, and you’re covered by PayPal’s fraud protection, at least for what they say. Enable 2FA, use biometric phone lock, and avoid entering card details directly on merchant sites to minimize risk.",
          "score": 1,
          "created_utc": "2026-01-22 18:35:48",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}