{
  "metadata": {
    "last_updated": "2026-01-06 02:36:08",
    "time_filter": "week",
    "subreddit": "CyberSecurityAdvice",
    "total_items": 19,
    "total_comments": 118,
    "file_size_bytes": 151456
  },
  "items": [
    {
      "id": "1pzmwo0",
      "title": "Thinking about Joining the Air Force or Space Force for Cyber Security, which one would be better?",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1pzmwo0/thinking_about_joining_the_air_force_or_space/",
      "author": "Street_Dimension4716",
      "created_utc": "2025-12-30 16:43:38",
      "score": 40,
      "num_comments": 45,
      "upvote_ratio": 0.93,
      "text": "So I currently work as a Level 1 SOC Analyst, I have been in IT for a little over 4 years now, and this is my first Cyber Security position and i’ve been here for about 6 months.\n\nI have an associates and bachelors in Cyber Secuirty, and currently have 1 year left of my Masters program in Cybersecurity and Information Assurance.\n\nMy Certs: ISC2 CC, CompTIA CySA+, CompTIA PenTest+\n\nI am 25 and in pretty good shape.\n\nMy main question is, for a good Job in the military for Cyber Security, which branch would be better and why? The Air Force or Space Force?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1pzmwo0/thinking_about_joining_the_air_force_or_space/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "nwrrycg",
          "author": "syisc",
          "text": "I would say the Air Force. Air Force probably has a more established cyber security mission. The space force is rather a new branch of the military, but like another redditor said, make sure it’s in your contract before you sign anything.",
          "score": 13,
          "created_utc": "2025-12-30 18:15:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwvrjbh",
              "author": "two_three_five_eigth",
              "text": "Second Air Force.  Space Force is still a big unknown as to what your career options are.  Sign up for 4 years and get your college paid for when you get out.",
              "score": 2,
              "created_utc": "2025-12-31 08:07:18",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nx8mink",
              "author": "tnallen128",
              "text": "Cyber capability is still new for the military overall. Even if he did go into the Air Force, he’ll still be coming into a community that’s still being shaped by mission requirements, roles, etc. \n\nYou should go and talk to an Officer Recruiter for both if not all branches of the military and see what your options are towards roles and responsibilities. \n\nYou could even possibly work for a government agency with the certs you already possess.",
              "score": 1,
              "created_utc": "2026-01-02 11:46:14",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nwrd0a2",
          "author": "Neo_XT",
          "text": "It’s crazy so many people are considering joining the military because the economy is so wacky.",
          "score": 11,
          "created_utc": "2025-12-30 17:06:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwvhu1m",
              "author": "Vegetable-Yam6581",
              "text": "That’s on purpose… economy tanked so more will join for the coming conflicts.",
              "score": 6,
              "created_utc": "2025-12-31 06:40:16",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nwu5jgi",
              "author": "Raider_Nation_99",
              "text": "I truly don’t get how folks afford stuff without joining. I did 5 years Air Force and literally don’t know how people buy a house or afford college without the military it’s insane.",
              "score": 3,
              "created_utc": "2025-12-31 01:24:46",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nx36s36",
              "author": "darkthought",
              "text": "Well, it's one of the few places we don't have to compete with underpaid H1Bs",
              "score": 1,
              "created_utc": "2026-01-01 15:12:05",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nws7ywd",
          "author": "Flat-Address5164",
          "text": "The Space Marines. Wait until 40k.",
          "score": 6,
          "created_utc": "2025-12-30 19:30:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nww8vvw",
          "author": "Aware-Platypus-2559",
          "text": "The biggest leverage you get from this is the clearance so make sure you get the specific cyber job code guaranteed in writing before you sign anything. I have seen plenty of guys with masters degrees stuck in low level support loops because they lack the access that a TS/SCI provides. Space Force seems like the better play if you want to stay purely technical and avoid some of the generic field stuff but just be careful you do not get sold on open availability. If they slot you into a general IT role instead of cyber defense you are basically pausing your career for four years.",
          "score": 5,
          "created_utc": "2025-12-31 10:51:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx5cyeo",
              "author": "TipUnable638",
              "text": "Clearance is a big help but with the current landscape of cuts plenty of people I know with a masters and TS/SCI cannot find a job currently due to how competitive the market is due to layoffs and restructuring from DOGE. It’s still better than without one though IMO",
              "score": 1,
              "created_utc": "2026-01-01 21:56:39",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nwsgn2k",
          "author": "FlyingPenguinDude",
          "text": "If you want a guaranteed cyber job in the AF, you’ll need to look into the guard. 1B4 and not 1D7.",
          "score": 3,
          "created_utc": "2025-12-30 20:11:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwry1tv",
          "author": "AcidFloydian",
          "text": "Just keep in mind it's not as simple as telling them that you want to work in cyber, and they may tell you everything you want to hear to get you to enlist, then throw you into a totally different job that you don't want. Has happened to some people I know with various branches.",
          "score": 2,
          "created_utc": "2025-12-30 18:43:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwvqj3r",
          "author": "402SkillNotFound",
          "text": "It won’t matter, you’ll do whatever they need which will probably be nothing you want",
          "score": 2,
          "created_utc": "2025-12-31 07:57:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwwmcy6",
          "author": "Forsaken_Tourist401",
          "text": "What happens if you don’t get it offered to you? Or, you come into the mil and your first job is working as a Help Desk Tech?",
          "score": 2,
          "created_utc": "2025-12-31 12:45:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwwmljf",
              "author": "Street_Dimension4716",
              "text": "This post is coming from someone who is not very educated on the opportunities/options that come with Joining either of those Military Branches! So I would certainly take things like this into consideration before signing any contracts!",
              "score": 1,
              "created_utc": "2025-12-31 12:47:03",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwwujsj",
                  "author": "Forsaken_Tourist401",
                  "text": "I spent 29 years in the USAF, enlisted, officer, active, a little bit in the reserves and a Cadet. One thing you need to understand as you evaluate a career, the needs of the military come first. If an aspiring Airman’s wants align to the needs of the military, then happy all day. But if they don’t, you will be disappointed. \nI wanted to be a Public Affairs Officer; my degrees were in Poly Sci and Int’l Relations…and guess what, I became a cyber officer. Probably happened because I was a comm-electronics tech in the 90s, but nevertheless, that’s what the USAF wanted from me. \n\nSo, set your expectations accordingly. Just because you have academic experience doesn’t mean you’re guaranteed the career field you want. Talk to a recruiter and understand whatever is offered carefully before you sign paperwork.\n\nSavvy? Aim High",
                  "score": 2,
                  "created_utc": "2025-12-31 13:40:09",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nx0bnxi",
          "author": "AlternativeRound8753",
          "text": "Join the air national guard, go into an intel wing, get a TS and double your income",
          "score": 2,
          "created_utc": "2026-01-01 00:58:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx36oj4",
          "author": "darkthought",
          "text": "I strongly suggest getting Net+ minimum. You need to know the inner workings of networking and networking protocols to be effective in Cybersecurity",
          "score": 2,
          "created_utc": "2026-01-01 15:11:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwrogb8",
          "author": "TheOGCyber",
          "text": "I'd avoid joining the military until after the next presidential election.",
          "score": 5,
          "created_utc": "2025-12-30 17:59:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwrznzp",
              "author": "jotin_",
              "text": "Crazy bad advice. This is the time to join. Service members like myself have so much BS off our plates it’s amazing. Checks are coming in, morale is high, schools are being funded. Now is the time!",
              "score": 3,
              "created_utc": "2025-12-30 18:50:53",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nxc76f4",
                  "author": "WordTimely8559",
                  "text": "What made morale go higher?",
                  "score": 1,
                  "created_utc": "2026-01-02 22:56:13",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nwv7cvq",
                  "author": "justafork09",
                  "text": "You sound stupid. Very little changes for normal servicemen.",
                  "score": 0,
                  "created_utc": "2025-12-31 05:18:48",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nwspe8i",
              "author": "jotin_",
              "text": "?? Did you go on a rant and then delete the comment?",
              "score": 0,
              "created_utc": "2025-12-30 20:53:54",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nwtm6e8",
                  "author": "TheOGCyber",
                  "text": "I didn't delete anything.",
                  "score": 0,
                  "created_utc": "2025-12-30 23:37:08",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwr9ir6",
          "author": "SirAlexMann",
          "text": "I think that’s going to be down to your personal preference. Since you’ll likely learn a lot about the branch you go into, you’d need to think if you prefer to learn about the air force or space force. Both will have adequate cyber security opportunities I’m sure. \n\n(I’m not from the U.S just to clarify, didn’t know space force was a thing)",
          "score": 1,
          "created_utc": "2025-12-30 16:49:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwrv70d",
          "author": "Spiritual_Phrase6935",
          "text": "Honestly, you should explore whether you’d even be able to get a slot first. It’s extremely competitive, and everyone has been wanting to go cyber for the last few years. You need to first qualify for military service, then qualify for cyber, then qualify for a Top Secret clearance, then need to get approved/selected/slotted.",
          "score": 1,
          "created_utc": "2025-12-30 18:30:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nws5qrn",
          "author": "sleepingsnow99",
          "text": "Air force if you want some stability and comfort. Space force for the same thing but get dunked for being star trek.",
          "score": 1,
          "created_utc": "2025-12-30 19:19:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nws6rhb",
          "author": "Scar3cr0w_",
          "text": "Lots of these “cyber” careers are multi arm. The airforce is more well established and I expect you will have more chance getting the job you want with them. Space force might put you in some other role since it’s probably still growing. \n\nI’m from the UK… but I presume you are talking about the US.",
          "score": 1,
          "created_utc": "2025-12-30 19:24:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwsmgrq",
          "author": "redtollman",
          "text": "Check with the Navy also. With your background you should look into commissioning. \n\nSearch for direct commission for cyber \nArmy: https://www.arcyber.army.mil/Resources/Fact-Sheets/Article/2060387/army-cyber-direct-commissioning-program/#:~:text=What%20is%20the%20Cyber%20Direct,an%20application%20to%20be%20considered?",
          "score": 1,
          "created_utc": "2025-12-30 20:39:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwu5das",
          "author": "Raider_Nation_99",
          "text": "I was in the Air Force as a Help Desk tech and the base I was stationed at turned to Space Force so I have some experience with both. If you want less chance of deployment and don’t mind being stationed in FL, CO, or CA (those are where the main Space Force bases are so chances are high for one of those) then Space Force ain’t a bad way.\n\nIf you want something that has been established for a lot longer then the Air Force.\n\nThat said, it’s not guaranteed you get a cyber job with either unless you go guard. Cyber is not needing a lot of people in the military as everyone and their momma wants to do it. Your recruiter might not even let you put only cyber jobs on your list it all depends. \n\nI say talk to a recruiter and go from there.",
          "score": 1,
          "created_utc": "2025-12-31 01:23:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwvxg2j",
          "author": "HonkyKong67",
          "text": "NSA",
          "score": 1,
          "created_utc": "2025-12-31 09:03:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwvyrgb",
          "author": "Horror_Main4516",
          "text": "Both are good, check the jobs!",
          "score": 1,
          "created_utc": "2025-12-31 09:15:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nww0fwl",
          "author": "Incid3nt",
          "text": "Believe it or not I've heard the space force cyber roles seem like they may be less structured but given way more time to learn and take in the material.  This all may depend on the job, space force also seems less likely to deploy anywhere crazy (cept Tampa, FL lol) and probably has more opportunities to promote.  If I had to do it, I would do a cyber specific role with the space force.\n\nI work cybersecurity and did a technical role in the military and know a lot of others from various branches that did the same.  My consensus is that a lot of US military technical training usually sucks unless they have a purchased program from some vendor like GIAC, otherwise it can be a crapshoot where they're forced to complete certifications/training at a set pace really fast.  If you're a go-getter and self study, you can make up that gap, but the general intention for almost all roles, even those with high asvab is to specialize them and dumb the job down as much as possible so that the operational aspect of it is easier.\n\nThis leads to things like IT admins and helpdesk people that just reset AD creds all day long, but dont really know what AD is or the inner workings, cyber specialists that'll look at a specific vendor interface and escalates all medium level alerts.  The more technical deep dives almost always go to a civilian contractor.  There are definitely the handful that know what they are doing but aren't really allowed to deep dive either, you'll have technicians who could change out a part on something to get it operational, but the military doesn't wanna chance those guys and would usually just opt to replace a whole board or component via purchase something from Lockheed at ten grand instead when it could have been less than a dollar to fix sometimes. (Big with capacitors and stuff on boards on the elec tech side)\n\nYou also have a base already so you'd do well there compared to those who come in fresh and think they know what they are doing.",
          "score": 1,
          "created_utc": "2025-12-31 09:32:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nww2ru9",
          "author": "drc922",
          "text": "The first question should be what you want to get out of the military. Skills, stability, free college, overseas experience, a clearance, etc?\n\nSecond, can you achieve those things without joining the military (as a DoD contractor for example), or through options like the Guard/Reserves?\n\nThird, if you really want to join as regular active duty, spend a few weeks lurking in their respective subs. See what people complain about, what they celebrate, what their daily lives look like. This is a big decision so don’t slack on the research and certainly don’t base it on anything a recruiter tells you.",
          "score": 1,
          "created_utc": "2025-12-31 09:54:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nww547e",
          "author": "Boring_Astronaut8509",
          "text": "Given your background, you're honestly in a great position for either branch, but there are some meaningful differences worth considering.\n\nSpace Force is doing something pretty interesting with their cyber career path right now. They're shifting away from the traditional time-in-grade promotion model toward demonstrated competency levels (basic, senior, master).   \nWhat this means practically is that your existing certs and master's degree could potentially accelerate your progression more than in the Air Force's more traditional structure. They're also integrated their cyber squadrons directly with their Space Deltas, so you'd be doing mission defense work that's immediately tied to space operations rather than broader Air Force missions.\n\nThe catch? Space Force only has around 4,900 enlisted personnel total right now. That's tiny.   \nSo while you might face less competition and get more specialized experience, you also have fewer bases, fewer assignment options, and the career field is still being built out.   \nSome people love being part of something this new and having that kind of impact on how things develop. Others prefer more established structure.\n\nAir Force cyber is more mature and has way more positions and locations. They also have the Cyber Direct Commissioning Program that could actually be relevant for you – it lets experienced cyber professionals come in as officers with constructive service credit based on your education and certs.   \nWith your credentials, you might enter as a Lieutenant or higher rather than starting from scratch. That's a pretty significant advantage if you're 25 and want to fast-track your military career alongside your civilian cyber experience.\n\nHonestly, I'd reach out to recruiters from both branches and specifically ask about the officer route given your master's degree and certs.   \nYour profile seems better suited for commissioning than enlisting, and the conversation might look totally different.",
          "score": 1,
          "created_utc": "2025-12-31 10:16:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwx29ex",
          "author": "Due_Goose_9492",
          "text": "Can u pls guide ,how u got soc l1 job?",
          "score": 1,
          "created_utc": "2025-12-31 14:25:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwz9iwm",
          "author": "Successful-Date-2260",
          "text": "The Marine Corps is the best",
          "score": 1,
          "created_utc": "2025-12-31 21:14:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwzgik2",
          "author": "Conscious-Focus-6323",
          "text": "People will say that Air Force cyber is more established, and that is true, but that also means that there are less opportunities. With Space Force being so new and so small, you can get alot of amazing opportunities (certifications, training, TDYs etc.) that would just not happen in the Air Force.\n\n\nIf you only want to do cyber, I would lean more towards the Space Force. Theres only 3 potential jobs (Cyber, Intel, Space Operator) vs in the Air Force where theres so many different AFSCs where in the worst case scenario theres a chance you could be stuck doing security forces or maintainer work. Air Force also owns traditional IT jobs too, so you might get a helpdesk or networking role potentially, which you probably wouldn't want to do given you already have SOC analyst experience.\n\n\nUltimately theres pros and cons to both. I would say if you want to join something thats already extremely established with clear paths for progression the Air Force is for you. On the other hand, if you want to join something early on, be given alot of responsibility from earlier in your career to innovate and shape how things are done, and are okay with a greater degree of self autonomy, the Space Force is for you.\n\n\nEither way both are good options. Whichever branch you decide on, if youre qualified for sign-on bonuses due to your certifications make sure thats explicitly stated in your final contract before you sign it.\n\n\nFeel free to reach out if you have any questions, I was prior Air Force before I transferred over to the Space Force so I have experience on both sides.",
          "score": 1,
          "created_utc": "2025-12-31 21:52:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxog3ad",
              "author": "Turbulent-Job6031",
              "text": "Can I dm you?  I have some questions relating to both branches.",
              "score": 1,
              "created_utc": "2026-01-04 19:28:40",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nxoh6c6",
                  "author": "Conscious-Focus-6323",
                  "text": "feel free.",
                  "score": 1,
                  "created_utc": "2026-01-04 19:33:25",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwzr4s1",
          "author": "NewEnglandG",
          "text": "Air Force",
          "score": 1,
          "created_utc": "2025-12-31 22:52:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx1iasz",
          "author": "100HB",
          "text": "For what it is worth, old military veterans that play a role in hiring at some places, are still befuddled that Space Force is actually a thing. \n\nOther than it being an ego project for POTUS it is not obvious why it exists. And the fact that they just stole the logo from Star Trek is not helping to convince us old folks that they are a serious organization. ",
          "score": 1,
          "created_utc": "2026-01-01 06:02:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxf6bcl",
          "author": "InfinityTheEternal",
          "text": "Ive been in cybersecurity for over 20 years and started in the Navy as a CTN. I think its called something else now but maybe look into that as well.",
          "score": 1,
          "created_utc": "2026-01-03 11:14:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwrew9e",
          "author": "Rwdscz",
          "text": "So here’s the thing. Unless you get in a “contract” with your recruiter that you will be going into that AFSC (job code) there is no guarantee at all. Ever. That promise for the job is contingent on your ASVAB score. If you don’t meet the requirements, you’re going where they put you. \n\nIf you still want to go in and don’t qualify for those jobs you’re hoping for, it turns into a wish list. I went in what’s called open electrical. I didn’t like the job choices and I distinctly remember turning down the job I ultimately got in the end. Turns out it was a cool ass job. Where you get stationed is even a wish list. \n\nSo make sure you talk to your recruiter. Sometimes they lie too. \n\nGood luck.",
          "score": 0,
          "created_utc": "2025-12-30 17:15:09",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1q0b2ws",
      "title": "Complete beginner.",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1q0b2ws/complete_beginner/",
      "author": "easybandz_",
      "created_utc": "2025-12-31 11:40:23",
      "score": 35,
      "num_comments": 25,
      "upvote_ratio": 0.92,
      "text": "I’m 21 & in community college & recently found an interest in cyber & learning more about IT and becoming more tech savvy. Is this something anybody can learn? Is 21 a late start? I want to become godly at this",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1q0b2ws/complete_beginner/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "nwwufne",
          "author": "Impossible_Sea_4920",
          "text": "21 is not late at all; You're actually early. Yeah anyone can learn this, just takes time and consistent practice.\n\nStart with basic IT stuff first - how networks work, Windows/Linux basics. Professor Messer on YouTube is free and covers this. Get CompTIA A+ or Network+ knowledge, then Security+ which is the baseline most jobs want.\n\nFor hands-on practice, CyberDefenders has tons of labs (log analysis, incident response, blue team stuff). TryHackMe and HackTheBox are good too. You can do this while studying for certs or even start with labs first, whatever clicks for you.\n\nIf you want a practical cert, CCDL1 is solid for entry-level blue team work. BTL1 is another option. These are hands-on exams that test actual skills.\n\n\"Godly\" takes years. Getting your first security job though? 1-2 years if you're consistent.",
          "score": 12,
          "created_utc": "2025-12-31 13:39:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx20its",
              "author": "Familiar_Pop7414",
              "text": "Hey bro how are you? Can you plz explain me If you has free time 😅 I am beginner so I see there is a lot of people use only tool you know I am confused someone tell me deeply learn operating system if you don’t know where is vernerability in the system while other said Networking It is important it is a road of traffic And other said no start with Comptia security + I mean what the hell And cybersecurity has some domains I mean Pen-test , SOC analysts, Network engineer Red team , Blue team I mean where I can start and today is Ai so I think SOCai analytics plz if you know deeply about this guide me",
              "score": 1,
              "created_utc": "2026-01-01 09:04:42",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nxh7c8x",
              "author": "RogueCanadia",
              "text": "Is 35 with a business admin degree and no IT experience too late? \n\nI find myself stuck and I hate finance.",
              "score": 1,
              "created_utc": "2026-01-03 18:05:47",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nwwf8qd",
          "author": "helpmeimnotoklol",
          "text": "Yes it is something anybody can learn. No it is not too late to start, although the job market right now is not ideal. \n\nMake sure to learn the foundations and build a strong foundation before getting into the more tech savvy stuff",
          "score": 6,
          "created_utc": "2025-12-31 11:48:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwwg502",
              "author": "easybandz_",
              "text": "Yeah I was honestly wondering if I’m crazy for thinking about pursuing this considering the direction tech is in right now.",
              "score": 1,
              "created_utc": "2025-12-31 11:56:14",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nx0uv85",
                  "author": "CoyoteDisastrous",
                  "text": "I’m in the middle of studying for Sec+ as part of a career change right now. I have no idea what to think about the future of the job market in this field. Someone I know in industry said pretty emphatically that supply isn’t meeting demand for applicants kinda like the electrical trade. I trust this person’s insight, but I keep seeing a lot on Reddit saying otherwise.",
                  "score": 1,
                  "created_utc": "2026-01-01 03:04:50",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwwflt9",
          "author": "Born_Coffee9869",
          "text": "I was exactly like you. I didn’t start early, I wasn’t some “tech genius,” and I was just curious about cybersecurity and IT. I tried many platforms like TryHackMe and Hack The Box (they’re great), but honestly, the one that really clicked for me, especially as a beginner was Hackviser.\n\nWhat I liked about Hackviser is that it’s beginner-friendly, structured, and doesn’t make you feel lost or stupid for not knowing things yet. It helped me build confidence step by step, instead of throwing me into the deep end.\n\nAnd no  21 is NOT late at all. In cybersecurity, mindset matters more than age. If you’re curious, consistent, and willing to learn, you can absolutely become very good at this. Some of the best people in cyber started in their 20s  or later.",
          "score": 5,
          "created_utc": "2025-12-31 11:51:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwwqdkg",
              "author": "PleasureDomIL",
              "text": "This is good info brother thank you",
              "score": 1,
              "created_utc": "2025-12-31 13:13:26",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nwwur9m",
              "author": "easybandz_",
              "text": "Thank you !",
              "score": 1,
              "created_utc": "2025-12-31 13:41:26",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwxe9y5",
          "author": "TheOGCyber",
          "text": "It amazes me when someone so young asks if they're too late.  There are people starting in tech in their 50s.\n\nCyber is a mid-career field after several years of general technical work experience.  Study for your CompTIA A+ certification and get a networking certification like CompTIA Network+ or Cisco's CCNA.  Then get any entry-level tech job you can find.  Learn more.  Grow your experience.  Keep grinding.",
          "score": 4,
          "created_utc": "2025-12-31 15:30:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwxssh6",
          "author": "oldbaybridges",
          "text": "I was much older than you when I started in cybersecurity. It’s possible, but it does take grit, studying, and motivation. Intro topics can be a bit dry and complex, but set some good study habits and don’t burn yourself out trying to get there. Take your time and it will naturally progress. Good luck!",
          "score": 1,
          "created_utc": "2025-12-31 16:42:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwxva1j",
          "author": "Mysterious_Salt395",
          "text": "A little bit older and also developing interest in the field, maybe we can do this together",
          "score": 1,
          "created_utc": "2025-12-31 16:54:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwy030r",
          "author": "Remote_Opinion3873",
          "text": "21 It's not late, I'v started pursuing a CS Bachelor's at my 26 in the UK. I am sure it will help to pursue a Bachelor after graduating from community college",
          "score": 1,
          "created_utc": "2025-12-31 17:18:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwypcd9",
          "author": "Wallet_TG",
          "text": "21 is not even close to late, most people switch into tech way older than that. Start with TryHackMe or Google's IT Support cert and just build stuff - you'll be fine if you actually stick with it.",
          "score": 1,
          "created_utc": "2025-12-31 19:25:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx08az6",
          "author": "DebFan2023",
          "text": "21 is super young. You don't really need a crazy amount of time, it's mainly dedication. If you enjoy it and take on projects for fun you're going to advance a lot faster than someone who's just trying to learn enough for a job.\n\nTo start off, watch Professor Messer's videos on youtube for the A+ certification, both 1201 and 1202 (it's a 2 part cert). There's a lot more to computers but the A+ certification is an excellent way to pick up on the basics of pretty much everything",
          "score": 1,
          "created_utc": "2026-01-01 00:37:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx8k54m",
          "author": "xthrorawayyx",
          "text": "-adblocker (uBO or brave shields) as they can block harmful links and download\n\n-a privacy respecting browser as the less data thats get leaked means less data could be fetched\n\n-either debloat windows or use linux (linux mint or zorin os is good for beginners) as this also means less data leaks. I’ve had no issues when it comes to using Chris Titus’s windows tool to debloat windows\n\n-you can use search engine to something like Brave search or duckduckgo. You can also “make” your search engine by having it run on your computer, called searXNG though thats more advanced\n\n-if a website ask “would you like to accept cookies” click no or deny all ",
          "score": 1,
          "created_utc": "2026-01-02 11:25:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxe9fhh",
          "author": "Unlikely-Luck-5391",
          "text": "Most people in cyber/IT don’t start at 18 knowing this stuff. A lot of them stumble into it in their mid-20s or later after trying other things. You already being curious and in community college is actually a solid spot to be in.\n\nCyber isn’t magic talent, it’s layers:\n\n* basic IT (how computers, networks, OS actually work)\n* then security concepts on top\n* then practice, breaking things, fixing things, repeating\n\nIf you try to jump straight to “cyber” without IT basics, it feels overwhelming. Once you understand networking, Linux/Windows, and how systems talk to each other, security clicks way faster.\n\nAlso “godly” comes from time, not speed. Labs, messing things up, reading docs, asking dumb questions, doing small projects. Everyone who’s good now was confused at the start.\n\nIf you stick with it for a couple years and stay consistent, you’ll look back and laugh at how intimidating it felt. 21 is early, not late. Just don’t rush the foundations.",
          "score": 1,
          "created_utc": "2026-01-03 06:33:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxkakju",
          "author": "Seven_Figure_Closer",
          "text": "It's not too late. I'm 34, in sales, and just pivoted to cyber security sales last year. The question is, what is your end goal? Are you trying to sell it, program, etc...?",
          "score": 1,
          "created_utc": "2026-01-04 03:33:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxrv68k",
          "author": "Unlikely-Luck-5391",
          "text": "21 is definitely not a late start at all. Honestly most people don’t even *find* cyber or IT until mid-20s or later. You’re actually early.\n\nYes, anyone can learn this stuff, but it’s not about being “naturally smart” or whatever. It’s more about curiosity + consistency. Cyber especially rewards people who like breaking things, fixing them, and asking “why did that happen”.\n\nIf you’re a complete beginner, that’s fine. Start with basic IT first:\n\n* how computers work\n* networking basics\n* operating systems (Windows + Linux)\n* a bit of scripting later on\n\nCyber builds on top of IT, so don’t rush straight into hacking tools without understanding fundamentals. That’s where a lot of people get stuck.\n\nAlso don’t aim to be “godly” fast. That mindset burns people out. Aim to be a little better every week. Labs, messing things up, reading docs, failing a lot — that’s normal.\n\nCommunity college is a solid place to start too. Pair it with hands-on practice and you’ll be way ahead of most people your age.\n\nYou’re good. Just stay patient and keep showing up.",
          "score": 1,
          "created_utc": "2026-01-05 06:14:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwzydxn",
          "author": "Background-Slip8205",
          "text": "Colleges are handing out cyber degrees like cotton candy, and it's a late career position, not entry level.  Do yourself a huge favor and get a more generic, well rounded degree in IT, and focus on something like Linux or cloud.\n\nAfter 5+ years experience as a sysadmin, that's when you want to start taking classes and some certs in security.  Especially if you can get your work to pay for it.\n\nUnfortunately though, you said you're 21, and as everyone knows, colleges won't accept anyone over 19 years old, and humans are incapable of learning anything past 20.",
          "score": 1,
          "created_utc": "2025-12-31 23:37:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwzzec6",
              "author": "easybandz_",
              "text": "Your crazy😂",
              "score": 2,
              "created_utc": "2025-12-31 23:43:07",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "nxl121t",
              "author": "[deleted]",
              "text": "[removed]",
              "score": 1,
              "created_utc": "2026-01-04 06:33:41",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nxl1238",
                  "author": "AutoModerator",
                  "text": "Hello,\n\nYour comment was automatically removed because your Reddit account has significantly negative comment karma. We use this threshold to reduce disruptive behavior and maintain quality discussion in r/cybersecurity.\n\nIf you believe this was a mistake or would like to appeal, feel free to message the mod team.\n\nThank you.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CyberSecurityAdvice) if you have any questions or concerns.*",
                  "score": 1,
                  "created_utc": "2026-01-04 06:33:41",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1q2vgmf",
      "title": "Housemate spying on WiFi/me somehow - help needed",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1q2vgmf/housemate_spying_on_wifime_somehow_help_needed/",
      "author": "No-Evidence-3299",
      "created_utc": "2026-01-03 14:07:23",
      "score": 31,
      "num_comments": 51,
      "upvote_ratio": 0.96,
      "text": "Hi all,\n\nI’m looking for some perspective because I’m feeling uneasy and want to sanity check things rather than jump to conclusions.\n\nI live in a shared house where one housemate is the WiFi admin. Over time she’s made comments that feel oddly specific to things I’ve done or discussed privately online, including very specific topics I’ve used ChatGPT for — which I thought was encrypted?\n\nThe person hasn’t had access to my devices and even if they did they’d need my passwords for it all so I doubt this is the case here. \n\nThere’s no hard proof of anything: no devices found, no obvious account breaches. It’s more a pattern that’s made me uncomfortable. Since I removed her from my social media (mainly because I felt I might be triggering her — she seems quite insecure and unhappy). I don’t think she is a good person and I sense a lot of malicious and jealous energy from her.\n\nI’m trying to stay balanced here. I don’t think she’s very well, and this could just be social dynamics, inference, or coincidence — but it’s started to affect how safe and relaxed I feel at home.\n\nMy questions are:\n\n\t•\tWhat can a WiFi admin realistically see in a shared house?\n\n\t•\tIs there any way private message or app content could be accessed via WiFi alone?\n\n\t•\tAt what point would concern be reasonable vs overthinking?\n\nI was under the impression WiFi can be monitored but just the websites visited rather than the searches.. I feel like she has access to what we are looking up online specifically. \n\nI’m changing passwords and tightening security anyway, but I’d really appreciate calm, practical input from people who understand this stuff.\n\nThanks!",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1q2vgmf/housemate_spying_on_wifime_somehow_help_needed/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "nxgic8g",
          "author": "StarlingAlder",
          "text": "While you are on wifi at home:\n\n-  Go to Google and look up \"buying new year appreciation gifts for housemates how to know what they like\"\n- Open a ChatGPT chat, ask it, \"hey it's new year and one of my resolution is to be better at showing appreciation of others. I'm thinking of buying nice gifts for my housemates but don't know what they like and how to pick which colors even what do I do\"\n\nThen see how quickly your housemate drops hints of what she likes and mentions her favorite color. And how suddenly nicer she might be around you.",
          "score": 46,
          "created_utc": "2026-01-03 16:09:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxgyo41",
              "author": "No-Evidence-3299",
              "text": "This is so funny! I thought similar but we’re not really on speaking terms due to her crap behaviour so I think she’d know. I have thought about planting loads of fake info about me to see her reaction and comments 😂",
              "score": 13,
              "created_utc": "2026-01-03 17:26:25",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nxh03jl",
                  "author": "StarlingAlder",
                  "text": "OMG now I wanna know what absolutely ridiculous \"facts\" you'd be planting 😈",
                  "score": 5,
                  "created_utc": "2026-01-03 17:33:07",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nxfwfma",
          "author": "Mesapholis",
          "text": "is she versed in tech?\n\nbecause even as admin, with advanced permissions on the router, she should reasonably only be able to see what devices are active/connected, the data usage, which domains are contacted - but not your requests, as I understand the requests are HTTPS/TLS encrypted and most websites use certificates etc\n\nwhat would be possible is they set up some root access to your device, somehow got to your pw - set up something to actively monitor your activity (some software for Man in the Middle attack to view your requests) but that would require more experience than your average snoopy housemate\n\nI'd reset passwords, run scans for possible malware, physically keep them away from your devices",
          "score": 29,
          "created_utc": "2026-01-03 14:16:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxfwnf8",
              "author": "No-Evidence-3299",
              "text": "She works in tech.. but not in a technical role and I wouldn’t call her overly technical. However she’s home a lot and seems to have an awful lot of downtime so she could easily have taught herself or learned some tips from her work.",
              "score": 12,
              "created_utc": "2026-01-03 14:17:42",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nxgmtgc",
                  "author": "Electronic_Field4313",
                  "text": "I have similar thoughts with u/Mesapholis. Wi-Fi alone is insufficient to observe a web application's content, searches ,messages or ChatGPT prompts. The router sees IPs, Domains, Timing/volume but not POST bodies.  \n  \nIn order to see the content, the attacker would need to terminate TLS, which requires a trusted CA on the device or control of your host machine, which both require device-level tampering (e.g., installing an EDR agent on your machine).   \n  \nDoes your roommate have access to this device that you're using?",
                  "score": 12,
                  "created_utc": "2026-01-03 16:31:02",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nxfxjv0",
                  "author": "Mesapholis",
                  "text": "creepy behaviour definitely...\n\nhave you spoken to your other housemates? has she done/said the same to them",
                  "score": 3,
                  "created_utc": "2026-01-03 14:22:50",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nxge2gp",
          "author": "PaleoSpeedwagon",
          "text": "A few thoughts here:\n- You could use your phone as a hotspot for a couple of weeks, maybe? And see if that changes your conversations. Just be mindful that whatever streaming you do will eat up your data minutes like whoa.\n- You could throw her a misdirect: search for something that you KNOW you have never spoken to anyone about - and never would - verbally. A lot of people think aloud without realizing it. Search for, I don't know, borscht recipes or something. How to fix a hole in a sock. The mating habits of the hammerhead shark. If she says something regarding your honeypot search strings, you know she's watching your history somehow.\n- consider using a VPN client. I personally use Nord VPN and aside from an endpoint occasionally needing to be renewed, it's been great.\n\nSorry your home life is stressful, OP. Home should be a place you can retreat to.",
          "score": 7,
          "created_utc": "2026-01-03 15:49:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxgotn9",
              "author": "No-Evidence-3299",
              "text": "I thought about it but I need the data haha! But I have considered honeypot searches. I guess there a way to catch and then out them? This is illegal surely and I’m considering taking it further if I find any proof.",
              "score": 2,
              "created_utc": "2026-01-03 16:40:25",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nxklygr",
                  "author": "Behen_ka_yoda",
                  "text": "Dear OP, just use a vpn on the phone or laptop that will rule out packet sniffing from wireshark (even though i highly doubt she knows how to wireshark, but then there is AI to help with this so not sure), also i hope u haven't got any suspicious pdf files from her. Pdf can be plain RAT(remote access trojan) payload binded to pdf(ill maybe rule this out cause its really costly to buy a good obfuscator to bypass defences that also iphone is really hard to do so). My best bet is all of this is done physically try changing ur beds location or check for hidden camera/mic, change ur passwords she might have stolen ur chatgpt session/cookies somehow or any remote tool like screenconnect or something which got installed to ur laptop using some recent CVE RCE.(just assumptions cause this is also hard). Just take a pin and reset the router lmao, 😆",
                  "score": 3,
                  "created_utc": "2026-01-04 04:43:35",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nxfy3nj",
          "author": "satchelsofCREAM",
          "text": "Depending on what her setup is, she can probably see a lot of what you’re doing. The messaging idk.. it seems like shes just looking at the sites you’re on and connecting the dots.. i would look into getting a separate account that you run",
          "score": 4,
          "created_utc": "2026-01-03 14:25:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxfyajj",
              "author": "No-Evidence-3299",
              "text": "That’s what I think, but even if she saw me using ChatGPT, google etc all fine but she seems to know the content and it’s weird.",
              "score": 2,
              "created_utc": "2026-01-03 14:27:02",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nxgit6e",
          "author": "CreateFlyingStarfish",
          "text": "would end to end encryption of your transmissions help? Sounds like shared wifi in a shared house is like using public wifi in a coffeeshop?\n\nI would not connect my devices to the house wifi until the relationship among users was clearly defined.\n\nFor all my devices, I would manually connect to wifi for each session.",
          "score": 3,
          "created_utc": "2026-01-03 16:11:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxgpaai",
              "author": "No-Evidence-3299",
              "text": "That might help! I’ve looked into a VPN for protection. I think that might be the case as this lunatic is the admin of the WiFi and lived there the longed. \n\nWe were fine at first but over time is disintegrated. She is quite a horrid person. I ended up taking space over time but tried to keep her sweet but she kept acting out so I barely talk to her now.",
              "score": 1,
              "created_utc": "2026-01-03 16:42:36",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nximt9x",
          "author": "Aggravating_Bus2663",
          "text": "From Wifi...nope, i mean i can, but she is not me...but she might deployed some monitoring software on one of your devices, that would be my main suspect (if you are sure she somehow doesnt know your credentials for some accounts, also lookup audit log times when a service is used and you didnt use it at the time etc)...",
          "score": 3,
          "created_utc": "2026-01-03 22:11:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxh5gmb",
          "author": "be4tnut",
          "text": "This seems less likely but there is something called a [WiFi Pineapple](https://www.twingate.com/blog/glossary/wifi-pineapple) which facilitates a Man in the Middle attack to get access to network traffic.\n\nThis is one reason no public WiFi network is considered safe.",
          "score": 3,
          "created_utc": "2026-01-03 17:57:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxi6b7e",
              "author": "No-Evidence-3299",
              "text": "I will look at this!",
              "score": 1,
              "created_utc": "2026-01-03 20:50:47",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nxhm8kp",
          "author": "jmnugent",
          "text": "This is a \"human problem\",. not a \"technology problem\". (IE = you can do all sorts of things to use a VPN or other ways to obfuscate or hide your traffic,. but ultimately if you're using a connection that you don't trust or don't have control over,.. the other person will generally always win (because it always puts you at a disadvantage,.. because you don't know what or how they are doing it) \n\nThere's really no fix for this other than:\n\n* getting your own connection\n\n* moving out to get a place of your own (where you'd have your own independent connection). \n\nIn the short term (if it was me).. I would not be spending much time there. I'd either be doing everything over Cellular,. or I'd be finding other connections (nearby Library or coffee shop WiFi or etc) \n\nIf you want to be absolutely 100% sure someone is not observing you somehow (physically or digitally).. the only realistic solution to that is to completely remove yourself from any situation where they can.",
          "score": 2,
          "created_utc": "2026-01-03 19:13:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxi66ex",
              "author": "No-Evidence-3299",
              "text": "That’s true. I feel like she also wants me out of the house too - so feel like it would be giving her what she wants. But she’s also acting horribly, so it’s hardly a nice place to live anyway.",
              "score": 2,
              "created_utc": "2026-01-03 20:50:08",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nxik9cg",
          "author": "wutangslammer",
          "text": "Not through wifi",
          "score": 2,
          "created_utc": "2026-01-03 21:58:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxjakci",
          "author": "MazurianSailor",
          "text": "My main recommendation would be using a VPN, that would *for certain* hide your traffic. \n\nBut generally, unless your house mate has strong technical skills (and high level of want), it’s not that easy to obtain.",
          "score": 2,
          "created_utc": "2026-01-04 00:14:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxjkgyg",
              "author": "No-Evidence-3299",
              "text": "I got a VPN today, I’m playing about with wireshark and I can see you can find out passwords etc for things. So perhaps that is a lead and she has broke into my GPT or something. I use chat as a search engine a lot these days, ironically thinking it was safer than a web search.",
              "score": 1,
              "created_utc": "2026-01-04 01:07:13",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nxfymds",
          "author": "National-Alarm-1100",
          "text": "Buy your own router",
          "score": 2,
          "created_utc": "2026-01-03 14:28:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxgp34w",
          "author": "Melodic_Editor3467",
          "text": "A Wifi admin? what exactly is this? she assigned this name herself? The only thing I can think of is she's using wireshark to view your internet usage. Anyone can learn wireshark and do this.",
          "score": 2,
          "created_utc": "2026-01-03 16:41:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxgwllk",
              "author": "Niorba",
              "text": "The best test would be for OP to use wireshark themselves and see what comes up while running wireshark and chatGPT at the same time.",
              "score": 2,
              "created_utc": "2026-01-03 17:16:47",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nxgz354",
                  "author": "No-Evidence-3299",
                  "text": "I will try this!",
                  "score": 2,
                  "created_utc": "2026-01-03 17:28:23",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            },
            {
              "id": "nxgwu69",
              "author": "No-Evidence-3299",
              "text": "No as in it’s all in her name and assuming she is the WiFi owner so can make adjustments? Or check the usage? That’s what I’m thinking - something like that. I don’t want to believe it’s possible BUT there’s been too many specific searches that I’ve heard her saying outside of my door (presumably to make me feel scared) I’m not, she’s a dumb a** and she will reap what she sows. \n\nWould wireshark show what everyone on that WiFi is doing? Including searches and encrypted searches via ChatGPT. It’s just really weird.",
              "score": 2,
              "created_utc": "2026-01-03 17:17:54",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nxhl4hv",
                  "author": "jmnugent",
                  "text": "> Would wireshark show what everyone on that WiFi is doing\n\nNot in any detail, no. It would have some generic packet-information but nothing comprehensive. (like looking at a cellular Bill and seeing the FROM and TO phone numbers,.. but that's about it,. you dont' get the content of the calls.",
                  "score": 2,
                  "created_utc": "2026-01-03 19:08:03",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nxjqsyq",
          "author": "cliffway",
          "text": "Get your own internet service.",
          "score": 1,
          "created_utc": "2026-01-04 01:42:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxk4464",
          "author": "Individual-Pirate416",
          "text": "It wouldn’t be hard to see what sites you’re visiting but really hard to see the actual content you’re searching up. If she’s using a DNS service like Nextdns, PiHole, AdGuard, etc, she could see what sites you visit. But not the actual searches you’re doing. Are you on iPhone or Android?\n\nYou could try using a VPN service like ProtonVPN, Mullvad, etc. That does encrypt your internet traffic on top of the built in encryption(https). If she still drops hints after that of your searches, then she’s definitely more technical than you think. \n\nWorst case scenario, call her out on it lol. Also make sure to change the passcodes on your devices. Unlikely but she could be somehow getting into your phone physically and looking at your browser history that way",
          "score": 1,
          "created_utc": "2026-01-04 02:56:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxlj7vq",
          "author": "iron81",
          "text": "Personally I would search for any unusual software, if you computer has been unlocked and she gained access she could have installed some software. \n\nIf she uses Wireshark she could see the first part of what you type, however to see conversations she has installed something on the device\n\nWhat are you using a pc or laptop?",
          "score": 1,
          "created_utc": "2026-01-04 09:13:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxrirnv",
          "author": "hallowleg088",
          "text": "Do you know where the main router is?\n\nIs there a home mesh network? Like TP-Link Deco. \n\nIf it’s just the main router, is there any devices connected to it? This may sound weird but disconnect it and see if you still have internet. It’s possible she connected you to a pineapple network where she can steal info.",
          "score": 1,
          "created_utc": "2026-01-05 04:46:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxtgw4r",
              "author": "No-Evidence-3299",
              "text": "Thanks for this! I think there is just one but I will test. I’m also going to try and log in to the router to see what she has access too (presuming she hasn’t changed these passwords).",
              "score": 1,
              "created_utc": "2026-01-05 14:03:12",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nxhnsx0",
          "author": "ButterscotchBandiit",
          "text": "If your network has SSL inspection, then anything prompted and received in ChatGPT will be in logs.",
          "score": 0,
          "created_utc": "2026-01-03 19:20:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxi5uba",
              "author": "No-Evidence-3299",
              "text": "Would there be a way for me to see that my network has SSL inspection as someone who is only using the WiFi? I don’t have access to the account she has. Because I do think she is somehow seeing the prompts or material. It’s too close. Also this is really concerning because I had assumed even if you are on a WiFi some things are encrypted fully!",
              "score": 1,
              "created_utc": "2026-01-03 20:48:28",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nxijwlu",
                  "author": "jmnugent",
                  "text": "SSL inspection is pretty easy to check for:\n\n> \"You can determine if a Wi-Fi connection has SSL (or more accurately, TLS/HTTPS) inspection by examining the digital certificates of the websites you visit. If your connection is being inspected, a custom root certificate, often issued by the organization managing the network, will be used to intercept and re-encrypt traffic, rather than the original certificate from a well-known public Certificate Authority (CA). \n\nWhatever Browser you're using should have a way to view the Certificate(s) of a website. \n\nIf the Certificate is \"untrusted\" or otherwise unofficial or invalid,. your Browser would have been alerting you to this. (since you didn't mention this ever happening (it would have been unavoidably obvious).. then it's likely not happening.",
                  "score": 1,
                  "created_utc": "2026-01-03 21:57:13",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1pyxbew",
      "title": "Anyone else realize how sketchy browser extensions are?",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1pyxbew/anyone_else_realize_how_sketchy_browser/",
      "author": "artur5092619",
      "created_utc": "2025-12-29 20:33:21",
      "score": 25,
      "num_comments": 16,
      "upvote_ratio": 0.96,
      "text": "Been doing security reviews for our org and holy crap, extensions are a mess. Found employees with 15+ extensions each, half from random devs who haven't updated in 2+ years. \n\nOne extension had full access to passwords and cookies across all sites. Another was mining crypto in background. Most people just click \"allow all permissions\" without reading. Started auditing after finding extensions that could literally keylog everything. Now requiring approval for any new installs. \n\nWhat's your extension management strategy? looking for better approaches here. Thanks All.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1pyxbew/anyone_else_realize_how_sketchy_browser/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "nwly2yr",
          "author": "Massive-Reach-1606",
          "text": "dude I had one that was updating its own malware using the ms url. It was insane to pull it out of edge.",
          "score": 6,
          "created_utc": "2025-12-29 20:43:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwm0bpy",
              "author": "artur5092619",
              "text": "Thats what am talking about, like wtf",
              "score": 1,
              "created_utc": "2025-12-29 20:54:11",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwm0tzm",
                  "author": "Massive-Reach-1606",
                  "text": "it was controlled by another org. I think i got it from an ad blocker I installed once. IT was a pain in the dick to remove. It would try to reinstall itself.",
                  "score": 2,
                  "created_utc": "2025-12-29 20:56:39",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nwmdb7y",
              "author": "Fine-Elk-421",
              "text": "oh shit this stuff is my biggest fear",
              "score": 1,
              "created_utc": "2025-12-29 21:56:54",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nwmvbwu",
          "author": "mfraziertw",
          "text": "They are in my opinion one of the biggest risks. So much data is going out to god only knows who.",
          "score": 5,
          "created_utc": "2025-12-29 23:31:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwnlmi7",
              "author": "Elismom1313",
              "text": "Don’t forget obsidian extensions :)",
              "score": 1,
              "created_utc": "2025-12-30 01:55:57",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nwmltps",
          "author": "BoltActionRifleman",
          "text": "Years ago we searched high and low on a number of PCs in the domain and found out which extensions were actually needed, then whitelisted them using GPO.  This blocks any extensions not on the whitelist.",
          "score": 4,
          "created_utc": "2025-12-29 22:40:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx1yo9s",
              "author": "cloudfox1",
              "text": "This ^",
              "score": 2,
              "created_utc": "2026-01-01 08:44:54",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nwpk6ul",
          "author": "guillermosan",
          "text": "Browsers needs to be managed by a GPO that disallows user extensions installs. Via same GPO you can install the cured extensions that are needed, like and adblocker or whatever.\n\nYour fears are justified. Extension security is terrible, a minefield that is better to simply avoid. Also, extensions change hands over time, what used to be a legit extension can turn into an hostile one at anytime vía an auto update, without user intervention.",
          "score": 3,
          "created_utc": "2025-12-30 10:36:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "nws6eqm",
              "author": "Massive-Reach-1606",
              "text": "Its AI is the new problem of this idea",
              "score": 1,
              "created_utc": "2025-12-30 19:22:36",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nwm7xhz",
          "author": "vonOrleans",
          "text": "Ive seen a post on YouTube the other day where they've been talking about malicious browser extensions.\nThat after years they've been turned to spyware and such. Nobody notices.",
          "score": 2,
          "created_utc": "2025-12-29 21:30:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "nws6a5f",
              "author": "Massive-Reach-1606",
              "text": "the \"bad actors\" are buying legit domains and using them to spread malware",
              "score": 3,
              "created_utc": "2025-12-30 19:22:00",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nwna1xb",
          "author": "nakfil",
          "text": "Create an allowlist in a managed browser. Implement a request system for users to ask for one to be allowlisted and a process to approve / reject",
          "score": 2,
          "created_utc": "2025-12-30 00:51:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwnt5e9",
          "author": "cgoldberg",
          "text": "Yes, they are a huge risk, but the browser vendors have at least tightened things up recently. A few years ago it was the wild west.",
          "score": 2,
          "created_utc": "2025-12-30 02:36:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx5tk42",
          "author": "BamBam-BamBam",
          "text": "Yeah, there are like two extensions that we allow.",
          "score": 1,
          "created_utc": "2026-01-01 23:26:20",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1q129gk",
      "title": "How do you spot identity misuse when the traffic looks normal?",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1q129gk/how_do_you_spot_identity_misuse_when_the_traffic/",
      "author": "vaibhavyadavv",
      "created_utc": "2026-01-01 11:34:51",
      "score": 8,
      "num_comments": 3,
      "upvote_ratio": 0.91,
      "text": "When someone uses stolen credentials everything they do appears legitimate to the system. It makes runtime monitoring basically the only way to spot it but that is way easier said than done. How do you actually approach this in practice without a massive team? Static tools just dont help much here.\n\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1q129gk/how_do_you_spot_identity_misuse_when_the_traffic/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "nx334ym",
          "author": "ProposalFantastic488",
          "text": "Lateral movement is hard to spot early.",
          "score": 2,
          "created_utc": "2026-01-01 14:49:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx34w9j",
          "author": "Bitreous007",
          "text": "Runtime identity risks are explained well here:[Armosec](https://www.armosec.io/)",
          "score": 1,
          "created_utc": "2026-01-01 15:00:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxktxn8",
          "author": "namalleh",
          "text": "if it's a website, it is extremely likely either automated tools or low level requests are being made",
          "score": 1,
          "created_utc": "2026-01-04 05:38:55",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1q4xngu",
      "title": "How can I further improve my personal cyber security?",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1q4xngu/how_can_i_further_improve_my_personal_cyber/",
      "author": "Lopsided_Pride_6165",
      "created_utc": "2026-01-05 20:50:09",
      "score": 8,
      "num_comments": 4,
      "upvote_ratio": 1.0,
      "text": "I have already implemented some cyber security advice like:\n\n\\- Password Manager with different passwords for different accounts.\n\n\\- Long Passwords\n\n\\- 2FA on all accounts with an authenticator instead of email or sms.\n\n\\- VeraCrypt for encryption of drives.\n\n\\- Backups of my Data for redundancy\n\n\\- Having two seperate Systems, one for vulnerable tasks like emails and coding and another one for gaming and banking. \n\n\\- and of course stuff like updating the os.\n\n  \n I want to be sure that I am protected against malware and keyloggers besides \"not downloading\" sketchy stuff. But I cannot figure out what to do on my systems to protect them against malware. \n\nI would also accept recurring Tasks to handle this, or any behavioral advice. \n\nIs it worth it to use containers for different folders on a harddrive as damage control against malware?\n\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1q4xngu/how_can_i_further_improve_my_personal_cyber/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "nxw13j5",
          "author": "JoinDeleteMe",
          "text": "Don't forget social engineering and targeted attacks as an attack vector. Opt out of people search sites (e.g., Spokeo, Whitepages, BeenVerified, and the like). The personal information they make available about you makes spear phishing and pretexting significantly easier.",
          "score": 3,
          "created_utc": "2026-01-05 21:18:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxwfvos",
          "author": "SecTechPlus",
          "text": "DNS filtering with something like NextDNS or AdGuardDNS will allow you to block ads (normal and malicious), block access to privacy bugs (e g. Facebook trackers on many websites), and block access to purely malicious websites (e.g. distributing viruses or malware command and control C2 servers).  This is a very easy additional step with some real world benefits. Many services also provide a free tier which should be plenty for a small home network, and plans going up from that are reasonable.",
          "score": 2,
          "created_utc": "2026-01-05 22:28:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxw1ra9",
          "author": "uniqueness_audio",
          "text": "You have a solid foundation (2FA with an authenticator and VeraCrypt are key), but you're missing the door through which 90% of your daily privacy escapes: fingerprinting and browser trackers. Encrypting your hard drive is useless if every website you visit knows who you are based on your screen resolution, battery level, or installed fonts. To improve your personal cybersecurity right now:\n1. Isolate browsing: Use containers to separate your social life from your finances (I see you already have separate systems, but you can use isolation tools within the same system).\n\n2. Make tracking visible: You need to know who's watching you before you can block them. I've developed a Tracker Scanner that shows you in real time which entities are collecting your data on each URL.\n\n3. Preventive blocking: Implement a shield that not only blocks ads but also stops silent data sharing. Since I'm building tools for this, I have the Scanner and Shield explained in the link in my profile if you want to audit your own browsing. Great job with that setup!",
          "score": 1,
          "created_utc": "2026-01-05 21:21:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxwsy03",
          "author": "eric16lee",
          "text": "Here are the standard recommend I usually give. \n\nHarden your Operational Security (OpSec) practices. Here are some suggestions:\n\n1. Create unique and randomly generated passwords for every site. Never reuse a password. \n2. Enable 2FA for every account. \n3. Keep all software and devices updated and patched. \n4. Never click on links or attachments unless you were expecting them from a trusted source. Example: a guy you talk to on Discord asking you to test the game they are developing is not a trusted source).\n5. Never download cracked/pirated software, games/cheats/mods, torrents or other sketchy stuff.\n6. Never press CTRL C and then open a Run command and press CTRL V because a website claims to need you to prove you are human. \n7.  Limit what you share on social media\n\nFollow these best practices and you will be safe from most attacks.",
          "score": 1,
          "created_utc": "2026-01-05 23:35:08",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pyewac",
      "title": "Cyber Internship Help",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1pyewac/cyber_internship_help/",
      "author": "kosh-11",
      "created_utc": "2025-12-29 06:27:20",
      "score": 7,
      "num_comments": 11,
      "upvote_ratio": 0.82,
      "text": "I was recently offered two internships! One is a Software Dev position while the other is an Information Security position. I would love for some advice on how to go about this. \n\nThe software dev position would start in January of this year, and given that the company likes me and I like them, I would stay with them till I graduate in December. Few things, it’s a smaller company, from what I’ve read it’s outdated and meh code. \n\nThe Information Security position is with a much larger company and would start in my (summer semester) and the internship would run from May - May. A couple tasks I would work on described to me are essentially doing access audits. So why does this person have access to this DB when they don’t ever use it, that type of stuff. \n\nSo, I was looking for some advice on what to do when it comes to this summer. Obviously, I’m going to take the software dev position from January to May, as I think that will look great on the resume. However, do I stay with the software dev or go into the Information Security position? Also, obviously if I HATE the software dev company I’m going to leave without a doubt, but in the most perfect of worlds with both to choose from what do you think. I have always wanted to go into cyber leaning roles and I feel this may be a great stepping stone into that position. I will also note, I have IT experience working for my university.\n\nAny advice would be appreciated. ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1pyewac/cyber_internship_help/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "nwi6j10",
          "author": "sandesh_in_tech",
          "text": "Go InfoSec if cyber is the goal, not just for the work, but for the org access. Security teams in large companies often touch every department. That visibility builds rare context most beginners miss. Access audits may seem basic, but you're learning how trust is structured, and that’s the backbone of all security. Dev work teaches you how systems break; security teaches you why they break quietly. Invest in that lens early.",
          "score": 4,
          "created_utc": "2025-12-29 06:39:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwkihhb",
              "author": "kosh-11",
              "text": "I think so too! I will atleast have the software dev role on the resume, and can continue to work my way into cyber which I think is what I want to do long run.",
              "score": 1,
              "created_utc": "2025-12-29 16:39:00",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwovvs0",
                  "author": "sandesh_in_tech",
                  "text": "Definitely the right mindset. You're playing the long game, and it’ll pay off.",
                  "score": 1,
                  "created_utc": "2025-12-30 06:52:44",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwjmifv",
          "author": "Samsonbull",
          "text": "What do you want to do? Applications like Cursor have dramatically decreased development times. If that is what interests you, go with the Software Development opportunity.\n\nI think, however, that Information Security will give you a longer career path. What I am not a fan of is you stated you will be in an IT Audit role. Most organizations use accountants who hate accounting work. They get their CISA certification and may move to the Risk Management team later. So, I would be skeptical that a permanent offer would come at the end of the internship.",
          "score": 1,
          "created_utc": "2025-12-29 13:54:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwkiq0l",
              "author": "kosh-11",
              "text": "Well I want to get into cyber and think the role is a great way to do that. I’m hoping the position isn’t just risk management, and that later on I can use the position and knowledge as a stool to move on to other things more technical within cyber.",
              "score": 1,
              "created_utc": "2025-12-29 16:40:06",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwkg00v",
          "author": "Jazzlike-Income6900",
          "text": "How on earth are people getting IT experience at their universities, my university doesn't do this ffs",
          "score": 1,
          "created_utc": "2025-12-29 16:27:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwkj2lt",
              "author": "kosh-11",
              "text": "Always be looking and always be applying. Is all I can say. Internships are hard to come by but always be looking for those as well!",
              "score": 1,
              "created_utc": "2025-12-29 16:41:44",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwkjagz",
                  "author": "Jazzlike-Income6900",
                  "text": "Did u reach out to ur uni for experience?\nOr was it posted on the portal?",
                  "score": 1,
                  "created_utc": "2025-12-29 16:42:47",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nwkq074",
              "author": "UJ_Games",
              "text": "Not OP but also have a cybersecurity internship. Got it with no help from my college. Key thing is to apply to internships as they open.",
              "score": 1,
              "created_utc": "2025-12-29 17:14:30",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nwow4ii",
          "author": "Gains-And-Grind",
          "text": "Get into the Information Security role no doubt. You can branch out into specifically cybersecurity or network security later on. But first get a grasp on the fundamentals on IT security and this opportunity with the Info Sec role can help. Software Dev is mainly coding and only creation of applications",
          "score": 1,
          "created_utc": "2025-12-30 06:54:48",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1q3pws1",
      "title": "VAPT intern",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1q3pws1/vapt_intern/",
      "author": "weeb_weeb231",
      "created_utc": "2026-01-04 13:26:33",
      "score": 7,
      "num_comments": 8,
      "upvote_ratio": 1.0,
      "text": "Hey guys I am 2nd year Cybersecurity student and I just got an internship in an AI services company as Intern VAPT analyst. And even though I can’t start until I find the whole scope of testing. I still wanted some advice on what to do as an intern when starting. Any advice or any articles which will help me get started, methodology guides, anything is appreciated. Thanks in advance.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1q3pws1/vapt_intern/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "nxmsrwq",
          "author": "NotWill13",
          "text": "Strengthen basics of pentesting. Most VA is all about using nessus scan and other tools, then slapped it to the client, but for each company they have different kinds of tools to use. I can't ask you to read about that, so just try to have basics knowledge about pentesting, the difference between web, mobile, and API testing. Then, try to learn stuff in HTB to make your fundamental stronger. Create some custom lab for AD, or try cloud in your own home and etc. Maybe also try to learn more about cve by doing code review and then replicate it. There are a lot of ways for sure.",
          "score": 1,
          "created_utc": "2026-01-04 14:54:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxs9kqu",
              "author": "weeb_weeb231",
              "text": "Thanks for advice. I have completed the cpts path on htb",
              "score": 1,
              "created_utc": "2026-01-05 08:21:02",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nxwdutt",
                  "author": "NotWill13",
                  "text": "Then, you're probably good to work, as you have the gist of doing pentesting. Just pass the exam and then start working to know real work life :)",
                  "score": 1,
                  "created_utc": "2026-01-05 22:18:24",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nxnojlu",
          "author": "Otherwise-Neat-5731",
          "text": "Bro i am cybersecurity student 3rd year, can you tell me how did you get the internship?",
          "score": 1,
          "created_utc": "2026-01-04 17:26:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxs9pzn",
              "author": "weeb_weeb231",
              "text": "Bro finding through job apps and linked in didn’t work for me so I just asked for referrals and one of them worked.",
              "score": 1,
              "created_utc": "2026-01-05 08:22:26",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nxsb1dj",
                  "author": "Otherwise-Neat-5731",
                  "text": "Referral from known person or a person from linkedin?",
                  "score": 1,
                  "created_utc": "2026-01-05 08:34:53",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1q1qg5l",
      "title": "Figuring out future certifications for a security engineer?",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1q1qg5l/figuring_out_future_certifications_for_a_security/",
      "author": "acidman390",
      "created_utc": "2026-01-02 05:39:37",
      "score": 6,
      "num_comments": 11,
      "upvote_ratio": 0.88,
      "text": "Hey all, I am a college student who is going into his final semester of college. I have a security+ and about 7 months of experience as an security engineering intern.\n\nI am in a kind of paralysis for finding out the next cert I am going for. I started studying for the Red Hat Certified System Administrator because I was familar with the OS and thought it would be cool. I also think I can use this to go for the Red Hat Certified Engineer. However, I am not sure if that would be the best next option.\n\nI am not sure what to move onto further or if I should stick out the RHCSA or if theres another cert that you guys might be willing to recommend?  \n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1q1qg5l/figuring_out_future_certifications_for_a_security/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "nx7ikj9",
          "author": "LeatherCreepy8156",
          "text": "Honestly nothing will really do much for you now that is reasonably priced. Wait til you get a job and get them to pay for some industry level stuff. Security “engineer” is sorta a blanket term sometimes too so it could help to hear what you’re engineering. Are you doing cloud, detection engineering for a soc, appsec, IAM.. the list goes on. That will help narrow down what you should do.. that being said anything GIAC is amazing if you can get a job to pay for it.",
          "score": 6,
          "created_utc": "2026-01-02 05:44:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx9qr5w",
              "author": "Wallet_TG",
              "text": "This is spot-on-lock down a job first, let them fund GIAC/SANS training, and use your first year to figure out which security path you actually want before committing thousands to certifications",
              "score": 2,
              "created_utc": "2026-01-02 15:52:38",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nx7v11p",
          "author": "Unlikely-Luck-5391",
          "text": "You’re fine where you are. Sec+ + internship already puts you ahead.\n\nRHCSA is a solid next step if you like Linux / infra security. It’s practical and actually useful on the job. I’d finish it if you’ve started.\n\nIf not:\n\n* blue team → CySA+\n* cloud security → AWS/Azure + security focus\n* offensive → only if you really want that path\n\nDon’t rush “advanced” certs yet. Pick based on the role you want, not the cert name.",
          "score": 4,
          "created_utc": "2026-01-02 07:30:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx9qmrc",
          "author": "Wallet_TG",
          "text": "If you're leaning offensive security go OSCP, if cloud-focused do AWS Security Specialty, if staying defensive get CySA+ - RHCSA is solid but only if you're targeting DevSecOps or Linux-heavy roles.",
          "score": 2,
          "created_utc": "2026-01-02 15:52:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxddgo5",
          "author": "raiderh808",
          "text": "Learn how systems operate first, then learn to secure them.",
          "score": 1,
          "created_utc": "2026-01-03 02:54:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx80cxy",
          "author": "Jiggysawmill",
          "text": "Have you considered Google cybersecurity?",
          "score": 1,
          "created_utc": "2026-01-02 08:20:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx8v452",
              "author": "MiserableCode6168",
              "text": "Have you done it? How has it helped you?",
              "score": 1,
              "created_utc": "2026-01-02 12:53:43",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nx8vspc",
                  "author": "Jiggysawmill",
                  "text": "I haven't done Google, but I did Security+ and SSCP because those were work sponsored.",
                  "score": 2,
                  "created_utc": "2026-01-02 12:58:29",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1pxv4ss",
      "title": "Are disappearance of files or apps a sign of hacked wifi ?",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1pxv4ss/are_disappearance_of_files_or_apps_a_sign_of/",
      "author": "StrikingAtmosphere26",
      "created_utc": "2025-12-28 16:14:53",
      "score": 5,
      "num_comments": 6,
      "upvote_ratio": 1.0,
      "text": "i am sorry this may be a really stupid question but i am really worried , so today i found out that 2 of my old backup folders from my laptop were just missing , literally no trace even in the recovery softwares. i spent an hour trying but i couldnt find their memory path , and now again some of the applications from my moms mobile has been disappearing like candycrush or some random application , are these sign of having a hacker connected to wifi or ip? i am really not that knowledgeable in this feild so i apolochise, i have been using alot of internet so i am afraid i may be vulnurable , or the worst case if my dad did both of the things and just randomly forgot but he would have told us forehand,i havnt noticed anything else yet but i dont deep dive in file manager or folders to find any anonomly and have no idea what have been happening behind my back , thanks if someone helps also sorry again for asking this",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1pxv4ss/are_disappearance_of_files_or_apps_a_sign_of/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "nweb4gx",
          "author": "OkStudent8414",
          "text": "First off, not a stupid question. Short answer is maybe. There are a lot of things that can be a sign of people on your network that aren't supposed to be, but those can also be harmless. For the mobile thing, sometimes the phone operating system will uninstall apps that aren't frequently used, apple ios does, not sure about android os. This is the default setting you can turn it off. For the computer, the disappearance of files could mean that someone is there, or it could have been an accidental deletion while you or someone else was on your computer. \n\nIf you suspect anything wierd there are a few questions to ask yourself any time you see anything weird on your computer or mobile device. From easiest to check to hardest to check. \n\nIs my anti-virus software running or installed? \n\nWhen was the last scan of my devices for viruses? \n\nDo I need to make sure my virus definitions are up to date? \n\nIs there an unknown device on my network (i.e. You should be able to log into you router and see which devices are connected)?\n\nIs there traffic happening at odd hours (i.e. when everyone is sleeping or when everyone is at work/school. This will requre a tool like wireshark running and capturing traffic at the router for you to see traffic across the network)? \n\nDid I install something shady (i.e. software from a unknown source or untrusted author, cracked video games, free movies from those pirate sites)? \n\nDid I open a link or attachment in an email from an unknown sender? \n\nDid I click on a bad link from a website? \n\nIf you suspect something is malicious or just plain odd, change all your passwords and restore your system to a previous known good state. If the issues come back up, then you may need to restore to factory default.",
          "score": 1,
          "created_utc": "2025-12-28 17:50:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwekirp",
              "author": "StrikingAtmosphere26",
              "text": "i still use window defender since i heard alot of people saying it was good , also as of routers info i use a commerical wifi and i dont have any experience with all these traffic things because i am still a college student , as of potential attacks i do download alot of games or mangas from torrents but i didnt saw any potential harm while downloading so i assumed they were safe , and i dont use mail often cause its mostly spam , i will run a deep scan after typing this and please if possible tell me if there is some way to check the connected devices from my router",
              "score": 1,
              "created_utc": "2025-12-28 18:34:34",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwjuv1a",
                  "author": "OkStudent8414",
                  "text": "Not sure what router your family has. I have google fiber and they have an app. Typically there is instructions when you set up the router on how to log in to it. Not just the wifi but the router it self for different settings. If the router is provided by your internet company they will manage it so you will have to ask the internet company for any information from your router. You should ask for a list of connected devices. But easier than that is to buy a router that is approved by your internet company and use that instead of the provided one. If you buy it you can manage it yourself and log in to the router's admin page. Typically that will be http://192\\[.\\]168.1.1 or similar. Once there, look for sections like \"Connected Devices,\" \"DHCP Clients,\" or \"Wireless Clients\" to see a list of devices on your home network. ",
                  "score": 1,
                  "created_utc": "2025-12-29 14:42:29",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwj4d4u",
          "author": "Keosetechltd",
          "text": "Those issues sound more just like perhaps accidental deletion or moving of files and the icons for mobile apps. For the folders, I suggest installing a free file searching tool. For Windows, there's a good one with a free tier made by Mythicsoft called Agent Ransack. That will give you much better search than File Explorer, and you can search on keywords within files as well as file and folder names. \n\nFor the mobile apps, first thing to do is go into the complete list of apps, rather than looking at the icons on the home screen, and see whether the missing apps are actually still installed. If they are, you can re-add the icons to the home screen.",
          "score": 1,
          "created_utc": "2025-12-29 11:47:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwjiami",
              "author": "StrikingAtmosphere26",
              "text": "hi , thanks for the software , also i made sure to double check everywhere for the apps , app list. deep sleeping apps. even playstore but it just seems to be uninstalled rather then disabled , it wasnt much since it were mostly games or photo applications but my mom grinded way too much on candy crush",
              "score": 1,
              "created_utc": "2025-12-29 13:29:18",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1q01xfd",
      "title": "i need career advice",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1q01xfd/i_need_career_advice/",
      "author": "Beneficial_Young1839",
      "created_utc": "2025-12-31 02:57:59",
      "score": 5,
      "num_comments": 2,
      "upvote_ratio": 0.73,
      "text": "\nI’m looking for some guidance on non-technical cybersecurity paths, specifically GRC / risk / compliance / management but i’m open to anything and want to sanity-check my plan before committing more time and money.\n\nHere’s what I currently have / will have soon:\n\t•\tBachelor’s degree in Business (law & management focused)\n\t•\t3 years experience in risk management / logistics\n\t•\t2 years working in government services (ServiceOntario – process, compliance, documentation)\n\t•\t1 year IT help desk (basic systems exposure, not engineering)\n\t•\tISO 27001 (currently finishing, confident I’ll pass)\n\t•\tPlanning to do AWS (one cert, governance-level, not engineering)\n\t•\tConsidering CISM as my one management-recognized security cert\n\n•\tGoogle Cybersecurity Certificate (Coursera)\n\t•\tGoogle Project Management Certificate (Coursera)\n\n\t•\tPossibly a master’s later (leaning toward something management / governance-focused, not technical)\n\n\t\nImportant constraints:\n\t•\tI do not want a technical role (no SOC, no engineering, no pentesting)\n\t•\tIm not good at technical stuff nor enjoy it \n\t•\tLong-term goal is management (better pay, balance, some travel)\n\t•\tI want to front-load education while I’m young, then focus on working and leveling up only when necessary",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1q01xfd/i_need_career_advice/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "nxe4hpl",
          "author": "First_Slide3870",
          "text": "You lost me at non-technical and balance.",
          "score": 2,
          "created_utc": "2026-01-03 05:53:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxp6cg8",
          "author": "Hot-Wave-8059",
          "text": "Something they have teach in any school, you must learn how to corporate speak with stakeholders. This also means accepting their bullshit at the same time. I hate all of it but it’s unavoidable",
          "score": 1,
          "created_utc": "2026-01-04 21:29:23",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1q3pgrp",
      "title": "Why runtime checks matter more than expected",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1q3pgrp/why_runtime_checks_matter_more_than_expected/",
      "author": "Honest_Sad_Lady",
      "created_utc": "2026-01-04 13:04:45",
      "score": 5,
      "num_comments": 1,
      "upvote_ratio": 1.0,
      "text": "Pre-deployment security checks feel reassuring, but some memory disclosure CVEs show how much happens after go-live.\n\nNormal database operations can still expose sensitive data quietly.\n\nHas anyone found practical ways to monitor runtime memory behavior without creating alert fatigue?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1q3pgrp/why_runtime_checks_matter_more_than_expected/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "nxruy3k",
          "author": "Unlikely-Luck-5391",
          "text": "This is a good point and yeah, a lot of folks underestimate what happens *after* deploy.\n\nFrom what I’ve seen, most teams that do this well don’t rely on one big “security alert” system. They layer a few lighter checks instead. Things like sampling-based memory monitoring (eBPF-based tools, heap profiling at intervals, not constant) + anomaly detection on access patterns rather than raw memory reads.\n\nOne thing that helped us reduce noise was tying alerts to *behavior change* instead of absolute thresholds. Like, memory regions suddenly being accessed by processes that normally never touch them, or queries behaving slightly off during normal DB ops. That catches quiet leaks without paging people every hour.\n\nAlso runtime checks don’t always need to be security-only tools. We’ve used perf + observability data (latency, alloc spikes, GC weirdness) as indirect signals. Not perfect, but surprisingly effective.\n\nI came across a short breakdown recently that explained this angle pretty clearly, focusing on post-deploy monitoring rather than pre-checks. Nothing groundbreaking, but practical.\n\nCurious what others are doing too, especially in prod-heavy environments where alert fatigue is already bad.",
          "score": 2,
          "created_utc": "2026-01-05 06:12:48",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1q1aetl",
      "title": "Unrecognized Mac OS Device Keeps Showing Under Registered Devices",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1q1aetl/unrecognized_mac_os_device_keeps_showing_under/",
      "author": "Greedy-Examination56",
      "created_utc": "2026-01-01 18:00:12",
      "score": 4,
      "num_comments": 16,
      "upvote_ratio": 1.0,
      "text": "No matter how many times I change my password and remove the device, Mac OS 10.12.3 – Chrome keeps showing up under 'registered devices.' I've never used a Mac or an iPhone, and no one else knows my password. Has anyone else bumped into this issue?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1q1aetl/unrecognized_mac_os_device_keeps_showing_under/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "nx47m5t",
          "author": "therealstabitha",
          "text": "Sounds like somebody else does in fact know your password",
          "score": 2,
          "created_utc": "2026-01-01 18:26:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx5japd",
              "author": "k1132810",
              "text": "I think Google is pretty strict about enforcing MFA these days, and I think you get notified on new device logins. A password change just in case won't hurt the OP though.",
              "score": 1,
              "created_utc": "2026-01-01 22:29:54",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nx5nxm0",
                  "author": "therealstabitha",
                  "text": "I don’t have MFA configured for all my Google accounts. They highly encourage it but don’t seem to make it a hard requirement, or at least not for all kinds of accounts",
                  "score": 1,
                  "created_utc": "2026-01-01 22:55:01",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nxajmf4",
                  "author": "Greedy-Examination56",
                  "text": "What’s weird is that verification codes are required to access my bank, and the only time I’ve ever received one is when I tried to log in online.",
                  "score": 1,
                  "created_utc": "2026-01-02 18:07:34",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nx4inbl",
          "author": "PositiveHousing4260",
          "text": "Mac addresses aren't like they used to be. They were tied to a device and couldn't be changed easily. Today our phones change them by default and they rotate. Not sure what you are using to identify the device but there is a good chance it is you. ",
          "score": 1,
          "created_utc": "2026-01-01 19:21:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx5mgk5",
              "author": "MazurianSailor",
              "text": "He means Apple Mac, not a MAC address",
              "score": 1,
              "created_utc": "2026-01-01 22:46:49",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nx5rckr",
                  "author": "PositiveHousing4260",
                  "text": "Sorry I misread that. Thanks ",
                  "score": 1,
                  "created_utc": "2026-01-01 23:14:04",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nx4lukt",
          "author": "jmnugent",
          "text": "What \"Registered Devices\" list are you referring to here ?",
          "score": 1,
          "created_utc": "2026-01-01 19:37:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxajze8",
              "author": "Greedy-Examination56",
              "text": "On the online banking portal, it lists registered devices that don’t need a verification code to log in. What’s weird is that verification codes are required to access my bank, and the only time I’ve ever received one is when I tried to log in online.",
              "score": 1,
              "created_utc": "2026-01-02 18:09:13",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nx5nim7",
          "author": "BanditSlightly9966",
          "text": "Are you running anything that switches your user agent?",
          "score": 1,
          "created_utc": "2026-01-01 22:52:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxajou9",
              "author": "Greedy-Examination56",
              "text": "Nope",
              "score": 1,
              "created_utc": "2026-01-02 18:07:52",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nx5s0ge",
          "author": "No-Star6116",
          "text": "How to know your phone is hacked or spying on you",
          "score": 1,
          "created_utc": "2026-01-01 23:17:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxajrar",
              "author": "Greedy-Examination56",
              "text": "How would I know? It is a new phone and my laptop is a Windows.",
              "score": 1,
              "created_utc": "2026-01-02 18:08:11",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nx4fzhn",
          "author": "EscapeForward---",
          "text": "Idk how right am i but if anyone near your area is doing an SDR(Software Defined Radio) frame injection then it could just be that \n\nIt's like an replay attack but ip can be whatever of the mac etc \n\nIdk if such a thing that happened to you is even possible or not actually because idk how chrome handles device coms and networking \nIdk if chrome is even affected by SDR \n\nRegardless hope you stay secure \n\nMINE IS A ASSUMPTION REMEMBER THAT",
          "score": 0,
          "created_utc": "2026-01-01 19:07:50",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1q2gg8q",
      "title": "Paranoia perhaps?",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1q2gg8q/paranoia_perhaps/",
      "author": "Feisty_Ad8543",
      "created_utc": "2026-01-03 01:03:31",
      "score": 4,
      "num_comments": 3,
      "upvote_ratio": 0.83,
      "text": "Hello, not sure if this is the right place to post, but have had a few stalkers recently (in person) so just want to secure my online activity. \n\nHad a bit of a freakout a few weeks ago when my webcam light was switching on by itself and zoom, Google meet, camera app were showing a pop up saying \"camera in user by other app\" even when I switched off camera access to all my known apps.\n\nConscious I'm probably being paranoid but was just wondering if there was a feasible way someone could have hacked my webcam without having physical access to the device/how I can keep secure going forward (other than duct tape over the camera - which is what I'm currently doing).",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1q2gg8q/paranoia_perhaps/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "nxcyfet",
          "author": "SecTechPlus",
          "text": "It's possible that someone hacked your computer (not the webcam specifically).  \n\nIf you're running Windows, press the windows key and 'i' together to bring up the settings app. You should see an option for Privacy or 'Privacy & security'. In there should be camera permissions where you can see all apps that are allowed to access you camera. You can disable anything you don't recognise, and if any apps do need that access you can come back and enable them one at a time. \n\nWouldn't hurt to look at your currently installed apps and uninstall anything you're not using. For apps you don't recognise, be careful and do some searching/reading first before you uninstall them, as some apps listed might be operating system components that apps rely upon (e.g. Microsoft Visual C++ Redistributables)\n\nI'd also suggest doing an offline virus scan (run Windows Security > Virus & threat protection > Scan options > Microsoft Defender Antivirus (offline scan))\n\nOn a side note, duct tape leaves residue, so the common recommendation is a Post-It Note over the camera, but if the root cause is someone hacked into your computer then you have bigger problems (e.g. stealing your passwords etc)",
          "score": 3,
          "created_utc": "2026-01-03 01:27:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxcyvd5",
          "author": "SavannahPharaoh",
          "text": "Yes it’s possible if the device is connected to the internet, which I assume it is. Download Malwarebytes and run a scan. Make sure Microsoft Defender is enabled if you have Windows. Note that the issue was probably just a glitch, but better safe than sorry.",
          "score": 2,
          "created_utc": "2026-01-03 01:29:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxw2ygl",
          "author": "JoinDeleteMe",
          "text": "As others have already said, yes, it's possible, and all the previous suggestions (running a Malwarebytes scan, checking your running processes, and reviewing your installed programs/applications for anything you don't recognize) are great.\n\nI'd also suggest opting out of data brokers (e.g., Spokeo, WhitePages, BeenVerified, etc.). These sites publish your address, phone number, and other personal information that stalkers can use.",
          "score": 2,
          "created_utc": "2026-01-05 21:27:30",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pzvt4n",
      "title": "Is it safer to click on questionable emails via your phone vs computer?",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1pzvt4n/is_it_safer_to_click_on_questionable_emails_via/",
      "author": "ThePatientIdiot",
      "created_utc": "2025-12-30 22:30:05",
      "score": 4,
      "num_comments": 14,
      "upvote_ratio": 0.7,
      "text": "So I know the rule is don’t click on questionable emails because simply opening the email to read it could lead to a virus installing itself onto your computer. But I guess I always thought if I did the same thing on say an iPhone, I would be better protected. How dumb is this train of thought? \n\nAlso, how is the simply opening an email to read it, able to download a virus onto your computer? Shouldn’t there be two steps, open email and then click a something within the email? I’ve never really understood it since a company like Google/Gmail should be able to protect you when you simply open an email. Shouldn’t the email itself be inside a protected virtual container? Sure the inside of the email may be a virus but that shouldn’t matter. Please explain this to me",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1pzvt4n/is_it_safer_to_click_on_questionable_emails_via/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "nwtddqa",
          "author": "Elismom1313",
          "text": "Opening an email should not download a virus or anything to your computer. Clicking on links within the email will do that. \n\nCommon misconception\n\nThe reason advised to not open untrustworthy emails is mostly due to the common “next step” of acting upon said email. Assuming you’re not using a strange email client and are using a name brand one like outlook you can open whatever email you want. Just don’t click on anything in it or download or open anything",
          "score": 7,
          "created_utc": "2025-12-30 22:49:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwut1c6",
              "author": "Slight_Manufacturer6",
              "text": "There have been vulnerabilities in the past where JavaScript would automatically install malware simply by opening the email, but unless another vulnerability is found that isn’t an issue today.",
              "score": 3,
              "created_utc": "2025-12-31 03:43:26",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nx7d43a",
                  "author": "Plenty_Dog_5684",
                  "text": "Technically a potentially malicious link could be opened in tor browser for the purpose of A. having it contained in a safe environment. B. Not having your IP leaked and C. Not being tracked excessively",
                  "score": 1,
                  "created_utc": "2026-01-02 05:04:13",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwtbywh",
          "author": "vrgpy",
          "text": "Your phone is also a computer.\n\nAlso, a computer where you store most of your personal, legal, financial, medical and other kinds of private data.\n\nMost people will have less private information on a computer than a smartphone.\n\nSo, guess where do most malware writers looking for personal targets will focus their efforts more.\n\nOf course your work computers could potentially give them access to more money, but companies also put more security effort that regular people.",
          "score": 3,
          "created_utc": "2025-12-30 22:42:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwu39dn",
              "author": "ThePickleistRick",
              "text": "A side note that this is that while there are tons of malware specifically designed for phones, phone manufacturers tend to have an easier time keeping up with security threats because they have a tighter ecosystem.\n\nNot saying you should click fishy links on your phone, but if you keep updated software on your phone it’s far less vulnerable than a windows PC",
              "score": 2,
              "created_utc": "2025-12-31 01:11:29",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nwud5zn",
                  "author": "vrgpy",
                  "text": "Windows is updated more frequently and longer than most phones. But it's a more complex system and it can be even more complex depending on the software and hardware installed.\n\nThe support window for phones is generally shorter, so it's easier to be on a outdated phone software. Be it for the operating system or the installed apps.\n\nUsers of course can skip updates on phones and computers.\n \nSo it's difficult to make a generalization and say than a phone is safer than a desktop computer.\n\nIf you limit enough the scenario maybe you can make a more precise evaluation.",
                  "score": 1,
                  "created_utc": "2025-12-31 02:08:45",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nwutble",
              "author": "Slight_Manufacturer6",
              "text": "I think the point that OP is getting at is that your normally can’t sideload apps on them so a virus couldn’t be installed as easily.\n\nAnd I think this is true, but there is still the risk of the email taking advantage of a phone specific vulnerability.",
              "score": 2,
              "created_utc": "2025-12-31 03:45:14",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nwth45q",
          "author": "Impossible-Goat-4388",
          "text": "Yes, you typically need to click on a link or attachment within the email message in order to download or activate malware. Many security experts advise people to not even open an unknown email message out of an abundance of caution. Meanwhile, the full payload of the malicious software is not necessarily contained within the email message. For example, an attachment or malicious hyperlink embedded in an email message often links to an external website managed by the bad actor. Clicking on the attachment or hyperlink then downloads or activates the malicious software from their web server. Because the malicious software is hosted on a server that email providers do not manage, and because threats are evolving and changing constantly, email providers cannot ensure protection from every potential threat.\n\nBecause the specific actions taken by the malware are not necessarily known, and because the threats are changing constantly, it is best to be equally cautious about unknown emails regardless of the device you are using.",
          "score": 5,
          "created_utc": "2025-12-30 23:09:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwtdh3a",
          "author": "SecTechPlus",
          "text": "There is no common way to get a virus or similar malicious activity from just reading an email. But it's an easy step from reading an email to clicking on a phishing link which takes you to a real-looking site where you might enter sensitive information.  Additionally if it had a virus attachment it usually is a two step process to download and then run the attachment, so you're right that just reading an email won't do that on its own. \n\nOf course there's the rare cases of vulnerabilities in browsers, email apps, and operating systems (both desktop and mobile) that at one point might allow infection upon reading a message, but those are fixed relatively quickly, but that assumes you have all the security updates installed.",
          "score": 2,
          "created_utc": "2025-12-30 22:50:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwtn62n",
          "author": "jmnugent",
          "text": "It depends on what attack-vector or vulnerability the Email is hoping to exploit. \n\n* If the Email contains malware that you have to actually open and run,. then yes, obviously, you've have to open the EXE or Powershell Script or whatever and run it. \n\n* It's possible a PDF can contain malware that exploits Adobe Reader, so simply opening the PDF would be enough to exploit Adobe Reader. If Adobe Reader has some kind of \"0 day exploit\" that gives the attacker admin rights,. thats bad. \n\n* It's possible the Email contains an exploit that targets your Email software (Outlook, Thunderbird, etc). If there's some vulnerability say in \"How your Email client previews JPG images\".. then simply previewing the Email would be enough (but it would only effect a specific Email client. if the Vulnerability existed in Thunderbird but you were previewing the Email in macOS \"Mail\".. then that vulnerability doesn't effect you. \n\nThis is why people say to \"Not click unknown links\" or \"Don't open unknown attachments\"... because you can't predict what's on the other end of that \"unknown URL\".. and you also can't predict what's in that \"unknown Email\". It may be something that doesn't impact your particular computer configuration. But it may be something that does. Do you want to take that risk ?",
          "score": 2,
          "created_utc": "2025-12-30 23:42:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwtxyvv",
          "author": "elifcybersec",
          "text": "If you follow best practices such as keeping things up to date and sticking with known reputable mail clients, you will be fine. The occasional no click vulnerabilities that appear are rare, which means expensive. Unless you are a high value target, there would be no reason to risk blowing an exploit like this. With that being said, this advice only applies if you do not use AI, as things like prompt injection are a known issue. One other point that I haven’t seen being made, is the fact that a pixel can be added to the email, so when it is opened a url is hit and the email address is verified as being valid/active. This can lead to more spam/suspicious emails. If you really wanted to play around/have fun you could set up a dummy email and sandbox. Send any suspicious emails to the dummy email, and only open in a sandbox, and you greatly reduce any risk you may have had.",
          "score": 1,
          "created_utc": "2025-12-31 00:41:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwu6bvk",
          "author": "MountainDadwBeard",
          "text": "I use my wife as a \"honeyclient\" (pun intended). I have her isolated from the network and monitor her connections for malicious activity. \n\nWhile we all know advanced threats can compromise phones, but can confirm mid tier, smaller organizations with mid tier capabilities were able to compromise both her iphone and mac. \n\n2025 was a roller coaster for MacOS vulnerabilities but the ones I found on her machine were actually a few years old in the MITRE malware reports.",
          "score": 1,
          "created_utc": "2025-12-31 01:29:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx9rj38",
          "author": "Wallet_TG",
          "text": "Modern email clients like Gmail already sandbox emails, so just *reading* one won't infect you-the real danger is clicking sketchy links or attachments, and phones are just as vulnerable to those as computers",
          "score": 1,
          "created_utc": "2026-01-02 15:56:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxax1a8",
          "author": "notbumpy",
          "text": "You're right to be cautious, but just opening an email usually isn’t enough these days. Modern email clients like Gmail are sandboxed and strip out most dangerous stuff. The real risk is clicking links or downloading attachments. Mobile might feel safer because of the tighter app restrictions, but it’s not foolproof. I use Malwarebytes for an extra layer since it helps catch sketchy links and scammy stuff before I even get that far.",
          "score": 1,
          "created_utc": "2026-01-02 19:09:12",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1q13gx5",
      "title": "Dealing with app layer exploits that only surface in production",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1q13gx5/dealing_with_app_layer_exploits_that_only_surface/",
      "author": "Sev_Khamani",
      "created_utc": "2026-01-01 12:48:06",
      "score": 3,
      "num_comments": 2,
      "upvote_ratio": 1.0,
      "text": "It is honestly so soul crushing when you put all this work into a rock solid pipeline and then some app layer exploit just bypasses everything the second it hits live traffic. You spend weeks fine tuning your scanners and making sure every single image is clean and every policy is enforced but then production starts acting up anyway and you are left scratching your head because the dashboard says everything is green. I am just so tired of the disconnect between our dev environments and the reality of what happens under actual load because these exploits are just so sneaky. Logs are basically useless in the beginning because they do not show anything is wrong until the damage is already starting to spread. It is incredibly frustrating to tell your boss that the pipeline said everything was fine but the live cluster is telling a completely different story. Has anyone here actually dealt with this kind of nightmare in a live environment or found a way to bridge that gap because it feels like our current tools are just missing the point entirely.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1q13gx5/dealing_with_app_layer_exploits_that_only_surface/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "nx3xmy4",
          "author": "therowreality",
          "text": "Logs don’t help much early.",
          "score": 1,
          "created_utc": "2026-01-01 17:37:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx8mxm1",
          "author": "BroccoliNo7009",
          "text": "This article breaks runtime app-layer threats down clearly:[Armosec](https://www.armosec.io/)",
          "score": 1,
          "created_utc": "2026-01-02 11:49:39",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pzo6pp",
      "title": "Privacy Bee vs Incogni, after a full year on Optery",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1pzo6pp/privacy_bee_vs_incogni_after_a_full_year_on_optery/",
      "author": "winol5",
      "created_utc": "2025-12-30 17:31:54",
      "score": 3,
      "num_comments": 0,
      "upvote_ratio": 0.8,
      "text": "Hey,\n\nI just completed a full year with Optery using the ultimate package. I never had the time to do custom deletion requests but had the expanded reach feature active. I'd say the experience was ok, my main issue with them is that after a full year they couldn't remove my info from all websites they found initially.\n\nThis experience made me realize that while removing my PII from people search websites is important, I was still missing several things: private brokers, government records, data breaches, spam (physical and digital), phone calls, etc.\n\nThis year I want to try a different approach. I just canceled Optery, and got Cloaked. My plan is to slowly replace my identity from some websites, and hide my email and phone number as possible. So that's the proactive aspect.\n\nFor the reactive aspect of it, I'm considering Incogni (mostly because of private brokers vs Optery), and Privacy Bee (because of the extended features for vehicle, physical spam, etc.) on top of Cloaked.\n\nHas anyone tried an approach similar to this? It is difficult to assess these services practical value based on theoretical advantages of how they protect US consumers. Any insights between Incogni and privacy bee assuming Cloaked is there already?\n\nThanks!",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1pzo6pp/privacy_bee_vs_incogni_after_a_full_year_on_optery/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": []
    },
    {
      "id": "1q4lh7u",
      "title": "Stuck in a poorly structured cybersecurity course and feeling burned out – looking for advice",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1q4lh7u/stuck_in_a_poorly_structured_cybersecurity_course/",
      "author": "Clean-Motor-362",
      "created_utc": "2026-01-05 13:19:22",
      "score": 3,
      "num_comments": 2,
      "upvote_ratio": 1.0,
      "text": "I’m currently feeling really stuck and I’d like some advice from people who work or study in cybersecurity.\nI’m 21 (almost 22) and I’m in my third year of a cybersecurity course that is supposed to prepare students for a junior-level job. The problem is that the course is extremely disorganized. Topics are often taught badly, without a clear structure, and sometimes we’re pushed into very advanced subjects without having the necessary fundamentals. For example, we had malware analysis in the first year, without proper background in operating systems, networking, or programming.\nAt this point, I’m really struggling to keep up with exams. I feel like I’m not properly learning new skills, and instead of progressing, I feel blocked. On top of that, this course is slowly making me hate cybersecurity, even though I know I like it and I’m sure it’s the field I want to specialize in and work in.\nUnfortunately, I can’t just quit. I need to finish this course because it’s the only way to access a guaranteed internship provided by the institute. They place students in partner companies, and there’s a real chance of being hired after the internship.\nSo I feel trapped between forcing myself to finish a course that’s draining my motivation and confidence, and knowing that the internship could be my real entry point into the industry.\nHas anyone been in a similar situation? How did you deal with a bad or poorly structured program without burning out or losing interest in the field? Any advice on how to survive this phase while still building real cybersecurity skills on my own?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1q4lh7u/stuck_in_a_poorly_structured_cybersecurity_course/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "nxtfnzh",
          "author": "Right-Banana-7733",
          "text": "I kinda am in the same situation. I am much older than you and have been working in IT for 16 years now. The company I worked for is paying for my education.\n\nI have working experience in networking,  system administration, and scripting/automation. I am still having a hard time. The level in which you need to learn on how vulnerabilities work, is not novice.  Is addition to learning all the tools associated with cybersecurity is overwhelming at times. \n\nLearn the fundamentals first. Even if the program design is all over the place, you will be able to follow along. \n\nCybersecurity is not easy by any means, and is a stressful career depending on sector you get into. Just hang in there. You got this.",
          "score": 3,
          "created_utc": "2026-01-05 13:56:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxtfykx",
              "author": "Clean-Motor-362",
              "text": "Thank you very much! ^^",
              "score": 1,
              "created_utc": "2026-01-05 13:57:53",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1q1xnbj",
      "title": "Transfer from Finance to Cybersecurity.. realistic or fantasy?",
      "subreddit": "CyberSecurityAdvice",
      "url": "https://www.reddit.com/r/CyberSecurityAdvice/comments/1q1xnbj/transfer_from_finance_to_cybersecurity_realistic/",
      "author": "FamiliarSpeech876",
      "created_utc": "2026-01-02 12:42:36",
      "score": 2,
      "num_comments": 31,
      "upvote_ratio": 0.63,
      "text": "Hey all, 23M currently work in a hedge fund. Was speaking to a friend recently who is in cybersecurity, is younger than me, didn’t do too well in school but took an online course which came with vouchers to exams that lead to him having 4 certifications. Initially landed a job for 45k GBP which is above what most university graduates get paid and 6 months later, is now on 80k GBP working 6hrs a day Mon-Fri, fully remote. \n\nI was looking to potentially make a career shift this year after a short break because I’m kind of bored of Finance/can’t see myself doing it long term (I’m only 2 years into my career) but I had not even considered cybersecurity as an option. Luckily I spoke to him and he mentioned all of this, now I’m starting to think this might be an option worth exploring.\n\nThe main selling points for me being working remotely + the reduced hours but still getting very well compensated. I would like to use the extra time to build income sources outside of work/start side hustles, much of which I’m very limited in at the moment due to my work hours but also restrictions due to my industry. \n\nIs he just really lucky or is this a realistic ask for someone who would like to transfer over from Finance. I have some coding experience with python from my current role, but besides that I’d be a newbie taking the same course he did which he sent me a link for. \n\nThanks for any tips/advice/guidance. ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/CyberSecurityAdvice/comments/1q1xnbj/transfer_from_finance_to_cybersecurity_realistic/",
      "domain": "self.CyberSecurityAdvice",
      "is_self": true,
      "comments": [
        {
          "id": "nx8xtc3",
          "author": "The_Red_Serpent",
          "text": "I would like to know who this friend of yours is. This seems like a bit of made up story for me no offense",
          "score": 7,
          "created_utc": "2026-01-02 13:12:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx8yb14",
              "author": "FamiliarSpeech876",
              "text": "Well he’s my friend, and a close one thus me trusting the story. We’re quite open like regarding jobs/salaries so like he said the numbers without me needing to ask. I was aware he was doing the course but hadn’t checked up on him in a while so messaged to see how things had progressed. \n\nOut of interest, what part of the story sounds made up? I know from just basic knowledge/personal research that it’s not unrealistic for cybersecurity roles to be remote or well paid thus me not doubting his story.",
              "score": 1,
              "created_utc": "2026-01-02 13:15:32",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nx8yo7w",
                  "author": "The_Red_Serpent",
                  "text": "A single course with 4 exam vouchers is confusing me . I'm not in the UK so idk how things work there. But I'm curious to know the certifications he holds. \n\n\nAlso a question to you my frnd. You are in a hedge fund shouldn't u be earning a lot. See. a lot of people who are earning loads in this fields. I would like to have a reality check on this as well\n\n\nI work in the field . So i can give u some pointers",
                  "score": 1,
                  "created_utc": "2026-01-02 13:17:55",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nx8y78n",
          "author": "meedar11",
          "text": "Combine both disciplines and specialize in anti fraud.",
          "score": 5,
          "created_utc": "2026-01-02 13:14:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx8v06j",
          "author": "MaleficentExample512",
          "text": "Grass always greener somewhere else? “Cyber” security is over rated. If have a good job try to find meaning & happiness & add some other hobbies that excite you outside of what being paid to do. Good luck & good you are thinking!",
          "score": 1,
          "created_utc": "2026-01-02 12:52:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx8xwcy",
              "author": "FamiliarSpeech876",
              "text": "I guess that is one way to interpret what I’m saying. I do have hobbies outside of work, mainly gym/running/martial arts. I love the movies etc so I go cinema a lot, meet up with friends here and there, essentially life isn’t too bad but that doesn’t mean there isn’t room for improvement. \n\nWhen you say overrated, how do you mean?\n\nMy job isn’t bad at all, just can be quite boring/repetitive and I have to go in office 4 days a week, not a fan of the rush hour commute and I would love to work less hours so I could train more (gym, running etc) and focus on more side hustles or even travel more.",
              "score": 1,
              "created_utc": "2026-01-02 13:12:51",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nx993je",
                  "author": "MaleficentExample512",
                  "text": "Overrated that there is a lot of money, work less, exciting and that certifications matter. But if you like information technology, security, iam, been playing around with it, prob keep the side hustles internal and or your friend can get you a job where working then maybe realistic.",
                  "score": 1,
                  "created_utc": "2026-01-02 14:20:29",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nx94ro4",
          "author": "CRam768",
          "text": "Don’t quit finance. You can start cyber certs slowly and keep your current gig so you can afford the certs. The job market is trash on a global level. So quitting your current gig is not a good idea. Having a back up in your back pocket is good but entry level cyber security isn’t exactly paying well nor is it in a big need. So getting this skill in addition to finance does eventually work out for you. Just not immediately.",
          "score": 1,
          "created_utc": "2026-01-02 13:55:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx994pt",
              "author": "FamiliarSpeech876",
              "text": "Ah no, sorry if it came across as I’m looking to quit straight away. \n\nI would definitely do the course, get the certs and even likely want a job offer before I considered quitting my current job. \n\nThis is more I guess a side project to work towards an eventual career change into something that allows me to get back some of my time and freedom and then I can work on my main goal which is some sort of business so I don’t have to work forever. I feel like I wasted all of 2025 by not working towards any side hustle/business and my main reasons (might come across as an excuse) were lack of time and restrictions due to work.",
              "score": 1,
              "created_utc": "2026-01-02 14:20:40",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nx9aknn",
                  "author": "CRam768",
                  "text": "Yeah, I feel that. I’m also saying it’s a long term expensive side hustle with no return on income for years unless you can incorporate it in your current roll or pick up a part time gig on the side. I did something similar but I added cyber security to systems engineering so it’s easy to add it to my current work. You’ll need to add cyber security forensics to transition to financial systems forensics to your eventual back ground or financial systems cyber security or CISO or strategic technical financial investments into cyber sec companies. So the long term investments are worth it, it’s just how you choose to pivot to add the skill set to your career. You’re looking at a long term commitment before it pays off is what I’m saying. Not everyone is willing to understand adding this skill set typically doesn’t provide immediate ROI.",
                  "score": 1,
                  "created_utc": "2026-01-02 14:28:54",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nxczm0l",
          "author": "Intelligent_Fun3207",
          "text": "Your friend is lying, or grossly incompetent but was lucky enough to get hired by a company run by grossly incompetent people.\n\nSecurity is a 10+ years experience position, not entry level, not even mid unless you want to be mediocre at what you do.  \n\nAlso, your friends pay sucks ass for someone in security.  Most likely because he has no real experience, but it could just be your country too.  \n\nIn order to actually succeed in security, you need to understand how AD works, how networking works, how devops works, how SQL/Oracle/Databases work, how dedicated storage platforms work, how hypervisors work, how backup appliances work, how Windows and Linux works, how ticketing, monitoring, and reporting tools work.   \n\nThen you have to know how all of them interact with each other in terms of communication and integration.   Otherwise you're pushing a policy that will break production without you having a clue how or why.\n\nYou don't have to be an expect, but you need to know a mid-level understanding of all of that.",
          "score": 1,
          "created_utc": "2026-01-03 01:34:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxe10r1",
          "author": "[deleted]",
          "text": "[deleted]",
          "score": 1,
          "created_utc": "2026-01-03 05:27:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxf5vpc",
              "author": "FamiliarSpeech876",
              "text": "Wow, you seem like a nice person to be around. Shitting on someone because they have aspirations and want to work remotely instead of going into office, and build something outside of their job to not work forever. \n\nI hope you feel better about yourself soon!",
              "score": 1,
              "created_utc": "2026-01-03 11:10:44",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nxg7wec",
                  "author": "[deleted]",
                  "text": "[deleted]",
                  "score": 1,
                  "created_utc": "2026-01-03 15:18:43",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}