{
  "metadata": {
    "last_updated": "2026-02-20 09:08:34",
    "time_filter": "week",
    "subreddit": "datascience",
    "total_items": 15,
    "total_comments": 186,
    "file_size_bytes": 222855
  },
  "items": [
    {
      "id": "1r8dcx8",
      "title": "Not quite sure how to think of the paradigm shift to LLM-focused solution",
      "subreddit": "datascience",
      "url": "https://www.reddit.com/r/datascience/comments/1r8dcx8/not_quite_sure_how_to_think_of_the_paradigm_shift/",
      "author": "Thin_Original_6765",
      "created_utc": "2026-02-18 19:52:56",
      "score": 102,
      "num_comments": 49,
      "upvote_ratio": 0.94,
      "text": "For context, I work in healthcare and we're working on predicting likelihood of certain diagnosis from medical records (i.e. a block of text). An (internal) consulting service recently made a POC using LLM and achieved high score on test set. I'm tasked to refine and implement the solution into our current offering.\n\nUpon opening the notebook, I realized this so called LLM solution is actually extreme prompt engineering using chatgpt, with a huge essay containing excruciating details on what to look for and what not to look for.\n\nI was immediately turned off by it. A typical \"interesting\" solution in my mind would be something like looking at demographics, cormobidity conditions, other supporting data (such as lab, prescriptions...et.c). For text cleaning and extracting relevant information, it'd be something like training NER or even tweaking a BERT.\n\nThis consulting solution aimed to achieve the above simply by asking.\n\nWhen asked about the traditional approach, management specifically requires the use of LLM, particular the prompt type, so we can claim using AI in front of even higher up (who are of course not technical).\n\nAt the end of the day, a solution is a solution and I get the need to sell to higher up. However, I found myself extremely unmotivated working on prompt manipulation. Forcing a particular solution is also in direct contradiction to my training (you used to hear a lot about Occam's razor).\n\nIs this now what's required for that biweekly paycheck? That I'm to suppress intellectual curiosity and more rigorous approach to problem solving in favor of calming to be using AI? Is my career in data science finally coming to an end? I'm just having existential crisis here and perhaps in denial of the reality I'm facing.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/datascience/comments/1r8dcx8/not_quite_sure_how_to_think_of_the_paradigm_shift/",
      "domain": "self.datascience",
      "is_self": true,
      "comments": [
        {
          "id": "o644ccx",
          "author": "lambo630",
          "text": "Same thing is happening to me on the Revenue Management side of healthcare. Company wants to sell \"AI\" products so we have to build things with AI. My team is small and I said some of the ideas are likely not possible for the scope they have in mind so we are now partnering with a consulting company to do it...",
          "score": 48,
          "created_utc": "2026-02-18 19:58:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o652lfi",
              "author": "GamingTitBit",
              "text": "I work at a consulting company. I spend so much of my day telling clients \"please don't do this with an LLM, there are traditional methodologies that do this better, faster, and more reliable\"",
              "score": 22,
              "created_utc": "2026-02-18 22:38:36",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o66mfmb",
                  "author": "quantpsychguy",
                  "text": "Me too - I am in consulting, there are tons of amazing use cases for LLMs, but almost every org wants to claim they are using AI...it is a frustrating balancing act.\n\n\"Can't we just use AI?\"",
                  "score": 6,
                  "created_utc": "2026-02-19 03:56:28",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o6bk86i",
              "author": "Expensive_Culture_46",
              "text": "Haha. Every solution you come up with the insurance companies will counter. This is such a pointless exercise.",
              "score": 1,
              "created_utc": "2026-02-19 22:19:23",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o648zqa",
          "author": "Imrichbatman92",
          "text": "Yep LLM are boring af. It's all infra, dev, and prompt engineering. Add the cyber bits because régulations keep adding things to watch out. Very much things I tried to stay away from... It's also ridiculously frustrating because it's like it's finding new ways to hallucinate every time. There are gains and there are some pretty cool things you can do with it, but not sure the upside is worth the downside as a data scientist.\n\nBut it's what lots of clients want for now and the economy is shit so I take what I get hoping the hype dies down, like how the ANN fad died down a bit.",
          "score": 45,
          "created_utc": "2026-02-18 20:20:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o64f8ze",
              "author": "Thin_Original_6765",
              "text": "It's really funny you mention that. I thought ANN was super boring but did it cos that's where the job is at. \n\nNow I would rather go back to ANN and not whatever I'm dealing with right now.",
              "score": 12,
              "created_utc": "2026-02-18 20:50:38",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o64pkvz",
              "author": "Big_Bird_Pecker",
              "text": "Can’t agree more. Infra devops and prompt eng.\nI got pushed into an AI eng role coming from a lead DS position and I am basically just doing software engineering work.\n\nI was hoping for fine-tuning/retraining models, complex rag systems. But no, the only ‘ML’ part is calling an API and writing a prompt - even for vision models.\n\nI really miss the maths/Algo side of things.",
              "score": 6,
              "created_utc": "2026-02-18 21:37:58",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o677sm5",
                  "author": "Vitiligog0",
                  "text": "I'm in the same position. My company is doubling down on calling API's because easy and having the best model available at all times. Queue to management wanting to test the new best or cheapest model that came out this month, models deprecating after a year so you have to switch them timely and A/B testing of the models behind the API's. \n\n\nNow the test set is achieving 80% instead of 93% like yesterday! Back to prompt engineering! What is engineering about instructing a model anyway....",
                  "score": 4,
                  "created_utc": "2026-02-19 06:33:38",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o67fz2f",
                  "author": "Imrichbatman92",
                  "text": "Yeah same.\n\nWorst is that with the YOE I have companies are expecting very high level expertise on that matter so demands are through the roof (and hype isn't t helping ofc, I feel like we've gone back to 2010 era of \"I want you to code FB or Amazon for 50k\" level of client demands...) even though tbh those are skills I had deliberately tried to stay away from (I hate infra work) ...\n\nFor LLM integration, I feel a SE/cloud architect with a good head on their shoulders would be better equipped than a DS. Nowadays, it feels like all of my pitches to clients are about answering a request for \"AI\", include a scoping phase where more often than not I try to get them to understand that gen ai isn't the solution (and bring down unrealistic expectations) but ML/stats modelling is better suited for the business case, and then flipping a coin on whether or not they accept while I'm clenching.\n\nThough truth is even on ml projects I've had to do much more software engineering and DevOps for some years now. Clients don't want PoC or pure models anymore, they want a full on prod-ready MVP they can deploy to pilots right from the get go so you can't afford to develop the model and pawn it off to data engineers anymore. My last two ml projects, i spent more time working on how to deploy, SE design patterns, ci/cd, env integration and deployment strategies, value tracking... than actual ml. The only place nowadays where you get to avoid this are r&d ml engineers jobs, but from what I saw those tend to lack the use cases rotations and contact with business I like.",
                  "score": 2,
                  "created_utc": "2026-02-19 07:45:34",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o67fg3r",
              "author": "floghdraki",
              "text": "> hoping the hype dies down\n\nYou and me both. I keep hearing less and less about AGI recently, so it certainly seems like people are coming to their senses that LLMs actually are just LLMs. They are optimized to convince you they are right about everything, but it's not a magical world model knowing everything.",
              "score": 1,
              "created_utc": "2026-02-19 07:40:45",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o67gjzj",
                  "author": "Imrichbatman92",
                  "text": "Yeah it seems now to be permeating through execs that \"gen/agnetic ai\" isn't the end all be all magical solution they used to think it was. But we're clearly not there yet. \n\nJust last week I had a client ask me for a proposal on how to use AI to automate their *entire risk management process* with minimal human supervision (\"we have lots of data so just plug them into the ai to automate everything thx\") for something like max 100k. I had to cut off my camera and mic so he wouldn't see me laughing hard during the call.",
                  "score": 2,
                  "created_utc": "2026-02-19 07:50:51",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o64bvv1",
          "author": "alwayslttp",
          "text": "NER and BERT are essentially ancient history now. For natural language tasks your best ROI will almost always be prompt engineering. Maaaaybe some light fine tuning if you're in a very rare and specialised case\n\n  \nML still has its place in tabular data but if you're not happy to use LLMs on NLP tasks you're being too strongly influenced by what you think is technically challenging/interesting and not what is the right technical decision\n\n  \nIn this economy? Not viable\n\n  \nIt does suck that every exec wants AI/LLMs shoved in everywhere, but sounds like you have a case where it's actually a good fit",
          "score": 25,
          "created_utc": "2026-02-18 20:34:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o64lyk1",
              "author": "Thin_Original_6765",
              "text": "Thank you. I think I needed to hear this.\n\nWith this POC model being successfully, It does appear prompt engineering will be the primary focus for near future. It seems I either need to be at peace with it or it's time to move on.\n\nAppreciate your comments.",
              "score": 4,
              "created_utc": "2026-02-18 21:21:21",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o66myhz",
                  "author": "quantpsychguy",
                  "text": "You could become a specialist regarding how to augment LLMs for your domain area. SLMs (small language models) are useful here, specifically RAGs though I am sure better methodologies would exist soon (or even now).\n\nFiguring out how to use an Agentic RAG to augment decisioning for next best solution might be a great place to start. Please note I said 'place to start' and don't convince yourself I am telling you to have an LLM replace an MD. :)",
                  "score": 2,
                  "created_utc": "2026-02-19 03:59:48",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o64e2ka",
          "author": "Fun-Acanthocephala11",
          "text": "What does your manager think? Do you have enough domain context in healthcare to break the approach? One of my professors worked extensively on breaking chatgpt in making horrible clinical decisions. \n\nI do like your solution a lot better, create embeddings and map multi-modalities against each other...I honestly would try to break their LLM someway somehow with more abstract prompts, maybe ask some physicians for help lol",
          "score": 10,
          "created_utc": "2026-02-18 20:45:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o65hdfo",
              "author": "denM_chickN",
              "text": "This would be my side job because I absolutely hate this use case. \n\n\nFor all the uses of a next word predictor, a ddx tool is the last fucking application I want demod. \n\n\nI mean, imagine! I waste so much fucking time and IQ prompting llms, _why would you do that?_ and we are just speed running toward the intellectual dulling of MDs now, too. ",
              "score": 1,
              "created_utc": "2026-02-18 23:57:06",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o64o98h",
          "author": "swaggytaco",
          "text": "That's insane. There are some tasks you can do \"fast and loose\" by prompt engineering llms, but that's really not going to be as effective as a transformer model dedicated to the specific problems. Especially in medical where your results have a real human (and financial) cost can be paid for every misclassification ",
          "score": 4,
          "created_utc": "2026-02-18 21:31:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o64p78u",
          "author": "Coconut_Toffee",
          "text": "This has been the bane of my existence for over a year now. As a team lead, I'm often asked to review such junk in the name of \"cutting-edge AI\" produced by the team. Right from prompt \"engineering\" to summarizing insights, everything is AI slop. People have lost their ability to think critically.",
          "score": 4,
          "created_utc": "2026-02-18 21:36:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o64so5f",
          "author": "Jebedebah",
          "text": "I don’t understand how tweaking a BERT prevents you from claiming to use AI? If anything it seems like a more advanced use case of AI than writing an agentic loop that calls APIs - unless you need the API calls to validate that your team is using AI? Like how some teams are punished for under-utilizing expensive copilot subscriptions these days.\n\nI get that the corporate world has a wildly narrow view of what “is” AI. But in your case it really seems like you can say “we used AI” either way.",
          "score": 7,
          "created_utc": "2026-02-18 21:52:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o645uwq",
          "author": "pandasgorawr",
          "text": "Companies pay us for good solutions, not \"interesting\" solutions. If you have rigorously evaluated the LLM solution and it performs better, and you don't want to \"sell\" this better solution, I would say you're not really in touch with the business.",
          "score": 27,
          "created_utc": "2026-02-18 20:06:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o64bsqp",
              "author": "Thin_Original_6765",
              "text": "Forgot to add the detail. It doesn't perform better. It's not much worse, but not better.\n\nThere's also the cost side. We have clean data to be used for traditional ML model training. To use LLM we have to use text, which takes more storage space, more compute, and more time to process.\n\nMy internal conflict is working on something objectively worse and cost more, but because it's \"AI\", it's preferred.\n\nEdit: I want to be more fair. If putting in some time, there's really good chance this POC can be further improved on performance.",
              "score": 22,
              "created_utc": "2026-02-18 20:34:17",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o64cgny",
                  "author": "pandasgorawr",
                  "text": "That's fair. That's the argument you need to raise then, performance, cost, time.",
                  "score": 17,
                  "created_utc": "2026-02-18 20:37:28",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o64diy7",
                  "author": "CaptainAmericasSon",
                  "text": "I think what you're highlighting is upper management's misunderstanding of what \"AI\" even is. I've worked on numerous projects where someone in the C-Suite wants to \"use AI\" to solve a business problem when what they really want is a simple classification or forecast model. And when you deliver a solution using a traditional ML model they remark about how amazing AI is. In my experience most people don't understand the difference between AI and ML. Maybe approach it with that in mind - you can probably sell your solution as \"AI\" and highlight the costs and time savings over the LLM solution and get buy in quickly. ",
                  "score": 14,
                  "created_utc": "2026-02-18 20:42:32",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o65km70",
                  "author": "RobertWF_47",
                  "text": "Is the LLM model training on provider's typed or handwritten medical notes? That can't be a reliable source of data.",
                  "score": 1,
                  "created_utc": "2026-02-19 00:14:59",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o64fa58",
              "author": "SeaAccomplished441",
              "text": "it's possible to take the position of \"even if it's the best solution for the business, it's not something i want to work on\"",
              "score": 6,
              "created_utc": "2026-02-18 20:50:47",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o64g5nf",
                  "author": "pandasgorawr",
                  "text": "Sure everyone is entitled to that position. I wager most businesses are not in a position to accommodate that though. Which is fine, role fit and what each party wants out of your employment is different and changes over time.",
                  "score": 1,
                  "created_utc": "2026-02-18 20:54:45",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o64s04l",
              "author": "wave-o",
              "text": "All of this is correct, and OP even said themself that \"a solution is a solution\". Understanding this, however, does not bar OP from bemoaning how boring LLM work is for your average DS. As another commenter said, it's really just infra, dev and a bit of prompt \"engineering\". Both can be true. And as OP said, the right approach is probably to just accept that this is what you do for your paycheck while the hype lasts.",
              "score": 2,
              "created_utc": "2026-02-18 21:49:11",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o64th5z",
          "author": "Final_Alps",
          "text": "Yup. Seeing that as well. \n\nHigh ups want LLM for ML predictions. For now we won, and I am building an ML model (with the help of an agent of course). \n\nML is cheaper, more predictable, more reliable. For important decisions, without a human in the loop, ML is the tool. LLMs do well elsewhere.\n\n\nAlso. If your AI team did nothing but dump a monster prompt, they are 12 month behind the curve. You can build better LLM pipe with a day of looking at up-to-date guidance on context engineering and skills. Flash that in front of the higher ups.  \n\nWhy not build them an LLM that builds good ml models?",
          "score": 2,
          "created_utc": "2026-02-18 21:55:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o650l9a",
          "author": "Jaamun100",
          "text": "In your case, I think it’s going to be a combination of both, some light pre-processing and feature engineering via MCP tools, then text parsing and final prediction from an LLM. So the LLM gets some focused info from your domain knowledge along with doing what it’s best at: text and response.",
          "score": 2,
          "created_utc": "2026-02-18 22:28:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o66hlyj",
          "author": "Particular_Prior8376",
          "text": "It’s the story everywhere, my organization is spending millions hiring consulting firms, execs and teams jostling for space to somehow be involved  in the llm initiative so they can take credit. Meanwhile my team which is supposed to work on it is realizing that the problem we are trying to solve can be done with a series of if else statements. Also, the real stakeholders don’t care about it. And here’s the kicker.. it will not lead to any improvement in anything. It’s all being done so that we can have a press release saying we are an “AI enabled” company.",
          "score": 2,
          "created_utc": "2026-02-19 03:26:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6469ca",
          "author": "SeaAccomplished441",
          "text": "i'm finishing an ML PhD around the end of this year. there's absolutely no way i am working any job involving LLMs. how humiliating.",
          "score": 3,
          "created_utc": "2026-02-18 20:07:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o64d6u0",
              "author": "Thin_Original_6765",
              "text": "You understood me correctly. Humiliating is exactly how I felt.\n\nThis is a team that I had worked for a long time and had 30X the revenue since the beginning. The heavy push on \"AI\" solution such as the one mentioned in my post is making me question if it's time to move on.",
              "score": 3,
              "created_utc": "2026-02-18 20:40:55",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o67ernz",
              "author": "floghdraki",
              "text": "I mean LLMs are pretty useful are useful for several mundane tasks like data annotation, validation, etc. People just keep using them wrong as the solution.",
              "score": 1,
              "created_utc": "2026-02-19 07:34:30",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o651dz1",
          "author": "Ty4Readin",
          "text": "If the new solution performs worse and costs more, just explain that to leadership. When it is presented plainly with numbers to back it up, there is nothing really to push back against.\n\nIt is your job to highlight these types of things and try your best to push for the correct decisions that are best for the business.\n\nAlso considering these are medical diagnosis models, switching to an inferior model could literally harm people while also costing the business more? It makes no sense.",
          "score": 1,
          "created_utc": "2026-02-18 22:32:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o659r1d",
          "author": "MightBeRong",
          "text": "Is it scalable? It sounds like you might have some prompt over-engineering. How long would it take to apply this GPT prompt approach to a different diagnostic situation? If the \"AI\" approach only works for a very specific set of circumstances, and it takes a lot of effort for each new situation, it's not very useful.",
          "score": 1,
          "created_utc": "2026-02-18 23:15:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o65e0r2",
          "author": "fieldcady",
          "text": "Maybe I am an old guy in this sub, but have you heard the term “hype cycle”? The same thing happened with Big Data tech technologies back in the day. Everybody was really excited about it, but relatively few people understood it, so there are tons of mandates to use the new technology. I spent a huge amount of time explaining to people why you should use traditional tools if possible. This is just how things go when a new, exciting, poorly understood class of technologies comes out.",
          "score": 1,
          "created_utc": "2026-02-18 23:38:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o65vjpa",
          "author": "Ill-Deer722",
          "text": "I've been conflicted with the LLM at all costs vs the traditional algorithms that are cheaper and more easily understood. I still think at the end of the day $ talks to leadership. If you can explain and articulate the costs of running an LLM, then the ongoing maintenance and the risks when it doesn't work vs your solution you might be successful. \n\n  \nHaving worked in consulting and in-house, I would say don't take these concerns to the person who sponsored the consulting work. They have a vested interest in getting it deployed and selling a success story.\n\n  \nThat said, I've played around with AI for the past month and I feel that if I don't upskill in it, my other DS skills will become outdated quickly.",
          "score": 1,
          "created_utc": "2026-02-19 01:16:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o67mghy",
          "author": "dm319",
          "text": "Isn't this such a sad state of affairs for humans? \n\nYou, a highly intelligent and highly trained person, is hacking a prompt to get the results we think are correct; me, a highly trained doctor with 13 years in my specialist field and another 10 in medicine in general, working in healthcare, sitting with patients to explain what is going on, what it means for them, choosing paths ahead to optimise their wishes - all while a bunch of people in management who know little about either if our fields, have determined we need to hand our tools over to AI. \n\nWhat's the point of it all?",
          "score": 1,
          "created_utc": "2026-02-19 08:47:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o67t7dn",
          "author": "patternpeeker",
          "text": "on the llm push, prompts are often a fast baseline. if it works, it works. u can still add rigor through evaluation and stress testing. the role is shifting, not disappearing.",
          "score": 1,
          "created_utc": "2026-02-19 09:54:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o68mrxm",
          "author": "InDataLabs",
          "text": "Totally get the frustration. In our experience (especially in healthcare), prompt-only LLM setups are fine for POCs, but rarely sufficient for production-grade, auditable systems.\n\nWhat tends to work best is a hybrid approach: structured features (demographics, labs, comorbidities) + classical models where appropriate + LLMs for text understanding and edge cases.\n\nIf leadership wants “LLM,” you can often position it as the interface layer, while building a more rigorous backbone underneath.",
          "score": 1,
          "created_utc": "2026-02-19 13:39:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6bk1w1",
          "author": "Expensive_Culture_46",
          "text": "The takeaway from this is that if this is where they plan to go what happens when a doctor puts in poor notes or missed annotating something that seems boring (low hematocrit along with stomach pain) in favor of “45 yr female came in with dispersed gastrointestinal pain. Given NSAID and discharged” \n\nTurns out she had a bleeding ulcer and later died. \n\nThis seems like a huge issue.",
          "score": 1,
          "created_utc": "2026-02-19 22:18:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o64773f",
          "author": "TaiChuanDoAddct",
          "text": "Sounds like you're both wrong to me. \n\nThey're solution sounds lazy/hacked. You're reluctance to give it credit for performing well does you no service. \n\nEither improve on what they're doing (not just in how well you do it but in how fast you do it), or stop blocking them.",
          "score": -5,
          "created_utc": "2026-02-18 20:12:21",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r8pdev",
      "title": "AI Was Meant to Free Workers, But Startup Employees Are Working 12-Hour Days",
      "subreddit": "datascience",
      "url": "https://www.interviewquery.com/p/ai-startup-12-hour-workdays",
      "author": "CryoSchema",
      "created_utc": "2026-02-19 04:16:23",
      "score": 100,
      "num_comments": 18,
      "upvote_ratio": 0.91,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/datascience/comments/1r8pdev/ai_was_meant_to_free_workers_but_startup/",
      "domain": "interviewquery.com",
      "is_self": false,
      "comments": [
        {
          "id": "o66pv96",
          "author": "RoomyRoots",
          "text": "\"AI Was Meant to Free Workers\", lol, from their jobs. Never have CEOs been more transparent that their main goal was replacing people.",
          "score": 71,
          "created_utc": "2026-02-19 04:18:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o679w3v",
              "author": "uncle_genghis",
              "text": "The problem that AI was created to solve is wages.",
              "score": 12,
              "created_utc": "2026-02-19 06:51:30",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o68tarr",
                  "author": "dillanthumous",
                  "text": "Ironically in coding if it scares enough people away from the job faster than it can \"replace\" juniors then salaries will increase.",
                  "score": 4,
                  "created_utc": "2026-02-19 14:16:18",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o66zrw1",
          "author": "NVC541",
          "text": "I find the headline a bit bizarre.\n\nFounders and early employees at startups have always been working ridiculous hours. What’s changed is the scope of the stuff they’re working on as AI has accelerated prototyping.\n\nGranted, the actual article text does a better job of explaining this.",
          "score": 50,
          "created_utc": "2026-02-19 05:28:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6am7ld",
              "author": "Mountain_Pass566",
              "text": "\"Everything continues as normal, but now code is stolen from chatgpt instead of stackoverflow\"   \nIsnt as sexy ",
              "score": 5,
              "created_utc": "2026-02-19 19:32:33",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o67028y",
          "author": "therealtiddlydump",
          "text": "So nothing has changed? That's generally how start-ups work.\n\nTwas ever thus.",
          "score": 8,
          "created_utc": "2026-02-19 05:31:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o671hal",
          "author": "NegativeSemicolon",
          "text": "Technology has never given workers more free time, it just increases their output. Giving workers free time is purely a cultural decision.",
          "score": 17,
          "created_utc": "2026-02-19 05:42:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o67k6hg",
              "author": "GreatBigBagOfNope",
              "text": "One fought for, and often paid for in blood  by those workers",
              "score": 11,
              "created_utc": "2026-02-19 08:25:25",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o670do1",
          "author": "Kindly_Truck3210",
          "text": "Think of the invention of the washing machine. People thought it would result in more free time since no more washing required. What that did was people bought more clothes and now more washing cycles and now need to dry and fold and store these clothes. \n\nExtrapolate to more new technologies that makes things faster. \nLike cars reducing distance and time between people and services/goods. \n\nSame thing LLMs is doing right now.",
          "score": 7,
          "created_utc": "2026-02-19 05:33:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o68tna8",
              "author": "dillanthumous",
              "text": "And email, and Excel, and Word Processors, and the PC. And so on.\n\nEdit. Even Devops and higher level coding languages same pattern.",
              "score": 3,
              "created_utc": "2026-02-19 14:18:11",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o66s908",
          "author": "Deto",
          "text": "Does make you wonder what the people are doing for 12 hour days of the AIs are really just writing all the code. ",
          "score": 12,
          "created_utc": "2026-02-19 04:34:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o68tibn",
              "author": "dillanthumous",
              "text": "In my experience of coming back to my own code, or inheriting it from others, reviewing and validating something works is significantly more time consuming than figuring it out and writing it the first time.",
              "score": 4,
              "created_utc": "2026-02-19 14:17:27",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o675jtb",
              "author": "bante",
              "text": "Maybe they are spending 12 hours a day trying to get AI to fix the pile of shit code AI initially wrote for them.",
              "score": 8,
              "created_utc": "2026-02-19 06:14:52",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o67hcmd",
          "author": "Interesting-Pen5882",
          "text": "When in the history of time has workplace improvements benefited the workers rather than the owners? Only organized revolt and protest gives workers more time.",
          "score": 3,
          "created_utc": "2026-02-19 07:58:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o68t4t7",
          "author": "dillanthumous",
          "text": "Jevons Paradox. When you lower the cost of doing something you sometimes increase the demand. Now instead of redesigning the stack every 24 months you can do it every 6.\n\nProgress thy name is Sisyphus.",
          "score": 3,
          "created_utc": "2026-02-19 14:15:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o670z9c",
          "author": "tapdancinghellspawn",
          "text": "Free workers?  You make it sound like workers are being saved.  No, AI is meant to replace workers, thus making them unemployed.",
          "score": 2,
          "created_utc": "2026-02-19 05:38:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6av9bo",
          "author": "Ancquar",
          "text": "Did anyone actually argue that AI is going to free all workers within a few years?",
          "score": 1,
          "created_utc": "2026-02-19 20:16:30",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r6jv0m",
      "title": "Been failing interviews, is it possible my current job is as good as it gets?",
      "subreddit": "datascience",
      "url": "https://www.reddit.com/r/datascience/comments/1r6jv0m/been_failing_interviews_is_it_possible_my_current/",
      "author": "quite--average",
      "created_utc": "2026-02-16 19:49:06",
      "score": 85,
      "num_comments": 37,
      "upvote_ratio": 0.88,
      "text": "I’ve been interviewing for the past few months across big tech, hedge funds and startups. Out of 8 companies, I’ve only made it to one onsite and almost got the offer. The rest were rejections at the hiring manager or technical rounds, and one role got filled before I could even finish the technical interviews.\n\nI’ve definitely been taking notes and improving each time, but data science interviews feel so different from company to company that it’s hard to prepare in a consistent way and build momentum.\n\nIt’s really getting to me now and I have started wondering if maybe I’m just not good enough to land a higher paying role, and if my current job might be my ceiling. For context, I’m targeting senior data scientist (ML) roles in a very high cost of living area.\n\nWould appreciate hearing from others who’ve been through something similar.",
      "is_original_content": false,
      "link_flair_text": "Career | US",
      "permalink": "https://reddit.com/r/datascience/comments/1r6jv0m/been_failing_interviews_is_it_possible_my_current/",
      "domain": "self.datascience",
      "is_self": true,
      "comments": [
        {
          "id": "o5qp0e3",
          "author": "Ecstatic_Bee6067",
          "text": "It's a rougher economy than many official sources will confirm. I don't think your situation is far from the norm.",
          "score": 144,
          "created_utc": "2026-02-16 19:57:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5qpe39",
          "author": "ghostofkilgore",
          "text": "I think it's pretty natural that interview success isn't some smooth line through your career. You probably got into a groove of being successful for mid roles and now that you're looking to step up to senior, I think it's natural that you'll find it tougher, for a while at least. I don't think that means you've hit a ceiling in your career, it probably just means you've got a bit to go before you come across as a very strong senior candidate.\n\nEverything suggests that it's also a failry tight jobs market at the moment so that's probably making it feel a bit tougher than it should. Companies aren't struggling to find enough candidates who tick 90%+ of their boxes, so decent candidates who're maybe hitting 70-80% are getting squeezed.",
          "score": 54,
          "created_utc": "2026-02-16 19:58:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5upzu4",
              "author": "RecognitionSignal425",
              "text": "It's more about interviewer right now focus on 'less risky' hire rather than 'grow' hire. In that mindset, almost everything interviewee say gets mentally scored.\n\nWhen an interviewer is optimizing for risk minimization instead of growth potential, they are scanning for downside signals, not upside.\n\nOf course, not all of them are being trained for this style of interview. ",
              "score": 2,
              "created_utc": "2026-02-17 12:11:12",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5qosmr",
          "author": "Financial_Wait2125",
          "text": "What types of questions being asked by them?\n\nI interview folks and have taken interviews across the board. I always look for adaptability unless the role is hyper specific. I like to see how the candidate approaches the issue.",
          "score": 16,
          "created_utc": "2026-02-16 19:56:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5rtpix",
              "author": "starktonny11",
              "text": "I feel this is overstated, still getting rejected for small mistakes even though you show how you are approaching problems. None of the feedback i got mentioned i wasnt goong on good direction or my approach was wrong, all were like small mistakes  i made or less tome left to explain in depth which could have been infered easily as nerves of interviews. They want the perfect candidates who makes 0 mistakes\n\nEdit: so i am saying is majority of time you gotta make 0 mistakes to get the offer",
              "score": 10,
              "created_utc": "2026-02-16 23:21:49",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5tkekw",
                  "author": "Financial_Wait2125",
                  "text": "You’re right, I over simplified it. A lot of the roles I hire for are either multi-domain or multifaceted where the approaches are needed to be broad. \n\nI am curious about yours, it sounds as if they had a picture perfect person they were looking for or wanted to doc at the first issue they could. I’m sorry you got that, usually I try to look past the nerves or schedule another round to see if they get past it. \n\nI think when jobs are posted, the recruiters want job skills that are unobtainable or what someone told them they “have” to have. Interviewing sucks, I get it.",
                  "score": 2,
                  "created_utc": "2026-02-17 05:59:16",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o5w9cu0",
                  "author": "Tundur",
                  "text": "I don't know if this is necessarily true in your case, but generally if I give examples like that it's because their relatively objective and *not* because they're the core issue.\n\nIt's possible they just didn't like your vibe, which is a messy and subjective thing, whilst \"you made this error\" is more conclusive.",
                  "score": 1,
                  "created_utc": "2026-02-17 17:12:04",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5quepv",
          "author": "NotSynthx",
          "text": "Only 8?\n\n\nThis a grind homie, you gotta put in more apps. You got this",
          "score": 60,
          "created_utc": "2026-02-16 20:23:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5xo5jo",
              "author": "caylyn953",
              "text": "That's 8 interviews, not 8 applications.",
              "score": 8,
              "created_utc": "2026-02-17 21:10:41",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5qzzyd",
          "author": "Slow_Tap_2885",
          "text": "Honestly, 1 onsite out of 8 for senior ML roles isn’t bad. That’s a competitive level, especially for big tech and hedge funds. At senior level, interviews aren’t about just knowing models. They’re testing judgment, tradeoffs, product thinking, and how you communicate under pressure. The fact that you’re reaching HM and technical rounds means you’re in range. It’s probably refinement, not a hard ceiling. Senior jumps are selective and small gaps matter more. That doesn’t mean you’re not good enough. It just means the bar is high.",
          "score": 30,
          "created_utc": "2026-02-16 20:51:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5qqvzi",
          "author": "Beginning_Cup7065",
          "text": "Are the roles in a different domain compared to your current role?\n\nIf you’re working as an analytics DS and you’re applying to an ML role, then you can face this issue. Also if you’re working as a DS ML in risk and you’re applying to DS ML role in rec sys, you’ll also face this problem. \n\nAs you get more senior, domain expertise matters more than anything else.",
          "score": 9,
          "created_utc": "2026-02-16 20:06:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5qrekz",
          "author": "neo2551",
          "text": "Focus on what you like, and master the basics.\n\nYou will hit one interview or a job that will just be perfect for you, because you invested your energy mastering the topic. \n\nEnjoy the process, and things will play out.\n\nThat being said, learn SQL, at least you will have a shot at FAANG.",
          "score": 5,
          "created_utc": "2026-02-16 20:08:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5rwlye",
          "author": "Optimal_Speed_361",
          "text": "No it’s not you. And even if it were, judging by your introspection skills, you’re not dumb. If dumb people make it into high paying jobs, then you can too. Keep trying, work on your confidence, that might be it.",
          "score": 4,
          "created_utc": "2026-02-16 23:38:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5twpw4",
              "author": "CluckingLucky",
              "text": "Hey, thanks. I’m not OP, but everyone needed to hear this.",
              "score": 1,
              "created_utc": "2026-02-17 07:47:35",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5qsy0m",
          "author": "coreybenny",
          "text": "Real talk. You may not be ready for a senior ds role. That isn't something against you but more to do with you need to continue to develop.  It's a process that everyone goes through and at different rates continue to learn and build skills and it'll come",
          "score": 7,
          "created_utc": "2026-02-16 20:16:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5r2lax",
          "author": "jesusonoro",
          "text": "8 companies is barely a sample size honestly. the part that makes DS interviews brutal is every company invents their own format from scratch so you cant build muscle memory the way SWE people can with leetcode. its more of a format lottery than a skill test",
          "score": 2,
          "created_utc": "2026-02-16 21:03:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5qy6wz",
          "author": "mufflonicus",
          "text": "Try asking for advice on how to improve once you get rejected. You might get specific meaningful advice.\n\nBroaden your horizon, learn other components or domains or get some certifications. Something to make you stick out above the pack.",
          "score": 1,
          "created_utc": "2026-02-16 20:42:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5xhpsb",
              "author": "Muted_Recognition_10",
              "text": "I have the same issue. Got several state interviews but on second round was rejected. I asked once for how to improve and their feedback, they said they can’t share it.",
              "score": 2,
              "created_utc": "2026-02-17 20:40:03",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5rylof",
          "author": "ShapedSilver",
          "text": "It’s a tough economy, truly a different world than just a few years ago. These sound like pretty competitive places so they probably had a lot of applications in a few hours. I wouldn’t take it personally, it’s just going to be more grinding than we’re accustomed to for a little bit",
          "score": 1,
          "created_utc": "2026-02-16 23:49:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5rz8r4",
          "author": "tongEntong",
          "text": "Me too mate🥲🥲🥲, also i heard only 20% of DS project actually went through (the rest failed sustained/ long term in production - even after months cooking it up, esp big companies w money to spend) is it true?",
          "score": 1,
          "created_utc": "2026-02-16 23:53:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5s513l",
          "author": "mikethomas4th",
          "text": ">I’m targeting senior data scientist (ML) roles in a very high cost of living area.\n\nTheres only going to be so many positions total available at that level. This is why many transition from technical roles to leadership to make more money.",
          "score": 1,
          "created_utc": "2026-02-17 00:26:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5sb9mh",
          "author": "Intrepid-Self-3578",
          "text": "I have attended many more interviews than you lot of them stopped responding after few rounds or final round now they are coming back so don't worry. companies are still under lot of uncertainty. ",
          "score": 1,
          "created_utc": "2026-02-17 01:02:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5sv62k",
          "author": "zangler",
          "text": "DM me your resume.",
          "score": 1,
          "created_utc": "2026-02-17 03:02:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5t5e7z",
          "author": "AccordingWeight6019",
          "text": "Rejections happen to everyone. 8 interviews are still early. Focus on structured prep, track patterns in feedback, and keep iterating. Your current job isn’t necessarily your ceiling. ",
          "score": 1,
          "created_utc": "2026-02-17 04:08:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5xpqxu",
          "author": "cheetah611",
          "text": "Keep going, you getting the interviews and to those rounds is a great sign. \n\nI went through something like 10-15 interviews during my recent applications stint and got no success until the last week where I got 3 offers at the same time (one of which was the best/highest paying role I interviewed for during the whole process). \n\nPoint being, it’s not linear by any means.",
          "score": 1,
          "created_utc": "2026-02-17 21:18:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5yiqn9",
          "author": "hotdog_buddy",
          "text": "It took me 4 times getting through final rounds to get an offer",
          "score": 1,
          "created_utc": "2026-02-17 23:44:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o60i6nt",
          "author": "One_Presence_736",
          "text": "Are you putting too much energy into technical interview prep while overlooking other parts of the process?\n\nI can’t tell from your interviews, but a pattern I keep seeing across Reddit interview threads is that people often underweight “how you show up” as a person and whether you fit the team and the organization.\n\nAt a certain experience level, they’ll assume you have the technical foundation. What they don’t know yet is you: how you work, how you collaborate, whether you can self-reflect, how you handle feedback, and what you’re like in a team day-to-day.",
          "score": 1,
          "created_utc": "2026-02-18 07:12:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6297lj",
          "author": "ArcherCommercial9238",
          "text": "Hello, how are you, it really depends on you, recently I think there are many opportunities so if you fail in the interview, nothing happens, new ones always appear",
          "score": 1,
          "created_utc": "2026-02-18 14:55:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o62tfiw",
          "author": "KitchenTaste7229",
          "text": "Many comments have said it and it just bears repeating that companies are just really selective right now. So even if it's frustrating to put in the work and not see the results you want, it's already a great sign that you're taking notes and doing your best to improve. I hope you don't get discouraged, you can make your prep more efficient without feeling underprepared by digging up company-specific interview guides (I have a few sites in mind for this!) so you feel less in the dark about each process differing from one another. Also, don't hesitate to ask for specific feedback after those technical rounds, as it might not be about your skills but more on how you communicated/structured your thought process. Would add more nuance to your improvement, too.",
          "score": 1,
          "created_utc": "2026-02-18 16:28:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5qs2mi",
          "author": "Sufficient_Art2594",
          "text": "Stop preparing for the interview, start preparing more credentials. Degrees, certs, projects, etc. You dont have to ace an interview if you can adequately demonstrate passion and capacity to learn.   \n  \nValue-add isnt always about the best one-to-one match, its about holistic understanding of strategic glidepath. ",
          "score": -7,
          "created_utc": "2026-02-16 20:12:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5qy8tg",
              "author": "hyperactivedog",
              "text": "This is false if the goal is faang and similar. Each company has a mostly standardized set of interview formats and they’re coachable. \n\nThe mental model I use is it’s like cramming for a final that the teacher provided a set of sample questions for. \n\nAnd you’re the guy saying to get certs. \n\nNo one cares about certs if you fail doing a basic coding question. No one cares about certs if you can’t describe a real world scenario you tackled. \n\nCerts help you get a recruiter call. They do very little past that.",
              "score": 3,
              "created_utc": "2026-02-16 20:42:43",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5r0mxv",
                  "author": "Sufficient_Art2594",
                  "text": "I'm not saying you can get certs and then do fuck-else. I'm saying certs and your actual grasp of concepts and materials help illustrate capacity. \n\n\nGood luck standing out against the hundreds if not thousands of others that built your same mental model and \"studied for the test\"... You bring no intangibles to add value and you'll get washed in the sea of recruits with the exact same mentality. Resumes and skills pass the lowest bar, standout strategic value-add gets you an offer, and the easiest way to broadcast that is with breadth of knowledge and holistic understanding of the space. ",
                  "score": 0,
                  "created_utc": "2026-02-16 20:54:28",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1r6klm4",
      "title": "Current role only does data science 1/4 of the year",
      "subreddit": "datascience",
      "url": "https://www.reddit.com/r/datascience/comments/1r6klm4/current_role_only_does_data_science_14_of_the_year/",
      "author": "Tenet_Bull",
      "created_utc": "2026-02-16 20:16:04",
      "score": 72,
      "num_comments": 34,
      "upvote_ratio": 0.9,
      "text": "Title. The rest of the year I’m more doing data engineering/software engineering/business analyst type stuff. (I know that’s a lot of different fields but trust me). Will this hinder my long term career? I plan to stay here for 5 years so they pay for my grad program and vest my 401k. As of now I’m basically creating one xgboost model a year and just doing analysis for the rest of the year based off that model. (Hard to explain without explaining my entire job, basically we are the stakeholders of our own models in a way, with oversight of course). I’m just worried in 5 years when I apply to new jobs I won’t be able to talk about much data science. Our team wants to do more sexy stuff like computer vision but we are too busy with regulatory fillings that it’s never a priority. The good news is I have great job security because of this. The bad news is I don’t do any experimentation or “fun” data science. ",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/datascience/comments/1r6klm4/current_role_only_does_data_science_14_of_the_year/",
      "domain": "self.datascience",
      "is_self": true,
      "comments": [
        {
          "id": "o5qupdu",
          "author": "kater543",
          "text": "Join the club",
          "score": 110,
          "created_utc": "2026-02-16 20:25:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5qv3zw",
          "author": "Particular_Prior8376",
          "text": "Data science/ machine learning cannot stand on its own when it comes to solving a business problem. It is created on a solid foundation of data engineering and analytics. 25% of time spent on building a model is more or less ideal. When looking for candidates companies don’t look for the ones who coded the most number of models, they look for people who can understand the business, frame a problem properly, can create a robust data pipeline and then train a model, can evaluate a model not just on the usual metrics but also on the impact on the business. Trust me, this is the best experience you are getting",
          "score": 127,
          "created_utc": "2026-02-16 20:27:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5r604h",
              "author": "Tenet_Bull",
              "text": "Thanks, looks like my situation is pretty normal then?",
              "score": 12,
              "created_utc": "2026-02-16 21:20:32",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5ra591",
                  "author": "Particular_Prior8376",
                  "text": "I think so, I would suggest keep one finger( figuratively speaking) on ml models so that you are designated as a data scientist, but use other fingers to explore other streams, you will have so many skills to solve problems with.",
                  "score": 5,
                  "created_utc": "2026-02-16 21:40:41",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o5s0xj1",
                  "author": "pm_me_your_smth",
                  "text": "Not the one you're replying to, but take any internet advice with a grain of salt. Data science is is very broad field, job expectations vary greatly between companies and teams, and everyone is speaking only from their personal perspective.\n\nWill play a devil's advocate here where the opposite is true. If you want to be closer to machine learning than data analytics, then experience with model training/experimentation/iteration is more important (including all the data work too) vs business analysis etc. If your experience consists of just a simple train-and-done model once a year, that will hurt your chances for such jobs and it will not be \"the best experience you are getting\". \n\nEverything depends on your specific career targets whether it's best to stay or leave. There's no objectively correct path here, contrary to what the \"trust me\" guy above said.",
                  "score": 3,
                  "created_utc": "2026-02-17 00:03:01",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o5xj8hh",
                  "author": "No_Willingness_4733",
                  "text": "If I was interviewing you and you said you do \"data science\" most of the time I'd assume your role is extremely junior. \nThe more senior I got the more I do: \nStakeholder management, planning, data sourcing, identifying new data sources, negotiating with vendors, exploring new options, organizing team events...",
                  "score": 2,
                  "created_utc": "2026-02-17 20:47:16",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o5tanwz",
              "author": "SryUsrNameIsTaken",
              "text": "Yeah agreed. That kind of role is fast tracking yourself to system architect/tech lead with a lot of ml chops. Or a director if you’re more interested in managing. Throw in some devops and enough frontend to prototype and you’d be well rounded for something like that if you’re interested. Those types of roles require you to know enough about everything to make it work.",
              "score": 3,
              "created_utc": "2026-02-17 04:44:57",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o62q3g0",
              "author": "Intrepid-Training-27",
              "text": "Super like your comment. This is what most people miss about data science and what differentiates a good data scientist from a great data scientist!",
              "score": 1,
              "created_utc": "2026-02-18 16:13:31",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5rpbb4",
          "author": "ArchimedesBathSalts",
          "text": "I think you misunderstand the nature of the field you are in. ML algorithms are overrepresented in education but a small fraction of what matters in the job.",
          "score": 23,
          "created_utc": "2026-02-16 22:57:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5qv5ph",
          "author": "Single_Vacation427",
          "text": "You can do things on the side. Block work time to do your own project.\n\nAlso, it won't hurt you in interviews as long as you have good stories about your job. They are not going to ask you a play by play of your time there.  Even a 'data analyst' type work can have a lot of impact.",
          "score": 15,
          "created_utc": "2026-02-16 20:27:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5r5nnh",
              "author": "Tenet_Bull",
              "text": "Thanks, I think my grad program can fill in the role of data science side projects too",
              "score": 2,
              "created_utc": "2026-02-16 21:18:52",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5r0cpt",
          "author": "Beginning_Cup7065",
          "text": "Focus more on building domain expertise. In 5 years, you’ll be applying to mid or senior level roles and domain expertise is what matters the most in those interviews.\n\nWhat is the domain of your team? Is it rec sys? If yes, read papers and use SoTA approaches for each model you build. When interviewing for new roles, focus only on rec sys roles and, your hiring manager will be mostly concerned on how you solved the business problems using latest methods. They wont care about whether you built an object detection model with Computer Vision.\n\nIf you keep chasing shiny names - CV today, NLP tomorrow, you won’t build enough experience in one domain to compete for senior roles in 5 years.\n\nAlso, don’t waste your time doing side projects, except if you have interest in that area",
          "score": 5,
          "created_utc": "2026-02-16 20:53:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5qv08f",
          "author": "Euphoric-Advance8995",
          "text": "Whatever job you have, regardless of profession: the more you do stuff that you enjoy the happier you’ll be AND SEPARATELY the more you do stuff that will be relevant in the future the more you’re going to stay relevant. \n\nIf your goal is career progression as an IC and you are working on stuff you don’t enjoy or think will be relevant then for sure you’re stunted. I won’t argue that one of ML vs SWE vs analytics is more automatable bc nobody can tell at this point (tho certainly everyone has their own opinions). \n\nIf you want to be doing DS bc you enjoy it or think it’s more relevant I would find ways to carve out side projects and demonstrate business impact to justify the investment.",
          "score": 4,
          "created_utc": "2026-02-16 20:26:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5qzcw3",
          "author": "Tells_only_truth",
          "text": "Sounds about right tbh",
          "score": 2,
          "created_utc": "2026-02-16 20:48:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5s1h73",
          "author": "torsorz",
          "text": "It's nice to hear this is somewhat common, haha. I started a new role in data science a few months ago and I've done literally zero data science, but learning lots about maintaining data pipelines and so on (which is nice because it's basically impossible to find a personal project that involves implementing an actual automated pipeline).",
          "score": 2,
          "created_utc": "2026-02-17 00:06:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5r0gc7",
          "author": "Potential_Swimmer580",
          "text": "Unless you’re in a research based role this seems the norm for most of us. In my experience these last few years at least there’s been a shift from less analytics to more SWE",
          "score": 1,
          "created_utc": "2026-02-16 20:53:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5sv8xj",
          "author": "Pvt_Twinkietoes",
          "text": "Lucky! I'm building automation pipeline most of the time!",
          "score": 1,
          "created_utc": "2026-02-17 03:02:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5sydca",
          "author": "AccordingWeight6019",
          "text": "Good perspective. Real data science is often more about ownership and impact than constant model building. Staying intentional about growth and documenting real outcomes is what keeps the experience valuable long term. ",
          "score": 1,
          "created_utc": "2026-02-17 03:22:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5tchqd",
          "author": "KnowledgeExciting627",
          "text": "It won’t hurt you automatically, but it can if you’re passive about it.\n\nIf you spend five years building one XGBoost model a year and mostly doing maintenance and reporting, you’ll drift toward analytics / applied data / platform work rather than core data science. That’s not bad, but it’s different from experimental ML or research-heavy roles.\n\nThe bigger risk isn’t the lack of “sexy” projects. It’s the lack of experimentation, model iteration, and measurable impact stories. That’s what future DS interviews will probe.\n\nIf the job gives you stability, grad funding, and 401k vesting, that’s real value. Just make sure you deliberately build depth on the side. Improve the modeling pipeline, add evaluation rigor, experiment offline, contribute to something ML-heavy internally, or run personal projects.\n\nFive stable years with no growth is risky. Five stable years with intentional skill building is powerful.",
          "score": 1,
          "created_utc": "2026-02-17 04:58:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5tflrc",
          "author": "Embarrassed_Army_670",
          "text": "Nice to hear I’m not the only who experiences this",
          "score": 1,
          "created_utc": "2026-02-17 05:21:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5u0jxh",
          "author": "the_Wallie",
          "text": "* morpheus voice * welcome to the real world. ",
          "score": 1,
          "created_utc": "2026-02-17 08:23:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5u59bx",
          "author": "Ghost-Rider_117",
          "text": "honestly this sounds pretty normal for most DS roles tbh. the \"pure\" ML research job is kinda rare outside of big tech or research labs. most of us spend a ton of time on pipelines, data quality, stakeholder management, etc.\n\n\n\nthat said - if you're worried about your skills getting rusty, maybe carve out some side project time? even just kaggle competitions or contributing to open source can keep your modeling sharp. plus having that github activity helps when job hunting later.\n\n\n\nthe variety might actually be a good thing for your career long-term - being able to build AND deploy models is super valuablehonestly this sounds pretty normal for most DS roles tbh. the \"pure\" ML research job is kinda rare outside of big tech or research labs. most of us spend a ton of time on pipelines, data quality, stakeholder management, etc.\n\n\n\nthat said - if you're worried about your skills getting rusty, maybe carve out some side project time? even just kaggle competitions or contributing to open source can keep your modeling sharp. plus having that github activity helps when job hunting later.\n\n\n\nthe variety might actually be a good thing for your career long-term - being able to build AND deploy models is super valuable",
          "score": 1,
          "created_utc": "2026-02-17 09:08:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5uq7fu",
          "author": "Lord_Skellig",
          "text": "I feel ya. I just left a job because I was sick of doing analysis on xgboost models, and really wanted to do more deep learning again.",
          "score": 1,
          "created_utc": "2026-02-17 12:12:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5uyeux",
          "author": "jesusonoro",
          "text": "the 75% thats not modeling is honestly what makes you hireable. every DS candidate can fit xgboost, way fewer can own the pipeline end to end and actually talk to the business about it",
          "score": 1,
          "created_utc": "2026-02-17 13:07:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5uyt27",
          "author": "patternpeeker",
          "text": "i’d say it won’t ruin u, but in five years u might have a thin portfolio of pure data science work. if u want to move later, maybe find ways to sneak in small projects that show experimentation",
          "score": 1,
          "created_utc": "2026-02-17 13:09:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5w3f8m",
          "author": "madbadanddangerous",
          "text": "I've been dismayed by the lack of data science and machine learning I've done in my career, after spending so much time and effort getting into the field. Mostly it's programming work to enable data science, or just programming in general. As well as meetings and keeping all the bureaucrats happy (especially in enterprise jobs). My startup experience was more fun but also super crazy, and even then, not all that much ML/DS work. At this point, I'm not sure how many data scientists are actually sciencing any data",
          "score": 1,
          "created_utc": "2026-02-17 16:42:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5w6w4w",
          "author": "Bananana_man",
          "text": "Sounds pretty normal to me. And on top of it you’ll be vested and had your program paid for. I’m in a very similar situation after 3 years. Just try doing some personal projects and continue to learn. Just because your done with school/program doesn’t mean you can’t learn independently",
          "score": 1,
          "created_utc": "2026-02-17 16:59:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5wr0ox",
          "author": "SamWest98",
          "text": "My SWE role does data science 3/4 of the time!!",
          "score": 1,
          "created_utc": "2026-02-17 18:34:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5xiegc",
          "author": "No_Willingness_4733",
          "text": "Nope this is absolutely normal and no workplace will have you do \"data science\" all the time. Sounds about right.",
          "score": 1,
          "created_utc": "2026-02-17 20:43:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o67mryw",
          "author": "Ill-Refrigerator9653",
          "text": "I’ve been in roles where half my time is non-core work too and what helped me was creating structure around how I work. Part of that for me was separating communications giving clients or cross-functional partners a dedicated business line instead of mixing it with personal contact info. A tool like [iPlum](https://www.iplum.com/hipaa-texting-calling-compliance) lets you have that business number on your phone, so your communication workflow feels cleaner and more professional when you’re balancing different priorities.",
          "score": 1,
          "created_utc": "2026-02-19 08:51:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5r1aj6",
          "author": "BodybuilderUpbeat786",
          "text": "Join an investment bank, the engineering side is abstracted away from us, I use Pandas every day at JPMC (obviously depends on the team you join).",
          "score": 0,
          "created_utc": "2026-02-16 20:57:40",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r40g4p",
      "title": "What differentiates a high impact analytics function from one that just produces dashboards?",
      "subreddit": "datascience",
      "url": "https://www.reddit.com/r/datascience/comments/1r40g4p/what_differentiates_a_high_impact_analytics/",
      "author": "Proof_Wrap_2150",
      "created_utc": "2026-02-13 20:38:23",
      "score": 61,
      "num_comments": 30,
      "upvote_ratio": 0.89,
      "text": "I’m curious to hear from folks who’ve worked inside or alongside analytics teams. In your experience, what actually separates analytics groups that influence business decisions from those that mostly deliver reporting?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/datascience/comments/1r40g4p/what_differentiates_a_high_impact_analytics/",
      "domain": "self.datascience",
      "is_self": true,
      "comments": [
        {
          "id": "o5am08o",
          "author": "Upset-Chemist-4063",
          "text": "Levels to analytics impact\n\n1. Answering adhoc questions from a stakeholder\n2. Providing a tool (self serve dashboard) that enables stakeholders to answer questions about a specific business area\n3. Building knowledge in a specific domain (marketing, finance, product) to understand existing reporting gaps and proactively building said reports and sharing with stakeholders to support their initiatives/roadmaps (already developed without much of your input)\n4. Working directly with stakeholders to identify key initiatives to guide product roadmap (where you actually start being more of a data partner / consultant)\n5. Operating primarily @ step 4, but doing adhoc work of the lower steps about 20/30% of the time. \n\nAt a certain point, you’re borderline a data pm va just analyst. You want your stakeholders to see you as a value add in terms of strategy vs just giving them numbers to questions",
          "score": 6,
          "created_utc": "2026-02-14 05:22:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5imiak",
              "author": "brhkim",
              "text": "This is a solid typology. There's a big, big, big difference between being reactive (\"hey they want X, and I have no input into that besides doing it for them\") and being strategic, proactive (\"hey, I know they \\*will\\* want X, so let me get into a conversation with them and see if we can't steer them towards Y which will be better for all these reasons that they'll love\"). Your points on 3 and 4 really hit on the latter!",
              "score": 1,
              "created_utc": "2026-02-15 15:07:15",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5j6mp0",
                  "author": "Upset-Chemist-4063",
                  "text": "Yeah coming from staff level, the expectation is you operate at 4. Nobody really cares about getting a nice new perfected dashboard with all the cool filters and widgets. \n\nThe truth is not all stakeholders you have will be data savvy, so they’ll need a lot of hand holding when understanding and interpreting metrics and/or results of initiatives/experiments. \n\nWhen they are data savvy, you need to be able to operate and communicate almost at their level of expertise in order to have more productive discussions about opportunity sizing, impact, and tradeoffs (design, development time from Eng, and any other factors that need alignment before the execution of a project begins). That’s partly why I frame it as operating as a data partner.",
                  "score": 2,
                  "created_utc": "2026-02-15 16:46:23",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o588etv",
          "author": "durable-racoon",
          "text": "1 empowering self-serve analytics\n\n2 \\*deciding\\* what to analyze, and saying \\*no\\* to requests, rather than being an IT function that takes tickets users submit and completes them. saying 'no we dont think there's enough business value in that analysis, unless you can show us otherwise'\n\n3 having really, really smart people that can do cutting edge things that no one else at the company is doing.\n\n4 back to point 1: if you're already empowering self-serve analytics, then basic data analytics tasks dont NEED to be done by your team. You become the commandos only deployed for the most technically demanding jobs.\n\n5 You can also take charge of the organizations data strategy at a company wide level or department level. cant analyze data if there's no data to analyze.\n\nbuilding relationships is KEY. So is actually participating in the work your customers are doing, you have to GEMBA.\n\nof course doing those 'support ticket' jobs is how you build relationshps so there IS a balance.\n\nthen you know what exists, what real work needs to be done, and you can make it happen.\n\nyou need to work with people and alongside them and empower them in various ways (classes, daily meetings, they teach you how to do THEIR job, you teach them analytics, you create self serve analytics dashboards, and more!)  \nInstead of, like, someone makes a request, 2 weeks later you give them a dashboard and no conversation happens. thats really bad.\n\nif you're an IT org you're going to be laid off when its time to cut costs. if you want impact you have to go find it and you have to say no to low impact things, obviously. it requires a very brave charming and well connected dept leader\n\nas data analytics becomes incerasingly democratized, 'just' doing analytics isnt enough anymore\n\nEDIT: also\n\nFrameoutputs around decisions, not data. The highest-impact analytics teams orient their work around a specific decision that needs to be made. shift from descriptive to prescriptive. You always need to ask 'but how does this add value to the company?'\n\nClose the loop. Track whether your recommendations were implemented and what happened afterward.",
          "score": 42,
          "created_utc": "2026-02-13 20:42:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5addy5",
              "author": "MostlyHereForKeKs",
              "text": "Don’t respond to this post or posts like it. Check the post history - this account is putting up multiple low-effort posts an hour. It’s spam. ",
              "score": 23,
              "created_utc": "2026-02-14 04:16:55",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o5tepfc",
              "author": "SP_Vinod",
              "text": "You're deducing the right thing but allow me to fine-tune your thinking with what I know actually works in practice rather than in theory.\n\nIn my enterprise data management journey demonstrates that the major turning point was the change from reactive IT ticket-taker to value-oriented data partner. The real breakthrough was not analytics but rather the reframed mission of “We make data business ready.” This simple reframing helped the team transition from order takers to proprietors of business results.\n\nLet’s get to the point:\n\nSelf-serve is non-negotiable. If your team is still doing elementary reporting, you are a cost center. Mature teams consolidate key data assets, standardize offerings, and enable business autonomy. Your most valuable talent should be reserved for the highest impact work.\n\nSaying no is leading. If there is no obvious decision, revenue, cost, or risk mitigation for your analysis, just don’t do it. High impact teams manage demand like a service portfolio (think Pareto) rather than a ticket queue.\n\nYou cannot operationalize without data relationships. The “virtual data team” model was successful because while they were embedded, they spoke the business language, and data was used as a means to an end, not as a means of control. \n\nFraming around decisions vs dashboards. Real evolution is from reactive > proactive > predictive. Descriptive analytics without ownership of decisions is entertaining intellectually.\n\nClose the loop. If you’re not tracking adoption and business outcome after delivery, you’re doing theater.\n\nOne more uncomfortable truth: as analytics become democratized, “being good at analysis” is table stakes. Your differentiation is owning data strategy, enterprise data foundations, and actionable data IP, not designing dashboards.\n\nImpact is about courage, discipline on prioritization, and intimacy with the business. Anything below that, you are just expensive reporting IT.",
              "score": 2,
              "created_utc": "2026-02-17 05:14:30",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5vchqs",
                  "author": "durable-racoon",
                  "text": "yep, mission statements are important too. we had one. very good comment, all of it!",
                  "score": 1,
                  "created_utc": "2026-02-17 14:26:34",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o5a44pf",
              "author": "naholt01",
              "text": "Number 2 is key. All the rest falls out of that one if you do it right tbh",
              "score": 1,
              "created_utc": "2026-02-14 03:12:16",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5abwwa",
                  "author": "durable-racoon",
                  "text": "yeah but its really hard. people do NOT like hearing no and you do have to say yes to low-value things sometimes. if upper leadership views your org as a ticketing organization and a business expense, its a tooth and nail fight to change that culture. To some people its akin to hearing their IT support department telling them \"its not worth our time to investigate your issue, sorry\"",
                  "score": 1,
                  "created_utc": "2026-02-14 04:06:11",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o59a9k4",
              "author": "Proof_Wrap_2150",
              "text": "Thank you this is great!",
              "score": 0,
              "created_utc": "2026-02-14 00:04:41",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5j1a11",
                  "author": "mayorofdumb",
                  "text": "Multiple people need to able to understand and use a dashboard. So many are just built. I can create a great dashboard but it's always adhoc because you get random questions. It's keeping things tight and organized with millions of records",
                  "score": 1,
                  "created_utc": "2026-02-15 16:20:34",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o598x3x",
          "author": "MostlyHereForKeKs",
          "text": "The analysis subs are being overwhelmed with “What does this two-word-1234 account ask?”, spam - can the mods please step up?",
          "score": 9,
          "created_utc": "2026-02-13 23:56:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5ac2q0",
              "author": "durable-racoon",
              "text": "im confused by your comment, I thought the post had some good and rarely asked questions",
              "score": 7,
              "created_utc": "2026-02-14 04:07:20",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5ad2ua",
                  "author": "MostlyHereForKeKs",
                  "text": "First - check the post history.\n\nMultiple post per hour like\n“What technical foundations matter most when enabling analytics at scale?”\nOr\n“What does People Analytics work actually look like week-to-week?”\n\n2 - there is nothing rare or interesting *at all* about the question asked.  It’s engagement bait. ",
                  "score": 7,
                  "created_utc": "2026-02-14 04:14:38",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o59d3h9",
          "author": "Statement_Next",
          "text": "Probably just the health of the company or whether there is true need for analytics.",
          "score": 2,
          "created_utc": "2026-02-14 00:21:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o59pekl",
          "author": "Ok-Energy-9785",
          "text": "One that has a proactive goal to answer ambiguous questions the business needs to resolve strategic initiatives",
          "score": 1,
          "created_utc": "2026-02-14 01:37:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5dscd8",
              "author": "Helpful_ruben",
              "text": "u/Ok-Energy-9785 Error generating reply.",
              "score": 1,
              "created_utc": "2026-02-14 18:47:02",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5e0lfa",
                  "author": "Ok-Energy-9785",
                  "text": "That's weird",
                  "score": 1,
                  "created_utc": "2026-02-14 19:29:14",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5bef6i",
          "author": "AccordingWeight6019",
          "text": "The biggest difference is ownership and integration. Teams that just produce dashboards are often downstream. They get requests and deliver visualizations. High impact analytics functions are upstream: they help define the questions, design experiments or analyses, and work iteratively with stakeholders to shape decisions.\n\nAnother factor is context and actionability. It’s not enough to show trends; high impact teams translate insights into concrete recommendations, quantify trade offs, and anticipate how leadership will act on them. In practice, this often means being embedded in decision workflows rather than operating as a separate reporting function.",
          "score": 1,
          "created_utc": "2026-02-14 09:46:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5bx4sh",
          "author": "patternpeeker",
          "text": "the teams that actually influence decisions tend to embed analytics in the workflow, not just hand out dashboards. they push insights that get acted on, follow up on impact, and tweak models based on feedback. dashboards alone rarely move the needle.",
          "score": 1,
          "created_utc": "2026-02-14 12:37:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5d6are",
          "author": "Calm-Huckleberry-601",
          "text": "One thing that would differentiate is building solutions, dynamic and continuous reporting. \nAlso, one where they're able to work with complex and ever changing requirements. Especially that involving unstructured data. \nSometimes analysis is based on both internal and external data. Dashboarding is a step after that.",
          "score": 1,
          "created_utc": "2026-02-14 16:56:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5d7per",
          "author": "DisgruntledMilennial",
          "text": "Honest question, do people actaully look at dashboards? I have this presumption that people look at them a handful of times and then put it on the back burner.\n\nTo question though, I'd say the former goes about their work in a botique/polished manner and the latter does what they are told to do.",
          "score": 1,
          "created_utc": "2026-02-14 17:03:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5faxgr",
          "author": "davecrist",
          "text": "DIY never works like you expect.  Every time we talk with customers they demand flexible configuration and the ability to build their own visualizations and components. \n\nAnd every time no one changes the configuration to anything other than ‘everything’ and they never, ever build their own components or modify the existing visualizations beyond changing the left-to-right order of columns. Never.",
          "score": 1,
          "created_utc": "2026-02-14 23:49:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5m6twe",
          "author": "Fluffy-Ad3768",
          "text": "The ones that drive decisions, not just report on them. We built an analytics system that doesn't just produce dashboards — it makes autonomous trading decisions. 5 AI models analyze data, debate the interpretation, and execute. That's the extreme end, but the principle applies everywhere: high-impact analytics closes the loop between insight and action. If your analytics output requires a human to interpret and act on it, you're leaving value on the table.",
          "score": 1,
          "created_utc": "2026-02-16 02:29:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5nh948",
          "author": "PublicViolinist2338",
          "text": "A lot of it has to do with business politics. I have seen situations where the tool worked perfectly fine from a technical perspective, but where it never ends up getting implemented because it risks automating a set of functions that may lead people to lose their jobs",
          "score": 1,
          "created_utc": "2026-02-16 08:33:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5vwjzg",
          "author": "jesusonoro",
          "text": "whether the analytics person is in the room when the decision gets made or just gets a jira ticket after. high impact teams frame questions, dashboard factories answer them.",
          "score": 1,
          "created_utc": "2026-02-17 16:07:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5xz29r",
          "author": "lebortsdm",
          "text": "Definitely a fine line in my history. The biggest differentiator has been does the dashboard drive more analysis within the company and who's doing that analysis? If it's the analytics teams, then you have a company who heavily relies on them to provide insight vs. business centralized teams tend to say thank you and you never hear from them again.",
          "score": 1,
          "created_utc": "2026-02-17 22:01:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o59ei5p",
          "author": "Current-Ad1688",
          "text": "Why do you think \"just producing dashboards\" is not high impact. Depends what's in the dashboards obviously",
          "score": -1,
          "created_utc": "2026-02-14 00:29:57",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r7btpj",
      "title": "Career advice for new grads or early career data scientists/analysts looking to ride the AI wave",
      "subreddit": "datascience",
      "url": "https://www.reddit.com/r/datascience/comments/1r7btpj/career_advice_for_new_grads_or_early_career_data/",
      "author": "vanisle_kahuna",
      "created_utc": "2026-02-17 17:02:48",
      "score": 57,
      "num_comments": 37,
      "upvote_ratio": 0.85,
      "text": "From what I'm starting to see in the job market, it seems to me that the demand for \"traditional\" data science or machine learning roles seem be decreasing and shifting towards these new LLM-adjacent roles like AI/ML engineers. I think the main caveat to this assumption are DS roles that require strong domain knowledge to begin with and are more so looking to add data science best practices and problem framing to a team (think fields like finance or life sciences). Honestly it's not hard to see why as someone with strong domain knowledge and basic statistics can now build reasonable predictive models and run an analysis by querying an LLM for the code, check their assumptions with it, run tests and evals, etc. \n\nHaving said that, I'm curious what the subs advice would be for new grads (or early career DS) who graduated around the time of the ChatGPT genesis to maximize their chance of breaking into data? Assume these new grads are bootcamp graduates or did a Bachelors/Masters in a generic data science program (analysis in a notebook, model development, feature engineering, etc) without much prior experience related to statistics or programming. Asking new DS to pivot and target these roles just doesn't seem feasible because a lot of the time the requirements are often a strong software engineering background as a bare minimum.\n\nGiven the field itself is rapidly shifting with the advances in AI we're seeing (increased LLM capabilities, multimodality, agents, etc), what would be your advice for new grads to break into data/AI? Did this cohort of new grads get rug-pulled? Or is there still a play here for them to upskill in other areas like data/analytics engineering to increase their chances of success?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/datascience/comments/1r7btpj/career_advice_for_new_grads_or_early_career_data/",
      "domain": "self.datascience",
      "is_self": true,
      "comments": [
        {
          "id": "o5wbsd0",
          "author": "RobfromHB",
          "text": "The reality is a lot of platforms have matured and the low hanging fruit on the product roadmaps were completed 10 years ago so SaaS products started making in house analytics tools and focusing integrations with other systems (ex: connect your random ERP to Hub Spot or whatever). This was happening before LLMs took off and the current AI cycle just accelerated it. The writing was on the wall already for data analytics work.\n\nThe advice for new grads is still kind of the same as it was when the labor market got saturated around COVID, show people what you can build. No one cares about Titanic dataset tutorials or a portfolio of Jupyter notebooks with 30 pages of “report”. People want to see a unique insight on novel data, a project that conveys a sense of architecture, or some job experience that goes beyond homework. New grads and soon to be grads should be hammering every internship possible and working on projects that aren’t just resume padding. ",
          "score": 68,
          "created_utc": "2026-02-17 17:23:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5xrlqc",
              "author": "RecognitionSignal425",
              "text": "> The advice for new grads is still kind of the same\n\nCorrect. Just replace DS with math/language\n\n\"...I think the main caveat to this assumption are **math/language** roles that require strong domain knowledge to begin with and are more so looking to add **math/language** best practices and problem framing to a team ....\"\n\nThey are all tools to serve a domain \n\n",
              "score": 5,
              "created_utc": "2026-02-17 21:26:36",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o60vk0i",
              "author": "Love-Kale5265",
              "text": "Do you think this applies the same way in healthcare?  Im wondering about specific roles there like, given it’s more regulated and domain-heavy..  is that space also getting swallowed by internal tooling and AI automation?",
              "score": 3,
              "created_utc": "2026-02-18 09:16:07",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o5wm71d",
              "author": "vanisle_kahuna",
              "text": "Thanks, I've heard this as a lot as well and thankfully this is much easier to do with a Claude subscription. Although part of the reason why I mentioned that ML engineering is inaccessible to new grads is that (and correct me if I'm wrong) it's still rather difficult to say deploy an ML model within a app. So I'm curious what you would advise junior folks to build in order to stand out more in the job market and showcase it in their applications? To me, the projects that come to mind are jupyter books or data pipelines that feed into a web app but I'm curious if you have other suggestions that are accessible for new grads? \n\nAnd another challenge I think is how to market your work once you have a project going. Of course you can hype up your project on LinkedIn but I think part of the difficulty with this is that hiring managers aren't often looking through your GitHub or portfolio website (happy to be corrected in this as well).",
              "score": 3,
              "created_utc": "2026-02-17 18:12:32",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5wrb30",
                  "author": "RobfromHB",
                  "text": "Anything that can be done inside Claude is the equivalent of a tutorial these days and shouldn’t be given much weight by a recruiter / hiring staff. If it takes little effort to create it will get little consideration. Doing hard things is what makes someone stand out.\n\nHyping a project on LinkedIn is a waste of time. There is so much AI slop there that no one cares. That isn’t your target audience either. Same can be said of the expectation a hiring manager should go through a GitHub repo. That’s not what the person screening resumes is going to do.\n\nHonestly ML engineering has never been more accessible than it is now for students and that absolutely isn’t a notebook. \n\nIt needs to be a fully fledged project with some data ingestion, storage, manipulation or prediction, visualization, and some kind of feedback loop.",
                  "score": 16,
                  "created_utc": "2026-02-17 18:35:56",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o654xrc",
              "author": "nazstat",
              "text": "\"The writing was on the wall already for data analytics work.\" - by that do you mean that data analytics work is becoming obsolete? ",
              "score": 1,
              "created_utc": "2026-02-18 22:50:16",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o65a012",
                  "author": "RobfromHB",
                  "text": "The output isn’t obsolete but having a dedicated role for that output is becoming less necessary.\n\nWhen a lot of SaaS products were made the data was a csv download or some poorly documented APIs at best. The goal was to grow customers via core features. On platform reporting was barebones so you needed a dedicated person or teams on the customer’s end to do analytical work and create dashboards.\n\nOnce most of the core features got built the lower priority things on the product roadmap like better dashboards and integrations got worked on. In previous years you’d want a data analyst to do some work on that csv data. That has increasingly been automated at the request of customers which means the need for analysts has shrunk over time. Those titles stayed around, but that was mostly because of responsibility creep. \n\nIt’s kind of similar to when Excel first came around. There just wasn’t the same need to have an entire team of people reconciling ledgers by hand. ",
                  "score": 2,
                  "created_utc": "2026-02-18 23:16:42",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5x78sy",
          "author": "kjwikle",
          "text": "As a Gen X adjacent to data science at work. Don’t get hung up on titles, or even the specifics of what you “think” you should be doing every day. Try and learn about the business where you work, or if it’s research/non profit/academic, learn about what actually goes on, when people ask you to help them with something, set boundaries, but help, you will learn more and probably be more effective long term than if you are too rigid and only want “strict” data science, math, modeling problems. If you’re seen as someone who can solve a problem with data you’re likely to be asked about math/modeling and other problems later. I work at a major manufacturing company. The grads we hired who dug in and tried to help build solutions with python/r did great, the ones who only wanted to build models struggled. Data science as a title was very popular for 10+ yrs but the work they did was more of a combination of bi/data engineering/data science. \n\nI’ve been in analytics for about 17 yrs.",
          "score": 21,
          "created_utc": "2026-02-17 19:50:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5xn83f",
              "author": "vanisle_kahuna",
              "text": "Thanks, this result helpful",
              "score": 1,
              "created_utc": "2026-02-17 21:06:16",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5z6u9i",
          "author": "msn018",
          "text": "The job market has shifted, but new grads were not rug pulled so much as the expectations changed toward people who can ship real systems and create measurable business impact. Instead of targeting the old notebook focused data scientist role, focus on strong SQL, data modeling, basic software engineering practices, cloud fundamentals, and the ability to deploy and monitor simple pipelines. Pair that with either domain expertise in industries like finance or healthcare or practical LLM application skills such as building RAG systems, designing evaluations, and tracking cost and performance. Use platforms like Snowflake, BigQuery, dbt, StrataScratch, and AWS to build data skills, and tools like OpenAI, Hugging Face, LangChain, and Pinecone to experiment with AI applications. If you position yourself as someone who can turn messy data into reliable assets and deliver AI enabled features end to end, you can stay competitive even without a deep ML engineering background.",
          "score": 7,
          "created_utc": "2026-02-18 01:54:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o68p5h9",
              "author": "TodayEasy949",
              "text": "So basically, we have to do everything",
              "score": 1,
              "created_utc": "2026-02-19 13:53:18",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o6bpeuv",
              "author": "Helpful_ruben",
              "text": "u/msn018 Error generating reply.",
              "score": 1,
              "created_utc": "2026-02-19 22:47:02",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o65wsfk",
          "author": "Ill-Deer722",
          "text": "10+ years in DS here, and I've spent the last few months genuinely wrestling with the same question for my own career. The LLM wave has accelerated something that was already quietly happening. DS has always sat in an awkward middle ground, technical but we're not engineers, business-facing but without the visibility of other functions to go up the chain.\n\nMy honest advice for new grads: if hardcore engineering isn't your thing, lean into what LLMs can't easily replicate: stakeholder management, problem framing, translating ambiguous business questions into something tractable. The PM-adjacent path in AI products will need people who are technically literate but also genuinely good with people. That will be a gap down the line. If you enjoy the algorithm development, then lean into AI engineering roles.\n\nThe ceiling in large DS orgs was always real. The difference now is the timeline has compressed: so being intentional about which direction you grow early matters more than it used to.",
          "score": 5,
          "created_utc": "2026-02-19 01:24:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5w8hcj",
          "author": "Ok-Energy-9785",
          "text": "My advice would be to look into leadership development programs. They're specifically designed for recent grads and offer the experience you need to get your feet off the ground. Even if it's not DS related you are still gaining domain knowledge and can find ways to insert DS to solve business problems",
          "score": 12,
          "created_utc": "2026-02-17 17:07:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5wjhxh",
              "author": "vanisle_kahuna",
              "text": "Interesting, this is actually the first time I've heard anyone give this kind of advice. Can you expand on what these programs teach and what are some of the best out there? Or did you broadly mean leadership development within an org assuming you've already got your foot in the door?",
              "score": 2,
              "created_utc": "2026-02-17 18:00:11",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5wltn7",
                  "author": "Ok-Energy-9785",
                  "text": "They are basically long term post grad internships where junior talent gets their \"in\" in the business and to follow a particular track. So they can be any work function you can think of (IT, HR, data analytics, finance, etc) where you work with boss and you basically are the junior talent on the team building your skill set.\n\nBasically any major company has them.",
                  "score": 3,
                  "created_utc": "2026-02-17 18:10:48",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5xdoov",
          "author": "th0ma5w",
          "text": "Honestly, I think hiring managers really need to look within themselves and decide if they want a real person. Many seem content on seeing only artifacts of work and their entire worldview is predicated on this and they are specifically paid to not understand this, and it is offensive to suggest that they should. Until management fully understands this, then they will continue to get bad results. Try to find a place that treats you like a person! Best of luck!",
          "score": 3,
          "created_utc": "2026-02-17 20:20:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6221e2",
              "author": "ArcherCommercial9238",
              "text": "Yes yes",
              "score": 1,
              "created_utc": "2026-02-18 14:19:08",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5yzzhb",
          "author": "hockey3331",
          "text": "> without much prior experience related to statistics or programming. \n\n\nI mean, why would you target data science without programming or statistics? Its really tough to avoid both.\n\n\nShort term, the play is to get into a company that is tech-illeterate and be their in-house expert. Then you use AI to deliver much faster than anyone else and get surface info on a ton of topics that nobody dreams of touching. You look like a rock star and start being trusted with your own initiatives and gain valuable experience in the real world - working at the stats/programming on the way.\n\n\nThats the most straightforward shot. Less competition too because talented and experienced DS practitioners are avoiding those places like the plague.",
          "score": 3,
          "created_utc": "2026-02-18 01:19:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o61cz5z",
              "author": "Decent-Signal-3798",
              "text": "can you recommend some valuable resources to learn statistics throughly for data science  \nany channel, course ,book or any website to practice & learn will work ",
              "score": 1,
              "created_utc": "2026-02-18 11:47:37",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o662glk",
                  "author": "hockey3331",
                  "text": "To be completely honest I went the Math degree route, so the resources I know have complemented traditional education. And the reality is most roles arent that theoretical... but its foundational and most hiring managers will expect familiarity with core concepts to be able to discuss the methods you use. \n\n\n\n\nHeres for stats/probability resources, but you might also benefit from brushing up on calculus and linear algebra.\n\n\nOn youtube, StatsQuest is a favorite of mine as is Blue1Brown.\n\n\nFor books, Statistical inference by Casella and Berger is often recommended, as is ISLM (i think thats the acronym?)\n\n\nRecently I read Artificial Intelligence A Modern Approach by Russell and Norwig and Machine Learning by Tim Michell for courses and they were great resources.\n\n\nD2l.ai is a good hands on resource for deep learning.\n\n\nLess traditional, but the Eulers project is a collection of computational math problems which is quite fun.\n\n\nIf you want to learn basic probabilities, check out resources for the actuarial exam P. Ton of motivated people are taking the exam and creating resources around it.\n\n\n\n",
                  "score": 1,
                  "created_utc": "2026-02-19 01:57:13",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5wx6xp",
          "author": "varwave",
          "text": "“Assume these new grads are bootcamp graduates or did a Bachelors/Masters in a generic data science program (analysis in a notebook, model development, feature engineering, etc) without much prior experience related to statistics or programming.” \n\nI’m going to be harsh. Tough love. Beyond just networking, you should get real rigorous skills \n\nGet good at software development. Or if you don’t have a MS, then statistics paired with strong programming skills is useful. Being mediocre at both statistics and software engineering skills, without niche domain knowledge, means being highly replaceable. Organizations are maturing in identifying their needs and there’s less willingness to take risk given the economy. You’re competing against people that do have a rigorous graduate level background in computer science, statistics and/or something similar and have practical experience in applications through internships and/or research. \n\nCash cow MS programs and boot camps were effective in job placement, when the job market was strong, interest rates were low and businesses were throwing money at all things data related",
          "score": 6,
          "created_utc": "2026-02-17 19:02:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5x0zc4",
              "author": "vanisle_kahuna",
              "text": "Thanks for the candid advice. This post wasn't necessarily for me tho lol. I just thought it was a discussion worth having for all the new grads here looking for career advice",
              "score": 2,
              "created_utc": "2026-02-17 19:20:46",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5xlicn",
          "author": "Beginning_Cup7065",
          "text": "I’ll advise new grads to either do software engineering or train themselves for jobs that involve building/fine-tuning foundation models (most companies require a PhD). \n\nMost of AI implementation is software engineering, and if you want to do that, you should just get a CS degree or teach yourself CS.",
          "score": 6,
          "created_utc": "2026-02-17 20:58:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5xp2rc",
              "author": "vanisle_kahuna",
              "text": "Yea this is largely similar to where I think the ball is rolling too. It just sucks tho for the folks that had already invested time/money in general DS programs just before LLMs because it was supposedly \"the sexiest job of the 21st century\"",
              "score": 2,
              "created_utc": "2026-02-17 21:14:59",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o62pkq6",
                  "author": "Intrepid-Training-27",
                  "text": "I am a dat scientist and I don’t see my work being done by any LLM. They can build a model but they cannot figure out which target variables to choose and why, understand why certain datasets should not be used , design custom features or trade off between a set of models that goes beyond mere performance metrics. The work of a data scientist is not going anywhere anytime soon",
                  "score": 2,
                  "created_utc": "2026-02-18 16:11:10",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5y8pf1",
          "author": "HelpAFellowKnight",
          "text": "Just wanted to say, seeing some good, honest advice in here. Great question imo. Helped me at least.",
          "score": 2,
          "created_utc": "2026-02-17 22:50:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5x4gc1",
          "author": "Illustrious-Pound266",
          "text": "Learn agents. Agentic development is the future of AI.",
          "score": 2,
          "created_utc": "2026-02-17 19:37:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o623efb",
              "author": "mrproteasome",
              "text": "Absolutely this is solid advice. The prompting is less important than  having a swarm of agents executing different parts of a task (context my background is pharma).",
              "score": 2,
              "created_utc": "2026-02-18 14:26:07",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5xrjtg",
          "author": "Arnukas12345",
          "text": "I would say look for a niche role in that field.",
          "score": 1,
          "created_utc": "2026-02-17 21:26:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o61o7pp",
          "author": "patternpeeker",
          "text": "the bar moved toward stronger engineering, not just modeling in notebooks. llms help with prototyping, but shipping and maintaining systems still requires solid stats and backend skills, so doubling down on fundamentals is a safe move.",
          "score": 1,
          "created_utc": "2026-02-18 13:03:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o626gxc",
          "author": "AccordingWeight6019",
          "text": "The field isn’t disappearing, it’s evolving. Pure “notebook data science” roles are rarer, but demand for people who can work with data end to end and apply AI in real systems is growing. Focus on strong fundamentals (SQL, stats), add some engineering skills (APIs, pipelines, deployment), and learn how to use LLMs practically. The edge now is shipping solutions, not just training models.",
          "score": 1,
          "created_utc": "2026-02-18 14:41:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o63ruwo",
          "author": "Bulky_Gap_7072",
          "text": "I'm telling everyone to read Vibe Coding by Gene Kim & Steve Yegge. Depending on your purposes, maybe sometimes you should have an agent try and one-shot a throwaway app, and other times you'll want to work iteratively with strong tests and continual architecturally thoughtful refactoring. I think the principles they are describing work for getting good results whether you're building applications, doing data analysis, or generating drafts of prose to rewrite with your own voice.",
          "score": 1,
          "created_utc": "2026-02-18 19:01:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o67ogmk",
          "author": "kamlekar",
          "text": "One thing that helped me once I started working more with stakeholders and clients was organizing my communication channels. As a data scientist you’ll often be juggling Slack, email, meetings, and sometimes direct calls or texts with partners or users. Using a separate business number on your phone something like [iPlum](https://www.iplum.com/hipaa-texting-calling-compliance) made it easier to keep professional communication structured and separate from personal messages, which helped me stay organized and responsive during busy project phases.",
          "score": 1,
          "created_utc": "2026-02-19 09:07:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o612r9x",
          "author": "kartikey7734",
          "text": "The shift from \"traditional DS\" to \"AI-adjacent\" roles is real, but here's the unpopular take: this is actually GOOD for new grads.\n\n\n\nWhy? Because it's forcing differentiation.\n\n\n\n\\*\\*The commoditization trap:\\*\\*\n\nVanilla ML roles (\\~2020): Slightly better-paid data analyst with sklearn\n\n\\*\\*Result:\\*\\* Salary compression, market saturation, junior roles flooded\n\n\n\n\\*\\*New reality (2026):\\*\\*\n\n\\- Prompt engineers = glorified technical writers (sorry, but it's true)\n\n\\- Real DS = understanding \\*why\\* LLMs work, knowing when NOT to use them\n\n\\- Value = domain expertise + math literacy + shipping ability\n\n\n\n\\*\\*My advice for new grads:\\*\\*\n\n1. \\*\\*Get strong fundamentals\\*\\* (linear algebra, statistics, NOT \"build a neural net in 2 days\")\n\n2. \\*\\*Pick a domain\\*\\* (finance, biotech, climate - anywhere you can speak their language)\n\n3. \\*\\*Learn to communicate uncertainty\\*\\* (Bayesian thinking > point estimates)\n\n4. \\*\\*Ship projects\\*\\* that solve real problems, even if they're boring (not Kaggle comps)\n\n5. \\*\\*Learn the full stack\\*\\* - from data pipeline to A/B testing to business impact\n\n\n\nThe \"AI wave\" isn't drowning DS - it's rewarding people who go deeper instead of wider. New grads with strong fundamentals will beat prompt engineers with 0 domain knowledge every time.\n\n\n\nPs: The math/language/SWE skills rant is right on. Most junior roles fail because they have 0 software engineering rigor.",
          "score": -5,
          "created_utc": "2026-02-18 10:22:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6133vb",
              "author": "MarathonMarathon",
              "text": "Clink clank clunk",
              "score": 4,
              "created_utc": "2026-02-18 10:25:38",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r91byx",
      "title": "Was my modeling approach in this interview flawed, or was I rejected for other reasons?",
      "subreddit": "datascience",
      "url": "https://www.reddit.com/r/datascience/comments/1r91byx/was_my_modeling_approach_in_this_interview_flawed/",
      "author": "quite--average",
      "created_utc": "2026-02-19 14:56:50",
      "score": 46,
      "num_comments": 52,
      "upvote_ratio": 0.87,
      "text": "I had an interview where they gave me a dataset with \\~130 (edited from 100) variables and asked me to fit a model. For EDA, I calculated % missing for each variable and dropped ones with >99% missing, saying they likely wouldn’t have much signal. For the rest, I created missing indicators to capture any predictive value in the missingness, and left the original missing values since I planned to use XGBoost which can handle them.\n\nI also said that if I used logistic regression, I’d normalize variables between the 1st and 99th percentile to reduce outlier impact and scale them to 0–1 so coefficients are comparable.\n\nI ended up getting rejected, so now I’m wondering if there was something wrong with my approach or if it was likely something else.\n\nEdit: As a measure of variable reduction, I also dropped a bunch of columns that had greater than 95% of same values (constant) stating that they may not have much variance, and if I have more time I’d revisit the 95% threshold and look into the columns that were being dropped.",
      "is_original_content": false,
      "link_flair_text": "Statistics",
      "permalink": "https://reddit.com/r/datascience/comments/1r91byx/was_my_modeling_approach_in_this_interview_flawed/",
      "domain": "self.datascience",
      "is_self": true,
      "comments": [
        {
          "id": "o693sz2",
          "author": "Ty4Readin",
          "text": "I don't think you did anything egregious, but here are some thoughts that came to mind:\n\n1. Removing features based on EDA is risky imo. I would rather understand what do the features represent, could they potentially be predictive, etc. Even if a feature is missing in 99% of samples, there could be 1% of samples where it is extremely predictive.\n\n2. I don't understand why you added an indicator for missing values if you are using xgboost models that can natively handle missing values.\n\n3. I don't generally agree with the practice of \"capping outliers\" or filtering outliers, etc. Outliers are not necessarily bad and should not necessarily be treated any differently. The only exceptions in my opinion is if I understand the domain and I know the outliers are caused by a genuine measurement error. \n\n4. Overall, I feel like this type of exercise is fairly useless. It sounds like you went through a very basic generic EDA process, however it doesn't seem to take anything into account regarding the domain/problem/business value, etc.\n\nIf I am asking an interviewee about a problem like this, I am more interested in having them ask questions like:\n\n- What business problem are we solving?\n\n- Are we collecting the data properly for the problem we want to solve?\n\n- What loss functions / evaluation metrics should we use?\n\n- How will the model be used/deployed? Is it properly formulated?\n\n- How should we split the data in train/valid/test?\n\n\nTo me, those are the actual important skills and questions that should be addressed. But walking through some generic EDA process is kind of pointless in my opinion, but I don't really know much about the interview questions and process you went through.",
          "score": 95,
          "created_utc": "2026-02-19 15:11:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o695cko",
              "author": "quite--average",
              "text": "Thanks for sharing, I appreciate the input. I agree that removing features purely based on EDA can be risky. In a 45 minute interview though, I felt I needed to use some practical way to handle missing values without fully understanding the data, especially since the interviewer also wasn’t familiar with the dataset’s domain.\n\nRegarding outliers, from what I’ve read and seen in my field (risk), logistic and linear regression can be influenced by them. In this context, outliers are often things like extremely high balances or asset values that occur very rarely but can skew the model.\n\nI edit the post with one more update, could that be it that caused the rejection?",
              "score": 17,
              "created_utc": "2026-02-19 15:19:42",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o69bgts",
                  "author": "Latent-Person",
                  "text": "> Regarding outliers, from what I’ve read and seen in my field (risk), logistic and linear regression can be influenced by them. In this context, outliers are often things like extremely high balances or asset values that occur very rarely but can skew the model.\n\nJust because some values are \"too different\" from the rest doesn't mean they should be removed. Extreme values may be rare, but they can reflect the true underlying population rather than errors. In the example you mention, heavy tails are expected. You shouldn't just delete data to make your model \"fit better\". See e.g. this StackExchange post https://stats.stackexchange.com/questions/200534/is-it-ok-to-remove-outliers-from-data for more discussion about this.\n\nYou can also play around with this yourself by simulating from a distribution with heavy tails, or a mixture of two different distributions.",
                  "score": 21,
                  "created_utc": "2026-02-19 15:49:59",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o69fni8",
                  "author": "ArcticGlaceon",
                  "text": "Credit risk? Just use weight of evidence encoding and call it a day, they love that shit and solves your outlier and missing data problem. \n\nAre you already working in the field? Methodology is pretty standardised and I would think things like WOE encoding is ubiquitous no matter where you go.",
                  "score": 3,
                  "created_utc": "2026-02-19 16:10:16",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o69e8rq",
                  "author": "Ty4Readin",
                  "text": ">I felt I needed to use some practical way to handle missing values without fully understanding the data, especially since the interviewer also wasn’t familiar with the dataset’s domain\n\nThats a big red flag from the interviewer lol. Not really your fault there.\n\n>Regarding outliers, from what I’ve read and seen in my field (risk), logistic and linear regression can be influenced by them. In this context, outliers are often things like extremely high balances or asset values that occur very rarely but can skew the model.\n\nMy default is always to leave the data as is regarding outliers unless I know there is measurement error issues, etc.\n\nThere might be cases where it can empirically be helpful for the model to cap outlier valued depending on the model type, features available, dataset size, etc.\n\nHowever, if that is the case, I would treat it as a hyperparameter and would experiment to see whether it actually has a positive impact or not on validation results. In general, I find that it doesn't help practically and usually better to leave data outliers alone, but your mileage may vary :)",
                  "score": 6,
                  "created_utc": "2026-02-19 16:03:28",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o6dnkv8",
                  "author": "TA_poly_sci",
                  "text": "> Regarding outliers, from what I’ve read and seen in my field (risk), logistic and linear regression can be influenced by them. In this context, outliers are often things like extremely high balances or asset values that occur very rarely but can skew the model\n\nRight, but that (1) is not sufficient reason to remove them, it's effectively just basing your model and (2) you were proposing to use xgboost.",
                  "score": 1,
                  "created_utc": "2026-02-20 06:22:44",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o6al8qr",
              "author": "Mizar83",
              "text": "I would add to this that there may also have been leakage in the feature/outliers removal. Improper train/test split with temporal leakage may also be a point.",
              "score": 2,
              "created_utc": "2026-02-19 19:27:53",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o6cb9bo",
              "author": "-phototrope",
              "text": "I think it’s up to the interviewee to ask these types of questions to show they understand what the problem/question really is. It’s about the business problem.",
              "score": 1,
              "created_utc": "2026-02-20 00:53:30",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o6dndf3",
              "author": "TA_poly_sci",
              "text": "I think in this case the interview sufficiently showed OP might have a decent amount of textbook knowledge, but very little practical knowledge about how top  prioritize it. In that sense, I think this is a fairly reasonable case, one that is realistically challenging for a data science.",
              "score": 1,
              "created_utc": "2026-02-20 06:20:56",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o69cx9h",
          "author": "michael-recast",
          "text": "I've designed and run hundreds of these types of interviews. My suspicion is that the interviewer was looking for more discussion about the business problem and what the model is actually doing and what the risks are. Jumping directly into modeling would be an auto-fail if that was the case. This is similar to what u/Ty4Readin suggests above but he says he'd call it a \"nice to have\" in the interview whereas often for me it's the most important piece!",
          "score": 31,
          "created_utc": "2026-02-19 15:57:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o69dpl8",
              "author": "Ty4Readin",
              "text": "I totally agree with you, I may have worded my comment poorly, but jumping into EDA/modeling is fairly useless IMO. The most important part is understanding the business problem, model formulation, etc. So 100% agree with you.\n\nHowever, I think OP mentioned that the interviewer said they don't know anything about the dataset or business problem 😂 So it sounds like just a bad interview process overall",
              "score": 13,
              "created_utc": "2026-02-19 16:00:52",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o69e8be",
                  "author": "quite--average",
                  "text": "Yeah I asked them about a few variables, they said they are not sure as it was a random dataset taken from Kaggle.",
                  "score": 12,
                  "created_utc": "2026-02-19 16:03:24",
                  "is_submitter": true,
                  "replies": []
                },
                {
                  "id": "o69ikfg",
                  "author": "michael-recast",
                  "text": "oof okay nevermind -- just sounds like a bad interview, who knows what they could have been looking for",
                  "score": 7,
                  "created_utc": "2026-02-19 16:24:17",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o6b1i1b",
              "author": "CadeOCarimbo",
              "text": "In my experience most of companies don't leave much room for questions. They send you the case and expect just the notebook solution from you.",
              "score": 3,
              "created_utc": "2026-02-19 20:47:09",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o69ebnu",
              "author": "quite--average",
              "text": "Thank you, this is useful. I will try to improve upon this.",
              "score": 2,
              "created_utc": "2026-02-19 16:03:52",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6a11qr",
          "author": "Single_Vacation427",
          "text": "Dropping variables for \"lack of variance\" doesn't make sense. What if you have a variable that takes 2 values, 0 and 1, and it indicates \"old customers\" and \"new costumers\". Now you have 5 new customers every 95 old customers, and new customers behave very differently so it's an important signal. Why would you delete that? \n\nThat said, you said the interviewer did not know about the data and it was a random dataset from Kaggle. That's a very shitty interviewer/interview.",
          "score": 9,
          "created_utc": "2026-02-19 17:52:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o694xgq",
          "author": "Gilchester",
          "text": "From what you've said, the only thing I can see maybe being a factor is you didn't describe the assumptions needed for your missing approach to work. What does that approach need to be valid? Under what circumstances could it give bad results? As an interviewer, I'd like the hear you describe your thoughts there even it didnt xchange your code",
          "score": 4,
          "created_utc": "2026-02-19 15:17:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o699xrw",
              "author": "quite--average",
              "text": "Thanks for this, I definitely missed this.",
              "score": 1,
              "created_utc": "2026-02-19 15:42:35",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o69boil",
                  "author": "Gilchester",
                  "text": "Your welcome! But to be clear I have no idea if this made the difference; id generally consider this a nice to have not a need to have",
                  "score": 1,
                  "created_utc": "2026-02-19 15:51:02",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o69k7fw",
          "author": "Lady_Data_Scientist",
          "text": "Did you jump right into EDA and model building, or did you ask any clarifying questions? While you were going thorugh EDA, did you ask any questions? This is usually the biggest (and most common) misstep during interviews. If you were on the job, very rarely would you ever jump right into a task or project without making sure you understood what the goal was, verified your assumptions, etc. Even just restating what the interviewer is asking you to do and articulating your assumptions and why you are solving the problem the way you are is important. ",
          "score": 5,
          "created_utc": "2026-02-19 16:32:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6928lz",
          "author": "phoundlvr",
          "text": "First off, what level is this? Junior DS, DS, Senior, Staff? It matters a lot. \n\nThere is nothing that strikes me as wrong, but if you’re using XGBoost then there might be value in the >99% missing data. I’d consider the context of those variables. Worst case, if there is no value then XGBoost won’t split. \n\nDid you do any hyperparameter tuning? Did you cross validate that tuning? How did you handle the train test split?",
          "score": 3,
          "created_utc": "2026-02-19 15:03:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o693gm9",
              "author": "quite--average",
              "text": "This was Senior role and I did not do HP tuning. I said I’d ideally handle train test split by time to test for out of time validation (common in my field) but since we do not have a time column I’ll just stick to 80-20 stratified split.\n\nAlso I edited the post:\n\nAs a measure of variable reduction, I also dropped a bunch of columns that had greater than 95% of same values (constant) stating that they may not have much variance, and if I have more time I’d revisit the 95% threshold and look into the columns that were being dropped. Maybe this was a poor technique? But we use it at work so I learnt there",
              "score": 0,
              "created_utc": "2026-02-19 15:10:05",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o696g5i",
                  "author": "phoundlvr",
                  "text": "In the case of tree based algorithms… you can just throw shit at them. If it isn’t a constant vector it may provide value. I’d tune the trees to minimize overfitting before I dropped anything for arbitrary, non-data driven reasons. \n\nWith context about the modeling problem you *should* exclude some variables - think data leakage, etc.\n\nTruthfully, if you interviewed for a senior role on my team and didn’t do any cross validated hyperparameter tuning, I’d fail you.",
                  "score": 5,
                  "created_utc": "2026-02-19 15:25:15",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6adb8x",
          "author": "WhosaWhatsa",
          "text": "As important as this interview was to you, interviews often do not include the due diligence that is proportional to its importance for the interviewee.\n\nThere could have been a hundred reasons and only four of them fair that they didn't hire you.",
          "score": 2,
          "created_utc": "2026-02-19 18:50:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6b9fdk",
          "author": "24BitEraMan",
          "text": "My flag went up when you didn’t ask what the purpose and intent are. Are we doing inference or prediction? What type of business problem is this and what if any limitations of the data collection process. Plus a big one for me is what is our KPI? What are we measuring here? \n\nWe don’t bring value in doing really basic EDA and applying a standard out of the box model. We bring domain expertise, intuition when you spend all day looking at data and an ability to translate business or product problems into answerable insights via the data to help decision makers.\n\nI also need an explanation why you jumped straight to XGBoost? Simple models often perform just as well. To me we always need a justified reason for jumping to more complicated less interpretable models. This is personally a red flag for me because more complicated does not mean better, and all models have trade offs and people who jump to the most complicated model often have a blind spot for trade offs in our models.\n\nI don’t think you did anything wrong, but you didn’t clear the bar IMO and it seems like they agreed. These technical interviews should always be a back and forth not a code the solution then talk.\n",
          "score": 2,
          "created_utc": "2026-02-19 21:25:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6cqrsy",
          "author": "mastersbet",
          "text": "The biggest issue with these kind of interviews is that the interviewer has seen this data many times and they know the correct solution. They assume that the interviewee would just jump in, do some quick EDA and quickly find the peculiarities in the data and do the modeling in a 45 mins interview.\nThis is not how this would work in any real world scenario, you have to have substantial business knowledge, data familiarity and understanding of the exact problem they are trying to solve before proceeding with the modeling.",
          "score": 2,
          "created_utc": "2026-02-20 02:28:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6crlyw",
              "author": "quite--average",
              "text": "\nI felt the same way. I’m not sure how I’m supposed to extract meaningful insights and perform feature engineering in just a few minutes of looking at the data. But I try not to dwell on it too much, because that’s how the job market is these days, and you have to play the game.",
              "score": 1,
              "created_utc": "2026-02-20 02:33:55",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o691eyu",
          "author": "Elegant-Pie6486",
          "text": "How many observations did the dataset have?",
          "score": 1,
          "created_utc": "2026-02-19 14:59:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6925ur",
              "author": "quite--average",
              "text": "I believe about 60K.",
              "score": 1,
              "created_utc": "2026-02-19 15:03:23",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o692l6s",
                  "author": "Elegant-Pie6486",
                  "text": "99% missing may have been powerful features. Depending on the fields and how the data is pulled together missing can mean an event never happened, so if it was a credit risk model knowing \"months since last bankruptcy\" is not missing is very powerful.",
                  "score": 9,
                  "created_utc": "2026-02-19 15:05:35",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o69tb67",
          "author": "Interesting-Speed335",
          "text": "Sorry for joining in without any valuable input, but could you please give me some insights about where I can find learning materials on that subject matter? Thanks a lot in advance!",
          "score": 1,
          "created_utc": "2026-02-19 17:15:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o692cbp",
          "author": "jesusonoro",
          "text": "your approach sounds solid tbh. missing indicators + xgboost native handling is smart. probably came down to how you explained your reasoning or culture fit",
          "score": 1,
          "created_utc": "2026-02-19 15:04:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o69u1i9",
          "author": "InfamousTrouble7993",
          "text": "Common practice is to use LASSO regression or probability based models with model selection criteria like aic or bic. For ml models usually, CV is performed with candidate models for variable selection. Some tree models support feature importance matrices than can be used for variable selection. I think you chose a way that works, but is not systematic",
          "score": -2,
          "created_utc": "2026-02-19 17:19:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6a1gp5",
              "author": "PaddingCompression",
              "text": "Tree based models implicitly do lasso-like feature selection.  They just don't use the variable unless it is important enough.  No need to do an explicit selection process.",
              "score": 6,
              "created_utc": "2026-02-19 17:54:51",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6bcymg",
                  "author": "InfamousTrouble7993",
                  "text": "ah thank you, I didnt know that!",
                  "score": 1,
                  "created_utc": "2026-02-19 21:42:47",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1r53jy3",
      "title": "Best technique for training models on a sample of data?",
      "subreddit": "datascience",
      "url": "https://www.reddit.com/r/datascience/comments/1r53jy3/best_technique_for_training_models_on_a_sample_of/",
      "author": "RobertWF_47",
      "created_utc": "2026-02-15 02:54:52",
      "score": 39,
      "num_comments": 25,
      "upvote_ratio": 0.89,
      "text": "Due to memory limits on my work computer I'm unable to train machine learning models on our entire analysis dataset. Given my data is highly imbalanced I'm under-sampling from the majority class of the binary outcome. \n\nWhat is the proper method to train ML models on sampled data with cross-validation and holdout data?\n\nAfter training on my under-sampled data should I do a final test on a portion of \"unsampled data\" to choose the best ML model?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/datascience/comments/1r53jy3/best_technique_for_training_models_on_a_sample_of/",
      "domain": "self.datascience",
      "is_self": true,
      "comments": [
        {
          "id": "o5h69oy",
          "author": "AccordingWeight6019",
          "text": "Key rule: only sample the training data, never validation or test data. Split first, keep validation and holdout sets in the original imbalanced distribution, then apply under sampling inside each CV training fold. Select models based on performance on the untouched validation data, and do the final evaluation once on a fully unsampled holdout set. ",
          "score": 34,
          "created_utc": "2026-02-15 08:17:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5kgvut",
              "author": "Specialist-Gur-601",
              "text": "Depends on the situation. What you say is true when you consider each datapoint to have the same weight. Sometimes this is not true, a false positive can be much more costly than a false negative, or vice versa.\n\nIdeally you would want to factor this with sample weights and adjusted metrics (F-beta for instance), but if somehow you are restrained by memory or compute time, undersampling, even the test set, can be the most practical solution.",
              "score": 5,
              "created_utc": "2026-02-15 20:34:56",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5nqlpt",
                  "author": "AccordingWeight6019",
                  "text": "That’s a fair point. If memory or compute constraints are severe, under sampling the test set can be practical, but it changes what your metrics actually measure. If you do that, make sure to report that the evaluation reflects the sampled distribution and, if possible, complement it with weighted metrics or approximate evaluation on a subset of the full distribution. This way, you at least understand how performance might differ in the real world class balance. ",
                  "score": 1,
                  "created_utc": "2026-02-16 10:02:32",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5g43gs",
          "author": "TheTresStateArea",
          "text": "Your final test needs to be on unsampled data.",
          "score": 22,
          "created_utc": "2026-02-15 02:59:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5g8wcz",
              "author": "RobertWF_47",
              "text": "Presumably not on each of the CV testing folds but on the holdout dataset?",
              "score": 3,
              "created_utc": "2026-02-15 03:32:57",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5gd3m0",
                  "author": "TheTresStateArea",
                  "text": "Ultimately your model lives and she's on real world application, so yes the holdout.",
                  "score": 11,
                  "created_utc": "2026-02-15 04:03:41",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5hkogt",
          "author": "patternpeeker",
          "text": "keep the sampling inside each cv fold, not before the split. under-sample only the training portion, then validate on untouched data with the real class imbalance. also keep a final holdout with the original distribution and use it once at the end. otherwise your metrics will look better than reality.",
          "score": 4,
          "created_utc": "2026-02-15 10:36:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5i0l9a",
          "author": "Ty4Readin",
          "text": "As a general rule of thumb, undersampling any class is NOT a good idea. It almost always does worse in practice if you are using the correct loss function/evaluation metrics.\n\nBut, if you are going to do it, then you should only ever do it on the training dataset, never the validation set or test set.\n\nI think there are 2 better solutions for your situation:\n\n1. Subsample the entire dataset (not just one class)\n\n2. Use a model that can support training from disk. For example neural networks are very easy to train any dataset size due to batch loading. I think there are also some implementations for other models to support similar as well.\n\n\nOne other possible option is to undersample one class, but weight it higher in the loss to counter the undersampling. But I would treat this as a hyperparameter and see if it even performs any better than just subsampling the entire dataset.",
          "score": 4,
          "created_utc": "2026-02-15 12:55:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5k737c",
              "author": "RobertWF_47",
              "text": "I'm ok with predicted probabilities being inaccurate due to undersampling, as long as I can make reasonable predictions of the outcome class (0/1) by selecting a threshold. \n\nIf you're saying undersampling of the training data will produce worse predictions then I may have to reconsider undersampling.",
              "score": 1,
              "created_utc": "2026-02-15 19:44:35",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5kjriy",
                  "author": "Ty4Readin",
                  "text": "Undersampling is likely to produce worse in multiple regards, including the ordering of highest risk samples with a threshold.\n\nAs a general rule, my default be not to over or undersample any class.\n\nIf you are curious, you can treat it as a hyperparameter and see which performs better in CV. Just make sure your validation and test sets are not undersampled at all.",
                  "score": 5,
                  "created_utc": "2026-02-15 20:49:59",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5hscp5",
          "author": "[deleted]",
          "text": "If you care about the accuracy of your predicted probabilities, undersampling or oversampling will affect the accuracy of your predicted probabilities. You’ll need to perform post-training model calibration to correct this issue.",
          "score": 3,
          "created_utc": "2026-02-15 11:47:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5k5xib",
              "author": "RobertWF_47",
              "text": "I'm willing to have inaccurate predicted probabilities as long as rank is preserved for selecting the best threshold for predicting the 0/1 class. In that case is it ok to undersample?",
              "score": 0,
              "created_utc": "2026-02-15 19:38:44",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5lhrxu",
          "author": "Ghost-Rider_117",
          "text": "yeah I've dealt with this before - stratified sampling is definitely your friend here. make sure your sample reflects the class distribution properly, then do your train/test split on that sampled data. one thing that helped me was using SMOTE or other synthetic sampling techniques after you split, so you're not leaking info between train and validation sets. good luck!",
          "score": 3,
          "created_utc": "2026-02-15 23:54:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5hvdnu",
          "author": "pppeer",
          "text": "In addition to what is mentioned, probably also good to approach your problem as a scoring problem rather than a classification problem and use metrics such as AUC. At minimum, if you are making hard labeling decisions or expecting a probability rather than a score, calibrate the models on the unsampled data.",
          "score": 2,
          "created_utc": "2026-02-15 12:13:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5l70pt",
          "author": "giridharaddagalla",
          "text": "Hey, totally get the memory constraints, that's a common pain point! For under sampling imbalanced data with CV, a good approach is to perform the sampling \\*within\\* each fold of your cross validation. This way, your validation sets remain representative of the real world distribution (or at least the original imbalanced distribution), and your training sets get the balanced sampling. For your final test, yeah, testing on a portion of \\*unsampled\\* data is definitely the way to go. It gives you the most realistic performance estimate of how your chosen model will fare on unseen, real data. Some folks even do a weighted evaluation on that holdout set to account for the original class imbalance, which can be super insightful.",
          "score": 2,
          "created_utc": "2026-02-15 22:51:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5pf9no",
          "author": "RB_7",
          "text": "There’s lots of sampling discussion here, which is fine, but if you’re just doing log reg / xgboost then it would be a lot simpler and more robust to just write a training loop that batches through your dataset from disk, loading a bit into memory at a time, updating the weights, and then loading the next batch. \n\nThen you can use the whole dataset, and not worry at all about sampling routines.",
          "score": 2,
          "created_utc": "2026-02-16 16:23:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5q0w5q",
              "author": "RobertWF_47",
              "text": "That's a possibility I should consider.\n\nHowever my data is quite scarce: 76,000 events vs. 31M non-events for the outcome I'm predicting. Plus many of the predictors are extremely imbalanced as well. My worry is running many ML models on small subsets does not return the same robust predictions as an all-data model, but rather an average of many sub-optimal models.",
              "score": 1,
              "created_utc": "2026-02-16 18:04:14",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5t03mj",
                  "author": "Wellwisher513",
                  "text": "If you're using xgboost, is recommend looking into using a polars lazy dataframe. I used it for a binary classification problem last week and it worked quite well, letting me train on roughly a terabyte of data in a cluster with 700gb of ram. It's a little finicky and you need your packages to be up to date, but once I figured it out, it worked great. Worth noting that automl doesn't support it, you'll have to use optuna for any tuning. \n\n\nIf you're using any other model type though, that might not be your best bet, as polars support is still pretty new. \n\n\nAs for over/under sampling, it might be worth looking into using weights.",
                  "score": 2,
                  "created_utc": "2026-02-17 03:33:19",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o5q535p",
                  "author": "RB_7",
                  "text": "I mean, think about how SDG works and ask yourself if batching from disk is any different.",
                  "score": 1,
                  "created_utc": "2026-02-16 18:23:21",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5od08x",
          "author": "VelvetCactus01",
          "text": "Use stratified sampling to preserve class distribution. Train on your sample, validate on holdout, test final on untouched data. That's the framework.",
          "score": 1,
          "created_utc": "2026-02-16 13:05:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5i5joj",
          "author": "PublicViolinist2338",
          "text": "It depends a lot on your situation, are you training neural networks or using something based on the Scikit API? In any case train/val/test splitting is crucial, but the implementation depends",
          "score": 1,
          "created_utc": "2026-02-15 13:29:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5jm7m6",
              "author": "RobertWF_47",
              "text": "Probably not neural networks - penalized logistic regression, xgboost, maybe SVM.",
              "score": 1,
              "created_utc": "2026-02-15 18:02:23",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5jui8h",
                  "author": "PublicViolinist2338",
                  "text": "Alright, it's actually not trivial to implement in that case. XGBoost and similar libraries typically want you to load the whole train data into memory before you call .fit. They have a solution: [https://xgboost.readthedocs.io/en/stable/tutorials/external\\_memory.html](https://xgboost.readthedocs.io/en/stable/tutorials/external_memory.html), but I am not sure about other scikit libraries\n\n",
                  "score": 2,
                  "created_utc": "2026-02-15 18:42:26",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1r8o0n4",
      "title": "Toronto active data science related job openings numbers - pretty discouraging - how is it in your city?",
      "subreddit": "datascience",
      "url": "https://www.reddit.com/r/datascience/comments/1r8o0n4/toronto_active_data_science_related_job_openings/",
      "author": "neuro-psych-amateur",
      "created_utc": "2026-02-19 03:11:37",
      "score": 27,
      "num_comments": 17,
      "upvote_ratio": 0.92,
      "text": "I’m feeling pretty discouraged about the data science job market in Toronto.\n\nI built a scraper and pulled active roles from SimplyHired + LinkedIn. I was logged into LinkedIn while scraping, so these are not just promoted posts.\n\nMy search keywords were mainly data scientist and data analyst, but a lot of other roles show up under those searches, so that’s why the results include other job families too.\n\nI capped scraping at 18 pages per site (LinkedIn + SimplyHired), because after that the titles get even less relevant.\n\nTotal unique active positions: **617**\n\nBreakdown of main relevant categories:\n\n* Data analyst related: **233**\n* Data scientist related: **124**\n* Machine learning engineer related: **58**\n* Business intelligence specialist: **41**\n* Data engineer: **37**\n* Data science / ML researcher: **33**\n* Analytics engineer: **11**\n* Data associate: **9**\n\nOther titles were hard to categorize: GenAI consultants, biostatistician, stats & analytics software engineer, software engineer (ML), pricing analytics architect, etc.\n\nMy scraper is obviously not perfect. Some roles were likely missed. Some might be on Indeed or Glassdoor and not show up on LinkedIn or SimplyHired, although in my experience most roles get cross-posted. So let's take the 600 and double it. That’s \\~1,200 active DS / ML / DA related roles in the GTA.\n\nShort-term contracts usually don’t get posted like this. Recruiters reach out directly. So let’s add another 500 active short-term contracts floating around. We still end up with less than 2K active positions.\n\nI assume there are thousands, if not tens of thousands, of people right now applying for DS / ML roles here. That ratio alone explains why even getting an interview feels hard.\n\nFor context, companies that had noticeably more active roles in my list included: Allstate, Amazon Development Centre Canada ULC, Atlantis IT Group, Aviva, Canadian Tire Corporation, Capital One, CPP Investments, Deloitte, EvenUp, Keystone Recruitment, Lyft, most banks - TD, RBC, BMO, Scotia, StackAdapt, Rakuten Kobo.\n\nThere are a lot of other companies in my list, but most have only one active DS related position.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/datascience/comments/1r8o0n4/toronto_active_data_science_related_job_openings/",
      "domain": "self.datascience",
      "is_self": true,
      "comments": [
        {
          "id": "o672677",
          "author": "Single_Vacation427",
          "text": "Why do you think that 600+ open positions is not good exactly?\n\nThere aren't \"tens of thousands\" (per you comment) people in Toronto looking for data science positions.",
          "score": 22,
          "created_utc": "2026-02-19 05:47:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o689h1i",
              "author": "neuro-psych-amateur",
              "text": "There are. My 600 postings include data analyst, business intelligence analyst, data scientist, machine learning engineer, statistical analyst, data reporting analyst, etc. There are definitely thousands or tens of thousands of people in the GTA applying for such jobs. Plus a lot of people out of the GTA apply.",
              "score": 4,
              "created_utc": "2026-02-19 12:14:18",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o6bijfy",
              "author": "pimmen89",
              "text": "Most positions are also not advertised, in Sweden the ratio is usually 4:1 of positions being filled by recommendations or headhunters vs. those filled by responders to an advert. So most likely there’s thousands of open positions.\n\nNow, is this market worse than the unsustainable, money showering overhiring spree circa 2019 where a man couldn’t walk down the street discussing SQL without being harassed with a job offer because every company had just borrowed a batch of free money at almost no interest? Yes, yes it is indeed worse now. Does that mean we have it rough now compared to other professions have had it for the past decades? No, not even close.",
              "score": 1,
              "created_utc": "2026-02-19 22:10:42",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o66oj2h",
          "author": "Jebedebah",
          "text": "“Tens of thousands” - why would you think this? DS is fairly niche field. Per the city of Toronto (link doesn’t want to work on mobile) there were ~100k SWEs and “programmers” and ~126k “computer support and database systems” people employed in Toronto in 2022. So maybe say ML and DS roll up somewhere into that ~226k person pool and constitute a small fraction of it. So, ~2,000 postings would be >1% of total positions (since this 226k pool is a lot broader) listed as openings. That doesn’t seem like a surprising percentage to me.\n\nLink below, sorry it’s ugly:\n\nhttps://www.toronto.ca/business-economy/industry-sector-support/technology/#:~:text=Share,highest%20growth%20in%20North%20America.",
          "score": 11,
          "created_utc": "2026-02-19 04:10:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o66pi62",
              "author": "neuro-psych-amateur",
              "text": "Because my positions include data analyst, as I mentioned. And business intelligence analyst. Data scientist, machine learning engineer, statistical modelling analyst, analytics engineer. Etc.\nSo I found only 600 positions in total for all of those titles. Then I am assuming I am missing 1.4K positions, which might not be the case at all.\nI'm pretty sure there are tens of thousands of people in the GTA looking for analyst type jobs.",
              "score": 0,
              "created_utc": "2026-02-19 04:16:27",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o68zj41",
                  "author": "Jebedebah",
                  "text": "I get that, but I think it’s fair to assume all of these roles would get rolled up into a minority subset of the 226k bucket reported in that link. From that perspective I think that a 1-2% opening ratio at any given time isn’t that bad, especially if you accept the Fed’s full employment estimate of a ~4% secular unemployment rate (though that’s industry agnostic ofc).\n\nI guess this is just a different way of estimating what a reasonable number of postings would be without needing to guess at the number of current job seekers.",
                  "score": 1,
                  "created_utc": "2026-02-19 14:49:49",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o66lokv",
          "author": "ViamnotacrookV",
          "text": "Data science _what_?\n\n“Data science” the term means nothing anymore and companies have caught on.",
          "score": 10,
          "created_utc": "2026-02-19 03:51:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o676uhq",
          "author": "AccordingWeight6019",
          "text": "This honestly matches what many people are seeing. The market isn’t dead, just much tighter and more specialized. fewer pure DS roles, more competition per posting, and a shift toward data engineering, analytics, and production focused ML work. It’s less about fewer jobs overall and more about fewer entry points.\n\n",
          "score": 2,
          "created_utc": "2026-02-19 06:25:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6d5kfp",
          "author": "ConnectKale",
          "text": "Well they are bad and good.  Good if you want to work for a DoD contractor. Terrible if you don’t.",
          "score": 1,
          "created_utc": "2026-02-20 04:03:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o680vzc",
          "author": "GoBuffaloes",
          "text": "One posting doesn't necessarily mean one role, large companies will have one evergreen posting for the job title but may be looking to hire several people at any given time ",
          "score": 1,
          "created_utc": "2026-02-19 11:05:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o66kczy",
          "author": "QianLu",
          "text": "Let's start at the beginning. Is Toronto even known as a tech hub?",
          "score": -8,
          "created_utc": "2026-02-19 03:43:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o66ms9p",
              "author": "neuro-psych-amateur",
              "text": "Definitely. In Canada it has the most tech jobs. Waterloo also has some tech jobs, but it's a much smaller city.",
              "score": 15,
              "created_utc": "2026-02-19 03:58:42",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6772c0",
                  "author": "dash_44",
                  "text": "How is Vancouver for tech?",
                  "score": 1,
                  "created_utc": "2026-02-19 06:27:25",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1r40rd2",
      "title": "Where do you see HR/People Analytics evolving over the next 5 years?",
      "subreddit": "datascience",
      "url": "https://www.reddit.com/r/datascience/comments/1r40rd2/where_do_you_see_hrpeople_analytics_evolving_over/",
      "author": "Proof_Wrap_2150",
      "created_utc": "2026-02-13 20:50:35",
      "score": 25,
      "num_comments": 13,
      "upvote_ratio": 0.81,
      "text": "Curious how practitioners see the field shifting, particularly around:\n\n* AI integration\n* Predictive workforce modeling\n* Skills-based org design\n* Ethical boundaries\n* Data ownership changes\n* HR decision automation\n\nWhat capabilities do you think will define leading functions going forward?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/datascience/comments/1r40rd2/where_do_you_see_hrpeople_analytics_evolving_over/",
      "domain": "self.datascience",
      "is_self": true,
      "comments": [
        {
          "id": "o58b8wi",
          "author": "JamesDaquiri",
          "text": "Probably a post better suited for r/humanresources as I can’t image there are many PA professionals here. Probably a lot of people who think HR are evil puppet masters or something. \n\nTo your post, it’s just impossible to say. Things are evolving quickly- so I don’t have any input on tools or methodology changes. \n\nBut I will say (and this applies to most domains), being able to show your value and communicate strategic insights that are actually incorporated is and will be a make or break for the field. You have to be technical, persuasive, and privy to building and maintaining professional relationships if you want to thrive in this niche. Being a people-person with data skills and a background in the domain (HRM, IO psych) is what companies are after right now, and I don’t see that changing.\n\nEdit: also, I don’t think automated HR decision making should now nor ever go beyond algorithmic resume parsing and pre-hire assessment scoring. With how much red tape (and rightfully so) exists in labor practices, the “human-in-the-loop” aspect of automation/AI is more crucial than other domains.",
          "score": 22,
          "created_utc": "2026-02-13 20:57:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o59aiym",
              "author": "Proof_Wrap_2150",
              "text": "Thank you for your response!",
              "score": 1,
              "created_utc": "2026-02-14 00:06:17",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o58bj5d",
          "author": "Trick-Interaction396",
          "text": "I think you mean Clanker Analytics",
          "score": 24,
          "created_utc": "2026-02-13 20:58:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o58d8r6",
          "author": "coconut48282736",
          "text": "I work as a DS in people analytics at a F500. As far as I see it, I don’t see a roadmap for automation of decisions as a result of AI, but there is a clear road to use DS and AI to recommend, facilitate, and create self serve data engines for HR leaders. I’m an IC though, not a manager.\n\nThe current path I see for 5 years is less human interaction needed to make data pulls/aggregations. More emphasis on creating generalizable tools that let HR leaders make all those decisions themselves without needed interaction from a DS. DS will likely focus on more complex experimentation and modeling.",
          "score": 6,
          "created_utc": "2026-02-13 21:07:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5k3q8j",
              "author": "jgmz-",
              "text": "Was also a DS in people analytics for sometime. I agree with your last point - internal audience segmentation and predictive modeling will continue to be common applications in the domain. I think in 5 years, decision sciences as a whole will become more valuable after AI has solved reporting (or at least made more accessible) for the simpler analysis pipelines.",
              "score": 1,
              "created_utc": "2026-02-15 19:27:38",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5d5ks7",
          "author": "AIAlchemy",
          "text": "There are 2 parallel trends because of AI. 1) Like any other functions HR managers become more self sufficient with pulling data and making analysis without relying on an analyst or data scientist. They can also do a lot more analysis and faster than before. However not everyone is qualified to interpret the data. 2) The workforce is changing at a rapid pace, and what skills used to matter (technical) don't matter as much with the help of AI but judgment and people skills are still in limited quantity. So HR has a critical role to play in rethinking how the workforce needs to evolve (hiring, training performance reviews....)",
          "score": 2,
          "created_utc": "2026-02-14 16:53:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5a9gg8",
          "author": "jdnhansen",
          "text": "Imagine that all HR teams have cheap access to coding skills and interns. In that world, you would value people who can effectively made good decisions about what to do with an abundance of coding/intern labor. I expect somewhat smaller HR teams with more experienced practitioners. On the Analytics side, you want people with a mix of tech skills, industry expertise, and communication/collaboration skills. \n\nI lead a small people science team, and we are using AI to build new solutions in-house. It’s mostly AI assistance with coding (eg R/Python/SQL/terminal), but we just brought on board a new AI agent solution, and that seems very powerful, too.",
          "score": 1,
          "created_utc": "2026-02-14 03:48:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5hw33s",
          "author": "pppeer",
          "text": "This is a broad question, but recruitment is definitely a priority areas such as defense, energy and utility market and other understaffed markets. Another one is agents and workflows for HR services, lots of opportunities for streamliming and optimizing all people and employee related workflows through centralized platforms, with AI embedded. Finally, the HR area is rife with all forms of knowlede portals/bass, so in the short term there is a lot of appetite for RAG-type applications (\"what are my company holidays?\" \"Can I do company sponsored volunteering work? \" etc).",
          "score": 1,
          "created_utc": "2026-02-15 12:19:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5mkkw6",
          "author": "DFW_BjornFree",
          "text": "Surprised you didn't mention anything about workplace monitoring or behavioral analytics.\n\n\nPA at my employer builds internal employee segments based upon user data collected from services like MS365, github, keys typed, and then other stuff like badge in / out, working extra hours, etc. \n\n\nBasically they determine what is normal for a certain role at a certain level because they have tons of employees at that level and they can map what good looks like to annual review ratings. Sure reviews don't map perfectly but there is correlation and they essentially use it to flag people who compared to their peers, don't appear to be very productive and this plays into giving feedback to organizational leaders and is part of what helps justify a PIP (but it isn't want triggers or causes a pip in itself)\n\n\nA persons manager isn't likely high enough to know many details but they will get feedback from their orgs leadership that it seems like xyz person isn't working much and it's basically the managers job to explain why / deffend it or else agree that the person has been slacking. \n\n\nPersonally, I actually kind of like it but that's because I have no issue working while I am at work and we all know what it feels like to have someone that both doesn't pull their weight and then also doesn't try. \n\n\nAt some point, you're too senior for some of the things to apply but that's where employee segments come into play.\n\n\nThey do care a lot though about time in the office though and managers are asked to keep notes in the system if they gave an employee special permission like being able to leave before 3 to pick up a kid and then working for a bit once they're home. In any case, they just identify things where manager input is needed to justify so if you're on good terms with leadership you're fine even if the system thinks you're underperforming however if you're on bad terms with them and you get flagged for slacking you could be screwed.",
          "score": 1,
          "created_utc": "2026-02-16 04:01:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5qeht5",
          "author": "Key-Boat-7519",
          "text": "Leading functions are going to be the ones that own fewer, higher‑stakes questions end to end, not the ones with the fanciest models. Think “who we hire, how we pay, who we keep” with clear financial impact, ethics guardrails, and change ownership. AI will mostly be workflow and decision support: nudging managers, surfacing risk, and automating boring admin, while humans arbitrate tradeoffs. Real edge will be in stitching data across HRIS, ATS, L&D, and equity/comp tools like Workday, Greenhouse, and Cake Equity so you can model scenarios and show the CFO hard tradeoffs, not just dashboards. That ability to connect decisions to business outcomes will define the leaders.",
          "score": 1,
          "created_utc": "2026-02-16 19:06:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ubzkp",
          "author": "Helpful_ruben",
          "text": "Error generating reply.",
          "score": 1,
          "created_utc": "2026-02-17 10:12:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5d1e3a",
          "author": "Cheap_Scientist6984",
          "text": "They will get better at hiring who they want and the office will start to look like the Bunker in Fallout where everyone is microchipped to be a super agreeable woman.  ",
          "score": 0,
          "created_utc": "2026-02-14 16:32:17",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r3zq14",
      "title": "Mock interviews",
      "subreddit": "datascience",
      "url": "https://www.reddit.com/r/datascience/comments/1r3zq14/mock_interviews/",
      "author": "No-Mud4063",
      "created_utc": "2026-02-13 20:10:21",
      "score": 10,
      "num_comments": 8,
      "upvote_ratio": 0.92,
      "text": "Any other platform like prepfully for mock interviews from faang ds? Prepfully charges a lot. Any other place?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/datascience/comments/1r3zq14/mock_interviews/",
      "domain": "self.datascience",
      "is_self": true,
      "comments": [
        {
          "id": "o5bxzbg",
          "author": "polarkyle19",
          "text": "I would like to know if you find any",
          "score": 7,
          "created_utc": "2026-02-14 12:44:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o582phk",
          "author": "Forsaken-File9993",
          "text": "pramp is free option but quality can be inconsistent, also check if your university has career services that do mock interviews",
          "score": 2,
          "created_utc": "2026-02-13 20:14:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5g1i16",
          "author": "[deleted]",
          "text": "Stratascratch.",
          "score": 2,
          "created_utc": "2026-02-15 02:41:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5g1ybu",
              "author": "No-Mud4063",
              "text": "for mock interviews? ",
              "score": 0,
              "created_utc": "2026-02-15 02:44:28",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5g27fg",
                  "author": "[deleted]",
                  "text": "Yess!! It's actually one of the best one. And ask you questions based on the company you chose.",
                  "score": 1,
                  "created_utc": "2026-02-15 02:46:14",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1r60jl0",
      "title": "Weekly Entering & Transitioning - Thread 16 Feb, 2026 - 23 Feb, 2026",
      "subreddit": "datascience",
      "url": "https://www.reddit.com/r/datascience/comments/1r60jl0/weekly_entering_transitioning_thread_16_feb_2026/",
      "author": "AutoModerator",
      "created_utc": "2026-02-16 05:01:10",
      "score": 10,
      "num_comments": 14,
      "upvote_ratio": 0.92,
      "text": " \n\nWelcome to this week's entering & transitioning thread! This thread is for any questions about getting started, studying, or transitioning into the data science field. Topics include:\n\n* Learning resources (e.g. books, tutorials, videos)\n* Traditional education (e.g. schools, degrees, electives)\n* Alternative education (e.g. online courses, bootcamps)\n* Job search questions (e.g. resumes, applying, career prospects)\n* Elementary questions (e.g. where to start, what next)\n\nWhile you wait for answers from the community, check out the [FAQ](https://www.reddit.com/r/datascience/wiki/frequently-asked-questions) and Resources pages on our wiki. You can also search for answers in [past weekly threads](https://www.reddit.com/r/datascience/search?q=weekly%20thread&restrict_sr=1&sort=new).",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/datascience/comments/1r60jl0/weekly_entering_transitioning_thread_16_feb_2026/",
      "domain": "self.datascience",
      "is_self": true,
      "comments": [
        {
          "id": "o5nofgz",
          "author": "AccordingWeight6019",
          "text": "If you’re transitioning into data science, one useful focus is learning the full workflow rather than stacking courses. Try to get comfortable with: problem framing → data cleaning → simple modeling → evaluation → communicating results. Many people over index on advanced models when most real work is messy data and decision support.\n\nA good progression is:\n\n* statistics + SQL + Python fundamentals\n* exploratory analysis and visualization\n* classical ML (regression, trees, validation)\n* one or two end to end portfolio projects with clear business questions\n\nHiring tends to reward evidence that you can take ambiguous data and produce actionable insight more than knowledge of specific algorithms.",
          "score": 4,
          "created_utc": "2026-02-16 09:42:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5odyg0",
              "author": "Due-Experience-382",
              "text": "how important is it to know the math behind the ML models, in detail?\n\nI'm learning Linear Regression but in great detail, and the professor is going deeply into the mathematics behind it, it is interesting, no doubt, but how does it change a perspective from one who has no mathematical knowledge with someone who has learned in great detail?",
              "score": 1,
              "created_utc": "2026-02-16 13:11:18",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5r19st",
          "author": "ddp26",
          "text": "Claude Code is pretty slick for data science. Who's using it? Is it helpful?",
          "score": 2,
          "created_utc": "2026-02-16 20:57:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5nizfy",
          "author": "PublicViolinist2338",
          "text": "I have an opportunity to pursue a PhD in data science. In the long-term, is it worth it in 2026 to get the extra expertise, or should I try to find a job directly?",
          "score": 1,
          "created_utc": "2026-02-16 08:50:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5nv1e9",
              "author": "pm_me_your_smth",
              "text": "A phd is a huge commitment, both effort and time wise. You need to be pretty invested in it (for whatever personal reason as long as it's solid). If you're doing it only to get a job later, then I'd recommend against it.",
              "score": 3,
              "created_utc": "2026-02-16 10:43:53",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o5q84ow",
              "author": "2apple-pie2",
              "text": "Do not get a PhD just to get a job. Especially in a field with an unknown future like DS\n\nIf you want to get a PhD, pursue something you are passionate about first and foremost. A lot can change in 5-6 years and don’t expect a job/professorship waiting for you at the end.",
              "score": 3,
              "created_utc": "2026-02-16 18:37:09",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5pta0z",
          "author": "Mathblasta",
          "text": "I'm about to graduate with a DS degree. It's been a lot more of a survey/broad overview than an in depth degree. I'm hoping to get started as a data analyst. \n\nRight now I feel like I have a decent grasp of Python and SQL, and after 10 years in ops management, a pretty good understanding of business processes. \n\nWhat I'd like to get more understanding of is data cleaning and processing. Are there any good courses/resources y'all could recommend for that?\n\nClasses now are focused on data warehousing and ML. What other skills should I make sure to have a grasp of to improve my chances of being able to find a job when I graduate?",
          "score": 1,
          "created_utc": "2026-02-16 17:28:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5snc4y",
          "author": "Worldly-Relation-108",
          "text": "Is there any api that can get hotel prices in Philippines easily?\n\n",
          "score": 1,
          "created_utc": "2026-02-17 02:14:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5wf99f",
          "author": "TodayEasy949",
          "text": "Transitioning to data science from web development…\n2 yrs in embedded c, 3 yrs in web development \nTook career break\n\nInterested in data science (not the fancy GenAI, LLM stuff), like to learn the basics and understand the problem before diving into the problem.\nI overthink about whether this is the path I should pursue or get back to web dev, or pursue masters.\n\nProgress so far : read some books on stat intuition like art of statistics, naked statistics. Finished reading and doing the exercises of ISLP. \nAbout to start some exploratory projects in next few days",
          "score": 1,
          "created_utc": "2026-02-17 17:40:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ybvvy",
          "author": "pr36_",
          "text": "In the world of consulting, what would you say is the stronger data science shop: Quantum Black by McKinsey or Simon-Kucher.\n\nI am trying to decide between these two companies and from my research Simon-Kucher is mainly focused on commercial strategy and I’m poised to enter their digital growth branch vs McKinsey that will be a data engineer II role in god knows what industry/capacity. not sure which direction to go and TC is roughly 40k higher at McKinsey and name recognition is obviously much higher.",
          "score": 1,
          "created_utc": "2026-02-17 23:06:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o654c1g",
          "author": "ZenithR9",
          "text": "As a data engineer I'm embarrassed to say I don't really fully grasp what data science is, the last time I checked it was, ok you don't need a warehouse just a lake, and something vaguely about insights from that unstructured data, and mostly python, and some R and SQL.",
          "score": 1,
          "created_utc": "2026-02-18 22:47:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o66vhf1",
          "author": "_hairyberry_",
          "text": "Hey everyone! If anyone is willing to take a look, I'm seeking some feedback on my resume as a DS specializing in demand forecasting. Would really appreciate any advice, as it's been a few years since I've applied anywhere. [Anonymized resume](https://imgur.com/a/UMl7gk7)",
          "score": 1,
          "created_utc": "2026-02-19 04:57:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6a5att",
          "author": "Helpful_ruben",
          "text": "Error generating reply.",
          "score": 1,
          "created_utc": "2026-02-19 18:12:51",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r8cpbn",
      "title": "Loblaws Data Science co-op interview, any advice?",
      "subreddit": "datascience",
      "url": "https://www.reddit.com/r/datascience/comments/1r8cpbn/loblaws_data_science_coop_interview_any_advice/",
      "author": "No-Brilliant6770",
      "created_utc": "2026-02-18 19:28:37",
      "score": 8,
      "num_comments": 10,
      "upvote_ratio": 0.79,
      "text": "just landed a round 1 interview for a Data Science intern/co-op role at loblaw.\n\nit’s 60 mins covering sql, python coding, and general ds concepts. has anyone interviewed with them recently? just tryna figure out if i should be sweating leetcode rn or if it’s more practical pandas/sql manipulation stuff.\n\nwould appreciate any insights on the difficulty or the vibe of the technical screen. ty!",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/datascience/comments/1r8cpbn/loblaws_data_science_coop_interview_any_advice/",
      "domain": "self.datascience",
      "is_self": true,
      "comments": [
        {
          "id": "o63yl7k",
          "author": "Gilchester",
          "text": "Bob Loblaw?",
          "score": 49,
          "created_utc": "2026-02-18 19:32:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o642eq7",
              "author": "Camarupim",
              "text": "Does he still post to his law blog?",
              "score": 12,
              "created_utc": "2026-02-18 19:50:06",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o6425vb",
              "author": "BlueDevilStats",
              "text": "Attorney at law",
              "score": 3,
              "created_utc": "2026-02-18 19:48:58",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o640ny0",
              "author": "No-Brilliant6770",
              "text": "Loblaw, the canadian retail/grocery chain",
              "score": 0,
              "created_utc": "2026-02-18 19:42:09",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o6401uu",
              "author": "Frogad",
              "text": "I assume the Canadian store",
              "score": 0,
              "created_utc": "2026-02-18 19:39:19",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o66h8hi",
              "author": "neuro-psych-amateur",
              "text": "It's a grocery store....",
              "score": -1,
              "created_utc": "2026-02-19 03:24:04",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o640fjq",
          "author": "edcculus",
          "text": "I hear they have a mean law blog",
          "score": 9,
          "created_utc": "2026-02-18 19:41:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o64v6ve",
          "author": "sickomoder",
          "text": "i did once, not explicitly a DS role but for Loblaw digital and the technical was no python at all",
          "score": 3,
          "created_utc": "2026-02-18 22:03:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o69j57f",
          "author": "catsRfriends",
          "text": "Why the fk are all these spam comments upvoted? This is someone early career trying to make the most of an opportunity and all you guys can do is post/upvote useless drivel?\n\nOP DM me, I may know someone who can help.",
          "score": 3,
          "created_utc": "2026-02-19 16:27:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o657kbs",
          "author": "SeaAccomplished441",
          "text": "bob loblaw lobs law bomb",
          "score": 1,
          "created_utc": "2026-02-18 23:03:49",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r4wfu9",
      "title": "Outside the US, What is the avg salary someone can get in like Canada, UK, Germany or other countries? For early level",
      "subreddit": "datascience",
      "url": "https://www.reddit.com/r/datascience/comments/1r4wfu9/outside_the_us_what_is_the_avg_salary_someone_can/",
      "author": "starktonny11",
      "created_utc": "2026-02-14 21:27:48",
      "score": 7,
      "num_comments": 32,
      "upvote_ratio": 0.62,
      "text": "Hi,i was considering to move to different countries for Product/market DS roles. i was wondering for early level how much salary is good or can expect? (If you get paid about 150k in the US), for early level (2-3 Years of experience) \n\nOr you could say top range in this countries for this role",
      "is_original_content": false,
      "link_flair_text": "Career | Europe",
      "permalink": "https://reddit.com/r/datascience/comments/1r4wfu9/outside_the_us_what_is_the_avg_salary_someone_can/",
      "domain": "self.datascience",
      "is_self": true,
      "comments": [
        {
          "id": "o5enwvf",
          "author": "Frogad",
          "text": "I've been looking for DS roles in the UK, granted more entry level but they've basically all been between 30-50k GBP. I don't think you could expect to make 150k after 2-3 years (or the pound equivalent) outside of a couple of companies.",
          "score": 22,
          "created_utc": "2026-02-14 21:35:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5fazja",
              "author": "JSweetieNerd",
              "text": "Average wage in UK is currently around £40k, noone should be accepting less than that for DS. Unfortunately many companies don't know / care and massively undervalue DS.",
              "score": 6,
              "created_utc": "2026-02-14 23:49:23",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5h293b",
                  "author": "[deleted]",
                  "text": "Is it 40k for fresher ok?",
                  "score": 1,
                  "created_utc": "2026-02-15 07:38:05",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o5v4o23",
              "author": "Viveknanduri",
              "text": "That tracks with the market I’ve seen.. I’m 3 years experience and was looking for roles between 60-80k and accepted an offer closer to the ceiling than the floor if that helps",
              "score": 2,
              "created_utc": "2026-02-17 13:43:48",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5vc86p",
                  "author": "Frogad",
                  "text": "Okay, thanks. I wasn't sure if I was just being scammed and lowballed but at least it tracks.",
                  "score": 1,
                  "created_utc": "2026-02-17 14:25:09",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o5eocf9",
              "author": "Mr06506",
              "text": "I'd say 30-50 is very low, but I agree 150k is incredibly unrealistic. It's more than a couple of companies paying that money, but that is absolutely top dollar for the best, most senior candidates.",
              "score": 4,
              "created_utc": "2026-02-14 21:37:50",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5f0oha",
                  "author": "Frogad",
                  "text": "What would you say is a good starting range for UK, I guess I'm seeing stuff like 38k but quite a few lower, but also I am not with 2-3 year experience.",
                  "score": 1,
                  "created_utc": "2026-02-14 22:46:51",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o6259uy",
              "author": "One-Super-For-All",
              "text": "Places like deliveroo pay 80k gbp plus for entry level\n\n\n30k is a joke and I've never seen a salary that low",
              "score": 1,
              "created_utc": "2026-02-18 14:35:38",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6266rl",
                  "author": "Frogad",
                  "text": "Oh, I've literally not seen a single job advertised for 80k ever and I'd have assumed my uni job posting board would be fairly decent. From googling, might be out of date but im struggling to see evidence of these entry level 80k DS jobs at Deliveroo",
                  "score": 0,
                  "created_utc": "2026-02-18 14:40:15",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o5eoccm",
              "author": "starktonny11",
              "text": "Of  course i dint expect 150k but was wondering if there is any chanve of 60-90k pounds",
              "score": 0,
              "created_utc": "2026-02-14 21:37:49",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5etbbm",
                  "author": "Lost_Llama",
                  "text": "after 3 years you could aim for 50-70k roles. 80-120k at around 6/7 years. This is in London. Speciality will also play a factor",
                  "score": 5,
                  "created_utc": "2026-02-14 22:05:00",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o5etn44",
                  "author": "WallyMetropolis",
                  "text": "Consider also the much higher income taxes you'll pay.",
                  "score": 2,
                  "created_utc": "2026-02-14 22:06:51",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5f61cm",
          "author": "Illustrious-Pound266",
          "text": "Canada is actually pretty decent salary wise when compared with the rest of the non-US world. Canadians love to complain about low salaries but that's because they are only comparing them to US salaries.",
          "score": 9,
          "created_utc": "2026-02-14 23:18:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5f8emv",
              "author": "neuro-psych-amateur",
              "text": "We have really high housing costs to average income ratio. Definitely not in all countries people spend such a large proportion of disposable income on housing costs.",
              "score": 7,
              "created_utc": "2026-02-14 23:33:20",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5ke1om",
                  "author": "Specialist-Gur-601",
                  "text": "European who moved to Canada (Toronto core). While average housing cost might seem higher in the major Canadian cities, what you have to understand is that Canadians have much higher standards of living than European.\n\nIn Europe, it is very common to live in a 300 sqft studio when you are living alone, in Canada people consider this as precarious living. And let's not forget about the amenities, gym, swiming pool, sauna, theater ? That's very common in canadian condos, that's unheard of in Europe.\n\nI (6 YoE data scientist) used to make top 10% DS salary in Paris (85k€), I now make barely top 50% DS salary in Toronto (140k CAD), but I save so much more here in Toronto than in Paris. Taxes on wages and investment are lower.\n\nSeriously, for relatively **high paying job**, Canada is far better than Europe. Of course if you make minimum wage, it's better to be in Western Europe than Canada.\n\nAlso, Canadians love house ownership. Every late-20, early-30 are all about that. Those who are owner have bragging rights, the others complain about not being able to afford a family house on a single salary before even reaching 30 years old. They see renting as a shameful thing to pay for.",
                  "score": 7,
                  "created_utc": "2026-02-15 20:20:12",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o5f8ysl",
                  "author": "Illustrious-Pound266",
                  "text": "In most developed countries with decent tech scenes, the cost of living is high. Dublin, Amsterdam, London, Sydney, Munich, etc are all notorious for not only housing costs, but housing availability. ",
                  "score": 1,
                  "created_utc": "2026-02-14 23:36:49",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5epou2",
          "author": "fractorial",
          "text": "You can find increasingly more early level roles in Canada for American companies. These pay pretty well but are quite competitive (170-250 TC in CAD).",
          "score": 6,
          "created_utc": "2026-02-14 21:45:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5tpa8d",
              "author": "_hairyberry_",
              "text": "You mean us-based companies hiring Canadians remote? Do you have some examples?",
              "score": 1,
              "created_utc": "2026-02-17 06:40:19",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5tsl65",
                  "author": "fractorial",
                  "text": "Shopify\n\n\\* https://www.shopify.com/careers/product-data-scientists\\_e09145fa-617d-4746-8245-9481c9b40512?\n\nStripe\n\n\\* [https://stripe.com/jobs/listing/data-scientist/7357460](https://stripe.com/jobs/listing/data-scientist/7357460)\n\nLyft\n\n\\* [https://app.careerpuck.com/job-board/lyft/job/8404974002?gh\\_jid=8404974002](https://app.careerpuck.com/job-board/lyft/job/8404974002?gh_jid=8404974002)\n\n\\* [https://app.careerpuck.com/job-board/lyft/job/8053601002?gh\\_jid=8053601002](https://app.careerpuck.com/job-board/lyft/job/8053601002?gh_jid=8053601002)\n\nDoordash\n\n\\* [https://careersatdoordash.com/jobs/data-scientist-international/6827862/](https://careersatdoordash.com/jobs/data-scientist-international/6827862/)\n\nInstacart\n\n\\* [https://instacart.careers/job/?id=4949335](https://instacart.careers/job/?id=4949335)\n\nEvenUp\n\n\\* [https://jobs.ashbyhq.com/evenup/c179354a-f8e4-4e51-ba25-82afea134500](https://jobs.ashbyhq.com/evenup/c179354a-f8e4-4e51-ba25-82afea134500)\n\nFaire\n\n\\* [https://job-boards.greenhouse.io/faire/jobs/7953219002?gh\\_jid=7953219002](https://job-boards.greenhouse.io/faire/jobs/7953219002?gh_jid=7953219002)\n\n\n\nThese were a few companies off the top of my head that I'm aware of hire specifically in toronto for early/early-mid roles. There's probably many more than this and it doesn't even get into any FAANGs that may have roles in Canada as well. All the postings above show comp range, but remember that they are only legally obligated to show the base salary component, and seldom show the actual top-end of the band. Equity is never shown in these ranges, and will be somewhere between 25% - 100%+ of the base, with lower levels skewing to a larger base vs equity split. ",
                  "score": 1,
                  "created_utc": "2026-02-17 07:09:23",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5f7p9b",
          "author": "neuro-psych-amateur",
          "text": "Canada - around $75K-$90K CAD. Look at simplyhired positions in Canada, a lot of them have salary range listed",
          "score": 4,
          "created_utc": "2026-02-14 23:28:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5exqwh",
          "author": "PM_YOUR_ECON_HOMEWRK",
          "text": "At my small-mid size tech company, we pay junior US analysts around $120-130k, and European analysts around €50-55k for comparable roles",
          "score": 1,
          "created_utc": "2026-02-14 22:30:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5favyq",
          "author": "joshuaneeraj13",
          "text": "I’d imagine Singapore and the Persian Gulf countries pay extremely well.",
          "score": 1,
          "created_utc": "2026-02-14 23:48:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5suhe1",
          "author": "purposefulCA",
          "text": "Canada 70 to 90k CAD. 2 to 3 yoe",
          "score": 1,
          "created_utc": "2026-02-17 02:57:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5u54xf",
          "author": "Roo_Buchanan",
          "text": "The company I work for pays junior DS consultants £40.5k +10% bonus atm",
          "score": 1,
          "created_utc": "2026-02-17 09:07:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5lcah0",
          "author": "giridharaddagalla",
          "text": "Hey there, great question! Moving for a Product/Market DS role is exciting. Honestly, salaries outside the US for early level roles are gonna vary a lot by country and city, but for Canada, UK, and Germany, you're probably looking at a range that converts roughly to $70k $110k USD for 2 3 years of experience, though top tier companies might push a bit higher. Definitely worth checking local job boards for more precise figures; sometimes, keeping track of application statuses can get a bit messy with different systems, so having a centralized dashboard is super handy. Good luck with the move!",
          "score": 0,
          "created_utc": "2026-02-15 23:21:15",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r8ray4",
      "title": "[Update] How to coach an insular and combative science team",
      "subreddit": "datascience",
      "url": "https://www.reddit.com/r/datascience/comments/1r8ray4/update_how_to_coach_an_insular_and_combative/",
      "author": "[deleted]",
      "created_utc": "2026-02-19 05:58:25",
      "score": 2,
      "num_comments": 14,
      "upvote_ratio": 0.52,
      "text": "See original post [here](https://www.reddit.com/r/datascience/comments/1r1qo10/comment/o4tynuu/?context=3)\n\nI really appreciate the advice from the original thread. I discovered I was being too kind. The approaches I described were worth trying in good faith but it was enabling the negative behavior I was attempting to combat. I had to accept this was not a coaching problem. Thanks to the folks who responded and called this out.\n\nI scheduled system review meetings with VP/Director-level stakeholders from both the business and technical side. For each system I wrote a document enumerating my concerns alongside a log of  prior conversations I'd had with the team on the subject describing what was raised and what was ignored. Then I asked the team to walk through and defend their design decisions in that room. It was catastrophic. It became clear to others that the services were poorly built and the scientists fundamentally misunderstood the business problems they were trying to solve.  \n  \nThat made the path forward straightforward. The hardest personalities were let go. These were personalities who refused to acknowledge fault and decided to blame their engineering and business partners when the problems were laid bare.   \n  \nAnyone remaining from the previous org has been downleveled and needs to earn the right to lead projects again. The one service with genuine positive ROI survived. In the past, that team transitioned as software engineers under a new manager specifically to create distance from the existing dysfunction. Some of the scientists who left are now asking to return which is positive signal that this was the right move.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/datascience/comments/1r8ray4/update_how_to_coach_an_insular_and_combative/",
      "domain": "self.datascience",
      "is_self": true,
      "comments": [
        {
          "id": "o67co6e",
          "author": "ajog0",
          "text": "where in the wild west are you from such that cowboys can fire established employees within days*\n\nfake as story\n\n*for incompetence",
          "score": 58,
          "created_utc": "2026-02-19 07:15:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o689vre",
              "author": "ghostofkilgore",
              "text": "... and then the C-suite gave OP a standing ovation.",
              "score": 21,
              "created_utc": "2026-02-19 12:17:15",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o67rm6w",
              "author": "ItsDare",
              "text": "At-will work states.",
              "score": 4,
              "created_utc": "2026-02-19 09:39:20",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o678fi2",
          "author": "cy_kelly",
          "text": "All in a week?",
          "score": 37,
          "created_utc": "2026-02-19 06:39:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o68v2le",
              "author": "Kacksjidney",
              "text": "This companies VPs and directors have shockingly open schedules and hr working lightning fast to approve the firings. And no writeups just straight to firing. I suppose it's possible...",
              "score": 9,
              "created_utc": "2026-02-19 14:25:58",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o68ki7j",
              "author": "HeyImBenn",
              "text": "No shot this is true, OP is farming internet points",
              "score": 10,
              "created_utc": "2026-02-19 13:26:41",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6atwxx",
                  "author": "HeyImBenn",
                  "text": "Lmao OP popped smoke and deleted their 4yr account",
                  "score": 5,
                  "created_utc": "2026-02-19 20:09:53",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o68vjzp",
          "author": "dillanthumous",
          "text": "Fanfiction?",
          "score": 8,
          "created_utc": "2026-02-19 14:28:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o67ew12",
          "author": "selfintersection",
          "text": "What happened in the design meetings that was so bad?",
          "score": 6,
          "created_utc": "2026-02-19 07:35:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6a9tob",
          "author": "pc_4_life",
          "text": "You threw your entire team under the bus. Now there is no one to blame but yourself when the next domino falls. \n\nSaying “I was too kind” lacks self awareness. You take no accountability whatsoever and celebrate laying off and demoting an entire business unit. I hope this is fanfic. if not, let us know where you work so we can avoid it.",
          "score": 3,
          "created_utc": "2026-02-19 18:33:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6an5hb",
              "author": "Lordofderp33",
              "text": "\"Startup that was bought to get rid of a strategic threat\", right there was the point you knew this place sucks.",
              "score": 2,
              "created_utc": "2026-02-19 19:37:06",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o67g9os",
          "author": "tongEntong",
          "text": "Following",
          "score": -1,
          "created_utc": "2026-02-19 07:48:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o678dcw",
          "author": "Ill-Pass-dvlm",
          "text": "Kudos for the effort",
          "score": -4,
          "created_utc": "2026-02-19 06:38:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o67s0hk",
          "author": "StarThinker2025",
          "text": "Sometimes it’s not a coaching problem, it’s a standards problem. Tough decisions, but clarity beats dysfunction every time 😊",
          "score": -1,
          "created_utc": "2026-02-19 09:43:19",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}