{
  "metadata": {
    "last_updated": "2025-12-30 18:29:57",
    "time_filter": "week",
    "subreddit": "datascience",
    "total_items": 9,
    "total_comments": 117,
    "file_size_bytes": 145680
  },
  "items": [
    {
      "id": "1puabxx",
      "title": "How much of your job is actually “selling” your work?",
      "subreddit": "datascience",
      "url": "https://www.reddit.com/r/datascience/comments/1puabxx/how_much_of_your_job_is_actually_selling_your_work/",
      "author": "ergodym",
      "created_utc": "2025-12-24 00:59:54",
      "score": 91,
      "num_comments": 33,
      "upvote_ratio": 0.97,
      "text": "What % of your role is convincing stakeholders to act on your recommendations?\nDo you like that part, and how did you learn to do it well?\nOr are you in an environment where good analysis & models naturally leads to implementation?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/datascience/comments/1puabxx/how_much_of_your_job_is_actually_selling_your_work/",
      "domain": "self.datascience",
      "is_self": true,
      "comments": [
        {
          "id": "nvn3t6o",
          "author": "cordialgerm",
          "text": "A big portion. All else being equal, someone who can sell their work is going to make a bigger impact than someone who doesn't.",
          "score": 85,
          "created_utc": "2025-12-24 01:02:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvxpfmh",
              "author": "kmishra9",
              "text": "A .8 AUC AutoML model beats .9 AUC built by the greatest modeler in the world every single day if the DS is actually really good at getting their work integrated and building consensus with stakeholders.",
              "score": 2,
              "created_utc": "2025-12-25 22:41:46",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nvn4tgf",
          "author": "TowerOutrageous5939",
          "text": "A lot is selling, education, and advocating. The easy option for business partners is to ask for another report or dashboard that won’t be used.",
          "score": 39,
          "created_utc": "2025-12-24 01:08:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvn6lrf",
          "author": "big_data_mike",
          "text": "Maybe 10% because I have a good manager. I sell it to my manager once then he has 5 meetings with all the other stakeholders and sells it to them.",
          "score": 38,
          "created_utc": "2025-12-24 01:19:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvnimvo",
              "author": "TQMIII",
              "text": "I miss having that. My current manager thinks their job is to oversee the work I do rather than guarding my time from all the bullshit that districts from my work.",
              "score": 24,
              "created_utc": "2025-12-24 02:35:07",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nvpaqkm",
                  "author": "Polus43",
                  "text": "Same. Everyone's mileage will vary, but I've had such mediocre management for so long I almost think we're in a \"management crisis of incompetence\". \n\nThe companies have outsourced most of HR to staffing/recruiting agencies and current middle management is more Human Resources/Status Updater than anything else. \"How can I get Technology/Data Science money while understanding none of it?\"",
                  "score": 5,
                  "created_utc": "2025-12-24 11:30:17",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nvnphr7",
              "author": "ChavXO",
              "text": "How big is your team?",
              "score": 3,
              "created_utc": "2025-12-24 03:18:20",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nvo46y7",
                  "author": "big_data_mike",
                  "text": "6 and that includes data science, data engineering, someone who does infrastructure stuff and a software engineer",
                  "score": 4,
                  "created_utc": "2025-12-24 04:58:43",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nvnc1i3",
          "author": "va1en0k",
          "text": "I'd say not selling but almost the opposite, expectations management is a lot of work. Our users want the models' output but how to convince all the stakeholders and users to frame the results sensibly is a massive headache ",
          "score": 11,
          "created_utc": "2025-12-24 01:53:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvn4wsi",
          "author": "broodkiller",
          "text": "Well, there are two keys aspect here - the results/benefits and the cost of implementing it. In my former role, our data team *always* did a pilot, benchmarked it in terms of performance and runtime, and the proposed implementation was *always* accompanied by the expected compute cost, sometimes with multiple scenarios. This made it *much* easier to argue for what we thought was the best option to the leadership.",
          "score": 9,
          "created_utc": "2025-12-24 01:09:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvnl42h",
          "author": "Trick-Interaction396",
          "text": "A lot of my work is communicating the results in a understandable way but never push for more work/projects. I'm not that ambitious. I do what is needed. If work is slow I chill.",
          "score": 4,
          "created_utc": "2025-12-24 02:50:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvnbb9d",
          "author": "Intrepid-Self-3578",
          "text": "I don't like that part as an Introvert. But it is a must you need to sell it to stakeholders otherwise it will never get adopted. \n\n\nIt should be part of the process keep communicating and get feedbacks early. ",
          "score": 5,
          "created_utc": "2025-12-24 01:49:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvo276i",
          "author": "snowbirdnerd",
          "text": "Very little. I have PMs and Product Owners who do all of that for me. \n\n\nNow I do spend a lot of time explaining the models to sales people and trying to convince product people that I can do projects if they just let me. Probably more of that then actually training models. ",
          "score": 3,
          "created_utc": "2025-12-24 04:44:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvo2aej",
          "author": "chrico031",
          "text": "Back when I had a good Product Manager on my team, very minimal.\n\nNow that I don't, a very large portion of my work is selling it",
          "score": 3,
          "created_utc": "2025-12-24 04:44:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvosxqp",
          "author": "Ghost-Rider_117",
          "text": "way more than i thought coming into the field tbh. i'd say it's like 40% of my time now - translating technical findings into business language, making execs care about the insights, getting buy-in for next steps. the actual analysis is almost the easy part compared to getting people to actually act on it",
          "score": 3,
          "created_utc": "2025-12-24 08:36:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvxawlp",
          "author": "Typical-Trade-6363",
          "text": "More than we like to admit. Great work means nothing if people don’t understand or trust it. Selling is really just clear translation, not hype.",
          "score": 3,
          "created_utc": "2025-12-25 21:12:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvnit0k",
          "author": "derekz83",
          "text": "What you’re referencing isn’t “selling” in my opinion . It’s telling the people who need to make decisions why they should care about your analysis and its conclusions. I think what you’re asking is “how important is strong communication skills in your work?” And my response would be “Strong communication skills and dexterity with your words is as important as the technical skills required to do the analysis.”",
          "score": 6,
          "created_utc": "2025-12-24 02:36:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvnspng",
          "author": "genobobeno_va",
          "text": "All of it",
          "score": 2,
          "created_utc": "2025-12-24 03:39:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvorprc",
          "author": "alexchatwin",
          "text": "Lots of selling a deliverable practical solution, rather than a fantastic magical solution",
          "score": 2,
          "created_utc": "2025-12-24 08:23:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvougvl",
          "author": "dataflow_mapper",
          "text": "Honestly, it feels like a big chunk of the job. The analysis is often the easy part compared to getting people comfortable enough to act on it. I’ve noticed that framing matters more than technical depth, like tying results directly to decisions they already care about. I didn’t really learn it formally, just by watching what got ignored versus what actually led to changes. When stakeholders are involved early, the selling part gets a lot smaller. In places where that doesn’t happen, you can have great models that never leave a slide deck.",
          "score": 2,
          "created_utc": "2025-12-24 08:51:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvpl6zb",
          "author": "in_meme_we_trust",
          "text": "60%",
          "score": 2,
          "created_utc": "2025-12-24 12:56:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvsk9hb",
          "author": "coffee_juice",
          "text": "Initially? A large part of it. But now that we've established ourselves, we find ourselves in a position where we have to prioritize and filter requests from internal stakeholders.",
          "score": 2,
          "created_utc": "2025-12-24 23:20:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwi6sq6",
          "author": "Ancient_Ad_916",
          "text": "With some customers it’s the biggest part, and I dislike it quite a lot. Often we have “difficult to grasp” implementations which are combining DS/ML with operations research, and boy do we have to invest loads of time to convince management. Sometimes this is a process which consists out of months of weekly meetings.",
          "score": 2,
          "created_utc": "2025-12-29 06:42:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvn79d1",
          "author": "Atmosck",
          "text": "Very little. I think i'm lucky in the sense that I'm not modeling business stuff and generating reccomendations, I'm building ML models that are user-facing parts of our (SAAS) product. Most of the persuasion I have to do is related to the front-end design and how my model outputs will be shown to users, or downstream logic that uses my models. Sometimes talking down overly ambitious/optimistic-about-the-data project ideas. But overall our company is pretty cohesive when it comes to project priorities. When I do have to pitch something it's generally data infrastructure or tooling (\"if you want a model for that then we're going to need a pipeline to get the relevant unstructured user data in a structured form we can query\"). I recently successfully pitched a project to build an internal python library to contain all the I/O, logging and credential management boilerplate that's currently repeated across various scheduled tasks and inference servers. That was a very easy sell because the benefits to maintainability and dev efficiency are obvious. We recently had to adapt to a change in an upstream API that broke like, a ton of different things that had to be updated individually. Would have been much easier if it was just an update to the shared client library.\n\nMost of the time, project ideas come from the product team and my role is to scope out what's realistic and what's needed for the components that rely on ML.",
          "score": 1,
          "created_utc": "2025-12-24 01:23:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvp45gf",
          "author": "No_Ant_5064",
          "text": "I wouldn't say any part of my job is selling my work, because my work is doing what they asked me to lol. I would say that 25% of my work is the initial request, and 75% is follow ups, deep dives, and general scope creep based on initial analyses.",
          "score": 1,
          "created_utc": "2025-12-24 10:27:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvqjsuf",
          "author": "thinking_byte",
          "text": "From the outside, it looks like selling is a bigger chunk than most people expect. Even great analysis does not move things unless it connects to a decision someone already feels pressure to make. I think a lot of that work is translating uncertainty into something people can act on without feeling exposed. Framing matters more than technical depth in those moments. Environments where models naturally lead to action usually have trust built up over time, not just better math. That trust seems to come from being clear about limits and tradeoffs, not pretending the model is magic.",
          "score": 1,
          "created_utc": "2025-12-24 16:20:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvrfwo1",
          "author": "normee",
          "text": "So much. As an individual contributor, influencing stakeholders was maybe 25%, and at manager level and above, 60% or more of my time.\n\nI genuinely love this part of the job, but you can run into cultural walls that feel almost impossible to surmount after you realize that a lot of what goes into decision-making isn't necessarily what is best for the company. I've seen stakeholders' individual priorities were in tension with overall company goals, where their performance was going to be evaluated on launching something, so they pushed forward regardless of data showing this would be detrimental to overall KPIs, and they would do everything they can to take control over analytical narratives by cherry-picking favorable data points. I've seen new functional leaders brought on to be change agents, wanting to be briefed on everything we knew about their function analytically, but then being unwilling to accept that their preconceived notions of what needed to be addressed were off. Quite a few times my team found genuinely big business opportunities, but couldn't sell those in until we had leadership turnover, as the exec over the relevant area and their finance counterpart would swat down discussion because it would highlight bad decisions they had made before. I've had new data science leaders come in wanting to prioritize initiatives already attempted under previous leaders that flopped, and then they stubbornly refused to listen to any of the lessons learned about what led to high effort and limited potential ROI.",
          "score": 1,
          "created_utc": "2025-12-24 19:14:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvs3nqz",
          "author": "varwave",
          "text": "You might get different answers from different roles with the same title. \n\nRarely. I’m a “data scientist”in a small to mid sized organization, but my work is far more software engineering (data pipelines and internal full stack applications that occasionally make use of applied statistics/machine learning). Mostly, just need a good time frame for stages of a project as it moves from concept and enters production across versions. Similar to others who’ve posted, the product managers identify problems and then we collectively develop a realistic solution. My hands are clear of politics",
          "score": 1,
          "created_utc": "2025-12-24 21:33:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvs5r25",
          "author": "mathproblemsolving",
          "text": "In my experience, we discuss implementing good analysis in the meetings and follow up meetings etc. and then some new idea comes up and we work on that, that's how it keep going on circle over and over and hardly get implemented.",
          "score": 1,
          "created_utc": "2025-12-24 21:46:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvsq9bk",
          "author": "rod_dy",
          "text": "i just gave up sellign and just wait",
          "score": 1,
          "created_utc": "2025-12-25 00:02:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw92hnk",
          "author": "traceml-ai",
          "text": "As a senior member it is kind of expected to this specially in a non-tech company where a majority of stakeholders are business. Practice makes the man perfect, the more you talk to business the more you understand their perspective beyond our equations. I have more than 10+ years of job experience and I never seen that to work in any non-tech company. In pure tech companies, this part is more clearly defined.",
          "score": 1,
          "created_utc": "2025-12-27 20:56:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvovs7l",
          "author": "ConfusedPhDLemur",
          "text": "A big portion of the job and I love it, probably more than the actual modeling.",
          "score": 1,
          "created_utc": "2025-12-24 09:04:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvo63px",
          "author": "Bloodypalmprint",
          "text": "I am developing an app and need to partner with possible a data scientist as I don’t have specific experience in coding where should I look?  I live in Kansas City",
          "score": -2,
          "created_utc": "2025-12-24 05:13:00",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pwsmg9",
      "title": "Are some people really as busy as they really look?",
      "subreddit": "datascience",
      "url": "https://www.reddit.com/r/datascience/comments/1pwsmg9/are_some_people_really_as_busy_as_they_really_look/",
      "author": "BurnerMcBurnersonne",
      "created_utc": "2025-12-27 08:13:30",
      "score": 75,
      "num_comments": 41,
      "upvote_ratio": 0.81,
      "text": "There is someone I have to work together and we both work remotely. I'm a data scientist and he is a product manager. This person appears to be always busy. His Slack status is either on a huddle or on a meeting. He is probably having more than 10 meetings a day lol. When I want to talk about something with him, he asks me to set a meeting on calendar at weird times like 2 days later, but we can actually solve the problem right at that time in couple minutes.\n\nNormally I don't give a shit, but I don't like his attitude recently. He says stuff like \"I'm focused\", \"Don't be distractive\" bla bla. He also said that \"You are not working at all\" because I'm managing my time in a more flexible way. I think he will try to get rid of me soon. I have no idea how to deal with this. Does anyone had to work with this type of person before?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/datascience/comments/1pwsmg9/are_some_people_really_as_busy_as_they_really_look/",
      "domain": "self.datascience",
      "is_self": true,
      "comments": [
        {
          "id": "nw5ueqg",
          "author": "Hopeful_Candle_9781",
          "text": "Tbh that just sounds like a product manager. Probably has meetings to discuss what will be in the meetings.\n\nYou can put meetings in your calendar to indicate you're writing code, and when he wants to talk to you say sorry this is my focus time for writing code.\n\nYou could always just use the same techniques as him, book a scoping meeting at the start of the project and book in regular meetings with him in advance to discuss the project and ask for advice. Use his techniques back on him.\n\nGotta meet people where they're at.",
          "score": 186,
          "created_utc": "2025-12-27 08:32:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "nw6b60w",
              "author": "dang3r_N00dle",
              "text": "\\> You can put meetings in your calendar to indicate you're writing code, and when he wants to talk to you say sorry this is my focus time for writing code.\n\nThis is a good idea anyway because you need that focus time.",
              "score": 41,
              "created_utc": "2025-12-27 11:16:03",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nw7dt7d",
                  "author": "CiDevant",
                  "text": "Scheduling focus time is important but it needs to stay flexible. You can move it to reschedule, but don't allow interruptions once it's begun.",
                  "score": 11,
                  "created_utc": "2025-12-27 15:43:59",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nw69twp",
              "author": "M4A1SD__",
              "text": "> You can put meetings in your calendar to indicate you're writing code, and when he wants to talk to you say sorry this is my focus time for writing code.\n\nIMO this is bad advice. Put meetings/blocks on your calendar. If people try to schedule a meeting during that time, decline. Say you’re busy/can’t make it. Don’t need to provide a PM a reason, and sets a bad precedent of having to explain yourself",
              "score": 23,
              "created_utc": "2025-12-27 11:03:09",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nw61v3p",
              "author": "BurnerMcBurnersonne",
              "text": "Doing the same is a lose for me because I have to produce some outputs and feed other teams.",
              "score": 2,
              "created_utc": "2025-12-27 09:45:02",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nw65kh0",
                  "author": "Hopeful_Candle_9781",
                  "text": "Sounds like you need a new job.",
                  "score": 4,
                  "created_utc": "2025-12-27 10:21:28",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nw5xc38",
              "author": "Some-Librarian-8528",
              "text": "Yeah, we definitely have meetings to discuss meetings. 🤣",
              "score": -2,
              "created_utc": "2025-12-27 09:00:16",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nw6ajuo",
          "author": "puehlong",
          "text": "In managing roles, be it people, products or both, you often have to align a lot with stakeholders, developers, clients and so on, so a lot of communication might be needed. How that communication works is not fully under your control as it depends on company culture and the expectations of others. So you end up having a lot of meeting throughout the day. \n\nSome of these meetings need to be prepared, others need follow-up, and besides that, you might still have some tasks that need focused work.\n\nThis leaves only a couple of time slots per day for that work. Many people cannot switch context every few minutes while staying productive. For more complex stuff, I need a good half hour of focus to ramp up and really get into it, if that’s interrupted, I’m not getting anything done.\n\nSo it makes sense that your colleague asks you to do tasks another time even if they would cost you only a couple of minutes (the might cost him the short focus time slot that he has).\n\nOf course there’s always a tradeoff: if I insist on my focus time, someone else like you has to wait. That’s why I’m usually hesitant with putting too many blockers in my calendar.",
          "score": 63,
          "created_utc": "2025-12-27 11:10:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "nw6zjc3",
              "author": "ohhaysup",
              "text": "My meetings and calendar sound like this PM. This comment has the best advice from my perspective.\n\nMy only addition would be that following up or nagging someone for something is a learned skill, and every individual will have a way that works best for them.\n\nI get a dozen teams messages a day from other teams asking me to validate code or send a code snippet for some use case, and I have so much going on I just can’t respond to them all without getting none of my “real work” done. \n\nWhen people nag me in an “annoying” way I’m more likely to get annoying as well. “Annoying” are things like following up more than twice a day, sending messages like “pleeeeeeeease :)” or being bratty about my slow response, or not having a good sense of what is urgent versus what is just “a thing they’re currently working on” and treating both with the same communication.\n \nThe reality is I’m overwhelmed with work! If this person is saying book a meeting later in the week, then believe them that this is their preferred method. \n\nOver time, the more you respect their preferences the more people (generally!!) tend to be flexible with people they know are generally respectful.",
              "score": 20,
              "created_utc": "2025-12-27 14:22:15",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nw8ef6y",
              "author": "fredditb",
              "text": "This exactly!\n\nMy 8 hour day as a PM means on average:\n- 3 hours of meetings\n- 200 - 500 messages on MS Teams and emails, mostly of colleagues from other departments that need my input so they can continue their work\n- 2 support cases that the support department feels not qualified to answer, so I need to figure out how to respond to these technical questions\n- actual scheduled work on the open topics and on everything that was requested in the MS Teams messages and emails\n- 2 hours of testing and quality control for the R&D department, so they can continue their work once it was approved by me\n\nBesides of that, my boss wants me to schedule 3 hours of focused work every day, to evaluate the current situation of our products, check trends on the market, and come up with future products that fit into our brand’s ecosystem.\n\nEvery time a person walks over to me in the office and wants to discuss something, I can take a look in my calendar and give them a 15 minute slot in 2 to 3 weeks. Of course I don’t want to be that guy, so most of the time I stop my work and see if I can help them out in a few minutes. Which is a nice move as a colleague but it completely derails my own work.\n\nI don’t know OP’s situation with the PM in detail but maybe this explains a bit why some PMs seem to be either completely stressed or rude. This is the result of bad management that creates chaos and overworks people. Often the PMs are the ones who have to fix this by being extremely fast with everything and maintain a good flow of information between the departments. And there isn’t a lot of unscheduled time in a workday like that.",
              "score": 12,
              "created_utc": "2025-12-27 18:48:34",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nw6d01b",
          "author": "Retro_Relics",
          "text": "well, i mean, if you're comparing yourself to someone who has a completely different job title, and trying to figure out how to make yourself look productive, there is likely an issue there. it may not be your issue to fix, but why are you constantly needing a product managers time?\n\nare you doing the analytics that support product he manages? Is he frequently needing data from you, or are you guys just on the same team and coworkers?\n\nproduct managers are often partially sales reps, partially engineers, partially a lot of things. There are a lot of meetings because its constantly keeping everyone informed, they usually have to verify documentation on the product, make sure customer understands the documentation on the product, make sure executive leadership understands the product well enough to know what your team is doing, etc. If he's having to be presenting constantly, then yeah, he likely doesnt have a huge amount of time in his day to be hand holding the analytics guy.\n\nIf he's saying things like \"don't be a  distraction\" why are you interacting with him at all? Is it just to provide data that he needs? Is it to ask questions about what analytics you are providing for him? Is there any reason why you cant just email him these questions instead and let him reply between meetings?",
          "score": 12,
          "created_utc": "2025-12-27 11:33:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw6iwjz",
          "author": "dataflow_mapper",
          "text": "Yeah, some people really are booked nonstop, but a lot of that busyness is self inflicted or role driven. PMs often live in meetings, but that does not automatically mean they are more productive or more focused than you. The bigger issue here is the attitude and the accusation about you not working, which is not okay. I have dealt with people like this and it usually helps to make work visible in writing and set clearer async boundaries. Document decisions, follow up in Slack or docs, and loop in your manager early before it turns into a narrative you cannot control. You do not need to mirror his calendar chaos to prove you are doing your job.",
          "score": 5,
          "created_utc": "2025-12-27 12:26:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "nw82bkk",
              "author": "Retro_Relics",
              "text": "While true, it sounds like OP is constantly trying to get a hold of PM when PM is trying to do a ton of other things, and as a result, its messing with the PM's flow and stuff - like the \"you're a distraction\" comments and requesting OP book time in the schedule. It sounds like OP keeps trying to just drop by the PM's office and talk things over, and as a result of OP just always stopping by, it seems like OP isn't as busy since OP is always finding time to show up at PM's office, despite PM repeatedly asking OP to book time to talk. \n\nOP keeps thinking that his time is the most important, and he wants to solve things now, and there is also the possibility that because OP wants to solve things now, and can't because PM is booked, its coming across in OP's status reports, whether or not OP means it to, that OP is putting delays on deliverables at the feet of delays in communication",
              "score": 4,
              "created_utc": "2025-12-27 17:48:18",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nw614hf",
          "author": "FewWorldliness7546",
          "text": "Since he likes meetings so much, let him have more. Every time you need to discuss something with him, take the initiative to send a meeting invitation, stating the purpose and time. This way, you leave a paper trail for your work, and he can drown in endless meetings.",
          "score": 14,
          "created_utc": "2025-12-27 09:37:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "nw6542b",
              "author": "norfkens2",
              "text": "Bonus points if you book half hour meetings and are done after ten minutes. \n\nEither he'll like the \"free\" time - or he'll slowly realise see that  the two of you need a different operating model. 😉",
              "score": 10,
              "created_utc": "2025-12-27 10:16:58",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nw6at32",
          "author": "dang3r_N00dle",
          "text": "The TL;DR is that as workers, we should recognise that everyone is doing difficult work. This PM is working hard, but he's also being an out-of-touch asshole for casting this on you.\n\nThe kind of work that this PM does is different. It's the kind where it's easy to look like you're constantly working, but doesn't require the intense problem-solving and attention to detail that data science needs. It's easier to do, and so the volume is higher, but that also means you need to be constantly turned on and you don't get a lot of chance to actually think deeply about anything.\n\nI also used to do a very low volume of work before I got better at time management and was put on ADHD meds. With my improved skills and abilities, I am definitely as busy as I look, but I don't feel much more impactful. A lot of the work that I have done goes unrecognised because it's not what the company really cares about, which is my bad, and I'll be changing my focus next year.\n\nThe point is that just because you can do more doesn't mean you can do work he business cares about. In this way, working less can be better because when you have less time  you spend less time on bullshit.\n\nThe point is that the value of DS work tends to be very 80-20, where what looks like a small amount of work ends up driving a large amount of value. But that 20% of work is *hard* and intellectually taxing because it requires you to actually to think in concrete tems and to actually find the right questions to ask and deal with the inconvienient reality of things in a way that sitting in meetings all day just doesn't require.\n\nI'm happy to give the PM his due because all jobs are hard, but to say \"youre not working at all\" is so fucking out of line by that logic. There's a reason he's a PM and not a DS, because it's the kind of work he may actually struggle with if he had to do it, and a lot of us actually *do* struggle becauses it *is* hard.",
          "score": 7,
          "created_utc": "2025-12-27 11:12:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "nw6k7e1",
              "author": "Zohan4K",
              "text": "I'm sorry but no, only engineers do real work, everyone is is just talking about what engineers do.\n\nEverytime I have engineers doing other people's work it's magically done significantly quicker, better and zero drama.\n\nIt's very important to:  \n1. Know everyone but engineers are total frauds.  \n2. Act as if it's not true to get paid by the frauds.",
              "score": -3,
              "created_utc": "2025-12-27 12:36:48",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nw6lzk6",
                  "author": "dang3r_N00dle",
                  "text": "I'm pretty sure that this is a joke, but I can't quite tell lmao.",
                  "score": 12,
                  "created_utc": "2025-12-27 12:50:57",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nw7g95k",
                  "author": "CiDevant",
                  "text": "Replace that with Nurse/Doctor and you have the corporate healthcare industry attitude summed up neatly.  It's obviously wrong for the same reason the Eng statement is wrong. People with clout can bully their way through process and red tape, sometimes, but that red tape is there for a usually very expensive reason.  Often times that reason is a fringe case that doesn't always matter until it very much does.  So while it seems like these people can just \"get stuff done\". They're probably doing it in a way that shouldn't be the norm.  A lot of the rules on of my teams have are due to the IRS or the Joint Commision.  Yes, we can \"just do what's being asked.\" But if we trip into a violation, there is hell to pay. So we want to follow the \"don't run with scissors\" type rules even though 99% of the time nothing bad is going to happen.",
                  "score": 3,
                  "created_utc": "2025-12-27 15:56:21",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwb1dtv",
          "author": "PNW_Uncle_Iroh",
          "text": "Product managers have to pretend they are busy all the time to justify their existence.  \n\nSource: I am a product manager.  \n\nEdit: I see that you’re asking for advice. Just slack him your questions in real time to get quick answers. No need for a meeting.",
          "score": 5,
          "created_utc": "2025-12-28 03:41:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw6prpo",
          "author": "pretender80",
          "text": "If you're embedded and working with a PM and you don't have a regular 1:1, that's on you.",
          "score": 2,
          "created_utc": "2025-12-27 13:18:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw9j7u8",
          "author": "Radiant_Egg174",
          "text": "I’m the same way. I’m most productive when I stay focused, plan well-ahead and stay on task with few distractions.  Just because someone wants my time doesn’t mean I need to make their demand more important than my time and productivity.",
          "score": 2,
          "created_utc": "2025-12-27 22:26:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw6ruoc",
          "author": "Trick-Interaction396",
          "text": "A lot of people are inefficient. The meetings part is real but not their fault.",
          "score": 1,
          "created_utc": "2025-12-27 13:33:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw7dhqa",
          "author": "CiDevant",
          "text": "As a manager I spend about 6-7hrs a day in meetings; the rest of the time I need to get my deliverables done.  I ruteinly ask people to schedule time with me if they need more than 5 minutes. However I have never told someone \"you are not doing enough\".  Instead I scheduled them more work to bring them up to par.  Sadly much of that meeting time I am just a consultant on larger inter team projects.  But it requires my focus and attention or I am useless.\n\n\nThis person sounds similar, but needs some soft skill development.  Do you direct report to them, or someone else?  Have a conversation with who can promote or fire you about expectations.  Be it then or someone else.  Document the work your doing and update your resume regardless of what you want or expected outcomes.  Whenever there is turbulence at work or a performance eval is coming up you should document your achievements and update your resume/CV.  Every time.",
          "score": 1,
          "created_utc": "2025-12-27 15:42:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw7g56v",
          "author": "justneurostuff",
          "text": "some of them are some of them aren't",
          "score": 1,
          "created_utc": "2025-12-27 15:55:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw7z953",
          "author": "markitwon",
          "text": "This thread made me realize Americans take their jobs way too seriously. The old adage “live to work” is very true in that country",
          "score": 1,
          "created_utc": "2025-12-27 17:32:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw8d93h",
          "author": "recon-ai-demo",
          "text": "This is someone that you need to build a successful working relationship with, some people are tricker than other to work with, but you have to find a way of working together to enable your success and the success of your team. \n\nI would ask him/her: Do you have a quick 15 minutes to help me answer XYZ? I am blocked and unable to make progress. \n\n  \nPhrase is something like that in your own words.\n\nAsk them to set up 30 minute office hours on a Tuesday and a Thursday so that you never have to wait a long time to meet them. \n\nThis sounds like a situation in which you need to manage upwards, I would also escalate to your manager to seek advice on how to manage the situation. \n\nI would say that you can't manage your time in the way that you want you need to manage your time in a way that works for your team.",
          "score": 1,
          "created_utc": "2025-12-27 18:42:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwalrcp",
          "author": "gmahogany",
          "text": "A lot of people really are that busy. You might be able to solve it right now in 2 mins, but the pm can’t. Some people I slack with “hey, can u talk for a min?” And send a huddle. Other people, I only schedule things in their open cal blocks with ~1-2 days of lead time. Or if something’s urgent, I send an email with the details & will slack something like “hey I see you’re booked out, sent you an email about a potential blocker, pls take a look when you get a chance.” \n\nAll depends on your relationship and their workflow. Def don’t keep pinging someone who responds like this.",
          "score": 1,
          "created_utc": "2025-12-28 02:07:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwbuwzn",
          "author": "mjtriggs",
          "text": "I’m a data scientist turned product manager and unfortunately my calendar looks the same as your colleague. I’m across two scrum teams and four different projects, so there’s lots of stand-ups and ceremonies associated with that and countless “alignment” meetings before even getting to speaking to customers. \n\nHowever, I do try to prioritise my Devs where I can. It’s possible to be busy and not an asshole. Sounds like the stress is getting to him a bit.",
          "score": 1,
          "created_utc": "2025-12-28 07:25:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwd40f7",
          "author": "anonamen",
          "text": "Somewhat, yes. That's what PMs do. They sit in meetings for a huge amount of their time, and spend most of the rest of their time working on stuff to talk about in those meetings.  \n\nAre they \"really\" that busy? Maybe not. Many of those meetings aren't strictly essential. But hard to say from the outside which ones are or aren't essential. And the definition of essential is more based on building and maintaining relationships and support for projects than anything else (status updates, check-ins, etc.). All those meetings are very necessary in large companies, if you want to get anything done. \n\nIt's very noticeable when you have a good PM, and it's amazing. But it can be hard to tell without being closely involved when a PM is manufacturing worthless work for themselves without achieving much. Over simplifying, but projects with bad PMs tend to stagnate and churn. Projects with good PMs just run smoothly. In both cases the PMs might appear to be doing very similar things.  \n\nAll that said, he also sounds like he's kind of an asshole. And/or your problem is not important to him. When a PM is indifferent to your work, it usually means that your work doesn't benefit their projects. If he could see a clear benefit to solving your problem in 5 minutes, of course he'd do it. \n\nShort version, if you're asking for something that he doesn't want to do, explain your value-prop better, in his terms, or stop bothering him and solve it yourself. Especially if he has the ability to damage your career.",
          "score": 1,
          "created_utc": "2025-12-28 14:01:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwe0nuc",
          "author": "Tall_Interaction7358",
          "text": "Yeah, some people really are that busy, especially PMs with meeting-heavy days. But constant meetings don’t automatically mean higher productivity.\n\nWhat stands out here is the attitude. Saying 'don’t be distracted' or saying that you’re not working because you manage time flexibly isn’t okay. That’s less about being focused and more about poor collaboration or control.\n\nI’ve seen people insist on scheduling everything days later, even when a 2–3 minute sync would unblock things. That’s usually a working-style mismatch, not real urgency.\n\nI wouldn’t assume he’s trying to get rid of you, but I’d keep things documented and stick to clear, written communication. Busy is fine but bro being dismissive isn’t.",
          "score": 1,
          "created_utc": "2025-12-28 16:58:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwh4h8m",
          "author": "Ghost-Rider_117",
          "text": "lol yeah some people are genuinely that busy but also some folks use meetings as a shield. product managers especially can fall into this trap where being in 10 meetings feels productive but theyre not actually shipping anything\n\n\n\nthat said context switching between meetings IS draining and makes everything take longer. maybe try async communication first? like slack him the problem details and say \"lets meet if we cant solve it async in 24hrs\" - if hes actually swamped he might appreciate the flexibility",
          "score": 1,
          "created_utc": "2025-12-29 02:27:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwhcxmz",
          "author": "Sudden_Beginning_597",
          "text": "Some people just cannot \"work\" without talking to others, it's common.",
          "score": 1,
          "created_utc": "2025-12-29 03:16:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwphol9",
          "author": "Helpful_ruben",
          "text": "Error generating reply.",
          "score": 1,
          "created_utc": "2025-12-30 10:12:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwpn7uf",
          "author": "RunOrdinary8000",
          "text": "Why not have a short sync call on a regular basis with an agenda. If you have regular questions get your Time slot from him.\n\nHe then can manage the time he needs for you. I mean you are not in the office, you do not know what he does and vice versa. \n\nI would send the agenda 2 days ahead, since that seems the time he needs to prepare things for you.\nIf the agenda is empty, you can ask if he has topics otherwise you cancel it.\n\nJust guessing. Maybe it is worth looking at the questions you have and if they can be avoided. That could be another approach to the topic.",
          "score": 1,
          "created_utc": "2025-12-30 11:03:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwdnkvp",
          "author": "Dave_Odd",
          "text": "PM = Professional Meeting attendee",
          "score": 1,
          "created_utc": "2025-12-28 15:52:58",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pye3el",
      "title": "What skills did you learn on the job this past year?",
      "subreddit": "datascience",
      "url": "https://www.reddit.com/r/datascience/comments/1pye3el/what_skills_did_you_learn_on_the_job_this_past/",
      "author": "ergodym",
      "created_utc": "2025-12-29 05:44:47",
      "score": 74,
      "num_comments": 61,
      "upvote_ratio": 0.93,
      "text": "What skills did you actually learn on the job this past year?\nNot from self-study or online courses, but through live hands-on training or genuinely challenging assignments.\n\nMy hunch is that learning opportunities have declined recently, with many companies leaning on “you own your career” narratives or treating a Udemy subscription as equivalent to employee training.\n\nCurious to hear: what did you learn because of your job, not just alongside it?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/datascience/comments/1pye3el/what_skills_did_you_learn_on_the_job_this_past/",
      "domain": "self.datascience",
      "is_self": true,
      "comments": [
        {
          "id": "nwi2hst",
          "author": "Spirited_Let_2220",
          "text": "Main thing I learned wasn't technology related at all, it was a simple reminder that at most employers a data scientist works in a cost center and it doesn't matter what efficiencies you drive if at the end of the day those don't translate into impacting the PnL. \n\n  \nFor example, I was supporting a business development team and I made them a lot more efficeint but the people I supported didn't leverage this new time to do better and their boss saw it as an opportunity to give them busy work which meant that I saved them time and they then leveraged this new time to essentially engage in zero impact activities. \n\n  \nSo who looks bad here? You would think it's them but nah they're revenue generating so the cost center is the one who takes the hit. \n\n  \nVery few employers have data scientists in roles where they impact revenue directly, so what I learned was essentially I want to be in a role that directly impacts revenue or else work somewhere with a huge data culture.",
          "score": 83,
          "created_utc": "2025-12-29 06:06:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwi80eh",
              "author": "Traxingthering",
              "text": "Eventually what matters is how much money you as an individual could save, learned this early in my career",
              "score": 13,
              "created_utc": "2025-12-29 06:52:25",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nwixq9t",
              "author": "itsmekalisyn",
              "text": ">so what I learned was essentially I want to be in a role that directly impacts revenue\n\nAny examples of this?",
              "score": 5,
              "created_utc": "2025-12-29 10:49:32",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nwkc06v",
                  "author": "Spirited_Let_2220",
                  "text": "Depends if you want to stay in data science / analyitcs.\n\nWorking as a consultant doing data science means you generate revenue, growth analytics is another role.\n\nThere are some exceptions of course, working somewhere like Capital One or Visa would be examples",
                  "score": 2,
                  "created_utc": "2025-12-29 16:08:13",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nwn3sex",
              "author": "Cultural-Ambition211",
              "text": "This is where marketing comes into play. You need to advertise the time savings that you’ve made to your management to make them aware. \n\nAt the start of a project an outcome should be X hours a week time saving, which will be put back into Y activities.",
              "score": 1,
              "created_utc": "2025-12-30 00:17:22",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nwizngy",
          "author": "Knight_Raven006",
          "text": "DuckDB, data transformations go brrrr. Before I was using pandas, but when I dabled with duckdb, I was amazed how fast it was. Also I learned that I liked writing sql for my  data analysis/preparation rather than pandas.",
          "score": 24,
          "created_utc": "2025-12-29 11:06:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwiboal",
          "author": "jbmoskow",
          "text": "I work in the educational tech/assessment industry. Last quarter I was assigned a project where I was asked to build an \"AI\" to automatically construct a test (as in the kind you take in school). The AI would take in a list of requirements and a bank of test items and spit out a valid test.\n\nQuickly recognized this was a constrained optimization/SAT problem, which I've never worked on before. Fortunately for me, I discovered that Google makes an awesome Python package called ortools which uses state-of-the-art algorithms to solve problems like these. The hard part was translating the business rules (e.g. we need X number of this type of question) into code that would implement them, especially since we needed a combination of soft and hard constraints. Fortunately, the package is super flexible.\n\nOverall was a really great learning experience between learning how to use the package, to approaching these types of SAT problems. I also learned a lot of Docker & Streamlit for the same project in order to deploy a shareable proof-of-concept.",
          "score": 37,
          "created_utc": "2025-12-29 07:24:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwjt63d",
              "author": "Able-Organization935",
              "text": "Ortools is probably one of the biggest gems out there right now. It is unbelievable that it should be available for free. Even better, you can use it from minizinc, which is a dedicated and very expressive constraint programming language.",
              "score": 3,
              "created_utc": "2025-12-29 14:33:07",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nwqwcrj",
                  "author": "WelkinSL",
                  "text": "Yea but its documentation is garbage.  I am not talking about the examples but the documentation itself, they are generated from comments in the C source but some of the are out of place so you end up having to read the C code lol.  Still a good tool though since it's free, can't argue with free.",
                  "score": 1,
                  "created_utc": "2025-12-30 15:48:17",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nwk7dpd",
              "author": "TheOneWhoSendsLetter",
              "text": "Any good books or resources about the theory of constrained optimization?",
              "score": 3,
              "created_utc": "2025-12-29 15:46:03",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nwisynp",
              "author": "priya90r",
              "text": "Any resources you would recommend for this?",
              "score": -1,
              "created_utc": "2025-12-29 10:05:43",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nwjosfc",
                  "author": "theArtOfProgramming",
                  "text": "The package they referenced has loads of resources in its documentation…",
                  "score": 6,
                  "created_utc": "2025-12-29 14:08:04",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwidfni",
          "author": "Suspicious_Jacket463",
          "text": "Polars.",
          "score": 22,
          "created_utc": "2025-12-29 07:40:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwij641",
              "author": "Front_Engineering_e",
              "text": "Same. It's just extremely good, and way better than Pandas (in both performance and API design).",
              "score": 5,
              "created_utc": "2025-12-29 08:33:20",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nwj1onn",
                  "author": "ergodym",
                  "text": "Say more? Why do you prefer it to pandas?",
                  "score": 1,
                  "created_utc": "2025-12-29 11:24:48",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            },
            {
              "id": "nwiju96",
              "author": "TheBatTy2",
              "text": "Question, maybe an uninformed one since I haven’t really looked into polars. Is it compatible with seaborn/matplotlib?",
              "score": 3,
              "created_utc": "2025-12-29 08:39:41",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nwjp1un",
                  "author": "theArtOfProgramming",
                  "text": "I tried it once a few months ago and no. It seems that if you need vis, you have to convert after doing all your computation.",
                  "score": 3,
                  "created_utc": "2025-12-29 14:09:37",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nwmbqtt",
                  "author": "outofband",
                  "text": "no, but you can use polars for the heavy lifting (loading, transform etc), then just easily convert to pandas dataframes with .to_pandas().",
                  "score": 1,
                  "created_utc": "2025-12-29 21:49:16",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwigv7h",
          "author": "AsparagusKlutzy1817",
          "text": "I developed towards full stack (python-based). I do everything now from collecting data to deploying with a frontend in the cloud (other than Streamlit xD)",
          "score": 9,
          "created_utc": "2025-12-29 08:11:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwjtip4",
              "author": "pepeve1700",
              "text": "Which python-based frontend are you using?",
              "score": 3,
              "created_utc": "2025-12-29 14:35:04",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nwk1f4e",
                  "author": "AsparagusKlutzy1817",
                  "text": "Streamlit for one - which is a Python wrapper and the other is reflex-dev. The latter is a lot more sophisticated than Streamlit but you certainly can do great things with it. Both frameworks produce JS/React under the hood but you don't have much contact with it.",
                  "score": 2,
                  "created_utc": "2025-12-29 15:16:40",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwjdbfe",
          "author": "IlliterateJedi",
          "text": "I have a table at work with tens of millions of rows of product line items that all have vaguely different descriptions for similar products.\n\nThink \"Work surface, 54 in x 36 in\", \"Desktop 72x32\", \"Worksurface 48x24\", etc. Slightly different wording but they're all essentially the top of a desk.  You might have something similar for chairs, e.g., \"Chair\", \"Work chair\", \"Desk seating\", etc.  We have hundreds of product types, and they all have roughly similar descriptions but nothing standardized.\n\nI noodled on ways to group these for a while with various approaches - standardizing the text, looking for similarity between words and n-grams, using various algorithms for clustering  the text.  It turns out the easiest thing to do is to create a list of words that you expect like \"Chair\", \"Work surface\", \"Filing\", etc. and pass that with the description text to an LLM and have it return what word is closest to the description.  It can even give you a confidence, so you can find all the lowest confidence words, which usually means they aren't in your list, add those words to the list, and keep iterating until you more or less have a complete list of product types from the description.\n\nAfter it was all said and done, I grabbed a few hundred lines and manually checked them, and had about a 97% accuracy on product description to product group.  Which is pretty great vs the alternative of trying to manually classify these. \n\nThis saved me tons of time, and having standardized product descriptions has been a god send for all sorts of analyses with regards to pricing, vertical market, etc.",
          "score": 8,
          "created_utc": "2025-12-29 12:56:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwln1sf",
              "author": "LibiSC",
              "text": "Good stuff can you point to your sample code",
              "score": 1,
              "created_utc": "2025-12-29 19:48:46",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nwlsmlc",
                  "author": "IlliterateJedi",
                  "text": "[It's something roughly like this](https://pastebin.com/iQuiaDAa) - I pulled this out of a jupyter notebook from when I was exploring options for problem solving.  It's not exactly cleaned up but it gives you a decent idea of what the process is.",
                  "score": 1,
                  "created_utc": "2025-12-29 20:16:03",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwipbo1",
          "author": "autisticmice",
          "text": "Dask and the geospatial Python ecosystem. Fun, but god Dask is really not mature.",
          "score": 7,
          "created_utc": "2025-12-29 09:31:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwjyh92",
          "author": "dockerlemon",
          "text": "Most important thing I learned was that **not having a \"Feature Store\"is going to make your life extremely hard after model development.**  ; (\n\nIt always leads to a lot of arguments with validation team, data preparation teams and model deployment teams.\n\n\\- You can't easily check for skew in development/deployment. \n\\- You have more adhoc tasks come during the model lifecycle when something go wrong. \n\nSometimes because of lack of infrastructure flexibility you may even think if choosing data science was good choice XD \n\nMy take away from this : If possible always make sure the company/project you are joining has ability to implement solutions from open-source which can make life easier. Usually being in Python + Linux environment will solve most issues.",
          "score": 6,
          "created_utc": "2025-12-29 15:01:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwizegi",
          "author": "dataflow_mapper",
          "text": "A lot of it was less “new algorithms” and more messy real world stuff. Debugging data pipelines that break in subtle ways, dealing with half documented upstream changes, and learning how to ask better questions of stakeholders before touching the data. I also got way better at explaining uncertainty and tradeoffs to non technical people because models rarely fail cleanly. That skill came almost entirely from being thrown into situations where something went wrong and I had to explain it calmly.",
          "score": 4,
          "created_utc": "2025-12-29 11:04:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwk5z7x",
          "author": "fjf39ldj1204j",
          "text": "Transitioned from physics postdoc to an all-purpose “data” role this year.\n\nCompany had me get AWS cloud practitioner cert via udemy, but then had a blast implementing a linear programming script in an Azure Function. Used scipy.optimize.linprog, which was appropriate for the scope of the problem, but cool to hear about ortools in the other thread.\n\nDuring this project Claude Code completely changed my workflow. I eventually narrowed in on a style guide prompt so it writes code very close to my style, and it avoids turning into overly defensive slop. Compared to mere llm copy-paste circa 2023, I’m at least 2x faster.\n\nNow company has me aimed at “Agentic AI” of course, so I’m prototyping chatbots, learning about RAG, langchain, etc. A little worried my next project will be lowcode Copilot Studio/Power Platform.",
          "score": 5,
          "created_utc": "2025-12-29 15:39:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwnn55o",
          "author": "thinking_byte",
          "text": "One thing I picked up mostly through real work was explaining technical decisions to non technical people without oversimplifying or hand waving. That only came from being forced into live conversations where something broke or a deadline slipped. I also got better at scoping problems before touching data, asking what decision this is supposed to inform instead of jumping straight into analysis. That skill never clicked from courses, only from projects where the output actually mattered. I agree the formal training side feels thinner lately. Most of the learning I see now comes from being stretched, not taught.",
          "score": 4,
          "created_utc": "2025-12-30 02:04:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwjmm8d",
          "author": "save_the_panda_bears",
          "text": "Managing up effectively. I was the sole IC on a high stakes/ visibility project reporting up through 4 layers of managers, each with their own (occasionally conflicting) priorities and styles. It taught me a ton about diplomacy and handling strong personalities.",
          "score": 3,
          "created_utc": "2025-12-29 13:55:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwk4x9q",
          "author": "as031",
          "text": "I interned at a hospital last summer and I needed to learn how to use google’s ortools package (constraint programming library) to create a schedule that improved room utilization while meeting some soft and hard constraints. It was awesome learning how to use the package, and it gave a me a lot of flexibility for handling the problem.\n\nI also learned how to use Plotly (great Python viz library) and openpxyl (makes excel sheets) since I needed to actually visualize the schedule so the nurses and attendings could use it. \n\nReally enjoyed the whole process and got some useful skills out of it. Honestly I think learning Plotly and Openpyxl was the best skill I learned here just because of how important communicating the data in simple terms is.",
          "score": 3,
          "created_utc": "2025-12-29 15:34:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwl3aca",
          "author": "nustajaal",
          "text": "I learned how to take an old project running in production and create a new branch using terminal, make large number of improvements to it, test locally, and then commit+push and create pull requests. And yes I used Claude Sonnet inside VS code whenever I needed help. This skill may seem easy for people who come to data science from a CS background but hard for someone who is coming from a core engineering background with domain expertise and not a lot of software engineering experience.",
          "score": 3,
          "created_utc": "2025-12-29 18:16:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwiqo3k",
          "author": "NegativeRegister8999",
          "text": "This is my first year working as a data scientist and technology aside people struggle to take feedback so how do I deal with individuals has changed drastically",
          "score": 2,
          "created_utc": "2025-12-29 09:44:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwjgrwf",
          "author": "addictzz",
          "text": "Tech wise? Spark, in-depth data engineering, and distributed ML.\n\nSoft skill wise? Managing tensions and conflicts, navigating politics.",
          "score": 2,
          "created_utc": "2025-12-29 13:19:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwjk7gg",
              "author": "Wise_Discipline_2860",
              "text": "ahh that's always a hard one",
              "score": 1,
              "created_utc": "2025-12-29 13:41:08",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nwjmovm",
                  "author": "addictzz",
                  "text": "Could probably find a Udemy course about it. But practicing it is the hardest part. I don't have a proper dev/stg environment 🥲",
                  "score": 1,
                  "created_utc": "2025-12-29 13:55:47",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwjlcz6",
          "author": "No_Ant_5064",
          "text": "I learned how to plug numbers into excel and format power point slides to the liking of my superiors. I'm really glad I have an MS in statistics with a focus on big data because this is exactly what the degree prepared me for.",
          "score": 2,
          "created_utc": "2025-12-29 13:48:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwkzssl",
          "author": "Hydreigon92",
          "text": "I learned how to use `dspy` and `langchain` to write LLM-as-a-Judge workflows. I've been playing around with the concept a lot at work.",
          "score": 2,
          "created_utc": "2025-12-29 18:00:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwlsrlm",
          "author": "browneyesays",
          "text": "I improved my resume writing skills 🤣. My raise this year was less than the increase in insurance cost. I was already well below the wage that this position makes at most companies by 20-30%.",
          "score": 2,
          "created_utc": "2025-12-29 20:16:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwmyb72",
          "author": "dmorris87",
          "text": "Few things:\n\n- Arrow for lazy querying Parquet files in S3. So much better than reading hundreds of files into memory.\n\n- Causal inference. Collabed with someone from Dartmouth on a paper describing healthcare program savings. Working on turning the methodology into a systematic causal inference framework for deeper program evaluation. \n\n- AI coding agent",
          "score": 2,
          "created_utc": "2025-12-29 23:47:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwn3awv",
          "author": "BlueSubaruCrew",
          "text": "Unfortunately not much which is why I'm going to try to leave this year. I was in charge of getting everything we had switched from Conda to UV so I guess I \"learned\" that but there's not a whole lot to learn. Outside of work I learned PyTorch which hopefully will be useful and I am now studying for the AWS Certified Solutions Architect exam which I am hoping kind of fills the hole in my resume where I don't use cloud at my job.",
          "score": 2,
          "created_utc": "2025-12-30 00:14:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwnquhs",
          "author": "RecognitionSignal425",
          "text": "Communication. Technical knowledge or algo things are solveable parts. Collaboration is not, and on-point delivery is far more important than solving algo puzzles.\n\nFor example, if you think your chart is clear for outsider to read, trying to read r/dataisbeautiful and see if you can understand the basic/common charts, especially when you're not familiar with the terms/variables.\n\nThe same happened with non-technical stakeholders. Curse of expertise.\n\nThe other thing is to challenge stakeholders at first step. Always asking what's the reason for the ask. Often times, the question is not clear at the beginning. Many people don't know what they want, and frame the question as the wishlist 'Can you increase revenue...?', 'Can you analyze X for opportunities ...?, 'Can you improve X ...?'.... The question is far more important than the solutions.\n\nThe last important thing is to treat DS as a business product, not a scientific output. Product/business teams are not scientists. Scientists work to seek truth. Even then, the truths don't always stand the test of time. Newtons' laws of physics are true until centuries later. And it took almost 100 years before we could support Einstein 's relativity theory.\n\nDS teams in business are not creating new knowledge for truth. The ultimate goal is to create products to improve users/clients' lives.  It's important to be aware that our work are not truths. They are merely confirming or disconfirming evidence that either supports or refutes the viewpoint. The goal, also, is not seeking truth but to mitigate risks.",
          "score": 2,
          "created_utc": "2025-12-30 02:24:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwopo1s",
          "author": "Ancient_Ad_916",
          "text": "This year my job required me to do a lot of data engineering / MLOps since we lost one of our data engineers. So where previously I only worked on functional code (Python) and queries (SQL/SPARQL), I now also had to get on-hands with things like AWS, data pipelines, data model design etc. Not exactly my cup of tea, but nice to become a bit more full stack.",
          "score": 2,
          "created_utc": "2025-12-30 06:01:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwj463q",
          "author": "aegismuzuz",
          "text": "The hardest skill this year has been LLM Observability and Evals. There are no courses for this because the industry itself hasn't figured out how to do it right yet. I had to learn on the fly how to build quality evaluation pipelines, figure out Trulens/Ragas, and write custom metrics just to prove to the business that our RAG isn't hallucinating",
          "score": 4,
          "created_utc": "2025-12-29 11:45:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwj640c",
              "author": "ergodym",
              "text": "Interesting. How did you go about figuring out custom metrics?",
              "score": 2,
              "created_utc": "2025-12-29 12:01:37",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "nwlrll6",
              "author": "browneyesays",
              "text": "I also had to learn this. The way I addressed this was by building out feedback features where internal testing could be done and record responses. I didn’t want to know if it was just hallucinating, but if it was getting the answers wrong or partially correct. My corpus was kind of vague and in some instances contained redundant subsets of information. I just deployed a simple ui and stored the feedback as a dataset and ran python on it to record accuracy overtime.",
              "score": 1,
              "created_utc": "2025-12-29 20:10:58",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nwj9v5s",
          "author": "va1en0k",
          "text": "I'm learning how does one deal with hundreds of different, useful, semi-artisanal, noisy features, how does one make sure they're not going haywire and how to put them all on basically similar footing and avoid most of the \"artisanality\"",
          "score": 1,
          "created_utc": "2025-12-29 12:31:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwkwfbd",
          "author": "recon-ai-demo",
          "text": "Been building a lot of recon tools; learned a great deal about all the functionality that is available in Snowflake SQL from the AI.",
          "score": 1,
          "created_utc": "2025-12-29 17:44:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwmxnqe",
          "author": "tbhoggy",
          "text": "Drywall",
          "score": 1,
          "created_utc": "2025-12-29 23:43:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwovxxm",
          "author": "TheMightySilverback",
          "text": "I learned the ins and outs of of Power BI Administration.",
          "score": 1,
          "created_utc": "2025-12-30 06:53:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwpvado",
          "author": "Huge-Leek844",
          "text": "Patience ",
          "score": 1,
          "created_utc": "2025-12-30 12:11:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwqinxf",
          "author": "BobDope",
          "text": "The skill I didn’t learn was navigating having a narcissistic toxic boss with his head up his ass but I’m being careful in interviews to avoid such types for whatever amount of money",
          "score": 1,
          "created_utc": "2025-12-30 14:38:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwqnauq",
          "author": "Evening_Chemist_2367",
          "text": "DuckDB, GraphRAG, LLM grounding and some other new skills.  Also expanded on other existing skills to automate more of my job.",
          "score": 1,
          "created_utc": "2025-12-30 15:03:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwrhffu",
          "author": "Electronic-Job-9042",
          "text": "Microsoft Fabric",
          "score": 1,
          "created_utc": "2025-12-30 17:26:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwiiuj6",
          "author": "FromLondonToLA",
          "text": "Had a goal to learn python. Started using to build a statistical model with Gemini's help and VSCode. Ran into some issues so switched to Cursor. Cursor did all the code for me. So I would say I learned how to use Cursor and learned very little python.",
          "score": -1,
          "created_utc": "2025-12-29 08:30:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwj4nvk",
              "author": "aegismuzuz",
              "text": "That's a dangerous trap. The problem will hit the moment Cursor writes a subtle bug that it can't diagnose itself because it lacks full system context. That's when the skill of \"understanding Python\" becomes critical, because you'll be left alone with code you didn't write but now have to maintain. So, I definitely recommend actually learning Python..",
              "score": 6,
              "created_utc": "2025-12-29 11:49:54",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nwj74ek",
                  "author": "FromLondonToLA",
                  "text": "Yea, that was my takeaway as well. I have enough general coding knowledge to be able to tell if what cursor said was doing with for loops and included ranges was what I wanted for my relatively simple use case. But it was getting close to the danger zone of going beyond my knowledge. \nThe company leadership is keen on pushing AI use everywhere for productivity and in this case I completed the analysis far more quickly than if I had type every character by myself. But I can't say I learned much.",
                  "score": 6,
                  "created_utc": "2025-12-29 12:09:50",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwiofft",
          "author": "Acrobatic-Bass-5873",
          "text": "Machine Learning, AI, Data Science, GenAI.\n\n  \nEdit: Idk why the downvotes lol but I was paid to write technical blogs and hence had to learn them. Why the hate?",
          "score": -6,
          "created_utc": "2025-12-29 09:22:59",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pu71am",
      "title": "Chemist Turned Data Scientist: Looking for Career Development Advice in Hybrid Roles",
      "subreddit": "datascience",
      "url": "https://www.reddit.com/r/datascience/comments/1pu71am/chemist_turned_data_scientist_looking_for_career/",
      "author": "norfkens2",
      "created_utc": "2025-12-23 22:28:20",
      "score": 37,
      "num_comments": 16,
      "upvote_ratio": 0.89,
      "text": "Hi everyone, \n\nI'm looking for advice on career development and would appreciate input from different perspectives - data professionals, managers, and chemist or folks from adjacent fields (if any frequent this subreddit).\n\n\n**About me:**\n\n- I'm a trained chemist and have been working as a data scientist for three years \n\n- my current role is a hybrid one: I generate business value from data through ad-hoc analyses, data sourcing, workflow optimisation and consulting.\n\n- I typically work on chemical process optimisation but also on numeric problems in python, and recently started exploring LLMs (which has only a limited application to our work).\n\n- I also manage projects and implement available tools that help teams work more efficiently.\n\n\n**What I enjoy:**\n\n- working with people to solve challenging problems \n\n- enabling others by providing better tools and processes\n\n- stay technical enough to understand and contribute, but not going too deep into code or algorithms /every day/.\n\n\n**Current observations:**\n\n- the chemical industry is relatively conservative with lower digital maturity compared to other sectors. Certifications tend to be valued more than in pure data science environments (at least in Germany).\n\n- my data science work is often basic - ML has only come up once in three years (in a very minor capacity)\n\n\n**Areas I'm considering for development:**\n\n- Numeric problem-solving\n\n- Operations Research (I've started to learn but no certification yet) \n\n- Business intelligence / Analytical Operation (e.g. building better data pipelines to enable my coworkers; Snowflake want necessary yet, plus silos are a real challenge) \n\n- as a new area: possibly Supply Chain, as it seems relevant to my experience in manufacturing, chemical processes and quality support. \n\n\n**Questions for you:**\n\n1) What certifications or skills would you recommend for someone in a chemistry + data hybrid role?\n\n2) are there other areas in chemical or pharmaceutical companies where such a hybrid profile could add value?\n\n3) how can I best identify roads or projects with strong overlap between chemistry and data science? \n\n4) from a management perspective, what qualities or experiences should I build now to prepare for leadership in this space?\n\n5) any general advice on networking or positioning myself for the next step? \n\n\nI already hold a PhD, so I'm not looking for another degree - but I'm open to targeted certifications or practical learning paths.\n\nThanks in advance for your insights!\n\n(Also posted in r/chempros for additional perspectives)",
      "is_original_content": false,
      "link_flair_text": "Career | Europe",
      "permalink": "https://reddit.com/r/datascience/comments/1pu71am/chemist_turned_data_scientist_looking_for_career/",
      "domain": "self.datascience",
      "is_self": true,
      "comments": [
        {
          "id": "nvn5gl2",
          "author": "Sebyon",
          "text": "Hey mate, you'd be surprised how many chemists turn to the dark side. I do more chemistry adjacent DS work these days, but I've found a good niche. I can say it is growing however as more people realise there is a tonne of gaps in these more conservative fields, and claimed \"data scientists\", good or bad, are rushing in. \n\nWe had a self-claimed data science present at a conference this year about the marvel of Power BI. Audience lapped it up. Yes, some fields are still this far behind. The time to get in is now.\n\nIt's a good thing you're doing process optimisation / numeric problems. These are hot and will be in-demand for a while.\n\nChemistry as a whole, especially academia, will be resistant to the more fun ML projects. We like white-box solutions. \n\nI wouldn't worry about certification. If anything, learn to \"properly\" code. Try to do a simple project in another language / framework that puts you out of your comfort zone. This will easily set you apart technically from other people in the field. \n\nAs a chemist, you're probably aware of a tonne of work we do that could be done by a guy off the street with at least a weeks worth of training. These are the projects you want to look out for. Portable spectrometers and miniaturised instrument are advancing rapidly. I had a project where we got to train a chemometric model to allow in-field analysis, rather than await 3 weeks for lab results. It was a heap of fun. If you want fun work, analytical chemistry where there is a time and cost saving will be where a lot of fun work will be.\n\nAs for the best soft skill to learn, it will be communication to upper management and your target audience. You'll need to be able to \"sell\" your analysis/models so to speak. Most people don't understand basic statistics, let alone chemistry. Learn to simplify and explain the cost/benefits to the layperson. This will take you far. It took me a while to break out of the rigor that academia makes you speak.",
          "score": 15,
          "created_utc": "2025-12-24 01:12:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwcmbau",
              "author": "Horror-Blueberry6411",
              "text": "The part about Power BI getting applause hits too close to home lmao. But seriously, that analytical chemistry angle sounds like where the real opportunities are - especially with how fast portable instruments are getting better\n\n  \nThe communication thing is huge too, I've seen brilliant chemists completely bomb presentations because they couldn't explain why their work mattered to anyone outside the lab",
              "score": 2,
              "created_utc": "2025-12-28 11:47:27",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nvptbqv",
              "author": "norfkens2",
              "text": "Thanks for your detailed answer;\n\n> you'd be surprised how many chemists turn to the dark side.\n\nhttps://i5.walmartimages.com/seo/Come-to-the-Dark-Side-We-Have-Cookies-David-Goliath-Laminated-Poster-36-x-24_bcba8bd0-3e5f-416a-aebe-5b83bb77cac6.b311eaa9be3af8f3df8b2b41461b7323.jpeg\n\nGood to know. A couple of years back Chem+DS was really sparsely populated. I'm happy that has changed. Being in a niche had a lot of advantages. It does make it difficult to find people in similar situations. So, thanks for engaging!\n\n> people realise there is a tonne of gaps in these more conservative fields\n\nI'm happy that more non-techies are realising the need for closing these gaps. Also, good to see that the in not alone with my judgement on the conservative nature.\n\n> present at a conference this year about the marvel of Power BI. Audience lapped it up.\n\nYes, that's the level. I mean, at the end of the day I want to create value with data. If it's PowerBI, then it's PowerBI. SharePoint, lists and Power automate are another one. I'll aim at implementing a methodology and data culture - a bigger picture rather than just a solution to a problem. In the end, it's where the value lies for my colleagues. So, I'll be tool-agnostic.\n\n> It's a good thing you're doing process optimisation / numeric problems. These are hot and will be in-demand for a while.\n\nCheers, this makes me feel validated.\n\n> Chemistry as a whole, especially academia, will be resistant to the more fun ML projects. \n\nThe issues I see are:\n\n- implementation (too many silos)\n- oftentimes relatively small datasets compared to the number of variables \n\nML didn't make a lot of sense in many of the cases I've seen. So, it's a specialised tool unless and until the data maturity will have increased.\n\n> We like white-box solutions.\n\nI've never heard that term before. Is that like a ready-made solution - or is it about transparent solutions?\n\n> If you want fun work, analytical chemistry where there is a time and cost saving will be where a lot of fun work will be.\n\nI didn't have this on my list. Thanks for the pointers!\nI'll look into where process optimisation via analytics prediction could be VB implemented.\n\n> As for the best soft skill to learn, it will be communication to upper management and your target audience. You'll need to be able to \"sell\" your analysis/models so to speak. \n\nValuable advice, thanks! I've had more exposure to higher management. They operate on a different level altogether and tend to trust their people about the technical minutia. 😄\n\nAnd yes. Story telling is so so important. I pride myself in being able to make presentations that are accessible to everyone. That's something I've got on my to-do list for the next year actually.",
              "score": 1,
              "created_utc": "2025-12-24 13:50:40",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nvnar0m",
          "author": "Intrepid-Self-3578",
          "text": "Hi Operational research  is a good place to be. That is required for supply chain as well. \n\n\nAnd try to go into roles that requires your domain knowledge it will be difficult to get into other industries and you won't have a moat. \n\n\nTry to do identify usecases within your work. \n\n\nChemistry similar to life science will require explainable solutions or one you could defend focus on that more. ",
          "score": 3,
          "created_utc": "2025-12-24 01:45:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvpvkh2",
              "author": "norfkens2",
              "text": "Thanks for the feedback. Good to know that I'm on the right track re OR!\n\n> And try to go into roles that requires your domain knowledge it will be difficult to get into other industries and you won't have a moat. \n\nYeah, I've realised that. It's kinda limiting and very difficult to break out of chemistry. Even after more than a decade in this sector, I can't quite make sense of why that is. Most of my skills are transferable and I think I can show that I'm also not stupid.\n\n> you won't have a moat\n\nI didn't quite understand this. What did you mean by it?\n\n> Try to do identify usecases within your work. Chemistry similar to life science will require explainable solutions or one you could defend focus on that more. \n\nSolid advice, also you're confirming my experience!  Being in a niche, it's good to have outside confirmation every once in a while. Thanks a lot! ❤️",
              "score": 1,
              "created_utc": "2025-12-24 14:04:41",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nvqfgfs",
                  "author": "Intrepid-Self-3578",
                  "text": "Your domain knowledge is an advantage. If you go to other domains it will  be difficult to compete with ppl from the same domain. ",
                  "score": 1,
                  "created_utc": "2025-12-24 15:57:44",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nvnqiwq",
          "author": "EggsAndBakie",
          "text": "Have you considered roles in the materials informatics field? There’s Citrine Informatics, Alchemy Cloud, Albert Invent, NobleAI, alcemy, Uncountable, Potion AI, Turing Labs, FutureHouse/Edison Scientific and others. You could consider solutions engineering roles which require a mix of technical and interpersonal work. \n\nThere are certainly roles across the industry that value a hybrid Chem/DS skill sets. You might find them within teams labeled as “data science”, “cheminfomatics”, “digitalization”, or elsewhere. Some such roles will exist in supply chain and OR teams as well, though you likely won’t dive as deep into your chemistry domain knowledge there. Some teams work with a lot of siloed and non-interoperable data and don’t even know they need a “data person” yet. \n\nOverall, the industry is adopting AI/ML relatively slowly due to its conservatism. Chemical and materials manufacturers will adopt AI/ML more broadly, but it will take time. This means that the sort of opportunities you’re looking for are available and will grow over time, but they’ll grow slowly (like most things in the industry).\n\nAs for what to focus on, I’d recommend prioritizing projects that you can connect to your company’s bottom line. If it saves cost that’s good; if it increases revenue that’s even better.",
          "score": 2,
          "created_utc": "2025-12-24 03:25:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "nw03d4f",
              "author": "norfkens2",
              "text": "Huh, materials Informatics sure has changed since the arrival of neutral nets.\nI dabbled in it before but it wasn't a promising direction at the time. I'll have a look what these companies do, exactly. Thanks for the pointers! 🙂",
              "score": 1,
              "created_utc": "2025-12-26 09:50:34",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nvst7ee",
          "author": "brb_lux",
          "text": "What i would do is learn more about electronics and start working on telemetry for reactors/production lines. You’ll learn where to place the sensors and do systems modeling to optimize factory or laboratory performance tracking. \n\nYou’ll see what data science frameworks can be used as a blueprint to do quality control, and so on. \n\nAs far as leadership goes, be the best at your job and show off whenever possible.",
          "score": 2,
          "created_utc": "2025-12-25 00:22:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "nw11hza",
              "author": "norfkens2",
              "text": "Thanks for the pointers! \n\n> As far as leadership goes, be the best at your job and show off whenever possible.\n\nThat's very straightforward advice. 😄 Thanks a lot!",
              "score": 1,
              "created_utc": "2025-12-26 14:35:53",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nvtyz6t",
          "author": "Analytics-Maken",
          "text": "The data silo problem you called out is huge. I've seen companies waste months connecting different systems for basic reporting. The gap is usually getting clean data into one place where people can actually use it. You can use ETL tools like Windsor ai to fill that gap and automate it, hands on projects work demonstrates values faster than credentials.",
          "score": 1,
          "created_utc": "2025-12-25 05:48:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "nw12hzp",
              "author": "norfkens2",
              "text": "Yeah, I'm living it. I've spent months looking for someone who can help me in my quest to establish a particular pipeline.\n\nThe data isn't even anything out of the ordinary, it's used by almost everyone on a daily basis - via excel export... *head => table*\n\nI've started to offer a regular manual download as a service, in order to avoid the frustration.",
              "score": 2,
              "created_utc": "2025-12-26 14:42:07",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nw3uouv",
                  "author": "Analytics-Maken",
                  "text": " What's the data source you're trying to connect to? There might be a prebuilt connector available",
                  "score": 1,
                  "created_utc": "2025-12-26 23:51:36",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1pyct4y",
      "title": "Modern Git-aware File Tree and global search/replace in Jupyter",
      "subreddit": "datascience",
      "url": "https://www.reddit.com/r/datascience/comments/1pyct4y/modern_gitaware_file_tree_and_global/",
      "author": "Sudden_Beginning_597",
      "created_utc": "2025-12-29 04:40:47",
      "score": 19,
      "num_comments": 5,
      "upvote_ratio": 0.95,
      "text": "I used jupyter lab for years, but the file browser menu is lack of some important features like tree view/aware of git status; I tried some of the old 3rd extensions but none of them fit those modern demands which most of editors/IDE have(like vscode)\n\nso i created this extension, that provides some important features that jupyter lab lack of:\n\n**1. File explorer sidebar with Git status colors & icons**\n\nhttps://preview.redd.it/og04weg6o2ag1.png?width=1194&format=png&auto=webp&s=864e7db14d8328425c348a253c9dc7061142c46a\n\nBesides a tree view, It can mark files in gitignore as gray, mark un-commited modified files as yellow, additions as green, deletion as red.\n\n**2. Global search/replace**\n\nGlobal search and replace tool that works with all file types(including ipynb), it can also automatically skip ignore files like venv or node modules.\n\nhttps://preview.redd.it/2uzvph8zn2ag1.png?width=750&format=png&auto=webp&s=f4b81ab1f6e73ace2f3eca40af2eee6d65f720f9\n\n**How to use?**\n\npip install runcell\n\nLooking for feedback and suggestions if this is useful for you :)",
      "is_original_content": false,
      "link_flair_text": "Tools",
      "permalink": "https://reddit.com/r/datascience/comments/1pyct4y/modern_gitaware_file_tree_and_global/",
      "domain": "self.datascience",
      "is_self": true,
      "comments": [
        {
          "id": "nwiqjuu",
          "author": "SevPoha",
          "text": "I wonder what benefit does this native jupyter even provide. I can't imagine going back to this after using Jupyter in VSC",
          "score": 4,
          "created_utc": "2025-12-29 09:43:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwkkyrj",
              "author": "Sudden_Beginning_597",
              "text": "vscode is great, i love using it but i also love jupyter. i just want to fill the experience gap between vscode and jupyter in future, this can be a start.",
              "score": 2,
              "created_utc": "2025-12-29 16:50:38",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwrrogc",
                  "author": "SevPoha",
                  "text": "Yeah I totally respect your effort. My question was in general to everyone, not specifically related to your post and what you've done",
                  "score": 1,
                  "created_utc": "2025-12-30 18:14:23",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nwktbkt",
              "author": "ObservedCat",
              "text": "At least Jupyter is a non profitable org, while ms behind vscode is not. Product owned by community vs product owned by company",
              "score": 1,
              "created_utc": "2025-12-29 17:30:12",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nwrripu",
                  "author": "SevPoha",
                  "text": "How does that make a difference for me? At the end I'm getting a better experience at 0 cost and can do LOTS of things in one single platform that can't be done in Jupyter",
                  "score": 1,
                  "created_utc": "2025-12-30 18:13:40",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1pu8h8d",
      "title": "Resources for learning Neural Nets, Autoencoders (VAEs)",
      "subreddit": "datascience",
      "url": "https://www.reddit.com/r/datascience/comments/1pu8h8d/resources_for_learning_neural_nets_autoencoders/",
      "author": "redditisthenewblak",
      "created_utc": "2025-12-23 23:32:55",
      "score": 18,
      "num_comments": 7,
      "upvote_ratio": 0.93,
      "text": "Can someone point me to resources on learning Neural Nets and Variational Autoencoders?\n\nMy past work has mostly been the “standard” scikit-learn suite of modeling. But now I’m placed in a project at work that is a HUGE learning experience for me.\n\nWe basically have financial data and we’re trying to use it in a semi-unsupervised way. We’re not entirely sure what the outcome should be, but we’re trying to use VAEs to extract relationships with the data.\n\nConceptually I understand neural networks, back propagation, etc, but I have ZERO experience with Keras, PyTorch, and TensorFlow. And when I read code samples, it seems vastly different than any modeling pipeline based in scikit-learn.\n\nSo I’m basically hitting a wall in terms of how to actually implement anything. And would love help or being pointed in the right direction.\n\nThanks!",
      "is_original_content": false,
      "link_flair_text": "ML",
      "permalink": "https://reddit.com/r/datascience/comments/1pu8h8d/resources_for_learning_neural_nets_autoencoders/",
      "domain": "self.datascience",
      "is_self": true,
      "comments": [
        {
          "id": "nvnvc4a",
          "author": "davidrwasserman",
          "text": "I learned PyTorch by working through the course material at [https://web.eecs.umich.edu/\\~justincj/teaching/eecs498/FA2019/schedule.html](https://web.eecs.umich.edu/~justincj/teaching/eecs498/FA2019/schedule.html)",
          "score": 6,
          "created_utc": "2025-12-24 03:56:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvops6a",
              "author": "redditisthenewblak",
              "text": "I read thru a couple of the “lab” pages and those were especially helpful",
              "score": 1,
              "created_utc": "2025-12-24 08:05:19",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "nw13xme",
              "author": "Dull-Pomegranate-626",
              "text": "Oh! I needed this.. Surely gonna look at this later on.✌️",
              "score": 1,
              "created_utc": "2025-12-26 14:50:58",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nvnud40",
          "author": "PCVUlcumayo",
          "text": "I’ve enjoyed https://d2l.ai/  which has code examples in tensorflow and PyTorch. ",
          "score": 5,
          "created_utc": "2025-12-24 03:49:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvoppry",
              "author": "redditisthenewblak",
              "text": "I think this is an excellent starting point, thank you!",
              "score": 1,
              "created_utc": "2025-12-24 08:04:41",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nw6g9gk",
          "author": "Suspicious_Jacket463",
          "text": "Understanding Deep Learning by Prince",
          "score": 1,
          "created_utc": "2025-12-27 12:03:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvs83fq",
          "author": "scientificMind321",
          "text": "read a lot  research papers in AI and start implementing basic neural networks in pyTorch. Eventually you will get a hang of it. Good luck",
          "score": 0,
          "created_utc": "2025-12-24 22:00:27",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pytfq7",
      "title": "How to prepare for three live coding rounds with almost no info?",
      "subreddit": "datascience",
      "url": "https://www.reddit.com/r/datascience/comments/1pytfq7/how_to_prepare_for_three_live_coding_rounds_with/",
      "author": "Fig_Towel_379",
      "created_utc": "2025-12-29 18:08:52",
      "score": 14,
      "num_comments": 20,
      "upvote_ratio": 0.85,
      "text": "I have 3 live coding rounds coming up, each around 30 minutes. The recruiter has not shared any details yet since most people are out of office. My interview is in 10 days, but it sounds like I might not get specifics until a couple of days before.\n\nInstead of waiting, I want to start preparing now. My best guess is that one round will be SQL, one will be pandas, and one might be LeetCode style problems. I really dislike this kind of guessing game, but that is the situation.\n\nWhat do you think is the best way to prepare given this level of uncertainty?",
      "is_original_content": false,
      "link_flair_text": "Career | US",
      "permalink": "https://reddit.com/r/datascience/comments/1pytfq7/how_to_prepare_for_three_live_coding_rounds_with/",
      "domain": "self.datascience",
      "is_self": true,
      "comments": [
        {
          "id": "nwl43qh",
          "author": "MattDamonsTaco",
          "text": "Anytime I start prepping for interview cycles, I just start doing practice coding on any of a number of different platforms.\n\nI used stratascratch.com for my last cycle after I took a year off to have fun. Worked great. \n\nThere are lots of other options.",
          "score": 23,
          "created_utc": "2025-12-29 18:20:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwlaz6m",
          "author": "Single_Vacation427",
          "text": "I would practice: (1) SQL, (2) python, group by, aggregates, same as sql (3) writing function with python for, for instance standard deviation calculation or moving average, recoding a variable or creating a new variable based on other columns in a table, (4) very simple leet code, because you won't have time for a lot of leet code",
          "score": 13,
          "created_utc": "2025-12-29 18:51:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwlfazi",
              "author": "Fig_Towel_379",
              "text": "Thank you!",
              "score": 1,
              "created_utc": "2025-12-29 19:11:39",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwle1tt",
          "author": "AlexMourne",
          "text": "I usually have only 1-2 life coding interviews and both of them are just medium tasks from LeedCode. Once I had 3 interviews and all of them were LeetCode just with different interviewers\n\n\nOnly ones I had two different interviews where they asked me about both python and SQL. \n\n\nI'd spent 60% of time refreshing basic ways to solve LeetCode tasks, 20% to refresh the SQL\nand 20% for Pandas, Numpy and Sclearn  just in case",
          "score": 4,
          "created_utc": "2025-12-29 19:05:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwlfdr4",
              "author": "Fig_Towel_379",
              "text": "Thank you! Do you mind sharing what kind of leetcode problems did you get?",
              "score": 1,
              "created_utc": "2025-12-29 19:12:01",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwlhknj",
                  "author": "AlexMourne",
                  "text": "Depending on the company but usually something simple like \"finding some specific substring\" or \"checking if the string is a palindrome\". Several times I had a task where \"sort by counting\" was the solution. The most difficult one that I got was to write a serializer/deserializer of binary tree into a string, but it was only because I've solved the initial task very fast and had plenty of time, so do not worry about this. \nJust start with the easiest tasks from all the main topics on LeetCode - most probably you will get one of them. Understand the main principle. Only then go to the medium tasks. Do not even touch the hard ones - you do not need it. The interviewera mostly check the way of your thinking - it is good if you can explain not only why the solution is working but it is optimal. Knowing O(n) notation is must have",
                  "score": 1,
                  "created_utc": "2025-12-29 19:22:32",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwla9lz",
          "author": "mogtheclog",
          "text": "I'd broaden pandas to general data cleaning/manipulation, but otherwise agree with your guesses",
          "score": 1,
          "created_utc": "2025-12-29 18:48:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwlk550",
          "author": "Wishwehadtimemachine",
          "text": "Go buy the leetcode 1 month subscription. Sort SQL/Pandas problems by frequency and start doing them. If a problem seems really out of left field feel free to skip. I believe this can be done in 10 days.\n\nIf by \"LeetCode style problems\" you mean DSA/Algo problems 10 days is too short imo but can try same method + brushing up on python fundamentals.",
          "score": 1,
          "created_utc": "2025-12-29 19:34:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwlkw3k",
              "author": "Fig_Towel_379",
              "text": "Thanks, I do have a leetcode yearly subscription. Have been doing DSA for about a month, still very beginner but have some idea of basic problems. I am pretty comfortable with SQL and Pandas. It’s just the leetcode style that I am nervous about.",
              "score": 1,
              "created_utc": "2025-12-29 19:38:26",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwlmrlj",
                  "author": "Wishwehadtimemachine",
                  "text": "Ah gotcha! Sounds like you're pretty well prepared relativity speaking. Yea on the DS/Algo front it's difficult to winnow since it's so broad and company dependent. Since time is short I'd focus on the less-cs oriented topics like two pointer, hashmaps, queues/stacks in contrast to linked lists,trees, graphs and dp. FWIW, I've only been asked the latter for FAANG level companies.  \n\nBest of luck nonetheless!",
                  "score": 1,
                  "created_utc": "2025-12-29 19:47:24",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwnm1dj",
          "author": "thinking_byte",
          "text": "When the scope is that vague, I would optimize for fundamentals rather than trying to guess formats. For SQL, be very fluent with joins, group by, window functions, and reading messy tables out loud. For pandas, practice loading data, cleaning it, and explaining each step as you go. Most live rounds care as much about how you think and communicate as the final answer. I would also rehearse talking while coding, because silence tends to be what sinks people. Ten days is enough to get sharp if you focus on core patterns instead of grinding edge cases.",
          "score": 1,
          "created_utc": "2025-12-30 01:58:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwoz663",
              "author": "Flashy_Reception1385",
              "text": "Focusing on fundamentals is the right call, and I’d make it even more structured. Treat the next 10 days like short daily sprints: 45–60 minutes of SQL (joins, window functions, subqueries, CTEs), 45 minutes of pandas (groupby, merges, time series, missing data), then 30 minutes of easy/medium LeetCode with a timer. Always talk through your plan before you type: inputs, outputs, edge cases, then implementation. Record yourself once a day and listen back; you’ll hear where you ramble or go silent. For pandas and SQL, use 1–2 real datasets and keep re-framing questions on the same data instead of hopping around. Tools like dbt, Airbyte, and even something like DreamFactory for quick REST APIs over your practice database can give you realistic scenarios to describe if they ask about “how you work in practice.” Stick to repeatable patterns so you sound calm and deliberate in the live rounds.",
              "score": 1,
              "created_utc": "2025-12-30 07:21:27",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nwoncqk",
          "author": "Ancient_Ad_916",
          "text": "Is this style of interview common where you are from? Here in the Netherlands I always get to take my coding assignments home (with around a 1 day deadline)",
          "score": 1,
          "created_utc": "2025-12-30 05:43:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwqg1gq",
          "author": "KitchenTaste7229",
          "text": "If it's a bigger, more well-known company, see if you can find interview experiences on Glassdoor or similar sites for interview guides, as they typically give you a sense of the topics they focus on. Since you suspect SQL and Pandas, I'd hammer those. For SQL, practice window functions and optimization. For Pandas, just know your groupby's and how to efficiently manipulate dataframes. As for the LeetCode part, just grind easy/medium problems; 30 minutes isn't much time, so they're unlikely to throw anything too wild at you. Also practice explaining your reasoning as you code, it also helps retain core patterns in your memory.",
          "score": 1,
          "created_utc": "2025-12-30 14:24:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwqueg7",
          "author": "Majestic-Round-6667",
          "text": "SQL and leetcode is a pretty standard mix for data focused roles and 10 days isn't much time to prep everything so focus on common patterns for each so I would suggest you use something like interviewcoder during the actual live rounds to cheat instead of trying to cram everything in 10 days",
          "score": 1,
          "created_utc": "2025-12-30 15:38:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwrf6s3",
          "author": "afahrholz",
          "text": "this is a solid thinking, prepping sql pandas and practice problems sounds like a great plan with the uncertainty you have got keep practicing and you'll feel more confident as the interview nears",
          "score": 1,
          "created_utc": "2025-12-30 17:16:32",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pwysz9",
      "title": "PhD microbiologist pivoting to GCC data analytics. Is a master’s needed or portfolio and projects sufficient?",
      "subreddit": "datascience",
      "url": "https://www.reddit.com/r/datascience/comments/1pwysz9/phd_microbiologist_pivoting_to_gcc_data_analytics/",
      "author": "DataAnalystWanabe",
      "created_utc": "2025-12-27 14:15:12",
      "score": 9,
      "num_comments": 26,
      "upvote_ratio": 0.7,
      "text": "I am finishing a wet-lab microbiology PhD. Over the last year I realised that I prefer data work. I use R, Excel and command line regularly and want to move toward analytics roles in industry rather than academic biology.\n\nMy target is business-focused or operational analytics rather than bioinformatics. Long term I am looking at GCC markets, so I expect competition with candidates who already come from consulting or commercial backgrounds.\n\nMy question is: Should I spend time and money on a taught master’s in data/analytics/, or build a portfolio, learn SQL and Power BI, and go straight for analyst roles without any \"data analyst\" experience? I feel like i'm in a difficult spot either way...\n\nI want to hear from people who actually switched from research into analytics or consulting. What convinced your employers:\n\n\\- another degree  \n\\- certifications  \n\\- portfolio projects  \n\\- internships  \n\\- networking and referrals\n\nOf course a mix of them would be ideal. I get that.\n\nIf you need context to give a useful answer, say what you need and I’ll add it. Or we can talk privately if you'd like.\n\nThanks in advance :)",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/datascience/comments/1pwysz9/phd_microbiologist_pivoting_to_gcc_data_analytics/",
      "domain": "self.datascience",
      "is_self": true,
      "comments": [
        {
          "id": "nw712qp",
          "author": "Astrobot3",
          "text": "I went from academia (astrophysics) to data science within finance without any extra certifications, albeit after many years of postdoc experience. I think the biggest thing you might be missing is SQL, but ultimately you will need someone willing to take a chance on a slightly unusual background so job searching will probably take longer. \nWhat I basically did was translate the data work I had done (including some machine learning which helped a lot) into corporate terms, and emphasize my ability to learn fast and synthesize large amounts of complex data into both papers for a techical audience and outreach for a general audience.",
          "score": 14,
          "created_utc": "2025-12-27 14:31:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "nw76nmd",
              "author": "DataAnalystWanabe",
              "text": "Hi, thanks for your reply. It's much appreciated. I’m currently learning SQL and planning Power BI. I just worry a bit and wonder whether employers in industry value a portfolio of projects more than another taught degree as their main competence/credibility assessor.",
              "score": 1,
              "created_utc": "2025-12-27 15:04:51",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwaxgi7",
          "author": "autumnotter",
          "text": "I made the switch and am now successful as a solutions architect in big data and AI, but it was about ten years ago now, and I had six years of postdoc experience with 15+ publications and was competitive for assistant prof positions at the time.\n\n\nDon't bother with additional degrees. Work experience outside academia or in ways respected outside academia is the most useful thing you can have. So get a job. Any job.\n\n\nSome specifics - IMO SQL and Python are table stakes these days though I have friends still successfully using R I wouldn't hire anyone without Python experience (or Scala/Rust potentially) personally.\n\n\nLearn some of the basics of what it takes to be successful with a biological domain as your background. Can you speak to pharma? Healthcare? I couldn't at the time so I had to up skill technically until I could. Consulting would be a good route if you can get a role. Don't expect to skate by, everything will be a huge learning experience. Try to understand git, deployment environments, SWE, etc. and make a niche for yourself.",
          "score": 4,
          "created_utc": "2025-12-28 03:17:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwcp0fs",
              "author": "DataAnalystWanabe",
              "text": "I appreciate that advice. Thanks",
              "score": 1,
              "created_utc": "2025-12-28 12:11:06",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nw79jm7",
          "author": "KitchenTaste7229",
          "text": "This comes up a lot with PhDs pivoting out, and most hiring managers care more about proof you can do business analytics than another degree. A strong portfolio that shows SQL, basic modeling, and how you turn messy data into decisions usually beats a generic master’s, especially since you already have a PhD signal. The biggest gap to close is commercial context, so projects framed around ops metrics, cost drivers, or dashboards matter more than fancy stats. People I’ve seen make this switch leaned on [projects](https://www.interviewquery.com/p/data-analytics-project-ideas-and-datasets) plus referrals rather than cert stacking.",
          "score": 2,
          "created_utc": "2025-12-27 15:21:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "nw8n9x1",
              "author": "DataAnalystWanabe",
              "text": "I really appreciate that and I will certainly look into those project recommendations.\n\nDo you think I should learn SQL by starting with the projects or learn the syntax through tutorials and then apply them to a project?",
              "score": 1,
              "created_utc": "2025-12-27 19:34:15",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwbl6ef",
          "author": "G-R-A-V-I-T-Y",
          "text": "PhD is likely sufficient to get an interview with many of the major firms for DS. The main question is can you pass the interview. If you study hard to be able to answer AB testing and product type questions confidently then you’d be able to get it without a problem. \n\nI work at one of the big 4 tech firms and we take phds from STEM all the time for intro DS roles. As long as they can pass the interview…",
          "score": 2,
          "created_utc": "2025-12-28 06:00:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwcpvom",
              "author": "DataAnalystWanabe",
              "text": "That's very encouraging. Thanks for sharing that insight. I've never considered that I'd be in a position to do consulting.",
              "score": 2,
              "created_utc": "2025-12-28 12:18:32",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwed98s",
                  "author": "G-R-A-V-I-T-Y",
                  "text": "My pleasure! Also Data Science is typically one notch above analytics and consulting in the field. I.e. I’d sooner apply for a job as a DS than either of those, you’ll be paid more, and not have to travel all the time.\n\nAnalyst role = bitch work, lower pay\nConsulting = never home, treated poorly \nI personally wouldn’t go for either of those roles unless I had serious problems getting a DS role anywhere else, even for a lower tier firm. \n\nYMMV. Good luck!",
                  "score": 2,
                  "created_utc": "2025-12-28 18:00:37",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwj7ng6",
          "author": "aegismuzuz",
          "text": "Another Master's degree will look like spinning your wheels or even a step backward. The market (especially in GCC) loves titles, but PhD already beats MSc. Spend your time not on uni, but on pet projects that solve boring business problems (inventory optimization, churn prediction) rather than scientific ones. Employers don't care about p-values; they care about \"how much money we will save\"",
          "score": 2,
          "created_utc": "2025-12-29 12:14:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw76h5m",
          "author": "redisburning",
          "text": "It's hard to say what the best way to approach is, unfortunately. The market is incredibly bad for juniors, and I had the benefit of making the switch from academia during the Obama administration (and have switched once again to more writing libraries for other data scientists in an SWE capacity). IME recruiters are mostly... *doing their own thing* so there is a separate conversation about tailoring your resume and skills to their tastes. So take the following with a grain of salt.\n\nIn terms of what I personally like to see, I'd recommend picking up Python, SQL and if you want to be extra spicy the basics of git.\n\nI've interviewed tons of people for junior DS roles and I have a strong preference for people coming out of hard/social sciences (or frankly, 12th century French Literature) than dedicated DS master's programs. My hot take is that the \"Data Science\" degree appears to prepare people for working as a data scientist about as much as a compsci undergraduate degree prepares people to be software engineers.\n\nIn general, without prior industry experience neither researchers from other disciplines nor the people with data science degrees tend to walk in the door with the skills they need to do the day to day job. But, while the data science degrees apparently focus on the mechanical techniques of the job (which then have to be discarded), science background folks tend to at least be taught the fundamentals underpinning methodologies and good data hygiene which are relevant in a roundabout way and make it easier to succeed. I don't feel like it's the level (PhD vs MA) inasmuch as the point of the data scientist's job is to have good critical thinking skills (i.e. to figure out the real question being asked and how to pick from the big toolbox of tools to answer it best). So, that DS masters, to me anyway, is just signalling. And maybe that's fine, and maybe that is what gets you the job. But I have to actively fight against my own internal biases when a resume is given to me to evaluate with a data science master's on it.\n\nIt's worth noting that my opinion *does* actually matter, but I only screen resumes *after* the recruiter gets to look at them and so I'm more of a veto-ing member of the process.",
          "score": 3,
          "created_utc": "2025-12-27 15:03:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwaibvl",
              "author": "DrXaos",
              "text": "I think the PhD does matter as it’s indirectly filtering: selection for a funded PhD at a major research university is much stricter than a student pay MS.\n\nand I agree that it’s the scientific mindset.",
              "score": 2,
              "created_utc": "2025-12-28 01:47:01",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nw7h6vl",
              "author": "volkoin",
              "text": "Most ms ds degrees are probably are how you describe. But I think there are two things that matter in an ms program: i. If you can get feedback for your projects from the instructors; ii. If you can have opportunity or are promoted to work on good ds projects where you define the problem and find the relevant data by your own and can produce useful insights for a business. \n\nIn my country degrees other than engineering and in most case other than computer science nowadays are having hardship to get any interview even the ones having professional industry experience. Those who have some academic background and some research are ignored as they are seen as difficult people to work with, especially if they are not from quantitative majors. As the market shrinks the very tendency appears which is gate-keeping.",
              "score": 1,
              "created_utc": "2025-12-27 16:01:08",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nw7o14s",
              "author": "DataAnalystWanabe",
              "text": "Hi. Thanks for your detailed response. Since you’ve interviewed a lot of junior candidates, I'd love to pick your brain on this.\n\nWhen you say “pick up SQL”, what level do you expect from applicants at the interview stage? For example, is it enough to write SELECT/JOIN/WHERE queries, or do you expect comfort with window functions, CTEs, performance issues, etc.?\n\nIt would help to know what good enough looks like for you when hiring juniors, and what mistakes make you reject people immediately. Would you say syntax fluency is essential or do you prioritize understanding and reasoning. Of course both are necessary I get that.",
              "score": 1,
              "created_utc": "2025-12-27 16:35:37",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nw7w2w0",
                  "author": "redisburning",
                  "text": "For a data scientist \"good enough\" re SQL would probably be everything in the W3School tutorial (though they appear to be missing CTE/with, so yeah chuck that in). Performance and SQL is not like Big O (or doing performance optimization in the real world, if you want to see what that looks like I'd recommend sticking through as much of [this video](https://www.youtube.com/watch?v=tCY7p6dVAGE) as you can given it's about Rust but that's pretty much what it's like) so I wouldn't care beyond I guess if I saw something off perf wise I might ask for you to speculate about why it might be a problem (and I'd care more about your logicing through it than being right). But I should be clear, these days I work as a pure SWE and I generally test DS in roles that only require basic SQL and look for an imperative language alongside them (this will be Python by far in terms of popularity).\n\nI have low expectations for juniors in terms of programming skill, frankly. After all, most computer science graduates suck at doing \"real world\" programming so why should I expect a biology PhD to be good at it? I select for thoughtfulness, an indication that the candidate actually cares about writing high quality, readable stuff (even if they're not there yet), has a level of comfort with their chosen tools. It's not impressive to me if you can do every trick in the DS&A bag in Python perfectly if when I ask you to make a small change you clearly memorized the trick rather than made an effort to understand.\n\n> Would you say syntax fluency is essential or do you prioritize understanding and reasoning\n\nThe first comes from the latter, if genuine \"fluency\" is the measure. If the person interviewing you has a clue how to proctor a technical properly, the initial question is only for checking you can mechanically do a relevant task. The value is in the questions we get to ask you about your understanding, and one of the ways I poke at that is I will ask you to change it.\n\nAs a concrete example, let's say I ask you to do a task where the order of names is important, so the trick is you need to know to sort. Let's say your data is `Last name, First name, M.`. I might ask you to change which name you're sorting by, which would likely require you to do some manipulation of the data. You need to understand and reason about sorting and figure out how you get from `sorted(list_of_names)` to the same thing but by first name (to which end there are several reasonable paths).\n\nSomeone with drive and the basics can be taught any programming they need. I have taught social science graduates production level C++, the good ones turn into good programmers way faster than they thought they would (I've heard more than once \"that's too hard for me\" which is always wrong. I have heard a couple of \"that's trivial\" and they ended up a bit differently lmao).\n\n> what mistakes make you reject people immediately\n\nAutomatic rejections? That's a high bar. Mostly indications you're going to be a bad teammate. If you use slurs (or frankly other suspicious language that makes me think you're an HR risk) or are dismissive of non-technical people, if you think you're too good for dirty work like data munging, if when I try and help you through the questions you are resistant to guidance (I write questions with the goal of the first part being gentle and the second being at what I'd expect someone at the next level to be able to do without assistance so I can effectively judge pairing with the person [yes this comes with a statement in the interview the next part will be challenging and I'm there to help]). So, basically, arrogance and nastiness.\n\nThings that will count against you are considerably more numerous and range from totally innocuous (e.g. I will need to teach you how to name variables) to not dealbreakers but you better have something else working for you (bad statistics fundamentals, \"I'd solve it with ChatGPT\", talking uncritically about delivering shareholder value or \"business impact\", etc).\n\nNothing gets more positive marks from me than a general demonstration that you're a thoughtful, empathetic human being who is enthusiastic about improving their craft and ready to be a teammate working towards a common team goal. Oh, and your team is your fellow ICs, not the whims of management or as they love to call themselves \"leadership\". This is the stuff that all genuinely great DS and SWE are made of (and yes I am taking a shot at all the grumpy SWE in very high positions who are good programmers but miserable to work with). If I see that, and your technical skills clear the bar, I will advocate for you even against nominally slightly more \"qualified\" people who seem like they have too many sharp edges. Which may be slightly hypocritical (I am the king of the yappers and very opinionated so some [maybe even many?] people find me taxing). Oh, and if you're going to not bring one of those (empathy, self improvement mindset), I suggest it be the second. If you are happy where you are skillwise, I can still find a use for you. If you give me the vibe I'm going to regret letting you through because I might get stuck with you... well that isn't going to work in your favor. Though I have been overruled before :shrug:",
                  "score": 6,
                  "created_utc": "2025-12-27 17:16:19",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nw72qoq",
          "author": "LookAtThisFnGuy",
          "text": "Yes, or yes? Good luck! ",
          "score": 1,
          "created_utc": "2025-12-27 14:41:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw8ag0c",
          "author": "recon-ai-demo",
          "text": "I would continue working on your portfolio of projects and forget about additional education. In my experience having a solid portfolio of projects under your belt will be significantly better than another degree. It is important that you emphasize your transferable skills on your CV/Resume. It is hard to break out of academia for some reason that I don't understand. Have you built out your corporate CV/Resume and gotten feedback?",
          "score": 1,
          "created_utc": "2025-12-27 18:28:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "nw8mjry",
              "author": "DataAnalystWanabe",
              "text": "Thanks for the perspective. Taking electives or certificate courses during the PhD is a good idea, I’ll look into what my university allows.\n\nI’m exploring paths outside microbiology because I’ve found I enjoy the analytics work itself and frankly microbiology has lost its appeal to me and I no longer find it interesting.\n\nBut thanks for your suggestions",
              "score": 2,
              "created_utc": "2025-12-27 19:30:24",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwbz7na",
          "author": "malberry",
          "text": "What do you mean by “GCC”?",
          "score": 1,
          "created_utc": "2025-12-28 08:05:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwcq90s",
              "author": "DataAnalystWanabe",
              "text": "Basically gulf countries.\n\nGCC means the Gulf Cooperation Council, a political and economic union of Arab states in the Persian Gulf (Bahrain, Kuwait, Oman, Qatar, Saudi Arabia, UAE) focused on regional cooperation",
              "score": 1,
              "created_utc": "2025-12-28 12:21:41",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nw7uh9x",
          "author": "Single_Vacation427",
          "text": "If you haven't finished your PhD, because you said \"finishing\", then can't you take classes as part of your PhD? Some universities also have certificates for graduate students if you take x number of courses, and sometimes your PhD courses count as electives.\n\nI think the idea of moving to something more business-y is bad. Unless you have experience on the business side, it's going to be your weakest area and your PhD is not going to transfer well. I would focus on anything related to microbiology. You could work on some type of \"operations research\" for biological materials that wet labs use, for instance. Anything that involves microbiology, even if tangentially, is going to be better. You need to figure out what type of technical skills those positions need to prepare for interviews or anything 'extra' you need to learn. Every type of data science or data analyst focuses on different sets of skills.",
          "score": 1,
          "created_utc": "2025-12-27 17:08:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwaft97",
          "author": "No-Caterpillar-5235",
          "text": "I got into data science without a degree at all (not even an undergrad).\n\nMost companies want someone that knows SQL and Tableau/Power Bi really well for analytics and you can pick both up on udemy or coursera. This will get you into data analysis which is much more important to a company than ai/ml. After I did that, I picked up python and got exceptional at it (again available on udemy). \n\nNow however, I realized I hit a wall and eventually got my undergrad in data sceince (computer science might even be slightly better) and a masters in data science from uc berkeley. Not having these significantly limits your ability to do machine learning because you wont be exposed to graduate level statistics. Learning stats at this level gives you thr language and concepts needed to know whats going on under the hood of algorithms and when it comes time to deploy ai/ml youll have a lot better time fine tuning your models. Infact thr word model comes from stats.\n\nAlso I would occasionally get interviews with my undergrad degree, but once I had berkeley on my resume then the call backs I recieved went up exponentially. Not sure if its because its berkeley and their reputation or if its simply just the fact I have a masters but either way it was worth it for me.\n\nGiven that youre already in a strong stem degree though, you likely have the stats background. You need to focus on sql/Tableau and then python. R is great for running tests and creating stats models but in industry this is not what you will be doing and python will give you the power to solve all the other problems that R struggles with, but youll have both at your disposal.",
          "score": 1,
          "created_utc": "2025-12-28 01:31:52",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pyd8i1",
      "title": "Weekly Entering & Transitioning - Thread 29 Dec, 2025 - 05 Jan, 2026",
      "subreddit": "datascience",
      "url": "https://www.reddit.com/r/datascience/comments/1pyd8i1/weekly_entering_transitioning_thread_29_dec_2025/",
      "author": "AutoModerator",
      "created_utc": "2025-12-29 05:01:37",
      "score": 3,
      "num_comments": 2,
      "upvote_ratio": 0.8,
      "text": " \n\nWelcome to this week's entering & transitioning thread! This thread is for any questions about getting started, studying, or transitioning into the data science field. Topics include:\n\n* Learning resources (e.g. books, tutorials, videos)\n* Traditional education (e.g. schools, degrees, electives)\n* Alternative education (e.g. online courses, bootcamps)\n* Job search questions (e.g. resumes, applying, career prospects)\n* Elementary questions (e.g. where to start, what next)\n\nWhile you wait for answers from the community, check out the [FAQ](https://www.reddit.com/r/datascience/wiki/frequently-asked-questions) and Resources pages on our wiki. You can also search for answers in [past weekly threads](https://www.reddit.com/r/datascience/search?q=weekly%20thread&restrict_sr=1&sort=new).",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/datascience/comments/1pyd8i1/weekly_entering_transitioning_thread_29_dec_2025/",
      "domain": "self.datascience",
      "is_self": true,
      "comments": [
        {
          "id": "nwhybap",
          "author": "ergodym",
          "text": "What learning resources are helpful to go from analytics to machine learning engineering?",
          "score": 1,
          "created_utc": "2025-12-29 05:33:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwjzm8w",
              "author": "Low-Flow-6572",
              "text": "I recommend reading \"Designing Machine Learning Systems\" by Chip Huyen.",
              "score": 4,
              "created_utc": "2025-12-29 15:07:33",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    }
  ]
}