{
  "metadata": {
    "last_updated": "2026-02-18 17:29:58",
    "time_filter": "week",
    "subreddit": "datascience",
    "total_items": 13,
    "total_comments": 145,
    "file_size_bytes": 171982
  },
  "items": [
    {
      "id": "1r6jv0m",
      "title": "Been failing interviews, is it possible my current job is as good as it gets?",
      "subreddit": "datascience",
      "url": "https://www.reddit.com/r/datascience/comments/1r6jv0m/been_failing_interviews_is_it_possible_my_current/",
      "author": "quite--average",
      "created_utc": "2026-02-16 19:49:06",
      "score": 83,
      "num_comments": 37,
      "upvote_ratio": 0.88,
      "text": "I’ve been interviewing for the past few months across big tech, hedge funds and startups. Out of 8 companies, I’ve only made it to one onsite and almost got the offer. The rest were rejections at the hiring manager or technical rounds, and one role got filled before I could even finish the technical interviews.\n\nI’ve definitely been taking notes and improving each time, but data science interviews feel so different from company to company that it’s hard to prepare in a consistent way and build momentum.\n\nIt’s really getting to me now and I have started wondering if maybe I’m just not good enough to land a higher paying role, and if my current job might be my ceiling. For context, I’m targeting senior data scientist (ML) roles in a very high cost of living area.\n\nWould appreciate hearing from others who’ve been through something similar.",
      "is_original_content": false,
      "link_flair_text": "Career | US",
      "permalink": "https://reddit.com/r/datascience/comments/1r6jv0m/been_failing_interviews_is_it_possible_my_current/",
      "domain": "self.datascience",
      "is_self": true,
      "comments": [
        {
          "id": "o5qp0e3",
          "author": "Ecstatic_Bee6067",
          "text": "It's a rougher economy than many official sources will confirm. I don't think your situation is far from the norm.",
          "score": 138,
          "created_utc": "2026-02-16 19:57:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5qpe39",
          "author": "ghostofkilgore",
          "text": "I think it's pretty natural that interview success isn't some smooth line through your career. You probably got into a groove of being successful for mid roles and now that you're looking to step up to senior, I think it's natural that you'll find it tougher, for a while at least. I don't think that means you've hit a ceiling in your career, it probably just means you've got a bit to go before you come across as a very strong senior candidate.\n\nEverything suggests that it's also a failry tight jobs market at the moment so that's probably making it feel a bit tougher than it should. Companies aren't struggling to find enough candidates who tick 90%+ of their boxes, so decent candidates who're maybe hitting 70-80% are getting squeezed.",
          "score": 53,
          "created_utc": "2026-02-16 19:58:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5upzu4",
              "author": "RecognitionSignal425",
              "text": "It's more about interviewer right now focus on 'less risky' hire rather than 'grow' hire. In that mindset, almost everything interviewee say gets mentally scored.\n\nWhen an interviewer is optimizing for risk minimization instead of growth potential, they are scanning for downside signals, not upside.\n\nOf course, not all of them are being trained for this style of interview. ",
              "score": 1,
              "created_utc": "2026-02-17 12:11:12",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5qosmr",
          "author": "Financial_Wait2125",
          "text": "What types of questions being asked by them?\n\nI interview folks and have taken interviews across the board. I always look for adaptability unless the role is hyper specific. I like to see how the candidate approaches the issue.",
          "score": 15,
          "created_utc": "2026-02-16 19:56:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5rtpix",
              "author": "starktonny11",
              "text": "I feel this is overstated, still getting rejected for small mistakes even though you show how you are approaching problems. None of the feedback i got mentioned i wasnt goong on good direction or my approach was wrong, all were like small mistakes  i made or less tome left to explain in depth which could have been infered easily as nerves of interviews. They want the perfect candidates who makes 0 mistakes\n\nEdit: so i am saying is majority of time you gotta make 0 mistakes to get the offer",
              "score": 7,
              "created_utc": "2026-02-16 23:21:49",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5tkekw",
                  "author": "Financial_Wait2125",
                  "text": "You’re right, I over simplified it. A lot of the roles I hire for are either multi-domain or multifaceted where the approaches are needed to be broad. \n\nI am curious about yours, it sounds as if they had a picture perfect person they were looking for or wanted to doc at the first issue they could. I’m sorry you got that, usually I try to look past the nerves or schedule another round to see if they get past it. \n\nI think when jobs are posted, the recruiters want job skills that are unobtainable or what someone told them they “have” to have. Interviewing sucks, I get it.",
                  "score": 2,
                  "created_utc": "2026-02-17 05:59:16",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o5w9cu0",
                  "author": "Tundur",
                  "text": "I don't know if this is necessarily true in your case, but generally if I give examples like that it's because their relatively objective and *not* because they're the core issue.\n\nIt's possible they just didn't like your vibe, which is a messy and subjective thing, whilst \"you made this error\" is more conclusive.",
                  "score": 1,
                  "created_utc": "2026-02-17 17:12:04",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5quepv",
          "author": "NotSynthx",
          "text": "Only 8?\n\n\nThis a grind homie, you gotta put in more apps. You got this",
          "score": 58,
          "created_utc": "2026-02-16 20:23:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5xo5jo",
              "author": "caylyn953",
              "text": "That's 8 interviews, not 8 applications.",
              "score": 7,
              "created_utc": "2026-02-17 21:10:41",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5qzzyd",
          "author": "Slow_Tap_2885",
          "text": "Honestly, 1 onsite out of 8 for senior ML roles isn’t bad. That’s a competitive level, especially for big tech and hedge funds. At senior level, interviews aren’t about just knowing models. They’re testing judgment, tradeoffs, product thinking, and how you communicate under pressure. The fact that you’re reaching HM and technical rounds means you’re in range. It’s probably refinement, not a hard ceiling. Senior jumps are selective and small gaps matter more. That doesn’t mean you’re not good enough. It just means the bar is high.",
          "score": 27,
          "created_utc": "2026-02-16 20:51:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5qqvzi",
          "author": "Beginning_Cup7065",
          "text": "Are the roles in a different domain compared to your current role?\n\nIf you’re working as an analytics DS and you’re applying to an ML role, then you can face this issue. Also if you’re working as a DS ML in risk and you’re applying to DS ML role in rec sys, you’ll also face this problem. \n\nAs you get more senior, domain expertise matters more than anything else.",
          "score": 9,
          "created_utc": "2026-02-16 20:06:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5qrekz",
          "author": "neo2551",
          "text": "Focus on what you like, and master the basics.\n\nYou will hit one interview or a job that will just be perfect for you, because you invested your energy mastering the topic. \n\nEnjoy the process, and things will play out.\n\nThat being said, learn SQL, at least you will have a shot at FAANG.",
          "score": 5,
          "created_utc": "2026-02-16 20:08:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5rwlye",
          "author": "Optimal_Speed_361",
          "text": "No it’s not you. And even if it were, judging by your introspection skills, you’re not dumb. If dumb people make it into high paying jobs, then you can too. Keep trying, work on your confidence, that might be it.",
          "score": 4,
          "created_utc": "2026-02-16 23:38:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5twpw4",
              "author": "CluckingLucky",
              "text": "Hey, thanks. I’m not OP, but everyone needed to hear this.",
              "score": 1,
              "created_utc": "2026-02-17 07:47:35",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5qsy0m",
          "author": "coreybenny",
          "text": "Real talk. You may not be ready for a senior ds role. That isn't something against you but more to do with you need to continue to develop.  It's a process that everyone goes through and at different rates continue to learn and build skills and it'll come",
          "score": 7,
          "created_utc": "2026-02-16 20:16:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5r2lax",
          "author": "jesusonoro",
          "text": "8 companies is barely a sample size honestly. the part that makes DS interviews brutal is every company invents their own format from scratch so you cant build muscle memory the way SWE people can with leetcode. its more of a format lottery than a skill test",
          "score": 2,
          "created_utc": "2026-02-16 21:03:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5qy6wz",
          "author": "mufflonicus",
          "text": "Try asking for advice on how to improve once you get rejected. You might get specific meaningful advice.\n\nBroaden your horizon, learn other components or domains or get some certifications. Something to make you stick out above the pack.",
          "score": 1,
          "created_utc": "2026-02-16 20:42:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5xhpsb",
              "author": "Muted_Recognition_10",
              "text": "I have the same issue. Got several state interviews but on second round was rejected. I asked once for how to improve and their feedback, they said they can’t share it.",
              "score": 2,
              "created_utc": "2026-02-17 20:40:03",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5rylof",
          "author": "ShapedSilver",
          "text": "It’s a tough economy, truly a different world than just a few years ago. These sound like pretty competitive places so they probably had a lot of applications in a few hours. I wouldn’t take it personally, it’s just going to be more grinding than we’re accustomed to for a little bit",
          "score": 1,
          "created_utc": "2026-02-16 23:49:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5rz8r4",
          "author": "tongEntong",
          "text": "Me too mate🥲🥲🥲, also i heard only 20% of DS project actually went through (the rest failed sustained/ long term in production - even after months cooking it up, esp big companies w money to spend) is it true?",
          "score": 1,
          "created_utc": "2026-02-16 23:53:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5s513l",
          "author": "mikethomas4th",
          "text": ">I’m targeting senior data scientist (ML) roles in a very high cost of living area.\n\nTheres only going to be so many positions total available at that level. This is why many transition from technical roles to leadership to make more money.",
          "score": 1,
          "created_utc": "2026-02-17 00:26:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5sb9mh",
          "author": "Intrepid-Self-3578",
          "text": "I have attended many more interviews than you lot of them stopped responding after few rounds or final round now they are coming back so don't worry. companies are still under lot of uncertainty. ",
          "score": 1,
          "created_utc": "2026-02-17 01:02:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5sv62k",
          "author": "zangler",
          "text": "DM me your resume.",
          "score": 1,
          "created_utc": "2026-02-17 03:02:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5t5e7z",
          "author": "AccordingWeight6019",
          "text": "Rejections happen to everyone. 8 interviews are still early. Focus on structured prep, track patterns in feedback, and keep iterating. Your current job isn’t necessarily your ceiling. ",
          "score": 1,
          "created_utc": "2026-02-17 04:08:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5xpqxu",
          "author": "cheetah611",
          "text": "Keep going, you getting the interviews and to those rounds is a great sign. \n\nI went through something like 10-15 interviews during my recent applications stint and got no success until the last week where I got 3 offers at the same time (one of which was the best/highest paying role I interviewed for during the whole process). \n\nPoint being, it’s not linear by any means.",
          "score": 1,
          "created_utc": "2026-02-17 21:18:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5yiqn9",
          "author": "hotdog_buddy",
          "text": "It took me 4 times getting through final rounds to get an offer",
          "score": 1,
          "created_utc": "2026-02-17 23:44:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o60i6nt",
          "author": "One_Presence_736",
          "text": "Are you putting too much energy into technical interview prep while overlooking other parts of the process?\n\nI can’t tell from your interviews, but a pattern I keep seeing across Reddit interview threads is that people often underweight “how you show up” as a person and whether you fit the team and the organization.\n\nAt a certain experience level, they’ll assume you have the technical foundation. What they don’t know yet is you: how you work, how you collaborate, whether you can self-reflect, how you handle feedback, and what you’re like in a team day-to-day.",
          "score": 1,
          "created_utc": "2026-02-18 07:12:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6297lj",
          "author": "ArcherCommercial9238",
          "text": "Hello, how are you, it really depends on you, recently I think there are many opportunities so if you fail in the interview, nothing happens, new ones always appear",
          "score": 1,
          "created_utc": "2026-02-18 14:55:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o62tfiw",
          "author": "KitchenTaste7229",
          "text": "Many comments have said it and it just bears repeating that companies are just really selective right now. So even if it's frustrating to put in the work and not see the results you want, it's already a great sign that you're taking notes and doing your best to improve. I hope you don't get discouraged, you can make your prep more efficient without feeling underprepared by digging up company-specific interview guides (I have a few sites in mind for this!) so you feel less in the dark about each process differing from one another. Also, don't hesitate to ask for specific feedback after those technical rounds, as it might not be about your skills but more on how you communicated/structured your thought process. Would add more nuance to your improvement, too.",
          "score": 1,
          "created_utc": "2026-02-18 16:28:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5qs2mi",
          "author": "Sufficient_Art2594",
          "text": "Stop preparing for the interview, start preparing more credentials. Degrees, certs, projects, etc. You dont have to ace an interview if you can adequately demonstrate passion and capacity to learn.   \n  \nValue-add isnt always about the best one-to-one match, its about holistic understanding of strategic glidepath. ",
          "score": -8,
          "created_utc": "2026-02-16 20:12:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5qy8tg",
              "author": "hyperactivedog",
              "text": "This is false if the goal is faang and similar. Each company has a mostly standardized set of interview formats and they’re coachable. \n\nThe mental model I use is it’s like cramming for a final that the teacher provided a set of sample questions for. \n\nAnd you’re the guy saying to get certs. \n\nNo one cares about certs if you fail doing a basic coding question. No one cares about certs if you can’t describe a real world scenario you tackled. \n\nCerts help you get a recruiter call. They do very little past that.",
              "score": 3,
              "created_utc": "2026-02-16 20:42:43",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5r0mxv",
                  "author": "Sufficient_Art2594",
                  "text": "I'm not saying you can get certs and then do fuck-else. I'm saying certs and your actual grasp of concepts and materials help illustrate capacity. \n\n\nGood luck standing out against the hundreds if not thousands of others that built your same mental model and \"studied for the test\"... You bring no intangibles to add value and you'll get washed in the sea of recruits with the exact same mentality. Resumes and skills pass the lowest bar, standout strategic value-add gets you an offer, and the easiest way to broadcast that is with breadth of knowledge and holistic understanding of the space. ",
                  "score": 0,
                  "created_utc": "2026-02-16 20:54:28",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1r6klm4",
      "title": "Current role only does data science 1/4 of the year",
      "subreddit": "datascience",
      "url": "https://www.reddit.com/r/datascience/comments/1r6klm4/current_role_only_does_data_science_14_of_the_year/",
      "author": "Tenet_Bull",
      "created_utc": "2026-02-16 20:16:04",
      "score": 64,
      "num_comments": 32,
      "upvote_ratio": 0.88,
      "text": "Title. The rest of the year I’m more doing data engineering/software engineering/business analyst type stuff. (I know that’s a lot of different fields but trust me). Will this hinder my long term career? I plan to stay here for 5 years so they pay for my grad program and vest my 401k. As of now I’m basically creating one xgboost model a year and just doing analysis for the rest of the year based off that model. (Hard to explain without explaining my entire job, basically we are the stakeholders of our own models in a way, with oversight of course). I’m just worried in 5 years when I apply to new jobs I won’t be able to talk about much data science. Our team wants to do more sexy stuff like computer vision but we are too busy with regulatory fillings that it’s never a priority. The good news is I have great job security because of this. The bad news is I don’t do any experimentation or “fun” data science. ",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/datascience/comments/1r6klm4/current_role_only_does_data_science_14_of_the_year/",
      "domain": "self.datascience",
      "is_self": true,
      "comments": [
        {
          "id": "o5qupdu",
          "author": "kater543",
          "text": "Join the club",
          "score": 109,
          "created_utc": "2026-02-16 20:25:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5qv3zw",
          "author": "Particular_Prior8376",
          "text": "Data science/ machine learning cannot stand on its own when it comes to solving a business problem. It is created on a solid foundation of data engineering and analytics. 25% of time spent on building a model is more or less ideal. When looking for candidates companies don’t look for the ones who coded the most number of models, they look for people who can understand the business, frame a problem properly, can create a robust data pipeline and then train a model, can evaluate a model not just on the usual metrics but also on the impact on the business. Trust me, this is the best experience you are getting",
          "score": 121,
          "created_utc": "2026-02-16 20:27:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5r604h",
              "author": "Tenet_Bull",
              "text": "Thanks, looks like my situation is pretty normal then?",
              "score": 12,
              "created_utc": "2026-02-16 21:20:32",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5ra591",
                  "author": "Particular_Prior8376",
                  "text": "I think so, I would suggest keep one finger( figuratively speaking) on ml models so that you are designated as a data scientist, but use other fingers to explore other streams, you will have so many skills to solve problems with.",
                  "score": 4,
                  "created_utc": "2026-02-16 21:40:41",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o5s0xj1",
                  "author": "pm_me_your_smth",
                  "text": "Not the one you're replying to, but take any internet advice with a grain of salt. Data science is is very broad field, job expectations vary greatly between companies and teams, and everyone is speaking only from their personal perspective.\n\nWill play a devil's advocate here where the opposite is true. If you want to be closer to machine learning than data analytics, then experience with model training/experimentation/iteration is more important (including all the data work too) vs business analysis etc. If your experience consists of just a simple train-and-done model once a year, that will hurt your chances for such jobs and it will not be \"the best experience you are getting\". \n\nEverything depends on your specific career targets whether it's best to stay or leave. There's no objectively correct path here, contrary to what the \"trust me\" guy above said.",
                  "score": 4,
                  "created_utc": "2026-02-17 00:03:01",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o5xj8hh",
                  "author": "No_Willingness_4733",
                  "text": "If I was interviewing you and you said you do \"data science\" most of the time I'd assume your role is extremely junior. \nThe more senior I got the more I do: \nStakeholder management, planning, data sourcing, identifying new data sources, negotiating with vendors, exploring new options, organizing team events...",
                  "score": 1,
                  "created_utc": "2026-02-17 20:47:16",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o5tanwz",
              "author": "SryUsrNameIsTaken",
              "text": "Yeah agreed. That kind of role is fast tracking yourself to system architect/tech lead with a lot of ml chops. Or a director if you’re more interested in managing. Throw in some devops and enough frontend to prototype and you’d be well rounded for something like that if you’re interested. Those types of roles require you to know enough about everything to make it work.",
              "score": 3,
              "created_utc": "2026-02-17 04:44:57",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o62q3g0",
              "author": "Intrepid-Training-27",
              "text": "Super like your comment. This is what most people miss about data science and what differentiates a good data scientist from a great data scientist!",
              "score": 1,
              "created_utc": "2026-02-18 16:13:31",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5rpbb4",
          "author": "ArchimedesBathSalts",
          "text": "I think you misunderstand the nature of the field you are in. ML algorithms are overrepresented in education but a small fraction of what matters in the job.",
          "score": 21,
          "created_utc": "2026-02-16 22:57:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5qv5ph",
          "author": "Single_Vacation427",
          "text": "You can do things on the side. Block work time to do your own project.\n\nAlso, it won't hurt you in interviews as long as you have good stories about your job. They are not going to ask you a play by play of your time there.  Even a 'data analyst' type work can have a lot of impact.",
          "score": 15,
          "created_utc": "2026-02-16 20:27:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5r5nnh",
              "author": "Tenet_Bull",
              "text": "Thanks, I think my grad program can fill in the role of data science side projects too",
              "score": 2,
              "created_utc": "2026-02-16 21:18:52",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5r0cpt",
          "author": "Beginning_Cup7065",
          "text": "Focus more on building domain expertise. In 5 years, you’ll be applying to mid or senior level roles and domain expertise is what matters the most in those interviews.\n\nWhat is the domain of your team? Is it rec sys? If yes, read papers and use SoTA approaches for each model you build. When interviewing for new roles, focus only on rec sys roles and, your hiring manager will be mostly concerned on how you solved the business problems using latest methods. They wont care about whether you built an object detection model with Computer Vision.\n\nIf you keep chasing shiny names - CV today, NLP tomorrow, you won’t build enough experience in one domain to compete for senior roles in 5 years.\n\nAlso, don’t waste your time doing side projects, except if you have interest in that area",
          "score": 5,
          "created_utc": "2026-02-16 20:53:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5qv08f",
          "author": "Euphoric-Advance8995",
          "text": "Whatever job you have, regardless of profession: the more you do stuff that you enjoy the happier you’ll be AND SEPARATELY the more you do stuff that will be relevant in the future the more you’re going to stay relevant. \n\nIf your goal is career progression as an IC and you are working on stuff you don’t enjoy or think will be relevant then for sure you’re stunted. I won’t argue that one of ML vs SWE vs analytics is more automatable bc nobody can tell at this point (tho certainly everyone has their own opinions). \n\nIf you want to be doing DS bc you enjoy it or think it’s more relevant I would find ways to carve out side projects and demonstrate business impact to justify the investment.",
          "score": 3,
          "created_utc": "2026-02-16 20:26:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5qzcw3",
          "author": "Tells_only_truth",
          "text": "Sounds about right tbh",
          "score": 2,
          "created_utc": "2026-02-16 20:48:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5s1h73",
          "author": "torsorz",
          "text": "It's nice to hear this is somewhat common, haha. I started a new role in data science a few months ago and I've done literally zero data science, but learning lots about maintaining data pipelines and so on (which is nice because it's basically impossible to find a personal project that involves implementing an actual automated pipeline).",
          "score": 2,
          "created_utc": "2026-02-17 00:06:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5r0gc7",
          "author": "Potential_Swimmer580",
          "text": "Unless you’re in a research based role this seems the norm for most of us. In my experience these last few years at least there’s been a shift from less analytics to more SWE",
          "score": 1,
          "created_utc": "2026-02-16 20:53:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5sv8xj",
          "author": "Pvt_Twinkietoes",
          "text": "Lucky! I'm building automation pipeline most of the time!",
          "score": 1,
          "created_utc": "2026-02-17 03:02:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5sydca",
          "author": "AccordingWeight6019",
          "text": "Good perspective. Real data science is often more about ownership and impact than constant model building. Staying intentional about growth and documenting real outcomes is what keeps the experience valuable long term. ",
          "score": 1,
          "created_utc": "2026-02-17 03:22:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5tchqd",
          "author": "KnowledgeExciting627",
          "text": "It won’t hurt you automatically, but it can if you’re passive about it.\n\nIf you spend five years building one XGBoost model a year and mostly doing maintenance and reporting, you’ll drift toward analytics / applied data / platform work rather than core data science. That’s not bad, but it’s different from experimental ML or research-heavy roles.\n\nThe bigger risk isn’t the lack of “sexy” projects. It’s the lack of experimentation, model iteration, and measurable impact stories. That’s what future DS interviews will probe.\n\nIf the job gives you stability, grad funding, and 401k vesting, that’s real value. Just make sure you deliberately build depth on the side. Improve the modeling pipeline, add evaluation rigor, experiment offline, contribute to something ML-heavy internally, or run personal projects.\n\nFive stable years with no growth is risky. Five stable years with intentional skill building is powerful.",
          "score": 1,
          "created_utc": "2026-02-17 04:58:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5tflrc",
          "author": "Embarrassed_Army_670",
          "text": "Nice to hear I’m not the only who experiences this",
          "score": 1,
          "created_utc": "2026-02-17 05:21:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5u0jxh",
          "author": "the_Wallie",
          "text": "* morpheus voice * welcome to the real world. ",
          "score": 1,
          "created_utc": "2026-02-17 08:23:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5u59bx",
          "author": "Ghost-Rider_117",
          "text": "honestly this sounds pretty normal for most DS roles tbh. the \"pure\" ML research job is kinda rare outside of big tech or research labs. most of us spend a ton of time on pipelines, data quality, stakeholder management, etc.\n\n\n\nthat said - if you're worried about your skills getting rusty, maybe carve out some side project time? even just kaggle competitions or contributing to open source can keep your modeling sharp. plus having that github activity helps when job hunting later.\n\n\n\nthe variety might actually be a good thing for your career long-term - being able to build AND deploy models is super valuablehonestly this sounds pretty normal for most DS roles tbh. the \"pure\" ML research job is kinda rare outside of big tech or research labs. most of us spend a ton of time on pipelines, data quality, stakeholder management, etc.\n\n\n\nthat said - if you're worried about your skills getting rusty, maybe carve out some side project time? even just kaggle competitions or contributing to open source can keep your modeling sharp. plus having that github activity helps when job hunting later.\n\n\n\nthe variety might actually be a good thing for your career long-term - being able to build AND deploy models is super valuable",
          "score": 1,
          "created_utc": "2026-02-17 09:08:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5uq7fu",
          "author": "Lord_Skellig",
          "text": "I feel ya. I just left a job because I was sick of doing analysis on xgboost models, and really wanted to do more deep learning again.",
          "score": 1,
          "created_utc": "2026-02-17 12:12:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5uyeux",
          "author": "jesusonoro",
          "text": "the 75% thats not modeling is honestly what makes you hireable. every DS candidate can fit xgboost, way fewer can own the pipeline end to end and actually talk to the business about it",
          "score": 1,
          "created_utc": "2026-02-17 13:07:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5uyt27",
          "author": "patternpeeker",
          "text": "i’d say it won’t ruin u, but in five years u might have a thin portfolio of pure data science work. if u want to move later, maybe find ways to sneak in small projects that show experimentation",
          "score": 1,
          "created_utc": "2026-02-17 13:09:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5w3f8m",
          "author": "madbadanddangerous",
          "text": "I've been dismayed by the lack of data science and machine learning I've done in my career, after spending so much time and effort getting into the field. Mostly it's programming work to enable data science, or just programming in general. As well as meetings and keeping all the bureaucrats happy (especially in enterprise jobs). My startup experience was more fun but also super crazy, and even then, not all that much ML/DS work. At this point, I'm not sure how many data scientists are actually sciencing any data",
          "score": 1,
          "created_utc": "2026-02-17 16:42:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5w6w4w",
          "author": "Bananana_man",
          "text": "Sounds pretty normal to me. And on top of it you’ll be vested and had your program paid for. I’m in a very similar situation after 3 years. Just try doing some personal projects and continue to learn. Just because your done with school/program doesn’t mean you can’t learn independently",
          "score": 1,
          "created_utc": "2026-02-17 16:59:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5wr0ox",
          "author": "SamWest98",
          "text": "My SWE role does data science 3/4 of the time!!",
          "score": 1,
          "created_utc": "2026-02-17 18:34:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5xiegc",
          "author": "No_Willingness_4733",
          "text": "Nope this is absolutely normal and no workplace will have you do \"data science\" all the time. Sounds about right.",
          "score": 1,
          "created_utc": "2026-02-17 20:43:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5r1aj6",
          "author": "BodybuilderUpbeat786",
          "text": "Join an investment bank, the engineering side is abstracted away from us, I use Pandas every day at JPMC (obviously depends on the team you join).",
          "score": 0,
          "created_utc": "2026-02-16 20:57:40",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r40g4p",
      "title": "What differentiates a high impact analytics function from one that just produces dashboards?",
      "subreddit": "datascience",
      "url": "https://www.reddit.com/r/datascience/comments/1r40g4p/what_differentiates_a_high_impact_analytics/",
      "author": "Proof_Wrap_2150",
      "created_utc": "2026-02-13 20:38:23",
      "score": 62,
      "num_comments": 30,
      "upvote_ratio": 0.89,
      "text": "I’m curious to hear from folks who’ve worked inside or alongside analytics teams. In your experience, what actually separates analytics groups that influence business decisions from those that mostly deliver reporting?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/datascience/comments/1r40g4p/what_differentiates_a_high_impact_analytics/",
      "domain": "self.datascience",
      "is_self": true,
      "comments": [
        {
          "id": "o5am08o",
          "author": "Upset-Chemist-4063",
          "text": "Levels to analytics impact\n\n1. Answering adhoc questions from a stakeholder\n2. Providing a tool (self serve dashboard) that enables stakeholders to answer questions about a specific business area\n3. Building knowledge in a specific domain (marketing, finance, product) to understand existing reporting gaps and proactively building said reports and sharing with stakeholders to support their initiatives/roadmaps (already developed without much of your input)\n4. Working directly with stakeholders to identify key initiatives to guide product roadmap (where you actually start being more of a data partner / consultant)\n5. Operating primarily @ step 4, but doing adhoc work of the lower steps about 20/30% of the time. \n\nAt a certain point, you’re borderline a data pm va just analyst. You want your stakeholders to see you as a value add in terms of strategy vs just giving them numbers to questions",
          "score": 6,
          "created_utc": "2026-02-14 05:22:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5imiak",
              "author": "brhkim",
              "text": "This is a solid typology. There's a big, big, big difference between being reactive (\"hey they want X, and I have no input into that besides doing it for them\") and being strategic, proactive (\"hey, I know they \\*will\\* want X, so let me get into a conversation with them and see if we can't steer them towards Y which will be better for all these reasons that they'll love\"). Your points on 3 and 4 really hit on the latter!",
              "score": 1,
              "created_utc": "2026-02-15 15:07:15",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5j6mp0",
                  "author": "Upset-Chemist-4063",
                  "text": "Yeah coming from staff level, the expectation is you operate at 4. Nobody really cares about getting a nice new perfected dashboard with all the cool filters and widgets. \n\nThe truth is not all stakeholders you have will be data savvy, so they’ll need a lot of hand holding when understanding and interpreting metrics and/or results of initiatives/experiments. \n\nWhen they are data savvy, you need to be able to operate and communicate almost at their level of expertise in order to have more productive discussions about opportunity sizing, impact, and tradeoffs (design, development time from Eng, and any other factors that need alignment before the execution of a project begins). That’s partly why I frame it as operating as a data partner.",
                  "score": 2,
                  "created_utc": "2026-02-15 16:46:23",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o588etv",
          "author": "durable-racoon",
          "text": "1 empowering self-serve analytics\n\n2 \\*deciding\\* what to analyze, and saying \\*no\\* to requests, rather than being an IT function that takes tickets users submit and completes them. saying 'no we dont think there's enough business value in that analysis, unless you can show us otherwise'\n\n3 having really, really smart people that can do cutting edge things that no one else at the company is doing.\n\n4 back to point 1: if you're already empowering self-serve analytics, then basic data analytics tasks dont NEED to be done by your team. You become the commandos only deployed for the most technically demanding jobs.\n\n5 You can also take charge of the organizations data strategy at a company wide level or department level. cant analyze data if there's no data to analyze.\n\nbuilding relationships is KEY. So is actually participating in the work your customers are doing, you have to GEMBA.\n\nof course doing those 'support ticket' jobs is how you build relationshps so there IS a balance.\n\nthen you know what exists, what real work needs to be done, and you can make it happen.\n\nyou need to work with people and alongside them and empower them in various ways (classes, daily meetings, they teach you how to do THEIR job, you teach them analytics, you create self serve analytics dashboards, and more!)  \nInstead of, like, someone makes a request, 2 weeks later you give them a dashboard and no conversation happens. thats really bad.\n\nif you're an IT org you're going to be laid off when its time to cut costs. if you want impact you have to go find it and you have to say no to low impact things, obviously. it requires a very brave charming and well connected dept leader\n\nas data analytics becomes incerasingly democratized, 'just' doing analytics isnt enough anymore\n\nEDIT: also\n\nFrameoutputs around decisions, not data. The highest-impact analytics teams orient their work around a specific decision that needs to be made. shift from descriptive to prescriptive. You always need to ask 'but how does this add value to the company?'\n\nClose the loop. Track whether your recommendations were implemented and what happened afterward.",
          "score": 42,
          "created_utc": "2026-02-13 20:42:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5addy5",
              "author": "MostlyHereForKeKs",
              "text": "Don’t respond to this post or posts like it. Check the post history - this account is putting up multiple low-effort posts an hour. It’s spam. ",
              "score": 24,
              "created_utc": "2026-02-14 04:16:55",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o5tepfc",
              "author": "SP_Vinod",
              "text": "You're deducing the right thing but allow me to fine-tune your thinking with what I know actually works in practice rather than in theory.\n\nIn my enterprise data management journey demonstrates that the major turning point was the change from reactive IT ticket-taker to value-oriented data partner. The real breakthrough was not analytics but rather the reframed mission of “We make data business ready.” This simple reframing helped the team transition from order takers to proprietors of business results.\n\nLet’s get to the point:\n\nSelf-serve is non-negotiable. If your team is still doing elementary reporting, you are a cost center. Mature teams consolidate key data assets, standardize offerings, and enable business autonomy. Your most valuable talent should be reserved for the highest impact work.\n\nSaying no is leading. If there is no obvious decision, revenue, cost, or risk mitigation for your analysis, just don’t do it. High impact teams manage demand like a service portfolio (think Pareto) rather than a ticket queue.\n\nYou cannot operationalize without data relationships. The “virtual data team” model was successful because while they were embedded, they spoke the business language, and data was used as a means to an end, not as a means of control. \n\nFraming around decisions vs dashboards. Real evolution is from reactive > proactive > predictive. Descriptive analytics without ownership of decisions is entertaining intellectually.\n\nClose the loop. If you’re not tracking adoption and business outcome after delivery, you’re doing theater.\n\nOne more uncomfortable truth: as analytics become democratized, “being good at analysis” is table stakes. Your differentiation is owning data strategy, enterprise data foundations, and actionable data IP, not designing dashboards.\n\nImpact is about courage, discipline on prioritization, and intimacy with the business. Anything below that, you are just expensive reporting IT.",
              "score": 2,
              "created_utc": "2026-02-17 05:14:30",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5vchqs",
                  "author": "durable-racoon",
                  "text": "yep, mission statements are important too. we had one. very good comment, all of it!",
                  "score": 1,
                  "created_utc": "2026-02-17 14:26:34",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o5a44pf",
              "author": "naholt01",
              "text": "Number 2 is key. All the rest falls out of that one if you do it right tbh",
              "score": 1,
              "created_utc": "2026-02-14 03:12:16",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5abwwa",
                  "author": "durable-racoon",
                  "text": "yeah but its really hard. people do NOT like hearing no and you do have to say yes to low-value things sometimes. if upper leadership views your org as a ticketing organization and a business expense, its a tooth and nail fight to change that culture. To some people its akin to hearing their IT support department telling them \"its not worth our time to investigate your issue, sorry\"",
                  "score": 1,
                  "created_utc": "2026-02-14 04:06:11",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o59a9k4",
              "author": "Proof_Wrap_2150",
              "text": "Thank you this is great!",
              "score": 0,
              "created_utc": "2026-02-14 00:04:41",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5j1a11",
                  "author": "mayorofdumb",
                  "text": "Multiple people need to able to understand and use a dashboard. So many are just built. I can create a great dashboard but it's always adhoc because you get random questions. It's keeping things tight and organized with millions of records",
                  "score": 1,
                  "created_utc": "2026-02-15 16:20:34",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o598x3x",
          "author": "MostlyHereForKeKs",
          "text": "The analysis subs are being overwhelmed with “What does this two-word-1234 account ask?”, spam - can the mods please step up?",
          "score": 8,
          "created_utc": "2026-02-13 23:56:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5ac2q0",
              "author": "durable-racoon",
              "text": "im confused by your comment, I thought the post had some good and rarely asked questions",
              "score": 5,
              "created_utc": "2026-02-14 04:07:20",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5ad2ua",
                  "author": "MostlyHereForKeKs",
                  "text": "First - check the post history.\n\nMultiple post per hour like\n“What technical foundations matter most when enabling analytics at scale?”\nOr\n“What does People Analytics work actually look like week-to-week?”\n\n2 - there is nothing rare or interesting *at all* about the question asked.  It’s engagement bait. ",
                  "score": 8,
                  "created_utc": "2026-02-14 04:14:38",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o59d3h9",
          "author": "Statement_Next",
          "text": "Probably just the health of the company or whether there is true need for analytics.",
          "score": 2,
          "created_utc": "2026-02-14 00:21:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o59pekl",
          "author": "Ok-Energy-9785",
          "text": "One that has a proactive goal to answer ambiguous questions the business needs to resolve strategic initiatives",
          "score": 1,
          "created_utc": "2026-02-14 01:37:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5dscd8",
              "author": "Helpful_ruben",
              "text": "u/Ok-Energy-9785 Error generating reply.",
              "score": 1,
              "created_utc": "2026-02-14 18:47:02",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5e0lfa",
                  "author": "Ok-Energy-9785",
                  "text": "That's weird",
                  "score": 1,
                  "created_utc": "2026-02-14 19:29:14",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5bef6i",
          "author": "AccordingWeight6019",
          "text": "The biggest difference is ownership and integration. Teams that just produce dashboards are often downstream. They get requests and deliver visualizations. High impact analytics functions are upstream: they help define the questions, design experiments or analyses, and work iteratively with stakeholders to shape decisions.\n\nAnother factor is context and actionability. It’s not enough to show trends; high impact teams translate insights into concrete recommendations, quantify trade offs, and anticipate how leadership will act on them. In practice, this often means being embedded in decision workflows rather than operating as a separate reporting function.",
          "score": 1,
          "created_utc": "2026-02-14 09:46:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5bx4sh",
          "author": "patternpeeker",
          "text": "the teams that actually influence decisions tend to embed analytics in the workflow, not just hand out dashboards. they push insights that get acted on, follow up on impact, and tweak models based on feedback. dashboards alone rarely move the needle.",
          "score": 1,
          "created_utc": "2026-02-14 12:37:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5d6are",
          "author": "Calm-Huckleberry-601",
          "text": "One thing that would differentiate is building solutions, dynamic and continuous reporting. \nAlso, one where they're able to work with complex and ever changing requirements. Especially that involving unstructured data. \nSometimes analysis is based on both internal and external data. Dashboarding is a step after that.",
          "score": 1,
          "created_utc": "2026-02-14 16:56:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5d7per",
          "author": "DisgruntledMilennial",
          "text": "Honest question, do people actaully look at dashboards? I have this presumption that people look at them a handful of times and then put it on the back burner.\n\nTo question though, I'd say the former goes about their work in a botique/polished manner and the latter does what they are told to do.",
          "score": 1,
          "created_utc": "2026-02-14 17:03:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5faxgr",
          "author": "davecrist",
          "text": "DIY never works like you expect.  Every time we talk with customers they demand flexible configuration and the ability to build their own visualizations and components. \n\nAnd every time no one changes the configuration to anything other than ‘everything’ and they never, ever build their own components or modify the existing visualizations beyond changing the left-to-right order of columns. Never.",
          "score": 1,
          "created_utc": "2026-02-14 23:49:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5m6twe",
          "author": "Fluffy-Ad3768",
          "text": "The ones that drive decisions, not just report on them. We built an analytics system that doesn't just produce dashboards — it makes autonomous trading decisions. 5 AI models analyze data, debate the interpretation, and execute. That's the extreme end, but the principle applies everywhere: high-impact analytics closes the loop between insight and action. If your analytics output requires a human to interpret and act on it, you're leaving value on the table.",
          "score": 1,
          "created_utc": "2026-02-16 02:29:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5nh948",
          "author": "PublicViolinist2338",
          "text": "A lot of it has to do with business politics. I have seen situations where the tool worked perfectly fine from a technical perspective, but where it never ends up getting implemented because it risks automating a set of functions that may lead people to lose their jobs",
          "score": 1,
          "created_utc": "2026-02-16 08:33:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5vwjzg",
          "author": "jesusonoro",
          "text": "whether the analytics person is in the room when the decision gets made or just gets a jira ticket after. high impact teams frame questions, dashboard factories answer them.",
          "score": 1,
          "created_utc": "2026-02-17 16:07:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5xz29r",
          "author": "lebortsdm",
          "text": "Definitely a fine line in my history. The biggest differentiator has been does the dashboard drive more analysis within the company and who's doing that analysis? If it's the analytics teams, then you have a company who heavily relies on them to provide insight vs. business centralized teams tend to say thank you and you never hear from them again.",
          "score": 1,
          "created_utc": "2026-02-17 22:01:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o59ei5p",
          "author": "Current-Ad1688",
          "text": "Why do you think \"just producing dashboards\" is not high impact. Depends what's in the dashboards obviously",
          "score": -1,
          "created_utc": "2026-02-14 00:29:57",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r2flqg",
      "title": "Meta ds - interview",
      "subreddit": "datascience",
      "url": "https://www.reddit.com/r/datascience/comments/1r2flqg/meta_ds_interview/",
      "author": "No-Mud4063",
      "created_utc": "2026-02-12 01:07:26",
      "score": 61,
      "num_comments": 24,
      "upvote_ratio": 0.84,
      "text": "I just read on blind that meta is squeezing its ds team and plans to automate it completely in a year. Can anyone, working with meta confirm if true? I have an upcoming interview for product analytics position and I am wondering if I should take it if it is a hire for fire positon?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/datascience/comments/1r2flqg/meta_ds_interview/",
      "domain": "self.datascience",
      "is_self": true,
      "comments": [
        {
          "id": "o4wjril",
          "author": "Single_Vacation427",
          "text": "That doesn't make a lot of sense given that they do a lot of deep dives and analyze trade-offs for product decisions.\n\nBut I don't know internally how they work, though.\n\nEdit: I will say that what I've heard is that some teams/orgs are more toxic that others, with people working 60 hour weeks. I don't see them firing anyone there because how would thinks get done? Even if you automate some work, it would just bring it down to people working regular hours.\n\nAnyway, I'm always finding ways to automate my work or remove bottlenecks, unnecessary work, but that does not mean I have less work. I have less boring work and can spend time on more things that matter.",
          "score": 54,
          "created_utc": "2026-02-12 01:10:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4wk0jh",
              "author": "No-Mud4063",
              "text": "from what i heard, their experimentation platform is already automated to a large extent, running t tests and such",
              "score": 8,
              "created_utc": "2026-02-12 01:12:17",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4wl1t1",
                  "author": "Single_Vacation427",
                  "text": "That's the case in most places",
                  "score": 32,
                  "created_utc": "2026-02-12 01:18:39",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o4wlhox",
                  "author": "gpbuilder",
                  "text": "That’s literally most big tech companies for the past 10 years, no one is manually doing t-tests",
                  "score": 38,
                  "created_utc": "2026-02-12 01:21:23",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4wq5hm",
          "author": "anomnib",
          "text": "Meta seems like the last place to do this (I used to work there). DS at Meta have more influence over strategy than any other big place I’ve worked. \n\nI can see them automating their data analysts, but their DS function like quant PMs. \n\n\nI would more expect this where DS are just seen as numbers people. \n\nOn the other hand, I was at Meta before Zuck rebranded himself",
          "score": 46,
          "created_utc": "2026-02-12 01:50:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4xsp38",
              "author": "TopStatistician7394",
              "text": "Yeah good luck automating the million alignment meetings, goal and target setting negotiations etc etc ",
              "score": 14,
              "created_utc": "2026-02-12 06:15:26",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4xusfi",
          "author": "No-Mud4063",
          "text": "well.. thanks for the replies. i got humbled quite a bit here. leaving the post here in case anyone hears similar rumors",
          "score": 18,
          "created_utc": "2026-02-12 06:33:58",
          "is_submitter": true,
          "replies": [
            {
              "id": "o4xwbjr",
              "author": "TesseB",
              "text": "Your positive response to that is a great quality. Good luck with your interviews!",
              "score": 15,
              "created_utc": "2026-02-12 06:47:50",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4xu5yt",
          "author": "DukeRioba",
          "text": "I work in tech (not Meta but similar-scale), and these rumors pop up every quarter. Yes, data teams get pressure to automate repetitive tasks, but that doesn’t mean analysts get fired. It usually means the job evolves, not disappears.",
          "score": 15,
          "created_utc": "2026-02-12 06:28:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4wsar5",
          "author": "Yourdataisunclean",
          "text": "I would pay money to watch them try to do this.",
          "score": 14,
          "created_utc": "2026-02-12 02:02:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4x702g",
          "author": "slappster1",
          "text": "It’s not true, but you are expected to use AI heavily to automate workflows.",
          "score": 5,
          "created_utc": "2026-02-12 03:32:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4wln2x",
          "author": "gpbuilder",
          "text": "And you just believe that? Lol",
          "score": 6,
          "created_utc": "2026-02-12 01:22:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4wnlyc",
              "author": "No-Mud4063",
              "text": "it does track to some extent. the ds roles in amazon are dwindling down. they are being refactored into either as/sde or bie/business analyst. at the same level, there are roughly 5-10x sde and as positions than DS positions in amazon.  so it is not too crazy that meta might be heading down that path too. ",
              "score": -1,
              "created_utc": "2026-02-12 01:34:34",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4wux1e",
                  "author": "Single_Vacation427",
                  "text": "Amazon was never big on data science. It's mostly a new-ish role and rare role there. They mostly have that business engineering something and then applied scientist. It's weird that way. ",
                  "score": 12,
                  "created_utc": "2026-02-12 02:18:36",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o51uq8b",
          "author": "Cptcongcong",
          "text": "I work at Meta and frequent blind. Blind is where people go to circlejerk. I’d be surprised if even 20% of the things said on there is true.",
          "score": 3,
          "created_utc": "2026-02-12 21:12:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o51vcci",
              "author": "No-Mud4063",
              "text": "Are you a ds at meta? Asking to see if there is any mle for a ds position in meta or if its just ab testing",
              "score": 1,
              "created_utc": "2026-02-12 21:15:37",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o51vjhl",
                  "author": "Cptcongcong",
                  "text": "No, MLE. But have a couple of DS friends",
                  "score": 1,
                  "created_utc": "2026-02-12 21:16:35",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5626m8",
          "author": "patternpeeker",
          "text": "i can’t speak to internal plans, but rumors about “fully automating ds” tend to ignore how much product analytics is about framing problems and influencing decisions. even if tooling improves, someone still has to define metrics, debug data issues, and connect analysis to product moves. if u’re worried, use the interview to ask how they see the role evolving and what problems the team actually owns. that will tell u more than blind posts.",
          "score": 3,
          "created_utc": "2026-02-13 14:21:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o54cs3v",
          "author": "DaxyTech",
          "text": "Here are a few things that might help: (1) For the product case, practice structuring answers as: clarify metric > decompose into components > hypothesize > recommend experiment. They want to see you think like a product DS, not just a stats person. (2) SQL round is honestly more about window functions and edge cases than complexity - practice self-joins, CASE WHEN aggregations, and handling NULLs properly. (3) The behavioral round matters more than people think. Use STAR format and have 2-3 stories about cross-functional influence and handling ambiguity. (4) For experimentation, know interference effects, ratio vs. non-ratio metrics, and when you'd choose something other than a standard A/B test. Good luck - the process is long but fair if you prepare systematically.",
          "score": 2,
          "created_utc": "2026-02-13 06:19:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5uqy3i",
          "author": "Cute_Intention6347",
          "text": "I saw similar posts about Meta restructuring parts of the DS/analytics teams, lots of rumors floating around. From my experience and what I’ve seen shared on Blind/Glassdoor:\n\n**• Big tech often reorganizes teams frequently**, which doesn’t automatically mean a “hire-to-fire” situation.  \n**• Some teams get more automation tools, but that usually shifts work rather than eliminates it.**  \n**• Product analytics is often tied closely to business decisions and strategy, so those roles tend to be more stable than pure ops/data-entry DS roles.**\n\nThat said, things can vary a lot by team and manager. Best options if you’re unsure:\n\n1. Ask your Meta recruiter directly what the role’s long-term priorities are and how the team fits into broader goals.\n2. See if you can talk to someone currently on the team (LinkedIn or Reddit AMAs can help).\n\nI wouldn’t assume it’s a guaranteed “hire for fire,” but definitely ask clarifying questions so you can decide for yourself.",
          "score": 1,
          "created_utc": "2026-02-17 12:18:06",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r53jy3",
      "title": "Best technique for training models on a sample of data?",
      "subreddit": "datascience",
      "url": "https://www.reddit.com/r/datascience/comments/1r53jy3/best_technique_for_training_models_on_a_sample_of/",
      "author": "RobertWF_47",
      "created_utc": "2026-02-15 02:54:52",
      "score": 42,
      "num_comments": 25,
      "upvote_ratio": 0.92,
      "text": "Due to memory limits on my work computer I'm unable to train machine learning models on our entire analysis dataset. Given my data is highly imbalanced I'm under-sampling from the majority class of the binary outcome. \n\nWhat is the proper method to train ML models on sampled data with cross-validation and holdout data?\n\nAfter training on my under-sampled data should I do a final test on a portion of \"unsampled data\" to choose the best ML model?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/datascience/comments/1r53jy3/best_technique_for_training_models_on_a_sample_of/",
      "domain": "self.datascience",
      "is_self": true,
      "comments": [
        {
          "id": "o5h69oy",
          "author": "AccordingWeight6019",
          "text": "Key rule: only sample the training data, never validation or test data. Split first, keep validation and holdout sets in the original imbalanced distribution, then apply under sampling inside each CV training fold. Select models based on performance on the untouched validation data, and do the final evaluation once on a fully unsampled holdout set. ",
          "score": 32,
          "created_utc": "2026-02-15 08:17:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5kgvut",
              "author": "Specialist-Gur-601",
              "text": "Depends on the situation. What you say is true when you consider each datapoint to have the same weight. Sometimes this is not true, a false positive can be much more costly than a false negative, or vice versa.\n\nIdeally you would want to factor this with sample weights and adjusted metrics (F-beta for instance), but if somehow you are restrained by memory or compute time, undersampling, even the test set, can be the most practical solution.",
              "score": 6,
              "created_utc": "2026-02-15 20:34:56",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5nqlpt",
                  "author": "AccordingWeight6019",
                  "text": "That’s a fair point. If memory or compute constraints are severe, under sampling the test set can be practical, but it changes what your metrics actually measure. If you do that, make sure to report that the evaluation reflects the sampled distribution and, if possible, complement it with weighted metrics or approximate evaluation on a subset of the full distribution. This way, you at least understand how performance might differ in the real world class balance. ",
                  "score": 1,
                  "created_utc": "2026-02-16 10:02:32",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5g43gs",
          "author": "TheTresStateArea",
          "text": "Your final test needs to be on unsampled data.",
          "score": 22,
          "created_utc": "2026-02-15 02:59:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5g8wcz",
              "author": "RobertWF_47",
              "text": "Presumably not on each of the CV testing folds but on the holdout dataset?",
              "score": 3,
              "created_utc": "2026-02-15 03:32:57",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5gd3m0",
                  "author": "TheTresStateArea",
                  "text": "Ultimately your model lives and she's on real world application, so yes the holdout.",
                  "score": 11,
                  "created_utc": "2026-02-15 04:03:41",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5hkogt",
          "author": "patternpeeker",
          "text": "keep the sampling inside each cv fold, not before the split. under-sample only the training portion, then validate on untouched data with the real class imbalance. also keep a final holdout with the original distribution and use it once at the end. otherwise your metrics will look better than reality.",
          "score": 4,
          "created_utc": "2026-02-15 10:36:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5hscp5",
          "author": "[deleted]",
          "text": "If you care about the accuracy of your predicted probabilities, undersampling or oversampling will affect the accuracy of your predicted probabilities. You’ll need to perform post-training model calibration to correct this issue.",
          "score": 3,
          "created_utc": "2026-02-15 11:47:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5k5xib",
              "author": "RobertWF_47",
              "text": "I'm willing to have inaccurate predicted probabilities as long as rank is preserved for selecting the best threshold for predicting the 0/1 class. In that case is it ok to undersample?",
              "score": 0,
              "created_utc": "2026-02-15 19:38:44",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5i0l9a",
          "author": "Ty4Readin",
          "text": "As a general rule of thumb, undersampling any class is NOT a good idea. It almost always does worse in practice if you are using the correct loss function/evaluation metrics.\n\nBut, if you are going to do it, then you should only ever do it on the training dataset, never the validation set or test set.\n\nI think there are 2 better solutions for your situation:\n\n1. Subsample the entire dataset (not just one class)\n\n2. Use a model that can support training from disk. For example neural networks are very easy to train any dataset size due to batch loading. I think there are also some implementations for other models to support similar as well.\n\n\nOne other possible option is to undersample one class, but weight it higher in the loss to counter the undersampling. But I would treat this as a hyperparameter and see if it even performs any better than just subsampling the entire dataset.",
          "score": 3,
          "created_utc": "2026-02-15 12:55:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5k737c",
              "author": "RobertWF_47",
              "text": "I'm ok with predicted probabilities being inaccurate due to undersampling, as long as I can make reasonable predictions of the outcome class (0/1) by selecting a threshold. \n\nIf you're saying undersampling of the training data will produce worse predictions then I may have to reconsider undersampling.",
              "score": 1,
              "created_utc": "2026-02-15 19:44:35",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5kjriy",
                  "author": "Ty4Readin",
                  "text": "Undersampling is likely to produce worse in multiple regards, including the ordering of highest risk samples with a threshold.\n\nAs a general rule, my default be not to over or undersample any class.\n\nIf you are curious, you can treat it as a hyperparameter and see which performs better in CV. Just make sure your validation and test sets are not undersampled at all.",
                  "score": 4,
                  "created_utc": "2026-02-15 20:49:59",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5hvdnu",
          "author": "pppeer",
          "text": "In addition to what is mentioned, probably also good to approach your problem as a scoring problem rather than a classification problem and use metrics such as AUC. At minimum, if you are making hard labeling decisions or expecting a probability rather than a score, calibrate the models on the unsampled data.",
          "score": 2,
          "created_utc": "2026-02-15 12:13:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5l70pt",
          "author": "giridharaddagalla",
          "text": "Hey, totally get the memory constraints, that's a common pain point! For under sampling imbalanced data with CV, a good approach is to perform the sampling \\*within\\* each fold of your cross validation. This way, your validation sets remain representative of the real world distribution (or at least the original imbalanced distribution), and your training sets get the balanced sampling. For your final test, yeah, testing on a portion of \\*unsampled\\* data is definitely the way to go. It gives you the most realistic performance estimate of how your chosen model will fare on unseen, real data. Some folks even do a weighted evaluation on that holdout set to account for the original class imbalance, which can be super insightful.",
          "score": 2,
          "created_utc": "2026-02-15 22:51:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5lhrxu",
          "author": "Ghost-Rider_117",
          "text": "yeah I've dealt with this before - stratified sampling is definitely your friend here. make sure your sample reflects the class distribution properly, then do your train/test split on that sampled data. one thing that helped me was using SMOTE or other synthetic sampling techniques after you split, so you're not leaking info between train and validation sets. good luck!",
          "score": 2,
          "created_utc": "2026-02-15 23:54:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5pf9no",
          "author": "RB_7",
          "text": "There’s lots of sampling discussion here, which is fine, but if you’re just doing log reg / xgboost then it would be a lot simpler and more robust to just write a training loop that batches through your dataset from disk, loading a bit into memory at a time, updating the weights, and then loading the next batch. \n\nThen you can use the whole dataset, and not worry at all about sampling routines.",
          "score": 2,
          "created_utc": "2026-02-16 16:23:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5q0w5q",
              "author": "RobertWF_47",
              "text": "That's a possibility I should consider.\n\nHowever my data is quite scarce: 76,000 events vs. 31M non-events for the outcome I'm predicting. Plus many of the predictors are extremely imbalanced as well. My worry is running many ML models on small subsets does not return the same robust predictions as an all-data model, but rather an average of many sub-optimal models.",
              "score": 1,
              "created_utc": "2026-02-16 18:04:14",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5t03mj",
                  "author": "Wellwisher513",
                  "text": "If you're using xgboost, is recommend looking into using a polars lazy dataframe. I used it for a binary classification problem last week and it worked quite well, letting me train on roughly a terabyte of data in a cluster with 700gb of ram. It's a little finicky and you need your packages to be up to date, but once I figured it out, it worked great. Worth noting that automl doesn't support it, you'll have to use optuna for any tuning. \n\n\nIf you're using any other model type though, that might not be your best bet, as polars support is still pretty new. \n\n\nAs for over/under sampling, it might be worth looking into using weights.",
                  "score": 2,
                  "created_utc": "2026-02-17 03:33:19",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o5q535p",
                  "author": "RB_7",
                  "text": "I mean, think about how SDG works and ask yourself if batching from disk is any different.",
                  "score": 1,
                  "created_utc": "2026-02-16 18:23:21",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5od08x",
          "author": "VelvetCactus01",
          "text": "Use stratified sampling to preserve class distribution. Train on your sample, validate on holdout, test final on untouched data. That's the framework.",
          "score": 1,
          "created_utc": "2026-02-16 13:05:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5i5joj",
          "author": "PublicViolinist2338",
          "text": "It depends a lot on your situation, are you training neural networks or using something based on the Scikit API? In any case train/val/test splitting is crucial, but the implementation depends",
          "score": 1,
          "created_utc": "2026-02-15 13:29:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5jm7m6",
              "author": "RobertWF_47",
              "text": "Probably not neural networks - penalized logistic regression, xgboost, maybe SVM.",
              "score": 1,
              "created_utc": "2026-02-15 18:02:23",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5jui8h",
                  "author": "PublicViolinist2338",
                  "text": "Alright, it's actually not trivial to implement in that case. XGBoost and similar libraries typically want you to load the whole train data into memory before you call .fit. They have a solution: [https://xgboost.readthedocs.io/en/stable/tutorials/external\\_memory.html](https://xgboost.readthedocs.io/en/stable/tutorials/external_memory.html), but I am not sure about other scikit libraries\n\n",
                  "score": 2,
                  "created_utc": "2026-02-15 18:42:26",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1r7btpj",
      "title": "Career advice for new grads or early career data scientists/analysts looking to ride the AI wave",
      "subreddit": "datascience",
      "url": "https://www.reddit.com/r/datascience/comments/1r7btpj/career_advice_for_new_grads_or_early_career_data/",
      "author": "vanisle_kahuna",
      "created_utc": "2026-02-17 17:02:48",
      "score": 42,
      "num_comments": 28,
      "upvote_ratio": 0.82,
      "text": "From what I'm starting to see in the job market, it seems to me that the demand for \"traditional\" data science or machine learning roles seem be decreasing and shifting towards these new LLM-adjacent roles like AI/ML engineers. I think the main caveat to this assumption are DS roles that require strong domain knowledge to begin with and are more so looking to add data science best practices and problem framing to a team (think fields like finance or life sciences). Honestly it's not hard to see why as someone with strong domain knowledge and basic statistics can now build reasonable predictive models and run an analysis by querying an LLM for the code, check their assumptions with it, run tests and evals, etc. \n\nHaving said that, I'm curious what the subs advice would be for new grads (or early career DS) who graduated around the time of the ChatGPT genesis to maximize their chance of breaking into data? Assume these new grads are bootcamp graduates or did a Bachelors/Masters in a generic data science program (analysis in a notebook, model development, feature engineering, etc) without much prior experience related to statistics or programming. Asking new DS to pivot and target these roles just doesn't seem feasible because a lot of the time the requirements are often a strong software engineering background as a bare minimum.\n\nGiven the field itself is rapidly shifting with the advances in AI we're seeing (increased LLM capabilities, multimodality, agents, etc), what would be your advice for new grads to break into data/AI? Did this cohort of new grads get rug-pulled? Or is there still a play here for them to upskill in other areas like data/analytics engineering to increase their chances of success?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/datascience/comments/1r7btpj/career_advice_for_new_grads_or_early_career_data/",
      "domain": "self.datascience",
      "is_self": true,
      "comments": [
        {
          "id": "o5wbsd0",
          "author": "RobfromHB",
          "text": "The reality is a lot of platforms have matured and the low hanging fruit on the product roadmaps were completed 10 years ago so SaaS products started making in house analytics tools and focusing integrations with other systems (ex: connect your random ERP to Hub Spot or whatever). This was happening before LLMs took off and the current AI cycle just accelerated it. The writing was on the wall already for data analytics work.\n\nThe advice for new grads is still kind of the same as it was when the labor market got saturated around COVID, show people what you can build. No one cares about Titanic dataset tutorials or a portfolio of Jupyter notebooks with 30 pages of “report”. People want to see a unique insight on novel data, a project that conveys a sense of architecture, or some job experience that goes beyond homework. New grads and soon to be grads should be hammering every internship possible and working on projects that aren’t just resume padding. ",
          "score": 60,
          "created_utc": "2026-02-17 17:23:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5xrlqc",
              "author": "RecognitionSignal425",
              "text": "> The advice for new grads is still kind of the same\n\nCorrect. Just replace DS with math/language\n\n\"...I think the main caveat to this assumption are **math/language** roles that require strong domain knowledge to begin with and are more so looking to add **math/language** best practices and problem framing to a team ....\"\n\nThey are all tools to serve a domain \n\n",
              "score": 4,
              "created_utc": "2026-02-17 21:26:36",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o60vk0i",
              "author": "Love-Kale5265",
              "text": "Do you think this applies the same way in healthcare?  Im wondering about specific roles there like, given it’s more regulated and domain-heavy..  is that space also getting swallowed by internal tooling and AI automation?",
              "score": 2,
              "created_utc": "2026-02-18 09:16:07",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o5wm71d",
              "author": "vanisle_kahuna",
              "text": "Thanks, I've heard this as a lot as well and thankfully this is much easier to do with a Claude subscription. Although part of the reason why I mentioned that ML engineering is inaccessible to new grads is that (and correct me if I'm wrong) it's still rather difficult to say deploy an ML model within a app. So I'm curious what you would advise junior folks to build in order to stand out more in the job market and showcase it in their applications? To me, the projects that come to mind are jupyter books or data pipelines that feed into a web app but I'm curious if you have other suggestions that are accessible for new grads? \n\nAnd another challenge I think is how to market your work once you have a project going. Of course you can hype up your project on LinkedIn but I think part of the difficulty with this is that hiring managers aren't often looking through your GitHub or portfolio website (happy to be corrected in this as well).",
              "score": 1,
              "created_utc": "2026-02-17 18:12:32",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5wrb30",
                  "author": "RobfromHB",
                  "text": "Anything that can be done inside Claude is the equivalent of a tutorial these days and shouldn’t be given much weight by a recruiter / hiring staff. If it takes little effort to create it will get little consideration. Doing hard things is what makes someone stand out.\n\nHyping a project on LinkedIn is a waste of time. There is so much AI slop there that no one cares. That isn’t your target audience either. Same can be said of the expectation a hiring manager should go through a GitHub repo. That’s not what the person screening resumes is going to do.\n\nHonestly ML engineering has never been more accessible than it is now for students and that absolutely isn’t a notebook. \n\nIt needs to be a fully fledged project with some data ingestion, storage, manipulation or prediction, visualization, and some kind of feedback loop.",
                  "score": 14,
                  "created_utc": "2026-02-17 18:35:56",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5x78sy",
          "author": "kjwikle",
          "text": "As a Gen X adjacent to data science at work. Don’t get hung up on titles, or even the specifics of what you “think” you should be doing every day. Try and learn about the business where you work, or if it’s research/non profit/academic, learn about what actually goes on, when people ask you to help them with something, set boundaries, but help, you will learn more and probably be more effective long term than if you are too rigid and only want “strict” data science, math, modeling problems. If you’re seen as someone who can solve a problem with data you’re likely to be asked about math/modeling and other problems later. I work at a major manufacturing company. The grads we hired who dug in and tried to help build solutions with python/r did great, the ones who only wanted to build models struggled. Data science as a title was very popular for 10+ yrs but the work they did was more of a combination of bi/data engineering/data science. \n\nI’ve been in analytics for about 17 yrs.",
          "score": 16,
          "created_utc": "2026-02-17 19:50:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5xn83f",
              "author": "vanisle_kahuna",
              "text": "Thanks, this result helpful",
              "score": 1,
              "created_utc": "2026-02-17 21:06:16",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5xlicn",
          "author": "Beginning_Cup7065",
          "text": "I’ll advise new grads to either do software engineering or train themselves for jobs that involve building/fine-tuning foundation models (most companies require a PhD). \n\nMost of AI implementation is software engineering, and if you want to do that, you should just get a CS degree or teach yourself CS.",
          "score": 7,
          "created_utc": "2026-02-17 20:58:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5xp2rc",
              "author": "vanisle_kahuna",
              "text": "Yea this is largely similar to where I think the ball is rolling too. It just sucks tho for the folks that had already invested time/money in general DS programs just before LLMs because it was supposedly \"the sexiest job of the 21st century\"",
              "score": 2,
              "created_utc": "2026-02-17 21:14:59",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o62pkq6",
                  "author": "Intrepid-Training-27",
                  "text": "I am a dat scientist and I don’t see my work being done by any LLM. They can build a model but they cannot figure out which target variables to choose and why, understand why certain datasets should not be used , design custom features or trade off between a set of models that goes beyond mere performance metrics. The work of a data scientist is not going anywhere anytime soon",
                  "score": 1,
                  "created_utc": "2026-02-18 16:11:10",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5z6u9i",
          "author": "msn018",
          "text": "The job market has shifted, but new grads were not rug pulled so much as the expectations changed toward people who can ship real systems and create measurable business impact. Instead of targeting the old notebook focused data scientist role, focus on strong SQL, data modeling, basic software engineering practices, cloud fundamentals, and the ability to deploy and monitor simple pipelines. Pair that with either domain expertise in industries like finance or healthcare or practical LLM application skills such as building RAG systems, designing evaluations, and tracking cost and performance. Use platforms like Snowflake, BigQuery, dbt, StrataScratch, and AWS to build data skills, and tools like OpenAI, Hugging Face, LangChain, and Pinecone to experiment with AI applications. If you position yourself as someone who can turn messy data into reliable assets and deliver AI enabled features end to end, you can stay competitive even without a deep ML engineering background.",
          "score": 5,
          "created_utc": "2026-02-18 01:54:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5w8hcj",
          "author": "Ok-Energy-9785",
          "text": "My advice would be to look into leadership development programs. They're specifically designed for recent grads and offer the experience you need to get your feet off the ground. Even if it's not DS related you are still gaining domain knowledge and can find ways to insert DS to solve business problems",
          "score": 12,
          "created_utc": "2026-02-17 17:07:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5wjhxh",
              "author": "vanisle_kahuna",
              "text": "Interesting, this is actually the first time I've heard anyone give this kind of advice. Can you expand on what these programs teach and what are some of the best out there? Or did you broadly mean leadership development within an org assuming you've already got your foot in the door?",
              "score": 2,
              "created_utc": "2026-02-17 18:00:11",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5wltn7",
                  "author": "Ok-Energy-9785",
                  "text": "They are basically long term post grad internships where junior talent gets their \"in\" in the business and to follow a particular track. So they can be any work function you can think of (IT, HR, data analytics, finance, etc) where you work with boss and you basically are the junior talent on the team building your skill set.\n\nBasically any major company has them.",
                  "score": 2,
                  "created_utc": "2026-02-17 18:10:48",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5xdoov",
          "author": "th0ma5w",
          "text": "Honestly, I think hiring managers really need to look within themselves and decide if they want a real person. Many seem content on seeing only artifacts of work and their entire worldview is predicated on this and they are specifically paid to not understand this, and it is offensive to suggest that they should. Until management fully understands this, then they will continue to get bad results. Try to find a place that treats you like a person! Best of luck!",
          "score": 3,
          "created_utc": "2026-02-17 20:20:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6221e2",
              "author": "ArcherCommercial9238",
              "text": "Yes yes",
              "score": 1,
              "created_utc": "2026-02-18 14:19:08",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5yzzhb",
          "author": "hockey3331",
          "text": "> without much prior experience related to statistics or programming. \n\n\nI mean, why would you target data science without programming or statistics? Its really tough to avoid both.\n\n\nShort term, the play is to get into a company that is tech-illeterate and be their in-house expert. Then you use AI to deliver much faster than anyone else and get surface info on a ton of topics that nobody dreams of touching. You look like a rock star and start being trusted with your own initiatives and gain valuable experience in the real world - working at the stats/programming on the way.\n\n\nThats the most straightforward shot. Less competition too because talented and experienced DS practitioners are avoiding those places like the plague.",
          "score": 3,
          "created_utc": "2026-02-18 01:19:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o61cz5z",
              "author": "Decent-Signal-3798",
              "text": "can you recommend some valuable resources to learn statistics throughly for data science  \nany channel, course ,book or any website to practice & learn will work ",
              "score": 1,
              "created_utc": "2026-02-18 11:47:37",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5wx6xp",
          "author": "varwave",
          "text": "“Assume these new grads are bootcamp graduates or did a Bachelors/Masters in a generic data science program (analysis in a notebook, model development, feature engineering, etc) without much prior experience related to statistics or programming.” \n\nI’m going to be harsh. Tough love. Beyond just networking, you should get real rigorous skills \n\nGet good at software development. Or if you don’t have a MS, then statistics paired with strong programming skills is useful. Being mediocre at both statistics and software engineering skills, without niche domain knowledge, means being highly replaceable. Organizations are maturing in identifying their needs and there’s less willingness to take risk given the economy. You’re competing against people that do have a rigorous graduate level background in computer science, statistics and/or something similar and have practical experience in applications through internships and/or research. \n\nCash cow MS programs and boot camps were effective in job placement, when the job market was strong, interest rates were low and businesses were throwing money at all things data related",
          "score": 7,
          "created_utc": "2026-02-17 19:02:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5x0zc4",
              "author": "vanisle_kahuna",
              "text": "Thanks for the candid advice. This post wasn't necessarily for me tho lol. I just thought it was a discussion worth having for all the new grads here looking for career advice",
              "score": 2,
              "created_utc": "2026-02-17 19:20:46",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5y8pf1",
          "author": "HelpAFellowKnight",
          "text": "Just wanted to say, seeing some good, honest advice in here. Great question imo. Helped me at least.",
          "score": 2,
          "created_utc": "2026-02-17 22:50:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5x4gc1",
          "author": "Illustrious-Pound266",
          "text": "Learn agents. Agentic development is the future of AI.",
          "score": 2,
          "created_utc": "2026-02-17 19:37:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o623efb",
              "author": "mrproteasome",
              "text": "Absolutely this is solid advice. The prompting is less important than  having a swarm of agents executing different parts of a task (context my background is pharma).",
              "score": 2,
              "created_utc": "2026-02-18 14:26:07",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5xrjtg",
          "author": "Arnukas12345",
          "text": "I would say look for a niche role in that field.",
          "score": 1,
          "created_utc": "2026-02-17 21:26:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o61o7pp",
          "author": "patternpeeker",
          "text": "the bar moved toward stronger engineering, not just modeling in notebooks. llms help with prototyping, but shipping and maintaining systems still requires solid stats and backend skills, so doubling down on fundamentals is a safe move.",
          "score": 1,
          "created_utc": "2026-02-18 13:03:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o626gxc",
          "author": "AccordingWeight6019",
          "text": "The field isn’t disappearing, it’s evolving. Pure “notebook data science” roles are rarer, but demand for people who can work with data end to end and apply AI in real systems is growing. Focus on strong fundamentals (SQL, stats), add some engineering skills (APIs, pipelines, deployment), and learn how to use LLMs practically. The edge now is shipping solutions, not just training models.",
          "score": 1,
          "created_utc": "2026-02-18 14:41:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o612r9x",
          "author": "kartikey7734",
          "text": "The shift from \"traditional DS\" to \"AI-adjacent\" roles is real, but here's the unpopular take: this is actually GOOD for new grads.\n\n\n\nWhy? Because it's forcing differentiation.\n\n\n\n\\*\\*The commoditization trap:\\*\\*\n\nVanilla ML roles (\\~2020): Slightly better-paid data analyst with sklearn\n\n\\*\\*Result:\\*\\* Salary compression, market saturation, junior roles flooded\n\n\n\n\\*\\*New reality (2026):\\*\\*\n\n\\- Prompt engineers = glorified technical writers (sorry, but it's true)\n\n\\- Real DS = understanding \\*why\\* LLMs work, knowing when NOT to use them\n\n\\- Value = domain expertise + math literacy + shipping ability\n\n\n\n\\*\\*My advice for new grads:\\*\\*\n\n1. \\*\\*Get strong fundamentals\\*\\* (linear algebra, statistics, NOT \"build a neural net in 2 days\")\n\n2. \\*\\*Pick a domain\\*\\* (finance, biotech, climate - anywhere you can speak their language)\n\n3. \\*\\*Learn to communicate uncertainty\\*\\* (Bayesian thinking > point estimates)\n\n4. \\*\\*Ship projects\\*\\* that solve real problems, even if they're boring (not Kaggle comps)\n\n5. \\*\\*Learn the full stack\\*\\* - from data pipeline to A/B testing to business impact\n\n\n\nThe \"AI wave\" isn't drowning DS - it's rewarding people who go deeper instead of wider. New grads with strong fundamentals will beat prompt engineers with 0 domain knowledge every time.\n\n\n\nPs: The math/language/SWE skills rant is right on. Most junior roles fail because they have 0 software engineering rigor.",
          "score": -1,
          "created_utc": "2026-02-18 10:22:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6133vb",
              "author": "MarathonMarathon",
              "text": "Clink clank clunk",
              "score": 3,
              "created_utc": "2026-02-18 10:25:38",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r40rd2",
      "title": "Where do you see HR/People Analytics evolving over the next 5 years?",
      "subreddit": "datascience",
      "url": "https://www.reddit.com/r/datascience/comments/1r40rd2/where_do_you_see_hrpeople_analytics_evolving_over/",
      "author": "Proof_Wrap_2150",
      "created_utc": "2026-02-13 20:50:35",
      "score": 25,
      "num_comments": 13,
      "upvote_ratio": 0.81,
      "text": "Curious how practitioners see the field shifting, particularly around:\n\n* AI integration\n* Predictive workforce modeling\n* Skills-based org design\n* Ethical boundaries\n* Data ownership changes\n* HR decision automation\n\nWhat capabilities do you think will define leading functions going forward?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/datascience/comments/1r40rd2/where_do_you_see_hrpeople_analytics_evolving_over/",
      "domain": "self.datascience",
      "is_self": true,
      "comments": [
        {
          "id": "o58b8wi",
          "author": "JamesDaquiri",
          "text": "Probably a post better suited for r/humanresources as I can’t image there are many PA professionals here. Probably a lot of people who think HR are evil puppet masters or something. \n\nTo your post, it’s just impossible to say. Things are evolving quickly- so I don’t have any input on tools or methodology changes. \n\nBut I will say (and this applies to most domains), being able to show your value and communicate strategic insights that are actually incorporated is and will be a make or break for the field. You have to be technical, persuasive, and privy to building and maintaining professional relationships if you want to thrive in this niche. Being a people-person with data skills and a background in the domain (HRM, IO psych) is what companies are after right now, and I don’t see that changing.\n\nEdit: also, I don’t think automated HR decision making should now nor ever go beyond algorithmic resume parsing and pre-hire assessment scoring. With how much red tape (and rightfully so) exists in labor practices, the “human-in-the-loop” aspect of automation/AI is more crucial than other domains.",
          "score": 21,
          "created_utc": "2026-02-13 20:57:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o59aiym",
              "author": "Proof_Wrap_2150",
              "text": "Thank you for your response!",
              "score": 1,
              "created_utc": "2026-02-14 00:06:17",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o58bj5d",
          "author": "Trick-Interaction396",
          "text": "I think you mean Clanker Analytics",
          "score": 25,
          "created_utc": "2026-02-13 20:58:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o58d8r6",
          "author": "coconut48282736",
          "text": "I work as a DS in people analytics at a F500. As far as I see it, I don’t see a roadmap for automation of decisions as a result of AI, but there is a clear road to use DS and AI to recommend, facilitate, and create self serve data engines for HR leaders. I’m an IC though, not a manager.\n\nThe current path I see for 5 years is less human interaction needed to make data pulls/aggregations. More emphasis on creating generalizable tools that let HR leaders make all those decisions themselves without needed interaction from a DS. DS will likely focus on more complex experimentation and modeling.",
          "score": 6,
          "created_utc": "2026-02-13 21:07:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5k3q8j",
              "author": "jgmz-",
              "text": "Was also a DS in people analytics for sometime. I agree with your last point - internal audience segmentation and predictive modeling will continue to be common applications in the domain. I think in 5 years, decision sciences as a whole will become more valuable after AI has solved reporting (or at least made more accessible) for the simpler analysis pipelines.",
              "score": 1,
              "created_utc": "2026-02-15 19:27:38",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5d5ks7",
          "author": "AIAlchemy",
          "text": "There are 2 parallel trends because of AI. 1) Like any other functions HR managers become more self sufficient with pulling data and making analysis without relying on an analyst or data scientist. They can also do a lot more analysis and faster than before. However not everyone is qualified to interpret the data. 2) The workforce is changing at a rapid pace, and what skills used to matter (technical) don't matter as much with the help of AI but judgment and people skills are still in limited quantity. So HR has a critical role to play in rethinking how the workforce needs to evolve (hiring, training performance reviews....)",
          "score": 2,
          "created_utc": "2026-02-14 16:53:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5a9gg8",
          "author": "jdnhansen",
          "text": "Imagine that all HR teams have cheap access to coding skills and interns. In that world, you would value people who can effectively made good decisions about what to do with an abundance of coding/intern labor. I expect somewhat smaller HR teams with more experienced practitioners. On the Analytics side, you want people with a mix of tech skills, industry expertise, and communication/collaboration skills. \n\nI lead a small people science team, and we are using AI to build new solutions in-house. It’s mostly AI assistance with coding (eg R/Python/SQL/terminal), but we just brought on board a new AI agent solution, and that seems very powerful, too.",
          "score": 1,
          "created_utc": "2026-02-14 03:48:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5hw33s",
          "author": "pppeer",
          "text": "This is a broad question, but recruitment is definitely a priority areas such as defense, energy and utility market and other understaffed markets. Another one is agents and workflows for HR services, lots of opportunities for streamliming and optimizing all people and employee related workflows through centralized platforms, with AI embedded. Finally, the HR area is rife with all forms of knowlede portals/bass, so in the short term there is a lot of appetite for RAG-type applications (\"what are my company holidays?\" \"Can I do company sponsored volunteering work? \" etc).",
          "score": 1,
          "created_utc": "2026-02-15 12:19:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5mkkw6",
          "author": "DFW_BjornFree",
          "text": "Surprised you didn't mention anything about workplace monitoring or behavioral analytics.\n\n\nPA at my employer builds internal employee segments based upon user data collected from services like MS365, github, keys typed, and then other stuff like badge in / out, working extra hours, etc. \n\n\nBasically they determine what is normal for a certain role at a certain level because they have tons of employees at that level and they can map what good looks like to annual review ratings. Sure reviews don't map perfectly but there is correlation and they essentially use it to flag people who compared to their peers, don't appear to be very productive and this plays into giving feedback to organizational leaders and is part of what helps justify a PIP (but it isn't want triggers or causes a pip in itself)\n\n\nA persons manager isn't likely high enough to know many details but they will get feedback from their orgs leadership that it seems like xyz person isn't working much and it's basically the managers job to explain why / deffend it or else agree that the person has been slacking. \n\n\nPersonally, I actually kind of like it but that's because I have no issue working while I am at work and we all know what it feels like to have someone that both doesn't pull their weight and then also doesn't try. \n\n\nAt some point, you're too senior for some of the things to apply but that's where employee segments come into play.\n\n\nThey do care a lot though about time in the office though and managers are asked to keep notes in the system if they gave an employee special permission like being able to leave before 3 to pick up a kid and then working for a bit once they're home. In any case, they just identify things where manager input is needed to justify so if you're on good terms with leadership you're fine even if the system thinks you're underperforming however if you're on bad terms with them and you get flagged for slacking you could be screwed.",
          "score": 1,
          "created_utc": "2026-02-16 04:01:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5qeht5",
          "author": "Key-Boat-7519",
          "text": "Leading functions are going to be the ones that own fewer, higher‑stakes questions end to end, not the ones with the fanciest models. Think “who we hire, how we pay, who we keep” with clear financial impact, ethics guardrails, and change ownership. AI will mostly be workflow and decision support: nudging managers, surfacing risk, and automating boring admin, while humans arbitrate tradeoffs. Real edge will be in stitching data across HRIS, ATS, L&D, and equity/comp tools like Workday, Greenhouse, and Cake Equity so you can model scenarios and show the CFO hard tradeoffs, not just dashboards. That ability to connect decisions to business outcomes will define the leaders.",
          "score": 1,
          "created_utc": "2026-02-16 19:06:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ubzkp",
          "author": "Helpful_ruben",
          "text": "Error generating reply.",
          "score": 1,
          "created_utc": "2026-02-17 10:12:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5d1e3a",
          "author": "Cheap_Scientist6984",
          "text": "They will get better at hiring who they want and the office will start to look like the Bunker in Fallout where everyone is microchipped to be a super agreeable woman.  ",
          "score": 0,
          "created_utc": "2026-02-14 16:32:17",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r24okt",
      "title": "Rescaling logistic regression predictions for under-sampled data?",
      "subreddit": "datascience",
      "url": "https://www.reddit.com/r/datascience/comments/1r24okt/rescaling_logistic_regression_predictions_for/",
      "author": "RobertWF_47",
      "created_utc": "2026-02-11 18:05:18",
      "score": 23,
      "num_comments": 19,
      "upvote_ratio": 0.89,
      "text": "I'm building a predictive model for a large dataset with a binary 0/1 outcome that is heavily imbalanced.\n\nI'm under-sampling records from the majority outcome class (the 0s) in order to fit the data into my computer's memory prior to fitting a logistic regression model.\n\nBecause of the under-sampling, do I need to rescale the model's probability predictions when choosing the optimal threshold or is the scale arbitrary?",
      "is_original_content": false,
      "link_flair_text": "ML",
      "permalink": "https://reddit.com/r/datascience/comments/1r24okt/rescaling_logistic_regression_predictions_for/",
      "domain": "self.datascience",
      "is_self": true,
      "comments": [
        {
          "id": "o4ub72f",
          "author": "Lamp_Shade_Head",
          "text": "My first question would honestly be why you decided to sample the data in the first place. Did you try building a model on the full dataset as it is?\n\nIn my field we regularly deal with less than a 1 percent bad rate, and I have yet to see anyone rely on under or over sampling in practice. Usually the approach is to build the model on the original data, generate a precision recall curve or another metric that fits the use case, and then choose a probability threshold based on that.\n\nIf you really feel the need to adjust for class imbalance, I would lean toward using sampling weights rather than actually under sampling or over sampling the data.",
          "score": 22,
          "created_utc": "2026-02-11 18:21:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ugl8v",
              "author": "RobertWF_47",
              "text": "Thank you. Yes, normally I wouldn't sample the data, but in this case the analysis dataset is too big to fit into our memory for analysis so we have to resort to sampling. And the data is imbalanced, 74K events out of 31M records (0.24%), with several hundred binary predictors which are also sparse.",
              "score": 5,
              "created_utc": "2026-02-11 18:46:21",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4uloz7",
                  "author": "Lamp_Shade_Head",
                  "text": "That makes sense. For your question, I think if you use down sampling but do NOT use sampling weights, the interpretation might change. But if you  do downsample and use sampling weights during model fit, the probability interpretation will not change since the effective class distribution is restored as weights are used in the loss function.\n\nSomeone Please feel free to correct if I am wrong.",
                  "score": 11,
                  "created_utc": "2026-02-11 19:10:05",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o4wwlnk",
                  "author": "hyperactivedog",
                  "text": "Figure out your max data size, down sample uke majority until you're there. \n\nOr do quantile binning and weight by counts.",
                  "score": 3,
                  "created_utc": "2026-02-12 02:28:36",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o4xsjvu",
                  "author": "ArcticGlaceon",
                  "text": "Why can't you sample proportionately for each class?",
                  "score": 2,
                  "created_utc": "2026-02-12 06:14:09",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4va434",
          "author": "Infinitedmg",
          "text": "You should never undersample unless you've run into compute/memory limitations. There's no good statistical reason to undersample.\n\nIf you did undersample, you only need to tweak the intercept term such that the predicted mean probability matches the mean of the overall dataset. In the case of undersampling, you would need to lower the intercept term, as you have inflated the occurrence of the positive class.",
          "score": 7,
          "created_utc": "2026-02-11 21:07:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ubn7g",
          "author": "occamsphasor",
          "text": "It really depends more on what the decision boundary looks like… I would start by doing some plotting and looking at precision and recall for the underrepresented class and go from there.",
          "score": 4,
          "created_utc": "2026-02-11 18:23:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4uhaj9",
              "author": "RobertWF_47",
              "text": "That's what I'm thinking - using a precision-recall curve to select the threshold.",
              "score": 2,
              "created_utc": "2026-02-11 18:49:37",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4xokbl",
                  "author": "ConsistentLynx2317",
                  "text": "Question, would you use a precision recall curve or an roc-auc curve to choose potential threshold? I’m still new sorry. Why the p/r curve?",
                  "score": 3,
                  "created_utc": "2026-02-12 05:40:14",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4vctwh",
          "author": "DefinitelyNotActuary",
          "text": "Doesn’t matter what the scaling is if you only care about the predictions. It will move the probabilities around but ultimately the order of your observations from a predicted probability standpoint is not changed. If you actually use probabilities you will need to calibrate with something like betacal or other technique.",
          "score": 4,
          "created_utc": "2026-02-11 21:20:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4wtyak",
          "author": "orz-_-orz",
          "text": "Model calibration",
          "score": 2,
          "created_utc": "2026-02-12 02:12:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4wwdc7",
          "author": "hyperactivedog",
          "text": "I haven't needed to worry about sampling much with xgboost and similar for binary classification problems. It's only really a probably if you've got a billion or so observations and/or hundreds of features. \n\nI do have one pipeline that samples down the largest class (out of a dozen) until I'm down to 50m observations but that's more about memory management than statistical performance.",
          "score": 2,
          "created_utc": "2026-02-12 02:27:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4y013s",
          "author": "rsambasivan",
          "text": "There are two approaches I am aware of to solve this:  \n(1) Use resampling to address the imbalance (check out imblearn if you are using python)\n\n(2) Work with the imbalance (assuming that you are not in like outlier territory, where you have 5 records for the minority class and 1 million for the majority class), then recaliberate your classifier. So this means build your classifier with your favorite algorithm, logistic, random-forest, xg-boost, whatever gives you a decent performance on a test set, recaliberate it - sklearn has isotonic regression and platt scaling, choose the one one that gives you the best result.\n\nPractically, in these kind of problems, you need to understand and determine the trade off between the false positive rate and the false negative rate. This is in relation to picking a threshold for classifying an example as a positive - 0.5 won't be optimal. In a marketing application, false positives may be one you control, in a health care setting (screening for a disease), a false negative is what you control. But to get back to your question, if you choose to work with the imbalance, then recalibration usually helps. Good luck",
          "score": 2,
          "created_utc": "2026-02-12 07:21:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4yopvr",
          "author": "patternpeeker",
          "text": "if u under sample, the predicted probabilities won’t reflect the true base rate. the ranking may still work, but calibration will be off unless u correct for the original class prior. using class weights is often cleaner if memory allows.",
          "score": 2,
          "created_utc": "2026-02-12 11:18:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o54cfny",
          "author": "DaxyTech",
          "text": "Great question -- this trips people up more often than you'd think. When you undersample your majority class, you shift the base rate in your training data, so the raw predicted probabilities are no longer calibrated to the true population distribution. The standard correction is Platt scaling or the offset adjustment. For logistic regression: p\\_corrected = p\\_model / (p\\_model + (1 - p\\_model) \\* (beta\\_0 / beta\\_1)) where beta\\_0 is the negative class sampling rate and beta\\_1 is the positive class sampling rate. I'd also recommend calibration curves (sklearn.calibration.calibration\\_curve) before and after correction. Isotonic regression calibration works well if the relationship isn't cleanly monotonic. Watch out: if undersampling is aggressive (like 1:1 on a 99:1 problem), even the correction might not fully recover calibration at extremes. Consider SMOTE or a weighted loss function instead.",
          "score": 2,
          "created_utc": "2026-02-13 06:16:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o56joms",
              "author": "RobertWF_47",
              "text": "Thank you! For prediction (not causal inference) the scale of the predicted probabilities is shifted when undersampling but the order remains the same, right? So when choosing an optimal threshold to predict 1 vs 0 the Platt scaling isn't necessary?",
              "score": 1,
              "created_utc": "2026-02-13 15:48:56",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o55nxb7",
          "author": "Comfortable_Newt_655",
          "text": "that is a really common problem\n\n",
          "score": 2,
          "created_utc": "2026-02-13 13:02:18",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r3gi4p",
      "title": "What would you do with this task, and how long would it take you to do it?",
      "subreddit": "datascience",
      "url": "https://www.reddit.com/r/datascience/comments/1r3gi4p/what_would_you_do_with_this_task_and_how_long/",
      "author": "TheTresStateArea",
      "created_utc": "2026-02-13 05:14:42",
      "score": 12,
      "num_comments": 18,
      "upvote_ratio": 0.71,
      "text": "I'm going to describe a situation as specifically as I can. I am curious what people would do in this situation, I worry that I complicate things for myself. I'm describing the whole task as it was described to me and then as I discovered it.\n\nUltimately, I'm here to ask you, **what do you do, and how long does it take you to do it?**\n\n\nI started a new role this month, I am new to advertising modeling methods like mmm, so I am reading a lot about how to apply the methods specific to mmm in R and python, I use VScode, I don't have a github copilot license, I get to use copilot through windows office license. Although this task did not involve modeling, I do want to ask about that kind of task another day if this goes over well.\n\n\n##### The task\n5, excel sheets are to be provided. You are told that this is a clients data that was given to another party for some other analysis and augmentation. This is a quality assurance task. The previous process was as follows;\n\n##### the data\n* the data structure: 1 workbook per industry for 5 industries\n* 4 workbooks had 1 tab, 1 workbook had 3 tabs\n* each tab had a table that had a date column in days, 2 categorical columns advertising_partner, line_of_business and at least 2 numeric columns per work book.\n* some times data is updated from our side and the partner has to redownload the data and reprocess and share again\n\n##### the process\n* this is done once per client, per quarter (but it's just this client for now)\n* open each workbook\n* navigate to each tab\n* the data is in a \"controllable\" table\n\n |   | | | | |\n---|---|---| ---|---|---|\nbing| bing | | |\nhome | home | | |\nimpressions | spend | | partner dropdown| line of business dropdown\n\n* where bing and home are controlled with drop down toggles, with a combination of 3-4 categories each.\n* compare with data that is to be downloaded from a tableau dashboard\n* end state: the comparison of the metrics in tableau to the excel tables to ensure that \"the numbers are the same\"\n* the categories presented map 1 to 1 with the data you have downloaded from tableau\n* aggregate the data in a pivot table, select the matching categories, make sure the values match\n\n\n\n#### additional info about the file\n*  the summary table is a complicated sumproduct look up table against an extremely wide table hidden to the left. the summary table can start as early as AK and as late as FE.\n* there are 2 broadly different formats of underlying data in the 5 notebooks, with small structure differences between the group of 3.\n\n###### in the group of 3\n* the structure of this wide table is similar to the summary table with categories in the column headers describing the metric below it. but with additional categories like region, which is the same value for every column header. 1 of these tables has 1 more header category than the other 2\n* the left most columns have 1 category each, there are 3 date columns for day, quarter.\n\n\n| | | | | | |\n|---|---|----|----| ---- | ---- | ---- | ---- |\n| | | | \n| | REGION |  | USA | USA | USA\n| | PARTNER | | bing  | bing | google |\n| | LOB | | home | home | auto |\n|  |  |  | impressions | spend | ...etc|\n| date | quarter|  | impressions| spend | ...etc|\n| 2023-01-01 | q1|  | 1| 2 | ...etc |\n| 2023-01-02 | q1|  | 3| 4 | ...etc |\n\n\n###### in the group of 2\n\n* the left most categories are actually the categorical headers in the group of 3, and the metrics, the values in each category mach\n* the dates are now the headers of this very wide table\n* the header labels are separated from the start of the values by 1 column\n* there is an empty row immediately below the final row for column headers.\n\n\n| | | | | | | |\n|---|---|----|----| ---- | ---- | ---- | ---- | ---- |\n| | | | date Label| | 2023-01-01 | 2023-01-02 |\n| | | | year| | 2023 | 2023 |\n| | | | quarter| | q1 | q1 | \n| blank row | | | | | | |\n| REGION | PARTNER | LOB | measure| | | |\n| blank row | | | | | | |\n| US | bing | home | impressions |  | 1 | 3| \n| US | bing | home | spend |  | 2 | 4 | \n| US | google | auto | ...etc | | ...etc | ... etc|\n\n\nThe question is, what do you do, and how long does it take you to do it?\n\nI am being honest here, I wrote out this explaination basically in the order in which I was introduced to the information and how I discovered it. *(Oh it's easy if it's all the same format even if it's weird, oh there are 2-ish different formatted files)*\n\nthe meeting of this task ended at 11:00AM. I saw this copy paste manual etl project and I simply didn't want to do it. So I outlined my task by identifying the elements of the table, column name ranges, value ranges, stacked / pivoted column ranges, etc... for an R script to extract that data. by passing the ranges of that content to an argument `make_clean_table(left_columns=\"B4:E4\", header_dims=c(..etc))` and functions that extract that convert that excel range into the correct position in the table to extract that element. Then the data was transformed to create a tidy long table.\n\nthe function gets passed once per notebook extracting the data from each worksheet, building a single table with the columns for the workbook industry, the category in the tab, partner, line of business, spend, impressions, etc...\n\nIMO; ideally (if I *have* to check their data in excel that is), I'd like the partner to redo their report so that I received a workbook with the underlying data in a traditionally tabular form and their reporting page to use power query and table references and not cell ranges and formula.",
      "is_original_content": false,
      "link_flair_text": "Analysis",
      "permalink": "https://reddit.com/r/datascience/comments/1r3gi4p/what_would_you_do_with_this_task_and_how_long/",
      "domain": "self.datascience",
      "is_self": true,
      "comments": [
        {
          "id": "o545z6h",
          "author": "AnnuallySimple",
          "text": "Honestly this sounds like absolute hell 💀 \n\n  \nI would've done exactly what you did - write a script to parse those nightmare Excel files rather than manually clicking through dropdowns and comparing values. The fact that they have two completely different formats mixed in there just screams \"someone cobbled this together over years without any standardization\"\n\n  \nFor time estimate, probably would've taken me a full day to write the R functions to handle both formats, especially with all those hidden columns and weird sumproduct lookups. The manual way they wanted? That's easily 2-3 days of mind-numbing work that you'd probably mess up anyway\n\n  \nYour suggestion about getting the partner to standardize their output is spot on - this whole setup feels like technical debt that everyone's just living with because \"that's how we've always done it\" 😂",
          "score": 21,
          "created_utc": "2026-02-13 05:24:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o549cza",
              "author": "dash_44",
              "text": "Yea this sounds awful and you know none of these files will be the same format the next time OP receives them.",
              "score": 3,
              "created_utc": "2026-02-13 05:51:15",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o54bbqk",
                  "author": "TheTresStateArea",
                  "text": "That's a good concern, I checked the previous quarter's files before I started to see if they were the same as this quarters version of them, and they were thankfully.",
                  "score": 4,
                  "created_utc": "2026-02-13 06:07:16",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            },
            {
              "id": "o5470j4",
              "author": "TheTresStateArea",
              "text": "I don't think the mmm projects will be less complicated lol",
              "score": 3,
              "created_utc": "2026-02-13 05:32:38",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o54j5dv",
          "author": "gocurl",
          "text": "That looks like pure etl fun!\nIf it was a one-off i would go dirty and hopefully do this in a day with the objective to merge all and create one single table.\nThe problem is to \"scale\" this for more workbooks, and also for next time.\nSome orher options: do the etl with other tools like KMINE, power-bi or n8n to create your workflow.\nGood luck!",
          "score": 13,
          "created_utc": "2026-02-13 07:14:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5a432c",
          "author": "Key_Post9255",
          "text": "Create a modular pipeline if you can. Each module a spreadsheet. Then create a wiring module. I would avoid different notebooks as it keeps things messy and difficult to replicate/scale.",
          "score": 3,
          "created_utc": "2026-02-14 03:11:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5bf2w1",
              "author": "BrettPitt4711",
              "text": "This is the way. It can be fine to start with different notebooks just to be able to focus on a single thing at a time but later combine them to a clean unified solution.",
              "score": 1,
              "created_utc": "2026-02-14 09:52:38",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o55ntwi",
          "author": "Comfortable_Newt_655",
          "text": "that sound really hard",
          "score": 1,
          "created_utc": "2026-02-13 13:01:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5qcwfv",
          "author": "DaxyTech",
          "text": "You absolutely made the right call scripting this out. For recurring quarterly QA tasks like this, the automation ROI pays for itself after the second run and you eliminate the human error risk that comes with manually cross-referencing pivot tables across workbooks. One thing I'd add: consider building a lightweight validation layer that automatically flags discrepancies above a threshold rather than just extracting data. Pull the Tableau data programmatically (most deployments support data export via REST API or tabcmd), run your R extraction on the Excel files, then compute and log the diffs. That way QA becomes a single-command operation. For the format inconsistency across workbooks, I'd recommend abstracting your parser so each workbook type maps to a config rather than hardcoding ranges. If the partner changes their format next quarter, you just update the config instead of rewriting logic. Biggest time sink is usually the initial format discovery, which sounds like what took most of your day. Once encoded, subsequent quarters should be 30 min max.",
          "score": 1,
          "created_utc": "2026-02-16 18:59:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5v5fue",
          "author": "AbrocomaAny8436",
          "text": "Your instinct to refuse the manual copy-paste was 100% correct. But your execution (the R script) is a thermodynamic trap.\n\nYou wrote a script that relies on hardcoded cell ranges (`left_columns=\"B4:E4\"`). The moment the client adds a new region or line of business, your script will read the wrong columns, the QA will fail, and you will spend your Friday debugging ETL code for a formatting change.\n\nYou are treating their Excel file as a **Data Transport Layer**. They are treating it as a **Presentation Layer** (basically a digital PDF). Never write custom ETL scripts against a presentation layer.\n\n**Here is what you actually do, and how long it takes:**\n\n**1. The Short-Term Fix (30 minutes): Use Power Query.** Drop R for this. Excel has Power Query built-in. Point PQ at the folder containing the 5 workbooks. Tell it to grab the hidden raw data tables, select the category columns, and click 'Unpivot Other Columns'. It natively handles the wide-to-long transformation dynamically. If they add 10 new columns next quarter, Power Query unpivots them automatically without breaking.\n\n**2. The Long-Term Fix (10 minutes): The Data Contract.** You mentioned you are moving into MMM (Marketing Mix Modeling). MMM requires pristine time-series data. You cannot build MMM models on sumproduct presentation tabs. Send this email to the partner: *'To ensure automated QA and ingest for our MMM modeling, we can no longer accept pivoted presentation workbooks. Moving forward, please export the raw underlying data as a flat CSV in the following format: Date | Partner | Region | LOB | Impressions | Spend.'*\n\nThey are pulling this data from a SQL database or a dashboard before they mangle it into Excel. It is actually *easier* for them to give you a flat CSV.\n\nDo not become the maintainer of a brittle R script that parses hidden Excel tables. Enforce the data contract, or use Power Query if you are forced to ingest garbage.",
          "score": 0,
          "created_utc": "2026-02-17 13:48:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5vlm2g",
              "author": "TheTresStateArea",
              "text": "Man you didn't even read the post before you fed it to copilot or whatever.",
              "score": 1,
              "created_utc": "2026-02-17 15:13:31",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5wkki8",
                  "author": "AbrocomaAny8436",
                  "text": "Did you even read the answer before saying it's AI generated?",
                  "score": 0,
                  "created_utc": "2026-02-17 18:05:04",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o5wm70a",
                  "author": "AbrocomaAny8436",
                  "text": "You did the right thing by scripting this. Anyone telling you to manually compare pivot tables is setting you up for a Sisyphean nightmare. The R approach is solid for a one-off, but since this is quarterly.\n\n  \nYou know the rest; you asked for my advice. Who cares If I give it to you with bulletins and structured sentences if it's the right advice?\n\n  \nNext time I'll make sure to police how I write so I don't get caught up in base pattern-matching. \n\n  \nYou're welcome for the free advice in the time it took me to write all that. \n\n  \nUngrateful much?",
                  "score": 0,
                  "created_utc": "2026-02-17 18:12:31",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1r60jl0",
      "title": "Weekly Entering & Transitioning - Thread 16 Feb, 2026 - 23 Feb, 2026",
      "subreddit": "datascience",
      "url": "https://www.reddit.com/r/datascience/comments/1r60jl0/weekly_entering_transitioning_thread_16_feb_2026/",
      "author": "AutoModerator",
      "created_utc": "2026-02-16 05:01:10",
      "score": 9,
      "num_comments": 11,
      "upvote_ratio": 0.91,
      "text": " \n\nWelcome to this week's entering & transitioning thread! This thread is for any questions about getting started, studying, or transitioning into the data science field. Topics include:\n\n* Learning resources (e.g. books, tutorials, videos)\n* Traditional education (e.g. schools, degrees, electives)\n* Alternative education (e.g. online courses, bootcamps)\n* Job search questions (e.g. resumes, applying, career prospects)\n* Elementary questions (e.g. where to start, what next)\n\nWhile you wait for answers from the community, check out the [FAQ](https://www.reddit.com/r/datascience/wiki/frequently-asked-questions) and Resources pages on our wiki. You can also search for answers in [past weekly threads](https://www.reddit.com/r/datascience/search?q=weekly%20thread&restrict_sr=1&sort=new).",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/datascience/comments/1r60jl0/weekly_entering_transitioning_thread_16_feb_2026/",
      "domain": "self.datascience",
      "is_self": true,
      "comments": [
        {
          "id": "o5nofgz",
          "author": "AccordingWeight6019",
          "text": "If you’re transitioning into data science, one useful focus is learning the full workflow rather than stacking courses. Try to get comfortable with: problem framing → data cleaning → simple modeling → evaluation → communicating results. Many people over index on advanced models when most real work is messy data and decision support.\n\nA good progression is:\n\n* statistics + SQL + Python fundamentals\n* exploratory analysis and visualization\n* classical ML (regression, trees, validation)\n* one or two end to end portfolio projects with clear business questions\n\nHiring tends to reward evidence that you can take ambiguous data and produce actionable insight more than knowledge of specific algorithms.",
          "score": 4,
          "created_utc": "2026-02-16 09:42:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5odyg0",
              "author": "Due-Experience-382",
              "text": "how important is it to know the math behind the ML models, in detail?\n\nI'm learning Linear Regression but in great detail, and the professor is going deeply into the mathematics behind it, it is interesting, no doubt, but how does it change a perspective from one who has no mathematical knowledge with someone who has learned in great detail?",
              "score": 1,
              "created_utc": "2026-02-16 13:11:18",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5nizfy",
          "author": "PublicViolinist2338",
          "text": "I have an opportunity to pursue a PhD in data science. In the long-term, is it worth it in 2026 to get the extra expertise, or should I try to find a job directly?",
          "score": 1,
          "created_utc": "2026-02-16 08:50:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5nv1e9",
              "author": "pm_me_your_smth",
              "text": "A phd is a huge commitment, both effort and time wise. You need to be pretty invested in it (for whatever personal reason as long as it's solid). If you're doing it only to get a job later, then I'd recommend against it.",
              "score": 3,
              "created_utc": "2026-02-16 10:43:53",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o5q84ow",
              "author": "2apple-pie2",
              "text": "Do not get a PhD just to get a job. Especially in a field with an unknown future like DS\n\nIf you want to get a PhD, pursue something you are passionate about first and foremost. A lot can change in 5-6 years and don’t expect a job/professorship waiting for you at the end.",
              "score": 2,
              "created_utc": "2026-02-16 18:37:09",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5pta0z",
          "author": "Mathblasta",
          "text": "I'm about to graduate with a DS degree. It's been a lot more of a survey/broad overview than an in depth degree. I'm hoping to get started as a data analyst. \n\nRight now I feel like I have a decent grasp of Python and SQL, and after 10 years in ops management, a pretty good understanding of business processes. \n\nWhat I'd like to get more understanding of is data cleaning and processing. Are there any good courses/resources y'all could recommend for that?\n\nClasses now are focused on data warehousing and ML. What other skills should I make sure to have a grasp of to improve my chances of being able to find a job when I graduate?",
          "score": 1,
          "created_utc": "2026-02-16 17:28:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5snc4y",
          "author": "Worldly-Relation-108",
          "text": "Is there any api that can get hotel prices in Philippines easily?\n\n",
          "score": 1,
          "created_utc": "2026-02-17 02:14:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5wf99f",
          "author": "TodayEasy949",
          "text": "Transitioning to data science from web development…\n2 yrs in embedded c, 3 yrs in web development \nTook career break\n\nInterested in data science (not the fancy GenAI, LLM stuff), like to learn the basics and understand the problem before diving into the problem.\nI overthink about whether this is the path I should pursue or get back to web dev, or pursue masters.\n\nProgress so far : read some books on stat intuition like art of statistics, naked statistics. Finished reading and doing the exercises of ISLP. \nAbout to start some exploratory projects in next few days",
          "score": 1,
          "created_utc": "2026-02-17 17:40:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ybvvy",
          "author": "pr36_",
          "text": "In the world of consulting, what would you say is the stronger data science shop: Quantum Black by McKinsey or Simon-Kucher.\n\nI am trying to decide between these two companies and from my research Simon-Kucher is mainly focused on commercial strategy and I’m poised to enter their digital growth branch vs McKinsey that will be a data engineer II role in god knows what industry/capacity. not sure which direction to go and TC is roughly 40k higher at McKinsey and name recognition is obviously much higher.",
          "score": 1,
          "created_utc": "2026-02-17 23:06:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5r19st",
          "author": "ddp26",
          "text": "Claude Code is pretty slick for data science. Who's using it? Is it helpful?",
          "score": 1,
          "created_utc": "2026-02-16 20:57:34",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r3zq14",
      "title": "Mock interviews",
      "subreddit": "datascience",
      "url": "https://www.reddit.com/r/datascience/comments/1r3zq14/mock_interviews/",
      "author": "No-Mud4063",
      "created_utc": "2026-02-13 20:10:21",
      "score": 9,
      "num_comments": 8,
      "upvote_ratio": 0.91,
      "text": "Any other platform like prepfully for mock interviews from faang ds? Prepfully charges a lot. Any other place?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/datascience/comments/1r3zq14/mock_interviews/",
      "domain": "self.datascience",
      "is_self": true,
      "comments": [
        {
          "id": "o5bxzbg",
          "author": "polarkyle19",
          "text": "I would like to know if you find any",
          "score": 8,
          "created_utc": "2026-02-14 12:44:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o582phk",
          "author": "Forsaken-File9993",
          "text": "pramp is free option but quality can be inconsistent, also check if your university has career services that do mock interviews",
          "score": 2,
          "created_utc": "2026-02-13 20:14:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5g1i16",
          "author": "[deleted]",
          "text": "Stratascratch.",
          "score": 2,
          "created_utc": "2026-02-15 02:41:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5g1ybu",
              "author": "No-Mud4063",
              "text": "for mock interviews? ",
              "score": 0,
              "created_utc": "2026-02-15 02:44:28",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5g27fg",
                  "author": "[deleted]",
                  "text": "Yess!! It's actually one of the best one. And ask you questions based on the company you chose.",
                  "score": 1,
                  "created_utc": "2026-02-15 02:46:14",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1r2argg",
      "title": "Anyone ever work with Meta data?",
      "subreddit": "datascience",
      "url": "https://www.reddit.com/r/datascience/comments/1r2argg/anyone_ever_work_with_meta_data/",
      "author": "gengarvibes",
      "created_utc": "2026-02-11 21:49:23",
      "score": 7,
      "num_comments": 6,
      "upvote_ratio": 0.77,
      "text": "specifically looking to try and attribute ads to conversions. the clean room solutions that Meta supports seems really expensive. anyone ever spend enough money to get exposure logs or maybe even use a CRM to help attribution?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/datascience/comments/1r2argg/anyone_ever_work_with_meta_data/",
      "domain": "self.datascience",
      "is_self": true,
      "comments": [
        {
          "id": "o4vlgmo",
          "author": "appletothesauce",
          "text": "Pretty sure Cambridge Analytica wrote the handbook on working with Meta data. Unbeatable attribution, terrible exit strategy.",
          "score": 30,
          "created_utc": "2026-02-11 22:01:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4vm6uv",
              "author": "gengarvibes",
              "text": "lol but Meta knee jerked and have since made it nearly impossible to get anything out of their platform ",
              "score": 4,
              "created_utc": "2026-02-11 22:05:16",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4wkcue",
                  "author": "appletothesauce",
                  "text": "You can try their platform incrementality measurement if you have CAPI set up instead of using a clean room but they still won't give you the raw data and you have to trust their calcs. If you are a national advertiser and spend enough, you could also try a geo test, shakostats com has a good tool for designing and calculating results for these tests. It's difficult to trust their on platform incrementality tests as it is like a student grading their own homework. Just look at the recommendations in the ad platforms, they want you to broaden your reach, just use AI for targeting, and spend more $$$ with them.",
                  "score": 2,
                  "created_utc": "2026-02-12 01:14:22",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4vnf0r",
          "author": "Single_Vacation427",
          "text": "I'm pretty sure there are some research papers from professors that worked with Meta. I'd start there and maybe they have replication data without identifiers.",
          "score": 4,
          "created_utc": "2026-02-11 22:11:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4vq6p7",
          "author": "Artistic-Comb-5932",
          "text": "I worked there for a few months. Don't want to dox myself but it was pretty horrible and sick place. The data depends on the project but it's all about eye balls and young kids'eye balls....",
          "score": 5,
          "created_utc": "2026-02-11 22:25:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4w3jy3",
              "author": "Yourdataisunclean",
              "text": "[Don't forget the 17-strike policy for sex trafficking.  ](https://www.theverge.com/news/827658/meta-17-strike-policy-sex-trafficking-testimony-lawsuit)",
              "score": 7,
              "created_utc": "2026-02-11 23:36:09",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r4wfu9",
      "title": "Outside the US, What is the avg salary someone can get in like Canada, UK, Germany or other countries? For early level",
      "subreddit": "datascience",
      "url": "https://www.reddit.com/r/datascience/comments/1r4wfu9/outside_the_us_what_is_the_avg_salary_someone_can/",
      "author": "starktonny11",
      "created_utc": "2026-02-14 21:27:48",
      "score": 4,
      "num_comments": 31,
      "upvote_ratio": 0.57,
      "text": "Hi,i was considering to move to different countries for Product/market DS roles. i was wondering for early level how much salary is good or can expect? (If you get paid about 150k in the US), for early level (2-3 Years of experience) \n\nOr you could say top range in this countries for this role",
      "is_original_content": false,
      "link_flair_text": "Career | Europe",
      "permalink": "https://reddit.com/r/datascience/comments/1r4wfu9/outside_the_us_what_is_the_avg_salary_someone_can/",
      "domain": "self.datascience",
      "is_self": true,
      "comments": [
        {
          "id": "o5enwvf",
          "author": "Frogad",
          "text": "I've been looking for DS roles in the UK, granted more entry level but they've basically all been between 30-50k GBP. I don't think you could expect to make 150k after 2-3 years (or the pound equivalent) outside of a couple of companies.",
          "score": 20,
          "created_utc": "2026-02-14 21:35:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5fazja",
              "author": "JSweetieNerd",
              "text": "Average wage in UK is currently around £40k, noone should be accepting less than that for DS. Unfortunately many companies don't know / care and massively undervalue DS.",
              "score": 6,
              "created_utc": "2026-02-14 23:49:23",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5h293b",
                  "author": "[deleted]",
                  "text": "Is it 40k for fresher ok?",
                  "score": 1,
                  "created_utc": "2026-02-15 07:38:05",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o5v4o23",
              "author": "Viveknanduri",
              "text": "That tracks with the market I’ve seen.. I’m 3 years experience and was looking for roles between 60-80k and accepted an offer closer to the ceiling than the floor if that helps",
              "score": 2,
              "created_utc": "2026-02-17 13:43:48",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5vc86p",
                  "author": "Frogad",
                  "text": "Okay, thanks. I wasn't sure if I was just being scammed and lowballed but at least it tracks.",
                  "score": 1,
                  "created_utc": "2026-02-17 14:25:09",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o5eocf9",
              "author": "Mr06506",
              "text": "I'd say 30-50 is very low, but I agree 150k is incredibly unrealistic. It's more than a couple of companies paying that money, but that is absolutely top dollar for the best, most senior candidates.",
              "score": 3,
              "created_utc": "2026-02-14 21:37:50",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5f0oha",
                  "author": "Frogad",
                  "text": "What would you say is a good starting range for UK, I guess I'm seeing stuff like 38k but quite a few lower, but also I am not with 2-3 year experience.",
                  "score": 1,
                  "created_utc": "2026-02-14 22:46:51",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o6259uy",
              "author": "One-Super-For-All",
              "text": "Places like deliveroo pay 80k gbp plus for entry level\n\n\n30k is a joke and I've never seen a salary that low",
              "score": 1,
              "created_utc": "2026-02-18 14:35:38",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6266rl",
                  "author": "Frogad",
                  "text": "Oh, I've literally not seen a single job advertised for 80k ever and I'd have assumed my uni job posting board would be fairly decent. From googling, might be out of date but im struggling to see evidence of these entry level 80k DS jobs at Deliveroo",
                  "score": 1,
                  "created_utc": "2026-02-18 14:40:15",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o5eoccm",
              "author": "starktonny11",
              "text": "Of  course i dint expect 150k but was wondering if there is any chanve of 60-90k pounds",
              "score": 0,
              "created_utc": "2026-02-14 21:37:49",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5etbbm",
                  "author": "Lost_Llama",
                  "text": "after 3 years you could aim for 50-70k roles. 80-120k at around 6/7 years. This is in London. Speciality will also play a factor",
                  "score": 5,
                  "created_utc": "2026-02-14 22:05:00",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o5etn44",
                  "author": "WallyMetropolis",
                  "text": "Consider also the much higher income taxes you'll pay.",
                  "score": 2,
                  "created_utc": "2026-02-14 22:06:51",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5f61cm",
          "author": "Illustrious-Pound266",
          "text": "Canada is actually pretty decent salary wise when compared with the rest of the non-US world. Canadians love to complain about low salaries but that's because they are only comparing them to US salaries.",
          "score": 9,
          "created_utc": "2026-02-14 23:18:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5f8emv",
              "author": "neuro-psych-amateur",
              "text": "We have really high housing costs to average income ratio. Definitely not in all countries people spend such a large proportion of disposable income on housing costs.",
              "score": 7,
              "created_utc": "2026-02-14 23:33:20",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5ke1om",
                  "author": "Specialist-Gur-601",
                  "text": "European who moved to Canada (Toronto core). While average housing cost might seem higher in the major Canadian cities, what you have to understand is that Canadians have much higher standards of living than European.\n\nIn Europe, it is very common to live in a 300 sqft studio when you are living alone, in Canada people consider this as precarious living. And let's not forget about the amenities, gym, swiming pool, sauna, theater ? That's very common in canadian condos, that's unheard of in Europe.\n\nI (6 YoE data scientist) used to make top 10% DS salary in Paris (85k€), I now make barely top 50% DS salary in Toronto (140k CAD), but I save so much more here in Toronto than in Paris. Taxes on wages and investment are lower.\n\nSeriously, for relatively **high paying job**, Canada is far better than Europe. Of course if you make minimum wage, it's better to be in Western Europe than Canada.\n\nAlso, Canadians love house ownership. Every late-20, early-30 are all about that. Those who are owner have bragging rights, the others complain about not being able to afford a family house on a single salary before even reaching 30 years old. They see renting as a shameful thing to pay for.",
                  "score": 4,
                  "created_utc": "2026-02-15 20:20:12",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o5f8ysl",
                  "author": "Illustrious-Pound266",
                  "text": "In most developed countries with decent tech scenes, the cost of living is high. Dublin, Amsterdam, London, Sydney, Munich, etc are all notorious for not only housing costs, but housing availability. ",
                  "score": 1,
                  "created_utc": "2026-02-14 23:36:49",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5epou2",
          "author": "fractorial",
          "text": "You can find increasingly more early level roles in Canada for American companies. These pay pretty well but are quite competitive (170-250 TC in CAD).",
          "score": 6,
          "created_utc": "2026-02-14 21:45:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5tpa8d",
              "author": "_hairyberry_",
              "text": "You mean us-based companies hiring Canadians remote? Do you have some examples?",
              "score": 1,
              "created_utc": "2026-02-17 06:40:19",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5tsl65",
                  "author": "fractorial",
                  "text": "Shopify\n\n\\* https://www.shopify.com/careers/product-data-scientists\\_e09145fa-617d-4746-8245-9481c9b40512?\n\nStripe\n\n\\* [https://stripe.com/jobs/listing/data-scientist/7357460](https://stripe.com/jobs/listing/data-scientist/7357460)\n\nLyft\n\n\\* [https://app.careerpuck.com/job-board/lyft/job/8404974002?gh\\_jid=8404974002](https://app.careerpuck.com/job-board/lyft/job/8404974002?gh_jid=8404974002)\n\n\\* [https://app.careerpuck.com/job-board/lyft/job/8053601002?gh\\_jid=8053601002](https://app.careerpuck.com/job-board/lyft/job/8053601002?gh_jid=8053601002)\n\nDoordash\n\n\\* [https://careersatdoordash.com/jobs/data-scientist-international/6827862/](https://careersatdoordash.com/jobs/data-scientist-international/6827862/)\n\nInstacart\n\n\\* [https://instacart.careers/job/?id=4949335](https://instacart.careers/job/?id=4949335)\n\nEvenUp\n\n\\* [https://jobs.ashbyhq.com/evenup/c179354a-f8e4-4e51-ba25-82afea134500](https://jobs.ashbyhq.com/evenup/c179354a-f8e4-4e51-ba25-82afea134500)\n\nFaire\n\n\\* [https://job-boards.greenhouse.io/faire/jobs/7953219002?gh\\_jid=7953219002](https://job-boards.greenhouse.io/faire/jobs/7953219002?gh_jid=7953219002)\n\n\n\nThese were a few companies off the top of my head that I'm aware of hire specifically in toronto for early/early-mid roles. There's probably many more than this and it doesn't even get into any FAANGs that may have roles in Canada as well. All the postings above show comp range, but remember that they are only legally obligated to show the base salary component, and seldom show the actual top-end of the band. Equity is never shown in these ranges, and will be somewhere between 25% - 100%+ of the base, with lower levels skewing to a larger base vs equity split. ",
                  "score": 1,
                  "created_utc": "2026-02-17 07:09:23",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5f7p9b",
          "author": "neuro-psych-amateur",
          "text": "Canada - around $75K-$90K CAD. Look at simplyhired positions in Canada, a lot of them have salary range listed",
          "score": 4,
          "created_utc": "2026-02-14 23:28:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5exqwh",
          "author": "PM_YOUR_ECON_HOMEWRK",
          "text": "At my small-mid size tech company, we pay junior US analysts around $120-130k, and European analysts around €50-55k for comparable roles",
          "score": 1,
          "created_utc": "2026-02-14 22:30:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5favyq",
          "author": "joshuaneeraj13",
          "text": "I’d imagine Singapore and the Persian Gulf countries pay extremely well.",
          "score": 1,
          "created_utc": "2026-02-14 23:48:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5suhe1",
          "author": "purposefulCA",
          "text": "Canada 70 to 90k CAD. 2 to 3 yoe",
          "score": 1,
          "created_utc": "2026-02-17 02:57:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5u54xf",
          "author": "Roo_Buchanan",
          "text": "The company I work for pays junior DS consultants £40.5k +10% bonus atm",
          "score": 1,
          "created_utc": "2026-02-17 09:07:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5lcah0",
          "author": "giridharaddagalla",
          "text": "Hey there, great question! Moving for a Product/Market DS role is exciting. Honestly, salaries outside the US for early level roles are gonna vary a lot by country and city, but for Canada, UK, and Germany, you're probably looking at a range that converts roughly to $70k $110k USD for 2 3 years of experience, though top tier companies might push a bit higher. Definitely worth checking local job boards for more precise figures; sometimes, keeping track of application statuses can get a bit messy with different systems, so having a centralized dashboard is super handy. Good luck with the move!",
          "score": 0,
          "created_utc": "2026-02-15 23:21:15",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}