{
  "metadata": {
    "last_updated": "2026-02-26 09:09:57",
    "time_filter": "week",
    "subreddit": "datascience",
    "total_items": 13,
    "total_comments": 178,
    "file_size_bytes": 197952
  },
  "items": [
    {
      "id": "1rahca8",
      "title": "What should I tell the students about job opportunities?",
      "subreddit": "datascience",
      "url": "https://www.reddit.com/r/datascience/comments/1rahca8/what_should_i_tell_the_students_about_job/",
      "author": "guna1o0",
      "created_utc": "2026-02-21 04:12:53",
      "score": 179,
      "num_comments": 82,
      "upvote_ratio": 0.91,
      "text": "I am a data scientist with almost two years of experience. I mainly work on SQL, Pandas, Power BI dashboards, credit risk modeling, MLOps, and a small part of GenAI architecture using Redis workers.\n\nI have been invited to my college, where I completed my Masters in Data Science, to give a guest lecture in the first week of March. I chose the topic “end to end ML building” where I plan to talk about:\n\n* Data validation using pandera\n* Feature store\n* Model training\n* Model serving using fastapi\n* Automation using airflow\n* Model monitoring\n* Containerization using docker\n\nI am comfortable teaching this because I use many of these tools at work and in personal projects.\n\nHowever, I am worried about one thing. Students may ask me about AI replacing jobs. They will graduate next year and they might ask:\n\n* Will there still be jobs?\n* Will our skills still be valuable?\n* Is AI removing entry level roles?\n\nEven I sometimes feel uncertain. Tools like claude and other AI systems are becoming very powerful. I am trying to learn advanced skills like production ML pipelines to stay relevant. hoping these harder skills will keep me relevant longer.\n\nBut I am not sure how to confidently answer students when they ask about job security. i don't want to scare them.\n\nI need guidance on what I should tell them about the future of AI and jobs.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/datascience/comments/1rahca8/what_should_i_tell_the_students_about_job/",
      "domain": "self.datascience",
      "is_self": true,
      "comments": [
        {
          "id": "o6jtphe",
          "author": "SwitchOrganic",
          "text": "Personally, I tell them what I think and don't sugar coat it. I don't see any reason to lie or sell a fake dream. So I'd say just do that.\n\nIf they're genuinely as good as they think they are and willing to put in the time and work, they have a decent shot at making it eventually.",
          "score": 212,
          "created_utc": "2026-02-21 04:30:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6k1klm",
              "author": "guna1o0",
              "text": "Yes, I too agree. A moving man will find his luck at some point.",
              "score": 43,
              "created_utc": "2026-02-21 05:30:50",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6luf6n",
                  "author": "CapelDeLitro",
                  "text": "Maybe sugar coat it a bit, try to tell them implicitly where things may go with AI, but they are already stressed having invested money for the career and having doubts about what the future will bring for them in the field, dont think its a good idea to be that straightforward.",
                  "score": 12,
                  "created_utc": "2026-02-21 14:41:07",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6k2en7",
          "author": "AccordingWeight6019",
          "text": "focus on role evolution, not replacement. AI is automating repetitive tasks, but people who can build, validate, and monitor real ML systems are still in demand. mastering end to end pipelines and understanding production behavior will keep skills relevant even as tools change.",
          "score": 74,
          "created_utc": "2026-02-21 05:37:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6p6buj",
              "author": "Euphoric_Yogurt_908",
              "text": "openAI and Anthropic are still hiring developers, even though they claim Claude code and the codex were written by themselves. For junior data scientists , I would encourage them to learn the basic statistics, machine learning, then really embrace to learn how to use AI to do the job right for them. There are soft skills, how  business runs, and also how to have a reliable production system and pipeline, these still have to be learned by experience, at least in the near future.",
              "score": 8,
              "created_utc": "2026-02-22 01:25:16",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6jyvww",
          "author": "RobertWF_47",
          "text": "Tell them to take statistics classes if they haven't already. Causal inference models can't be automated very well by AI since they require hands on experience to build and knowledge of how cause & effect works. Job security!\n\nPlus when estimating a causal effect it's difficult to know how close you are to the true value of the population parameter, unlike predictive models which are optimized on loss functions.",
          "score": 82,
          "created_utc": "2026-02-21 05:09:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6ke8q7",
              "author": "RecognitionSignal425",
              "text": "but also causal inference can't be easily understood by a lot of people, and therefore hard to sell. ",
              "score": 43,
              "created_utc": "2026-02-21 07:22:36",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6kv3d4",
                  "author": "Throwawayeconboi",
                  "text": "Yep, took a Causal Inference course as part of my Economics B.A. and I did not understand what rhe hell was going on 😭 albeit this was during COVID and on Zoom",
                  "score": 13,
                  "created_utc": "2026-02-21 10:08:37",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o6k2kp7",
              "author": "guna1o0",
              "text": "The MSc program has statistics classes. But I doubt that the class covers the causal inference models well. And thanks for your points. I'll drop your points there.",
              "score": 8,
              "created_utc": "2026-02-21 05:39:01",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6kefq4",
                  "author": "RecognitionSignal425",
                  "text": "tell them communication matter more than what they think ",
                  "score": 12,
                  "created_utc": "2026-02-21 07:24:28",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6jwaf5",
          "author": "pandasgorawr",
          "text": "You tell them the market is cooked. I just put up a job posting and got 1600 applications in a week.",
          "score": 52,
          "created_utc": "2026-02-21 04:50:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6k0gzu",
              "author": "Kind-Armadillo-2340",
              "text": "How many of those are even in the right country?",
              "score": 18,
              "created_utc": "2026-02-21 05:22:01",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6k49tq",
                  "author": "pandasgorawr",
                  "text": "Dunno, but a lot of them were lying about not needing visa sponsorship, I can tell you that.",
                  "score": 48,
                  "created_utc": "2026-02-21 05:53:03",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o6l34ef",
              "author": "Zohan4K",
              "text": "This plus recruiters are total ass at filtering out on basic requirements, let alone identifying a good DS. Greatest category of paycheck stealers I've ever seen in the corporate world.",
              "score": 11,
              "created_utc": "2026-02-21 11:25:54",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6jtcga",
          "author": "guna1o0",
          "text": "Should I tell them to learn more advanced skills such as building an end-to-end system? Don't focus too much on redundant skills such as writing simple ETL or building models on notebooks?",
          "score": 12,
          "created_utc": "2026-02-21 04:28:10",
          "is_submitter": true,
          "replies": [
            {
              "id": "o6jtpkz",
              "author": "BigButter00",
              "text": "Can you write out / link an outline of what you consider to be an end-to-end system? I am curious.",
              "score": 5,
              "created_utc": "2026-02-21 04:30:52",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6k0mtt",
                  "author": "guna1o0",
                  "text": "This is what comes to my mind when I think about the end to end system.\n\nBusiness understanding, data ingestion, features engineering, model development, deployment, monitoring, retraining.\n\nAll automated, versioned, and observable.",
                  "score": 11,
                  "created_utc": "2026-02-21 05:23:18",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6kfnbb",
          "author": "Ghost-Rider_117",
          "text": "honestly the best thing you can tell them is to be the person who \\*uses\\* AI well, not the one who fears it. the data folks who are thriving rn are the ones combining domain knowledge + coding + AI tools — that combo is really hard to replace. also remind them that understanding \\*why\\* a model does what it does still matters a ton, especially in regulated industries like finance. the job market is tough but it's not hopeless, especially for people who keep building.",
          "score": 12,
          "created_utc": "2026-02-21 07:36:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6jvfu1",
          "author": "Viveknanduri",
          "text": "Personal opinion - building production systems can be difficult but only from an engineering standpoint for most Data Scientists. I feel LLMs are more tuned to generating code and in the future probably established design patterns/systems design. There are some pretty hard statistical and algorithmic theoretical concepts that are applied commercially in advanced DS teams that can be hard for LLMs to replicate (currently). I’m not convinced that learning one skill instead of the other is that useful in the gen AI context.",
          "score": 15,
          "created_utc": "2026-02-21 04:43:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6k3e2x",
              "author": "guna1o0",
              "text": "Very solid words. But may I know what to tell them?\n\nShall I tell them to grind hard statistical concepts?\n\nHow willing are advanced DS teams to hire a fresher who isn't from top colleges?",
              "score": 2,
              "created_utc": "2026-02-21 05:45:40",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6klosz",
                  "author": "Viveknanduri",
                  "text": "Honestly I can’t proclaim any confident predictions about the future and I’m similarly experienced to you and share the same concerns as you do. My belief, however, is that those who are extremely specialised will thrive with the onset of AI and also those who are extremely capable of having a strong all round skillset will be able to succeed (as they can be effective project + product managers). There’ll be less room for the halfway houses I reckon and therefore my general advice would be to try and specialise.",
                  "score": 2,
                  "created_utc": "2026-02-21 08:35:14",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6kfbjn",
          "author": "HookEmRunners",
          "text": "Tell them that there are DS jobs outside of Big Tech. To this day there are many small and even medium-sized, non-technical employers who are amazed when you mention that you can write Python, do SQL queries, and know what ToolPak is. \n\nMany of these companies are far from the cutting edge of high technology and I guarantee you that they will have data scientists around doing relatively basic to intermediate things for years to come.\n\nIt may not be FAANG but data scientists and analysts with a strong combination of soft and technical skills are often hired by banks, governments, and smaller tech or telecom companies.",
          "score": 13,
          "created_utc": "2026-02-21 07:32:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6pbx6j",
              "author": "Tree_Doggg",
              "text": "Biotech companies, large and small, always seem to be hiring for DS roles as well. \n\nLots of interesting problems to solve there.",
              "score": 7,
              "created_utc": "2026-02-22 02:01:24",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6jwn2i",
          "author": "StarThinker2025",
          "text": "\nThe market is not easy now\nBut people who can build end-to-end and deploy to production are still rare.\nAI is a tool, not a replacement for someone who understands data + business + system together",
          "score": 5,
          "created_utc": "2026-02-21 04:52:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6k86gz",
          "author": "AnUncookedCabbage",
          "text": "In my opinion, junior people tend to focus on tools over the softer parts ofnthe job. Of course you need some tool ability tonget going but tools become less important once you are in the game. For example understanding the life cycle of a data science project/product. Talking to stakeholders and experts, designing the data flow ina a way that makes operational sense, coming up with benchmarks, improvement criteria that need to be met, and handling live monitoring and validation after go live. AI seems pretty bad at this at the moment, and likely for a while, because this work is not a closed system and is all very case specific. \n\nBeyond that AI is just another tool to be used when appropriate. You wouldnt be scared of scikit learn taking your job, but at one point it would have replaced people who wrote classical ml algos by hand. A bit of an exaggerated example but you get the point.",
          "score": 10,
          "created_utc": "2026-02-21 06:27:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6lkbrp",
              "author": "serpent_mind",
              "text": "This is the answer. AI will automate the technical work and the sweat. It wont replace the ability to sell solutions to human stakeholders, garner adoption, or do independent research. I only hire analysts who show: adaptability, creative vision, salesmanship, entrepreneurial and innovative attitude. More than before, you have to be DS as a product. The value you bring to an org is being able to bring it to your market in valuable ways. This has a lot less to do with hard skills.",
              "score": 5,
              "created_utc": "2026-02-21 13:39:58",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6mmptq",
                  "author": "Statement_Next",
                  "text": "Don’t help the corporation, be the corporation.",
                  "score": 1,
                  "created_utc": "2026-02-21 17:06:35",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6kdi23",
          "author": "dkhasit",
          "text": "Do you use Deep learning, GNN , transformers?",
          "score": 3,
          "created_utc": "2026-02-21 07:15:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6keh3y",
              "author": "guna1o0",
              "text": "No, I work in the finance domain. And I don't see solid use cases to use dl, GNN, transformers.\n\nThe majority of the problems here are being solved by classical ml. My team strongly believes a well refined classical ml is better than fancy deep learning algorithms. \n\nBut I'm planning to switch, so it would be better if I revised pytorch and deep learning.",
              "score": 6,
              "created_utc": "2026-02-21 07:24:51",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6kksd6",
                  "author": "dkhasit",
                  "text": "And what about you? Given a chance to experiment, where or how would you experiment with deep learning in your current role of Credit Risk like you mentioned \n\nAlso, Don't revise, build something and try to productionise as well if you can.",
                  "score": 2,
                  "created_utc": "2026-02-21 08:26:14",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6k3p0z",
          "author": "Single_Vacation427",
          "text": "I don't think AI is taking away jobs. I think it's more of an excuse being used because it looks cool for investors; in the meantime, hiring in India has been going up so many roles were replaced. \n\nI think your presentation might give them an incorrect understand of all of the roles there are. I think a lot of the work you might present is moving to MLE which, not only is not a first job, it requires SWE skills. \n\nI disagree with telling them to focus on \"advanced skills such as building an end-to-end system\". I think that: \n\n(1) There are many types of roles (DA, DS, MLE), areas out there (Product, Growth, Go to Market), industries (tech, finance, healthcare, etc.) They need to find what's the best fit for them. \n\n(2) Many of the \"advanced skills\" roles are being taken by SWE. Also, I've been interviewing a lot and companies that ask about anything for deploying models, etc., are start-ups. They also have take homes and if you move beyond that, like bigger companies, they call the role MLE. These roles are very difficult to get and they require a lot of prep for system design interviews. I wouldn't recommend this for people who are finishing a masters in DS unless they come from SWE. \n\nThat said, yes, having skills helps get you to the door, but even in full stack DS interviews they are going to ask you fro basic python/SQL coding interview, product sense, etc. in interviews. So spending hours and hours on a project and investing in the skills you mentioned is kind of a waste. They should be preparing for interviews first and if they have no business or product sense, they are not going to pass any interview screening.\n\nMy advice would (1), to find what they are a good fit for and have a coherent resume. Not sell themselves as someone who can do everything and anything. \n\n",
          "score": 10,
          "created_utc": "2026-02-21 05:48:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6l2x8u",
              "author": "Zohan4K",
              "text": "Hired 3 data scientists in the last 1.5y in EU-remote setting, manually reviewed about 2k resumes. \n\nI won't hire entry level for 2 reasons:  \n1. Little to none easy/boring/time consuming tasks left to delegate to them, LLMs can do 95% of the work of a junior DS.  \n2. I don't want people who don't have pre-LLM coding experience. Interviewed a bunch and they had no clue how to code basic shit like a for loop.\n\nI'm sorry but that's the reality of the job market.",
              "score": -2,
              "created_utc": "2026-02-21 11:24:00",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6kdcjw",
          "author": "Den_er_da_hvid",
          "text": "My take right now (may be different in a year).\n\nAI is a tool that speed up coding significantly. It gets smarter at creating code because it also understands math, statistics/ML better, but it is still a human that asks for a task that needs to be done and it still a human that will use the output. Legally only a human can be responsible for the output at the moment.\n\nI still see plenty of jobs for people who understands and can descibe what they want. Humans still needs to give context and have a vision of the output.\n\nSo less focus on coding but still relevant to have the right background/experiance.\n\nMy background is in Chemical engineering and now I work with a mix of data analysis/science and change management. That have really only been possible the last two years with AI where I moved more of my automation and analysis over to python. I knew a bit of python but the in reality it is 99% ai generated, and I focus on what I want and what the output does.",
          "score": 3,
          "created_utc": "2026-02-21 07:14:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6l1nzu",
          "author": "CanYouPleaseChill",
          "text": "The real concern is that the field is saturated. Seemingly every STEM graduate wants to work in data science, whether or not they have the relevant skills. Most job descriptions now require a Master’s degree at minimum. Data science was a fad for many companies which have failed to see much value. Hiring has slowed considerably.",
          "score": 3,
          "created_utc": "2026-02-21 11:12:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6l29nj",
          "author": "dang3r_N00dle",
          "text": "What I would say is that jobs change in what they focus on over the years and as the market develops. Education puts you on rails, but the market simply sends signals to solutions you give it.\n\nThe question is asking, is DS still a solution that's valued? The answer was always \"yes\" because we live in an online world and undertstanding data is the only way to navigate it. Data are difficult to interpret and so you will need people who can do that.\n\n10 years ago, if you could fit a model then that was enough to enter the field, that's still valued, but there are other skills like being able to select metrics, diagnose dashboard changes, set up experiments, influence roadmaps with recommendations over what to build next and so on.\n\nThere's a bunch of research that says that AI is having an impact, but there are other economic factors at play as well. It's never easy to start your career and it's definitely more challenging than ever but there's also more information and strategy to do so than ever as well.\n\nYes, it's worth being anxious about, but the solution to anxiety is being able to create a strategy strong enough to get you through the challenges ahead. If you're in a position where you're asking someone else \"will it be okay\" then the problem is that you're not thinking for yourself yet, which is what's most important in the first place.",
          "score": 3,
          "created_utc": "2026-02-21 11:17:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6k8sth",
          "author": "mogtheclog",
          "text": "Tell them about the importance of soft skills, how to relay that in an interview, and what experiences helped you build yours.",
          "score": 2,
          "created_utc": "2026-02-21 06:32:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6wmeyk",
              "author": "chronicallysigma",
              "text": "But would soft skills make up for a lack of technical knowledge?",
              "score": 1,
              "created_utc": "2026-02-23 05:36:34",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6ktqmj",
          "author": "XhongXhina",
          "text": "Hey man, do you mind me asking what country you are based in",
          "score": 2,
          "created_utc": "2026-02-21 09:55:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6mqbxj",
              "author": "guna1o0",
              "text": "India",
              "score": 1,
              "created_utc": "2026-02-21 17:24:59",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6kx763",
          "author": "B_lintu",
          "text": "AI is not replacing data scientists. It's changing what skills are required from them.",
          "score": 2,
          "created_utc": "2026-02-21 10:29:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6lw7zt",
          "author": "Lady_Data_Scientist",
          "text": "I've given talks to students at my former university, and they gobble up anything \"real world.\" Things like examples of actual projects I've done on the job, examples of all of the job titles in this field, advice for the job market/searching/interviewing. Usually the Q&A part will be a lot of questions about the job market.\n\nI'm always honest with them, but I don't want to be all doom and gloom. I let them know that the job market is very competitive, but I pair that with advice - encourage them to spend time networking, to go to local industry events, do something other than go to class (lead a student group, do research with your prof, etc). They love my slide with all of the different job titles and search terms because all they really know is \"data scientist\" or \"data analyst\".\n\nI also stress that this field is always evolving. It's changed in the 10 years since I started working in data, it's changed in the past 3 years since the job market turned around, and it's changed in the past 2 years since AI started booming. And it's going to keep changing in ways that I probably won't expect. New jobs will pop up - in the past few years, we've gotten Analytics Engineer, DevOps, and Data Science is more specialized into inference/experimentation, ML research, ML Eng, ML Ops, etc. Heck Data Science didn't even exist when I started my career 20+ years ago. So who knows what jobs will become available.\n\nSo you have to expect for any career that things are going to change and you'll have to keep adapting. Analytics/DS is my second career, I spent the first 10 years in marketing, and even that went through a lot of changes - the people who were adaptable survived, and the people who wanted to keep \"doing things the way I've always done them\" didn't. This is an important lesson for everyone starting their career, no matter what they are doing.",
          "score": 2,
          "created_utc": "2026-02-21 14:51:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6rcdx3",
          "author": "patternpeeker",
          "text": "i would tell them fundamentals outlast tools. some entry level tasks may shrink, but messy data, unclear objectives, and production reliability are still hard problems. most real work is defining the right target, cleaning inputs, and handling edge cases. skills around systems, data quality, and monitoring will stay valuable even as models get stronger.",
          "score": 2,
          "created_utc": "2026-02-22 12:06:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6xhd1o",
          "author": "iMDu093",
          "text": "This post was clearly written by AI",
          "score": 2,
          "created_utc": "2026-02-23 10:25:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6xhutd",
              "author": "guna1o0",
              "text": "Hey, I'm using a Pixel 9 phone, and it comes with an AI-assisted writing tool. I usually type the first message, then just click the writing tool toggle. It takes care of the rest, such as formatting, punctuations, and grammar.",
              "score": 1,
              "created_utc": "2026-02-23 10:29:51",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o71ywaw",
                  "author": "iMDu093",
                  "text": "I was totally joking but thats is hilarious. It doesnt come across as AI slop at all and theres nothing wrong with usisng AI assisted communication. In the spirit of that, I asked two different LLMs the question in your post:\n\nClaude Sonnet 4.6:\n\n>This is a genuinely hard question, and the fact that you feel uncertain is actually a sign you're thinking about it honestly rather than just reciting talking points. Here's how I'd frame it.\n\n>**First, acknowledge the uncertainty openly.** Students will respect you more for saying \"I don't have a crystal ball\" than for being falsely reassuring. The honest answer is that nobody knows exactly how this plays out. But uncertainty isn't the same as doom.\n\n>**What you can say with confidence:**\n\n>The skills you're teaching them — data validation, feature stores, model serving, monitoring, pipelines — are precisely the skills that AI tools *cannot* replace easily right now, and likely won't for a while. Here's why: AI is very good at generating code snippets, answering questions, drafting dashboards. It is not good at understanding *why* a model is drifting in production, *why* your feature store is returning stale values, or *why* a credit risk model is behaving unexpectedly in a new market segment. Those require judgment built from real experience. That's what they're learning to develop.\n\n>**On entry-level roles specifically** — yes, some tasks that used to define entry-level jobs are being automated. This is real and worth acknowledging. But the historical pattern with technology is that it tends to shift what entry-level work *looks like* rather than eliminate the need for junior people entirely. Junior engineers in the 2000s spent a lot of time on tasks that are now trivial. Instead, they were pushed toward higher-leverage work earlier. The same shift is happening now. Entry-level data scientists will likely spend less time on boilerplate EDA and more time learning to evaluate model behavior, write good evals, and manage ML systems in production.\n\n>**The reframe you can offer them** — and that genuinely helped me think about this — is that AI is raising the floor of what a capable person can produce, but it's also raising the bar for what's expected. Someone who uses AI tools effectively and understands production ML systems is more valuable than someone who can only write clean notebooks. The students in that room, graduating with exposure to MLOps concepts, are already positioning themselves better than most.\n\n>**Your own story is the most powerful thing you can share.** You're two years in, you felt the uncertainty too, and your response was to go deeper into production skills that require real judgment. That's the right instinct, and you can tell them that directly. Not as a guarantee, but as a strategy: go toward the harder, more contextual, more production-oriented skills because those are the ones that require the kind of situated understanding that's harder to automate.\n\n>**One practical thing to tell them:** Learn to use AI tools fluently *as part of* building these pipelines. A data scientist who can use Claude or Copilot to accelerate their work while still understanding what's happening under the hood is significantly more productive than one who can't. That combination — tool fluency plus genuine systems understanding — is what you want to be.\n\n>The honest summary you could close with: *\"I can't promise you job security. Nobody can. What I can tell you is that the people I see thriving are the ones who go deeper on systems-level thinking and learn to work with AI rather than feel threatened by it. That's what I'm trying to do, and it's part of why I'm teaching you these topics today.\"*\n\n>That's more credible than false confidence, and it's also true.\n\nand ChatGPT (free version)\n\nFirst of all — congratulations. Getting invited back within \\~2 years of graduating means you’re already doing something right.\n\nNow let’s talk about the *real* concern.\n\nYou’re not worried about the technical content.  \nYou’re worried about standing in front of students and being asked:\n\n* “Will there still be jobs?”\n* “Is AI replacing us?”\n* “Are entry-level roles disappearing?”\n* “Are we learning things that will become irrelevant?”\n\nThat’s not a technical question.  \nThat’s a responsibility question.\n\nAnd the good news? You can answer it honestly **without being overly optimistic or pessimistic**.\n\n# 1️⃣ First — Separate Hype from Reality\n\nTools like Claude, GPT, Copilot, etc. feel disruptive.  \nBut remember something important:\n\nEvery major automation wave feels like this.\n\n* Spreadsheets were supposed to kill accountants.\n* AutoML was supposed to kill data scientists.\n* Cloud was supposed to kill infra jobs.\n* No-code tools were supposed to kill developers.\n\nInstead:  \nJobs changed. They didn’t vanish.\n\nThe role of a data professional is shifting from:\n\n>\n\nto:\n\n>\n\nThat is much harder to automate.\n\n# 2️⃣ Here’s the Honest Answer You Can Give\n\nIf a student asks: *“Will there still be jobs?”*\n\nYou can say something like:\n\n>\n\nThis is aligned with what you're already doing:\n\n* Data validation (pandera)\n* Feature stores\n* MLOps\n* Monitoring\n* Airflow pipelines\n* Docker\n\nThose are *not* easily automated skills.\n\nAI can help write a function.\n\nIt cannot:\n\n* Diagnose bad data distribution shifts.\n* Design a monitoring strategy.\n* Align models with business risk tolerance.\n* Own a failed deployment in production.\n* Communicate with stakeholders.\n\nThat’s the part that stays human.\n\n# 3️⃣ Are Entry Level Roles Being Affected?\n\nThis is where nuance matters.\n\nSome *traditional* entry-level tasks are shrinking:\n\n* Basic dashboard building\n* Simple SQL extraction\n* Writing boilerplate ML code\n* Minor ETL scripts\n\nYes — AI makes these faster.\n\nBut here's the shift:\n\nEntry-level expectations are rising.\n\nEarlier:\n\n>\n\nNow:\n\n>\n\nThe floor is rising.  \nThe ceiling is rising even faster.\n\nAnd that’s exactly why your lecture topic is powerful.\n\n# 4️⃣ The Frame You Should Use During the Lecture\n\nInstead of defending against AI fear, anchor the conversation like this:\n\n# “AI is automating tasks, not ownership.”\n\nThere’s a big difference between:\n\n* Executing instructions and\n* Owning systems\n\nCompanies don’t hire people to write `fit()`.\n\nThey hire people to:\n\n* Reduce credit risk\n* Improve fraud detection\n* Increase revenue\n* Reduce downtime\n* Manage compliance\n\nAI does not take accountability.\n\nHumans do.\n\nAnd accountability creates jobs.\n\n# 5️⃣ You Can Share Your Own Strategy (Without Fear)\n\nYou don’t need to act invincible.\n\nYou can say:\n\n>\n\nThat makes you relatable, not weak.\n\nStudents trust speakers who admit uncertainty but show strategy.\n\n# 6️⃣ The Most Important Point You Can Tell Them\n\nThe future will reward:\n\n# 1. Systems Thinkers\n\nNot just model builders — pipeline architects.\n\n# 2. Business Translators\n\nPeople who connect ML to ROI and risk.\n\n# 3. Engineers Who Can Ship\n\nProduction > notebooks.\n\n# 4. People Who Use AI as a Multiplier\n\nNot compete against it.\n\n# 7️⃣ A Strong Closing Line You Can Use\n\nIf you want something powerful to end with:\n\n>\n\nOr:\n\n>\n\n# 8️⃣ Reality Check (For You)\n\nYour anxiety is actually a good sign.\n\nIt means:\n\n* You’re thinking long term.\n* You’re not complacent.\n* You’re already upgrading your skillset.\n\nYou moved beyond:  \nSQL + Dashboards  \nto  \nEnd-to-End ML + Deployment + Monitoring.\n\nThat’s not replaceable-level work.\n\nYou’re not trying to survive the AI wave.  \nYou’re learning to surf it.\n\n\n\n  \nFunny enough there is some wisdom in both those responses. My personal view is kinda a hot take but even the best agentic models really aren't that great at writing code.",
                  "score": 0,
                  "created_utc": "2026-02-24 00:56:11",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6kmfwx",
          "author": "adamantium_wolfie",
          "text": "Instead of being afraid of AI taking away jobs, tell them to adapt and learn the AI skills. Not just about using the AI tools but the background working of them. If they are a mix of students from different degrees then you will have to put your answer in a general way. But if they are only DS students, then you can guide them much more about the Deep Learning side, what kind of interview questions are being asked in current market and an easy roadmap for them to which they can refer to. \n\nYou can guide them about good and bad uses of AI too. Give them example(s) where AI was used wrongly. You can give the example of Deloitte where they were fined from the government to use fabricated numbers using AI. Hence, which will reflect don't get too much dependent on AI.",
          "score": 1,
          "created_utc": "2026-02-21 08:42:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6kxvyp",
          "author": "Gaussianperson",
          "text": "One thing students really need to hear is how different production work is from school projects. Most companies are moving away from hiring people who just write code in notebooks. They want folks who can actually get those models into the hands of users. Tell them that mastering things like data validation and serving with fastapi is what will actually get them hired right now. It shows they understand the full lifecycle and can handle the messy parts of the job.\n\nFocus on the idea that ml is mostly an engineering problem at this point. You could talk about how feature stores help keep data consistent between training and real time inference. That is a huge pain point in the industry that students rarely see in class. Explaining the architectural side of things will give them a massive leg up when they start interviewing for junior roles.\n\nI actually write about these engineering and architectural challenges in my newsletter at machinelearningatscale.substack.com. It covers things like mlops and system design in detail, so it might give you some solid examples to share with the class during your lecture.",
          "score": 1,
          "created_utc": "2026-02-21 10:35:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ldw2b",
          "author": "vikmaychib",
          "text": "Buil a ML model heavily data driven that computes the probability of getting a job.",
          "score": 1,
          "created_utc": "2026-02-21 12:56:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6mgdai",
          "author": "RoyalChallengers",
          "text": "Can you tell me what I should learn to get a job in data science ?",
          "score": 1,
          "created_utc": "2026-02-21 16:35:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6mrtec",
          "author": "sir_callahan",
          "text": "The trend I see is those who can prove they can use the tools at their disposal to creatively and independently solve real problems will be just fine.",
          "score": 1,
          "created_utc": "2026-02-21 17:32:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6nynh6",
          "author": "Myc0ks",
          "text": "These are just my opinion, but some of my answers to the questions.\n\n> Will there still be jobs?\n\nYes, because an important part about being a data scientist in the industry is ownership. When you pick up a model, or make a model, you are accountable for it's performance. A manager with no DS experience could ask it basic questions, but they wouldn't understand what to tell the AI to make. Coding by hand will probably happen less and less, but you should be driving your products yourself.\n\n> Will our skills still be valuable?\n\nAbsolutely. You should understand conceptually what each model does for you, is the data good enough, how to explain it, etc.. As they would understand, a neural network is built with all this information inside of it, but it can't pull the right information without being asked the right questions. There's a difference between asking an LLM \"Make me something that predicts house prices\" vs \"Design the base for a linear regression model to predict house prices given their location, num bedrooms, ... and run cross validation to optimize it's hyperparameters.\"\n\n> Is AI removing entry level roles?\n\nThis is probably more true for software engineering than data science. If you are being hired as a data scientist, you are off the bat already expected to know how to build features and make models on your own. You probably wouldn't have a bunch of pre-defined tasks handed to you. Data science jobs are more open ended, so I wouldn't say AI necessarily replaced them. Jobs replaced by AI I think are more grunt-work.",
          "score": 1,
          "created_utc": "2026-02-21 21:11:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6qeaph",
          "author": "Linearts",
          "text": "Look at epoch.ai forecasts of job automation. Check out their newsletter, Gradient Updates",
          "score": 1,
          "created_utc": "2026-02-22 06:45:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6r38ku",
          "author": "Moist_Muffin9565",
          "text": "We’re looking for a Senior Data Scientist with experience in Snowflake or Databricks, SQL & Python, and expertise in time-series modeling, anomaly detection, and platform optimization.",
          "score": 1,
          "created_utc": "2026-02-22 10:42:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6vg730",
              "author": "guna1o0",
              "text": "can you please dm me",
              "score": 1,
              "created_utc": "2026-02-23 00:59:05",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6rsef3",
          "author": "Proper-Title-5211",
          "text": "Tell them to take a communications class. Do toastmasters, improv, dale Carnegie. Translating technical work will become more important and help them stick out",
          "score": 1,
          "created_utc": "2026-02-22 13:57:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6t4n4r",
          "author": "X_Comanche_Moon",
          "text": "The truth: there are no job opportunities",
          "score": 1,
          "created_utc": "2026-02-22 17:49:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6x0yj9",
          "author": "werthobakew",
          "text": "What will you say regarding the feature store?",
          "score": 1,
          "created_utc": "2026-02-23 07:44:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6x2fid",
              "author": "guna1o0",
              "text": "Ill start from reusability. No need to recalculate the same features for different models, offline for training and online for stateful prediction. If an ml model system doesn't need any historical or lookup data to predict also known as stateless prediction. Then we don't need online store.  Redis for the low latency in online store.\n\nWhy a single sql table isn't the full solution. I Will speak about point in correctness, on demand transformation, training skew. Feature store versioning. And how to setup feast. And I used feast in my personal project. So I'll show it to them.",
              "score": 1,
              "created_utc": "2026-02-23 07:58:42",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6x2p16",
                  "author": "guna1o0",
                  "text": "I'll start preparing the detailed documentation after a few days. So I'll try to include good points in it",
                  "score": 1,
                  "created_utc": "2026-02-23 08:01:13",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6zpkzq",
          "author": "BlahTigger",
          "text": "I have a Life Sciences PhD with more than a decade of experience in cell biology and high-end microscopy. I am considering doing a Data Science Master's program after a 3 year long career break to upskill. What would be your advice for someone like me?",
          "score": 1,
          "created_utc": "2026-02-23 18:09:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o71czq7",
          "author": "dspeanut1",
          "text": "I think it's fair to say you don't know and that's true. no one knows how this landscape will change in next 3 years. in my view, the role will still exsit but will require different skills. for now, maybe still good coding skill is needed but 1-2 years later, you need system design skill rather than syntax fix due to AI code generation capability. ",
          "score": 1,
          "created_utc": "2026-02-23 22:54:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6jszzp",
          "author": "Distinct-Gas-1049",
          "text": "Man I wish AI would replace my job. I do not get this sentiment at all. LLMs suck at coding and suck at numerical understanding. Only part of data science is processing data anyway",
          "score": -6,
          "created_utc": "2026-02-21 04:25:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6jx381",
              "author": "AggravatingPudding",
              "text": "LLM doesn't suck at coding, you just suck at working with LLMs. ",
              "score": 8,
              "created_utc": "2026-02-21 04:56:00",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6k7q2a",
                  "author": "Distinct-Gas-1049",
                  "text": "Have you ever been responsible for code end to end in some large production system?",
                  "score": 3,
                  "created_utc": "2026-02-21 06:22:58",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6mm7w2",
          "author": "saketh_1138",
          "text": "Projects matter more than certificates.\n\nRecruiters don’t care much about generic course certificates. They care about:\n\n● Real-world datasets\n\n● End-to-end projects\n\n● Clear GitHub repos\n\n● Problem framing and business insight\n\n● Evidence you can clean data, not just model it\n\nA Kaggle notebook isn’t enough. A deployed project, dashboard, or case study write-up is better.",
          "score": 0,
          "created_utc": "2026-02-21 17:04:05",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rdluhe",
      "title": "what changed between my failed interviews and the one that got me an offer",
      "subreddit": "datascience",
      "url": "https://www.reddit.com/r/datascience/comments/1rdluhe/what_changed_between_my_failed_interviews_and_the/",
      "author": "warmeggnog",
      "created_utc": "2026-02-24 17:02:12",
      "score": 112,
      "num_comments": 26,
      "upvote_ratio": 0.91,
      "text": "i went through a pretty rough interview cycle last year applying to data analyst / data scientist roles (mostly around nyc). made it to final rounds a few times, but still got rejected.\n\ni finally landed an offer a few months ago, and thought i’d just share what changed and might guide others going through the same thing right now:\n\n* **stopped treating sql rounds like coding tests.** i think this mindset is hard to change if you’re used to just grinding leetcode. so you just focus on getting the correct query and stop talking when it runs. but what really matters imo is mentioning assumptions, edge cases, tradeoffs, and performance considerations (esp. for large tables).\n* **practiced structured frameworks for product questions**. these were usually the qs i didn’t perform well in, since i would panic when asked how to measure engagement or explain why retention dropped. but a simple flow like goal and user segment → 2-3 proposed metrics → trade-offs → how i’d validate, helped organize my thoughts in the moment.\n* **focused more on explaining my thinking, not impressing**. i guess this is more of a mindset thing, but in early interviews i would always try to prove i was smart. but there’s a shift when you focus more on being clear and structured and showing how you perform on a real team/with stakeholders/partners.\n\nso essentially for me the breakthrough wasn’t just to learn another tool or grind more questions. though i’m no longer interviewing for data roles, i’d love to hear other successful candidate experiences. might help those looking for tips or even just encouragement on this sub! :)",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/datascience/comments/1rdluhe/what_changed_between_my_failed_interviews_and_the/",
      "domain": "self.datascience",
      "is_self": true,
      "comments": [
        {
          "id": "o768lb0",
          "author": "prattman333",
          "text": "Probably nailed behavioral questions and storytelling around your projects the second time - interviewers care more about how you communicate insights than perfect code now. I bombed early interviews on stats trivia but got offers once I focused on explaining my notebook like a business case.",
          "score": 49,
          "created_utc": "2026-02-24 17:40:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o79r43c",
              "author": "warmeggnog",
              "text": "yep, totally agree on the business case aspect! also helps avoid getting lost in your thoughts with complex jargon/metrics, since the goal is to simplify your language and ensure even non-technical partners/stakeholders understand it.",
              "score": 5,
              "created_utc": "2026-02-25 04:25:49",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o761i0v",
          "author": "Holiday_Lie_9435",
          "text": "I’m still in the middle of applying for data roles and appreciate you sharing this. Definitely validated some of my struggles (mostly as a self-learner, LOL) like getting caught up with the Leetcode mindset with SQL and focusing too much on getting the query right, so I panic when it comes to follow-ups. Same with product questions, I’ve previously gotten tips on which frameworks/structure to use, but I’ll also try to apply your advice here.\n\nI think what’s been helping me lately get out of that more ‘technical’ mindset is practicing more realistic prompts instead. I still do SQL drills on LC and StrataScratch since they have lots of practice questions, but I also look for product prompts/case studies on sites like Interview Query since they’re more detailed and have breakdowns. Still no offer yet on my end, but posts like this really encourage me and remind me I know enough, just need to keep practicing to improve how I think and communicate.",
          "score": 16,
          "created_utc": "2026-02-24 17:08:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o79rql2",
              "author": "warmeggnog",
              "text": "the leetcode trap is very real, unfortunately. you really have to let go of that perfectionist mindset and focus more on your reasoning and articulation. for product questions, it also helps to think from a non-technical perspective to break down the problem in more manageable, simpler chunks. in my mocks there was always a prompt like, how you'd explain it to someone who doesn't know much about data analysis but needs to understand the value from your insights/recommendations. also helps to read company news and product announcements regularly to get a feel of how they structure their product decisions, which metrics to prioritize, etc!",
              "score": 3,
              "created_utc": "2026-02-25 04:30:04",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o76azbq",
          "author": "fordat1",
          "text": ">focused more on explaining my thinking, not impressing.\n\nAs someone who has been on the interviewer side \"explaining your thinking\" is the point of the exercise. If you just without a word give the 100% correct answer you arent impressing almost any interviewer except the one who ignored training.\n\nThe point of the exercises are all to understand your thinking",
          "score": 10,
          "created_utc": "2026-02-24 17:51:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7a8yjz",
              "author": "Jess_than_three",
              "text": "Meanwhile, admittedly anecdotally, I got hired some years back from an interview where I was asked \"Okay, how would you, in SQL, do X?\", and completely missing a group by clause - but I talked through my thinking as I answered, admitted \"I'm not sure I've got the exact syntax right for this, so I would probably do a quick Google search to verify that\", and showed that while I might not have the answer in 3.2 seconds off the top of my head, I could reason through a problem, AND explain my thinking.\n\nTotally agree with all of this.",
              "score": 4,
              "created_utc": "2026-02-25 06:40:32",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o7d10lf",
              "author": "warmeggnog",
              "text": "very true, i think candidates (me included, LOL) sometimes forget interviewers already know what you're talking about, so they want to know more about how you got there than just your answer by itself. as simple as it sounds, what really helps hone this skill (and instinct, i'd say) is just keep talking to myself out loud when doing my technical prep. made me more comfortable articulating my reasoning during the actual interview, and remembering to mention edge cases or any assumptions.",
              "score": 5,
              "created_utc": "2026-02-25 17:34:21",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o76n4bg",
          "author": "watson__387",
          "text": "Explain your thinking! So good to see you say that. I was sure I bombed an interview when I blanked on how to calculate a median in SQL. I talked through it and basically said \"Here's where I would use it... right after I search how to do it\". I got the job.",
          "score": 8,
          "created_utc": "2026-02-24 18:44:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7a3rva",
          "author": "Starktony11",
          "text": "You forgot to mention one of the most important thing that changed, “Luck” trust me it is the most important factor. You could do all right and if interviewer is having a bad day he will say no for a small mistake, or role might get closed, or competitor was just a unicorn for the role, or they just went with internally",
          "score": 6,
          "created_utc": "2026-02-25 05:57:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o78zxyx",
          "author": "Intelligent-Past1633",
          "text": "That's so true about the SQL rounds, it's not just about getting the right answer but showing you understand the \\*implications\\* of your query on a real system, like how a complex join could tank performance on a massive table.",
          "score": 5,
          "created_utc": "2026-02-25 01:46:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o795zu8",
          "author": "PliablePotato",
          "text": "Being on the interviewer side I think you discovered some very important lessons. \n\nYour thought process, problem solving ability, business acumen and even genuine curiosity/interest in the problem is often times more important than raw technical skill. Understanding the core competencies are of course important, but it's not what makes you stand out.\n\n9/10 times I would rather have someone that can work through and solve a complex problem by breaking it down and communicate clearly than some technical wizard who whips up a solution but can't explain their approach or how the results can be used.\n\nThe best models, analyses, metrics etc. mean nothing if they can't help inform better decision making.",
          "score": 4,
          "created_utc": "2026-02-25 02:20:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7aa2g5",
          "author": "ManufacturerWeird161",
          "text": "Completely agree on the SQL part. I started explaining my logic and mentioning potential edge cases like nulls or dupes, and it completely changed the dynamic with the interviewer.",
          "score": 3,
          "created_utc": "2026-02-25 06:50:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7dbd9c",
              "author": "HappyTrainwreck",
              "text": "can you expand more on this? \nand did you actually get the correct answer or just kind of explained how you’d get here?",
              "score": 1,
              "created_utc": "2026-02-25 18:20:39",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7c3h1r",
          "author": "AccordingWeight6019",
          "text": "This really highlights how interviews are less about having the perfect answer and more about showing how you think in real time. The shift from solving quietly to treating it like a collaborative discussion sounds small, but honestly feels like a huge mindset change. Appreciate you sharing this,  probably reassuring for a lot of people still stuck in that tough interview cycle.",
          "score": 4,
          "created_utc": "2026-02-25 14:59:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o76aijh",
          "author": "qc1324",
          "text": "Curious about your prior experience/ number of applications / networking?",
          "score": 3,
          "created_utc": "2026-02-24 17:49:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o79wkd3",
          "author": "joerangutang",
          "text": "i’m two semesters into my DS masters. It is interesting how our classes almost never focus on the code, but on the thinking, like you are describing. But our career coaches focus very much on learning the code, but also on the storytelling.",
          "score": 3,
          "created_utc": "2026-02-25 05:03:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7a82qi",
          "author": "RecognitionSignal425",
          "text": "Basically, share your voice, not to prove your voice. The moment you need to prove something, you get anxiety and lost ",
          "score": 3,
          "created_utc": "2026-02-25 06:33:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o76evs0",
          "author": "Busy_Selection5408",
          "text": "Appreciate this, it was helpful for me.",
          "score": 2,
          "created_utc": "2026-02-24 18:08:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7b6ghp",
          "author": "tongEntong",
          "text": "So consultant communication style. Insert those tech jargons and confuse(impress) the heck out of your vocabularies range. It always works man 😆",
          "score": 2,
          "created_utc": "2026-02-25 11:42:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7dbkbq",
          "author": "HappyTrainwreck",
          "text": " I’m also in nyc and a data analyst. Had many interviews and behavioral goes well for me. SQL technical ones is where I’m failing (Amazon, Meta, Roku) so if anyone has good insights on what interviewers want other than just getting to the right answer i’d love to hear more",
          "score": 2,
          "created_utc": "2026-02-25 18:21:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7gm033",
          "author": "dyingtoad",
          "text": "Are there any study resources you used for the data scientist roles?",
          "score": 2,
          "created_utc": "2026-02-26 04:41:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7gw5qw",
              "author": "warmeggnog",
              "text": "yes, i tried to use a mix to make sure i wasn't overfocusing/overoptimizing for just one aspect of the interview. for example, leetcode/hackerrank was really helpful for me for practicing common patterns that show up in oas/technical screens. then interview query for a question bank for data science roles at specific companies, covering sql, stats, ml, behavioral, etc. lastly for case study practice, i looked up youtube mock interviews for common cases like fraud detection, forecasts, and supplemented it with a book called ace the data science interview by nick singh - pretty sure it's free online!",
              "score": 1,
              "created_utc": "2026-02-26 05:56:31",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o796ffx",
          "author": "Lopsided-Charity8558",
          "text": "This is a great breakdown, especially the shift from “getting the correct answer” to “making your thinking visible”.\n\nWhat you described is actually very consistent with how data roles are evaluated now — it’s not just technical correctness, it’s whether your reasoning matches how the team would approach real problems (assumptions, tradeoffs, communication with stakeholders, etc.).\n\nIn practice, I’ve noticed it usually comes down to three signals:\n\n1) Technical correctness (can you get to a valid solution)\n\n2) Reasoning & communication (can you explain assumptions, edge cases, tradeoffs)\n\n3) Product / business thinking (are you connecting the analysis to decisions and impact)\n\nMost candidates over-optimize for #1 and under-invest in #2 and #3, which is exactly what you’re describing here.\n\nI’ve actually been building a small free tool that tries to quantify how competitive a profile is for a specific data role based on current job market expectations — some people use it just to sanity-check whether their profile aligns with what employers are looking for (no signup / no personal data).\n\nHappy to share it if anyone wants to test where they stand.",
          "score": 2,
          "created_utc": "2026-02-25 02:23:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7b13ei",
          "author": "FlashyCompetition505",
          "text": "Really helpful, Appreciate it",
          "score": 1,
          "created_utc": "2026-02-25 10:57:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ccxn1",
          "author": "Quick_Cantaloupe_989",
          "text": "I feel understanding a systematic way to debug models really stand out too ",
          "score": 1,
          "created_utc": "2026-02-25 15:44:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o76oyo4",
          "author": "shubham9397",
          "text": "thanks bro",
          "score": 1,
          "created_utc": "2026-02-24 18:52:53",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rbxt1t",
      "title": "How to not get discouraged while searching for a job?",
      "subreddit": "datascience",
      "url": "https://www.reddit.com/r/datascience/comments/1rbxt1t/how_to_not_get_discouraged_while_searching_for_a/",
      "author": "Fig_Towel_379",
      "created_utc": "2026-02-22 21:12:15",
      "score": 79,
      "num_comments": 25,
      "upvote_ratio": 0.91,
      "text": "The market has not been forgiving, especially when it comes to interviews. I am not sure if anyone else has noticed, but companies seem to expect flawless interviews and coding rounds. I have faced a few rejections over the past couple of months, and it is getting harder to trust my skills and not feel like I will be rejected in the next interview too.\n\nHow do you change your mindset to get through a time like this?",
      "is_original_content": false,
      "link_flair_text": "Career | US",
      "permalink": "https://reddit.com/r/datascience/comments/1rbxt1t/how_to_not_get_discouraged_while_searching_for_a/",
      "domain": "self.datascience",
      "is_self": true,
      "comments": [
        {
          "id": "o6udeon",
          "author": "QianLu",
          "text": "Don't let any job be your \"dream role\". When you submit the application don't imagine yourself working there.\n\nWhen you pass one interview, or two or three, you dont have the job. Stay cool as ice, always keep applying, look out for red flags, and don't get attached.",
          "score": 97,
          "created_utc": "2026-02-22 21:26:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o73fv88",
              "author": "jampk24",
              "text": "I got hammered by this. Went through all the interviews at Google, got picked by the HM for the job, the recruiter told me the offer I would get and where I’d work. Tried to stay cool, but it really felt like I was going to get it. Then I got rejected by the hiring committee and I’m still looking for a job ever since.",
              "score": 3,
              "created_utc": "2026-02-24 06:47:46",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6uct5r",
          "author": "andy_p_w",
          "text": "Here is a data science answer, if you have a 1% probability of getting an interview, if you apply to 100 positions your expected number of interviews is 1.\n\nWhile networking is important, it is partially just a numbers game. I have hired from cold applying, and have received jobs from cold applying. The probability is low, but non-zero. Try to be fast and regular with applying  (I don't suggest tweaking all that much for job to job, the incremental increase in probability is probably not high enough to justify the time, [https://crimede-coder.com/news/Post004](https://crimede-coder.com/news/Post004) ). ",
          "score": 60,
          "created_utc": "2026-02-22 21:23:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6ultpr",
              "author": "ChubbyFruit",
              "text": "I second this heavily. I applied to around \\~1300 jobs and internships before I got my current offer its always going to be a numbers game. Networking can help it did with my internships, but my full time offer was from cold applying on mass. I think people should live and breathe linkedin I know I would wake up and, before checking anything or brushing my teeth, I would scroll for jobs for like 15 minutes every morning and whenever I had free time.",
              "score": 17,
              "created_utc": "2026-02-22 22:09:23",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6w5ktt",
                  "author": "mcjon77",
                  "text": "When you say you apply to 1300 jobs I always wonder how that's possible. It really fascinates me. \n\nWere you applying to a specific type of position like a data scientist or data analyst, or were you applying to everything tech related?\n\nWere you applying to jobs all across the country? If so, what did you plan on doing if a job in another state gave you an offer? \n\nAt least from my end, and I live in a major city, there's no way I can apply for 1200 data scientist positions in any reasonable amount of time. There just aren't that many that are anywhere near a decent fit for me. This includes local and remote. \n\nI finished up a job search late last year for senior data scientist position. While the search ended relatively quickly (about 20 applications) I could definitely see a scenario where I can apply to 100 or even 200 positions if I was \"flexible\" with regard to the role matching my skills, but I don't think there's any way I can find 1200 positions unless I was willing to move.\n\nAlso, did you require some kind of sponsorship? The only reason I ask this is because so many of the folks that I see that apply to thousands of jobs if needed sponsorship of some sort.",
                  "score": 5,
                  "created_utc": "2026-02-23 03:35:02",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o6ute7l",
              "author": "Illustrious-Pound266",
              "text": "Yup, this is pretty much the norm now, especially for those in the junior/entry-level category. You have to apply to hundreds and even into the thousands to get a job. Any person wanting to go into data science should expect this when they are job-hunting.",
              "score": 3,
              "created_utc": "2026-02-22 22:49:45",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o70vyfz",
              "author": "Cocohomlogy",
              "text": "Worth noting that in your scenario the expected number of interviews is 1, but the probability of getting at least one interview is still only 63.4%",
              "score": 2,
              "created_utc": "2026-02-23 21:29:35",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6ucra0",
          "author": "ChubbyFruit",
          "text": "I'm still in school, graduating this spring, but I was able to land a full-time offer, so I'll share my perspective. In terms of mindset, honestly, for me, I just kept my head down and repeated \"banging my head into the wall\" for months. I would tell myself I know how to do everything they want, I just need to show them that I can, at the very least, come up with a solution and articulate it. Even if I can't code it in the time allotted to the interview, I can explain my thought process and make sure the interviewer understands that I am able to solve these types of problems, and after enough interviews, I can land an offer. And it took quite a few interviews, but it ended up working out.",
          "score": 14,
          "created_utc": "2026-02-22 21:23:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6um4ta",
          "author": "Wonderful_Aspect_538",
          "text": "Good luck! I think the key is to stay unattached and try to view it from a third-person perspective.\n\nI’m still looking myself but had a rough experience recently. After a couple rounds of interviews, the hiring manager asked whether I’d prefer Title A or Title B on his team. I thought I’d finally landed it. Then I got a rejection email the next day.\n\nI had to take a few days off to reset, but looking back, the mistake was getting emotionally invested before having an offer in hand. Now I treat every interview as practice until I see it in writing.",
          "score": 10,
          "created_utc": "2026-02-22 22:10:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6vrg4y",
          "author": "Bloodrazor",
          "text": "If it makes you feel any better - I'm a senior DS and I'm not even getting callbacks for roles in my niche or roles that I am overqualified for. As soon as I use an internal connection or recruiter though I pretty much get fast tracked through hiring.  The ease of job applications means that there needs to be a filtering system to reduce the number of potential human interactions to an acceptable minimum",
          "score": 9,
          "created_utc": "2026-02-23 02:07:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6vo2om",
          "author": "Bartfeels24",
          "text": "Went through this last year doing contract work between gigs and yeah, the interview bar got ridiculous after 2021, everyone wanted leetcode perfection plus system design plus your life story. Stopped caring about being flawless somewhere around rejection 15 and just started asking interviewers dumb questions about their tech stack, which somehow landed me something better than the roles that ghosted me after five rounds.",
          "score": 6,
          "created_utc": "2026-02-23 01:46:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6w8vwb",
          "author": "Bright-Awareness-459",
          "text": "Something that helped me was tracking my applications like a funnel instead of treating each one as pass/fail. When you see the rejection rate as a conversion metric it stings less because you realize the numbers are brutal for everyone right now, not just you. The market genuinely got worse and the companies running 5 round interviews for mid level roles are part of the problem. You're not broken, the process is.",
          "score": 6,
          "created_utc": "2026-02-23 03:57:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6xg7us",
          "author": "iMDu093",
          "text": "I don't get discouraged because I don't want to work for someone who doesn't want me to work for them.",
          "score": 5,
          "created_utc": "2026-02-23 10:14:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6xz3kx",
          "author": "jesusonoro",
          "text": "the market is rough right now but honestly the people landing roles are the ones who can show they built something real, not just passed a coding test. if youre between interviews, ship a small project and put it somewhere people can see it. a working prototype beats a perfect resume every time",
          "score": 6,
          "created_utc": "2026-02-23 12:51:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6uqawd",
          "author": "bharathbunny",
          "text": "Don't attach too much value to the title of the job. I've had data scientist roles where I was mostly a data butler, and analyst roles where I built production models. Getting in with a good salary is better than chasing titles.",
          "score": 5,
          "created_utc": "2026-02-22 22:32:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6xmc32",
          "author": "United-Stress-1343",
          "text": "A thing that usually works is approaching the interviews as if you were also interviewing the company. At the end of the day they are going to take time and effort from you, so you might as well make sure that they can offer something that exceeds your standards (as workplace). This usually keeps the conversations as 1 <> 1 and makes everything more fluid. Also, don't be sorry for the mistakes, you cannot know everything. Just be clear what you don't know, be upfront and sincere. Good luck with the job search! ",
          "score": 4,
          "created_utc": "2026-02-23 11:11:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6w4xmk",
          "author": "Intelligent-Past1633",
          "text": "It's crazy how much the bar has moved; I've noticed a lot more take-home assignments turning into full-blown projects that take days, not hours, which really adds to the burnout.",
          "score": 3,
          "created_utc": "2026-02-23 03:30:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6xkoyi",
          "author": "AccordingWeight6019",
          "text": "Rejections in this market usually say more about competition and timing than your actual ability. Try treating interviews as reps instead of verdicts. each one sharpens how you explain your thinking, which is often what companies are really evaluating. Track small improvements (clearer storytelling, better problem framing), not just offers, or the process will always feel like failure even when you’re progressing. \n\n",
          "score": 3,
          "created_utc": "2026-02-23 10:56:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6xshul",
          "author": "MorriceGeorge",
          "text": "What you’re feeling is completely normal. This market has been tough, and interviews right now are setting an exhausting standard for anyone.\n\nA few things that might help:\n\nSeparate rejection from identity because a rejection usually means just one of three things: someone had slightly more experience, someone interviewed slightly better that day, or the company had very specific criteria. It almost never means you’re not good enough.\n\nInterview performance is its own muscle that develops like any skill. Coding under time pressure, explaining your thought process clearly, etc etc all develop with experience. \n\nControl the only variables you can! Preparation routine, energy management (sleep, exercise, breaks from applications) etc. \n\nExpect rejection as part of the process and just assume you’ll get several no’s before a yes.\n\nMost importantly, don’t let a temporary market condition rewrite your self-concept because many strong candidates are getting rejected right now.",
          "score": 2,
          "created_utc": "2026-02-23 12:03:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6za8j0",
          "author": "ImprovemetDose",
          "text": "Let's overcome this together.\n\nPlease contact me.",
          "score": 1,
          "created_utc": "2026-02-23 16:57:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o735x5n",
          "author": "warmeggnog",
          "text": "felt the exact same way a few months ago. i think what helped me was breaking down the interview process into smaller chunks. instead of seeing it as one big, scary thing, i focused on mastering specific skills. maybe it's easier said than done but it really helps to not just keep practicing but write down feedback for yourself, focus on weaker areas (for me it was sql/python, and communicating as i code). also generally just don't be afraid to ask for feedback after rejections! most of the time they don't get back to me, but on the rare chance that they do, i get so much value just from knowing how i performed from an interviewer's perspective, than just chalking it up to i didn't do well/i'm not skilled enough. a lot of it is just luck and finding the right fit, so i hope you can keep going!",
          "score": 1,
          "created_utc": "2026-02-24 05:25:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7900s6",
          "author": "Intelligent-Past1633",
          "text": "It's crazy how much the bar has moved; I've noticed a lot more take-home assignments turning into full-blown projects that take days, not hours, which really adds to the burnout.",
          "score": 1,
          "created_utc": "2026-02-25 01:46:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7bz5ik",
          "author": "dataexec",
          "text": "Don’t get emotionally attached to any role you apply, even if you get to the last round of interviews where there is only two candidates left. Learned this the hard way. Keep applying for jobs like you got no interviews",
          "score": 1,
          "created_utc": "2026-02-25 14:37:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o710kgh",
          "author": "ChemicalGreedy945",
          "text": "We all start dying the second we are born, you’ll be okay. Go into a different industry where your skills are needed",
          "score": 0,
          "created_utc": "2026-02-23 21:51:34",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rdm2ij",
      "title": "Corperate Politics for Data Professionals",
      "subreddit": "datascience",
      "url": "https://www.reddit.com/r/datascience/comments/1rdm2ij/corperate_politics_for_data_professionals/",
      "author": "LeaguePrototype",
      "created_utc": "2026-02-24 17:09:52",
      "score": 52,
      "num_comments": 49,
      "upvote_ratio": 0.83,
      "text": "I recently learned the hard way that, even for technical roles, like DS, at very technical companies, corperate politics and managing relationships, positioning, and expectiations plays as much of a role as technical knowledge and raw IQ.\n\nWhat have been your biggest lessons for navigating corperate environments and what advice would you give to young DS who are inexperienced in these environments?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/datascience/comments/1rdm2ij/corperate_politics_for_data_professionals/",
      "domain": "self.datascience",
      "is_self": true,
      "comments": [
        {
          "id": "o769eyn",
          "author": "No_Ant_5064",
          "text": "\\-perception is reality. If you work really hard but no one see it, you're lazy. If you're lazy but you strategically do work that is highly visible when it counts, you are a team player.\n\n\\-Leadership doesn't care about the ins and outs of your analysis. They also don't care about the statistical limitations. They want to know what you found, how to interpret it, and what to do with your recommendation\n\n\\-Pace yourself. If you burn yourself out pushing an analysis over the finish line, they're just going to want more deep dives and follow ups RIGHT NOW. Take time to recover mentally, don't let people rush you, overestimate how long you thing things will take.",
          "score": 54,
          "created_utc": "2026-02-24 17:44:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o764r1m",
          "author": "Upset-Chemist-4063",
          "text": "Nobody cares about a cool model that uses the latest and greatest technologies or Python packages - maybe technical folks do, but most of your stakeholders wouldn’t know the different between a pvalue and an average.\n\nThe truth is you’re only as good/valuable as how effective you can communicate your learnings/insights, and how it leads to strategic recommendation. At most companies, you need to build confidence with the decision making stakeholders and build good rapport with them so they trust your recommendations. It might take time, but it’s more of a branding thing - you manage your image and how folks see you. Either as a person to make data requests from, or someone they come to for recommendations on how they should proceed with a project on their roadmap. \n\nLearn from your more seasoned leads in their respective areas. Learn how they talk, what metrics they care about, and how they present their information to the exec teams. You will learn how to become a data partner this way.",
          "score": 94,
          "created_utc": "2026-02-24 17:22:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7a86wi",
              "author": "RecognitionSignal425",
              "text": ">build confidence \n\nespecially the 95% interval ",
              "score": 8,
              "created_utc": "2026-02-25 06:34:03",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7b56lw",
                  "author": "stickypooboi",
                  "text": "Idk politics has requested we show 80 CI because “the numbers look better”. I fucking hate politics and I hate the higher up I go the less of an IC I am and the more dumb meetings I get with people who don’t have any inclination to differentiate between facts and fraud.",
                  "score": 2,
                  "created_utc": "2026-02-25 11:32:31",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7658bf",
          "author": "Old_Cry1308",
          "text": "people skills > technical skills. don't ignore them.",
          "score": 53,
          "created_utc": "2026-02-24 17:25:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o76a4mj",
              "author": "forbiscuit",
              "text": "I think you glitched because your comment got posted like at least 8 times",
              "score": 10,
              "created_utc": "2026-02-24 17:47:25",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o76e9nx",
                  "author": "ArgenCoso",
                  "text": "Not a glitch, he is making sure that we are not ignoring him. It's a recursive suggestion",
                  "score": 22,
                  "created_utc": "2026-02-24 18:05:45",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7h4f1m",
                  "author": "Cultural-Ambition211",
                  "text": "Proof that his people skills are superior to his technical skills",
                  "score": 1,
                  "created_utc": "2026-02-26 07:05:25",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o7a88kz",
              "author": "RecognitionSignal425",
              "text": "\\* people skills >>>>>>> technical skills.",
              "score": 2,
              "created_utc": "2026-02-25 06:34:27",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o7b6ssr",
              "author": "tongEntong",
              "text": "Bullshit skills > all other skills in corporate world",
              "score": 1,
              "created_utc": "2026-02-25 11:45:27",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o76x3oe",
          "author": "normee",
          "text": "Learn how performance reviews work at your company. Not just the regular 1-1 review meetings you have with your manager, but how often management comes together to discuss employees, and how they calibrate across people and teams. This matters a great deal for bonuses and awards, as well as how sought after you will be for internal advancement opportunities beyond your current immediate team. In previous organizations I've been at, performance calibrations sometimes were \"loudest voice led\" (managers who pushed hardest for their people would end up with them on top), and sometimes was \"popularity contest\" (employees who had good relationships with many managers or happened to do highly visible work were rewarded, employees whose work wasn't as visible and were unknowns to other managers not distinguished).\n\nKeep a running list of work accomplishments, and discuss them regularly with your manager. It will help you with those performance review and bonus processes as well as to keep your resume updated. \n\nGather as many advocates in your corner as possible beyond your own manager. If your manager is not very engaged, having others (especially department leaders and senior execs) who think highly of your work is critical for internal mobility and reducing the risk you'll be hit in a layoff.\n\nBeyond your accomplishments, time management, communication skills, and personality matter a lot for how you will be perceived. Learn what \"done\" actually means for your work and make sure you account for time for review and feedback, fixing issues, and handling unanticipated follow-ups. If you are working on something other people have dependencies on, make sure you are communicating status and why you might be delayed so you don't piss a lot of people off. Do not put yourself in a position where people can point to you as a scapegoat. Don't use technical jargon or get too in the weeds in front of an audience who doesn't care and will tune out. Use the same terminology as your business partners do. Aim for simplicity and brevity in your visualizations, presentations, emails, and reports, but don't be condescending, treat colleagues like dumb-dumbs, or mansplain. For meetings, show that you are respecting people's time and not tuning out, such as by being active in the chat with support and questions or keeping your camera on so that the meeting runners aren't seeing a bunch of lifeless muted black squares.",
          "score": 21,
          "created_utc": "2026-02-24 19:29:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o76z2n0",
              "author": "LeaguePrototype",
              "text": "it's like you were stalking me at my last job seeing all the things I did wrong lol",
              "score": 3,
              "created_utc": "2026-02-24 19:38:54",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o778qfy",
              "author": "Beautiful-Cell-470",
              "text": "Gold, saving this for later",
              "score": 1,
              "created_utc": "2026-02-24 20:23:40",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o7a8f2s",
              "author": "RecognitionSignal425",
              "text": "yes, clairy and simplicty are the best for business full of ambiguity",
              "score": 0,
              "created_utc": "2026-02-25 06:35:58",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o76ygjv",
          "author": "dang3r_N00dle",
          "text": "There are a bunch of useful books to read on this:\n\n1. Power: Why some people have it and other's don't\n2. Never Split the Difference\n3. Getting to Yes\n4. Set Boundaries, Find Peace\n5. The Unspoken Truths for Career Success\n6. The Unspoken Rules\n\nHaving a combination of these books is quite useful. You don't need to do machiavelian shit, but *do* understand optics, managing expectations and telling people the stuff that they need to know instead of what you think they should know. \n\nIt's not easy, and despite having read all of these books, I still struggle. But I realise that I struggle because I haven't been applying these things that well. \n\nLastly, there's a huge amount of power in small alignments with everyone on your team. Double checking metric definitions are right, discussing methodology with peers/seniors before working on it, asking for feedback on your work before plowing ahead to presenting numbers, and discussing with your manager when your workload is too high, is all stuff that will make your life a lot easier once you know how. ",
          "score": 7,
          "created_utc": "2026-02-24 19:36:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o76a415",
          "author": "chocolateandcoffee",
          "text": "Seems like the prevailing thought is people skills > technical skills. don't ignore them.",
          "score": 9,
          "created_utc": "2026-02-24 17:47:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o76awr1",
          "author": "GoBuffaloes",
          "text": "I am questioning your \"raw IQ\" based on your inability to spell corporate",
          "score": 11,
          "created_utc": "2026-02-24 17:50:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o766cfi",
          "author": "Old_Cry1308",
          "text": "people skills > technical skills. don't ignore them.",
          "score": 5,
          "created_utc": "2026-02-24 17:30:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o763ips",
          "author": "Old_Cry1308",
          "text": "people skills > technical skills. don't ignore them.",
          "score": 6,
          "created_utc": "2026-02-24 17:17:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o77sddu",
          "author": "welpbear",
          "text": "Business acumen  > Technicalities\n\nBe confident, assertive but also humble and grounded\n\nMake allies. Especially PM/account managers\n\nBecome indispensable to your lead for a specific thing\n\nLearn how to build a slide deck that deliveres a narrative. Which takes me to take a storytelling course. We do more decks than we write code sadly\n\nAlways watch how leads respond to people work and presence to see who has any influence\n\nDon't bad mouth or talk shit anyone to anyone. Don't trust anyone with all your thoughts\n\nDamn, re reading this makes me really rethink being in this field in corporate 😆 I could have done anything else but noooope 🫠🤣\n\nUpdate: edited formatting for easier read",
          "score": 2,
          "created_utc": "2026-02-24 21:54:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7bv2bn",
          "author": "Desperate-Radio5126",
          "text": "Biggest lesson: your job isnt \"build models\", its \"reduce risk for whoever owns the number\". So you need to pre-wire decisions before the big meeting: do a quick 10 min sync with the PM, eng lead, and whoever signs off, show a 1-pager with tradeoffs, and ask \"what would make this a no?\" early. Also, write down scope in Slack/email after every convo (\"to confirm, success = X metric by Y date\") because half of politics is just people rewriting history when things go sideways. And never surprise your manager with bad news in a stakeholder meeting.",
          "score": 2,
          "created_utc": "2026-02-25 14:16:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o766p42",
          "author": "Old_Cry1308",
          "text": "people skills > technical skills. don't ignore them.",
          "score": 3,
          "created_utc": "2026-02-24 17:31:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o767rzd",
          "author": "Old_Cry1308",
          "text": "people skills > technical skills. don't ignore them.",
          "score": 4,
          "created_utc": "2026-02-24 17:36:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o78cw3h",
          "author": "mcjon77",
          "text": "Personality goes a long way. \n\nPeople focus so much on technical skills, and they are important at a baseline.  However, for data scientists in particular, our personality and our ability to interact well with others, especially non-technical folks, is critical. \n\nFor some people this will sound pointless for others this will sound obvious, but it's really important that people actually enjoy working with you and being around you if you want to progress in your career.  You could be a technical master, but nobody wants to be around an asshole.  More importantly, they will only tolerate you for as long as they need to tolerate you and will drop you at the first opportunity if you have a poor personality. \n\nI saw this first hand in my first data science position. There was a senior guy who was extraordinarily technically competent, but he was a complete prick to EVERYONE except his boss. This guy had such a reputation as being a jerk that even Brown technical folks on the business side I thought he was a jerk, and they shouldn't have had that much contact with him. The problem was once his boss left people started maneuvering to get him canned too. \n\nIn contrast, if you got a good personality and maintain a positive attitude people will enjoy working with you and will look to you to help solve their problem, because they like you and trust you. This is especially true for the non-technical business folks when they interact with us. I've been called into meetings over seniors because the business leads knew me entrusted me and didn't know them.  This also leads to my second point. \n\nSometimes visibility is a literal thing. \n\nI love remote work, but I also got to see first hand at my last job how if there are two data scientists and one's remote and the other isn't the non remote data scientist is going to have a lot more opportunities to make a positive impression on leadership and business partners.  My previous team was remote but I was able to go into the office since I lived in the same city. Even though the other data scientists on the team work just as hard as me or harder she had nowhere near the visibility. \n\nThe results showed up in our performance reviews, particularly when leveling occurred where Managers from different parts of the business get together to standardize scores amongst employees.  She would tell me about how one of our directors seems to not like her and I would be perplexed because that director loved me. The problem was she was just a voice on teams and I was a face in the office. \n\nIf I was looking for career progression my ideal setup would be one to two days in the office where I could work closely with the non-technical business folks.  You really don't need more than that in the office to make an impression, certainly not 5 days. Folks just need to be able to SEE YOU as someone that they can work with and rely on.",
          "score": 3,
          "created_utc": "2026-02-24 23:38:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o765ltk",
          "author": "Old_Cry1308",
          "text": "people skills > technical skills. don't ignore them.",
          "score": 1,
          "created_utc": "2026-02-24 17:26:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7671mf",
          "author": "Old_Cry1308",
          "text": "people skills > technical skills. don't ignore them.",
          "score": 1,
          "created_utc": "2026-02-24 17:33:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o765z2i",
          "author": "Old_Cry1308",
          "text": "people skills > technical skills. don't ignore them.",
          "score": 2,
          "created_utc": "2026-02-24 17:28:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o769n3l",
              "author": "No_Ant_5064",
              "text": "it's hard to ignore them when you posted this comment 12 times.",
              "score": 15,
              "created_utc": "2026-02-24 17:45:13",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o76lqjl",
          "author": "Wojtkie",
          "text": "No one cares about your model, approach, or problems with the data. Only money you can make, money you can save, or info you can provide to do either of those two precious things.",
          "score": 2,
          "created_utc": "2026-02-24 18:38:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o771bgl",
          "author": "ohanse",
          "text": "People only care about making the best choice.\n\nIf you can analyze and report the shit out of something, but make no recommendation?\n\nNo perceived value. 95% of your labor will always be invisible to your cross functional colleagues.\n\nSo you should be “savvy” enough to know the big questions, and the viable solutions under consideration. This will allow you to take the final step of making the recommendation, which is when all of your value perception occurs.\n\nAlso: are you SURE you want to move up the ladder? Those titles can be heavy.",
          "score": 2,
          "created_utc": "2026-02-24 19:49:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o767f0z",
          "author": "Old_Cry1308",
          "text": "people skills > technical skills. don't ignore them.",
          "score": 2,
          "created_utc": "2026-02-24 17:35:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o768575",
          "author": "Old_Cry1308",
          "text": "people skills > technical skills. don't ignore them.",
          "score": 3,
          "created_utc": "2026-02-24 17:38:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o769okq",
              "author": "Adlach",
              "text": "Bro it went through stop hitting submit",
              "score": 22,
              "created_utc": "2026-02-24 17:45:24",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o76bcg5",
          "author": "Ok-Energy-9785",
          "text": "Exactly. The narrative matters more than any cutting edge method or programming language",
          "score": 1,
          "created_utc": "2026-02-24 17:52:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o76ykev",
          "author": "hazydude314",
          "text": "It is all about translating whatever you do into either make more money or save more money from company perspective. If you learn how to do that you have a very powerfull skill, cause in the end that what every business needs and optimizes for. Every single stakeholder will somehow be motivated by these arguments. Also it is really only about perceived skills not actual skills, big difference but thats how human nature works. ",
          "score": 1,
          "created_utc": "2026-02-24 19:36:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o78q0fi",
          "author": "dj_ski_mask",
          "text": "Let people have their bauble. If the immediate project seems stupid as hell - it probably is. Bur getting the shiny piece of crap out the door can pay dividends (via reciprocal trust building) in the form of interesting/high impact projects down the line. Gotta play the game.",
          "score": 1,
          "created_utc": "2026-02-25 00:50:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o78zzds",
          "author": "Intelligent-Past1633",
          "text": "It's wild how much of our job is really just managing expectations and translating complex technical work into business value for stakeholders who don't care about the underlying models.",
          "score": 1,
          "created_utc": "2026-02-25 01:46:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7aceyr",
          "author": "Simple_Woodpecker751",
          "text": "manage up",
          "score": 1,
          "created_utc": "2026-02-25 07:10:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7avs6c",
          "author": "WignerVille",
          "text": "I would go even further and say that even if your solution is the best choice (from a business perspective) sometimes politics will kill it. \n\nEven if you're really great at selling it. Have a nice personality and have proved value. That's great, but if it threatens people's position you will fight a battle that is very hard to win.",
          "score": 1,
          "created_utc": "2026-02-25 10:09:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7axxga",
          "author": "patternpeeker",
          "text": "one lesson for me was that technical skill alone does not protect u from politics. a lot of ds impact depends on how well u frame uncertainty and set expectations. if stakeholders feel surprised, u lose trust fast. being explicit about tradeoffs and risks has saved me more than any clever model tweak.",
          "score": 1,
          "created_utc": "2026-02-25 10:29:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ewfym",
          "author": "-sunday-",
          "text": "people skills > technical skills. don't ignore them.",
          "score": 1,
          "created_utc": "2026-02-25 22:47:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7fujkr",
          "author": "adlersmut089",
          "text": "I used to work in Corporate Finance before getting into Stats/Data. You get used to it 🫠",
          "score": 1,
          "created_utc": "2026-02-26 01:55:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ham07",
          "author": "Embiggens96",
          "text": "Biggest lesson is that being right isn’t enough, you have to make it easy for other people to win with you. Early on I thought clean models and solid logic would speak for themselves, but alignment, expectation setting, and stakeholder buy in matter just as much. If you don’t proactively communicate scope, risks, and tradeoffs, someone else will define the narrative for you. \n\nFor younger DS folks, I’d say learn to translate your work into business impact, document decisions, and build relationships before you need favors. Technical skill gets you hired, but trust and positioning determine how far you go.",
          "score": 1,
          "created_utc": "2026-02-26 08:01:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o763zcu",
          "author": "Old_Cry1308",
          "text": "people skills > technical skills. don't ignore them.",
          "score": 3,
          "created_utc": "2026-02-24 17:19:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o764iz5",
          "author": "Old_Cry1308",
          "text": "people skills > technical skills. don't ignore them.",
          "score": 2,
          "created_utc": "2026-02-24 17:21:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o764vp1",
          "author": "Old_Cry1308",
          "text": "people skills > technical skills. don't ignore them.",
          "score": -1,
          "created_utc": "2026-02-24 17:23:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o799cl7",
          "author": "Great_Purpose7024",
          "text": "Take all of your conversations with every stakeholder and turn each one into an AI agent representing how that person thinks and speaks. Ask the agents for honest feedback on you. Do this every month. Then, adjust your work accordingly to maximize their feedback.",
          "score": 0,
          "created_utc": "2026-02-25 02:39:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o79g77k",
          "author": "katiebug1096",
          "text": "I remember reading somewhere that people are typically promoted to the level of their incompetence.   So don't be surprised if you have more knowledge and experience then your supervisor.   I am in the education field and probably 90% of those in central office have little to no background in what their title says however because they have been in the district long enough they know enough people and they have enough experience years that therefore qualifies them for that title Go figure.",
          "score": 0,
          "created_utc": "2026-02-25 03:18:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o77iu19",
          "author": "Urban_singh",
          "text": "Fluffers >> technical+analytical skills",
          "score": -2,
          "created_utc": "2026-02-24 21:10:33",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rdr1k3",
      "title": "What is your (python) development set up?",
      "subreddit": "datascience",
      "url": "https://www.reddit.com/r/datascience/comments/1rdr1k3/what_is_your_python_development_set_up/",
      "author": "br0monium",
      "created_utc": "2026-02-24 20:05:38",
      "score": 47,
      "num_comments": 45,
      "upvote_ratio": 0.85,
      "text": "My setup on my personal machine has gotten stale, so I'm looking to install everything from scratch and get a fresh start. I primarily use python (although I've shipped things with Java, R, PHP, React).  \n## What do you use?\n1. Virtual Environment Manager\n1. Package Manager\n1. Containerization\n1. Server Orchestration/Automation (if used)\n1. IDE or text editor\n1. Version/Source control\n1. Notebook tools  \n  \n\n## How do you use it?\n1. What are your primary use cases (e.g. analytics, MLE/MLOps, app development, contributing to repos, intelligence gathering)?\n1. How does your setup help with other tech you have to support? (database system, sysadmin, dashboarding tools /renderers, other programming/scripting languages, web or agentic frameworks, specific cloud platforms or APIs you need...)\n1. How do you manage dependencies?\n1. Do you use containers in place of environments?\n1. Do you do personal projects in a cloud/distributed environment?  \n  \nMy version of python got a little too stale and the conda solver froze to where I couldn't update/replace the solver, python, or the broken packages. This happened while I was doing a takehome project for an interview:,)  \nSo I have to uninstall anaconda and python anyway.  \n  \nI worked at a FAANG company for 5 years, so I'm used to production environment best practices, but a lot of what I used was in-house, heavily customized, or simply overkill for personal projects. I've deployed models in production, but my use cases have mostly been predictive analytics and business tooling.  \n  \nI have ADHD so I don't like having to worry about subscriptions, tokens, and server credits when I am just doing things to learn or experiment. But I'm hoping there are best practices I can implement with the right (FOSS) tools to keep my skills sharp for industry standard production environments. Hopefully we can all learn some stuff to make our lives easier and grow our skills!\n",
      "is_original_content": false,
      "link_flair_text": "Tools",
      "permalink": "https://reddit.com/r/datascience/comments/1rdr1k3/what_is_your_python_development_set_up/",
      "domain": "self.datascience",
      "is_self": true,
      "comments": [
        {
          "id": "o77e7my",
          "author": "triplethreat8",
          "text": "Uv for virtual environment and package management\n\nDocker for containers\n\nKedro for pipelines (you didn't ask)\n\nVScode\n\nGit\n\nJust Ipython no jupyter",
          "score": 36,
          "created_utc": "2026-02-24 20:49:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o77q6du",
              "author": "br0monium",
              "text": "sounds nice! Ive always thought of pipelining as a function that spans mutliple other areas. Server automation and DBMS for job scheduling, data lineage, etc. Using a tool for the whole process would save a lot of time on data engineering decisions.",
              "score": 3,
              "created_utc": "2026-02-24 21:44:08",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o77vezq",
                  "author": "triplethreat8",
                  "text": "Yea, pipelining exists at multiple levels. Kedro itself isn't opinionated. Since it allows you to slice your pipeline you can still use any traditional pipeline tool that orchestrates scripts and just run slices.\n\nExample:\n\n`kedro run --nodes=clean_a,clean_b`\n\n`kedro run --nodes=clean_c`\n\nThe benefit of using kedro for a Data Science project is that it imposes a good reproducible structure and gets DS thinking in a more modular way.",
                  "score": 3,
                  "created_utc": "2026-02-24 22:08:43",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o77ii47",
              "author": "froo",
              "text": "+1 for this setup. Same here",
              "score": 2,
              "created_utc": "2026-02-24 21:09:03",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o77xole",
              "author": "mint_warios",
              "text": "Kedro is a beast",
              "score": 1,
              "created_utc": "2026-02-24 22:19:44",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o776uga",
          "author": "Old_Cry1308",
          "text": "conda for environments, pip for packages. vscode for editing, git for version control. jupyter for notebooks.",
          "score": 47,
          "created_utc": "2026-02-24 20:14:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o79u703",
              "author": "Civil-Age1531",
              "text": "dude you have to pick up uv",
              "score": 13,
              "created_utc": "2026-02-25 04:46:55",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7bpu5x",
                  "author": "Glittering_Item5396",
                  "text": "what is that?",
                  "score": 2,
                  "created_utc": "2026-02-25 13:47:55",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o7788ow",
              "author": "br0monium",
              "text": "the classics:)",
              "score": 5,
              "created_utc": "2026-02-24 20:21:20",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o77aqi4",
          "author": "templar34",
          "text": "Devcontainers in each repo, Backstage template for generic new project. Makes sure my pleb code from Windows machine behaves same as Mac code, behaves same as cloud deployment environment. Conda YAML part of repo, and has its own deployment pipeline for Azure.\n\nOne day maybe I'll look at uv, buuut I'm not the Azure expert that set up our pipelines, and I'm a big believer in \"if it's ugly/stupid but it works, it's not ugly/stupid\".",
          "score": 7,
          "created_utc": "2026-02-24 20:33:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o77sl1w",
              "author": "br0monium",
              "text": "I havent used the devcontainer spec before, looks like it's well supported and could be pretty clean. Backstage looks really interesting too. Thanks!",
              "score": 2,
              "created_utc": "2026-02-24 21:55:18",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o77gdef",
          "author": "gocurl",
          "text": "Poetry for virtual environment, vscode, and clear separation between training and serving.\nAt work we have nice pipelines and engineers to support the infrastructure. For home projects I keep the concept, but it's not that necessary (last finished project here https://github.com/puzzled-goat/fire_watcher)",
          "score": 4,
          "created_utc": "2026-02-24 20:59:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o79g267",
          "author": "willthms",
          "text": "I use R studio running on my desktop.",
          "score": 5,
          "created_utc": "2026-02-25 03:17:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o79hltz",
              "author": "br0monium",
              "text": "A real statistician!",
              "score": 4,
              "created_utc": "2026-02-25 03:26:23",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o77ntyn",
          "author": "Atmosck",
          "text": "What do I use:\n\n1. Virtual environment manager: pyenv for managing different python versions, uv for managing the actual virtual environments\n2. Package manager: uv\n3. Docker\n4. My coworkers maintain our build pipeline and orchestration with AWS. I mostly just ship code and bother them if I need new environment variables or something.\n5. vscode\n6. github for code, S3 versioning for model artifacts\n7. I don't use notebooks\n\nHow do I use it?\n\n1. I spend most of my time writing ML pipelines that feed our (SAAS) product. Scheduled tasks for training data ETL, training, monitoring and sometimes inference. Other times if it's something where we need inference in response to user action, either a lambda or a dedicated server depending on the usage patterns.\n2. I have kind of a love-hate relationship with vscode. Some of my projects are a mix of python and rust (PyO3), so it's nice having language support for both in the same editor, and the sqltools extension is great. The python debugger is pretty good. But the language servers randomly shit themselves like twice a week. And I wish copilot autocomplete was hooked into intellisense so that it would suggest functions and parameters that actually exist instead of just guessing.\n3. uv and pyproject.toml. almost all my stuff is containerized so it's pretty straightforward.\n4. In production yeah, but locally I always work in virtual environments. I always have at least one dependency group that's not used in production with ruff/pytest/pyright/stub packages.\n5. I don't really do personal projects. I'm lucky enough to be in an industry where my actual work is what my personal projects would be if I had a different job.\n\nIf you've been dealing with conda headaches and are looking for a new setup I *highly* recommend checking out uv. \n\n",
          "score": 5,
          "created_utc": "2026-02-24 21:33:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o77tv3d",
              "author": "br0monium",
              "text": "Thanks for breaking it down in a detailed response! I'll definitely check out uv after all the recommendations.\n\nI wouldn't do personal projects if I wasn't unemployed hahaha. But it's been so long I need to make sure I dont fall too far behind or forget things. I hit the point of diminishing returns with interview prep a while ago.",
              "score": 2,
              "created_utc": "2026-02-24 22:01:16",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o78ahv9",
              "author": "gpbayes",
              "text": "Why do you use rust?",
              "score": 1,
              "created_utc": "2026-02-24 23:25:30",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o78jimh",
                  "author": "Atmosck",
                  "text": "For speeeeeed. Specifically some of my models are state machine simulations where we care about the whole distribution and the frequency of rare events, and it can take a lot of sims for distributions to converge. So I write the core simulation engine (the \"hot loop\") in rust, and all the data IO and orchestration in python. For that sort of thing rust is about 100x faster than python. You could achieve similar speeds in python with a compiler like cython or numba or with a C extension, but there are a lot of things about rust that make it a more attractive language to work in.",
                  "score": 1,
                  "created_utc": "2026-02-25 00:15:37",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o79rpsy",
              "author": "unc_alum",
              "text": "Curious what your motivation is for using pyenv over uv for installing/managing different versions of python?",
              "score": 1,
              "created_utc": "2026-02-25 04:29:56",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o79xd4i",
                  "author": "Atmosck",
                  "text": "Basically just that I've used pyenv for longer. And I like the separation of pyenv happens in the global environment, UV happens in the venv",
                  "score": 1,
                  "created_utc": "2026-02-25 05:09:21",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o795wh5",
          "author": "FlyingQuokka",
          "text": "1. uv\n2. uv\n3-4: My personal projects don't need containerization; at work DevOps uses EKS\n5. neovim\n6. git/jj\n7. I don't use notebooks, but if I must, then marimo",
          "score": 4,
          "created_utc": "2026-02-25 02:20:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o79d57s",
              "author": "br0monium",
              "text": "Neovim, nice!  \nI actually have sublime, cmder, and atom still installed on my laptop😅 vscode is basically atom, and that's what I've used at work, so I'll probably end up using vscode like a normie.  \nNothing beats the feeling when your muscle memory for vi commands finally clicks though. It's like the shell, filesystem, and text editor are all just one thing that you live in.",
              "score": 1,
              "created_utc": "2026-02-25 03:00:30",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7c7wuk",
          "author": "AccordingWeight6019",
          "text": "Honestly, for me it’s less about fancy tooling and more about keeping things light, reproducible, and flexible. I usually stick with \\`venv\\` + \\`pip\\` for environments, VS Code for editing, git for versioning, and jupyter for quick experiments. containers only if I need to mirror a production setup. It’s not flashy, but it keeps personal projects simple and lets me switch between analytics, MLE, or just tinkering without getting stuck on solver freezes or subscription headaches.",
          "score": 3,
          "created_utc": "2026-02-25 15:20:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o77s2cb",
          "author": "vaaano",
          "text": "uv+marimo",
          "score": 2,
          "created_utc": "2026-02-24 21:52:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o77ywp7",
          "author": "mint_warios",
          "text": "1+2. uv for virtual envs & package Mgmt\n\n3. Docker or Google Cloud Build for containerisation\n\n4. Depends on the project, sometimes Prefect, sometimes Airflow/Cloud Composer for client enterprise pipelines, sometimes Kedro for more data science tasks\n\n5. PyCharm for IDE, with Cline plugin using Claude Sonnet or Opus 4.6 models with 1m context window for agentic coding\n\n6. Git - Bitbucket for work, GitHub for personal\n\n7. PyCharm's built-in Jupyter notebooks, or Colab Enterprise if need to work completely within a client's cloud environment",
          "score": 2,
          "created_utc": "2026-02-24 22:25:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o79agk6",
              "author": "br0monium",
              "text": "How much does that setup in (5) cost you?",
              "score": 1,
              "created_utc": "2026-02-25 02:45:38",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7bqaxr",
                  "author": "mint_warios",
                  "text": "PyCharm is free. Used to be called \"Community Edition\" but now it's wrapped up in their \"Unified\" IDE. But still free with all the same features. \n\nFor Cline, it really depends on the LLM model I've chosen to use and how much I decide to use it. I use Claude Opus 4.6 mostly, and in a typical day I can easily burn through $10-30+. Lower end if I'm just making some documentation. Higher end if it's using maximum extended thinking to develop lots of code.",
                  "score": 2,
                  "created_utc": "2026-02-25 13:50:27",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7aa524",
          "author": "sudo_higher_ground",
          "text": "1. Federated MLOps and development\n2. Uv and for cli install only in production pyenv \n3. Docker\n4. Docker compose/k8s/ schedulers (we use VMs in production so no fancy cloud tools)\n5. VS code (I switched to positron for personal projects) \n6. Git+ GitHub \n7. Switched from Jupyter to Marimo and it has been a bliss",
          "score": 2,
          "created_utc": "2026-02-25 06:50:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7fzcmg",
              "author": "br0monium",
              "text": "What do you like about marimo? I fiddled with it today for the first time, and it won't let you reassign/update variables outside of the cell its declared in?",
              "score": 1,
              "created_utc": "2026-02-26 02:23:20",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7b1gj4",
          "author": "patternpeeker",
          "text": "i keep my setup simple. plain python with venv or poetry, vscode, and docker only when i need prod parity. conda has caused enough solver pain that i avoid it. reproducibility and pinned deps matter more than fancy stacks.",
          "score": 2,
          "created_utc": "2026-02-25 11:01:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o77a5pq",
          "author": "koolaidman123",
          "text": "uv ruff and claude code is all you need",
          "score": 2,
          "created_utc": "2026-02-24 20:30:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o77d8kt",
              "author": "_OMGTheyKilledKenny_",
              "text": "Same here but I use vs code with Claude as copilot and GitHub workflows for CI/CD.",
              "score": 1,
              "created_utc": "2026-02-24 20:44:56",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o780fo3",
          "author": "Dysfu",
          "text": "UV, venv, ruff, pre-commit, FastAPI, Alembic, dbt, pydantic, SQLAlchemy, Docker, VSCode",
          "score": 2,
          "created_utc": "2026-02-24 22:33:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o79ezwo",
              "author": "br0monium",
              "text": "Can you elaborate a bit on what you use each of these for?",
              "score": 1,
              "created_utc": "2026-02-25 03:11:03",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o77zw0h",
          "author": "dmorris87",
          "text": "Docker container inside VSCode",
          "score": 1,
          "created_utc": "2026-02-24 22:30:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o78zwv3",
          "author": "Intelligent-Past1633",
          "text": "I'm still a big fan of \\`pyenv\\` for managing Python versions – it's been rock solid for me, especially when juggling older projects that can't easily upgrade.",
          "score": 1,
          "created_utc": "2026-02-25 01:46:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7av96i",
          "author": "Goould",
          "text": "conda, pip and npm, Antigravity and Claude Code from terminal, Git + Github, Jupyter Notebook\n\nAside from that I'm able to design a lot of my own tools now. I have a PDF indexer that pulls the data and creates libraries of CSV files, the indexer creates a SQLite database which can later be accessed in seconds in future sessions. I have different agents for reading, writing, and verifying data with 3rd party sources. \n\nSomeone in the thread said they used Rust and I think I could have implemented rust into my workflow as well since its faster -- I'd just have to relearn the code and all the libraries from scratch. \n\n  \n\n\n",
          "score": 1,
          "created_utc": "2026-02-25 10:05:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7b1ydh",
          "author": "mshintaro777",
          "text": "uv + Antigravity + git + Claude Code!",
          "score": 1,
          "created_utc": "2026-02-25 11:05:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7b617x",
          "author": "tongEntong",
          "text": "Jupyter notebook till death do us apart!",
          "score": 1,
          "created_utc": "2026-02-25 11:39:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7frw5y",
          "author": "snowbirdnerd",
          "text": "I don't do machine learning on my own time. If I am doing personal projects it's probably web apps in JavaScript. ",
          "score": 1,
          "created_utc": "2026-02-26 01:40:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o77aepb",
          "author": "OmnipresentCPU",
          "text": "Claude code docker and that’s it. Ipynb is going the way of the dinosaur for me personally.",
          "score": 1,
          "created_utc": "2026-02-24 20:31:31",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r91byx",
      "title": "Was my modeling approach in this interview flawed, or was I rejected for other reasons?",
      "subreddit": "datascience",
      "url": "https://www.reddit.com/r/datascience/comments/1r91byx/was_my_modeling_approach_in_this_interview_flawed/",
      "author": "quite--average",
      "created_utc": "2026-02-19 14:56:50",
      "score": 46,
      "num_comments": 52,
      "upvote_ratio": 0.87,
      "text": "I had an interview where they gave me a dataset with \\~130 (edited from 100) variables and asked me to fit a model. For EDA, I calculated % missing for each variable and dropped ones with >99% missing, saying they likely wouldn’t have much signal. For the rest, I created missing indicators to capture any predictive value in the missingness, and left the original missing values since I planned to use XGBoost which can handle them.\n\nI also said that if I used logistic regression, I’d normalize variables between the 1st and 99th percentile to reduce outlier impact and scale them to 0–1 so coefficients are comparable.\n\nI ended up getting rejected, so now I’m wondering if there was something wrong with my approach or if it was likely something else.\n\nEdit: As a measure of variable reduction, I also dropped a bunch of columns that had greater than 95% of same values (constant) stating that they may not have much variance, and if I have more time I’d revisit the 95% threshold and look into the columns that were being dropped.",
      "is_original_content": false,
      "link_flair_text": "Statistics",
      "permalink": "https://reddit.com/r/datascience/comments/1r91byx/was_my_modeling_approach_in_this_interview_flawed/",
      "domain": "self.datascience",
      "is_self": true,
      "comments": [
        {
          "id": "o693sz2",
          "author": "Ty4Readin",
          "text": "I don't think you did anything egregious, but here are some thoughts that came to mind:\n\n1. Removing features based on EDA is risky imo. I would rather understand what do the features represent, could they potentially be predictive, etc. Even if a feature is missing in 99% of samples, there could be 1% of samples where it is extremely predictive.\n\n2. I don't understand why you added an indicator for missing values if you are using xgboost models that can natively handle missing values.\n\n3. I don't generally agree with the practice of \"capping outliers\" or filtering outliers, etc. Outliers are not necessarily bad and should not necessarily be treated any differently. The only exceptions in my opinion is if I understand the domain and I know the outliers are caused by a genuine measurement error. \n\n4. Overall, I feel like this type of exercise is fairly useless. It sounds like you went through a very basic generic EDA process, however it doesn't seem to take anything into account regarding the domain/problem/business value, etc.\n\nIf I am asking an interviewee about a problem like this, I am more interested in having them ask questions like:\n\n- What business problem are we solving?\n\n- Are we collecting the data properly for the problem we want to solve?\n\n- What loss functions / evaluation metrics should we use?\n\n- How will the model be used/deployed? Is it properly formulated?\n\n- How should we split the data in train/valid/test?\n\n\nTo me, those are the actual important skills and questions that should be addressed. But walking through some generic EDA process is kind of pointless in my opinion, but I don't really know much about the interview questions and process you went through.",
          "score": 95,
          "created_utc": "2026-02-19 15:11:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o695cko",
              "author": "quite--average",
              "text": "Thanks for sharing, I appreciate the input. I agree that removing features purely based on EDA can be risky. In a 45 minute interview though, I felt I needed to use some practical way to handle missing values without fully understanding the data, especially since the interviewer also wasn’t familiar with the dataset’s domain.\n\nRegarding outliers, from what I’ve read and seen in my field (risk), logistic and linear regression can be influenced by them. In this context, outliers are often things like extremely high balances or asset values that occur very rarely but can skew the model.\n\nI edit the post with one more update, could that be it that caused the rejection?",
              "score": 17,
              "created_utc": "2026-02-19 15:19:42",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o69bgts",
                  "author": "Latent-Person",
                  "text": "> Regarding outliers, from what I’ve read and seen in my field (risk), logistic and linear regression can be influenced by them. In this context, outliers are often things like extremely high balances or asset values that occur very rarely but can skew the model.\n\nJust because some values are \"too different\" from the rest doesn't mean they should be removed. Extreme values may be rare, but they can reflect the true underlying population rather than errors. In the example you mention, heavy tails are expected. You shouldn't just delete data to make your model \"fit better\". See e.g. this StackExchange post https://stats.stackexchange.com/questions/200534/is-it-ok-to-remove-outliers-from-data for more discussion about this.\n\nYou can also play around with this yourself by simulating from a distribution with heavy tails, or a mixture of two different distributions.",
                  "score": 21,
                  "created_utc": "2026-02-19 15:49:59",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o69fni8",
                  "author": "ArcticGlaceon",
                  "text": "Credit risk? Just use weight of evidence encoding and call it a day, they love that shit and solves your outlier and missing data problem. \n\nAre you already working in the field? Methodology is pretty standardised and I would think things like WOE encoding is ubiquitous no matter where you go.",
                  "score": 3,
                  "created_utc": "2026-02-19 16:10:16",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o69e8rq",
                  "author": "Ty4Readin",
                  "text": ">I felt I needed to use some practical way to handle missing values without fully understanding the data, especially since the interviewer also wasn’t familiar with the dataset’s domain\n\nThats a big red flag from the interviewer lol. Not really your fault there.\n\n>Regarding outliers, from what I’ve read and seen in my field (risk), logistic and linear regression can be influenced by them. In this context, outliers are often things like extremely high balances or asset values that occur very rarely but can skew the model.\n\nMy default is always to leave the data as is regarding outliers unless I know there is measurement error issues, etc.\n\nThere might be cases where it can empirically be helpful for the model to cap outlier valued depending on the model type, features available, dataset size, etc.\n\nHowever, if that is the case, I would treat it as a hyperparameter and would experiment to see whether it actually has a positive impact or not on validation results. In general, I find that it doesn't help practically and usually better to leave data outliers alone, but your mileage may vary :)",
                  "score": 6,
                  "created_utc": "2026-02-19 16:03:28",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o6dnkv8",
                  "author": "TA_poly_sci",
                  "text": "> Regarding outliers, from what I’ve read and seen in my field (risk), logistic and linear regression can be influenced by them. In this context, outliers are often things like extremely high balances or asset values that occur very rarely but can skew the model\n\nRight, but that (1) is not sufficient reason to remove them, it's effectively just basing your model and (2) you were proposing to use xgboost.",
                  "score": 1,
                  "created_utc": "2026-02-20 06:22:44",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o6al8qr",
              "author": "Mizar83",
              "text": "I would add to this that there may also have been leakage in the feature/outliers removal. Improper train/test split with temporal leakage may also be a point.",
              "score": 2,
              "created_utc": "2026-02-19 19:27:53",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o6cb9bo",
              "author": "-phototrope",
              "text": "I think it’s up to the interviewee to ask these types of questions to show they understand what the problem/question really is. It’s about the business problem.",
              "score": 1,
              "created_utc": "2026-02-20 00:53:30",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o6dndf3",
              "author": "TA_poly_sci",
              "text": "I think in this case the interview sufficiently showed OP might have a decent amount of textbook knowledge, but very little practical knowledge about how top  prioritize it. In that sense, I think this is a fairly reasonable case, one that is realistically challenging for a data science.",
              "score": 1,
              "created_utc": "2026-02-20 06:20:56",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o69cx9h",
          "author": "michael-recast",
          "text": "I've designed and run hundreds of these types of interviews. My suspicion is that the interviewer was looking for more discussion about the business problem and what the model is actually doing and what the risks are. Jumping directly into modeling would be an auto-fail if that was the case. This is similar to what u/Ty4Readin suggests above but he says he'd call it a \"nice to have\" in the interview whereas often for me it's the most important piece!",
          "score": 31,
          "created_utc": "2026-02-19 15:57:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o69dpl8",
              "author": "Ty4Readin",
              "text": "I totally agree with you, I may have worded my comment poorly, but jumping into EDA/modeling is fairly useless IMO. The most important part is understanding the business problem, model formulation, etc. So 100% agree with you.\n\nHowever, I think OP mentioned that the interviewer said they don't know anything about the dataset or business problem 😂 So it sounds like just a bad interview process overall",
              "score": 13,
              "created_utc": "2026-02-19 16:00:52",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o69e8be",
                  "author": "quite--average",
                  "text": "Yeah I asked them about a few variables, they said they are not sure as it was a random dataset taken from Kaggle.",
                  "score": 12,
                  "created_utc": "2026-02-19 16:03:24",
                  "is_submitter": true,
                  "replies": []
                },
                {
                  "id": "o69ikfg",
                  "author": "michael-recast",
                  "text": "oof okay nevermind -- just sounds like a bad interview, who knows what they could have been looking for",
                  "score": 7,
                  "created_utc": "2026-02-19 16:24:17",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o6b1i1b",
              "author": "CadeOCarimbo",
              "text": "In my experience most of companies don't leave much room for questions. They send you the case and expect just the notebook solution from you.",
              "score": 3,
              "created_utc": "2026-02-19 20:47:09",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o69ebnu",
              "author": "quite--average",
              "text": "Thank you, this is useful. I will try to improve upon this.",
              "score": 2,
              "created_utc": "2026-02-19 16:03:52",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6a11qr",
          "author": "Single_Vacation427",
          "text": "Dropping variables for \"lack of variance\" doesn't make sense. What if you have a variable that takes 2 values, 0 and 1, and it indicates \"old customers\" and \"new costumers\". Now you have 5 new customers every 95 old customers, and new customers behave very differently so it's an important signal. Why would you delete that? \n\nThat said, you said the interviewer did not know about the data and it was a random dataset from Kaggle. That's a very shitty interviewer/interview.",
          "score": 9,
          "created_utc": "2026-02-19 17:52:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o694xgq",
          "author": "Gilchester",
          "text": "From what you've said, the only thing I can see maybe being a factor is you didn't describe the assumptions needed for your missing approach to work. What does that approach need to be valid? Under what circumstances could it give bad results? As an interviewer, I'd like the hear you describe your thoughts there even it didnt xchange your code",
          "score": 4,
          "created_utc": "2026-02-19 15:17:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o699xrw",
              "author": "quite--average",
              "text": "Thanks for this, I definitely missed this.",
              "score": 1,
              "created_utc": "2026-02-19 15:42:35",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o69boil",
                  "author": "Gilchester",
                  "text": "Your welcome! But to be clear I have no idea if this made the difference; id generally consider this a nice to have not a need to have",
                  "score": 1,
                  "created_utc": "2026-02-19 15:51:02",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o69k7fw",
          "author": "Lady_Data_Scientist",
          "text": "Did you jump right into EDA and model building, or did you ask any clarifying questions? While you were going thorugh EDA, did you ask any questions? This is usually the biggest (and most common) misstep during interviews. If you were on the job, very rarely would you ever jump right into a task or project without making sure you understood what the goal was, verified your assumptions, etc. Even just restating what the interviewer is asking you to do and articulating your assumptions and why you are solving the problem the way you are is important. ",
          "score": 5,
          "created_utc": "2026-02-19 16:32:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6928lz",
          "author": "phoundlvr",
          "text": "First off, what level is this? Junior DS, DS, Senior, Staff? It matters a lot. \n\nThere is nothing that strikes me as wrong, but if you’re using XGBoost then there might be value in the >99% missing data. I’d consider the context of those variables. Worst case, if there is no value then XGBoost won’t split. \n\nDid you do any hyperparameter tuning? Did you cross validate that tuning? How did you handle the train test split?",
          "score": 3,
          "created_utc": "2026-02-19 15:03:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o693gm9",
              "author": "quite--average",
              "text": "This was Senior role and I did not do HP tuning. I said I’d ideally handle train test split by time to test for out of time validation (common in my field) but since we do not have a time column I’ll just stick to 80-20 stratified split.\n\nAlso I edited the post:\n\nAs a measure of variable reduction, I also dropped a bunch of columns that had greater than 95% of same values (constant) stating that they may not have much variance, and if I have more time I’d revisit the 95% threshold and look into the columns that were being dropped. Maybe this was a poor technique? But we use it at work so I learnt there",
              "score": 0,
              "created_utc": "2026-02-19 15:10:05",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o696g5i",
                  "author": "phoundlvr",
                  "text": "In the case of tree based algorithms… you can just throw shit at them. If it isn’t a constant vector it may provide value. I’d tune the trees to minimize overfitting before I dropped anything for arbitrary, non-data driven reasons. \n\nWith context about the modeling problem you *should* exclude some variables - think data leakage, etc.\n\nTruthfully, if you interviewed for a senior role on my team and didn’t do any cross validated hyperparameter tuning, I’d fail you.",
                  "score": 5,
                  "created_utc": "2026-02-19 15:25:15",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6adb8x",
          "author": "WhosaWhatsa",
          "text": "As important as this interview was to you, interviews often do not include the due diligence that is proportional to its importance for the interviewee.\n\nThere could have been a hundred reasons and only four of them fair that they didn't hire you.",
          "score": 2,
          "created_utc": "2026-02-19 18:50:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6b9fdk",
          "author": "24BitEraMan",
          "text": "My flag went up when you didn’t ask what the purpose and intent are. Are we doing inference or prediction? What type of business problem is this and what if any limitations of the data collection process. Plus a big one for me is what is our KPI? What are we measuring here? \n\nWe don’t bring value in doing really basic EDA and applying a standard out of the box model. We bring domain expertise, intuition when you spend all day looking at data and an ability to translate business or product problems into answerable insights via the data to help decision makers.\n\nI also need an explanation why you jumped straight to XGBoost? Simple models often perform just as well. To me we always need a justified reason for jumping to more complicated less interpretable models. This is personally a red flag for me because more complicated does not mean better, and all models have trade offs and people who jump to the most complicated model often have a blind spot for trade offs in our models.\n\nI don’t think you did anything wrong, but you didn’t clear the bar IMO and it seems like they agreed. These technical interviews should always be a back and forth not a code the solution then talk.\n",
          "score": 2,
          "created_utc": "2026-02-19 21:25:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6cqrsy",
          "author": "mastersbet",
          "text": "The biggest issue with these kind of interviews is that the interviewer has seen this data many times and they know the correct solution. They assume that the interviewee would just jump in, do some quick EDA and quickly find the peculiarities in the data and do the modeling in a 45 mins interview.\nThis is not how this would work in any real world scenario, you have to have substantial business knowledge, data familiarity and understanding of the exact problem they are trying to solve before proceeding with the modeling.",
          "score": 2,
          "created_utc": "2026-02-20 02:28:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6crlyw",
              "author": "quite--average",
              "text": "\nI felt the same way. I’m not sure how I’m supposed to extract meaningful insights and perform feature engineering in just a few minutes of looking at the data. But I try not to dwell on it too much, because that’s how the job market is these days, and you have to play the game.",
              "score": 1,
              "created_utc": "2026-02-20 02:33:55",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o691eyu",
          "author": "Elegant-Pie6486",
          "text": "How many observations did the dataset have?",
          "score": 1,
          "created_utc": "2026-02-19 14:59:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6925ur",
              "author": "quite--average",
              "text": "I believe about 60K.",
              "score": 1,
              "created_utc": "2026-02-19 15:03:23",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o692l6s",
                  "author": "Elegant-Pie6486",
                  "text": "99% missing may have been powerful features. Depending on the fields and how the data is pulled together missing can mean an event never happened, so if it was a credit risk model knowing \"months since last bankruptcy\" is not missing is very powerful.",
                  "score": 9,
                  "created_utc": "2026-02-19 15:05:35",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o69tb67",
          "author": "Interesting-Speed335",
          "text": "Sorry for joining in without any valuable input, but could you please give me some insights about where I can find learning materials on that subject matter? Thanks a lot in advance!",
          "score": 1,
          "created_utc": "2026-02-19 17:15:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o692cbp",
          "author": "jesusonoro",
          "text": "your approach sounds solid tbh. missing indicators + xgboost native handling is smart. probably came down to how you explained your reasoning or culture fit",
          "score": 1,
          "created_utc": "2026-02-19 15:04:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o69u1i9",
          "author": "InfamousTrouble7993",
          "text": "Common practice is to use LASSO regression or probability based models with model selection criteria like aic or bic. For ml models usually, CV is performed with candidate models for variable selection. Some tree models support feature importance matrices than can be used for variable selection. I think you chose a way that works, but is not systematic",
          "score": -2,
          "created_utc": "2026-02-19 17:19:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6a1gp5",
              "author": "PaddingCompression",
              "text": "Tree based models implicitly do lasso-like feature selection.  They just don't use the variable unless it is important enough.  No need to do an explicit selection process.",
              "score": 6,
              "created_utc": "2026-02-19 17:54:51",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6bcymg",
                  "author": "InfamousTrouble7993",
                  "text": "ah thank you, I didnt know that!",
                  "score": 1,
                  "created_utc": "2026-02-19 21:42:47",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1rcft6y",
      "title": "Large Language Models for Mortals: A Practical Guide for Analysts",
      "subreddit": "datascience",
      "url": "https://www.reddit.com/r/datascience/comments/1rcft6y/large_language_models_for_mortals_a_practical/",
      "author": "andy_p_w",
      "created_utc": "2026-02-23 12:12:15",
      "score": 35,
      "num_comments": 5,
      "upvote_ratio": 0.71,
      "text": "Shameless promotion -- I have recently released a book, [Large Language Models for Mortals: A Practical Guide for Analysts](https://crimede-coder.com/blogposts/2026/LLMsForMortals).\n\nhttps://preview.redd.it/7t71ql8ek9jg1.png?width=3980&format=png&auto=webp&s=1870a49ec6030cad49c364062c02cf5da166993f\n\nThe book is focused on using foundation model APIs, with examples from OpenAI, Anthropic, Google, and AWS in each chapter. The book is compiled via Quarto, so all the code examples are up to date with the latest API changes. The book includes:\n\n* Basics of LLMs (via creating a small predict the next word model), and some examples of calling local LLM models from huggingface (classification, embeddings, NER)\n* An entry chapter on understanding the inputs/outputs of the API. This includes discussing temperature, reasoning/thinking, multi-modal inputs, caching, web search, multi-turn conversations, and estimating costs\n* A chapter on structured outputs. This includes k-shot prompting, parsing JSON vs using pydantic, batch processing examples for all model providers, YAML/XML examples, evaluating accuracy for different prompts/models, and using log-probs to get a probability estimate for a classification\n* A chapter on RAG systems: Discusses semantic search vs keyword via plenty of examples. It also has actual vector database deployment patterns, with examples of in-memory FAISS, on-disk ChromaDB, OpenAI vector store, S3 Vectors, or using DB processing directly with BigQuery. It also has examples of chunking and summarizing PDF documents (OCR, chunking strategies). And discusses precision/recall in measuring a RAG retrieval system.\n* A chapter on tool-calling/MCP/Agents: Uses an example of writing tools to return data from a local database, MCP examples with Claude Desktop, and agent based designs with those tools with OpenAI, Anthropic (showing MCP fixing queries), and Google (showing more complicated directed flows using sequential/parallel agent patterns). This chapter I introduce LLM as a judge to evaluate different models.\n* A chapter with screenshots showing LLM coding tools -- GitHub Copilot, Claude Code, and Google's Antigravity. Copilot and Claude Code I show examples of adding docstrings and tests for a current repository. And in Claude Code show many of the current features -- MCP, Skills, Commands, Hooks, and how to run in headless mode. Google Antigravity I show building an example Flask app from scratch, and setting up the web-browser interaction and how it can use image models to create test data. I also talk pretty extensively\n* Final chapter is how to keep up in a fast paced changing environment.\n\nTo preview, the first 60+ pages [are available here](https://crimede-coder.com/blogposts/2026/LLMsForMortals). Can purchase worldwide in [paperback](https://crimede-coder.com/cdcstore/product/large-language-models-for-mortals/) or [epub](https://crimede-coder.com/cdcstore/product/large-language-models-for-mortals-a-practical-guide-for-analysts-with-python/). Folks can use the code LLMDEVS for 50% off of the epub price.\n\nI wrote this because the pace of change is so fast, and these are the skills I am looking for in devs to come work for me as AI engineers. It is not rocket science, but hopefully this entry level book is a one stop shop introduction for those looking to learn.",
      "is_original_content": false,
      "link_flair_text": "AI",
      "permalink": "https://reddit.com/r/datascience/comments/1rcft6y/large_language_models_for_mortals_a_practical/",
      "domain": "self.datascience",
      "is_self": true,
      "comments": [
        {
          "id": "o73fsa6",
          "author": "Top-Still-4669",
          "text": "I just finish reading you free page u gave. ngl its insightful and easy to understand. I'm new to this and on my learning-phases. I might stumble part on your book as my reference since so many nonsense information in internet. If I may ask just for short, what would you recommended someone like me, who learning by myself. what should I do to compete in the industry.",
          "score": 3,
          "created_utc": "2026-02-24 06:47:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o75fxya",
              "author": "andy_p_w",
              "text": "So this book to be clear you need to have a basic understanding of python coding first. If you do not have that python experience, I have another entry level python book, [https://crimede-coder.com/blogposts/2024/PythonDataScience](https://crimede-coder.com/blogposts/2024/PythonDataScience) \n\n\n\n",
              "score": 1,
              "created_utc": "2026-02-24 15:30:48",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o73xore",
              "author": "[deleted]",
              "text": "[removed]",
              "score": -1,
              "created_utc": "2026-02-24 09:33:57",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1rejrgc",
      "title": "Spark SQL refresher suggestions?",
      "subreddit": "datascience",
      "url": "https://www.reddit.com/r/datascience/comments/1rejrgc/spark_sql_refresher_suggestions/",
      "author": "Tamalelulu",
      "created_utc": "2026-02-25 17:31:10",
      "score": 23,
      "num_comments": 12,
      "upvote_ratio": 0.92,
      "text": "I just joined a a company that uses Databricks. It's been a while since I've used SQL intensively and think I could benefit from a refresher. My understanding is that Spark SQL is slightly different from SQL Server. I was wondering if anyone could suggest a resource that would be helpful in getting me back up to speed.\n\n  \nTIA",
      "is_original_content": false,
      "link_flair_text": "Education",
      "permalink": "https://reddit.com/r/datascience/comments/1rejrgc/spark_sql_refresher_suggestions/",
      "domain": "self.datascience",
      "is_self": true,
      "comments": [
        {
          "id": "o7d5m2u",
          "author": "_Useless_Scientist_",
          "text": "Are they only using SQL? Databricks offers a wide range of programming languages and we use a mix of PySpark, SQL and Python.\nDatabricks also has courses for their specific paths.\nSo you might want to have a look there (some should be free if I remember correctly)",
          "score": 10,
          "created_utc": "2026-02-25 17:55:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7d2ca0",
          "author": "DelayedPot",
          "text": "I used data lemur to brush up on my sql. I’m more of a brute force my way into learning kind of person so the practice problems on the platform were helpful!",
          "score": 5,
          "created_utc": "2026-02-25 17:40:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7f4041",
          "author": "sonicking12",
          "text": "AI, my friend",
          "score": 3,
          "created_utc": "2026-02-25 23:27:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7fxcvf",
          "author": "Sufficient_Meet6836",
          "text": ">My understanding is that Spark SQL is slightly different from SQL Server.\n\nYup it's slightly different. Databricks SQL is ANSI standard SQL with quality of life improvements. Like `select * (except ...)`. Most common differences for me from SQL Server have been `select * from tbl limit 5` instead of `select top 5 * ...`, and you can't do `new_column = blah blah blah`. You have to use `blah blah blah as new_column`. It was a really easy transition",
          "score": 2,
          "created_utc": "2026-02-26 02:12:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7h3a8m",
          "author": "patternpeeker",
          "text": "spark sql syntax is not the hard part. the real shift on databricks is thinking about distributed execution, especially joins and shuffles. i would skim the spark docs for dialect quirks, then focus on explain plans to rebuild intuition.",
          "score": 2,
          "created_utc": "2026-02-26 06:55:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7dimcd",
          "author": "sickomoder",
          "text": "i think stratascratch supports spark sql",
          "score": 1,
          "created_utc": "2026-02-25 18:53:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7eeh4d",
          "author": "repeat4EMPHASIS",
          "text": "customer-academy.databricks dot com /learn\n\nThe second carousel on the page is for free self-paced trainings",
          "score": 1,
          "created_utc": "2026-02-25 21:21:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7fvseg",
          "author": "Great_Purpose7024",
          "text": "three tier process: \n- human\n- ai\n- sql\n\nlearn to use ai as the first class interface. pay for claude pro. your welcome",
          "score": 1,
          "created_utc": "2026-02-26 02:03:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7h0v67",
          "author": "WillingAstronomer",
          "text": "The book Spark: A definitive guide is great!",
          "score": 1,
          "created_utc": "2026-02-26 06:35:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7h3t64",
          "author": "AccordingWeight6019",
          "text": "I was in a similar spot before, and honestly, what helped most was just doing side by side comparisons of normal SQL versus Spark SQL behavior while practicing. Spark feels familiar at first, but things like distributed execution, lazy evaluation, and how joins/shuffles behave change how you *think* about queries.\n\nThe  databricks docs are surprisingly practical, and I’d also recommend just working through small datasets in notebooks to relearn patterns like window functions and aggregations in a distributed context. A quick hands on refresher tends to stick way better than pure tutorials.",
          "score": 1,
          "created_utc": "2026-02-26 07:00:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7h5yoe",
          "author": "Unlucky-Papaya3676",
          "text": "\nEveryone’s talking about bigger models… but almost no one talks about cleaning the data properly.\nThere’s this DCB (Dynamic Content Book) tool that actually sanitizes and intelligently chunks books specifically for LLM training. It turns messy raw text into structured, model-ready data.\nThis feels like a seriously underrated part of the AI pipeline.\nHere’s the Kaggle notebook:\nhttps://www.kaggle.com/code/tanmaypotdar/llm-book-sanitizer-structured-cleaning-chunks�",
          "score": 1,
          "created_utc": "2026-02-26 07:19:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7e9oal",
          "author": "outofband",
          "text": "Use the AI assistant to make you some queries that you need, start from there",
          "score": 1,
          "created_utc": "2026-02-25 20:58:53",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rcv1w9",
      "title": "What is going on at AirBnB recruiting??",
      "subreddit": "datascience",
      "url": "https://www.reddit.com/r/datascience/comments/1rcv1w9/what_is_going_on_at_airbnb_recruiting/",
      "author": "br0monium",
      "created_utc": "2026-02-23 21:47:40",
      "score": 15,
      "num_comments": 13,
      "upvote_ratio": 0.67,
      "text": "Most recently I had a recruiter TEXT MY FATHER about a role at AirBnB. Then he tried to add me and message me on linkedin. I have no idea how he got one of my family members numbers (I mean he probably bought data froma broker, but this has never happened before).\n\nThe professionalism in recruiters has definitely degraded in the past few years, but I've noticed shenanigans like this with AirBnB every 3 to 6 months. Each hiring season I'll see several contract roles at AirBnB posted at the same time with different recruiting firms. Job description is almost identical. After we get in touch, almost all will ghost me. About 2 will set up a call. Recruiter call goes well, they say theyll connect me to hiring manager and then disappear. The first couple times I followed up a few days later, then a week, another week, two weeks after that... Nothing. \n\nMeta and google are doing this a bit too, but AirBnB is just constant with this nonsense. I don't even click on their job postings or interact with recruiters for them anymore. Is this a scam? Are they having trouble with hiring freezes or posting ghost jobs? Can anyone shed some light on this or confirm having a similar experience?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/datascience/comments/1rcv1w9/what_is_going_on_at_airbnb_recruiting/",
      "domain": "self.datascience",
      "is_self": true,
      "comments": [
        {
          "id": "o711dzs",
          "author": "Single_Vacation427",
          "text": "Staffing agencies that work with contracts do not work for AirBnB and many are total weirdos because they work on commission. There is also a deadline for submitting people for a contract which makes it time sensitive. If you are not hearing back, they probably did not select your resume. Most of the time they pick people who already worked for the company because as a temp, you barely have onboarding.",
          "score": 30,
          "created_utc": "2026-02-23 21:55:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o71625s",
              "author": "br0monium",
              "text": "I hear you. AirBnB is the only one i've repeatedly seen using SEVERAL vendors for seemingly one role (same title, same location, same pay, similar or same JD). Maybe its just confirmation bias after having most of my initial interactions with AirBnB when I first decided to be open to contract roles. I have been super on top of sorting listings by most recent and responding quickly due to how brutal things have been. Already having temps or previous FTEs lined up does make sense. There have definitely been months at a time where all the roles posted at big companies were already eliminated or filled internally.",
              "score": 2,
              "created_utc": "2026-02-23 22:18:23",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o718498",
                  "author": "Single_Vacation427",
                  "text": "They all do this.",
                  "score": 3,
                  "created_utc": "2026-02-23 22:28:50",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o711ski",
          "author": "Old_Cry1308",
          "text": "same crap with google contractors, multiple vendors, same jd, vanish after screen, hiring scene is terrible rn",
          "score": 9,
          "created_utc": "2026-02-23 21:57:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o716q17",
              "author": "br0monium",
              "text": "yeah google and meta have also been using more low quality recruiting, but none of them have found my retired parents mobile number and somehow connected it to me. I'm mostly wondering if these are scams or just so low quality that I shouldnt bother with them at all. Anything to narrow the scope in this job market.\n\nEDIT: i.e. Like im concerned to even reply to this particular guy now because that would just confirm that the number has some connection to me. It's like how if you answer spam calls, they call more even if you dont get scammed.",
              "score": 6,
              "created_utc": "2026-02-23 22:21:42",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7hfm6u",
                  "author": "muangalifu",
                  "text": "Meta too has the worst low quality indian recruiting companies that just flood your linked in within mins of the same day with the same req. Such trash.",
                  "score": 1,
                  "created_utc": "2026-02-26 08:49:28",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o735oub",
          "author": "patternpeeker",
          "text": "texting a family member crosses a line. that is either reckless sourcing or bad data practices. the multiple identical contract posts usually mean the req is sprayed to agencies while headcount is uncertain. in big orgs, roles can be “open” on paper but frozen in reality, so recruiters stall and disappear.",
          "score": 2,
          "created_utc": "2026-02-24 05:24:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o73lqcm",
          "author": "AccordingWeight6019",
          "text": "Honestly, this sounds less like a scam and more like messy vendor recruiting plus the pipeline farming. Big companies often open evergreen contract roles through multiple agencies at once, so recruiters race to source candidates even when headcount isn’t actually approved yet, which explains the ghosting. The family member contact is likely data broker scraping, and it’s a red flag for that specific recruiter, not necessarily the company itself.",
          "score": 2,
          "created_utc": "2026-02-24 07:40:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o740vzb",
          "author": "unimtur",
          "text": "honestly this tracks, the contract recruiting ecosystem is just broken at this point",
          "score": 2,
          "created_utc": "2026-02-24 10:04:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o760rkj",
          "author": "EndlessDysthymia",
          "text": "Are there any recruiting agencies that aren’t shit?",
          "score": 2,
          "created_utc": "2026-02-24 17:04:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o72jp52",
          "author": "datascientistdude",
          "text": "I work at Airbnb. We neither have a hiring freeze nor do we post ghost jobs. We certainly wouldn't go find info about your father. We have plenty of qualified applicants for every role. Our recruiters in general are very professional.\n\nEverything you've experienced suggests you've been interacting with shady third party recruiting firms, of which I know very little about.",
          "score": 4,
          "created_utc": "2026-02-24 02:56:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7110a0",
          "author": "emt139",
          "text": "Is this happening for FTE roles? Because I’ve had good experience with them for FTE roles but I get a ton of messages from offshore recruiters for contract roles. ",
          "score": 1,
          "created_utc": "2026-02-23 21:53:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o714u3x",
              "author": "br0monium",
              "text": "id have to double check, because I have applied for at least one FTE role there, but i dont remember if I got a similar run around and/or if i went through a recruiter.",
              "score": 0,
              "created_utc": "2026-02-23 22:12:14",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1raq00v",
      "title": "Roast my AB test analysis [A]",
      "subreddit": "datascience",
      "url": "https://www.reddit.com/r/datascience/comments/1raq00v/roast_my_ab_test_analysis_a/",
      "author": "SingerEast1469",
      "created_utc": "2026-02-21 12:31:50",
      "score": 14,
      "num_comments": 26,
      "upvote_ratio": 0.73,
      "text": "I have just finished up a sample analysis on an AB test dummy dataset, and would love feedback.\n\nThe dataset is from Udacity's AB Testing course. It tracks data on two landing page variations, treatment and control, with mean conversion rate as the defining metric.\n\nIn my analysis, I used an alpha of 0.05, a power of 0.8, and a practical significance level of 2%, meaning the conversion rate must see at least a 2% lift to justify the costs of implementation. The statistical methods I used were as follows:\n\n1. Two-proportions z-test\n2. Confidence interval\n3. Sign test\n4. Permutation test\n\nSee the results [here](https://oineaoifnaeofineqpinafasfaefeafefaefqw.com/). Thanks for any thoughts on inference and clarity.",
      "is_original_content": false,
      "link_flair_text": "Analysis",
      "permalink": "https://reddit.com/r/datascience/comments/1raq00v/roast_my_ab_test_analysis_a/",
      "domain": "self.datascience",
      "is_self": true,
      "comments": [
        {
          "id": "o6lcq5a",
          "author": "phoundlvr",
          "text": "Where to begin… so the confidence interval and two prop z are two sides of the same coin. One is testing a hypothesis, the other gives us a range for the true parameter. The math works out about the same. \n\nThe other two tests… I don’t get why you’d do them. Run one test. Never run multiple. You need a bonferroni correction for family-wise error… but if it’s the same response you get no benefit, real or perceived, from testing the same thing multiple times with different tests. Also, they’re non-parametric. If your data are binomially distributed with sufficient N, then you don’t want to run those tests. \n\nInstead of learning how to run tests and saying “roast me,” learn all the theory around statistical testing. If you can understand those concepts you’ll pass more interviews and be a better data scientist.",
          "score": 26,
          "created_utc": "2026-02-21 12:47:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6lq9e0",
              "author": "SingerEast1469",
              "text": "Thanks for the response. Ive read through ISLP back to front to learn statistics for machine learning, and have just cracked open Practical Statistics for Data Scientists. Any recommendations to learn AB testing fundamentals?\n\nNoted on CI and two proportions z test. That’s coming up in the text book.\n\nRe: running multiple tests — I hear what you’re saying about redundant tests. However, in dummy datasets, I have come across situations where multiple tests are useful; specifically, the sign test with a CI, in a situation where the CI points to an increase (though not statistically significant) and the sign test points to a decrease (though not statistically significant). \n\nRe: bonferroni correction, isn’t that primarily was for multiple variants? Do I need to correct when running multiple tests as well?",
              "score": 2,
              "created_utc": "2026-02-21 14:16:40",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6lttsw",
                  "author": "phoundlvr",
                  "text": "My recommendation is to get a degree in statistics to become an expert in this field. Using a non parametric test in binomially distributed data is a red flag. We aren’t just “running a test” there are rules based on the fundamentals of the Z and T distributions.\n\nAnytime you run a test you increase the probability of an error. If you run multiple tests and don’t make a bonferroni correction, then you are making a mistake. The correction is for multiple comparisons. Every time you run a test, it’s an additional comparison. Tests should be pre-determined, otherwise you dive into this world where you’re hunting for an outcome that fits your narrative. There are mathematical proofs behind all of this - it’s not up for debate. \n\nFor you, I would start with the fundamentals of the Z and T tests. The assumptions, when to use one vs the other, and when we can’t use either. Then I’d learn ANOVA. If you can handle multivariate calc, you should understand the derivation of these tests. \n\nAfter that, running the test is really easy. It becomes understanding the business or academic problem to successfully A/B test.",
                  "score": 5,
                  "created_utc": "2026-02-21 14:37:40",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6xsuyw",
          "author": "MorriceGeorge",
          "text": "Four statistical tests for a basic two-variant conversion experiment feels less like rigour and more like overcompensation. For a standard A/B test with binary outcomes and a reasonable sample size, a two-proportions z-test and a confidence interval are usually enough to make the decision. A permutation test can be a nice robustness check, but the sign test especially feels unnecessary unless you clearly justify what additional question it’s answering.\n\nYou mention alpha, power, and a 2% practical significance threshold, which is good, but the important part is whether those numbers actually drive your conclusions. Was the sample size calculated based on that 2% lift? Is that lift absolute or relative? And in your write-up, does the business decision hinge on exceeding that threshold, or does it default back to p-values?\n\nThe bigger issue is narrative clarity. If someone has to read through multiple test results to understand whether the treatment should ship, the analysis is doing too much and saying too little. Strong A/B analysis is less about stacking methods and more about clearly linking effect size, uncertainty, and business impact. Right now it doesn't feel like a decision-making framework.",
          "score": 3,
          "created_utc": "2026-02-23 12:06:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6xybbp",
              "author": "SingerEast1469",
              "text": "This is great advice. Thank you! I am learning all of these methods from scratch so the tendency is to try out as many as possible; I can say it’s for robustness by the underlying reason is definitely more akin to overcompensation.\n\nWith regards to your questions:\n- the sample size was derived from a dummy dataset. I’ve done some practice calculating minimum required sample size, but it wasn’t necessary to include in this analysis.\n- 2% lift is absolute. Relative lift is around ~15%. The executive summary has a somewhat complex but informative gauge chart that shows how the data performed relative to what would be needed to pass the practical significance threshold.\n- from this, I actually have a question: why do we even do statistical tests if practical significance is the threshold for implementation? It seems that setting cohen’s d generally results in more stringent requirements. Why even test for statistical significance at all?\n- for narrative clarity, I would be curious what your thoughts would be after seeing the dashboard! If you haven’t already. I have an executive summary that details all four tests fairly clearly, four pages that go into each in depth, and then one page that delivers the final recommendation.\n\nAgain, thanks for your comment! If you do feel like checking it out (and haven’t already), I’ve just created an account with credentials “user” and “password” for easy log in.",
              "score": 1,
              "created_utc": "2026-02-23 12:46:37",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6nrpdd",
          "author": "Greedy_Bar6676",
          "text": "I can’t access this from my phone but from the four points you listed out, it seems like you did a couple of different statistical tests rather than an A/B test analysis",
          "score": 2,
          "created_utc": "2026-02-21 20:33:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6xx1l5",
              "author": "SingerEast1469",
              "text": "Hmm, I’ve been hearing a lot of this. The goal of using the multiple tests was for rigor - I’ve seen in my learning (just in dummy datasets, but seen nonetheless) that sometimes test 1 can show statistical significance, while test 2 does not. I aligned on my requirements before running the data that all 4/4 tests would need to pass to deliver a hypothetical recommendation to proceed with implementation. Is this frowned upon in A/B Testing? \n\nAlso. what do you mean by “I didn’t do an A/B Test analysis” ? There is a written executive summary, text that explains each test with assumptions, and an analytical paragraph that details the recommendation and reasons behind it. Is there something else I am missing?",
              "score": 1,
              "created_utc": "2026-02-23 12:37:43",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6yke70",
                  "author": "Greedy_Bar6676",
                  "text": "Again, can’t access the full report. \n\nRunning multiple tests is not rigorous, you should just run the correct one and make sure that your experiment is powered",
                  "score": 3,
                  "created_utc": "2026-02-23 14:54:35",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6twusg",
          "author": "jeremymiles",
          "text": "Page asks me to log in.",
          "score": 2,
          "created_utc": "2026-02-22 20:02:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6tx0jo",
              "author": "SingerEast1469",
              "text": "Yes, you can create an account if you’d like to see the dashboard! No emails. Passwords can be anything and are hashed.",
              "score": 0,
              "created_utc": "2026-02-22 20:03:38",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6u7351",
                  "author": "jeremymiles",
                  "text": "Why not just make it public? You're asking for a favor, and you're putting a barrier in the way of someone who wants to do you a favor!",
                  "score": 3,
                  "created_utc": "2026-02-22 20:54:51",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o75odfr",
          "author": "Saucy_sklz",
          "text": "Bro stop rage baiting and use an LLM if you truly are trying to learn and conduct better analyses. Your mentality of “roast” or “destroy” your analysis comes off as lazy and is manufactured for engagement. Not sure what your goal is here but learning is clearly not it.",
          "score": 2,
          "created_utc": "2026-02-24 16:09:19",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1reqajk",
      "title": "Where should Business Logic live in a Data Solution?",
      "subreddit": "datascience",
      "url": "https://leszekmichalak.substack.com/p/where-should-business-logic-live",
      "author": "Astherol",
      "created_utc": "2026-02-25 21:21:11",
      "score": 13,
      "num_comments": 5,
      "upvote_ratio": 0.88,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/datascience/comments/1reqajk/where_should_business_logic_live_in_a_data/",
      "domain": "leszekmichalak.substack.com",
      "is_self": false,
      "comments": [
        {
          "id": "o7egjby",
          "author": "chicky-poo-pee-paw",
          "text": "I don’t think those two words go together",
          "score": 8,
          "created_utc": "2026-02-25 21:30:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7ehinf",
              "author": "Astherol",
              "text": "But why?",
              "score": 2,
              "created_utc": "2026-02-25 21:35:13",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7ejdiz",
                  "author": "Satanwearsflipflops",
                  "text": "This exchange feeds my soul",
                  "score": 6,
                  "created_utc": "2026-02-25 21:43:48",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7gyofm",
          "author": "MorriceGeorge",
          "text": "Business logic in a data solution should live as close as possible to the layer that owns the business meaning, which is typically in the transformation layer of the data platform. \n\nIn modern architectures, this means encoding business rule inside curated, version-controlled data models. \n\nIt should not live in BI dashboards where it becomes duplicated, inconsistent, and hard to govern.",
          "score": 1,
          "created_utc": "2026-02-26 06:16:43",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r9hd8e",
      "title": "Does anyone have good recommendations for learning AI/LLM engineering with Typescript?",
      "subreddit": "datascience",
      "url": "https://www.reddit.com/r/datascience/comments/1r9hd8e/does_anyone_have_good_recommendations_for/",
      "author": "Illustrious-Pound266",
      "created_utc": "2026-02-20 01:06:45",
      "score": 10,
      "num_comments": 4,
      "upvote_ratio": 0.81,
      "text": "Hi. I am looking for some resources on learning AI engineering with Typescript. Does anyone have any good recommendations? I know there are some Typescript tutorials for a few widely used packages like OpenAI SDK and Langchain, but I wanted something a bit more comprehensive that is not specific library-focused.\n\nAny input would be appreciated, thank you!",
      "is_original_content": false,
      "link_flair_text": "Education",
      "permalink": "https://reddit.com/r/datascience/comments/1r9hd8e/does_anyone_have_good_recommendations_for/",
      "domain": "self.datascience",
      "is_self": true,
      "comments": [
        {
          "id": "o6cpw78",
          "author": "Amphaboss",
          "text": "In this day and age, the best way is probably just to learn by doing. Start with an app idea or some sort of project you want to build. Use a platform like Vercel, Loveable, or Google AI Studio to generate the app, then work your way backward through the codebase and try to understand why each decision was made. You can use AI to ask why everything was done the way it is. Not only will you come out of this having a better understanding of TypeScript and app workflow, you might also have an app idea that's something you can put on your resume.",
          "score": 3,
          "created_utc": "2026-02-20 02:23:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6dutny",
          "author": "patternpeeker",
          "text": "i would focus on production llm patterns, not typescript itself. the hard part is evals, state, and controlling model output. ts is mostly glue around that.",
          "score": 2,
          "created_utc": "2026-02-20 07:28:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6pxfri",
          "author": "Separate_Ad_8665",
          "text": "Don’t learn LangChain. Learn how LLMs actually work in production: context windows, token limits, retrieval, evals, latency, cost. TS is just glue code. The real skill is system design around LLM constraints.",
          "score": 1,
          "created_utc": "2026-02-22 04:27:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6yutlu",
          "author": "United-Stress-1343",
          "text": "It depends on the depth you want to go in this matter. You could go as deep as learning how transformers work (the architectural part), and building your own using tensors, or you could just use OpenAI's SDK and start from there. \n\nMy recommendation: get the fundamentals right (not so deep as building your own LLM) but you should hav some notion about what tokens are, the non-deterministic aspect of it, and so on. Then the best thing to do is start building small projects that just use text-based LLMs, then add tool calling (but do it yourself before using a package), then add multi agent systems, and so on. It's pretty fun! ",
          "score": 1,
          "created_utc": "2026-02-23 15:46:15",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rb905h",
      "title": "Data Catalog Tool - Sanity Check",
      "subreddit": "datascience",
      "url": "/r/analytics/comments/1rb8zqj/data_catalog_tool_sanity_check/",
      "author": "FirCoat",
      "created_utc": "2026-02-22 01:46:26",
      "score": 7,
      "num_comments": 2,
      "upvote_ratio": 0.9,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/datascience/comments/1rb905h/data_catalog_tool_sanity_check/",
      "domain": "",
      "is_self": false,
      "comments": []
    }
  ]
}