{
  "metadata": {
    "last_updated": "2026-03-02 09:15:17",
    "time_filter": "week",
    "subreddit": "datascience",
    "total_items": 14,
    "total_comments": 210,
    "file_size_bytes": 223909
  },
  "items": [
    {
      "id": "1rfiojy",
      "title": "My experience after final round interviews at 3 tech companies",
      "subreddit": "datascience",
      "url": "https://www.reddit.com/r/datascience/comments/1rfiojy/my_experience_after_final_round_interviews_at_3/",
      "author": "productanalyst9",
      "created_utc": "2026-02-26 18:48:12",
      "score": 189,
      "num_comments": 35,
      "upvote_ratio": 0.98,
      "text": "Hey folks, this is an update from my previous post ([here](https://www.reddit.com/r/datascience/comments/1qt2hhe/my_thoughts_on_my_recent_interview_experiences_in/)). You might also remember me for my previous posts about how to pass product analytics interviews in tech, and how to pass AB testing/Experimentation interviews. For context, I was laid off last year, took \\~7 months off, and started applying for jobs on Jan 1 this year. I've since completed final round interviews at 3 tech companies and am waiting on offers. The types of roles I applied for were product analytics roles, so the titles are like: Data Scientist, Analytics or Product Data Scientist or Data Scientist, Product Analytics. These are not ML or research roles. I was targeting senior/staff level roles.\n\n  \nI'm just going to talk about the final round interviews here since my previous post covered what the tech screens were like.\n\n  \n**MAANG company:**\n\n4 rounds:\n\n* 1 in depth SQL round. The questions were a bit more ambiguous. For example, instead of asking you to calculate Revenue per year and YoY percent change in revenue, they would ask something like \"How would you determine if the business is doing well?\" Or instead of asking you to calculate the % of customers that made a repeat purchase in the last 30 days, they would ask \"How would you decide if customers are coming back or not?\"\n* 1 round focused more on stats and probability. This was a product case interview (e.g. This metric is going down, why do you think that is?)  with stats sprinkled in. If you asked them the right questions, they would give you some more data and information and ask you to calculate the probability of something happening\n* 1 round focused purely on product case study. E.g. We are thinking of launching this new feature, how would you figure out if it's a good idea? Or we launched this new product, how would you measure it's success?\n   * I didn't have to go super deep into technical measurement details. It was more about defining what success means and coming up with metrics to measure success\n* 1 round focused on behavioral. I was asked examples of projects where I influenced cross-functionally and about how I use AI.\n\nAll rounds were conducted by data scientists. I ended up getting an offer here but I just found out, so I don't have any hard numbers yet.\n\n  \n**Public SaaS company** (not MAANG):\n\n4 rounds:\n\n* 1 round where they gave me some charts and asked me to tell them any insights I saw. Then they gave me some data and I was asked to use that data to dig into why the original chart they showed me had some dips and spikes. I ended up creating some visualizations, cohorted by different segmentations (e.g. customer type, plan type, etc.)\n* 1 round where they asked me about a project that I drove end-to-end, and they asked me a bunch of questions about that one project. They also asked me to reflect on how I could have improved it or done better if I could do it again\n* 1 round focused on product case study. It was basically \"we are thinking of launching this new product, how would you measure success?\". This one got deeper into experimentation and causal inference\n* 1 round focused on behavioral. This one was surprising because they didn't ask me any \"tell me about a time\" questions. I was asked to walk through my resume, starting from the first job that I had listed on there. They did ask me why I was interested in the company and what I was looking for next. It seemed like they were mostly assessing whether I'd be a good fit from a behavioral standpoint, and whether I would be at risk of leaving soon after joining. This was the only interview conducted by someone other than a data scientist.\n\nHaven't heard back from this place yet.\n\n  \n**Private FinTech company:**\n\n4 rounds\n\n* 1 round focused on stats. It was a product case study about \"hey this metric is going down, how would you approach this\", but as the interview went on, they would reveal more information. I was shown output from linear and logistic regression and asked to interpret it, explain the caveats, how I would explain the results to non-technical stakeholders, and how I would improve the regression analyses. To be honest, since I hadn't worked for several months, I am a bit rusty on logistic regression so I didn't remember how to interpret log odds. I was also shown some charts and asked to extract any insights, as well as how would I improve the chart visually. I was also briefly asked about causal inference techniques. This interview took a lot of time because there were so many questions that they asked. They went super deep into the case study, usually my other case study interviews were at a more superficial level.\n* 1 round with a cross-functional partner. It was part case study (we are thinking of investing in building this new feature, how would you determine if it's worth the investment), part asking about my background.\n* 1 round with a hiring manager. I was asked about my resume, how I like to work, and a brief case study\n* 1 round with a cross-functional partner. This was more behavioral, typical \"tell me about a time\" question. \n\nHaven't heard back from this place yet.\n\n  \n**Overall thoughts**\n\nThe MAANG interview was the easiest, I think because there are just so many resources and anecdotes online that I knew pretty much what to expect. The other two companies had far fewer resources online so I didn't know what to expect. I also think general product case study questions are very \"crackable\". I am going to make another post on how I prepared for case study interview questions and provide a framework for the 5 most common types of case study questions. It's literally just a formula that you can follow. Companies are starting to ask about AI usage, which I was not prepared for. But after I was asked about AI usage once, I prepared a story and was much better prepared the next time I was asked about how I use AI. The hardest interview for me was definitely the interview where they went deep into linear/logistic regression and causal inference (fixed effects, instrumental variables), primarily because I've been out of work for so long and hadn't looked at any regression output in months. \n\n\n\nAnyways, just thought I'd share my experiences for those who having upcoming interviews in tech for product analytics roles in case it's helpful. If there's interest, I'll make another post with all the offers I get and the numbers (hopefully I get more than one). What I can say is that comp is down across the board. The recruiters shared rough ranges (see my previous post for the ranges), and they are less than what I made 2-3 years ago, despite targeting one level up from where I was before. \n\nWhenever I make these posts, I usually get a lot of questions about how I get interviews....I am sorry, but I really don't have much advice for how to get interviews. I am lucky enough to already have had a big name tech company on my resume, which I'm sure is how I get call backs from recruiters. Of the 3 final rounds that I had, 2 were from a recruiter reaching out on Linkedin and 1 was from a referral. I did have initial recruiter screens and tech screens from my cold applications, but I didn't end up getting final rounds from those. Good luck to everyone looking for jobs and I hope this helps. ",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/datascience/comments/1rfiojy/my_experience_after_final_round_interviews_at_3/",
      "domain": "self.datascience",
      "is_self": true,
      "comments": [
        {
          "id": "o7klp6f",
          "author": "Free-Adhesiveness910",
          "text": "I guess the first one is Meta. Levels FYI filter new offers for comp",
          "score": 20,
          "created_utc": "2026-02-26 19:48:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7l2rcd",
              "author": "PM_YOUR_ECON_HOMEWRK",
              "text": "Note that Meta decreased their comp bands for Product DS roles in the past 6 months or so. You should anchor much more strongly on more recent offers, though keep in mind that some people post their salary a year+ after starting, so it can be hard to evaluate",
              "score": 12,
              "created_utc": "2026-02-26 21:10:27",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7kun5a",
          "author": "208lostinseattle",
          "text": "Thank you for this perspective. I'm currently going through a similar interview process in MAANG. I would love to understand more about the depth of questions in the Stats & Probability section. Any tips on where I should focus my study/refresh approach? I have exposure to these topics, but I am anxious on the specific calculations. \n\nCongratulations on the offer!",
          "score": 11,
          "created_utc": "2026-02-26 20:31:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7l3aeo",
              "author": "productanalyst9",
              "text": "Which MAANG? For example, I know that Google goes into more depth for stats and probability than Meta",
              "score": 7,
              "created_utc": "2026-02-26 21:12:56",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o7l4iqk",
              "author": "RobertWF_47",
              "text": "Also interested in the stats & probability questions. If you're analyzing the causes behind a metric change I imagine this would be a causal inference problem.",
              "score": 3,
              "created_utc": "2026-02-26 21:18:43",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7rzran",
                  "author": "productanalyst9",
                  "text": "For sure I was asked about causal inference a bit. But when I was asked about \"causes behind a metric change\", it would be higher level than that. I think they're looking for signals that you can think in a structured way.\n\nFor example, you might be asked \"Churn has increased in the last 2 months. What do you do?\" This is not yet a causal inference problem. First step would be to rule out seasonality and instrumentation/logging changes. Second step would be to clarify whether this is customer/lgo churn, revenue churn, or both. Third step would be to decompose the metric: Did we have the same number of customers acquired and now they're churning at a higher rate? Or did the # of customers we acquired increase, and perhaps we are acquiring customer with lower intent so they churn more quickly? Fourth step would be to do some segmentation such as: New users vs. existing, power users vs. casual, segment by geography, platform, etc. This can give you clues into where the churn is coming from.\n\n  \nFor the companies that I interviewed at, it would not be a good answer to say that you'd run a logistic regression to predict churn and throw a bunch of variables in there and see which variables have the largest coefficients and lowest p-values. This is not structured thinking.",
                  "score": 10,
                  "created_utc": "2026-02-27 21:59:43",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7o2yrb",
          "author": "AccordingWeight6019",
          "text": "Really appreciate how transparently you broke this down. it highlights that senior product analytics interviews are much less about fancy models and much more about structured thinking, product intuition, and communication under ambiguity. Also interesting that the hardest rounds were the deep statistical discussions rather than coding,  feels like companies are testing judgment more than memorization now. Thanks for sharing this level of detail, it’s genuinely useful signal for people preparing.",
          "score": 6,
          "created_utc": "2026-02-27 08:25:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7owzvm",
          "author": "Statement_Next",
          "text": "I’ll never pass an interview like that. Time to go back to college for social work or something.",
          "score": 4,
          "created_utc": "2026-02-27 12:43:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7p3kaq",
          "author": "seo-nerd-3000",
          "text": "Thanks for sharing the details, these kinds of breakdowns are way more useful than the generic interview prep advice that gets recycled everywhere. The reality of data science interviews is that every company does it differently and the variance between what they test is enormous. One company wants you to whiteboard SQL joins, another wants a take-home project analyzing a real dataset, and a third wants you to explain how you would build an ML pipeline for a business problem you have never seen before. The best prep is practicing all three formats because you never know what you are walking into.",
          "score": 2,
          "created_utc": "2026-02-27 13:24:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7kqe8t",
          "author": "Altruistic_Look_7868",
          "text": "Where r u located?",
          "score": 1,
          "created_utc": "2026-02-26 20:11:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7l4ocl",
              "author": "productanalyst9",
              "text": "HCOL city in the US",
              "score": 2,
              "created_utc": "2026-02-26 21:19:28",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7ktf2e",
          "author": "footiebuns",
          "text": "Any thoughts about the number of interviews and how they are organized? Do you think they are a good measure of your fit with the company and your skill set? Do you find them excessive?\n\nFor context, I have worked jobs in different sectors and have only ever needed 2 interviews (including the recruiter screen call) to land jobs. I'm constantly shocked and perplexed by the multi-round interview structure and intense coding homework projects given to applicants in industry and tech.",
          "score": 1,
          "created_utc": "2026-02-26 20:25:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7l3rg4",
              "author": "productanalyst9",
              "text": "As a candidate, I do think the number of interviews are excessive, and I hate take home assignments. But I do think it requires multiple interviews to assess proficiency with 1. Coding 2. Stats/probability 3. Analytical thinking 4. Product/strategy sense 5. Behavioral/cultural fit\n\nI’m sure there’s a better way to do it. But also, these large tech companies pay so much that they can sort of do whatever they want…people will jump through the hoops for the chance to work there (like me)",
              "score": 8,
              "created_utc": "2026-02-26 21:15:09",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7nu7m0",
                  "author": "DNA1987",
                  "text": "They should pay people for take home assignments. I have donne many take home the last few years some of them are real problems the team is trying to solve not just simple case study to evaluate your skills and can take up to a full-time week to solve, it is basically free labor",
                  "score": 0,
                  "created_utc": "2026-02-27 07:06:31",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o7kwhks",
              "author": "BlackPlasmaX",
              "text": "Yeah, some of my best work was modeling and outside of sql coding challenges as technicals/quizzes. To me they just reek of a high volume but low quality recruiting methodology. I think you can show tables or talk conversationally about sql, like pros/cons of using certain functions in certain situations to guage if someone has worked with sql before or if they lied and put it on there resume for the sake lf it. \n\nIf the hm cannot tell there sql level after a conversation like that, then but sorry that hm is just a dipshit.",
              "score": 2,
              "created_utc": "2026-02-26 20:40:47",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7kxwqi",
          "author": "RollData-ai",
          "text": "I would imagine the fact that \"there are just so many resources and anecdotes online\" to get ready for MAANG interviews would mean that the standard would be insanely high though. Is that not your experience?",
          "score": 1,
          "created_utc": "2026-02-26 20:47:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7l4mg2",
              "author": "productanalyst9",
              "text": "Sure, I think the standard is high. My thoughts on this are:\n- I could be wrong, but I don’t think big MAANG companies are scoring on a bell curve. If you clear their bar then you get an offer\n- I don’t think every candidate takes advantages of all the resources out there. Having been the interviewer at a large tech company that had a bunch of resources and anecdotes about the interview process, it was pretty obvious to me which candidates studied those resources and which didn’t \n\nInterviews are going to be hard for most people no matter what, regardless of whether there are resources online or not. At least for me, I’d rather know what to expect, even if it means all the other candidates also have the opportunity to find out what to expect",
              "score": 6,
              "created_utc": "2026-02-26 21:19:12",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7z75vx",
                  "author": "Outside_Reason6707",
                  "text": "Can you please share what resources are you really mentioning about here?",
                  "score": 2,
                  "created_utc": "2026-03-01 01:17:19",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7lgk05",
          "author": "madaboutyou3",
          "text": "Can you give us some examples of \"the right questions to ask\" in the stats and probability rounds? Perhaps some of the resources you used to prepare would be cool too.",
          "score": 1,
          "created_utc": "2026-02-26 22:16:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7mdjr6",
          "author": "zhivix",
          "text": "question, if i had little to none resources, how can i prepare myself for the interviews, especially when dealing with the technicals",
          "score": 1,
          "created_utc": "2026-02-27 01:15:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7mofor",
              "author": "productanalyst9",
              "text": "What do you mean by little to no resources? I think you can find everything you need for free online",
              "score": 1,
              "created_utc": "2026-02-27 02:19:05",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7qhfm3",
          "author": "ajmh1234",
          "text": "Thanks for sharing this information. I am trying to make the transition from being a data engineer to data science and this has given me a lot of confidence that ill find something :) ",
          "score": 1,
          "created_utc": "2026-02-27 17:33:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7s8kqn",
          "author": "lifeinsidethebox",
          "text": "Out of curiosity, when they asked you about your use of ai, what kind of direction did you feel they wanted you to answer in? For example do you think they were wanting you to talk about using it for everything, nothing or somewhere in between. And what was your answer?",
          "score": 1,
          "created_utc": "2026-02-27 22:46:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7si321",
          "author": "seo-nerd-3000",
          "text": "Getting to the final round at three tech companies simultaneously shows that your fundamentals are solid and you are interviewing well enough to beat out the majority of candidates. The final round rejection stings the most because you invested the most time and emotional energy but it often comes down to factors completely outside your control like internal candidates, team chemistry, budget freezes, or another candidate having slightly more domain-specific experience. The biggest takeaway from these experiences should be what questions caught you off guard and what areas you felt least confident in because those are your highest leverage areas for improvement. Keep going because making it to final rounds consistently means an offer is just a matter of time.",
          "score": 1,
          "created_utc": "2026-02-27 23:40:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ssrsq",
          "author": "Ghost-Rider_117",
          "text": "this is gold, thanks for sharing. the part about the FinTech interview going super deep on causal inference / fixed effects is real - a lot of product DS interviews at non-MAANG companies are way more stats-heavy than people expect. definitely worth brushing up on regression interpretation, not just SQL. good luck on the offers!",
          "score": 1,
          "created_utc": "2026-02-28 00:42:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ul8dm",
          "author": "No-Introduction840",
          "text": "Thank you for the detail insight! How do you focus on what to prep for? I have 4 tech screens coming up and each has a different flavor. One has even asked for DSA/OOPs concept in python 😭. I feel I have a huge gap but I also don’t want to screw up. I’ve got calls from some really good companies.",
          "score": 1,
          "created_utc": "2026-02-28 08:32:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7wbwk2",
          "author": "Express_Language_715",
          "text": "nice",
          "score": 1,
          "created_utc": "2026-02-28 16:04:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7z7lxt",
          "author": "jayeshrathore",
          "text": "Agree with the point that companies like with more content online are much easier to crack. Companies should standardize the interview process across roles and collaborate with content creators to make more content about the process in general. Knowing what to expect really helps in limiting the scope from potentially infinite to more targeted.",
          "score": 1,
          "created_utc": "2026-03-01 01:20:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7kpgf6",
          "author": "Saitamagasaki",
          "text": "Why is it so difficult",
          "score": -2,
          "created_utc": "2026-02-26 20:06:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7kxw43",
              "author": "JuicyPheasant",
              "text": "Because they pay you a lot of money",
              "score": 20,
              "created_utc": "2026-02-26 20:47:28",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7pd7ad",
          "author": "kartikey7734",
          "text": "This is an excellent breakdown and I appreciate the transparency. A few meta-observations:\n\n\n\n\\*\\*On the interviews themselves:\\*\\*\n\n\n\nYour observation about MAANG being the \"easiest\" tracks an important trend: they've systematized their interview process SO much that it's almost plug-and-play. Fewer curve balls = higher predictability = more competition.\n\n\n\nThe public SaaS and FinTech companies? They're still figuring it out. That's actually a good sign they're growing fast. Bad sign for candidates preparing, though.\n\n\n\n\\*\\*The real insight here:\\*\\*\n\n\n\n\"Product case > behavioral > stats\" is becoming a universal trend. Companies realized pure stats/coding tests don't predict job performance as well as \"can you think like someone who actually works here?\"\n\n\n\nYour stats regression interview feedback was brutal but honest. That's the kind of company that will actually train you well because they know what gaps exist.\n\n\n\n\\*\\*On the salary comment:\\*\\*\n\n\n\nYou're right that comp is down YoY. But here's what nobody mentions: the \\*quality of roles\\* changed. Senior/Staff level roles are thinner. Companies are hiring more mid-level roles. That's why the numbers look worse.\n\n\n\nTwo-year delta: if you get Senior title at 2026 rates, you're actually in a BETTER position than someone who got Senior title at 2022 rates (lower bar to clear).\n\n\n\n\\*\\*One thing you might add to your next post:\\*\\*\n\nWhich of these interviews felt like they'd genuinely let you grow? That's often MORE important than comp, especially if you're 0-3 YOE.\n\n\n\nGreat effort documenting this. Honestly, your detailed interview breakdown is more valuable than most \"blind\" posts.",
          "score": -4,
          "created_utc": "2026-02-27 14:18:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o86ie3y",
              "author": "gtfomysidewalk",
              "text": "Get this slop outta here",
              "score": 1,
              "created_utc": "2026-03-02 05:08:33",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7ucusj",
          "author": "Typhon_Vex",
          "text": "You guys call this datascience here ? Lol",
          "score": -4,
          "created_utc": "2026-02-28 07:15:50",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rdluhe",
      "title": "what changed between my failed interviews and the one that got me an offer",
      "subreddit": "datascience",
      "url": "https://www.reddit.com/r/datascience/comments/1rdluhe/what_changed_between_my_failed_interviews_and_the/",
      "author": "warmeggnog",
      "created_utc": "2026-02-24 17:02:12",
      "score": 140,
      "num_comments": 29,
      "upvote_ratio": 0.93,
      "text": "i went through a pretty rough interview cycle last year applying to data analyst / data scientist roles (mostly around nyc). made it to final rounds a few times, but still got rejected.\n\ni finally landed an offer a few months ago, and thought i’d just share what changed and might guide others going through the same thing right now:\n\n* **stopped treating sql rounds like coding tests.** i think this mindset is hard to change if you’re used to just grinding leetcode. so you just focus on getting the correct query and stop talking when it runs. but what really matters imo is mentioning assumptions, edge cases, tradeoffs, and performance considerations (esp. for large tables).\n* **practiced structured frameworks for product questions**. these were usually the qs i didn’t perform well in, since i would panic when asked how to measure engagement or explain why retention dropped. but a simple flow like goal and user segment → 2-3 proposed metrics → trade-offs → how i’d validate, helped organize my thoughts in the moment.\n* **focused more on explaining my thinking, not impressing**. i guess this is more of a mindset thing, but in early interviews i would always try to prove i was smart. but there’s a shift when you focus more on being clear and structured and showing how you perform on a real team/with stakeholders/partners.\n\nso essentially for me the breakthrough wasn’t just to learn another tool or grind more questions. though i’m no longer interviewing for data roles, i’d love to hear other successful candidate experiences. might help those looking for tips or even just encouragement on this sub! :)",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/datascience/comments/1rdluhe/what_changed_between_my_failed_interviews_and_the/",
      "domain": "self.datascience",
      "is_self": true,
      "comments": [
        {
          "id": "o768lb0",
          "author": "prattman333",
          "text": "Probably nailed behavioral questions and storytelling around your projects the second time - interviewers care more about how you communicate insights than perfect code now. I bombed early interviews on stats trivia but got offers once I focused on explaining my notebook like a business case.",
          "score": 59,
          "created_utc": "2026-02-24 17:40:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o79r43c",
              "author": "warmeggnog",
              "text": "yep, totally agree on the business case aspect! also helps avoid getting lost in your thoughts with complex jargon/metrics, since the goal is to simplify your language and ensure even non-technical partners/stakeholders understand it.",
              "score": 5,
              "created_utc": "2026-02-25 04:25:49",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o761i0v",
          "author": "Holiday_Lie_9435",
          "text": "I’m still in the middle of applying for data roles and appreciate you sharing this. Definitely validated some of my struggles (mostly as a self-learner, LOL) like getting caught up with the Leetcode mindset with SQL and focusing too much on getting the query right, so I panic when it comes to follow-ups. Same with product questions, I’ve previously gotten tips on which frameworks/structure to use, but I’ll also try to apply your advice here.\n\nI think what’s been helping me lately get out of that more ‘technical’ mindset is practicing more realistic prompts instead. I still do SQL drills on LC and StrataScratch since they have lots of practice questions, but I also look for product prompts/case studies on sites like Interview Query since they’re more detailed and have breakdowns. Still no offer yet on my end, but posts like this really encourage me and remind me I know enough, just need to keep practicing to improve how I think and communicate.",
          "score": 16,
          "created_utc": "2026-02-24 17:08:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o79rql2",
              "author": "warmeggnog",
              "text": "the leetcode trap is very real, unfortunately. you really have to let go of that perfectionist mindset and focus more on your reasoning and articulation. for product questions, it also helps to think from a non-technical perspective to break down the problem in more manageable, simpler chunks. in my mocks there was always a prompt like, how you'd explain it to someone who doesn't know much about data analysis but needs to understand the value from your insights/recommendations. also helps to read company news and product announcements regularly to get a feel of how they structure their product decisions, which metrics to prioritize, etc!",
              "score": 3,
              "created_utc": "2026-02-25 04:30:04",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o76azbq",
          "author": "fordat1",
          "text": ">focused more on explaining my thinking, not impressing.\n\nAs someone who has been on the interviewer side \"explaining your thinking\" is the point of the exercise. If you just without a word give the 100% correct answer you arent impressing almost any interviewer except the one who ignored training.\n\nThe point of the exercises are all to understand your thinking",
          "score": 10,
          "created_utc": "2026-02-24 17:51:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7a8yjz",
              "author": "Jess_than_three",
              "text": "Meanwhile, admittedly anecdotally, I got hired some years back from an interview where I was asked \"Okay, how would you, in SQL, do X?\", and completely missing a group by clause - but I talked through my thinking as I answered, admitted \"I'm not sure I've got the exact syntax right for this, so I would probably do a quick Google search to verify that\", and showed that while I might not have the answer in 3.2 seconds off the top of my head, I could reason through a problem, AND explain my thinking.\n\nTotally agree with all of this.",
              "score": 3,
              "created_utc": "2026-02-25 06:40:32",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o7d10lf",
              "author": "warmeggnog",
              "text": "very true, i think candidates (me included, LOL) sometimes forget interviewers already know what you're talking about, so they want to know more about how you got there than just your answer by itself. as simple as it sounds, what really helps hone this skill (and instinct, i'd say) is just keep talking to myself out loud when doing my technical prep. made me more comfortable articulating my reasoning during the actual interview, and remembering to mention edge cases or any assumptions.",
              "score": 4,
              "created_utc": "2026-02-25 17:34:21",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o76n4bg",
          "author": "watson__387",
          "text": "Explain your thinking! So good to see you say that. I was sure I bombed an interview when I blanked on how to calculate a median in SQL. I talked through it and basically said \"Here's where I would use it... right after I search how to do it\". I got the job.",
          "score": 6,
          "created_utc": "2026-02-24 18:44:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7a3rva",
          "author": "Starktony11",
          "text": "You forgot to mention one of the most important thing that changed, “Luck” trust me it is the most important factor. You could do all right and if interviewer is having a bad day he will say no for a small mistake, or role might get closed, or competitor was just a unicorn for the role, or they just went with internally",
          "score": 5,
          "created_utc": "2026-02-25 05:57:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o78zxyx",
          "author": "Intelligent-Past1633",
          "text": "That's so true about the SQL rounds, it's not just about getting the right answer but showing you understand the \\*implications\\* of your query on a real system, like how a complex join could tank performance on a massive table.",
          "score": 4,
          "created_utc": "2026-02-25 01:46:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o795zu8",
          "author": "PliablePotato",
          "text": "Being on the interviewer side I think you discovered some very important lessons. \n\nYour thought process, problem solving ability, business acumen and even genuine curiosity/interest in the problem is often times more important than raw technical skill. Understanding the core competencies are of course important, but it's not what makes you stand out.\n\n9/10 times I would rather have someone that can work through and solve a complex problem by breaking it down and communicate clearly than some technical wizard who whips up a solution but can't explain their approach or how the results can be used.\n\nThe best models, analyses, metrics etc. mean nothing if they can't help inform better decision making.",
          "score": 3,
          "created_utc": "2026-02-25 02:20:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7aa2g5",
          "author": "ManufacturerWeird161",
          "text": "Completely agree on the SQL part. I started explaining my logic and mentioning potential edge cases like nulls or dupes, and it completely changed the dynamic with the interviewer.",
          "score": 4,
          "created_utc": "2026-02-25 06:50:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7dbd9c",
              "author": "HappyTrainwreck",
              "text": "can you expand more on this? \nand did you actually get the correct answer or just kind of explained how you’d get here?",
              "score": 1,
              "created_utc": "2026-02-25 18:20:39",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7c3h1r",
          "author": "AccordingWeight6019",
          "text": "This really highlights how interviews are less about having the perfect answer and more about showing how you think in real time. The shift from solving quietly to treating it like a collaborative discussion sounds small, but honestly feels like a huge mindset change. Appreciate you sharing this,  probably reassuring for a lot of people still stuck in that tough interview cycle.",
          "score": 5,
          "created_utc": "2026-02-25 14:59:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o76aijh",
          "author": "qc1324",
          "text": "Curious about your prior experience/ number of applications / networking?",
          "score": 3,
          "created_utc": "2026-02-24 17:49:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o79wkd3",
          "author": "joerangutang",
          "text": "i’m two semesters into my DS masters. It is interesting how our classes almost never focus on the code, but on the thinking, like you are describing. But our career coaches focus very much on learning the code, but also on the storytelling.",
          "score": 3,
          "created_utc": "2026-02-25 05:03:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7a82qi",
          "author": "RecognitionSignal425",
          "text": "Basically, share your voice, not to prove your voice. The moment you need to prove something, you get anxiety and lost ",
          "score": 3,
          "created_utc": "2026-02-25 06:33:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7b6ghp",
          "author": "tongEntong",
          "text": "So consultant communication style. Insert those tech jargons and confuse(impress) the heck out of your vocabularies range. It always works man 😆",
          "score": 3,
          "created_utc": "2026-02-25 11:42:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o76evs0",
          "author": "Busy_Selection5408",
          "text": "Appreciate this, it was helpful for me.",
          "score": 2,
          "created_utc": "2026-02-24 18:08:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7dbkbq",
          "author": "HappyTrainwreck",
          "text": " I’m also in nyc and a data analyst. Had many interviews and behavioral goes well for me. SQL technical ones is where I’m failing (Amazon, Meta, Roku) so if anyone has good insights on what interviewers want other than just getting to the right answer i’d love to hear more",
          "score": 2,
          "created_utc": "2026-02-25 18:21:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7gm033",
          "author": "dyingtoad",
          "text": "Are there any study resources you used for the data scientist roles?",
          "score": 2,
          "created_utc": "2026-02-26 04:41:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7gw5qw",
              "author": "warmeggnog",
              "text": "yes, i tried to use a mix to make sure i wasn't overfocusing/overoptimizing for just one aspect of the interview. for example, leetcode/hackerrank was really helpful for me for practicing common patterns that show up in oas/technical screens. then interview query for a question bank for data science roles at specific companies, covering sql, stats, ml, behavioral, etc. lastly for case study practice, i looked up youtube mock interviews for common cases like fraud detection, forecasts, and supplemented it with a book called ace the data science interview by nick singh - pretty sure it's free online!",
              "score": 1,
              "created_utc": "2026-02-26 05:56:31",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o796ffx",
          "author": "Lopsided-Charity8558",
          "text": "This is a great breakdown, especially the shift from “getting the correct answer” to “making your thinking visible”.\n\nWhat you described is actually very consistent with how data roles are evaluated now — it’s not just technical correctness, it’s whether your reasoning matches how the team would approach real problems (assumptions, tradeoffs, communication with stakeholders, etc.).\n\nIn practice, I’ve noticed it usually comes down to three signals:\n\n1) Technical correctness (can you get to a valid solution)\n\n2) Reasoning & communication (can you explain assumptions, edge cases, tradeoffs)\n\n3) Product / business thinking (are you connecting the analysis to decisions and impact)\n\nMost candidates over-optimize for #1 and under-invest in #2 and #3, which is exactly what you’re describing here.\n\nI’ve actually been building a small free tool that tries to quantify how competitive a profile is for a specific data role based on current job market expectations — some people use it just to sanity-check whether their profile aligns with what employers are looking for (no signup / no personal data).\n\nHappy to share it if anyone wants to test where they stand.",
          "score": 3,
          "created_utc": "2026-02-25 02:23:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7b13ei",
          "author": "FlashyCompetition505",
          "text": "Really helpful, Appreciate it",
          "score": 1,
          "created_utc": "2026-02-25 10:57:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o80ina8",
              "author": "Helpful_ruben",
              "text": "u/FlashyCompetition505 Error generating reply.",
              "score": 1,
              "created_utc": "2026-03-01 06:47:05",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7ccxn1",
          "author": "Quick_Cantaloupe_989",
          "text": "I feel understanding a systematic way to debug models really stand out too ",
          "score": 1,
          "created_utc": "2026-02-25 15:44:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7hla7i",
          "author": "GlitterClawsss",
          "text": "So cool",
          "score": 1,
          "created_utc": "2026-02-26 09:45:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7hrnu8",
          "author": "GlitterClawsss",
          "text": "Wisdom right here",
          "score": 1,
          "created_utc": "2026-02-26 10:44:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o76oyo4",
          "author": "shubham9397",
          "text": "thanks bro",
          "score": 1,
          "created_utc": "2026-02-24 18:52:53",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rhlq92",
      "title": "The top 5 most common product analytics case interview questions asked in big tech interviews",
      "subreddit": "datascience",
      "url": "https://www.reddit.com/r/datascience/comments/1rhlq92/the_top_5_most_common_product_analytics_case/",
      "author": "productanalyst9",
      "created_utc": "2026-03-01 02:44:47",
      "score": 127,
      "num_comments": 12,
      "upvote_ratio": 0.98,
      "text": "Hey folks,\n\nYou might remember me from my previous posts about my [progression into big tech](https://www.reddit.com/r/datascience/comments/1fhli34/my_path_into_dataproduct_analytics_in_big_tech/) or my [guide to passing A/B Test interview questions](https://www.reddit.com/r/statistics/comments/1ikwdud/e_a_guide_to_passing_the_ab_test_interview/). Well, I'm back with what will hopefully be more helpful interview tips.\n\nThese are tips specifically for product analytics roles in big tech. So these are roles with titles like Product Analyst, Data Scientist Analytics, or Data Scientist Product Analytics. This post will probably be less relevant to ML and Research type roles.\n\nAt big tech companies, they will most likely ask you product case interview questions. Here are the five most common types of questions. This is just based off my experience, having done 11 final round interviews and over 20 technical screens at tech companies in the last few years.\n\n1. Feature change: Instagram recently rolled out a new comment ranking algorithm to a small percentage of users. How would you evaluate it and determine whether to roll it out globally?\n2. Measure Success: How would you measure the success of Spotify Wrapped?\n3. Investigating Metrics: Time spent on the platform has decreased in the last month. How do you go about figuring out what's going on?\n4. Tradeoff: A recent feature change increased revenue but decreased engagement. How do you figure out whether this feature change should be kept or not?\n5. New feature/product: Pretend like Uber Eats doesn't delivery groceries. Walk me through how you would think through whether Uber Eats should invest in grocery delivery.\n\nIf you are preparing for big tech interviews for product analytics roles, I recommend you to literally just plug in these types of questions into your AI of choice and ask it to come up with frameworks for you, tailored for whichever company you are interviewing with.\n\nFor example, this is the prompt that I used: I have an interview with Uber for a product data scientist position. Here are the five categories of product cases I would like to practice (c/p the five examples from above). Generate two cases per category and ask them to me like a real interview. Do not give me answers or hints, and do not tell me what category of question it is. After I submit my answer, evaluate my answer. Then, ask me the next question.\n\nThe frameworks you'll use to answer these questions will be slightly different depending on whether you are interviewing with a SaaS company, multi sided marketplace company, social networking company, etc. I did this for every company I interviewed with.\n\nHope this helps. Good luck!",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/datascience/comments/1rhlq92/the_top_5_most_common_product_analytics_case/",
      "domain": "self.datascience",
      "is_self": true,
      "comments": [
        {
          "id": "o7zspry",
          "author": "Ill-Ad-9823",
          "text": "Super helpful writeup! I feel like this DS space often gets overlooked since it’s less technical.\n\nDo you have any advice on what type of companies hire these roles? From my experience / cruising job boards it seems like only\nmajor companies hire product DS.",
          "score": 9,
          "created_utc": "2026-03-01 03:30:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o80632u",
              "author": "productanalyst9",
              "text": "Most of the big companies hire for these types of product analytics roles. Uber, meta, Amazon (BIE), Netflix, DoorDash to name a few. I haven’t seen any of these types of roles recently at Google or Apple.",
              "score": 3,
              "created_utc": "2026-03-01 05:05:00",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7zxrtb",
          "author": "tongEntong",
          "text": "This sounds like management consulting McKinsey, MBB, Deloitte kind of case study than data science no? Very business oriented",
          "score": 7,
          "created_utc": "2026-03-01 04:05:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o801bya",
              "author": "productanalyst9",
              "text": "Yup. I used to work at Deloitte, there are definitely similarities in case interviews. I’d say the main difference is that for analytics interviews, there will likely be a bit more emphasis on metrics and measurement design (e.g. experimentation or causal inference) throughout the case. There will also likely be another interview more focused on stats, probability, and measurement design.",
              "score": 10,
              "created_utc": "2026-03-01 04:30:41",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o80ug2y",
                  "author": "alexchatwin",
                  "text": "I’m a generalist DS, rather than a consultant (maybe that’s the same thing, just with a different paymaster?), I’d ask questions like this too. \n\nSeeing how people would approach a new problem is far more important to me than any specific bit of maths.",
                  "score": 3,
                  "created_utc": "2026-03-01 08:36:45",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o81pk91",
              "author": "RecognitionSignal425",
              "text": "yes, MBA and consulting dictate the DS business, and hence the interview process. ",
              "score": 1,
              "created_utc": "2026-03-01 13:13:20",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o80v89h",
          "author": "AccordingWeight6019",
          "text": "honestly, this is underrated advice. most people over prepare technical skills and under prepare structured thinking. product interviews are less about the right answer and more about showing clear reasoning, prioritization, and business intuition out loud. frameworks, just help you not panic when the question is vague.",
          "score": 3,
          "created_utc": "2026-03-01 08:44:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o826m60",
              "author": "MrDominus7",
              "text": "All of your comments sound like AI",
              "score": 2,
              "created_utc": "2026-03-01 14:55:05",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o80bll1",
          "author": "chicanatifa",
          "text": "Mind if I DM you?",
          "score": 0,
          "created_utc": "2026-03-01 05:47:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o80fwbd",
              "author": "productanalyst9",
              "text": "Sure",
              "score": 1,
              "created_utc": "2026-03-01 06:23:13",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o80g7ur",
              "author": "Greedy-Tale-2969",
              "text": "+1",
              "score": 1,
              "created_utc": "2026-03-01 06:26:00",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o81aoha",
          "author": "AS_3013",
          "text": "I think I'm in the same conundrum as people in comments. I thought I'll just ask here in comments  \n  \nSo I'm a data scientist with 4.5 years of experience, I have worked from classical ML models, statistical models, LLM, RAG over the years, currently while looking for next role I'm getting something on the lines of forecasting, propensity models, capacity planning. My question is given how the AI world is moving forward should we go about this role or keep looking for more genAI focused roles? My question comes from the fact that though major companies are rushing towards agents and genAI solution I still see many roles for forecasting and conventional roles. What should be my thinking about the transition. Will such skills of forecasting, classical ML models for propensity or uplift modelling, or A/B test be appreciated 2-3 years down the line or is it like I'm downgrading myslef and should look for LLM and agents based roles?  \n\n\nP.S. Pay is same as my current role so salary is not a problem. Also I do understand that foundation should be always strong.",
          "score": 0,
          "created_utc": "2026-03-01 11:12:03",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1ri0ocx",
      "title": "So what do y’all think of the Block layoffs?",
      "subreddit": "datascience",
      "url": "https://www.reddit.com/r/datascience/comments/1ri0ocx/so_what_do_yall_think_of_the_block_layoffs/",
      "author": "Fig_Towel_379",
      "created_utc": "2026-03-01 15:52:38",
      "score": 83,
      "num_comments": 59,
      "upvote_ratio": 0.92,
      "text": "My upcoming interview with Block got canceled, and I am in a bit of relief but at the same time it made me question where is the industry in general headed to. Block CEO is attributing the layoffs to AI. As an active job seeker and currently in a “safe” job, I am questioning my decision to whether this is the right time for a job switch, but at the same time is there ever a right time?\n\nDo you think we will see more layoffs in the future because of AI?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/datascience/comments/1ri0ocx/so_what_do_yall_think_of_the_block_layoffs/",
      "domain": "self.datascience",
      "is_self": true,
      "comments": [
        {
          "id": "o82o9ao",
          "author": "cbars100",
          "text": "I wonder if this company overhired during COVID like many others did. \n\nAnd like many other companies, instead of having to hold a quarterly investors call and having to admit that they will have to fire people (which is read as a negative performance indicator by investors) they AI-washed this (which is read as a positive performance indicator by investors).\n\nThere is plenty of evidence elsewhere that AI is not being widely used as CEOs like to portray, it's not widely replacing jobs, it's still very unreliable and not being trusted by execs, and at most it might overwork existing employees rather than replace them. I think AI just became a scapegoat for CEOs to reduce staff without spooking investors (with the added benefit of making their company look modern and future-focused).",
          "score": 49,
          "created_utc": "2026-03-01 16:22:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o83vbxv",
              "author": "Mobile-Boysenberry53",
              "text": "The covid glut was droped back in 2023-2024. This is due to performance, and an anticipation of an economic downturn. Block has a 'buy now pay later' products, there is no way they are getting thier money back the way the economy is going.",
              "score": 7,
              "created_utc": "2026-03-01 19:48:51",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o84mrtp",
              "author": "ProfessorPhi",
              "text": "4k pre covid to 12k post covid to 10k -> 6k. Very much overhired and also made a bunch of bad acquisitions.",
              "score": 5,
              "created_utc": "2026-03-01 22:10:05",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o82j32r",
          "author": "Ok-Energy-9785",
          "text": "You have a tech CEO following the hype and being greedy. I won't be surprised if they end up rehiring a good amount of that workforce because AI isn't as effective as they thought.",
          "score": 144,
          "created_utc": "2026-03-01 15:58:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o82vyir",
              "author": "Thoughtulism",
              "text": "AI is the excuse, the reality is poor company performance. This is a payments company, which is going to be a leading indicator of a downturn in consumer spending. Blaming AI is the CEO's duty to shareholders to lessen the blow for stock prices.\n\nIf they are going to rehire anybody, it will be to their advantage because of driving down salaries. That might happen, however, that doesn't mean it's because of AI. The numbers are driving this as they will always drive things.",
              "score": 57,
              "created_utc": "2026-03-01 17:00:12",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o85ixqr",
                  "author": "N22-J",
                  "text": "Stripe is up from 100b to 160b. If there was a downturn in consumer spending, Stripe wouldn't be doing a tender offer at such a high valuation. Block is likely going down because Stripe is eating its lunch",
                  "score": 3,
                  "created_utc": "2026-03-02 01:15:12",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o844r0r",
                  "author": "Illustrious-Pound266",
                  "text": "While I do think there's some AI-washing involved, I think this sub sometimes overcorrects and think AI doesn't cause any changes to the job market. I personally believe that AI does indeed play some kind factor in layoffs. Perhaps not THE factor, sure, but to dismiss it outright is I think naive. I think people here are dismissing it because they are afraid of the implication if they don't.",
                  "score": 3,
                  "created_utc": "2026-03-01 20:36:59",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o82vriw",
              "author": "Ashamed-Simple-8303",
              "text": "The firing didnt happen because they believe in AI but because they bought BTC at its height and taking that into account lost like half a billion on crypto speculations.\nAI is just a very good excise to hide behind.",
              "score": 9,
              "created_utc": "2026-03-01 16:59:17",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o83hz0m",
                  "author": "JuicyPheasant",
                  "text": "Block's average cost of BTC is well below current prices, and it's not a large investment relative to their cash. They overhired during covid, and AI is also not an irrelevant piece of the puzzle like everying seems to be hypothesizing.",
                  "score": 9,
                  "created_utc": "2026-03-01 18:43:21",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o82wo77",
                  "author": "Ok-Energy-9785",
                  "text": "That makes sense",
                  "score": 2,
                  "created_utc": "2026-03-01 17:03:38",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o82rk5s",
              "author": "alkaliphiles",
              "text": "But the hiring will probably be in another country where labor is much cheaper",
              "score": 15,
              "created_utc": "2026-03-01 16:39:03",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o82rtbo",
                  "author": "Ok-Energy-9785",
                  "text": "It depends on where the layoffs occurred and if they can find the talent overseas",
                  "score": 2,
                  "created_utc": "2026-03-01 16:40:16",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o83bi33",
                  "author": "Thin_Original_6765",
                  "text": "Not saying you’re wrong, but this would’ve happen anyway if that’s the plan",
                  "score": 1,
                  "created_utc": "2026-03-01 18:13:45",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o83l8pg",
              "author": "fartcatmilkshake",
              "text": "You don’t need 10,000 employees to run a company like block",
              "score": 5,
              "created_utc": "2026-03-01 18:58:43",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o83liro",
                  "author": "Ok-Energy-9785",
                  "text": "So they overhired",
                  "score": 3,
                  "created_utc": "2026-03-01 19:00:03",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o82p8rh",
          "author": "Atmosck",
          "text": "AI is not the cause of these layoffs, it's just the excuse. ",
          "score": 59,
          "created_utc": "2026-03-01 16:27:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o86gnm0",
              "author": "R4G",
              "text": "Almost half their revenue is from BTC services, and they make their money when users buy the BTC. BTC demand in the US is at a historic low. BTC users are also 3x more active on Cash App than other users.\n\nIt’s disappointing to see the media run with Dorsey’s BS.",
              "score": 1,
              "created_utc": "2026-03-02 04:55:30",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o845ttb",
              "author": "Illustrious-Pound266",
              "text": "You don't know that though. Why do you think it's an excuse? Why can't AI cause some job loss?",
              "score": 1,
              "created_utc": "2026-03-01 20:42:37",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o84cbzr",
                  "author": "webbed_feets",
                  "text": "Block doubled their workforce in 2020 and their stock price fell to half of its peak. That’s not a healthy company.",
                  "score": 7,
                  "created_utc": "2026-03-01 21:16:00",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o82lpqq",
          "author": "doggiekruger",
          "text": "I think everyone is saying AI to just keep the hype machine running. It’s possible that the teams are just bigger than they need to be. \n\nOr they cut to offshore resources slowly and steadily. It could be many reasons but don’t believe them when they say AI. Increase efficiency means we can work on more things and ship things faster which should be the goal. \n\nMaybe they are just following everyone else because there is a real herd mentality within these leaders and shareholders. They want to do the same things as their neighbors for absolutely no reason at all",
          "score": 11,
          "created_utc": "2026-03-01 16:10:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o82n16u",
              "author": "sdand1",
              "text": "Yeah agreed, I suspect that if AI was around here 6 years earlier the rhetoric would be more along the lines of “AI is increasing our productivity, boosting profitability so we want to accelerate growth by taking on more headcount”",
              "score": 10,
              "created_utc": "2026-03-01 16:16:59",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o82ne1f",
                  "author": "doggiekruger",
                  "text": "Exactly",
                  "score": 3,
                  "created_utc": "2026-03-01 16:18:43",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o839ate",
                  "author": "cy_kelly",
                  "text": "Bingo. And if/when the VC money starts flowing a little more freely, that's exactly what you'll hear.",
                  "score": 1,
                  "created_utc": "2026-03-01 18:03:32",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o82jddf",
          "author": "The-original-spuggy",
          "text": "I think we will see layoffs and eventually the overinflated economy will deflate. Then things will be bad for a while. And barring a huge AI breakthrough where they truly can replace humans as workers, it will go back up. But yes I do think the next 3-5 years are not looking great economy wise",
          "score": 26,
          "created_utc": "2026-03-01 15:59:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o83cewp",
              "author": "Wild_Dragonfruit_484",
              "text": "I feel the market has been shite since like 2017. I wonder if it’ll ever actually get good again",
              "score": -2,
              "created_utc": "2026-03-01 18:17:58",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o82oalz",
              "author": "nitfizz",
              "text": "So the last 3-5 years were supposed to be the good years for developers?",
              "score": -8,
              "created_utc": "2026-03-01 16:23:08",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o82omac",
                  "author": "The-original-spuggy",
                  "text": "where in my post did i say that?",
                  "score": 9,
                  "created_utc": "2026-03-01 16:24:43",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o85ypgp",
                  "author": "JuicyPheasant",
                  "text": "They didn't say that, but also yes it's been excellent for developers and DS alike",
                  "score": 1,
                  "created_utc": "2026-03-02 02:52:45",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o82ycs7",
          "author": "xp3000",
          "text": "Look at the Block number of employees before and after covid. Jack Dorsey literally hired anyone with a pulse. \n\nIt's like why does a payment processor need 10000 people to begin with? Dumb as hell.",
          "score": 9,
          "created_utc": "2026-03-01 17:11:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o83145q",
          "author": "therealtiddlydump",
          "text": "They over-hired and are using AI as a smokescreen for the layoffs.\n\nIt's a rather boring story, really",
          "score": 7,
          "created_utc": "2026-03-01 17:24:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o82z3ps",
          "author": "spnoketchup",
          "text": "They were the exact same thing as Elon's Twitter layoffs (bloated, inefficient org), but Jack is smart enough to say \"because AI\" to get a stock bump out of it.",
          "score": 5,
          "created_utc": "2026-03-01 17:15:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o82wj7b",
          "author": "OmnipresentCPU",
          "text": "I think a lot of redditors still have their heads in the sand about AI and the effect its going to have on tech careers. \n\nBlock never should have been that bloated in the first place, though.",
          "score": 6,
          "created_utc": "2026-03-01 17:02:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o839i8y",
          "author": "TaiChuanDoAddct",
          "text": "As usual, multiple things can be true:\n1) the CEO can be a dingus\n2) AI is changing the industry quickly and unpredictably\n3) positioning yourself as part of the future instead of the past is important to do regardless",
          "score": 2,
          "created_utc": "2026-03-01 18:04:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o83z3mk",
          "author": "Single_Vacation427",
          "text": "Block was doing poorly in revenue and their stock was way down.\n\nDorsey is know for over-hiring, just look at Twitter (not saying Twitter can run with the crew Musk left, but it was bloated for what it was). \n\nLayoffs at Block had nothing to do with AI. It seems a lot of managers and M2 were laid off. Also, they laid off some teams.",
          "score": 2,
          "created_utc": "2026-03-01 20:07:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o82m6vy",
          "author": "JuicyPheasant",
          "text": "I posted this elsewhere, but I think the job market for software workers (specifically SWE and DS, but across the board) is likely headed downhill. It’s been so hyper inflated for so long which just exacerbates the AI advancements. Block also overhired like crazy during the pandemic, but the agentic coding is very quickly and fundamentally changing the way we work and develop software. And it feels like we’re just at the beginning of an exponential curve. \n\nhttps://www.reddit.com/r/news/comments/1rfqc91/comment/o7mgzta/?utm_source=share&utm_medium=mweb3x&utm_name=mweb3xcss&utm_term=1&utm_content=share_button",
          "score": 3,
          "created_utc": "2026-03-01 16:12:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o82sx7g",
              "author": "SeizeTheDay152",
              "text": "This is the most level headed take in here and I tend to agree. I also think when people talk about the job market, they are often talking past one another. All of these statements in my experience are true right now.  \n\\- Someone with 5+ years of experience at FAANG with a undergrad CS degree from a T50 school is probably seeing a slightly worse market, but still doable.  \n\\- A random new grad with maybe one internship but not at a T50 school is probably seeing the worst market since the dotcom bust so in 30ish years. It is likely many of those people will never enter the field.  \n\\- Someone who is senior and has principal or architect in their title is probably seeing the best market since covid.  \n  \nSomeone over at r/cscareers did an analysis of all the job postings and something like >1% were entry level. That is the real impact of AI as its taking the lowest hanging fruit and making those jobs hard to argue to hire a human to do. This is where we are just at the beginning really strikes true. If entry level is being reduced right now with these models, I have very little skepticism that in 5 years with more data and more infrastructure they won't be able to do mid-level staff SWE work.",
              "score": 5,
              "created_utc": "2026-03-01 16:45:37",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o82s7c6",
              "author": "TheNoobtologist",
              "text": "I’d argue the opposite. SWE hiring is depressed by high interest rates and the false belief that AI can broadly replace white-collar work. Model improvements are already showing diminishing returns, agents still aren’t reliably capable (and won't be for anything other than simple, repetitive tasks), and companies that have tried to swap people for them are running into real operational issues. Don't get me wrong, AI is still very useful, but we’re nearing the end of a once-in-a-generation bubble, and many firms that bought into the AI narrative too aggressively are in for a rough landing. If/when the market finally cracks, it may be painful for SWE and DS, but not because AI is replacing them in droves. It will be because capital was misallocated into data centers, infrastructure and stock valuations, and the unwind shows up through falling valuations, writing off poor investments, and tighter budgets.",
              "score": 2,
              "created_utc": "2026-03-01 16:42:09",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o83h7g6",
                  "author": "JuicyPheasant",
                  "text": "You think we're nearing the end of the AI bubble? It's just beginning IMO. I also disagree that coding models are showing diminishing improvements; starting with Opus 4.5 in December we're seeing some of the biggest step function improvements specifically within agentic coding capabilities (not generic LLMs).\n\n  \nAll just my experience and opinion, happy to disagree on it",
                  "score": 4,
                  "created_utc": "2026-03-01 18:39:47",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o82quv4",
          "author": "SeizeTheDay152",
          "text": "Yes there will be more layoffs this year and in the future. To put it bluntly, there isn't a future where primarily software based jobs aren't declining. That does not mean there will be zero, but they will be much less common. The reason is people anthropomorphize everything and claim failure too quickly.  \nPeople get too focused on automation replicating the exact human structure of work, and when it can't do it in the exact same way, claim failure. But we didn't need robotic humanoids in the fields harvesting our crops. We built mechanical tools that efficiently harvested crops in a different way. Now one farmer does what hundreds of serfs did in the medieval times.  \nAI will be similar, it doesn't have to replicate the exact work flow or thought process of a human to be good at coding or analyzing data. I would argue it only really needs to be about 80% as good in most cases as a human because it is so much cheaper.  \nThe question for most companies is going to be is an AI or a group of agentic agents going to provide me with some useful information at a cheaper cost than a human. The answer to that question even now is emphatically YES! Just like how buying one tractor and collector is less efficient than hand harvesting every grain, but it is so much cheaper and good enough that the pro's outweigh the con's.  \nThis is why most people reasonably conclude most thinking jobs will be automated away. The loss in efficiency will be dwarfed by the gains in productivity and cost savings. Plus the more training data and use cases these models get the better they will get.",
          "score": 2,
          "created_utc": "2026-03-01 16:35:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o82zp6x",
          "author": "DubGrips",
          "text": "Pretty glad I didn't accept their offer lol. Honestly company is toxic AF and I haven't met a single person that had a net positive experience working there so it's not a cultural shocker.",
          "score": 1,
          "created_utc": "2026-03-01 17:18:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o8453br",
          "author": "Illustrious-Pound266",
          "text": "I am gonna go against the grain and say that AI does play a role in the layoffs. I do not think this is the sole reason or even the main reason for layoffs. But some people here seem to dismissing the very idea of AI impacting the job market. I will not dismiss the impact, and tell you that I believe it does play some role, and I think people are coping if they think it doesn't.",
          "score": 1,
          "created_utc": "2026-03-01 20:38:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o850kps",
          "author": "LtUnsolicitedAdvice",
          "text": "Block employee count went up like crazy in the pandemic overhang. They didn't cut any employees all this time. They are right sizing now. They are packaging it as a AI optimization miracle because it hypes up investors. Nothing much to see here. ",
          "score": 1,
          "created_utc": "2026-03-01 23:26:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o85a3l5",
          "author": "tongEntong",
          "text": "Of course, and all these grads will saturate the job market even more…. Sad reality.",
          "score": 1,
          "created_utc": "2026-03-02 00:22:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o85cu8c",
          "author": "whitecollarindex",
          "text": "On this note I made a website to track tech and white collar jobs in the face of AI! Check it out. Whitecollarindex.com\n\nOn the block note it seems more related to poor business performance than AI. ",
          "score": 1,
          "created_utc": "2026-03-02 00:38:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o85dxnn",
          "author": "Relative_Sympathy_33",
          "text": "I don't think that can be entirely attributed to AI even if claimed otherwise. I believe that sometimes CEOs just handwave this as a reason to hide the real motive, which is in most cases to reduce costs. At the end, they know that they will have to redistribute the work on the remaining workforce. So, I guess with this, they won't be hiring the same amount of people they fired if there is no particular business reason.",
          "score": 1,
          "created_utc": "2026-03-02 00:44:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o86cght",
          "author": "patternpeeker",
          "text": "layoffs rarely come down to “ai replacing everyone” in practice, it is usually cost pressure plus leadership deciding to reset priorities. i would worry less about ai as a force and more about whether a company actually knows how it turns models into durable revenue before u jump.",
          "score": 1,
          "created_utc": "2026-03-02 04:24:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o86j4m9",
          "author": "Expensive_Culture_46",
          "text": "I dipped to public sector to wait out this stupidity.",
          "score": 1,
          "created_utc": "2026-03-02 05:14:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o86qphr",
          "author": "AbbreviationsOdd2295",
          "text": "Personally I feel like Block is just using AI as an excuse to fire all of the people they over-hired during covid. Doesn't help that their stock is down like 70% from their peak during the pandemic :)",
          "score": 1,
          "created_utc": "2026-03-02 06:15:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o871gef",
          "author": "StephenODea",
          "text": "The company is down 75% in the past 5 years",
          "score": 1,
          "created_utc": "2026-03-02 07:53:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o82rleb",
          "author": "sonicking12",
          "text": "Same CEO who sold X to Musk",
          "score": 2,
          "created_utc": "2026-03-01 16:39:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o82womb",
              "author": "OmnipresentCPU",
              "text": "No it wasn’t. Dorsey wasn’t CEO.",
              "score": 5,
              "created_utc": "2026-03-01 17:03:41",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o83zige",
                  "author": "Single_Vacation427",
                  "text": "The CEO was his puppet",
                  "score": 1,
                  "created_utc": "2026-03-01 20:10:03",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o83esau",
          "author": "Kitchen_Tower2800",
          "text": "I work in DS on AI agents projects. All our projects are essentially 100% vibe coded, including a lot of the data science; I probably write the most code on the whole team and it's a problem. \n\nIt's not perfect (we launch bugs straight to prod fairly often) but I will say it's incredibly scary how **well** it all works. I don't think we could make a stable product moving at the speed at that we currently do, but we could slow down a lot and still be way faster with way fewer employees than any of the other pre-AI tech teams I've seen before. I hate to say it, but I don't think it's unreasonable that a lot of companies could easily be more productive with at least 50% layoffs and the requirement that everyone using AI agents for the majority of the work. \n\nFor personal reasons, I really hope that AI isn't all that it's hyped up for: a lot of the software engineers on our team are asking \"where do we fit if this all works out?\" and there's not a great answer for them. But given what I'm seeing, it's very clear that already, tech work without heavy AI usage is going to be considered obsolete by the end of the year. It's very hard to believe there won't be very heavy layoffs through out the industry given what I see in terms of increased efficiency. ",
          "score": 0,
          "created_utc": "2026-03-01 18:28:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o834280",
          "author": "sunsvilloe",
          "text": "wrr",
          "score": 0,
          "created_utc": "2026-03-01 17:39:02",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rffpzo",
      "title": "Should on get a Stats heavy DS degree or Data Science Tech Degree in Today's era",
      "subreddit": "datascience",
      "url": "https://www.reddit.com/r/datascience/comments/1rffpzo/should_on_get_a_stats_heavy_ds_degree_or_data/",
      "author": "Bulky-Top3782",
      "created_utc": "2026-02-26 17:02:30",
      "score": 78,
      "num_comments": 67,
      "upvote_ratio": 0.87,
      "text": "I have done bsc data science. Now was looking for MSC options.\n\nI came across a good college and they have 2 course for MSc:\n\n1: MSc Statistics and Data Science\n\n2: Msc Data Science\n\nI went thorugh the coursework. Stats and DS is very Stats heavy course, and they have Deep learning as an elective in 3rd Sem. Where as for the DS course the ML,NLP, and \"DL & GEN ai\" are core subjects. Plain DS also has cloud.\n\nSo now i am in a dillema.\n\nwhether i should go with a course that will give me solid statistics foundation(as i dont have a stats bacground) but less DS related and AI stuff.\n\nOr i should take plain DS where the stats would still be at a very basic level, but they teach the modern stuff like ml,nlp, \"DL & genai\", cloud. I keep saying \"DL & GenAI\" because that is one subject in the plain msc.\n\n  \n**Goal**: I dont want to become a researcher, My current aim is to become a Data Scientist, and also get into AI\n\nIt would be really appreciated if someone can help me solve this dillema.\n\nSharing the curriculum\n\n[Msc Stats And DS pic 1](https://preview.redd.it/kyx5llb1uvlg1.png?width=576&format=png&auto=webp&s=bd1b18f64c9faaf83ef2b52a0c60426c87e30deb)\n\n[Msc Stats And DS pic 2](https://preview.redd.it/20303b08uvlg1.png?width=577&format=png&auto=webp&s=3519e15b50956617c20196c84351db4936df9d9c)\n\n[Msc Data Science](https://preview.redd.it/o02j4jzbuvlg1.png?width=490&format=png&auto=webp&s=64c9dbb7ec012a4815caa74563498cfa78563c73)",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/datascience/comments/1rffpzo/should_on_get_a_stats_heavy_ds_degree_or_data/",
      "domain": "self.datascience",
      "is_self": true,
      "comments": [
        {
          "id": "o7jp1ik",
          "author": "mattstoebe",
          "text": "I am biased as I choose stats route (now work with more modern ML), but generally data science masters are not held the same regard as statistics. I have had hiring managers tell me this in interviews. \n\nI think this is because most data science masters present a dumbed down mediocre soup of courses. The stats coursework is not deep/ challenging, it adds in SQL which can easily be self taught, and then the deep learning genai courses are not that close to industry standards. \n\nOn the other hand a proper stats masters will put you in a competitive position (where you know more about something than them) to many MLEs and some data scientists. \n\nThe exception to this I would assume is if it truly is a top program where the lecturers actually have the industry experience to be teaching DL/ gen AI, and it is part of a larger series of courses.",
          "score": 127,
          "created_utc": "2026-02-26 17:17:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7k06cs",
              "author": "HumerousMoniker",
              "text": "I agree with you, but I put it this way: stats heavy is teaching you the fundamentals of the output, but a tech heavy data science course will teach you modern tooling. When modern tooling moves on and you retrain, your degree will be obsolete, but with stats heavy at least you will have *some* grounding left. \n\nOf course, once in industry no one cares which one you chose. And my advice to op is to choose which one you’ll enjoy more, because it’s a decision that may drive your career and you may be trying to optimise too early.",
              "score": 24,
              "created_utc": "2026-02-26 18:08:33",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7k9h1y",
                  "author": "Bulky-Top3782",
                  "text": "the thing is that when i see a lot of tech in the DS one, i think it is good because most of the jobs i see posted online want those skills.\n\nWhereas the Stats and DS one, i think having stats knowledge would be a thing. but im not sure what should i do.",
                  "score": 9,
                  "created_utc": "2026-02-26 18:51:01",
                  "is_submitter": true,
                  "replies": []
                },
                {
                  "id": "o7k9ezc",
                  "author": "mattstoebe",
                  "text": "This is a great framing. I think the tools change more than the fundamentals so on balance stats >>",
                  "score": 2,
                  "created_utc": "2026-02-26 18:50:45",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o7k5cqz",
              "author": "Bulky-Top3782",
              "text": "hello, i added the curriculum pics, just so it is easy to evaluate",
              "score": 3,
              "created_utc": "2026-02-26 18:32:11",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7ka9fw",
                  "author": "mattstoebe",
                  "text": "After looking at program, I’d double down on previous evaluation. Lots of courses focused on things that you can either self teach or will naturally pick up. Understanding the foundation is so much more difficult than databases, story telling, cloud, big data etc.. and that’s assuming the caliper of those classes is even close to industry which it won’t be",
                  "score": 6,
                  "created_utc": "2026-02-26 18:54:34",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o7lg49i",
              "author": "hosea0220",
              "text": "Agreed, I have a masters in stats and it has served me very well. You can really sell the strong math  background - and that you have an understanding of the statistical theory behind the models. My first job out of college was 85k after my masters.",
              "score": 2,
              "created_utc": "2026-02-26 22:14:36",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o7u3m0m",
              "author": "RecognitionSignal425",
              "text": "Should focus on heavy stats for education. however, keep in mind stat, in business, barely generate revenue (or not in a direct, quantifiable way). ",
              "score": 2,
              "created_utc": "2026-02-28 05:55:29",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o7les9g",
              "author": "mace4242",
              "text": "I agree with you regarding Master in Statistics verse Data Science. I’ve researched Master in Statistics verse Data Science degrees. The stats Master degrees that I’ve seen have a higher entry (more prerequisites) and for some reason almost always cost a lot more money. I’ve seen plenty of data science master degrees that are easier admission and cost way less, potentially 10-15k USD. Many employers have tuition reimbursement that would pay for that 10-15k but not even close to the 30-50k + I’ve seen for Statistic Master degree.",
              "score": 1,
              "created_utc": "2026-02-26 22:08:00",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7jot3p",
          "author": "forbiscuit",
          "text": "In this economy, job market and with simplification of tooling because of LLMs: Stats Masters",
          "score": 28,
          "created_utc": "2026-02-26 17:16:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7jycu6",
          "author": "hybridvoices",
          "text": "Full send on the stats degree. Even before AI, tech moved quickly enough that it made aspects of DS degrees obsolete by the time you graduate. These days, we don't even know what things are going to look like 6 months from now. Stats theory isn't going to change and will serve you far better long-term. ",
          "score": 22,
          "created_utc": "2026-02-26 18:00:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7mfgdl",
              "author": "PixelLight",
              "text": "Solid take, and you'll learn most, if not all, tech stack shit on the job anyway.",
              "score": 9,
              "created_utc": "2026-02-27 01:26:59",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7jxxja",
          "author": "Dismal-Variation-12",
          "text": "My advice (this is what I did). Always go stats. Pure statistics knowledge is way more useful than general data science (data science is mostly stats applied to big data). But the data science courses  in universities are mostly watered down stats. Also, don’t emphasize technology courses too much. The technology is way easier to learn on the job than pure statistics.",
          "score": 38,
          "created_utc": "2026-02-26 17:58:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7k9s67",
              "author": "Bulky-Top3782",
              "text": "understood. the reason i have the DS one as option is because it has the tech mentioned that i see in JD of most of the jobs posted online",
              "score": 2,
              "created_utc": "2026-02-26 18:52:24",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7kyfew",
          "author": "RollData-ai",
          "text": "The field is changing super fast right now. In a situation like that it is better to focus on the unchanging aspects that will give you a deep understanding of things. I would go for the more math focused side, for that reason.",
          "score": 13,
          "created_utc": "2026-02-26 20:50:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7jp449",
          "author": "_The_Bear",
          "text": "Grad school does not teach you all you need to know to be a DS. It doesn't come close. There is a ton of continued learning on the job. Think of it this way, one program will get you ~10% of the way there on stats and ~25% of the way there on modern approaches like cloud/deep learning. The other will flip those percentages. Either way, assume you'll need to do a ton of learning on the job. \n  \nIn that context, it doesn't matter much which you choose. Just pick the program that's a better fit.",
          "score": 25,
          "created_utc": "2026-02-26 17:17:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7jqpeo",
          "author": "_thisisnotme",
          "text": "Here’s how I’d think about it. There are other angles so take this with a grain of salt.\n\nDS degree seems to focus on implementation rather than foundations. \n\nLlms are already pretty good at implementation, especially common patterns. And will likely continue to get better.\n\nMethods will change and be automated but statistics will always be the foundation. Gen ai class sounds cool but when the paradigm around how they are used changes, much of what you learned in that class may no longer be relevant. \n\nWhen you’re building a model, having an understanding of what’s going on under the hood will often be more useful especially when it comes to debugging, edge cases, concepts used in combination in a way they aren’t commonly.\n\nIf battery prices are magically cut in half tomorrow, electric cars will all of a sudden be a much more attractive option for a lot of people. In a world of electric cars who does better, the mechanical engineer out the expert combustion engine mechanic?",
          "score": 8,
          "created_utc": "2026-02-26 17:24:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7k3iyx",
              "author": "wertyg775",
              "text": "I am near finishing my DS degree that is rather tech inclined than Stats heavy. Any suggestions on how to work on stats foundations?",
              "score": 2,
              "created_utc": "2026-02-26 18:23:52",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7ka95u",
                  "author": "Bulky-Top3782",
                  "text": "yeah technically you are like me. i did a ds degree and now thinking of taking a stats and ds degree",
                  "score": 3,
                  "created_utc": "2026-02-26 18:54:32",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            },
            {
              "id": "o7ko046",
              "author": "SolarWind777",
              "text": "Thank you. You just convinced me to go the Stats route.",
              "score": 2,
              "created_utc": "2026-02-26 19:59:39",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7jw05o",
          "author": "Lady_Data_Scientist",
          "text": "What kind of job do you want when you’re done? \n\nIf you want to be closer to the business, answering questions an aiding decision making using more causal inference, experimentation, statistical modeling, prediction, regression, go with the stats heavy program. \n\nIf you want to build more automation and data products using ML and AI, go with the ML/DP/NLP program. \n",
          "score": 3,
          "created_utc": "2026-02-26 17:49:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7kahss",
              "author": "Bulky-Top3782",
              "text": "i want to become a data scientist, but i also dont want to be limited in that area. the ai automation sounds fascinating too",
              "score": 1,
              "created_utc": "2026-02-26 18:55:38",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7jxmah",
          "author": "Slightlycritical1",
          "text": "I’d do DS. There are a lot of stat majors that lack the fundamental skills to apply ML in industry. Stats might be more useful for research roles though",
          "score": 5,
          "created_utc": "2026-02-26 17:56:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7k112c",
              "author": "Spiritual_Avocado_68",
              "text": "I'd argue ML/DL/python is not a complicated subject at all. Stats however is way more vast an complex.\nIt also gives you a perspective on non-ML modelling alternatives, which I believe are terribly underrated",
              "score": 2,
              "created_utc": "2026-02-26 18:12:28",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7k9725",
                  "author": "Slightlycritical1",
                  "text": "I’m pretty sure most DS majors study stat models as well, just probably not as in depth as an actual stats major does. I’ve seen that the biggest barrier to stats degrees trying to get a job on my team and the main DS part of our organization is that they aren’t able to write good code in general, use distributed systems, often don’t understand the general workflow pipeline for developing and choosing models, and tend to lack depth with the various areas of DS outside of stats. In some areas that may be okay, and I’m sure they could pick it up over time, but if you need someone who can immediately start providing value to a team, I find that stat majors in general need more time to do so.",
                  "score": 5,
                  "created_utc": "2026-02-26 18:49:46",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7k9sz4",
                  "author": "rentheduke",
                  "text": "Also applying ML in industry can also be learned on the job - you can't say the same thing about statistics.",
                  "score": 2,
                  "created_utc": "2026-02-26 18:52:30",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7k4kd8",
          "author": "DataDrivenPirate",
          "text": "I manage a data science org at a fortune 500 company. I do a lot of hiring. Definitely would recommend a masters of stats over a MS DS, especially if you have an undergrad DS degree. Two common problems I see:\n\n1) data science degrees vary considerably in quality. I think it's unfair to completely write off masters of DS degrees, so I spend a lot of time looking at curriculum of the degrees that candidates have. Some are rigorous and thorough, others are basically degree mills. Not all hiring managers do that though, a lot will just assume a DS MS is sub par quality \n\n2) your goal with a master's should be to develop specialization, become good at something that will be attractive to employers. You can't be good at everything. I look for candidates who are \"good enough\" across the board and are \"great\" in specific areas that will benefit my team. Optimization, computer vision, NLP, deep learning, recommendation systems, Bayesian modeling, etc. Lots of places to specialize, just depends on what you find most interesting. You have to be comfortable having very little expertise in some of these niche domains; it's okay because you should have deep experience in others. \n\nAll of that said, I typically recommend a masters of statistics or a masters of computer science depending on what you want to specialize in. Either one will address both of these problems and will make it easier to find a job when you graduate.",
          "score": 2,
          "created_utc": "2026-02-26 18:28:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7k5m79",
              "author": "Bulky-Top3782",
              "text": "hello, i added the curriculum pics, just so it is easy to evaluate",
              "score": 1,
              "created_utc": "2026-02-26 18:33:24",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7mly2u",
          "author": "sdiener7",
          "text": "I'd say pure DS if you want to go into SWE and AI, and stats if you like research or consider a PhD.",
          "score": 2,
          "created_utc": "2026-02-27 02:04:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7mn798",
              "author": "Bulky-Top3782",
              "text": "oh. yeah i want to become a data scientist. i guess i should've mentioned that i dont aim to become a researcher",
              "score": 1,
              "created_utc": "2026-02-27 02:11:59",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7n01um",
          "author": "tongEntong",
          "text": "Job landscape in DS is cooked atm tho. More roles for data engineers as they’re crucial for all data/ ai related stuffs.",
          "score": 2,
          "created_utc": "2026-02-27 03:27:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7xie8c",
          "author": "latent_threader",
          "text": "Whichever teaches you how to build shit. The statistics part of ML is cool but I don't need that bullshit in operations. Hire someone who knows how to handle messy data and can communicate it effectively to your team. It doesn't matter what they know if you can't explain it to your boss.",
          "score": 2,
          "created_utc": "2026-02-28 19:37:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7jp5jb",
          "author": "SatanicSurfer",
          "text": "Stats course doesn’t have ML? Machine Learning is very important and a deep subject. Deep Learning is a deep subject as well but not very important right now unless if you’re going into research. GenAI is not a deep subject, you can learn it on a few weeks if you have the proper fundamentals.",
          "score": 4,
          "created_utc": "2026-02-26 17:17:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7juml9",
              "author": "Bulky-Top3782",
              "text": "the stats and ds one has a subject called advanced ml. but they dont have nlp, and DL is an elective for 3rd sem.\n\nwhereas the other \"DS\" one has ml,nlp,dl and genai as core coures. so one will learn all these. the elective for that are \"mlops\" and \"blockchain\", so choose on of these.\n\nThe ds one also teaches cloud.\n\nSo it's confusing, because one side is stats heavy and some data science. the other side iss data science tech heavy and some stats",
              "score": 2,
              "created_utc": "2026-02-26 17:43:11",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7k0nd1",
          "author": "Tarneks",
          "text": "I came from a tech oriented masters before gen ai. I believe the programs should cover statistics well enough that you should at-least understand what a P value is and also cover hands on optimization. So id rather have a well rounded employee as ML blends with statistics a lot especially with applied causal inference. Data science is heavily interdisciplinary.\n\nThat said i worked with stats people and many “math” majors have abysmal coding skills. So people obsessing over linear algebra, statistics is just fixating on the bare minimum. You dont need to be an absolute genius in statistics you just need to be functional. Some math majors (the pure maths) from experience also have abysmal statistics & coding skills. Some are extremely late career and they dont remember the information as well. \n\nI guess what I am trying to say here is that a masters degree doesn’t really teach you the depth you need, so fixating on depth isnt going to be enough. As long as you have the interdisciplinary foundation like\n1) Good coding hygiene \n2) Understanding of statistics that makes you functional\n3) Understanding of optimization.\n\nIf the degree is having you do proofs run away.\n\nAgain personal opinion, applied work > theoretical people who yap and dont actually build production grade solutions.\n\nAgain 3 years industry & managing people. Worked with all types of interns from different degrees. Also degrees right now from my experience are probably not even an accurate indicator when everyone now cheats using AI. I had an interview with a compsci student + math and statistics that doesnt know what a variable is in python. I have seen masters students that dont understand what a probability is.\n\nMy experience isnt unique and I am sure there are a lot of managers who saw people who are great on paper but are absolutely terrible.\n\nAgain an absolute beast stats major most likely will be R only guy. However most production grade stuff have python. I think you need to be flexible and not a 1 trick pony.",
          "score": 2,
          "created_utc": "2026-02-26 18:10:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7kbbtc",
              "author": "Bulky-Top3782",
              "text": "so should i go with the Msc DS. as that has 1 or 2 classes for stats, rest all are the implentations",
              "score": 1,
              "created_utc": "2026-02-26 18:59:21",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7l42j9",
                  "author": "Tarneks",
                  "text": "Depends on your background and how robust the program is. The number of classes is not an indicator as much as the topics themselves. In my experience 2-3 is what i did but I also took 3-4 stats classes in my undergrad. Application of statistics is what i would focus on more.",
                  "score": 1,
                  "created_utc": "2026-02-26 21:16:35",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7k1qo4",
          "author": "cptsanderzz",
          "text": "Pick the school that will have more meaningful networking. The level of your masters won’t come into question if you have a reference. Masters that aren’t precursors to PhDs are almost always about networking and making meaningful connections than the rigor of the course work.",
          "score": 1,
          "created_utc": "2026-02-26 18:15:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7k6c7y",
          "author": "_akashhh",
          "text": "That’s the nmims msc stats and data science isn’t it? I have done the same.. I would only suggest you doing this if you are willing to learn on your own. Faculty isn’t the best honestly, lots of visiting faculty in the third sem. \nNotable company for placement are Morgan Stanley for Spring intership, Amazon for business analyst, eli lily, top indian banks, boutique hedge fund for quant research role, Munich Re,  Auronova fintech and few others.",
          "score": 1,
          "created_utc": "2026-02-26 18:36:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7k7gbb",
              "author": "Bulky-Top3782",
              "text": "yeah it is. can i talk to you in dm?",
              "score": 1,
              "created_utc": "2026-02-26 18:41:47",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7k7u18",
                  "author": "_akashhh",
                  "text": "Sure",
                  "score": 1,
                  "created_utc": "2026-02-26 18:43:30",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7lr1cg",
          "author": "CanYouPleaseChill",
          "text": "Statistics without a doubt. Learn the fundamentals and learn them well. They will be valuable throughout your career. ",
          "score": 1,
          "created_utc": "2026-02-26 23:10:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7m1yud",
              "author": "Bulky-Top3782",
              "text": "I see everyone recommending stats. So it's a complete go to for me now.\n\nThe only doubt i have is that the subjects I see in Ds are i see in job descriptions a lot. So will i be able to land jobs after the bsc stats and data science? As ai and other tech is on so boom.\n\nThe ds degree is teaching ml, nlp, dl, genai, cloud, big data. \n\nSo I'm sorry if I sound like an idiot but the ds one is like checking all those job descriptions checkboxes.\n\nOn the other hand i understand stats is important. So very confused at this point",
              "score": 1,
              "created_utc": "2026-02-27 00:11:13",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7n6de2",
          "author": "user426_",
          "text": "I thought statistics+programming=data science",
          "score": 1,
          "created_utc": "2026-02-27 04:07:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7n6oih",
          "author": "Huge_Ad_735",
          "text": "I did a stats degree and actually had a fairly hard time finding related work in my area for whatever reason without a masters... so I almost want to say it doesn't matter because you're going to learn most of what you do on the job anyways. I think in theory the stats classes are probably better because it's easier to learn how to do something than why to do something if that makes sense, but I think both should offer the same prospects",
          "score": 1,
          "created_utc": "2026-02-27 04:09:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7nilhk",
          "author": "andrewprograms",
          "text": "Stats for sure",
          "score": 1,
          "created_utc": "2026-02-27 05:32:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7nj48l",
              "author": "andrewprograms",
              "text": "As a senior engineer, I could teach a new hire the tooling in a couple days if they knew the stats, but I could *not* teach them stats and it would be embarrassing for me to elevate well-tooled-but-poorly-understood work to executives who don’t understand the tools but (hopefully) understand the value behind the stats.",
              "score": 1,
              "created_utc": "2026-02-27 05:36:07",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7qkkr9",
          "author": "Inevitable_Neck_8236",
          "text": "kon  se college ka h yeh",
          "score": 1,
          "created_utc": "2026-02-27 17:48:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7qw2qs",
              "author": "Bulky-Top3782",
              "text": "nmis mumbai",
              "score": 1,
              "created_utc": "2026-02-27 18:42:46",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7t7w5z",
          "author": "Academic_Painting417",
          "text": "From experience, I think DS/AI courses are very theory heavy, they don’t really teach you how to use the tools, and mainly emphasise on how the theory behind the algorithms — which is perfect for research but not so great for industry. Till this day, I still don’t understand why my lecturer decided to teach us SVM/SVR.\n\nSo in general, you ideally want to supplement your courses with personal projects.  Back to your originally question, I think having stats will definitely improve your employability, and give you a better perspective when trying to understand patterns in data etc. \n\nI’m a bit biased though, I have a bsc in mathematics and a masters in ai/ml.",
          "score": 1,
          "created_utc": "2026-02-28 02:16:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7t9jsa",
              "author": "Bulky-Top3782",
              "text": "Actually in just found out i can't take the stats and ds degree because i don't have a stats degree. I wish I did a stats degree first and then data science :(",
              "score": 1,
              "created_utc": "2026-02-28 02:26:27",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7tcz83",
                  "author": "Academic_Painting417",
                  "text": "Did they say it’s a requirement? You could always try to apply, though I don’t know how strict the university is.\n\nI would personally look around and see if other universities are providing a similar course.\nBut it’s not the end of the world if you can’t find a course with stats included. In industry, you will mainly be using frameworks like scikit-learn, PyTorch, VLLM, unsloth, HF which will not need any stats, just an understanding of the tools and how they work, pros and cons, and which tool is most suitable for a specific task. (Spoiler alert, there exists no overall best algorithm :P, no free lunch theorem) In other words, it helps, not mandatory.\n\nA rule of thumb is, higher the ranking is, the more theory heavy it is, so you should ideally have a solid foundation in stats and linear algebra. (This might only hold in the UK)",
                  "score": 1,
                  "created_utc": "2026-02-28 02:47:47",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7uqlz1",
          "author": "Klutzy_Court1591",
          "text": "I did stats heavy regretted it the first 8 months, then it clicked and ever since then I just became super thankful and greatful i did it",
          "score": 1,
          "created_utc": "2026-02-28 09:22:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o80c6ua",
          "author": "Former_Ad_735",
          "text": "This looks very generic. Can you go deeper in an area? This is basically learning the commodity, 2020 DS skillset.",
          "score": 1,
          "created_utc": "2026-03-01 05:52:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o810ese",
          "author": "InterviewTechnical13",
          "text": "I'd prefer that you know the why's of the choices far more than how to quickly drag and drop the latest toolchain together and get \"canibalisation\" results just because you dont know what a collider is.",
          "score": 1,
          "created_utc": "2026-03-01 09:33:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7jpyp4",
          "author": "Personal_Research602",
          "text": "The theory heavy one. There are limited number of roles a junior with be engaged with NLP, DL, or Gen AI tasks (maybe beyond maintain something someone else has built already), and what they teach you in school always lags what is used in industry by at least several years. ",
          "score": 1,
          "created_utc": "2026-02-26 17:21:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7tmnvt",
          "author": "Historical_Leek_9012",
          "text": "I became a data scientist by way of being a performance marketer who did the bootcamp thing and took some stats courses. If I was hiring, I’d look much more favorably on a stats masters — they know stuff I don’t.",
          "score": 0,
          "created_utc": "2026-02-28 03:50:04",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rdm2ij",
      "title": "Corperate Politics for Data Professionals",
      "subreddit": "datascience",
      "url": "https://www.reddit.com/r/datascience/comments/1rdm2ij/corperate_politics_for_data_professionals/",
      "author": "LeaguePrototype",
      "created_utc": "2026-02-24 17:09:52",
      "score": 59,
      "num_comments": 51,
      "upvote_ratio": 0.85,
      "text": "I recently learned the hard way that, even for technical roles, like DS, at very technical companies, corperate politics and managing relationships, positioning, and expectiations plays as much of a role as technical knowledge and raw IQ.\n\nWhat have been your biggest lessons for navigating corperate environments and what advice would you give to young DS who are inexperienced in these environments?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/datascience/comments/1rdm2ij/corperate_politics_for_data_professionals/",
      "domain": "self.datascience",
      "is_self": true,
      "comments": [
        {
          "id": "o769eyn",
          "author": "No_Ant_5064",
          "text": "\\-perception is reality. If you work really hard but no one see it, you're lazy. If you're lazy but you strategically do work that is highly visible when it counts, you are a team player.\n\n\\-Leadership doesn't care about the ins and outs of your analysis. They also don't care about the statistical limitations. They want to know what you found, how to interpret it, and what to do with your recommendation\n\n\\-Pace yourself. If you burn yourself out pushing an analysis over the finish line, they're just going to want more deep dives and follow ups RIGHT NOW. Take time to recover mentally, don't let people rush you, overestimate how long you thing things will take.",
          "score": 68,
          "created_utc": "2026-02-24 17:44:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o764r1m",
          "author": "Upset-Chemist-4063",
          "text": "Nobody cares about a cool model that uses the latest and greatest technologies or Python packages - maybe technical folks do, but most of your stakeholders wouldn’t know the different between a pvalue and an average.\n\nThe truth is you’re only as good/valuable as how effective you can communicate your learnings/insights, and how it leads to strategic recommendation. At most companies, you need to build confidence with the decision making stakeholders and build good rapport with them so they trust your recommendations. It might take time, but it’s more of a branding thing - you manage your image and how folks see you. Either as a person to make data requests from, or someone they come to for recommendations on how they should proceed with a project on their roadmap. \n\nLearn from your more seasoned leads in their respective areas. Learn how they talk, what metrics they care about, and how they present their information to the exec teams. You will learn how to become a data partner this way.",
          "score": 96,
          "created_utc": "2026-02-24 17:22:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7a86wi",
              "author": "RecognitionSignal425",
              "text": ">build confidence \n\nespecially the 95% interval ",
              "score": 8,
              "created_utc": "2026-02-25 06:34:03",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7b56lw",
                  "author": "stickypooboi",
                  "text": "Idk politics has requested we show 80 CI because “the numbers look better”. I fucking hate politics and I hate the higher up I go the less of an IC I am and the more dumb meetings I get with people who don’t have any inclination to differentiate between facts and fraud.",
                  "score": 2,
                  "created_utc": "2026-02-25 11:32:31",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7658bf",
          "author": "Old_Cry1308",
          "text": "people skills > technical skills. don't ignore them.",
          "score": 57,
          "created_utc": "2026-02-24 17:25:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o76a4mj",
              "author": "forbiscuit",
              "text": "I think you glitched because your comment got posted like at least 8 times",
              "score": 10,
              "created_utc": "2026-02-24 17:47:25",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o76e9nx",
                  "author": "ArgenCoso",
                  "text": "Not a glitch, he is making sure that we are not ignoring him. It's a recursive suggestion",
                  "score": 24,
                  "created_utc": "2026-02-24 18:05:45",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7h4f1m",
                  "author": "Cultural-Ambition211",
                  "text": "Proof that his people skills are superior to his technical skills",
                  "score": 4,
                  "created_utc": "2026-02-26 07:05:25",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o7a88kz",
              "author": "RecognitionSignal425",
              "text": "\\* people skills >>>>>>> technical skills.",
              "score": 3,
              "created_utc": "2026-02-25 06:34:27",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o7b6ssr",
              "author": "tongEntong",
              "text": "Bullshit skills > all other skills in corporate world",
              "score": 2,
              "created_utc": "2026-02-25 11:45:27",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o76x3oe",
          "author": "normee",
          "text": "Learn how performance reviews work at your company. Not just the regular 1-1 review meetings you have with your manager, but how often management comes together to discuss employees, and how they calibrate across people and teams. This matters a great deal for bonuses and awards, as well as how sought after you will be for internal advancement opportunities beyond your current immediate team. In previous organizations I've been at, performance calibrations sometimes were \"loudest voice led\" (managers who pushed hardest for their people would end up with them on top), and sometimes was \"popularity contest\" (employees who had good relationships with many managers or happened to do highly visible work were rewarded, employees whose work wasn't as visible and were unknowns to other managers not distinguished).\n\nKeep a running list of work accomplishments, and discuss them regularly with your manager. It will help you with those performance review and bonus processes as well as to keep your resume updated. \n\nGather as many advocates in your corner as possible beyond your own manager. If your manager is not very engaged, having others (especially department leaders and senior execs) who think highly of your work is critical for internal mobility and reducing the risk you'll be hit in a layoff.\n\nBeyond your accomplishments, time management, communication skills, and personality matter a lot for how you will be perceived. Learn what \"done\" actually means for your work and make sure you account for time for review and feedback, fixing issues, and handling unanticipated follow-ups. If you are working on something other people have dependencies on, make sure you are communicating status and why you might be delayed so you don't piss a lot of people off. Do not put yourself in a position where people can point to you as a scapegoat. Don't use technical jargon or get too in the weeds in front of an audience who doesn't care and will tune out. Use the same terminology as your business partners do. Aim for simplicity and brevity in your visualizations, presentations, emails, and reports, but don't be condescending, treat colleagues like dumb-dumbs, or mansplain. For meetings, show that you are respecting people's time and not tuning out, such as by being active in the chat with support and questions or keeping your camera on so that the meeting runners aren't seeing a bunch of lifeless muted black squares.",
          "score": 24,
          "created_utc": "2026-02-24 19:29:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o76z2n0",
              "author": "LeaguePrototype",
              "text": "it's like you were stalking me at my last job seeing all the things I did wrong lol",
              "score": 4,
              "created_utc": "2026-02-24 19:38:54",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o778qfy",
              "author": "Beautiful-Cell-470",
              "text": "Gold, saving this for later",
              "score": 1,
              "created_utc": "2026-02-24 20:23:40",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o7a8f2s",
              "author": "RecognitionSignal425",
              "text": "yes, clairy and simplicty are the best for business full of ambiguity",
              "score": 1,
              "created_utc": "2026-02-25 06:35:58",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o76ygjv",
          "author": "dang3r_N00dle",
          "text": "There are a bunch of useful books to read on this:\n\n1. Power: Why some people have it and other's don't\n2. Never Split the Difference\n3. Getting to Yes\n4. Set Boundaries, Find Peace\n5. The Unspoken Truths for Career Success\n6. The Unspoken Rules\n\nHaving a combination of these books is quite useful. You don't need to do machiavelian shit, but *do* understand optics, managing expectations and telling people the stuff that they need to know instead of what you think they should know. \n\nIt's not easy, and despite having read all of these books, I still struggle. But I realise that I struggle because I haven't been applying these things that well. \n\nLastly, there's a huge amount of power in small alignments with everyone on your team. Double checking metric definitions are right, discussing methodology with peers/seniors before working on it, asking for feedback on your work before plowing ahead to presenting numbers, and discussing with your manager when your workload is too high, is all stuff that will make your life a lot easier once you know how. ",
          "score": 9,
          "created_utc": "2026-02-24 19:36:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o76a415",
          "author": "chocolateandcoffee",
          "text": "Seems like the prevailing thought is people skills > technical skills. don't ignore them.",
          "score": 9,
          "created_utc": "2026-02-24 17:47:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o76awr1",
          "author": "GoBuffaloes",
          "text": "I am questioning your \"raw IQ\" based on your inability to spell corporate",
          "score": 12,
          "created_utc": "2026-02-24 17:50:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o766cfi",
          "author": "Old_Cry1308",
          "text": "people skills > technical skills. don't ignore them.",
          "score": 6,
          "created_utc": "2026-02-24 17:30:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o763ips",
          "author": "Old_Cry1308",
          "text": "people skills > technical skills. don't ignore them.",
          "score": 8,
          "created_utc": "2026-02-24 17:17:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o77sddu",
          "author": "welpbear",
          "text": "Business acumen  > Technicalities\n\nBe confident, assertive but also humble and grounded\n\nMake allies. Especially PM/account managers\n\nBecome indispensable to your lead for a specific thing\n\nLearn how to build a slide deck that deliveres a narrative. Which takes me to take a storytelling course. We do more decks than we write code sadly\n\nAlways watch how leads respond to people work and presence to see who has any influence\n\nDon't bad mouth or talk shit anyone to anyone. Don't trust anyone with all your thoughts\n\nDamn, re reading this makes me really rethink being in this field in corporate 😆 I could have done anything else but noooope 🫠🤣\n\nUpdate: edited formatting for easier read",
          "score": 2,
          "created_utc": "2026-02-24 21:54:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7bv2bn",
          "author": "Desperate-Radio5126",
          "text": "Biggest lesson: your job isnt \"build models\", its \"reduce risk for whoever owns the number\". So you need to pre-wire decisions before the big meeting: do a quick 10 min sync with the PM, eng lead, and whoever signs off, show a 1-pager with tradeoffs, and ask \"what would make this a no?\" early. Also, write down scope in Slack/email after every convo (\"to confirm, success = X metric by Y date\") because half of politics is just people rewriting history when things go sideways. And never surprise your manager with bad news in a stakeholder meeting.",
          "score": 2,
          "created_utc": "2026-02-25 14:16:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ham07",
          "author": "Embiggens96",
          "text": "Biggest lesson is that being right isn’t enough, you have to make it easy for other people to win with you. Early on I thought clean models and solid logic would speak for themselves, but alignment, expectation setting, and stakeholder buy in matter just as much. If you don’t proactively communicate scope, risks, and tradeoffs, someone else will define the narrative for you. \n\nFor younger DS folks, I’d say learn to translate your work into business impact, document decisions, and build relationships before you need favors. Technical skill gets you hired, but trust and positioning determine how far you go.",
          "score": 2,
          "created_utc": "2026-02-26 08:01:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o766p42",
          "author": "Old_Cry1308",
          "text": "people skills > technical skills. don't ignore them.",
          "score": 5,
          "created_utc": "2026-02-24 17:31:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o767rzd",
          "author": "Old_Cry1308",
          "text": "people skills > technical skills. don't ignore them.",
          "score": 2,
          "created_utc": "2026-02-24 17:36:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o76lqjl",
          "author": "Wojtkie",
          "text": "No one cares about your model, approach, or problems with the data. Only money you can make, money you can save, or info you can provide to do either of those two precious things.",
          "score": 3,
          "created_utc": "2026-02-24 18:38:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o78cw3h",
          "author": "mcjon77",
          "text": "Personality goes a long way. \n\nPeople focus so much on technical skills, and they are important at a baseline.  However, for data scientists in particular, our personality and our ability to interact well with others, especially non-technical folks, is critical. \n\nFor some people this will sound pointless for others this will sound obvious, but it's really important that people actually enjoy working with you and being around you if you want to progress in your career.  You could be a technical master, but nobody wants to be around an asshole.  More importantly, they will only tolerate you for as long as they need to tolerate you and will drop you at the first opportunity if you have a poor personality. \n\nI saw this first hand in my first data science position. There was a senior guy who was extraordinarily technically competent, but he was a complete prick to EVERYONE except his boss. This guy had such a reputation as being a jerk that even Brown technical folks on the business side I thought he was a jerk, and they shouldn't have had that much contact with him. The problem was once his boss left people started maneuvering to get him canned too. \n\nIn contrast, if you got a good personality and maintain a positive attitude people will enjoy working with you and will look to you to help solve their problem, because they like you and trust you. This is especially true for the non-technical business folks when they interact with us. I've been called into meetings over seniors because the business leads knew me entrusted me and didn't know them.  This also leads to my second point. \n\nSometimes visibility is a literal thing. \n\nI love remote work, but I also got to see first hand at my last job how if there are two data scientists and one's remote and the other isn't the non remote data scientist is going to have a lot more opportunities to make a positive impression on leadership and business partners.  My previous team was remote but I was able to go into the office since I lived in the same city. Even though the other data scientists on the team work just as hard as me or harder she had nowhere near the visibility. \n\nThe results showed up in our performance reviews, particularly when leveling occurred where Managers from different parts of the business get together to standardize scores amongst employees.  She would tell me about how one of our directors seems to not like her and I would be perplexed because that director loved me. The problem was she was just a voice on teams and I was a face in the office. \n\nIf I was looking for career progression my ideal setup would be one to two days in the office where I could work closely with the non-technical business folks.  You really don't need more than that in the office to make an impression, certainly not 5 days. Folks just need to be able to SEE YOU as someone that they can work with and rely on.",
          "score": 3,
          "created_utc": "2026-02-24 23:38:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o765ltk",
          "author": "Old_Cry1308",
          "text": "people skills > technical skills. don't ignore them.",
          "score": 4,
          "created_utc": "2026-02-24 17:26:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7671mf",
          "author": "Old_Cry1308",
          "text": "people skills > technical skills. don't ignore them.",
          "score": 2,
          "created_utc": "2026-02-24 17:33:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o765z2i",
          "author": "Old_Cry1308",
          "text": "people skills > technical skills. don't ignore them.",
          "score": 5,
          "created_utc": "2026-02-24 17:28:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o769n3l",
              "author": "No_Ant_5064",
              "text": "it's hard to ignore them when you posted this comment 12 times.",
              "score": 15,
              "created_utc": "2026-02-24 17:45:13",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o771bgl",
          "author": "ohanse",
          "text": "People only care about making the best choice.\n\nIf you can analyze and report the shit out of something, but make no recommendation?\n\nNo perceived value. 95% of your labor will always be invisible to your cross functional colleagues.\n\nSo you should be “savvy” enough to know the big questions, and the viable solutions under consideration. This will allow you to take the final step of making the recommendation, which is when all of your value perception occurs.\n\nAlso: are you SURE you want to move up the ladder? Those titles can be heavy.",
          "score": 2,
          "created_utc": "2026-02-24 19:49:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o767f0z",
          "author": "Old_Cry1308",
          "text": "people skills > technical skills. don't ignore them.",
          "score": 2,
          "created_utc": "2026-02-24 17:35:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o768575",
          "author": "Old_Cry1308",
          "text": "people skills > technical skills. don't ignore them.",
          "score": 2,
          "created_utc": "2026-02-24 17:38:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o769okq",
              "author": "Adlach",
              "text": "Bro it went through stop hitting submit",
              "score": 23,
              "created_utc": "2026-02-24 17:45:24",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o76bcg5",
          "author": "Ok-Energy-9785",
          "text": "Exactly. The narrative matters more than any cutting edge method or programming language",
          "score": 1,
          "created_utc": "2026-02-24 17:52:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o76ykev",
          "author": "hazydude314",
          "text": "It is all about translating whatever you do into either make more money or save more money from company perspective. If you learn how to do that you have a very powerfull skill, cause in the end that what every business needs and optimizes for. Every single stakeholder will somehow be motivated by these arguments. Also it is really only about perceived skills not actual skills, big difference but thats how human nature works. ",
          "score": 1,
          "created_utc": "2026-02-24 19:36:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o78q0fi",
          "author": "dj_ski_mask",
          "text": "Let people have their bauble. If the immediate project seems stupid as hell - it probably is. Bur getting the shiny piece of crap out the door can pay dividends (via reciprocal trust building) in the form of interesting/high impact projects down the line. Gotta play the game.",
          "score": 1,
          "created_utc": "2026-02-25 00:50:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o78zzds",
          "author": "Intelligent-Past1633",
          "text": "It's wild how much of our job is really just managing expectations and translating complex technical work into business value for stakeholders who don't care about the underlying models.",
          "score": 1,
          "created_utc": "2026-02-25 01:46:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7aceyr",
          "author": "Simple_Woodpecker751",
          "text": "manage up",
          "score": 1,
          "created_utc": "2026-02-25 07:10:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7avs6c",
          "author": "WignerVille",
          "text": "I would go even further and say that even if your solution is the best choice (from a business perspective) sometimes politics will kill it. \n\nEven if you're really great at selling it. Have a nice personality and have proved value. That's great, but if it threatens people's position you will fight a battle that is very hard to win.",
          "score": 1,
          "created_utc": "2026-02-25 10:09:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7axxga",
          "author": "patternpeeker",
          "text": "one lesson for me was that technical skill alone does not protect u from politics. a lot of ds impact depends on how well u frame uncertainty and set expectations. if stakeholders feel surprised, u lose trust fast. being explicit about tradeoffs and risks has saved me more than any clever model tweak.",
          "score": 1,
          "created_utc": "2026-02-25 10:29:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ewfym",
          "author": "-sunday-",
          "text": "people skills > technical skills. don't ignore them.",
          "score": 1,
          "created_utc": "2026-02-25 22:47:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7fujkr",
          "author": "adlersmut089",
          "text": "I used to work in Corporate Finance before getting into Stats/Data. You get used to it 🫠",
          "score": 1,
          "created_utc": "2026-02-26 01:55:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7hrgk4",
          "author": "GlitterClawsss",
          "text": "Small talk is really a skill to master",
          "score": 1,
          "created_utc": "2026-02-26 10:42:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7l2cmf",
          "author": "RollData-ai",
          "text": "This is big-tech specific. When you get to the upper-mid level, like when you are reporting directly to a VP, you need a champion. At the VP level and above there is an ongoing war between powerful managers. It projects a distortion field. If you want to move up, you need someone connected, like an SVP, to decide that you are their guy, and be your champion when other people go to tear you down, to try and prop up their own people. Sad but true.",
          "score": 1,
          "created_utc": "2026-02-26 21:08:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o763zcu",
          "author": "Old_Cry1308",
          "text": "people skills > technical skills. don't ignore them.",
          "score": 2,
          "created_utc": "2026-02-24 17:19:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o764iz5",
          "author": "Old_Cry1308",
          "text": "people skills > technical skills. don't ignore them.",
          "score": -1,
          "created_utc": "2026-02-24 17:21:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o764vp1",
          "author": "Old_Cry1308",
          "text": "people skills > technical skills. don't ignore them.",
          "score": 1,
          "created_utc": "2026-02-24 17:23:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o799cl7",
          "author": "Great_Purpose7024",
          "text": "Take all of your conversations with every stakeholder and turn each one into an AI agent representing how that person thinks and speaks. Ask the agents for honest feedback on you. Do this every month. Then, adjust your work accordingly to maximize their feedback.",
          "score": 0,
          "created_utc": "2026-02-25 02:39:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o79g77k",
          "author": "katiebug1096",
          "text": "I remember reading somewhere that people are typically promoted to the level of their incompetence.   So don't be surprised if you have more knowledge and experience then your supervisor.   I am in the education field and probably 90% of those in central office have little to no background in what their title says however because they have been in the district long enough they know enough people and they have enough experience years that therefore qualifies them for that title Go figure.",
          "score": 0,
          "created_utc": "2026-02-25 03:18:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o77iu19",
          "author": "Urban_singh",
          "text": "Fluffers >> technical+analytical skills",
          "score": -2,
          "created_utc": "2026-02-24 21:10:33",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rdr1k3",
      "title": "What is your (python) development set up?",
      "subreddit": "datascience",
      "url": "https://www.reddit.com/r/datascience/comments/1rdr1k3/what_is_your_python_development_set_up/",
      "author": "br0monium",
      "created_utc": "2026-02-24 20:05:38",
      "score": 56,
      "num_comments": 58,
      "upvote_ratio": 0.86,
      "text": "My setup on my personal machine has gotten stale, so I'm looking to install everything from scratch and get a fresh start. I primarily use python (although I've shipped things with Java, R, PHP, React).  \n## What do you use?\n1. Virtual Environment Manager\n1. Package Manager\n1. Containerization\n1. Server Orchestration/Automation (if used)\n1. IDE or text editor\n1. Version/Source control\n1. Notebook tools  \n  \n\n## How do you use it?\n1. What are your primary use cases (e.g. analytics, MLE/MLOps, app development, contributing to repos, intelligence gathering)?\n1. How does your setup help with other tech you have to support? (database system, sysadmin, dashboarding tools /renderers, other programming/scripting languages, web or agentic frameworks, specific cloud platforms or APIs you need...)\n1. How do you manage dependencies?\n1. Do you use containers in place of environments?\n1. Do you do personal projects in a cloud/distributed environment?  \n  \nMy version of python got a little too stale and the conda solver froze to where I couldn't update/replace the solver, python, or the broken packages. This happened while I was doing a takehome project for an interview:,)  \nSo I have to uninstall anaconda and python anyway.  \n  \nI worked at a FAANG company for 5 years, so I'm used to production environment best practices, but a lot of what I used was in-house, heavily customized, or simply overkill for personal projects. I've deployed models in production, but my use cases have mostly been predictive analytics and business tooling.  \n  \nI have ADHD so I don't like having to worry about subscriptions, tokens, and server credits when I am just doing things to learn or experiment. But I'm hoping there are best practices I can implement with the right (FOSS) tools to keep my skills sharp for industry standard production environments. Hopefully we can all learn some stuff to make our lives easier and grow our skills!\n",
      "is_original_content": false,
      "link_flair_text": "Tools",
      "permalink": "https://reddit.com/r/datascience/comments/1rdr1k3/what_is_your_python_development_set_up/",
      "domain": "self.datascience",
      "is_self": true,
      "comments": [
        {
          "id": "o77e7my",
          "author": "triplethreat8",
          "text": "Uv for virtual environment and package management\n\nDocker for containers\n\nKedro for pipelines (you didn't ask)\n\nVScode\n\nGit\n\nJust Ipython no jupyter",
          "score": 40,
          "created_utc": "2026-02-24 20:49:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o77q6du",
              "author": "br0monium",
              "text": "sounds nice! Ive always thought of pipelining as a function that spans mutliple other areas. Server automation and DBMS for job scheduling, data lineage, etc. Using a tool for the whole process would save a lot of time on data engineering decisions.",
              "score": 4,
              "created_utc": "2026-02-24 21:44:08",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o77vezq",
                  "author": "triplethreat8",
                  "text": "Yea, pipelining exists at multiple levels. Kedro itself isn't opinionated. Since it allows you to slice your pipeline you can still use any traditional pipeline tool that orchestrates scripts and just run slices.\n\nExample:\n\n`kedro run --nodes=clean_a,clean_b`\n\n`kedro run --nodes=clean_c`\n\nThe benefit of using kedro for a Data Science project is that it imposes a good reproducible structure and gets DS thinking in a more modular way.",
                  "score": 3,
                  "created_utc": "2026-02-24 22:08:43",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o77ii47",
              "author": "froo",
              "text": "+1 for this setup. Same here",
              "score": 2,
              "created_utc": "2026-02-24 21:09:03",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o77xole",
              "author": "mint_warios",
              "text": "Kedro is a beast",
              "score": 1,
              "created_utc": "2026-02-24 22:19:44",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o776uga",
          "author": "Old_Cry1308",
          "text": "conda for environments, pip for packages. vscode for editing, git for version control. jupyter for notebooks.",
          "score": 49,
          "created_utc": "2026-02-24 20:14:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o79u703",
              "author": "Civil-Age1531",
              "text": "dude you have to pick up uv",
              "score": 15,
              "created_utc": "2026-02-25 04:46:55",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7bpu5x",
                  "author": "Glittering_Item5396",
                  "text": "what is that?",
                  "score": 3,
                  "created_utc": "2026-02-25 13:47:55",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o7788ow",
              "author": "br0monium",
              "text": "the classics:)",
              "score": 5,
              "created_utc": "2026-02-24 20:21:20",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o77aqi4",
          "author": "templar34",
          "text": "Devcontainers in each repo, Backstage template for generic new project. Makes sure my pleb code from Windows machine behaves same as Mac code, behaves same as cloud deployment environment. Conda YAML part of repo, and has its own deployment pipeline for Azure.\n\nOne day maybe I'll look at uv, buuut I'm not the Azure expert that set up our pipelines, and I'm a big believer in \"if it's ugly/stupid but it works, it's not ugly/stupid\".",
          "score": 8,
          "created_utc": "2026-02-24 20:33:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o77sl1w",
              "author": "br0monium",
              "text": "I havent used the devcontainer spec before, looks like it's well supported and could be pretty clean. Backstage looks really interesting too. Thanks!",
              "score": 2,
              "created_utc": "2026-02-24 21:55:18",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o79g267",
          "author": "willthms",
          "text": "I use R studio running on my desktop.",
          "score": 6,
          "created_utc": "2026-02-25 03:17:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o79hltz",
              "author": "br0monium",
              "text": "A real statistician!",
              "score": 4,
              "created_utc": "2026-02-25 03:26:23",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o77gdef",
          "author": "gocurl",
          "text": "Poetry for virtual environment, vscode, and clear separation between training and serving.\nAt work we have nice pipelines and engineers to support the infrastructure. For home projects I keep the concept, but it's not that necessary (last finished project here https://github.com/puzzled-goat/fire_watcher)",
          "score": 5,
          "created_utc": "2026-02-24 20:59:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o77ntyn",
          "author": "Atmosck",
          "text": "What do I use:\n\n1. Virtual environment manager: pyenv for managing different python versions, uv for managing the actual virtual environments\n2. Package manager: uv\n3. Docker\n4. My coworkers maintain our build pipeline and orchestration with AWS. I mostly just ship code and bother them if I need new environment variables or something.\n5. vscode\n6. github for code, S3 versioning for model artifacts\n7. I don't use notebooks\n\nHow do I use it?\n\n1. I spend most of my time writing ML pipelines that feed our (SAAS) product. Scheduled tasks for training data ETL, training, monitoring and sometimes inference. Other times if it's something where we need inference in response to user action, either a lambda or a dedicated server depending on the usage patterns.\n2. I have kind of a love-hate relationship with vscode. Some of my projects are a mix of python and rust (PyO3), so it's nice having language support for both in the same editor, and the sqltools extension is great. The python debugger is pretty good. But the language servers randomly shit themselves like twice a week. And I wish copilot autocomplete was hooked into intellisense so that it would suggest functions and parameters that actually exist instead of just guessing.\n3. uv and pyproject.toml. almost all my stuff is containerized so it's pretty straightforward.\n4. In production yeah, but locally I always work in virtual environments. I always have at least one dependency group that's not used in production with ruff/pytest/pyright/stub packages.\n5. I don't really do personal projects. I'm lucky enough to be in an industry where my actual work is what my personal projects would be if I had a different job.\n\nIf you've been dealing with conda headaches and are looking for a new setup I *highly* recommend checking out uv. \n\n",
          "score": 5,
          "created_utc": "2026-02-24 21:33:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o77tv3d",
              "author": "br0monium",
              "text": "Thanks for breaking it down in a detailed response! I'll definitely check out uv after all the recommendations.\n\nI wouldn't do personal projects if I wasn't unemployed hahaha. But it's been so long I need to make sure I dont fall too far behind or forget things. I hit the point of diminishing returns with interview prep a while ago.",
              "score": 2,
              "created_utc": "2026-02-24 22:01:16",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o78ahv9",
              "author": "gpbayes",
              "text": "Why do you use rust?",
              "score": 1,
              "created_utc": "2026-02-24 23:25:30",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o78jimh",
                  "author": "Atmosck",
                  "text": "For speeeeeed. Specifically some of my models are state machine simulations where we care about the whole distribution and the frequency of rare events, and it can take a lot of sims for distributions to converge. So I write the core simulation engine (the \"hot loop\") in rust, and all the data IO and orchestration in python. For that sort of thing rust is about 100x faster than python. You could achieve similar speeds in python with a compiler like cython or numba or with a C extension, but there are a lot of things about rust that make it a more attractive language to work in.",
                  "score": 1,
                  "created_utc": "2026-02-25 00:15:37",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o79rpsy",
              "author": "unc_alum",
              "text": "Curious what your motivation is for using pyenv over uv for installing/managing different versions of python?",
              "score": 1,
              "created_utc": "2026-02-25 04:29:56",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o79xd4i",
                  "author": "Atmosck",
                  "text": "Basically just that I've used pyenv for longer. And I like the separation of pyenv happens in the global environment, UV happens in the venv",
                  "score": 1,
                  "created_utc": "2026-02-25 05:09:21",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o795wh5",
          "author": "FlyingQuokka",
          "text": "1. uv\n2. uv\n3-4: My personal projects don't need containerization; at work DevOps uses EKS\n5. neovim\n6. git/jj\n7. I don't use notebooks, but if I must, then marimo",
          "score": 4,
          "created_utc": "2026-02-25 02:20:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o79d57s",
              "author": "br0monium",
              "text": "Neovim, nice!  \nI actually have sublime, cmder, and atom still installed on my laptop😅 vscode is basically atom, and that's what I've used at work, so I'll probably end up using vscode like a normie.  \nNothing beats the feeling when your muscle memory for vi commands finally clicks though. It's like the shell, filesystem, and text editor are all just one thing that you live in.",
              "score": 1,
              "created_utc": "2026-02-25 03:00:30",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7c7wuk",
          "author": "AccordingWeight6019",
          "text": "Honestly, for me it’s less about fancy tooling and more about keeping things light, reproducible, and flexible. I usually stick with \\`venv\\` + \\`pip\\` for environments, VS Code for editing, git for versioning, and jupyter for quick experiments. containers only if I need to mirror a production setup. It’s not flashy, but it keeps personal projects simple and lets me switch between analytics, MLE, or just tinkering without getting stuck on solver freezes or subscription headaches.",
          "score": 3,
          "created_utc": "2026-02-25 15:20:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o77s2cb",
          "author": "vaaano",
          "text": "uv+marimo",
          "score": 2,
          "created_utc": "2026-02-24 21:52:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o77ywp7",
          "author": "mint_warios",
          "text": "1+2. uv for virtual envs & package Mgmt\n\n3. Docker or Google Cloud Build for containerisation\n\n4. Depends on the project, sometimes Prefect, sometimes Airflow/Cloud Composer for client enterprise pipelines, sometimes Kedro for more data science tasks\n\n5. PyCharm for IDE, with Cline plugin using Claude Sonnet or Opus 4.6 models with 1m context window for agentic coding\n\n6. Git - Bitbucket for work, GitHub for personal\n\n7. PyCharm's built-in Jupyter notebooks, or Colab Enterprise if need to work completely within a client's cloud environment",
          "score": 2,
          "created_utc": "2026-02-24 22:25:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o79agk6",
              "author": "br0monium",
              "text": "How much does that setup in (5) cost you?",
              "score": 1,
              "created_utc": "2026-02-25 02:45:38",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7bqaxr",
                  "author": "mint_warios",
                  "text": "PyCharm is free. Used to be called \"Community Edition\" but now it's wrapped up in their \"Unified\" IDE. But still free with all the same features. \n\nFor Cline, it really depends on the LLM model I've chosen to use and how much I decide to use it. I use Claude Opus 4.6 mostly, and in a typical day I can easily burn through $10-30+. Lower end if I'm just making some documentation. Higher end if it's using maximum extended thinking to develop lots of code.",
                  "score": 2,
                  "created_utc": "2026-02-25 13:50:27",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7aa524",
          "author": "sudo_higher_ground",
          "text": "1. Federated MLOps and development\n2. Uv and for cli install only in production pyenv \n3. Docker\n4. Docker compose/k8s/ schedulers (we use VMs in production so no fancy cloud tools)\n5. VS code (I switched to positron for personal projects) \n6. Git+ GitHub \n7. Switched from Jupyter to Marimo and it has been a bliss",
          "score": 2,
          "created_utc": "2026-02-25 06:50:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7fzcmg",
              "author": "br0monium",
              "text": "What do you like about marimo? I fiddled with it today for the first time, and it won't let you reassign/update variables outside of the cell its declared in?",
              "score": 1,
              "created_utc": "2026-02-26 02:23:20",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7i36ra",
                  "author": "McJagstar",
                  "text": "That’s the price you pay for reactive execution. Basically when you make a change to an upstream cell, all downstream cells will automatically execute. But for that to work, it needs to infer the DAG based on where variables are assigned. This forces you to be a little less sloppy in your notebook code, which IMO is a good thing. \n\nMarimo also has “app mode” which makes it trivial to turn your notebook into a dashboard, first class BYOAPI AI integration, “column” format so you can organize notebook sections into columns, interactive chart builder so you can use a GUI to make Altair charts, database connection tools, SQL cells, etc.\n\nUnder the hood the file format is just Python so you don’t end up with silly Jupyter merge issues.\n\nThe downside is, as you noted, you can’t assign the same variable in multiple cells because otherwise the DAG can’t be solved.",
                  "score": 1,
                  "created_utc": "2026-02-26 12:18:09",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7i669b",
                  "author": "sudo_higher_ground",
                  "text": "So for me the main benefit is that I don’t have to worry about devs pushing data to repos and it feels git friendlier because of the fact that notebooks are now plain python files instead of big json files. The package itself is less bloated than Jupyter and has better management for large files. I personally notice that it’s also more stable in docker containers and i have less kernel crashes when the dataframe gets too big for memory. Also the build-in data viewer is really nice. Polars lazyframes + Marimo has been the golden combo for me.",
                  "score": 1,
                  "created_utc": "2026-02-26 12:38:47",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7b1gj4",
          "author": "patternpeeker",
          "text": "i keep my setup simple. plain python with venv or poetry, vscode, and docker only when i need prod parity. conda has caused enough solver pain that i avoid it. reproducibility and pinned deps matter more than fancy stacks.",
          "score": 2,
          "created_utc": "2026-02-25 11:01:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o780fo3",
          "author": "Dysfu",
          "text": "UV, venv, ruff, pre-commit, FastAPI, Alembic, dbt, pydantic, SQLAlchemy, Docker, VSCode",
          "score": 4,
          "created_utc": "2026-02-24 22:33:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o79ezwo",
              "author": "br0monium",
              "text": "Can you elaborate a bit on what you use each of these for?",
              "score": 1,
              "created_utc": "2026-02-25 03:11:03",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o77a5pq",
          "author": "koolaidman123",
          "text": "uv ruff and claude code is all you need",
          "score": 4,
          "created_utc": "2026-02-24 20:30:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o77d8kt",
              "author": "_OMGTheyKilledKenny_",
              "text": "Same here but I use vs code with Claude as copilot and GitHub workflows for CI/CD.",
              "score": 1,
              "created_utc": "2026-02-24 20:44:56",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o77zw0h",
          "author": "dmorris87",
          "text": "Docker container inside VSCode",
          "score": 1,
          "created_utc": "2026-02-24 22:30:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o78zwv3",
          "author": "Intelligent-Past1633",
          "text": "I'm still a big fan of \\`pyenv\\` for managing Python versions – it's been rock solid for me, especially when juggling older projects that can't easily upgrade.",
          "score": 1,
          "created_utc": "2026-02-25 01:46:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7av96i",
          "author": "Goould",
          "text": "conda, pip and npm, Antigravity and Claude Code from terminal, Git + Github, Jupyter Notebook\n\nAside from that I'm able to design a lot of my own tools now. I have a PDF indexer that pulls the data and creates libraries of CSV files, the indexer creates a SQLite database which can later be accessed in seconds in future sessions. I have different agents for reading, writing, and verifying data with 3rd party sources. \n\nSomeone in the thread said they used Rust and I think I could have implemented rust into my workflow as well since its faster -- I'd just have to relearn the code and all the libraries from scratch. \n\n  \n\n\n",
          "score": 1,
          "created_utc": "2026-02-25 10:05:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7vvklq",
              "author": "mcard7",
              "text": "Did you write the pdf indexer? I’m thinking of something similar for a home project.",
              "score": 1,
              "created_utc": "2026-02-28 14:38:56",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7xna5h",
                  "author": "Goould",
                  "text": "Yeah, feel free to work off of this if you'd like: [https://github.com/casruta/PDF-Indexer-](https://github.com/casruta/PDF-Indexer-) \n\nIt works pretty good and I rarely hit limits anymore (unless I actively try to lol) ",
                  "score": 1,
                  "created_utc": "2026-02-28 20:03:05",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7b1ydh",
          "author": "mshintaro777",
          "text": "uv + Antigravity + git + Claude Code!",
          "score": 1,
          "created_utc": "2026-02-25 11:05:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7b617x",
          "author": "tongEntong",
          "text": "Jupyter notebook till death do us apart!",
          "score": 1,
          "created_utc": "2026-02-25 11:39:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7frw5y",
          "author": "snowbirdnerd",
          "text": "I don't do machine learning on my own time. If I am doing personal projects it's probably web apps in JavaScript. ",
          "score": 1,
          "created_utc": "2026-02-26 01:40:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7hrdgr",
          "author": "GlitterClawsss",
          "text": "Same as you",
          "score": 1,
          "created_utc": "2026-02-26 10:41:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ivold",
          "author": "RandomNameqaz",
          "text": "Virtual Environment Manager + package manager: \nI mainly use uv for python. I might occasionally use pixi for conda environments (works like uv, it just has system packages too). \nI like both of these as they don't necessarily depend on your HPC admins. \n\nContainers: \nDocker mainly. Some work with Apptainer. \n\nServer Orchestration/Automation: \nI mainly do research, so I don't really need much automation. \nBut I use SLURM to execute and parallelise my code. \n\nIDE:\nPositron and VSCode. I would prefer to Positron only, but it is not mature enough yet for everything. \n\nVersion control:\nGit\n\nNotebook tools:\nI prefer not to use notebooks at all. For development, do use the jupyter interactive window (VSCode). I feel like my code gets closer to the final version of it. \n\nPrimary use-case: \nMLE research. \n\nHow my setup helps...:\nPositron's connections pane helps with viewing tables etc. of the databases I connect to in R or python. \n\nHow do you manage dependencies? Do you use containers instead?\nI use UV virtual environments if the dependencies are simply specific versions of python packages. This is enough 95% of the time. For the rest, I use docker ontainers if it is anything newer. If my colleagues use conda environments, I might  either use conda/mamba if we collaborate on the project, else I will use pixi if it is just myself looking at it.\n\nDo you do personal projects in a cloud/distributed environment?\nIf it is work related I use SLURM. I haven't needed HPC environments for my personal projects yet. ",
          "score": 1,
          "created_utc": "2026-02-26 15:01:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7w1l7y",
          "author": "the-ai-scientist",
          "text": "Current setup that's been stable for a while:\n\n- **Env manager**: uv for everything now. Replaced conda entirely. Dependency resolution is fast enough that I actually don't dread it anymore.\n- **IDE**: VS Code with Pylance + Jupyter extension for notebooks, Cursor when I'm doing heavier AI-assisted development\n- **Containerization**: Docker for anything I need to share or deploy, otherwise just uv venvs locally\n- **Version control**: Git + GitHub, pre-commit hooks with ruff for formatting/linting\n- **Notebooks**: JupyterLab locally, but increasingly just VS Code notebooks which have gotten really good\n\nThe conda-solver-freezing problem you described is exactly why I switched to uv. The Anaconda ecosystem made sense 5 years ago when it was the only thing that reliably handled scientific Python dependencies, but it's carrying a lot of weight now.\n\nFor the ADHD/subscription-free angle: uv + Docker + GitHub is completely FOSS, locally reproducible, and maps well to what production MLOps environments expect. No cloud credits needed to stay sharp.",
          "score": 1,
          "created_utc": "2026-02-28 15:11:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7wbzjm",
          "author": "Express_Language_715",
          "text": "nice",
          "score": 1,
          "created_utc": "2026-02-28 16:04:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o83j4if",
          "author": "NoobZik",
          "text": "What do you use?\n- Virtual Environment Manager: UV is the way to go, many french company are now requiring to use UV as a venv manager. Plus it save some money spent at building docker image while in a CI/CD setup.\n\n- Package Manager : Currently setuptools (i might not understand the meaning of package manager)\n\nContainerization : Cloud Run / Docker\n\nServer Orchestration/Automation (if used): I rely on Google Cloud Build + Airflow\n\nIDE or text editor :\nDepends, PyCharm and Zed (With astral/ty and astral/ruff enabled)\n\nVersion/Source control : Git\n\nNotebook tools :\nNone, until I discovered Marimo, which is the replacement of jupy-shit notebook since it can be both reproductible and versionable notebook. No more yelling at Data Scientist for not putting their code as a function.\n\nPipeline : Kedro. I need new members (data or not) of the team to understand quickly how to navigate into a production-ready project by setting some standards on directory tree, and some pipeline to make the code reproduction as easy as `uv run kedro run`",
          "score": 1,
          "created_utc": "2026-03-01 18:48:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o83jol9",
          "author": "latent_threader",
          "text": "For personal projects, just keep your Python setup simple. Poetry handles dependencies well, and Docker ensures isolation and reproducibility. Use VS Code for a lightweight yet feature-rich editor, and Git for version control. It's best to keep it modular and avoid overcomplicating things unless necessary.",
          "score": 1,
          "created_utc": "2026-03-01 18:51:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o77aepb",
          "author": "OmnipresentCPU",
          "text": "Claude code docker and that’s it. Ipynb is going the way of the dinosaur for me personally.",
          "score": 1,
          "created_utc": "2026-02-24 20:31:31",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rh3svu",
      "title": "Time Series Themed Children’s Book",
      "subreddit": "datascience",
      "url": "https://i.redd.it/7wuuzhr5v8mg1.jpeg",
      "author": "Clicketrie",
      "created_utc": "2026-02-28 14:19:04",
      "score": 42,
      "num_comments": 15,
      "upvote_ratio": 0.91,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Analysis",
      "permalink": "https://reddit.com/r/datascience/comments/1rh3svu/time_series_themed_childrens_book/",
      "domain": "i.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "o7vzbxm",
          "author": "Lead-Radiant",
          "text": "Can I use it to teach myself more about what I do?",
          "score": 18,
          "created_utc": "2026-02-28 14:59:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7w04ak",
              "author": "Clicketrie",
              "text": "If you got drunk it might be a good reminder about what you do. Solid reminder.",
              "score": 9,
              "created_utc": "2026-02-28 15:04:04",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7w43h2",
                  "author": "Lead-Radiant",
                  "text": "Ringing endorsement! congrats on reaching me on LI and reddit btw.",
                  "score": 2,
                  "created_utc": "2026-02-28 15:25:03",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7w30we",
          "author": "ArcticGlaceon",
          "text": "Can't wait to teach my kids about ARIMA models and how to test for stationarity.",
          "score": 11,
          "created_utc": "2026-02-28 15:19:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7x6pci",
          "author": "Helping_buddy82",
          "text": "Awsome this is what i was looking for my 5 year old cousin, now he can finally understand my work and stop pressing space bar 🙂. fun aside looks good to me in todays age exposing them to good knowledge is essential.",
          "score": 3,
          "created_utc": "2026-02-28 18:38:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7z6y2v",
          "author": "jayeshrathore",
          "text": "Interesting, love itt!!",
          "score": 2,
          "created_utc": "2026-03-01 01:16:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7z7th5",
              "author": "Clicketrie",
              "text": "Thank you!",
              "score": 2,
              "created_utc": "2026-03-01 01:21:21",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7vumqg",
          "author": "alexchatwin",
          "text": "Did you write it?",
          "score": 1,
          "created_utc": "2026-02-28 14:33:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7vvdyv",
              "author": "Clicketrie",
              "text": "Yes I did.  I also wrote “Susie’s School Bus Solution” about a computer vision system I built for my home to detect the school bus.",
              "score": 7,
              "created_utc": "2026-02-28 14:37:54",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7vvzgi",
                  "author": "alexchatwin",
                  "text": "Eep £20 to deliver to the UK.. I’ll put it on my ‘maybe’ list\n\nGood job tho! They’re never too young to start collecting data properly!",
                  "score": 2,
                  "created_utc": "2026-02-28 14:41:18",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o86qd9s",
          "author": "Helpful_ruben",
          "text": "Error generating reply.",
          "score": 1,
          "created_utc": "2026-03-02 06:12:50",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rcft6y",
      "title": "Large Language Models for Mortals: A Practical Guide for Analysts",
      "subreddit": "datascience",
      "url": "https://www.reddit.com/r/datascience/comments/1rcft6y/large_language_models_for_mortals_a_practical/",
      "author": "andy_p_w",
      "created_utc": "2026-02-23 12:12:15",
      "score": 37,
      "num_comments": 9,
      "upvote_ratio": 0.71,
      "text": "Shameless promotion -- I have recently released a book, [Large Language Models for Mortals: A Practical Guide for Analysts](https://crimede-coder.com/blogposts/2026/LLMsForMortals).\n\nhttps://preview.redd.it/7t71ql8ek9jg1.png?width=3980&format=png&auto=webp&s=1870a49ec6030cad49c364062c02cf5da166993f\n\nThe book is focused on using foundation model APIs, with examples from OpenAI, Anthropic, Google, and AWS in each chapter. The book is compiled via Quarto, so all the code examples are up to date with the latest API changes. The book includes:\n\n* Basics of LLMs (via creating a small predict the next word model), and some examples of calling local LLM models from huggingface (classification, embeddings, NER)\n* An entry chapter on understanding the inputs/outputs of the API. This includes discussing temperature, reasoning/thinking, multi-modal inputs, caching, web search, multi-turn conversations, and estimating costs\n* A chapter on structured outputs. This includes k-shot prompting, parsing JSON vs using pydantic, batch processing examples for all model providers, YAML/XML examples, evaluating accuracy for different prompts/models, and using log-probs to get a probability estimate for a classification\n* A chapter on RAG systems: Discusses semantic search vs keyword via plenty of examples. It also has actual vector database deployment patterns, with examples of in-memory FAISS, on-disk ChromaDB, OpenAI vector store, S3 Vectors, or using DB processing directly with BigQuery. It also has examples of chunking and summarizing PDF documents (OCR, chunking strategies). And discusses precision/recall in measuring a RAG retrieval system.\n* A chapter on tool-calling/MCP/Agents: Uses an example of writing tools to return data from a local database, MCP examples with Claude Desktop, and agent based designs with those tools with OpenAI, Anthropic (showing MCP fixing queries), and Google (showing more complicated directed flows using sequential/parallel agent patterns). This chapter I introduce LLM as a judge to evaluate different models.\n* A chapter with screenshots showing LLM coding tools -- GitHub Copilot, Claude Code, and Google's Antigravity. Copilot and Claude Code I show examples of adding docstrings and tests for a current repository. And in Claude Code show many of the current features -- MCP, Skills, Commands, Hooks, and how to run in headless mode. Google Antigravity I show building an example Flask app from scratch, and setting up the web-browser interaction and how it can use image models to create test data. I also talk pretty extensively\n* Final chapter is how to keep up in a fast paced changing environment.\n\nTo preview, the first 60+ pages [are available here](https://crimede-coder.com/blogposts/2026/LLMsForMortals). Can purchase worldwide in [paperback](https://crimede-coder.com/cdcstore/product/large-language-models-for-mortals/) or [epub](https://crimede-coder.com/cdcstore/product/large-language-models-for-mortals-a-practical-guide-for-analysts-with-python/). Folks can use the code LLMDEVS for 50% off of the epub price.\n\nI wrote this because the pace of change is so fast, and these are the skills I am looking for in devs to come work for me as AI engineers. It is not rocket science, but hopefully this entry level book is a one stop shop introduction for those looking to learn.",
      "is_original_content": false,
      "link_flair_text": "AI",
      "permalink": "https://reddit.com/r/datascience/comments/1rcft6y/large_language_models_for_mortals_a_practical/",
      "domain": "self.datascience",
      "is_self": true,
      "comments": [
        {
          "id": "o7orb0i",
          "author": "NeedleworkerLumpy907",
          "text": "e hype but the examples from openai and huggingface look actually useful, might have to check it out",
          "score": 2,
          "created_utc": "2026-02-27 12:02:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o73fsa6",
          "author": "Top-Still-4669",
          "text": "I just finish reading you free page u gave. ngl its insightful and easy to understand. I'm new to this and on my learning-phases. I might stumble part on your book as my reference since so many nonsense information in internet. If I may ask just for short, what would you recommended someone like me, who learning by myself. what should I do to compete in the industry.",
          "score": 4,
          "created_utc": "2026-02-24 06:47:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7u9kx4",
              "author": "Helpful_ruben",
              "text": "u/Top-Still-4669 Error generating reply.",
              "score": 1,
              "created_utc": "2026-02-28 06:47:01",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o75fxya",
              "author": "andy_p_w",
              "text": "So this book to be clear you need to have a basic understanding of python coding first. If you do not have that python experience, I have another entry level python book, [https://crimede-coder.com/blogposts/2024/PythonDataScience](https://crimede-coder.com/blogposts/2024/PythonDataScience) \n\n\n\n",
              "score": 1,
              "created_utc": "2026-02-24 15:30:48",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7hials",
                  "author": "Top-Still-4669",
                  "text": "Yup I about to get that one",
                  "score": 2,
                  "created_utc": "2026-02-26 09:15:43",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o73xore",
              "author": "[deleted]",
              "text": "[removed]",
              "score": -2,
              "created_utc": "2026-02-24 09:33:57",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o86liyu",
          "author": "maidonglao",
          "text": "I have been so resistent to LLMs but I guess I should eventually learn how they work. Thank you.",
          "score": 1,
          "created_utc": "2026-03-02 05:32:58",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rejrgc",
      "title": "Spark SQL refresher suggestions?",
      "subreddit": "datascience",
      "url": "https://www.reddit.com/r/datascience/comments/1rejrgc/spark_sql_refresher_suggestions/",
      "author": "Tamalelulu",
      "created_utc": "2026-02-25 17:31:10",
      "score": 34,
      "num_comments": 24,
      "upvote_ratio": 0.9,
      "text": "I just joined a a company that uses Databricks. It's been a while since I've used SQL intensively and think I could benefit from a refresher. My understanding is that Spark SQL is slightly different from SQL Server. I was wondering if anyone could suggest a resource that would be helpful in getting me back up to speed.\n\n  \nTIA",
      "is_original_content": false,
      "link_flair_text": "Education",
      "permalink": "https://reddit.com/r/datascience/comments/1rejrgc/spark_sql_refresher_suggestions/",
      "domain": "self.datascience",
      "is_self": true,
      "comments": [
        {
          "id": "o7d5m2u",
          "author": "_Useless_Scientist_",
          "text": "Are they only using SQL? Databricks offers a wide range of programming languages and we use a mix of PySpark, SQL and Python.\nDatabricks also has courses for their specific paths.\nSo you might want to have a look there (some should be free if I remember correctly)",
          "score": 17,
          "created_utc": "2026-02-25 17:55:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7lz6tl",
              "author": "Tamalelulu",
              "text": "Depending on job function people seem to be leaning primarily on either Python or SQL. I'm not sure which my job will lend itself more to just yet but it sooooounds like I'll probably be using SQL more. I haven't heard of anyone using pyspark just yet and most people seem to be unaware of the Spark/Databricks connection. \n\n\nThe onboarding process here is lengthy (like 90 days) and to be quite frank the organizational topography and domain expertise bit is looking to be a nightmare. So I figure at minimum I want to take some refreshers in regards to the tech stack. ",
              "score": 1,
              "created_utc": "2026-02-26 23:55:49",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7nuc59",
                  "author": "_Useless_Scientist_",
                  "text": "In that case having a refresher, sounds like a good idea!\nKeep in mind that Databricks is a very powerful tool, still growing insanely fast. So check their blogs, their course material and if you're allowed speak to your assigned Databricks team.",
                  "score": 1,
                  "created_utc": "2026-02-27 07:07:37",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7h3a8m",
          "author": "patternpeeker",
          "text": "spark sql syntax is not the hard part. the real shift on databricks is thinking about distributed execution, especially joins and shuffles. i would skim the spark docs for dialect quirks, then focus on explain plans to rebuild intuition.",
          "score": 9,
          "created_utc": "2026-02-26 06:55:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7nukkt",
              "author": "_Useless_Scientist_",
              "text": "Yes, using Spark in the right way can be challenging!\nHaving a look at how Spark executes workloads and trying to understand it, for sure will help.\nAlthough it probably only is needed for a small amount of queries, as it is already heavily optimized for \"average\" users.",
              "score": 1,
              "created_utc": "2026-02-27 07:09:41",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7d2ca0",
          "author": "DelayedPot",
          "text": "I used data lemur to brush up on my sql. I’m more of a brute force my way into learning kind of person so the practice problems on the platform were helpful!",
          "score": 4,
          "created_utc": "2026-02-25 17:40:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7fxcvf",
          "author": "Sufficient_Meet6836",
          "text": ">My understanding is that Spark SQL is slightly different from SQL Server.\n\nYup it's slightly different. Databricks SQL is ANSI standard SQL with quality of life improvements. Like `select * (except ...)`. Most common differences for me from SQL Server have been `select * from tbl limit 5` instead of `select top 5 * ...`, and you can't do `new_column = blah blah blah`. You have to use `blah blah blah as new_column`. It was a really easy transition",
          "score": 3,
          "created_utc": "2026-02-26 02:12:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7e9oal",
          "author": "outofband",
          "text": "Use the AI assistant to make you some queries that you need, start from there",
          "score": 2,
          "created_utc": "2026-02-25 20:58:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7f4041",
          "author": "sonicking12",
          "text": "AI, my friend",
          "score": 2,
          "created_utc": "2026-02-25 23:27:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7dimcd",
          "author": "sickomoder",
          "text": "i think stratascratch supports spark sql",
          "score": 1,
          "created_utc": "2026-02-25 18:53:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7eeh4d",
          "author": "repeat4EMPHASIS",
          "text": "customer-academy.databricks dot com /learn\n\nThe second carousel on the page is for free self-paced trainings",
          "score": 1,
          "created_utc": "2026-02-25 21:21:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7h0v67",
          "author": "WillingAstronomer",
          "text": "The book Spark: A definitive guide is great!",
          "score": 1,
          "created_utc": "2026-02-26 06:35:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7h3t64",
          "author": "AccordingWeight6019",
          "text": "I was in a similar spot before, and honestly, what helped most was just doing side by side comparisons of normal SQL versus Spark SQL behavior while practicing. Spark feels familiar at first, but things like distributed execution, lazy evaluation, and how joins/shuffles behave change how you *think* about queries.\n\nThe  databricks docs are surprisingly practical, and I’d also recommend just working through small datasets in notebooks to relearn patterns like window functions and aggregations in a distributed context. A quick hands on refresher tends to stick way better than pure tutorials.",
          "score": 1,
          "created_utc": "2026-02-26 07:00:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7hlezj",
          "author": "GlitterClawsss",
          "text": "Chatgpt",
          "score": 1,
          "created_utc": "2026-02-26 09:46:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7j2iuc",
          "author": "Sweatyfingerzz",
          "text": "I had to make the jump to Databricks a while back and honestly, reading through the official Spark docs is a fantastic cure for insomnia. The core logic is exactly what you're used to, but the array handling, date functions, and specific window function syntax get a little funky compared to SQL Server.\n\nHonestly, the fastest way to get back up to speed isn't a structured course or a textbook. My \"refresher\" was just keeping Claude (or Cursor if you're working locally) open on my second monitor. Whenever I had a standard SQL Server query in my head that was throwing errors in Databricks, I’d just paste it in and tell the AI, \"Translate this to Spark SQL and explain the syntax differences.\"\n\nIt basically acts as an interactive tutor. You'll pick up on all the specific Databricks quirks (like `EXPLODE` for arrays or specific timestamp casting) organically within your first few days on the job, which beats sitting through a 4-hour Udemy video by a mile.",
          "score": 1,
          "created_utc": "2026-02-26 15:33:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7ly0s1",
              "author": "Tamalelulu",
              "text": "Yeah, I'm planning on leaning on Claude a bit for this one for sure! ",
              "score": 2,
              "created_utc": "2026-02-26 23:49:19",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7ly8zd",
          "author": "Sofi_LoFi",
          "text": "PySpark is the way",
          "score": 1,
          "created_utc": "2026-02-26 23:50:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7mncxs",
          "author": "Helpful_ruben",
          "text": "Error generating reply.",
          "score": 1,
          "created_utc": "2026-02-27 02:12:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7o5q7w",
          "author": "holdenk",
          "text": "I’m biased, but the 2nd edition of learning spark is probably a good idea for getting an refresher on how Spark works and is different than a database etc.",
          "score": 1,
          "created_utc": "2026-02-27 08:51:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7sitnl",
          "author": "the-ai-scientist",
          "text": "The key differences from SQL Server to internalize quickly: Spark SQL is distributed-first, so window functions and aggregations that feel lightweight in SQL Server can be expensive in Spark depending on partitioning. Also no rownum/identity columns — use row_number() over a window instead.\n\nFor resources: the official Databricks SQL documentation is actually quite good and covers the dialect specifics. The Databricks Academy free courses on Lakehouse Fundamentals are worth an hour of your time for the mental model shift. Once you have that, most standard SQL translates directly.\n\nOne practical tip: use EXPLAIN on your queries early on — seeing the physical plan helps you understand why certain queries are slow in ways that don't matter in SQL Server.",
          "score": 1,
          "created_utc": "2026-02-27 23:44:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7wby6v",
          "author": "Express_Language_715",
          "text": "nice",
          "score": 1,
          "created_utc": "2026-02-28 16:04:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7fvseg",
          "author": "Great_Purpose7024",
          "text": "three tier process: \n- human\n- ai\n- sql\n\nlearn to use ai as the first class interface. pay for claude pro. your welcome",
          "score": -1,
          "created_utc": "2026-02-26 02:03:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o84dicf",
              "author": "forkman3939",
              "text": "Don't know why your down voted. This is how I learned Scala and spark in general. ",
              "score": 1,
              "created_utc": "2026-03-01 21:21:58",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7h5yoe",
          "author": "Unlucky-Papaya3676",
          "text": "\nEveryone’s talking about bigger models… but almost no one talks about cleaning the data properly.\nThere’s this DCB (Dynamic Content Book) tool that actually sanitizes and intelligently chunks books specifically for LLM training. It turns messy raw text into structured, model-ready data.\nThis feels like a seriously underrated part of the AI pipeline.\nHere’s the Kaggle notebook:\nhttps://www.kaggle.com/code/tanmaypotdar/llm-book-sanitizer-structured-cleaning-chunks�",
          "score": -4,
          "created_utc": "2026-02-26 07:19:08",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rcv1w9",
      "title": "What is going on at AirBnB recruiting??",
      "subreddit": "datascience",
      "url": "https://www.reddit.com/r/datascience/comments/1rcv1w9/what_is_going_on_at_airbnb_recruiting/",
      "author": "br0monium",
      "created_utc": "2026-02-23 21:47:40",
      "score": 20,
      "num_comments": 15,
      "upvote_ratio": 0.71,
      "text": "Most recently I had a recruiter TEXT MY FATHER about a role at AirBnB. Then he tried to add me and message me on linkedin. I have no idea how he got one of my family members numbers (I mean he probably bought data froma broker, but this has never happened before).\n\nThe professionalism in recruiters has definitely degraded in the past few years, but I've noticed shenanigans like this with AirBnB every 3 to 6 months. Each hiring season I'll see several contract roles at AirBnB posted at the same time with different recruiting firms. Job description is almost identical. After we get in touch, almost all will ghost me. About 2 will set up a call. Recruiter call goes well, they say theyll connect me to hiring manager and then disappear. The first couple times I followed up a few days later, then a week, another week, two weeks after that... Nothing. \n\nMeta and google are doing this a bit too, but AirBnB is just constant with this nonsense. I don't even click on their job postings or interact with recruiters for them anymore. Is this a scam? Are they having trouble with hiring freezes or posting ghost jobs? Can anyone shed some light on this or confirm having a similar experience?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/datascience/comments/1rcv1w9/what_is_going_on_at_airbnb_recruiting/",
      "domain": "self.datascience",
      "is_self": true,
      "comments": [
        {
          "id": "o711dzs",
          "author": "Single_Vacation427",
          "text": "Staffing agencies that work with contracts do not work for AirBnB and many are total weirdos because they work on commission. There is also a deadline for submitting people for a contract which makes it time sensitive. If you are not hearing back, they probably did not select your resume. Most of the time they pick people who already worked for the company because as a temp, you barely have onboarding.",
          "score": 38,
          "created_utc": "2026-02-23 21:55:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o71625s",
              "author": "br0monium",
              "text": "I hear you. AirBnB is the only one i've repeatedly seen using SEVERAL vendors for seemingly one role (same title, same location, same pay, similar or same JD). Maybe its just confirmation bias after having most of my initial interactions with AirBnB when I first decided to be open to contract roles. I have been super on top of sorting listings by most recent and responding quickly due to how brutal things have been. Already having temps or previous FTEs lined up does make sense. There have definitely been months at a time where all the roles posted at big companies were already eliminated or filled internally.",
              "score": 2,
              "created_utc": "2026-02-23 22:18:23",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o718498",
                  "author": "Single_Vacation427",
                  "text": "They all do this.",
                  "score": 3,
                  "created_utc": "2026-02-23 22:28:50",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o711ski",
          "author": "Old_Cry1308",
          "text": "same crap with google contractors, multiple vendors, same jd, vanish after screen, hiring scene is terrible rn",
          "score": 8,
          "created_utc": "2026-02-23 21:57:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o716q17",
              "author": "br0monium",
              "text": "yeah google and meta have also been using more low quality recruiting, but none of them have found my retired parents mobile number and somehow connected it to me. I'm mostly wondering if these are scams or just so low quality that I shouldnt bother with them at all. Anything to narrow the scope in this job market.\n\nEDIT: i.e. Like im concerned to even reply to this particular guy now because that would just confirm that the number has some connection to me. It's like how if you answer spam calls, they call more even if you dont get scammed.",
              "score": 6,
              "created_utc": "2026-02-23 22:21:42",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7hfm6u",
                  "author": "muangalifu",
                  "text": "Meta too has the worst low quality indian recruiting companies that just flood your linked in within mins of the same day with the same req. Such trash.",
                  "score": 1,
                  "created_utc": "2026-02-26 08:49:28",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o73lqcm",
          "author": "AccordingWeight6019",
          "text": "Honestly, this sounds less like a scam and more like messy vendor recruiting plus the pipeline farming. Big companies often open evergreen contract roles through multiple agencies at once, so recruiters race to source candidates even when headcount isn’t actually approved yet, which explains the ghosting. The family member contact is likely data broker scraping, and it’s a red flag for that specific recruiter, not necessarily the company itself.",
          "score": 3,
          "created_utc": "2026-02-24 07:40:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o735oub",
          "author": "patternpeeker",
          "text": "texting a family member crosses a line. that is either reckless sourcing or bad data practices. the multiple identical contract posts usually mean the req is sprayed to agencies while headcount is uncertain. in big orgs, roles can be “open” on paper but frozen in reality, so recruiters stall and disappear.",
          "score": 2,
          "created_utc": "2026-02-24 05:24:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o740vzb",
          "author": "unimtur",
          "text": "honestly this tracks, the contract recruiting ecosystem is just broken at this point",
          "score": 2,
          "created_utc": "2026-02-24 10:04:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o760rkj",
          "author": "EndlessDysthymia",
          "text": "Are there any recruiting agencies that aren’t shit?",
          "score": 2,
          "created_utc": "2026-02-24 17:04:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o72jp52",
          "author": "datascientistdude",
          "text": "I work at Airbnb. We neither have a hiring freeze nor do we post ghost jobs. We certainly wouldn't go find info about your father. We have plenty of qualified applicants for every role. Our recruiters in general are very professional.\n\nEverything you've experienced suggests you've been interacting with shady third party recruiting firms, of which I know very little about.",
          "score": 4,
          "created_utc": "2026-02-24 02:56:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7110a0",
          "author": "emt139",
          "text": "Is this happening for FTE roles? Because I’ve had good experience with them for FTE roles but I get a ton of messages from offshore recruiters for contract roles. ",
          "score": 1,
          "created_utc": "2026-02-23 21:53:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o714u3x",
              "author": "br0monium",
              "text": "id have to double check, because I have applied for at least one FTE role there, but i dont remember if I got a similar run around and/or if i went through a recruiter.",
              "score": 0,
              "created_utc": "2026-02-23 22:12:14",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7hri97",
          "author": "GlitterClawsss",
          "text": "Weird",
          "score": 1,
          "created_utc": "2026-02-26 10:43:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o814hu0",
          "author": "Helpful_ruben",
          "text": "Error generating reply.",
          "score": 1,
          "created_utc": "2026-03-01 10:12:54",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1reqajk",
      "title": "Where should Business Logic live in a Data Solution?",
      "subreddit": "datascience",
      "url": "https://leszekmichalak.substack.com/p/where-should-business-logic-live",
      "author": "Astherol",
      "created_utc": "2026-02-25 21:21:11",
      "score": 19,
      "num_comments": 12,
      "upvote_ratio": 0.86,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/datascience/comments/1reqajk/where_should_business_logic_live_in_a_data/",
      "domain": "leszekmichalak.substack.com",
      "is_self": false,
      "comments": [
        {
          "id": "o7gyofm",
          "author": "MorriceGeorge",
          "text": "Business logic in a data solution should live as close as possible to the layer that owns the business meaning, which is typically in the transformation layer of the data platform. \n\nIn modern architectures, this means encoding business rule inside curated, version-controlled data models. \n\nIt should not live in BI dashboards where it becomes duplicated, inconsistent, and hard to govern.",
          "score": 15,
          "created_utc": "2026-02-26 06:16:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7hzjjd",
              "author": "Astherol",
              "text": "Yes, I get your point that the business logic shouldnt be redefined one again in BI, but sometimes 5% of it has to be.\n\nBTW:  \nBusiness logic in a data solution should live as close as possible to the layer that owns the business meaning, which is typically in the transformation layer of the data platform. - its so well written that I would gladly steal it from you",
              "score": 2,
              "created_utc": "2026-02-26 11:51:13",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7egjby",
          "author": "chicky-poo-pee-paw",
          "text": "I don’t think those two words go together",
          "score": 10,
          "created_utc": "2026-02-25 21:30:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7ehinf",
              "author": "Astherol",
              "text": "But why?",
              "score": 5,
              "created_utc": "2026-02-25 21:35:13",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7ejdiz",
                  "author": "Satanwearsflipflops",
                  "text": "This exchange feeds my soul",
                  "score": 7,
                  "created_utc": "2026-02-25 21:43:48",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7hravz",
          "author": "GlitterClawsss",
          "text": "Interesting",
          "score": 2,
          "created_utc": "2026-02-26 10:41:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7hzkuf",
              "author": "Astherol",
              "text": "thanks\n\n",
              "score": 1,
              "created_utc": "2026-02-26 11:51:30",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7sc37n",
          "author": "the-ai-scientist",
          "text": "Thanks for sharing this — detailed interview post-mortems are genuinely valuable and rare. A few things stand out: the shift toward 'show me you can work with ambiguous product problems' rather than pure technical depth reflects something real about what senior DS roles actually involve day-to-day.\n\nOne pattern I've noticed: companies that ask strong product sense questions in final rounds tend to have healthier data cultures, because it signals they expect data scientists to influence decisions, not just report numbers. Could be a useful filter when evaluating offers.",
          "score": 2,
          "created_utc": "2026-02-27 23:05:45",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rfc7bt",
      "title": "New video tutorial: Going from raw election data to recreating the NYTimes \"Red Shift\" map in 10 minutes with DAAF and Claude Code. With fully reproducible and auditable code pipelines, we're fighting AI slop and hallucinations in data analysis with hyper-transparency!",
      "subreddit": "datascience",
      "url": "https://www.reddit.com/r/datascience/comments/1rfc7bt/new_video_tutorial_going_from_raw_election_data/",
      "author": "brhkim",
      "created_utc": "2026-02-26 14:52:48",
      "score": 18,
      "num_comments": 2,
      "upvote_ratio": 0.71,
      "text": "[DAAF](https://github.com/DAAF-Contribution-Community/daaf) (the Data Analyst Augmentation Framework, my open-source and \\*forever-free\\* data analysis framework for Claude Code) was designed from the ground-up to be a domain-agnostic force-multiplier for data analysis across disciplines -- and in [my new video tutorial this week](https://www.youtube.com/watch?v=G5uKSlI6jls), I demonstrate what that actually looks like in practice!\n\nhttps://preview.redd.it/avnvxd9r8rlg1.png?width=1280&format=png&auto=webp&s=c767bee508cb91a6a753652395acbfd09f108551\n\nI launched the Data Analyst Augmentation Framework last week with 40+ education datasets from the Urban Institute Education Data Portal as its main demo out-of-the-box, but I purposefully designed its architecture to allow anyone to bring in and analyze their own data with almost zero friction.\n\nIn my newest video, I run through the complete process of teaching DAAF how to use election data from the [MIT Election Data and Science Lab](https://dataverse.harvard.edu/dataset.xhtml?persistentId=doi:10.7910/DVN/VOQCHQ) (via Harvard Dataverse) to almost perfectly recreate one of my favorite data visualizations of all time: [the NYTimes \"red shift\" visualization](https://www.nytimes.com/interactive/2024/11/06/us/politics/presidential-election-2024-red-shift.html) tracking county-level vote swings from 2020 to 2024. In **less than 10 minutes** of active engagement and only a few quick revision suggestions, I'm left with:\n\n* A shockingly faithful recreation of the NYTimes visualization, both static \\*and\\* interactive versions\n* An in-depth research memo describing the analytic process, its limitations, key learnings, and important interpretation caveats\n* A fully auditable and reproducible code pipeline for every step of the data processing and visualization work\n* And, most exciting to me: A modular, self-improving data documentation reference \"package\" (a Skill folder) that allows anyone else using DAAF to analyze this dataset as if they've been working with it for years\n\nThis is what DAAF's extensible architecture was built to do -- facilitate the rapid but rigorous ingestion, analysis, and interpretation of \\*any\\* data from \\*any\\* field when guided by a skilled researcher. This is the community flywheel I’m hoping to cultivate: the more people using DAAF to ingest and analyze public datasets, the more multi-faceted and expansive DAAF's analytic capabilities become. We've got over 130 unique installs of DAAF as of this morning -- join the ecosystem and help build this inclusive community for rigorous, AI-empowered research!\n\nIf you haven't heard of DAAF, learn more about my vision for DAAF, what makes DAAF different from other attempts to create LLM research assistants, what DAAF currently can and cannot do as of today, how you can get involved, and how you can get started with DAAF yourself at the GitHub page:\n\n[https://github.com/DAAF-Contribution-Community/daaf](https://github.com/DAAF-Contribution-Community/daaf)\n\n**Bonus**: The Election data Skill is now part of the core DAAF repository. Go use it and play around with it yourself!!!",
      "is_original_content": false,
      "link_flair_text": "AI",
      "permalink": "https://reddit.com/r/datascience/comments/1rfc7bt/new_video_tutorial_going_from_raw_election_data/",
      "domain": "self.datascience",
      "is_self": true,
      "comments": [
        {
          "id": "o7xigmk",
          "author": "latent_threader",
          "text": "Gods gift. Seriously you'll find all types of obscure formats and missing data. If you can make logical sense of that you can clean any dataset your business throws at you.",
          "score": 2,
          "created_utc": "2026-02-28 19:38:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7xqd1h",
              "author": "brhkim",
              "text": "Hahaha that's definitely the idea -- I really think that just the data profiling tool I've provided has a lot of value, holding aside everything else.\n\nIt won't be perfect, but having an assistant that can reasonably go through and be judicious about logging those sorts of things for future data use or later cleaning steps is just an enormous value-add. And then the fact that it gets better with every project use as it uncovers more and more idiosyncrasies I think is HUGE.",
              "score": 1,
              "created_utc": "2026-02-28 20:19:21",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1rg2ssk",
      "title": "Central Limit Theorem in the wild — what happens outside ideal conditions",
      "subreddit": "datascience",
      "url": "https://medium.com/@dominikmiskiewicz/central-limit-theorem-in-the-wild-what-happens-outside-ideal-conditions-4945b2a86d66?postPublishedType=repub",
      "author": "Grapphie",
      "created_utc": "2026-02-27 10:08:15",
      "score": 11,
      "num_comments": 0,
      "upvote_ratio": 0.73,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Statistics",
      "permalink": "https://reddit.com/r/datascience/comments/1rg2ssk/central_limit_theorem_in_the_wild_what_happens/",
      "domain": "medium.com",
      "is_self": false,
      "comments": []
    }
  ]
}